[
    [
        {
            "content": "Barakamon was a series that gave the calligrapher  Handa Sei a journey through self discovery on an island village where he was able to create a form of calligraphy that he felt comfortable and happy with.  It was a show that garnered a decent following and had a relatively lasting popularity during 2014.  And so, to remind us that that series existed, we have Handa-kun, a look into his earlier days in a comedy gag series that...should've never been made.\r\nStory: As previously said before, Handa-kun is a series about Handa Sei in his school days, where he was still as awkward anduncomfortable as he was in Barakamon (probably even more so), thinking that literally everyone in his school hated him when in reality...he's considered as a god walking among them and that anything he says or does is law.  As a result, there's a misconception between Handa and the rest of the school (except Kawafuji and maybe Yukio) and thus, 'hilarity ensues'.  \\n\\n\r\nAlright, right out of the gate here, I'll tell you the thing about Handa-kun.  It's.  One.  Long.  Running.  Joke.  The entire runtime of the series is dedicated to some member of the cast (usually new members) coming into contact with the 'divine entity' known as Handa-kun, only to be swayed by his words (as well as taking them in the COMPLETELY wrong way) and changing their entire perspective of life before becoming indoctrinated into the Cult of Handa.  That's it.  \\n\\n\r\nAt first, this seems kinda amusing.  For the first few episodes, the awkwardness and overall comedy of the series is pretty funny because of how utterly ridiculous it is.  Then it doesn't become funny.  Then it REALLY doesn't become funny.  Then it becomes eye-twitchingly bad.  Good things come in small doses, and when you don't do that and instead use the exact same material over and over again, it becomes unbearable to watch.  Handa-kun is exactly that.  As the episodes run by, you'll come to expect the same things episode after episode but with increasing ridiculous cringeworthy scenes and even stranger characters, ultimately creating a show that's sad and difficult to watch.  (Devoting the entire school festival to ONE student?  Changing the curriculum to adhere to what he says accidentally?  Making something based on someone without their consent?  How can ANY of these situations be considered comedy?!)\\n\\n\r\nBy the end of the series, everything does get resolved...in some way, but not enough to salvage this series.  Admittedly, there are people who do enjoy this kind of comedy, but just using one joke for what equates to about six hours worth of material is not the way to write a comedy series, especially when the only gag you have is to torture some poor misunderstood individual with daily occurrences that he doesn't understand and is terrified about.  \\n\\n\r\nOverview:\\n\r\n-  The entire series is one long-running joke\\n\r\n-  Concept gets tired FAST\\n\r\n-  Episode writing gets worse and worse with every passing episode\\n\\n\r\nCharacters: Oh boy, where do I start with this one?  Characters, or should I say mentally challenged individuals are probably the number one reason why I despise this series and think that it's absolutely terrible.\\n\\n\r\nFirst it's Handa Sei.  Now, first off, we don't actually get much of Handa.  Yes, the title character of the series probably gets the least amount of screentime out of any of the main characters in this series.  In any case, Handa Sei is the same awkward and nervous individual that you saw in Barakamon, just de-aged about 5-7 years.  The main reason for Handa's existence is just to be a figurehead of reasoning for every other character's delusions and obsessions.  The dynamic of 'I'm hated but in reality, everyone loves me' gets old really fast, and Handa really doesn't do much in the series aside from cower away and wall himself off from the rest of the school because he feels alone and unwanted when in reality, that's not really the case.\\n\\n\r\nThen there're the nutjobs.  I'm not even going to separate and talk about them individually; the other characters are all nutjobs.  You have the Handa Force consisting of a delinquent, a bishonen, and the stereotypical glasses character who say they're Handa's friends when in reality, they all have barely any understanding of who Handa Sei is as a person, you have the girl who sits next to him who becomes a stalker with a pension for 'erasing people who threaten handa' after she was given Handa's eraser because she lost hers, the handa-kun copycat, the student president who for some reason makes her vice-president who is a burly man dress in the girl's uniform, and other various characters strewn about the series who're just as weird and strange as them.  On paper, they sound interesting and hilarious enough to be entertaining and fill the series with life, right?  Well...no.  The only character trait that have is the oddly stalkerish way of worshipping Handa.  Every new one that the series introduces begs to ask the question \"WHY?!\" because of how strange and borderline sad they all are and/or become.\\n\\n\r\nAnd for the characters I handpicked out, we have Yukio and Kawafuji, the two characters in the series who actually have some decent sense.  Sure, Yukio plays the 'I'm average, and everything about me is average, and I like it' card, but at the very least, he plays the straight man in this mess and tries to bring some kind of sense to all of the other characters in the series despite how fruitless it is.  Kawafuji's the same way, but he's more akin to a real person and also has common sense on the situation.  They help me bring back some sanity from this sh*tshow.\\n\\n\r\nOverview:\\n\r\n+ Some straight man characters to point out the sheer ridiculousness of this series\\n\r\n-  Handa is more of an idea than an actual character\\n\r\n-  EVERYONE ELSE IS A F*CKING BASKET CASE\\n\\n\r\nArt: Made by Diomedea, Handa-kun is...average looking at best.  The show has the animation that you would consider as standard fare for this day and age of animation, and there really isn't much I can say about this series.  I mean, the most they do is add your classic comedic facial expressions in order to accurately express the characters' emotions, but any more than that, and you're asking for a bit much.  \\n\\n\r\nSound:  The soundtrack...isn't all that interesting to be honest.  I mean, the opening has a rock song akin what Barakamon did for its OP, but it's leaning more towards heavy metal to relate to the sheer ridiculousness of the series.  (Which I think is what they were going for.)  But in all honesty, the OST isn't really anything to look forward to, and the voice acting is standard at best.  Hell, everyone in the series save for Handa sounds so damn happy that Handa is around that I can only say that that's the ONLY expression sound that they can make.  \\n\\n\r\nPersonal Enjoyment:  :)  So...what do I think of Handa-kun?  Ok, at first, I thought it was funny.  Like the overall ridiculousness of the series gave me a few laughs because of how dumb everything seemed and how the overall plotline was about these comedic misunderstandings.  Then it got old fast.  The show's inherent problems lie with the fact that it was just the SAME DAMN THING OVER AND OVER AGAIN.  Think I'm being repetitive in this review?  You try listening to characters shout the phrase \"Handa-kun!\"  \"Handa-san!\" \"Handa!\"  \"Handa!\"  God, that name is like nails on a chalkboard.  \\n\\n\r\nDid I like this series?\\n\\n\r\nIt's start was ok because the show wasn't so heavy on the misunderstandings or the stupidity of the situation, so it wasn't so heavy and more enjoyable than what came later.  Also, Yukio.  I really like the straight man in any comedy situation.  \\n\\n\r\nWhat didn't I like about this series?  \\n\\n\r\nOk, take what I said above and subtract that from the series.  What do you have left?  Everything I hate.  Cringe is about the only way I can even begin to describe this series.  As mentioned many times before, the series just went on and on with how Handa-kun was great and how Handa's the goddamn messiah to all of our problems while introducing more and more characters that belong to this nutjob high school where I can only shudder to think what they were all worshipping before this poor calligrapher's son.  They even have an episode where Handa thinks that he has a stalker, when in reality it's EVERYONE ELSE IN THE CAST STALKING HIM, and they go and assume that they need to protect him from someone who doesn't actually exist!  That's not funny!  That's not funny at all!  It's sad!  It's really, really sad!\\n\\n\r\nWould I recommend this series?\\n\\n\r\nNo, don't hurt yourself.  If you want to watch a series about Handa Sei and all of his glory...just...just go watch Barakamon.  This spin-off from hell was a mistake that should never rear its ugly head ever again.  It's a much better series and I would honestly say to avoid this dreadful cour birthed from the devil that honestly...wasn't even THAT funny to begin with.",
            "date": "2016-09-23T22:48:00+00:00",
            "helpful_count": 216,
            "mal_id": 229964,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=229964"
        },
        {
            "content": "\"This show is shit.\"\r\n-Basically everyone\r\nRemember that senile old relative at your family gatherings growing up with an oblivious grin emblazoned on their face, who without fail would tell the same cringeworthy story each time you saw them? Every time they'd start the tale's prelude, \"did I ever tell you about the time...?\", your parents would shoot you a glance or an eye roll signifying just to let them roll on with the story. It was always better to nod in agreement and force unwarranted laughter than to call them out on their repetitive idiosyncrasies. You almost felt sorry for them in a way, and bityou own tongue to preserve their blind innocence. Handa Kun is the anime version of this cheeky relative.\\n\\n\r\nSometimes in television, writers just don't \"get\" comedy. As I've said countless times, it's almost entirely subjective. Sure, there are some comedies that appeal to a larger fan base, but I don't value the same qualities you do and vice versa. The one metaphoric tightrope writers can balance on is the singular gag. The idea is to create an entire comedic show driven almost solely on one running joke throughout. Again, some may be quick to dismiss the validity of this idea because they don't care for the simplicity or subject matter as humor is in the end, subjective. For me, this type of comedy can succeed as in shows like Sakamoto desu ga? where the fact that Sakamoto was a perfect specimen of humanity allowed the gags to have unlimited potential. In Handa Kun, the running joke is much weaker. Instead, the writers focus on the over-explored idea of miscommunication. Although more commonly visited in slice of life anime, this awkwardness is addressed in the form of \"everyone is against me\" comedy through Handa's eyes. The result is a sputtering mess due to limited applicability and generic writing.\\n\\n\r\nThe first episodes were actually pretty funny to me. A troll of a girl with an elephantitis head, over exaggerated scenes between characters and awkward exchanges of dialogue looked promising. Various companion characters and antagonists were introduced as well. Unfortunately as the episodes progressed, I soon realized Handa Kun was written to be a one-trick pony... and not a very funny one. What Sakamoto desu ga was able to do that this series could not was keep the element of surprise. Sakamoto's comedy was limitless and unexpected, as Sakamoto himself would adapt to the scene in order to maintain his perfectionist status quo. In Handa Kun, the entire episode is often formed around a general misunderstanding between characters. The result is truly boring after a few excerpts, and honestly I couldn't wait for the episode to be over once I knew exactly how it would play out. I will say, Handa Kun does have better supporting characters... but that's like comparing Trump to Hillary. Nobody wins here.\\n\\n\r\nOMG! CAVE-CHAN, AREN'T YOU GOING TO ADDRESS BARAKAMON!?\\n\\n\r\nI would be lying to you if I said I wasn't looking forward to a legitimate prequel to Barakmon, one of my personal favorite anime. I thought it would be an endearing SoL with a clear plot and relatable characters, perhaps even exploring more of Handa's past with an outlook on why he got into calligraphy or something of that nature. After struggling to make it through this anime's brief 12 episodes I can assuredly say I feel ripped off. It's like asking for a sweet action figure for Christmas as a kid and getting the Great Value brand with a lopsided face and without the \"Kung-fu action grip\" (not that I'm speaking from experience, love you mom!) Handa lacks virtually all of his charismatic and likable features from the original and turns into a lame, meeker version of himself. It's almost enough to ruin the image of the series in my mind.\\n\\n\r\nHell I can't complain too much, Handa Kun and Barakamon aren't even produced by the same studio. Just do yourself a favor and temporarily leave the review to check out Diomedea's impressive resume. Literally almost everything they've made is a lackluster pile of poop. The directing in Handa Kun is not much better. Everything looks sort of bland and lacks anything really eye-catching. The first two episodes were handled well (except for the 10 minute broken 4th wall bullshit), but I think it may have been a pitched pilot for the studio and everyone kind of sat on their creative asses afterward. Perhaps Kinema Citrus, Barakamon's studio saw the source material's limited potential and ran for the hills. Though I'm not familiar with the manga for Handa Kun myself, but based on a few notes from my peers... It's not much better.\\n\\n\r\nThe characters in Handa Kun are not very memorable, except Akane. That dude's bad af. This isn't really an issue because of the comedy genre the anime follows. Most tropes are covered here, with an added bonus of elephantitis head girl. Like seriously, who decided this was a good idea!? Kawafuji's remergence was a brief refreshment, as I think he may be the only small semblance or similarity to its parent anime. I have to admit that some scenes really made me laugh at the beginning, but the lack of variety in the series took a toll on my patience towards the end. The same jokes are only funny so many times. Except Borat, that movie gets me every time.\\n\\n\r\nMost times, the art and composition can save an otherwise train wreck of an anime from the depths of mediocrity. Aside from a catchy OP and fitting ED, Handa Kun falters again. The art is nothing to get excited about. It's average by today's standards... something that seems rather par for the course where Diomedea is involved. The character models are relatively unattractive and most lack originality (sans elephant girl), and by far the best use of animation is found in the show's OP. Background music is too often recycled and left me saying \"oh, that track again?\" Voice acting was actually pretty decent, but this aspect has never saved an anime for me.\\n\\n\r\nUltimately, all that really matters to the person watching a show is whether or not they enjoy it. I've watched plenty of critical duds that I've revered as guilty pleasures, but alas Handa Kun is not one of them. It's few positives are overshadowed by the overall lack of effort the writers seemed to put into its creation. It's not an awful show, but so lackluster I kind of feel sorry for it. It's certainly not the prequel that Barakamon fans need nor deserve. As patient fans, the best we can ask for is an original series expounding on the first installment. I won't hold my breath any longer than you will. As always, thanks for reading and be sure to check out the rest of my Summer '16 reviews!",
            "date": "2016-09-22T13:27:00+00:00",
            "helpful_count": 77,
            "mal_id": 229827,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3895399.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/themegamancave",
                "username": "themegamancave"
            },
            "url": "https://myanimelist.net/reviews.php?id=229827"
        },
        {
            "content": "Handa kun has a very simple but reasonable setting that purposefully made for the sake of the comedy rather than its story or moving the plot forward. And dont judge this anime based off from its sequel (barakamon that came out first), because, you know, both of them is a slice a pretty typical slice of life anime with comedy as a mix to it. Since slice of life's essential facet is to add the comedy into them. All slice of life are like that, even if the greatest slice of life anime in the UNIVERSE like Barakamon that delivers its theme, character development, relationship,and philosophy for success in life and shit.\\n\\n\\n\r\nHanda-kun's comedy is a pretty unique and peculiar one to me as an anime \"watcher\", or as a fucking Otaku. Like really, just call me an otaku coz you all are one as fucking well. But why is it peculiar? That style of comedy though, through the excessive uses of miscommunication, misunderstanding, and characterization or ascription of godly, so fucking pro and badass characteristics to the MC. This anime may seem like an identical fucking anime to the Sakamoto Desu Ka series but it's really not. Just some of the theme, character's position and other facet are, but not its entirety. The side character or minor and the support character are alot more \"good looking\", or suitable for the role that they have in the anime. With some addition role that hasn't been introduced to Sakamoto Desu ka ofc. Like the horny ass otaku who draws shit loans of ecchi shit, or reverse gender of someone. \\n\\n\r\nThe earliest part of the anime is pretty funny in my perspective, but as the anime progresses, i just find its forced comedy, repetitive uses, and the lack of character development abit too much now. This is not fucking Re:zero for christ sake, it doesn't makes it ok to spend the 16+ (in this case it's 12 episodes) for a character development or realization to happen. Barakamon has done a fine job in that, but to see the prequel to fail to do so, this is just sad to me as a hardcore (presumably) Barakamon fan. Coz that shit gotta be one of the fucking best slice of life anime in the fucking universe no doubt. Plus they also took a real local kids to voiced each kids character, it's fucking nice. You could definitely feel the bond between the voice actors and the character simultaneously as you watch the anime, and that's what makes this anime so great. You should definitely check that one out. I wouldn't recommend you to compare or watch Handa-kun first, then go to Barakamon. Just pretend that this anime has really nothing to do with Handa Sei in Barakamon. But this is just a comedy with no real contribution to his character (aside from being a loner, unsociable, but wanting to interact with others kinda person). In the later episode or halfway to the end of the series, comedy may not even be funny to you anymore. You know why? Just fucking watch it if this kind of comedy is within your alley of interests. While people have different idea of humor when it comes to these kind of anime. Just so you know, our sense of humor can never be the exact same and you gotta respect that. Some might rate this a 1/10, or a fucking 10/10 for crying out loud. But tbh, this anime isn't quite bad. Sure the quality of the comedy drop in the half way through the existing episodes (just like Sakamoto Desu Ga). But for real, it was a funny show lmao. Give it a go.",
            "date": "2016-09-27T18:03:00+00:00",
            "helpful_count": 55,
            "mal_id": 230429,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=230429"
        },
        {
            "content": "Handa-kun has a problem...and no, not just Sei Handa's problem of misunderstandings of his classmates...as in the anime has a problem AS well as Sei Handa's problem of misunderstandings of his classmates. Here's LA's beef with Handa-kun...\r\nFor what a good-meta first episode of the Handa Force gave LA, Handa-kun quickly turned into a repetitive comedy anime without a reason to watch Handa-kun other than seeing the same thing happen to Handa-kun and the Handa Force and EVERY OTHER CAST MEMBER getting misunderstood sans Yuki Kondou and really the first episode essentially told LA further down the line what kind of anime this was gonna be,Handa Force having almost 80% screentime with Handa himself having 20% from the anime itself...ohhh boy...this is gonna be a sit...let's get to one of LA's grips about Handa-kun.\\n\\n\r\nSo who's the Handa Force?...they are Reo Nikaidou voiced by Tetsuya Kakihara a classmate of Handa and the fashionista and model, Akane Tsutsui voiced by Yoshimasa Hosoya a delinquent and another classmate of Handa, Junichi Aizawa voiced by Yuuya Hirose the smart guy and another classmate of Handa and finally Yukio Kondou voiced by Daiki Yamashita, the only genre savvy guy who doesn't say much besides the obvious in his head (but that doesn't help much due to the paranoid misunderstandings of Handa-kun and the obliviousness of Handa Force in general even when Yukio speaks up), an audience surrogate of sorts. At first their introductory episodes of each of these characters were fine, until they finally formed Handa Force and continuously misunderstood Handa (though even in their intro episodes, ALL OF THEM sans Yukio misunderstands to get them to love Handa and eventually stalk him). Why are they grating on LA?...because they are one of the major causes to the \"misunderstanding\" to the entirety of Handa-kun's comedy. Yes LA knows that Takao Kawafuji voiced by Kazuyuki Okitsu is the one who initiated this onto Handa but the Handa Force are the ones who misinterpret Handa's actions or words EVERY SINGLE TIME. \\n\\n\r\nSure Handa himself misunderstands ALOT but the Handa Force are the ones that reinforce the repetitive misunderstandings that get out of control of Handa's hands. Here's the thing, this is Handa's prequel anime to Barakamon as to how he became like he did in Barakamon and although we quickly see how Handa became how he is...Handa-kun doesn't feel like Handa's prequel backstory...it's nothing but a repetitive comedy anime of misunderstanding situations where Handa is the reactant to most of the things that occurs and Handa is not in the forefront of the anime...the Handa Force is...IT'S EVEN SHOWN IN THE ANIME POSTER!!!. For a prequel comedy anime, Handa-kun could have been another good Sakamoto desu ga?, what with the central character being the \"centre of attention\" and causes most of the comedy, but Handa-kun is huge miss in that kind of direction because as much as Handa Force likes to think that Handa is the centre of attention, it's easily overshadowed by the Handa Force themselves and them doing the same repetitive misunderstanding comedic skits EVERY SINGLE EPISODE...it becomes annoying and it got to the point LA started HATING on the Handa Force much like Handa did. If there was ANY character LA liked...it was the librarian character voiced by Rie Kugimiya but she quickly got replaced by the genre savvy Yukio Kondou from the Handa Force by default. \\n\\n\r\nHanda-kun could have jumped the chasm of repetitive comedic skits that got old fast, but IT could have, with either ACTUALLY went into a bit more detail on Handa's backstory or went batshit crazy non-repetitive formula anime like Sakamoto desu ga? did...LA continued to watch it just for something new and that came rarely.\\n\\n\r\nReally Handa-kun's biggest sin it did even for the fact it's suppose to be a COMEDY was becoming boring to watch with it's repetitive running gags and nearly every single character misunderstanding things INCLUDING Handa himself. Sakamoto desu ga? works as he works as he is the catalyst of his batshit crazy antics and methods for the other characters to bounce off of and be reactants to Sakamoto's antics, Handa-kun is the exact opposite, the supporting cast are the catalyst and THEY do the crazy misunderstanding skits and Handa is the one who reacts to himself and then the supporting cast have to bounce off THEMSELVES and be the reactants once again, the flow of comedy ends with Handa all due the misunderstanding and his shyness and doing this routine over and over and over and over again is what makes the comedy stale VERY quickly. The second biggest sin is that as LA watched Handa-kun, it made LA question as to whether Sei Handa from Barakamon was ever a genuine and investable character to begin with if his backstory almost literally has him at the whims to his own misunderstandings, his shyness and little backstory shown in his highschool days to get him to who he was in Barakamon. Handa-kun had the material from Barakamon to make a good comedy based on Sei Handa's life, instead we got a wasted potential that has little to do with the main character the anime's title is named after, if your SUPPORTNG CHARACTERS (Namely Handa Force and any other character that gravitates to this group) have more screentime than the MAIN character the anime's title is named after, your kinda missing the point of a prequel of pre-established character, hell the anime might as well be called \"Handa Force and Thier Misunderstandings the Anime\" than \"Handa-kun\".\\n\\n\r\nIn terms of animation, the animation was \"decent\" overall using pastel colors and a vibrant character cast to go with it. The animation does have some good bits such as Handa's Wall for instance as well as the comedic \"moments\" of over-exaggeration at times does make the scene transition well. On speaking of which the transitions used in Handa-kun (the calligraphy brush wipes) were also a nice detail. The animation done by Diomedea is overall decent to say the least but the animation CAN'T be the only thing good about it if the comedy can't stand up to it.\\n\\n\r\nIn terms of voice acting, well as a good of voice cast as this was, LA had a few annoyances, mainly from the Handa Force especially Junichi Aizawa voiced by Yuuya Hirose as his misunderstood eccentricities were annoying and LOUd to say the least and the rest of the Handa Force weren't much different, at least the majority of the voice cast did some well done reaction grunts/remarks or fanboy/girling that was ok enough. Sei Handa's voice actor Nobunaga Shimazaki, as much as it was \"in character\" for him to be shy and paranoid, it just felt that was ALL he was doing. The voice cast for LA is slightly mixed but LA's favourite voice actor goes to Miyoko Kinjou voiced by Kaede Hondo for her schizophrenic fangirling over Handa at a flip of a switch...she was really unexpected...seriously.\\n\\n\r\nThe ending FINALLY deals with Handa and his misunderstood paranoia and LA really LA just has to say \"IT TOOK YOU LONG ENOUGH\", the ending pretty much was what LA wanted to see...SOMETHING NEW...slight though but with Handa's revelation, it helped at bit, but not enough for LA to redeem Handa-kun for his comedic sins it placed on the anime and Sei Handa as a character...the ending was good, but the payoff was well enough not worth it.\\n\\n\r\nReally aside from the very good-meta first episode, the  intro episodes of the Handa Force members and the finale to it's decent animation and voice acting, these strengths can't outweigh the immense amount of character and comedic flaws LA just kept seeing on repeat and yes LA knows that comedy is subjective but that was just what LA saw watching Handa-kun.\\n\\n\r\nHanda-kun isn't the best comedy anime this Summer 2016 and failed to be funny as it thought that it's \"one joke wonder of misunderstandings\" could make the anime and nothing else, hell even Kono Bijutsubu ni wa Mondai ga Aru! this season knew to shake things up from time to time!. Now Sei Handa...please DON'T MISUNDERSTAND this review...LA WANTED to like this anime...LA doesn't hate Handa-kun...just disappointed.",
            "date": "2016-09-23T21:40:00+00:00",
            "helpful_count": 23,
            "mal_id": 229962,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=229962"
        },
        {
            "content": "I can't understand all the bad reviews- laughed my ass off the entire series, one of the best anime comedy series I have ever seen.\r\nA story of misunderstandings and lots of weird people...\r\nAfter his ''best friend'' Kawafuji tells Handa that everyone hates him in middle school, he has the biggest paranoia that mankind has ever seen. \r\n(Handa filter ON)\r\nEvery episode contains 1-3 'stories' around Handa and other things in his school.\r\nEven though it's almost the same every episode it's still hilarious af.\r\nThe art does what it's supposed to do, especially love Handa's pissed expression hehe. (.////.)\r\nOpening and characters were weird, well, just like the show.\r\n(Likeactually, what the hell is wrong with that opening)\\n\\n\r\nCan't really say anything else, just a really entertaining series and awesome humor.\\n\\n\r\nSo if you liked loved Barakamon, like me, you will also love Handa-kun :)",
            "date": "2016-10-18T07:00:00+00:00",
            "helpful_count": 22,
            "mal_id": 231996,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4833525.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kat0211",
                "username": "Kat0211"
            },
            "url": "https://myanimelist.net/reviews.php?id=231996"
        },
        {
            "content": "Mine will be shorter than 90% of the reviews here.\r\nI believe what threw most people off with this series was its genre.\r\nBarakamon 80% slice of life; 20% Comedy\r\nHanda Kun: 80% Comedy; 20% Slice of life\r\nOf course, the above percentage I provided was solely based on my opinion. I believe most people hoped for a slice of life feel which exactly what Barakamon was but this series didn't deliver this.  Instead, comedy moments took over despite the repetitiveness. Essentially, we all have a different opinion but this series took a different path from its predecessor; therefore, please try to watch this without comparing to Barakamon.",
            "date": "2016-12-01T00:23:00+00:00",
            "helpful_count": 18,
            "mal_id": 234687,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5871953.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/roehell",
                "username": "roehell"
            },
            "url": "https://myanimelist.net/reviews.php?id=234687"
        },
        {
            "content": "Its kind of sad a lot of reviewers hating this series because it is repetitive and boring but I'll do my best to give a positive reviews and try to make you watch it.\r\nHanda-kun is the prequel of Bakaramon, and this anime covers Handa Sei's High School life. The story each episode has a common sequence new character - hate handa - handa makes a move - misunderstoods - likes handa. Although it has that formula I still found it entertaining because it has some moment where you can smile, giggle, and cringe. Also the characters are pretty funny(for me) and each of them havedifferent ways of interpretation of Handa like someone sees him as god, respects as powerful man, wants to be him, rival and etc. \\n\\n\\n\r\nHanda-kun vs Bakaramon\\n\\n\r\nThere is a huge difference in both series because it has different story and how it is presented. In bakaramon it is focused on Handa Sei's improvement as a person while in Handa-kun it is focused on his struggle on how can he maintain his persona(that is wall joke i guess).\\n\\n\r\nSo to be precise these two series should be viewed as an art(since this anime is focused on calligraphy)  Handa-kun represents appreciation while Bakaramon represents motivation or inspiration. \\n\\n\r\nHow can I say it that way?\\n\r\nYou have to understand the people around Handa Sei. In Bakaramon, people around him always tries to make him different stuffs and they interact with Handa in a different way and it is the not the usual way Handa was treated. How can it be inspiration/motivation, inspiration usually fires when new things is being experience and motivation because of the words that townsfolk says to him like \"People always look up, the key is a breathe look down and you will see opportunities\"  not the actual quote but i hope i get the context from the mochi episode. While in Handa-kun, people around him always misunderstood his actions but this kind of interpretation always lead to positive rather than negative so that's why I call it appreciation. \\n\\n\r\nEnding remarks:\\n\r\nI like Handa-kun and I wish it has a second season its either his 3rd year highschool or his college life because I still don't see the people on the picture in bakaramon. And lastly its hard to watch bakaramon without imagining ERASER is around the bush watching him xD",
            "date": "2016-10-03T09:07:00+00:00",
            "helpful_count": 16,
            "mal_id": 231004,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/bunnyheaven",
                "username": "bunnyheaven"
            },
            "url": "https://myanimelist.net/reviews.php?id=231004"
        },
        {
            "content": "It's hilarious as f*** on how they treat Handa-kun as a God here. But, this is most certainly ain't Barakamon though as most of the characters here are not present and instead we focus more on about Handa-kun's High School life 6 years before the actual scenes.\r\nLadies and Gentlemen, I give to you, the prequel of Barakamon, Handa-kun.\r\nLong story, short, Handa-kun is all about Handa's quirky High School days. His classmate's and other students' perspective, he's the most popular guy in school and everyone likes him. From his good looks, to his coolness and over-the-top seriousness. But in Handa's perpective, however, he taught that thisis an opposite matter, he's anti-social, he's uncomfortable to someone before him, he's frightened so much it's like someone is watching him menacingly, and he thinks that everyone hate him it's like he was a small fish in a big ocean filled with sharks and a large chainsaws installed in their fins. Handa-kun is, when it comes to comedic approach, is actually funny... Kinda a slapstick manner with 5% sex jokes. And most of this jokes, we're all about Handa's misconception and misleading approach towards someone.\\n\\n\r\nTo explain the concept, imagine you we're jumping at the roof of the top of the building because you learned that your crush has a girlfriend. But, as you we're about to jump, suddenly someone came, and it was your crush, talking about how important for you to live. But instead he was taking an eye contact towards you, he was actually talking about a mistreated table with a lot of markings. And due to misleading approach, you cried because he's right. But then again, he was just about the table and he doesn't even know what was going on that particular day. One day later, you saw his girlfriend, and as you're surprised that you saw her GF, she asked where's the Parent meeting assembly. As you repeat the word \"parent\" coming from her. You mistakenly identified her as GF. And you learned that his \"GF\" was actually his mom.\\n\\n\r\nThat's what Handa-kun's plot is. The whole theme is all about misconception towards someone and what kind of mistakes that the characters do, Handa is right there to correct it without knowing what was actually going on around him. And because of that, they treat Handa as their messiah because of what he'd done over the past episodes. Even though, Handa has no idea and his self-esteem amongst peers is very low due to his introverted state after what Kawafuji did to him in middle school, which is I'm not going to spoil as this is how Handa get his major character development.\\n\\n\r\nThe characters, on the other hand, is 1% Barakamon, 99% Handa-kun. On the side of Barakamon, they've retrieve only three; Handa Seihuu, his mom, and Kawafuji. The rest we're his classmates, the others were students of their school, a professor, the boyish president of the student council and her \"girlish\" assistant, and their 2 rival schools. There are few character development here though as this anime is focused more on humor. Some of which we're came from their character backgrounds, and most of them was the cause of Handa's \"helpful hands\". Which leads them to get over-obsessive towards him, idolizes him, or in worst cases, stalking him.\\n\\n\r\nThe sound, well, the OP is the big issue here. It's really surprising that my expectations here on the OP is, actually, over the radar. Comparing to Barakamon's melodic soundtrack. The OP makes me laugh though as I really can't take it why they've choose the rock song than what they've done in Barakamon. It's like they put Maximum the Hermone's Death Note theme to the another comedic gold anime \"Nichijou\" and then put a 1 minute video on how hardcore the anime is. For the seiryuus, well, I don't really tell what's the difference between the original Handa's seiryuu to the new seiryuu as I was just focusing more on the storyline of the anime itself. But, I guess it was good nonetheless. However, if you compare the OP and ED song of this anime, the ED is the only theme that fits the concept of this anime. This is how I depict how the OP is before. But now I've seen the OP, well... That really escalates my expectation because of that...\\n\\n\r\nOverall, this anime will certainly not going to fail you smile or laugh. It's really cool to see the prequel of Barakamon and what Handa's High School life looks like. It's a fun anime series that you might wanna check it out. It maybe low on the MAL's anime list, but still, the anime is still fresh and the theme is kinda unique to this anime. It's really good to be honest, and again, try this one out. You'll not going to regret it.",
            "date": "2016-10-23T09:58:00+00:00",
            "helpful_count": 15,
            "mal_id": 232443,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4618412.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VaasMontenegro",
                "username": "VaasMontenegro"
            },
            "url": "https://myanimelist.net/reviews.php?id=232443"
        },
        {
            "content": "Hey folks, this will be a review for Handa-kun. This show seems to have a few people upset with how it was handled. This show is not Barakamon. However this show is an excellent comedy, and highlights how Handa came into his personality.\r\nThere really isn't much of a story. Handa thinks the entire school hates him. In reality everyone loves him. How they tell the story is what made it fun to watch imo. Handa is the main character but the handa force (Kondou, Nikaidou, Tsutsui, and Aizawa) are the tellers and focus of the story. The misconceptions surrounding Handa bring these characters together tocreate the \"Handa force\" in which they spread false truths around as they misunderstand Handa's actions.\\n\\n\r\nI'm not sure what people wanted to be honest. Each review brings up that they had wanted a legitimate prequel to Barakamon, but what would that be? To me the warmth of the characters and the enjoyment of discovery of new things and oneself was something you cant just transfer to another show without it seeming forced or lackluster. This show chooses focus more on the comedy. What people are calling strange or bad is also an interesting way of tackling the show in general. Overall I'm happy they didn't go for a \"Barakamon 2 lost in high school\" type show. \\n\\n\r\nThe art was pretty standard, and so was the soundtrack.\\n\\n\r\nThe characters as eluded to make this really enjoyable. They each had a corrosive or main character centered personality(the intelligent class president, the handsome model, the brutish delinquent, the normal Joe). Handa however is nothing really special, he is great at calligraphy and he is well known. This makes the misunderstandings really enjoyable to watch and not follow in the footsteps of a show mentioned in others reviews a lot(Sakamoto desu ga?). Where as Sakamoto uses the main character to drive change directly and rather boringly this show uses misunderstanding and side characters to drive change. \\n\\n\r\nI enjoyed this show a lot. It was a simple comedy show which so happened to be happening around Handa. I think the hate received is a bit to broad and muddled. This show wasn't as \"brilliant\" or heartwarming perhaps as Barakamon. However it follows in the same light. Handa is this man who has a strange and odd view on things. The world around him shifts and changes do to his actions, but more importantly, the actions of the people around him change who he is.\\n\\n\r\nThe comedy was rather straight forward, and though the underlying theme of misunderstanding was present it felt like each situation was new and fun. As comedy is subjective its hard to make this the focal point of an argument. The reason its the focal point of mine is that this show was doomed to fail from the start. You will never have a Barakamon clone. So they have to decide how to handle the material. They decided to bank everything on this strange perspective comedy and imo they nailed it on the head.\\n\\n\r\nTLDR: Don't go into this with Barakamon 2 in mind. Relax and enjoy what the show presents.",
            "date": "2016-09-28T17:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 230490,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=230490"
        },
        {
            "content": "The story of Handa-kun is pretty simple line. Handa sei is a normal high school average guy who presumes that everyone around him hate him for no reason. There is a black telephone booth kind of aura wall around him most of the times he is at school. At home how he behaves shown very little. Story beautifully unfolds how his friends' group increases thanks to the misunderstandings of all the people around him. It reminded me of 'school rumble'.\r\nEvery one in his school chants his name and even student leaders of some notorious high schools in his vicinity, consider him with regard. It's ahilarious showcase of the misunderstandings of people who come in contact with him. Only the viewer, his friend kawafugi and the average guy in his class who becomes member (forcefully) by the others know that Handa is a simple minded shy person who is sensitive to the actions of others towards him.\\n\\n\r\nArt:  Its good. \\n\\n\r\nAnime designers taken lot of effort to show it in decent way though there are some minor show case of ecchi hints but are overtaken in a flash by Handa's simple minded comments. \\n\\n\r\nENJOYMENT: After reading some of the reviews (who gave 2 or 3 rating) for this anime, i skipped it but now i am happy that i saw it with my mom. It's refreshing and HILARIOUS story of a person who avoids people around him.",
            "date": "2017-02-24T02:05:00+00:00",
            "helpful_count": 9,
            "mal_id": 241257,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3838527.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/deep3anime",
                "username": "deep3anime"
            },
            "url": "https://myanimelist.net/reviews.php?id=241257"
        },
        {
            "content": "Let me start off by saying that I don't believe it's necessarily fair to judge an anime based on its legacy. Perhaps on a personal or contextual level, but an anime, show, or any form of media should, if possible, be judged on its own merits and accomplishments. Therefore, I don't think it's fair to call Handa-kun bad just because it didn't follow the same path as it's amazing predecessor, Barakamon. It should be judged as what it tried to be, not what people expected it to be. It was clearly made to be something different, and there's nothing inherently wrong with that. \r\nSo withthat said, I will judge this show based on its merit as a comedy.\\n\\n\r\nThis show sucks.\\n\\n\r\n(Good) Comedic shows usually come in two forms. One is the dynamic/sophisticated comedy. It's a comedy at heart, but it's given an interesting dynamic (ex. interesting characters) that help flesh out a theme or aspect of the show (GTO, One-Punch Man). The other is just a pure comedy that simply exists to tell jokes, often referred to as gag anime/manga (Monthly Girls' Nozaki-kun, Tanaka-kun is Listless). \\n\\n\r\nHanda-kun falls under the latter category. The cast of characters simply aren't very interesting, nor does the story attempt to tackle any wider picture. It is very obviously a simple comedy, and it doesn't attempt to have any level of depth. However, Handa-kun generally fails to even accomplish a basic comedy. It tells the same joke by using the same premise, the same process, with the same punchline. It's redundant and formulaic. \\n\\n\r\nNow I'll be the first to admit that having a formulaic comedy isn't always the end-all-be-all of a show. Monthly Girls' Nozaki-kun basically uses the same premise and punchline for 90% of its strips. However, the joke is either creative or told well enough where the joke still retains its humor. Sakamoto desu-ga is very formulaic and an average show at best, but it still is known for many humorous, endearing scenes due to how creative it can be. Handa-kun is not among the list of exceptions, however.\\n\\n\r\nThere are two huge problems with Handa-kun that emphasize it's formulaic flaw. The first is that the overarching joke and premise simply isn't funny. The set-up of the joke is always based off the artificial drama that is Handa's misunderstanding of everyone's perception of him. The process generally involves an uninspired \"solution\" that draws from various generic anime tropes. The punchline is that Handa continues his misunderstandings through some freak accident. I won't go into huge detail dissecting every aspect of the joke, just that it simply isn't funny (if you're curious, watch episodes 2 and later. Episode 1 is the only one told differently but it's terrible for a completely different reason). The second problem is that the formula behind Handa-kun is given no room for flexibility. It's so specific to the point where Handa-kun can't help but tell the same joke in the same way over and over again. That's basically what Handa-kun is: a bad joke told 12 times. (To give credit where credit is due, there are one or two episodes that have decent gags in it, but it isn't worth the 12 episodes)\\n\\n\r\nHanda-kun isn't a bad show because it's not as good as Barakamon, Handa-kun is a bad show because it's a basic, uninspired, formulaic comedy. This anime isn't worth your time, and it definitely isn't worth it if you're looking for Barakamon Season 0.\\n\\n",
            "date": "2016-09-29T02:37:00+00:00",
            "helpful_count": 10,
            "mal_id": 230516,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3518737.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KayB",
                "username": "KayB"
            },
            "url": "https://myanimelist.net/reviews.php?id=230516"
        },
        {
            "content": "I do not understand the negative reviews.  I really loved this anime.  If you like slice of life stories that will make you not be able to drink a soda while you watch it because your laughing to much this is the anime for you.  I have watched this anime and the one that came before it Barakamon and enjoyed both equally.  Both anime eventually bring the main character out of his shell and realize how the people around him see him.  Don't watch this anime as a continuation of Barakamon because though its got the same main character theyare not the same anime and should be treated differently.",
            "date": "2016-12-06T06:49:00+00:00",
            "helpful_count": 9,
            "mal_id": 234982,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3594937.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/elliehanna",
                "username": "elliehanna"
            },
            "url": "https://myanimelist.net/reviews.php?id=234982"
        },
        {
            "content": "Barakamon is one of my favourite slice of life anime of all time and I was disappointed that it only has 12 episodes. After hearing about the prequel, I got a bit too excited because I get to see more of Handa but I also told myself that the prequel exists just to capitalize on Barakamon's success. And.....After finishing the show, I guess I was right. \r\n[Story]\r\nThere's a lot of reasons why I love Barakamon. From its relaxing settings to Naru being one of the cutest and most fun anime characters to watch to Handa’s amazing growth and him coming to terms with his careeranxieties by living in a rural countryside, it was a great piece of quality show that I really enjoyed. The comedy was also one of the best I've seen in anime. I'm all for more Barakamon content so that's why I was a bit excited for Handa-kun. After watching the first few episodes, I was honestly a little bit disappointed. \\n\\n\r\nSo what happens when you take out all the core strengths of Barakamon and turn Handa into a teenager and put him in a high school setting? Well, you get this. Although, just because I'm a big fan of Barakamon doesn't mean I hate Handa-kun. Handa-kun actually turned out to be a decent series. I also admit that Handa-kun's comedic aspect was good at times but decent for the most part and it made me laugh at some parts of the episode. Except the first 10 minutes of the first episode breaking the 4th wall, that scene didn't make me laugh at all. Though, I still think Barakamon's comedy was 2 times better.  \\n\\n\r\nThe show, as a whole, is built on misunderstandings. Unlike Barakamon, which impressively portrayed Handa's amazing character development, this show only focuses on Handa's school life and the things that he has to face every day because of this \"misunderstanding\". He thinks that everyone hates him but in reality, almost everyone loves him. Now, why does he think like that? It's all thanks to Kawafuji (Remember him from Barakamon?) trolling the shit out of him and Handa actually believing his joke. Since Kawafuji finds the situation funny, he's letting all the events happen. That's the whole joke of Handa-kun. \"The misunderstandings between him and the students\". Though, it never gets tiring because the jokes has its twists every episode that keeps the joke fresh for the show's entire run. Plus, there's about 2-3 different segments per episode so it isn't just 24 minutes of Handa and that same student for a whole 24 minutes. Each segments focuses on different characters with a different situation and I, admittedly, was laughing my guts out on some of the episodes (mostly in the second half of the series). I just find it hilarious that Handa and the students, especially those on the Handa Force, are never on the same subject and they see things differently. \\n\\n\r\nAlso, some of the jokes on Handa-kun were references to Barakamon and it was a nice touch. The reference that I loved the most was the episode about a student who is a fortune teller, with a very accurate fortune telling, and she predicted Handa's future and said \"So many children despite not having a single sense of sex drive!\" which then shows a background with the kid's silhouette from Barakamon. I love it and I'm glad they did that. God, I miss Barakamon\\n\r\n______________________________________________________________\\n\r\n[Art/Animation]: (7.5/10)\\n\r\nThe Art and Visuals were pretty decent for the most part. The animation was ok, for a slice of life setting and the character designs are good but not the greatest I've seen. The background, on the other hand, looks really cheap. I mean, what the fuck? It looks like a shaded drawing but was horribly rushed. Is there supposed to be some meaning in the cheap background or is it cheap because they didn't have enough budget? Either way, I didn't like it. \\n\r\n______________________________________________________________\\n\r\n[Sound]: (7/10)\\n\r\nThe soundtrack wasn't really anything special and nothing stood so none of the OSTs is worth mentioning. It's just your typical soundtrack for a slice of life anime. Now the OP and ED theme song(s)\\n\\n\r\nThe OP theme song is \"The LiBERTY\" by Fo'xTails. I did not like the OP theme song at all. I'm ok with songs that are rock but heavy rock is not my cup of tea. I ended up skipping the OP after hearing it on the 1st episode. \\n\r\nThe ED theme song is \"HIDE-AND-SEEK\" by Kenichi Suzumura. Now this song, I like. I really love the song's upbeat tune, the melody and that amazing chorus. Plus, the singer's voice is amazing. Also, the ED Animation, while simplistic, was stunning to watch. I love how the amount of characters walking in the ED grows as more characters gets added throughout the series.\\n\r\n______________________________________________________________\\n\r\n[Characters]: (7/10)\\n\r\nThere's really nothing much to say about the characters except that they're just there for the sake of comedy. A new character or a bunch of new characters gets introduced almost every episode and some of the characters will either be back in the future episode or they won't make an appearance again after getting introduced. For example, Mori Maiko, who has feelings for Handa, and her friend with a big-ass head Juri gets introduced in the 1st episode but they barely make any appearances in the future episodes. Like I said, they're just there for the sake of comedy and they get little to no character development (Except the Handa Force members. They get a decent amount of character development). The characters are enjoyable to watch though. The characters vary from a librarian girl who has deep feelings for Handa, a yandere girl, a \"normal\" boy, a \"trap\" student council president, the \"pretty boy and etc. The show has a lot of variety in terms of characters' personalities that makes watching these characters very interesting and not boring at all. \\n\\n\r\nHanda was a lovable character in Barakamon and watching him in the 1st episode was just.......I don't know. The way he acted in the 1st episode was not the character I fell in love with (No homo). He wasn't even THIS dense in Barakamon. Then I realized that Handa is a teenager in this series. I just couldn't believe that Handa is that dense to the situation around him. Even I'm not that dense and I can read the situation around me (Teenager here). Yea, don't remind me, it's all for comedy. Though, it took a while for me to get used to his teenager side and after that, I enjoyed watching him go through his high school life with full of misunderstandings. \\n\r\n______________________________________________________________   \\n\r\n[Enjoyment]: (7/10)\\n\r\nFor the most part, I enjoyed Handa-kun but it doesn't even hold a candle to one of the best slice of life series ever \"Barakamon\". Handa-kun was just a hilarious and fun mindless show, for me, and I enjoyed the comedic aspect of the series and also, most of the characters in the series. \\n\r\n______________________________________________________________\\n\r\n[VERDICT]\\n\r\nHanda-kun, a prequel to one of my most beloved slice of life anime series of all-time, turned out to be an alright series at the end. The characters were somewhat enjoyable to watch, especially the members of the Handa Force and while the comedic aspect of the series may not be perfectly executed, it still made me laugh at some parts of the show. Overall, I enjoyed this show but to a certain extent. Of course, if you were to ask me which show I enjoyed more then Barakamon will be an obvious answer from me. If you were to view Handa-kun as a standalone series (or you haven’t watch Barakamon at all) then you might enjoy this series even more. Now that I've finished Handa-kun, I'm really hoping for a sequel (sort of) or an extension to Barakamon that expands more on Handa's life on the island because it felt way too short.    \\n\\n\\n\r\n[OVERALL]: (7/10)\\n\\n\\n\r\nPros:\\n\r\n+Enjoyable series to watch\\n\r\n+Show turned out to be alright at the end\\n\r\n+Decent comedy, with some parts of the show that made me laugh\\n\r\n+Enjoyable characters with different varieties in their personalities\\n\r\n+Nice touch on the Barakamon references. \\n\\n\r\nCons:\\n\r\n-Cheap looking background\\n\r\n-Handa's dense level annoyed me on the first couple of episodes\\n\r\n-Handa-kun, being a prequel to Barakamon, doesn't exactly feel like a prequel to said series.\\n",
            "date": "2016-10-22T12:11:00+00:00",
            "helpful_count": 9,
            "mal_id": 232348,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=232348"
        },
        {
            "content": "As you've probably noticed, the reviews for Handa-kun are varied, ranging from excessive praise to blind hatred. This is largely caused by the show's setting as a prequel to Barakamon, a heart-warming comedy series which aired back in 2014. \r\nNegative reviews seem to centre around the argument that Handa-kun wasn't worthy as a predecessor to such a well-reviewed anime, and despite having some returning characters, doesn't actually share much in theme with Barakamon, disappointing hardcore fans. Handa-kun's comedy is quite different to Barakamon's and is far more comparable as a series to Danshi Koukousei no Nichijou or Sakamoto desu ga?, than it is to theanime it is supposed to set the stage for. I can understand some disappointment, if you were hoping for more Barakamon content, but it really was quite clear from the start of episode 1 that this show wasn't really attempting that, at that point one ought to shift their expectations for the content rather than rile oneself up over the differences between the two anime. I think it's unfair to blast the series with a '2' or a '3' simply because you're annoyed that you might have to wait a while longer for an actual continuation of Barakamon's story. It's not worthy of a '10' or '9' either in my opinion, but I think that's just an attempt by some to boost the score to offset the overly-negative reviews, which is not what the scoring system is for.\\n\\n\r\nIn my opinion, Handa-kun is a fun and refreshing comedy, undeserving of the hatred it receives from some Barakamon fans. In a way, it isn't really a prequel at all, Handa goes through very little character development until the final episode, and it doesn't really tell us anything relevant to the story of Barakamon. You really could question why the series even bothers to use the same characters. Despite being a different type of show to Barakamon, it doesn't negatively impact on its sequel either. The characters, while not revolutionary or multidimensional, are entertaining and give the whole anime a carefree, relaxed vibe making it easy and pleasant to watch. The whole show is very easy on the eye and ear, the characters, the palette and the soundtrack all contribute to making the show something you can enjoy casually watching, not demanding your full concentration. It certainly had me refreshing my browser waiting for the next episode to come out.\\n\\n\r\nTL;DR - If you haven't watched Barakamon, watch them both, the order doesn't matter, they're both good albeit in different ways.  If you have watched Barakamon and DON'T feel a primal urge to protect the thematic integrity of its universe and lampoon anything which taints your holy anime, then watch Handa-kun, you'll have fun, it's not as good as Barakamon, but that doesn't mean it's an insult either.",
            "date": "2016-09-24T06:27:00+00:00",
            "helpful_count": 8,
            "mal_id": 229995,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3836815.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Enpsychopedia",
                "username": "Enpsychopedia"
            },
            "url": "https://myanimelist.net/reviews.php?id=229995"
        },
        {
            "content": "Here is my first review:\r\nSpoilers ahead\r\nHanda-kun is a prequel to the Slice of Life series Barakamon. However there except a few characters there were hardly any similarities between the two. To watch this series you don't need knowledge of Barakamon characters a priori.\r\nStory: 4/10: The story revolves around the main character Handa-Sei in his high school life. There is utter misunderstanding between Handa and other characters. Handa constantly believes that people around him hates him which is not at all in reality. There is no such plot here. In each and every episode a new character is introduced and for some stupid misunderstanding he/she startsto worship Handa. The logic may seems funny for one or two episode. However the same annoying thing to happen for 12 episodes gives you an headache.\\n\\n\r\nArt: 7/10:  The art is okay. Nothing spectacular in particular.\\n\\n\r\nSound: 7/10: Opening song \"The LiBERTY\" by Fo'xTails is pretty rough in my opinion. However, the ending theme by \"HIDE-AND-SEEK\" by Kenichi Suzumura is nice to hear. The OSTs were nothing worth of remembering.\\n\\n\r\nCharacter: 6/10:  Only 3-4 characters were present probably most of the time. Otherwise remaining characters were episodic. There were hardly any character development in the series. \\n\\n\r\nEnjoyment: 7/10: Handa-kun offers comedy and nothing else. I personally enjoyed those comedies initially. But later on it became quite repetitive and silly. \\n\\n\r\nOverall: 6/10: Handa-kun is a watchable series overall. However people searching for Barakamon elements here should refrain from watching this shit.",
            "date": "2016-10-12T05:00:00+00:00",
            "helpful_count": 7,
            "mal_id": 231655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4699598.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/xadon",
                "username": "xadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=231655"
        },
        {
            "content": "Note: Before I get into this review, I will say earlier on that this IS NOT a prequel to Barakamon. It doesn't relate to Barakamon in any way storywise.\r\nNow, avoiding the fact that this wasn't much of a prequel for Barakamon and more of a comedy of Handa's high school life, it was highly enjoyable. I would also say that his calligraphy wasn't a big part in it, although it is brought up many times.\r\nThere is no main story to follow throughout the series, but each episode has its own story to follow. Each episode usually revolves around everyone completely misunderstanding whatever Hand-kun is thinking/doingwhich leads to some funny scenarios. I even nicknamed this Misunderstandings-kun at one point haha. \\n\\n\r\nNow to pick it apart.\\n\\n\r\nStory: 6/10..... again, it doesn't really have a story to follow but more of a different story every episode with quite a lot of comedy.\\n\\n\r\nArt: 7/10..... it was good but nothing particularly impressive (other than Handa's calligraphy haha)\\n\\n\r\nSound: 8/10..... the background music for the most part was good, but I really liked the OP and ED. The OP is not what you would expect for this anime but it fit surprising well for me. The ED was nice to listen to as well.\\n\\n\r\nCharacter: 7/10..... Overall there were a lot of different character types which clashed together fairly well. \\n\\n\r\nEnjoyment: 8/10..... I found many of the comedic scenes highly enjoyable. Especially when Yukio was involved. He always recognized what Handa-kun actually wanted when everyone \"misunderstood\" him and it was funny seeing his reactions to them haha.\\n\\n\r\nOverall: 7.2/10..... If you are looking for a comedy with no real story to follow that is highly enjoyable, I would highly suggest Handa-kun.",
            "date": "2016-09-23T21:08:00+00:00",
            "helpful_count": 7,
            "mal_id": 229958,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5479652.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TeejSSX16",
                "username": "TeejSSX16"
            },
            "url": "https://myanimelist.net/reviews.php?id=229958"
        },
        {
            "content": "GENERAL - In Handa-kun we dive into Handa's high school life. While we do nto receive anymore of Naru and the rest of the islanders form Barakamon, Handa-kun  is sitll enjoyable to watch as an act of beign a prequel.\r\nSo the majority of the comedy comes from  Handa endlessly thinking that his clas hates him. With Handa be a well known calligrapher he often gets stares and this leads to him thinking taht they hate him. (Along with other many situations).\r\nWhile its comedy is nto as great as Barakamon it is still a fun series to watch I was  surprised by itas I wasn't expecting to much out of a prequel.\\n\\n\r\nCHARACTERS - So the characters are Handa and the Handa  squad.\\n\\n\r\nHanda seems a bit different here. In Barakamon he started off more rude and inconsiderate, here he seems more obliviou to what the people around him are thinking. Its somewhat odd to get use to this change in personality.\\n\\n\r\nHanda squad - Overall I would say they aren't too memorable. They do have there comedic bits but aren't anything special as characters.\\n\\n\r\nSOUND - The sound is nto really memorable either it is just your normal comedy slice of life music and does not have a stand out track.\\n\\n\r\nART / ANIMATION - For a slice of life the animation is fairly solid. Nothing insane but tis a nice art style and animation for thsi type of series.\\n\\n\r\nOVERALL - While its not Barakamon it is sitll enjoyable to watch and worth a watch. If you want to see mroe of Handa then you will get that from here.\\n\\n\r\nSCORE - 7.0\\n\r\nPERSONAL ENJOYMENT - 7.2",
            "date": "2016-12-23T01:10:00+00:00",
            "helpful_count": 5,
            "mal_id": 236202,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5491185.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/FT1278",
                "username": "FT1278"
            },
            "url": "https://myanimelist.net/reviews.php?id=236202"
        },
        {
            "content": "Throughout my entire otaku career I’ve met tons of dense male MCs that have a lot of girls fall for them, it’s just the thing with anime.\r\nHanda-Kun is different, Handa is not just dense, he’s overwhelmingly negative. A type of MC that is pretty rare, combined with the way the anime works, showing Handa’s thoughts make the anime extremely hilarious.\r\nAn example would be Handa thinking an obvious love letter is a letter of misfortune. And a cute girl asking him out is secretly trying to beat him up or bully him!\r\nHanda is a handsome, smart and introverted individual that many people like because his introversionmakes him a ‘mystery’ and girls seem to like it... He is Mr.Popular except that he assumes everyone hates him because he interprets what people say wrongly all the time and because he is dense and introverted, makes him think that he is hated throughout the school while on the contrary is loved by many girls and boys and even has his own mini fanclub (not that he notices)\\n\\n\r\nHe subconsciously makes himself seem cooler, kinder and overall a better person by doing stuff with a personal intention and others having the impression that he’s doing it for the other person.\\n\\n\r\nFor example (not taken from anime) Handa would push someone with an injured back and that person would think that Handa was trying to help his/her back \\n\\n\r\nHis mini fanclub are diehard fans and would be something like\\n\\n\r\nHanda rubs his stomach because it was abit itchy and his friends (fans) would think he is hungry and cook a bunch of stuff or smth\\n\\n\r\nThe best part is Handa only has one Friend whom he tries to not let anyone know they are friends as Handa is afraid he might bring his loner-ness to his only Friend while on the contrary his only Friend is having a blast watching Handa’s introversion because it is extremely funny and although he feels guilty, plans to just let Handa be for awhile longer XD\\n\\n\\n\r\nThe Seiyū were pretty decent, nothing particularly special and the art was fine too!\\n\\n\\n\\n\r\nTL;DR\\n\\n\r\nA dense calligraphist that draws no relation to Barakamon except for being the same person\\n\\n\r\nThings always work out oppositely or at least people have the opposite impression to Handa’s negativity making them think he is great.",
            "date": "2019-01-13T08:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 298931,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6221320.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DoomRanger",
                "username": "DoomRanger"
            },
            "url": "https://myanimelist.net/reviews.php?id=298931"
        },
        {
            "content": "After seeing so bad reviews about this anime here, I really have to defend it in some way. As different as this prequel is from Barakamon, it is originally based off a manga of the same name. As such, I would say read the manga instead of watching this anime as the comedic timing, the jokes and the different portrayals of the characters are masterful in the manga, but poorly delivered in the anime adaptations. Many gag insertions and unnecessarily timed extras resulted in the anime becoming confusing for viewers who might not have read the manga and understood who the characters were. I dothink that this anime is ways off from Barakamon, but do give the manga a shot as the manga made me laugh and cry in many different ways and its one of the best comedy mangas that I have ever read, and that this anime adaptation did not do it justice.",
            "date": "2018-12-24T08:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 296708,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3903507.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kaedecchi",
                "username": "kaedecchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=296708"
        },
        {
            "content": "This anime gets a lot of hate which is a bit reasonable when you think because handa-kun is a prequel to probably one of the best slice of lives ever made which is barakamon so of course people would want to compare them and see the same type of comedy and humor in handa . \r\nNow this anime is written under the comedy slice of life shounen genres but to me i think this falls under the Drama genre a lot more , i'm not sure if the mangaka intended for that to happen or not but this anime felt sad more than anything ,i couldn't help but feel sad for handa almost every episode , there was one episode in particular where he finally had the courage to talk to someone and he was extremely happy then he told his mother that and she replied \" oh that's good \" and then he realized how all that hard work he did was almost nothing special compared to normal people so he just sad there doing nothing , man that was heart breaking .\\n\\n\r\nAnyway now moving on to The characters : there were good characters in this anime and almost all of them had unique personalities like Eraser , Junichi , Reo and all the others but there were 2 characters that stood out in this anime other than handa of course and those 2 are Yukio and Kawafuji .\\n\r\nYukio was the normal character but he knew how bad handa-kun felt and tried to help him out as much as possible which i think was nice to see but kawafuji on the other hand was probably the worst one in the anime , he was the reason handa's life was miserable just because he was rejected and yet he never really tried to help him get back to his normal good life that he had even after seeing him suffer .\\n\\n\r\nThe comedy in handa was good but sometimes gets way too repetitive which i think was the reason many people hated this show , i almost dropped it myself but i wanted to how it would all end at so i continued watching .\\n\\n\r\nOverall : i did enjoy this anime , now would i recommend it ? probably but i would tell anyone to watch this before barakamon because barakamon sets the bar way too high for an anime like handa to be able to catch up to it .",
            "date": "2017-06-02T04:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 249109,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4063361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mezo-RPWPA",
                "username": "Mezo-RPWPA"
            },
            "url": "https://myanimelist.net/reviews.php?id=249109"
        }
    ],
    [
        {
            "content": "Barakamon was a series that gave the calligrapher  Handa Sei a journey through self discovery on an island village where he was able to create a form of calligraphy that he felt comfortable and happy with.  It was a show that garnered a decent following and had a relatively lasting popularity during 2014.  And so, to remind us that that series existed, we have Handa-kun, a look into his earlier days in a comedy gag series that...should've never been made.\r\nStory: As previously said before, Handa-kun is a series about Handa Sei in his school days, where he was still as awkward anduncomfortable as he was in Barakamon (probably even more so), thinking that literally everyone in his school hated him when in reality...he's considered as a god walking among them and that anything he says or does is law.  As a result, there's a misconception between Handa and the rest of the school (except Kawafuji and maybe Yukio) and thus, 'hilarity ensues'.  \\n\\n\r\nAlright, right out of the gate here, I'll tell you the thing about Handa-kun.  It's.  One.  Long.  Running.  Joke.  The entire runtime of the series is dedicated to some member of the cast (usually new members) coming into contact with the 'divine entity' known as Handa-kun, only to be swayed by his words (as well as taking them in the COMPLETELY wrong way) and changing their entire perspective of life before becoming indoctrinated into the Cult of Handa.  That's it.  \\n\\n\r\nAt first, this seems kinda amusing.  For the first few episodes, the awkwardness and overall comedy of the series is pretty funny because of how utterly ridiculous it is.  Then it doesn't become funny.  Then it REALLY doesn't become funny.  Then it becomes eye-twitchingly bad.  Good things come in small doses, and when you don't do that and instead use the exact same material over and over again, it becomes unbearable to watch.  Handa-kun is exactly that.  As the episodes run by, you'll come to expect the same things episode after episode but with increasing ridiculous cringeworthy scenes and even stranger characters, ultimately creating a show that's sad and difficult to watch.  (Devoting the entire school festival to ONE student?  Changing the curriculum to adhere to what he says accidentally?  Making something based on someone without their consent?  How can ANY of these situations be considered comedy?!)\\n\\n\r\nBy the end of the series, everything does get resolved...in some way, but not enough to salvage this series.  Admittedly, there are people who do enjoy this kind of comedy, but just using one joke for what equates to about six hours worth of material is not the way to write a comedy series, especially when the only gag you have is to torture some poor misunderstood individual with daily occurrences that he doesn't understand and is terrified about.  \\n\\n\r\nOverview:\\n\r\n-  The entire series is one long-running joke\\n\r\n-  Concept gets tired FAST\\n\r\n-  Episode writing gets worse and worse with every passing episode\\n\\n\r\nCharacters: Oh boy, where do I start with this one?  Characters, or should I say mentally challenged individuals are probably the number one reason why I despise this series and think that it's absolutely terrible.\\n\\n\r\nFirst it's Handa Sei.  Now, first off, we don't actually get much of Handa.  Yes, the title character of the series probably gets the least amount of screentime out of any of the main characters in this series.  In any case, Handa Sei is the same awkward and nervous individual that you saw in Barakamon, just de-aged about 5-7 years.  The main reason for Handa's existence is just to be a figurehead of reasoning for every other character's delusions and obsessions.  The dynamic of 'I'm hated but in reality, everyone loves me' gets old really fast, and Handa really doesn't do much in the series aside from cower away and wall himself off from the rest of the school because he feels alone and unwanted when in reality, that's not really the case.\\n\\n\r\nThen there're the nutjobs.  I'm not even going to separate and talk about them individually; the other characters are all nutjobs.  You have the Handa Force consisting of a delinquent, a bishonen, and the stereotypical glasses character who say they're Handa's friends when in reality, they all have barely any understanding of who Handa Sei is as a person, you have the girl who sits next to him who becomes a stalker with a pension for 'erasing people who threaten handa' after she was given Handa's eraser because she lost hers, the handa-kun copycat, the student president who for some reason makes her vice-president who is a burly man dress in the girl's uniform, and other various characters strewn about the series who're just as weird and strange as them.  On paper, they sound interesting and hilarious enough to be entertaining and fill the series with life, right?  Well...no.  The only character trait that have is the oddly stalkerish way of worshipping Handa.  Every new one that the series introduces begs to ask the question \"WHY?!\" because of how strange and borderline sad they all are and/or become.\\n\\n\r\nAnd for the characters I handpicked out, we have Yukio and Kawafuji, the two characters in the series who actually have some decent sense.  Sure, Yukio plays the 'I'm average, and everything about me is average, and I like it' card, but at the very least, he plays the straight man in this mess and tries to bring some kind of sense to all of the other characters in the series despite how fruitless it is.  Kawafuji's the same way, but he's more akin to a real person and also has common sense on the situation.  They help me bring back some sanity from this sh*tshow.\\n\\n\r\nOverview:\\n\r\n+ Some straight man characters to point out the sheer ridiculousness of this series\\n\r\n-  Handa is more of an idea than an actual character\\n\r\n-  EVERYONE ELSE IS A F*CKING BASKET CASE\\n\\n\r\nArt: Made by Diomedea, Handa-kun is...average looking at best.  The show has the animation that you would consider as standard fare for this day and age of animation, and there really isn't much I can say about this series.  I mean, the most they do is add your classic comedic facial expressions in order to accurately express the characters' emotions, but any more than that, and you're asking for a bit much.  \\n\\n\r\nSound:  The soundtrack...isn't all that interesting to be honest.  I mean, the opening has a rock song akin what Barakamon did for its OP, but it's leaning more towards heavy metal to relate to the sheer ridiculousness of the series.  (Which I think is what they were going for.)  But in all honesty, the OST isn't really anything to look forward to, and the voice acting is standard at best.  Hell, everyone in the series save for Handa sounds so damn happy that Handa is around that I can only say that that's the ONLY expression sound that they can make.  \\n\\n\r\nPersonal Enjoyment:  :)  So...what do I think of Handa-kun?  Ok, at first, I thought it was funny.  Like the overall ridiculousness of the series gave me a few laughs because of how dumb everything seemed and how the overall plotline was about these comedic misunderstandings.  Then it got old fast.  The show's inherent problems lie with the fact that it was just the SAME DAMN THING OVER AND OVER AGAIN.  Think I'm being repetitive in this review?  You try listening to characters shout the phrase \"Handa-kun!\"  \"Handa-san!\" \"Handa!\"  \"Handa!\"  God, that name is like nails on a chalkboard.  \\n\\n\r\nDid I like this series?\\n\\n\r\nIt's start was ok because the show wasn't so heavy on the misunderstandings or the stupidity of the situation, so it wasn't so heavy and more enjoyable than what came later.  Also, Yukio.  I really like the straight man in any comedy situation.  \\n\\n\r\nWhat didn't I like about this series?  \\n\\n\r\nOk, take what I said above and subtract that from the series.  What do you have left?  Everything I hate.  Cringe is about the only way I can even begin to describe this series.  As mentioned many times before, the series just went on and on with how Handa-kun was great and how Handa's the goddamn messiah to all of our problems while introducing more and more characters that belong to this nutjob high school where I can only shudder to think what they were all worshipping before this poor calligrapher's son.  They even have an episode where Handa thinks that he has a stalker, when in reality it's EVERYONE ELSE IN THE CAST STALKING HIM, and they go and assume that they need to protect him from someone who doesn't actually exist!  That's not funny!  That's not funny at all!  It's sad!  It's really, really sad!\\n\\n\r\nWould I recommend this series?\\n\\n\r\nNo, don't hurt yourself.  If you want to watch a series about Handa Sei and all of his glory...just...just go watch Barakamon.  This spin-off from hell was a mistake that should never rear its ugly head ever again.  It's a much better series and I would honestly say to avoid this dreadful cour birthed from the devil that honestly...wasn't even THAT funny to begin with.",
            "date": "2016-09-23T22:48:00+00:00",
            "helpful_count": 216,
            "mal_id": 229964,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=229964"
        },
        {
            "content": "\"This show is shit.\"\r\n-Basically everyone\r\nRemember that senile old relative at your family gatherings growing up with an oblivious grin emblazoned on their face, who without fail would tell the same cringeworthy story each time you saw them? Every time they'd start the tale's prelude, \"did I ever tell you about the time...?\", your parents would shoot you a glance or an eye roll signifying just to let them roll on with the story. It was always better to nod in agreement and force unwarranted laughter than to call them out on their repetitive idiosyncrasies. You almost felt sorry for them in a way, and bityou own tongue to preserve their blind innocence. Handa Kun is the anime version of this cheeky relative.\\n\\n\r\nSometimes in television, writers just don't \"get\" comedy. As I've said countless times, it's almost entirely subjective. Sure, there are some comedies that appeal to a larger fan base, but I don't value the same qualities you do and vice versa. The one metaphoric tightrope writers can balance on is the singular gag. The idea is to create an entire comedic show driven almost solely on one running joke throughout. Again, some may be quick to dismiss the validity of this idea because they don't care for the simplicity or subject matter as humor is in the end, subjective. For me, this type of comedy can succeed as in shows like Sakamoto desu ga? where the fact that Sakamoto was a perfect specimen of humanity allowed the gags to have unlimited potential. In Handa Kun, the running joke is much weaker. Instead, the writers focus on the over-explored idea of miscommunication. Although more commonly visited in slice of life anime, this awkwardness is addressed in the form of \"everyone is against me\" comedy through Handa's eyes. The result is a sputtering mess due to limited applicability and generic writing.\\n\\n\r\nThe first episodes were actually pretty funny to me. A troll of a girl with an elephantitis head, over exaggerated scenes between characters and awkward exchanges of dialogue looked promising. Various companion characters and antagonists were introduced as well. Unfortunately as the episodes progressed, I soon realized Handa Kun was written to be a one-trick pony... and not a very funny one. What Sakamoto desu ga was able to do that this series could not was keep the element of surprise. Sakamoto's comedy was limitless and unexpected, as Sakamoto himself would adapt to the scene in order to maintain his perfectionist status quo. In Handa Kun, the entire episode is often formed around a general misunderstanding between characters. The result is truly boring after a few excerpts, and honestly I couldn't wait for the episode to be over once I knew exactly how it would play out. I will say, Handa Kun does have better supporting characters... but that's like comparing Trump to Hillary. Nobody wins here.\\n\\n\r\nOMG! CAVE-CHAN, AREN'T YOU GOING TO ADDRESS BARAKAMON!?\\n\\n\r\nI would be lying to you if I said I wasn't looking forward to a legitimate prequel to Barakmon, one of my personal favorite anime. I thought it would be an endearing SoL with a clear plot and relatable characters, perhaps even exploring more of Handa's past with an outlook on why he got into calligraphy or something of that nature. After struggling to make it through this anime's brief 12 episodes I can assuredly say I feel ripped off. It's like asking for a sweet action figure for Christmas as a kid and getting the Great Value brand with a lopsided face and without the \"Kung-fu action grip\" (not that I'm speaking from experience, love you mom!) Handa lacks virtually all of his charismatic and likable features from the original and turns into a lame, meeker version of himself. It's almost enough to ruin the image of the series in my mind.\\n\\n\r\nHell I can't complain too much, Handa Kun and Barakamon aren't even produced by the same studio. Just do yourself a favor and temporarily leave the review to check out Diomedea's impressive resume. Literally almost everything they've made is a lackluster pile of poop. The directing in Handa Kun is not much better. Everything looks sort of bland and lacks anything really eye-catching. The first two episodes were handled well (except for the 10 minute broken 4th wall bullshit), but I think it may have been a pitched pilot for the studio and everyone kind of sat on their creative asses afterward. Perhaps Kinema Citrus, Barakamon's studio saw the source material's limited potential and ran for the hills. Though I'm not familiar with the manga for Handa Kun myself, but based on a few notes from my peers... It's not much better.\\n\\n\r\nThe characters in Handa Kun are not very memorable, except Akane. That dude's bad af. This isn't really an issue because of the comedy genre the anime follows. Most tropes are covered here, with an added bonus of elephantitis head girl. Like seriously, who decided this was a good idea!? Kawafuji's remergence was a brief refreshment, as I think he may be the only small semblance or similarity to its parent anime. I have to admit that some scenes really made me laugh at the beginning, but the lack of variety in the series took a toll on my patience towards the end. The same jokes are only funny so many times. Except Borat, that movie gets me every time.\\n\\n\r\nMost times, the art and composition can save an otherwise train wreck of an anime from the depths of mediocrity. Aside from a catchy OP and fitting ED, Handa Kun falters again. The art is nothing to get excited about. It's average by today's standards... something that seems rather par for the course where Diomedea is involved. The character models are relatively unattractive and most lack originality (sans elephant girl), and by far the best use of animation is found in the show's OP. Background music is too often recycled and left me saying \"oh, that track again?\" Voice acting was actually pretty decent, but this aspect has never saved an anime for me.\\n\\n\r\nUltimately, all that really matters to the person watching a show is whether or not they enjoy it. I've watched plenty of critical duds that I've revered as guilty pleasures, but alas Handa Kun is not one of them. It's few positives are overshadowed by the overall lack of effort the writers seemed to put into its creation. It's not an awful show, but so lackluster I kind of feel sorry for it. It's certainly not the prequel that Barakamon fans need nor deserve. As patient fans, the best we can ask for is an original series expounding on the first installment. I won't hold my breath any longer than you will. As always, thanks for reading and be sure to check out the rest of my Summer '16 reviews!",
            "date": "2016-09-22T13:27:00+00:00",
            "helpful_count": 77,
            "mal_id": 229827,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3895399.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/themegamancave",
                "username": "themegamancave"
            },
            "url": "https://myanimelist.net/reviews.php?id=229827"
        },
        {
            "content": "Handa kun has a very simple but reasonable setting that purposefully made for the sake of the comedy rather than its story or moving the plot forward. And dont judge this anime based off from its sequel (barakamon that came out first), because, you know, both of them is a slice a pretty typical slice of life anime with comedy as a mix to it. Since slice of life's essential facet is to add the comedy into them. All slice of life are like that, even if the greatest slice of life anime in the UNIVERSE like Barakamon that delivers its theme, character development, relationship,and philosophy for success in life and shit.\\n\\n\\n\r\nHanda-kun's comedy is a pretty unique and peculiar one to me as an anime \"watcher\", or as a fucking Otaku. Like really, just call me an otaku coz you all are one as fucking well. But why is it peculiar? That style of comedy though, through the excessive uses of miscommunication, misunderstanding, and characterization or ascription of godly, so fucking pro and badass characteristics to the MC. This anime may seem like an identical fucking anime to the Sakamoto Desu Ka series but it's really not. Just some of the theme, character's position and other facet are, but not its entirety. The side character or minor and the support character are alot more \"good looking\", or suitable for the role that they have in the anime. With some addition role that hasn't been introduced to Sakamoto Desu ka ofc. Like the horny ass otaku who draws shit loans of ecchi shit, or reverse gender of someone. \\n\\n\r\nThe earliest part of the anime is pretty funny in my perspective, but as the anime progresses, i just find its forced comedy, repetitive uses, and the lack of character development abit too much now. This is not fucking Re:zero for christ sake, it doesn't makes it ok to spend the 16+ (in this case it's 12 episodes) for a character development or realization to happen. Barakamon has done a fine job in that, but to see the prequel to fail to do so, this is just sad to me as a hardcore (presumably) Barakamon fan. Coz that shit gotta be one of the fucking best slice of life anime in the fucking universe no doubt. Plus they also took a real local kids to voiced each kids character, it's fucking nice. You could definitely feel the bond between the voice actors and the character simultaneously as you watch the anime, and that's what makes this anime so great. You should definitely check that one out. I wouldn't recommend you to compare or watch Handa-kun first, then go to Barakamon. Just pretend that this anime has really nothing to do with Handa Sei in Barakamon. But this is just a comedy with no real contribution to his character (aside from being a loner, unsociable, but wanting to interact with others kinda person). In the later episode or halfway to the end of the series, comedy may not even be funny to you anymore. You know why? Just fucking watch it if this kind of comedy is within your alley of interests. While people have different idea of humor when it comes to these kind of anime. Just so you know, our sense of humor can never be the exact same and you gotta respect that. Some might rate this a 1/10, or a fucking 10/10 for crying out loud. But tbh, this anime isn't quite bad. Sure the quality of the comedy drop in the half way through the existing episodes (just like Sakamoto Desu Ga). But for real, it was a funny show lmao. Give it a go.",
            "date": "2016-09-27T18:03:00+00:00",
            "helpful_count": 55,
            "mal_id": 230429,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=230429"
        },
        {
            "content": "Handa-kun has a problem...and no, not just Sei Handa's problem of misunderstandings of his classmates...as in the anime has a problem AS well as Sei Handa's problem of misunderstandings of his classmates. Here's LA's beef with Handa-kun...\r\nFor what a good-meta first episode of the Handa Force gave LA, Handa-kun quickly turned into a repetitive comedy anime without a reason to watch Handa-kun other than seeing the same thing happen to Handa-kun and the Handa Force and EVERY OTHER CAST MEMBER getting misunderstood sans Yuki Kondou and really the first episode essentially told LA further down the line what kind of anime this was gonna be,Handa Force having almost 80% screentime with Handa himself having 20% from the anime itself...ohhh boy...this is gonna be a sit...let's get to one of LA's grips about Handa-kun.\\n\\n\r\nSo who's the Handa Force?...they are Reo Nikaidou voiced by Tetsuya Kakihara a classmate of Handa and the fashionista and model, Akane Tsutsui voiced by Yoshimasa Hosoya a delinquent and another classmate of Handa, Junichi Aizawa voiced by Yuuya Hirose the smart guy and another classmate of Handa and finally Yukio Kondou voiced by Daiki Yamashita, the only genre savvy guy who doesn't say much besides the obvious in his head (but that doesn't help much due to the paranoid misunderstandings of Handa-kun and the obliviousness of Handa Force in general even when Yukio speaks up), an audience surrogate of sorts. At first their introductory episodes of each of these characters were fine, until they finally formed Handa Force and continuously misunderstood Handa (though even in their intro episodes, ALL OF THEM sans Yukio misunderstands to get them to love Handa and eventually stalk him). Why are they grating on LA?...because they are one of the major causes to the \"misunderstanding\" to the entirety of Handa-kun's comedy. Yes LA knows that Takao Kawafuji voiced by Kazuyuki Okitsu is the one who initiated this onto Handa but the Handa Force are the ones who misinterpret Handa's actions or words EVERY SINGLE TIME. \\n\\n\r\nSure Handa himself misunderstands ALOT but the Handa Force are the ones that reinforce the repetitive misunderstandings that get out of control of Handa's hands. Here's the thing, this is Handa's prequel anime to Barakamon as to how he became like he did in Barakamon and although we quickly see how Handa became how he is...Handa-kun doesn't feel like Handa's prequel backstory...it's nothing but a repetitive comedy anime of misunderstanding situations where Handa is the reactant to most of the things that occurs and Handa is not in the forefront of the anime...the Handa Force is...IT'S EVEN SHOWN IN THE ANIME POSTER!!!. For a prequel comedy anime, Handa-kun could have been another good Sakamoto desu ga?, what with the central character being the \"centre of attention\" and causes most of the comedy, but Handa-kun is huge miss in that kind of direction because as much as Handa Force likes to think that Handa is the centre of attention, it's easily overshadowed by the Handa Force themselves and them doing the same repetitive misunderstanding comedic skits EVERY SINGLE EPISODE...it becomes annoying and it got to the point LA started HATING on the Handa Force much like Handa did. If there was ANY character LA liked...it was the librarian character voiced by Rie Kugimiya but she quickly got replaced by the genre savvy Yukio Kondou from the Handa Force by default. \\n\\n\r\nHanda-kun could have jumped the chasm of repetitive comedic skits that got old fast, but IT could have, with either ACTUALLY went into a bit more detail on Handa's backstory or went batshit crazy non-repetitive formula anime like Sakamoto desu ga? did...LA continued to watch it just for something new and that came rarely.\\n\\n\r\nReally Handa-kun's biggest sin it did even for the fact it's suppose to be a COMEDY was becoming boring to watch with it's repetitive running gags and nearly every single character misunderstanding things INCLUDING Handa himself. Sakamoto desu ga? works as he works as he is the catalyst of his batshit crazy antics and methods for the other characters to bounce off of and be reactants to Sakamoto's antics, Handa-kun is the exact opposite, the supporting cast are the catalyst and THEY do the crazy misunderstanding skits and Handa is the one who reacts to himself and then the supporting cast have to bounce off THEMSELVES and be the reactants once again, the flow of comedy ends with Handa all due the misunderstanding and his shyness and doing this routine over and over and over and over again is what makes the comedy stale VERY quickly. The second biggest sin is that as LA watched Handa-kun, it made LA question as to whether Sei Handa from Barakamon was ever a genuine and investable character to begin with if his backstory almost literally has him at the whims to his own misunderstandings, his shyness and little backstory shown in his highschool days to get him to who he was in Barakamon. Handa-kun had the material from Barakamon to make a good comedy based on Sei Handa's life, instead we got a wasted potential that has little to do with the main character the anime's title is named after, if your SUPPORTNG CHARACTERS (Namely Handa Force and any other character that gravitates to this group) have more screentime than the MAIN character the anime's title is named after, your kinda missing the point of a prequel of pre-established character, hell the anime might as well be called \"Handa Force and Thier Misunderstandings the Anime\" than \"Handa-kun\".\\n\\n\r\nIn terms of animation, the animation was \"decent\" overall using pastel colors and a vibrant character cast to go with it. The animation does have some good bits such as Handa's Wall for instance as well as the comedic \"moments\" of over-exaggeration at times does make the scene transition well. On speaking of which the transitions used in Handa-kun (the calligraphy brush wipes) were also a nice detail. The animation done by Diomedea is overall decent to say the least but the animation CAN'T be the only thing good about it if the comedy can't stand up to it.\\n\\n\r\nIn terms of voice acting, well as a good of voice cast as this was, LA had a few annoyances, mainly from the Handa Force especially Junichi Aizawa voiced by Yuuya Hirose as his misunderstood eccentricities were annoying and LOUd to say the least and the rest of the Handa Force weren't much different, at least the majority of the voice cast did some well done reaction grunts/remarks or fanboy/girling that was ok enough. Sei Handa's voice actor Nobunaga Shimazaki, as much as it was \"in character\" for him to be shy and paranoid, it just felt that was ALL he was doing. The voice cast for LA is slightly mixed but LA's favourite voice actor goes to Miyoko Kinjou voiced by Kaede Hondo for her schizophrenic fangirling over Handa at a flip of a switch...she was really unexpected...seriously.\\n\\n\r\nThe ending FINALLY deals with Handa and his misunderstood paranoia and LA really LA just has to say \"IT TOOK YOU LONG ENOUGH\", the ending pretty much was what LA wanted to see...SOMETHING NEW...slight though but with Handa's revelation, it helped at bit, but not enough for LA to redeem Handa-kun for his comedic sins it placed on the anime and Sei Handa as a character...the ending was good, but the payoff was well enough not worth it.\\n\\n\r\nReally aside from the very good-meta first episode, the  intro episodes of the Handa Force members and the finale to it's decent animation and voice acting, these strengths can't outweigh the immense amount of character and comedic flaws LA just kept seeing on repeat and yes LA knows that comedy is subjective but that was just what LA saw watching Handa-kun.\\n\\n\r\nHanda-kun isn't the best comedy anime this Summer 2016 and failed to be funny as it thought that it's \"one joke wonder of misunderstandings\" could make the anime and nothing else, hell even Kono Bijutsubu ni wa Mondai ga Aru! this season knew to shake things up from time to time!. Now Sei Handa...please DON'T MISUNDERSTAND this review...LA WANTED to like this anime...LA doesn't hate Handa-kun...just disappointed.",
            "date": "2016-09-23T21:40:00+00:00",
            "helpful_count": 23,
            "mal_id": 229962,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=229962"
        },
        {
            "content": "I can't understand all the bad reviews- laughed my ass off the entire series, one of the best anime comedy series I have ever seen.\r\nA story of misunderstandings and lots of weird people...\r\nAfter his ''best friend'' Kawafuji tells Handa that everyone hates him in middle school, he has the biggest paranoia that mankind has ever seen. \r\n(Handa filter ON)\r\nEvery episode contains 1-3 'stories' around Handa and other things in his school.\r\nEven though it's almost the same every episode it's still hilarious af.\r\nThe art does what it's supposed to do, especially love Handa's pissed expression hehe. (.////.)\r\nOpening and characters were weird, well, just like the show.\r\n(Likeactually, what the hell is wrong with that opening)\\n\\n\r\nCan't really say anything else, just a really entertaining series and awesome humor.\\n\\n\r\nSo if you liked loved Barakamon, like me, you will also love Handa-kun :)",
            "date": "2016-10-18T07:00:00+00:00",
            "helpful_count": 22,
            "mal_id": 231996,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4833525.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kat0211",
                "username": "Kat0211"
            },
            "url": "https://myanimelist.net/reviews.php?id=231996"
        },
        {
            "content": "Mine will be shorter than 90% of the reviews here.\r\nI believe what threw most people off with this series was its genre.\r\nBarakamon 80% slice of life; 20% Comedy\r\nHanda Kun: 80% Comedy; 20% Slice of life\r\nOf course, the above percentage I provided was solely based on my opinion. I believe most people hoped for a slice of life feel which exactly what Barakamon was but this series didn't deliver this.  Instead, comedy moments took over despite the repetitiveness. Essentially, we all have a different opinion but this series took a different path from its predecessor; therefore, please try to watch this without comparing to Barakamon.",
            "date": "2016-12-01T00:23:00+00:00",
            "helpful_count": 18,
            "mal_id": 234687,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5871953.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/roehell",
                "username": "roehell"
            },
            "url": "https://myanimelist.net/reviews.php?id=234687"
        },
        {
            "content": "Its kind of sad a lot of reviewers hating this series because it is repetitive and boring but I'll do my best to give a positive reviews and try to make you watch it.\r\nHanda-kun is the prequel of Bakaramon, and this anime covers Handa Sei's High School life. The story each episode has a common sequence new character - hate handa - handa makes a move - misunderstoods - likes handa. Although it has that formula I still found it entertaining because it has some moment where you can smile, giggle, and cringe. Also the characters are pretty funny(for me) and each of them havedifferent ways of interpretation of Handa like someone sees him as god, respects as powerful man, wants to be him, rival and etc. \\n\\n\\n\r\nHanda-kun vs Bakaramon\\n\\n\r\nThere is a huge difference in both series because it has different story and how it is presented. In bakaramon it is focused on Handa Sei's improvement as a person while in Handa-kun it is focused on his struggle on how can he maintain his persona(that is wall joke i guess).\\n\\n\r\nSo to be precise these two series should be viewed as an art(since this anime is focused on calligraphy)  Handa-kun represents appreciation while Bakaramon represents motivation or inspiration. \\n\\n\r\nHow can I say it that way?\\n\r\nYou have to understand the people around Handa Sei. In Bakaramon, people around him always tries to make him different stuffs and they interact with Handa in a different way and it is the not the usual way Handa was treated. How can it be inspiration/motivation, inspiration usually fires when new things is being experience and motivation because of the words that townsfolk says to him like \"People always look up, the key is a breathe look down and you will see opportunities\"  not the actual quote but i hope i get the context from the mochi episode. While in Handa-kun, people around him always misunderstood his actions but this kind of interpretation always lead to positive rather than negative so that's why I call it appreciation. \\n\\n\r\nEnding remarks:\\n\r\nI like Handa-kun and I wish it has a second season its either his 3rd year highschool or his college life because I still don't see the people on the picture in bakaramon. And lastly its hard to watch bakaramon without imagining ERASER is around the bush watching him xD",
            "date": "2016-10-03T09:07:00+00:00",
            "helpful_count": 16,
            "mal_id": 231004,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/bunnyheaven",
                "username": "bunnyheaven"
            },
            "url": "https://myanimelist.net/reviews.php?id=231004"
        },
        {
            "content": "It's hilarious as f*** on how they treat Handa-kun as a God here. But, this is most certainly ain't Barakamon though as most of the characters here are not present and instead we focus more on about Handa-kun's High School life 6 years before the actual scenes.\r\nLadies and Gentlemen, I give to you, the prequel of Barakamon, Handa-kun.\r\nLong story, short, Handa-kun is all about Handa's quirky High School days. His classmate's and other students' perspective, he's the most popular guy in school and everyone likes him. From his good looks, to his coolness and over-the-top seriousness. But in Handa's perpective, however, he taught that thisis an opposite matter, he's anti-social, he's uncomfortable to someone before him, he's frightened so much it's like someone is watching him menacingly, and he thinks that everyone hate him it's like he was a small fish in a big ocean filled with sharks and a large chainsaws installed in their fins. Handa-kun is, when it comes to comedic approach, is actually funny... Kinda a slapstick manner with 5% sex jokes. And most of this jokes, we're all about Handa's misconception and misleading approach towards someone.\\n\\n\r\nTo explain the concept, imagine you we're jumping at the roof of the top of the building because you learned that your crush has a girlfriend. But, as you we're about to jump, suddenly someone came, and it was your crush, talking about how important for you to live. But instead he was taking an eye contact towards you, he was actually talking about a mistreated table with a lot of markings. And due to misleading approach, you cried because he's right. But then again, he was just about the table and he doesn't even know what was going on that particular day. One day later, you saw his girlfriend, and as you're surprised that you saw her GF, she asked where's the Parent meeting assembly. As you repeat the word \"parent\" coming from her. You mistakenly identified her as GF. And you learned that his \"GF\" was actually his mom.\\n\\n\r\nThat's what Handa-kun's plot is. The whole theme is all about misconception towards someone and what kind of mistakes that the characters do, Handa is right there to correct it without knowing what was actually going on around him. And because of that, they treat Handa as their messiah because of what he'd done over the past episodes. Even though, Handa has no idea and his self-esteem amongst peers is very low due to his introverted state after what Kawafuji did to him in middle school, which is I'm not going to spoil as this is how Handa get his major character development.\\n\\n\r\nThe characters, on the other hand, is 1% Barakamon, 99% Handa-kun. On the side of Barakamon, they've retrieve only three; Handa Seihuu, his mom, and Kawafuji. The rest we're his classmates, the others were students of their school, a professor, the boyish president of the student council and her \"girlish\" assistant, and their 2 rival schools. There are few character development here though as this anime is focused more on humor. Some of which we're came from their character backgrounds, and most of them was the cause of Handa's \"helpful hands\". Which leads them to get over-obsessive towards him, idolizes him, or in worst cases, stalking him.\\n\\n\r\nThe sound, well, the OP is the big issue here. It's really surprising that my expectations here on the OP is, actually, over the radar. Comparing to Barakamon's melodic soundtrack. The OP makes me laugh though as I really can't take it why they've choose the rock song than what they've done in Barakamon. It's like they put Maximum the Hermone's Death Note theme to the another comedic gold anime \"Nichijou\" and then put a 1 minute video on how hardcore the anime is. For the seiryuus, well, I don't really tell what's the difference between the original Handa's seiryuu to the new seiryuu as I was just focusing more on the storyline of the anime itself. But, I guess it was good nonetheless. However, if you compare the OP and ED song of this anime, the ED is the only theme that fits the concept of this anime. This is how I depict how the OP is before. But now I've seen the OP, well... That really escalates my expectation because of that...\\n\\n\r\nOverall, this anime will certainly not going to fail you smile or laugh. It's really cool to see the prequel of Barakamon and what Handa's High School life looks like. It's a fun anime series that you might wanna check it out. It maybe low on the MAL's anime list, but still, the anime is still fresh and the theme is kinda unique to this anime. It's really good to be honest, and again, try this one out. You'll not going to regret it.",
            "date": "2016-10-23T09:58:00+00:00",
            "helpful_count": 15,
            "mal_id": 232443,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4618412.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VaasMontenegro",
                "username": "VaasMontenegro"
            },
            "url": "https://myanimelist.net/reviews.php?id=232443"
        },
        {
            "content": "Hey folks, this will be a review for Handa-kun. This show seems to have a few people upset with how it was handled. This show is not Barakamon. However this show is an excellent comedy, and highlights how Handa came into his personality.\r\nThere really isn't much of a story. Handa thinks the entire school hates him. In reality everyone loves him. How they tell the story is what made it fun to watch imo. Handa is the main character but the handa force (Kondou, Nikaidou, Tsutsui, and Aizawa) are the tellers and focus of the story. The misconceptions surrounding Handa bring these characters together tocreate the \"Handa force\" in which they spread false truths around as they misunderstand Handa's actions.\\n\\n\r\nI'm not sure what people wanted to be honest. Each review brings up that they had wanted a legitimate prequel to Barakamon, but what would that be? To me the warmth of the characters and the enjoyment of discovery of new things and oneself was something you cant just transfer to another show without it seeming forced or lackluster. This show chooses focus more on the comedy. What people are calling strange or bad is also an interesting way of tackling the show in general. Overall I'm happy they didn't go for a \"Barakamon 2 lost in high school\" type show. \\n\\n\r\nThe art was pretty standard, and so was the soundtrack.\\n\\n\r\nThe characters as eluded to make this really enjoyable. They each had a corrosive or main character centered personality(the intelligent class president, the handsome model, the brutish delinquent, the normal Joe). Handa however is nothing really special, he is great at calligraphy and he is well known. This makes the misunderstandings really enjoyable to watch and not follow in the footsteps of a show mentioned in others reviews a lot(Sakamoto desu ga?). Where as Sakamoto uses the main character to drive change directly and rather boringly this show uses misunderstanding and side characters to drive change. \\n\\n\r\nI enjoyed this show a lot. It was a simple comedy show which so happened to be happening around Handa. I think the hate received is a bit to broad and muddled. This show wasn't as \"brilliant\" or heartwarming perhaps as Barakamon. However it follows in the same light. Handa is this man who has a strange and odd view on things. The world around him shifts and changes do to his actions, but more importantly, the actions of the people around him change who he is.\\n\\n\r\nThe comedy was rather straight forward, and though the underlying theme of misunderstanding was present it felt like each situation was new and fun. As comedy is subjective its hard to make this the focal point of an argument. The reason its the focal point of mine is that this show was doomed to fail from the start. You will never have a Barakamon clone. So they have to decide how to handle the material. They decided to bank everything on this strange perspective comedy and imo they nailed it on the head.\\n\\n\r\nTLDR: Don't go into this with Barakamon 2 in mind. Relax and enjoy what the show presents.",
            "date": "2016-09-28T17:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 230490,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=230490"
        },
        {
            "content": "The story of Handa-kun is pretty simple line. Handa sei is a normal high school average guy who presumes that everyone around him hate him for no reason. There is a black telephone booth kind of aura wall around him most of the times he is at school. At home how he behaves shown very little. Story beautifully unfolds how his friends' group increases thanks to the misunderstandings of all the people around him. It reminded me of 'school rumble'.\r\nEvery one in his school chants his name and even student leaders of some notorious high schools in his vicinity, consider him with regard. It's ahilarious showcase of the misunderstandings of people who come in contact with him. Only the viewer, his friend kawafugi and the average guy in his class who becomes member (forcefully) by the others know that Handa is a simple minded shy person who is sensitive to the actions of others towards him.\\n\\n\r\nArt:  Its good. \\n\\n\r\nAnime designers taken lot of effort to show it in decent way though there are some minor show case of ecchi hints but are overtaken in a flash by Handa's simple minded comments. \\n\\n\r\nENJOYMENT: After reading some of the reviews (who gave 2 or 3 rating) for this anime, i skipped it but now i am happy that i saw it with my mom. It's refreshing and HILARIOUS story of a person who avoids people around him.",
            "date": "2017-02-24T02:05:00+00:00",
            "helpful_count": 9,
            "mal_id": 241257,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3838527.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/deep3anime",
                "username": "deep3anime"
            },
            "url": "https://myanimelist.net/reviews.php?id=241257"
        },
        {
            "content": "Let me start off by saying that I don't believe it's necessarily fair to judge an anime based on its legacy. Perhaps on a personal or contextual level, but an anime, show, or any form of media should, if possible, be judged on its own merits and accomplishments. Therefore, I don't think it's fair to call Handa-kun bad just because it didn't follow the same path as it's amazing predecessor, Barakamon. It should be judged as what it tried to be, not what people expected it to be. It was clearly made to be something different, and there's nothing inherently wrong with that. \r\nSo withthat said, I will judge this show based on its merit as a comedy.\\n\\n\r\nThis show sucks.\\n\\n\r\n(Good) Comedic shows usually come in two forms. One is the dynamic/sophisticated comedy. It's a comedy at heart, but it's given an interesting dynamic (ex. interesting characters) that help flesh out a theme or aspect of the show (GTO, One-Punch Man). The other is just a pure comedy that simply exists to tell jokes, often referred to as gag anime/manga (Monthly Girls' Nozaki-kun, Tanaka-kun is Listless). \\n\\n\r\nHanda-kun falls under the latter category. The cast of characters simply aren't very interesting, nor does the story attempt to tackle any wider picture. It is very obviously a simple comedy, and it doesn't attempt to have any level of depth. However, Handa-kun generally fails to even accomplish a basic comedy. It tells the same joke by using the same premise, the same process, with the same punchline. It's redundant and formulaic. \\n\\n\r\nNow I'll be the first to admit that having a formulaic comedy isn't always the end-all-be-all of a show. Monthly Girls' Nozaki-kun basically uses the same premise and punchline for 90% of its strips. However, the joke is either creative or told well enough where the joke still retains its humor. Sakamoto desu-ga is very formulaic and an average show at best, but it still is known for many humorous, endearing scenes due to how creative it can be. Handa-kun is not among the list of exceptions, however.\\n\\n\r\nThere are two huge problems with Handa-kun that emphasize it's formulaic flaw. The first is that the overarching joke and premise simply isn't funny. The set-up of the joke is always based off the artificial drama that is Handa's misunderstanding of everyone's perception of him. The process generally involves an uninspired \"solution\" that draws from various generic anime tropes. The punchline is that Handa continues his misunderstandings through some freak accident. I won't go into huge detail dissecting every aspect of the joke, just that it simply isn't funny (if you're curious, watch episodes 2 and later. Episode 1 is the only one told differently but it's terrible for a completely different reason). The second problem is that the formula behind Handa-kun is given no room for flexibility. It's so specific to the point where Handa-kun can't help but tell the same joke in the same way over and over again. That's basically what Handa-kun is: a bad joke told 12 times. (To give credit where credit is due, there are one or two episodes that have decent gags in it, but it isn't worth the 12 episodes)\\n\\n\r\nHanda-kun isn't a bad show because it's not as good as Barakamon, Handa-kun is a bad show because it's a basic, uninspired, formulaic comedy. This anime isn't worth your time, and it definitely isn't worth it if you're looking for Barakamon Season 0.\\n\\n",
            "date": "2016-09-29T02:37:00+00:00",
            "helpful_count": 10,
            "mal_id": 230516,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3518737.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KayB",
                "username": "KayB"
            },
            "url": "https://myanimelist.net/reviews.php?id=230516"
        },
        {
            "content": "I do not understand the negative reviews.  I really loved this anime.  If you like slice of life stories that will make you not be able to drink a soda while you watch it because your laughing to much this is the anime for you.  I have watched this anime and the one that came before it Barakamon and enjoyed both equally.  Both anime eventually bring the main character out of his shell and realize how the people around him see him.  Don't watch this anime as a continuation of Barakamon because though its got the same main character theyare not the same anime and should be treated differently.",
            "date": "2016-12-06T06:49:00+00:00",
            "helpful_count": 9,
            "mal_id": 234982,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3594937.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/elliehanna",
                "username": "elliehanna"
            },
            "url": "https://myanimelist.net/reviews.php?id=234982"
        },
        {
            "content": "Barakamon is one of my favourite slice of life anime of all time and I was disappointed that it only has 12 episodes. After hearing about the prequel, I got a bit too excited because I get to see more of Handa but I also told myself that the prequel exists just to capitalize on Barakamon's success. And.....After finishing the show, I guess I was right. \r\n[Story]\r\nThere's a lot of reasons why I love Barakamon. From its relaxing settings to Naru being one of the cutest and most fun anime characters to watch to Handa’s amazing growth and him coming to terms with his careeranxieties by living in a rural countryside, it was a great piece of quality show that I really enjoyed. The comedy was also one of the best I've seen in anime. I'm all for more Barakamon content so that's why I was a bit excited for Handa-kun. After watching the first few episodes, I was honestly a little bit disappointed. \\n\\n\r\nSo what happens when you take out all the core strengths of Barakamon and turn Handa into a teenager and put him in a high school setting? Well, you get this. Although, just because I'm a big fan of Barakamon doesn't mean I hate Handa-kun. Handa-kun actually turned out to be a decent series. I also admit that Handa-kun's comedic aspect was good at times but decent for the most part and it made me laugh at some parts of the episode. Except the first 10 minutes of the first episode breaking the 4th wall, that scene didn't make me laugh at all. Though, I still think Barakamon's comedy was 2 times better.  \\n\\n\r\nThe show, as a whole, is built on misunderstandings. Unlike Barakamon, which impressively portrayed Handa's amazing character development, this show only focuses on Handa's school life and the things that he has to face every day because of this \"misunderstanding\". He thinks that everyone hates him but in reality, almost everyone loves him. Now, why does he think like that? It's all thanks to Kawafuji (Remember him from Barakamon?) trolling the shit out of him and Handa actually believing his joke. Since Kawafuji finds the situation funny, he's letting all the events happen. That's the whole joke of Handa-kun. \"The misunderstandings between him and the students\". Though, it never gets tiring because the jokes has its twists every episode that keeps the joke fresh for the show's entire run. Plus, there's about 2-3 different segments per episode so it isn't just 24 minutes of Handa and that same student for a whole 24 minutes. Each segments focuses on different characters with a different situation and I, admittedly, was laughing my guts out on some of the episodes (mostly in the second half of the series). I just find it hilarious that Handa and the students, especially those on the Handa Force, are never on the same subject and they see things differently. \\n\\n\r\nAlso, some of the jokes on Handa-kun were references to Barakamon and it was a nice touch. The reference that I loved the most was the episode about a student who is a fortune teller, with a very accurate fortune telling, and she predicted Handa's future and said \"So many children despite not having a single sense of sex drive!\" which then shows a background with the kid's silhouette from Barakamon. I love it and I'm glad they did that. God, I miss Barakamon\\n\r\n______________________________________________________________\\n\r\n[Art/Animation]: (7.5/10)\\n\r\nThe Art and Visuals were pretty decent for the most part. The animation was ok, for a slice of life setting and the character designs are good but not the greatest I've seen. The background, on the other hand, looks really cheap. I mean, what the fuck? It looks like a shaded drawing but was horribly rushed. Is there supposed to be some meaning in the cheap background or is it cheap because they didn't have enough budget? Either way, I didn't like it. \\n\r\n______________________________________________________________\\n\r\n[Sound]: (7/10)\\n\r\nThe soundtrack wasn't really anything special and nothing stood so none of the OSTs is worth mentioning. It's just your typical soundtrack for a slice of life anime. Now the OP and ED theme song(s)\\n\\n\r\nThe OP theme song is \"The LiBERTY\" by Fo'xTails. I did not like the OP theme song at all. I'm ok with songs that are rock but heavy rock is not my cup of tea. I ended up skipping the OP after hearing it on the 1st episode. \\n\r\nThe ED theme song is \"HIDE-AND-SEEK\" by Kenichi Suzumura. Now this song, I like. I really love the song's upbeat tune, the melody and that amazing chorus. Plus, the singer's voice is amazing. Also, the ED Animation, while simplistic, was stunning to watch. I love how the amount of characters walking in the ED grows as more characters gets added throughout the series.\\n\r\n______________________________________________________________\\n\r\n[Characters]: (7/10)\\n\r\nThere's really nothing much to say about the characters except that they're just there for the sake of comedy. A new character or a bunch of new characters gets introduced almost every episode and some of the characters will either be back in the future episode or they won't make an appearance again after getting introduced. For example, Mori Maiko, who has feelings for Handa, and her friend with a big-ass head Juri gets introduced in the 1st episode but they barely make any appearances in the future episodes. Like I said, they're just there for the sake of comedy and they get little to no character development (Except the Handa Force members. They get a decent amount of character development). The characters are enjoyable to watch though. The characters vary from a librarian girl who has deep feelings for Handa, a yandere girl, a \"normal\" boy, a \"trap\" student council president, the \"pretty boy and etc. The show has a lot of variety in terms of characters' personalities that makes watching these characters very interesting and not boring at all. \\n\\n\r\nHanda was a lovable character in Barakamon and watching him in the 1st episode was just.......I don't know. The way he acted in the 1st episode was not the character I fell in love with (No homo). He wasn't even THIS dense in Barakamon. Then I realized that Handa is a teenager in this series. I just couldn't believe that Handa is that dense to the situation around him. Even I'm not that dense and I can read the situation around me (Teenager here). Yea, don't remind me, it's all for comedy. Though, it took a while for me to get used to his teenager side and after that, I enjoyed watching him go through his high school life with full of misunderstandings. \\n\r\n______________________________________________________________   \\n\r\n[Enjoyment]: (7/10)\\n\r\nFor the most part, I enjoyed Handa-kun but it doesn't even hold a candle to one of the best slice of life series ever \"Barakamon\". Handa-kun was just a hilarious and fun mindless show, for me, and I enjoyed the comedic aspect of the series and also, most of the characters in the series. \\n\r\n______________________________________________________________\\n\r\n[VERDICT]\\n\r\nHanda-kun, a prequel to one of my most beloved slice of life anime series of all-time, turned out to be an alright series at the end. The characters were somewhat enjoyable to watch, especially the members of the Handa Force and while the comedic aspect of the series may not be perfectly executed, it still made me laugh at some parts of the show. Overall, I enjoyed this show but to a certain extent. Of course, if you were to ask me which show I enjoyed more then Barakamon will be an obvious answer from me. If you were to view Handa-kun as a standalone series (or you haven’t watch Barakamon at all) then you might enjoy this series even more. Now that I've finished Handa-kun, I'm really hoping for a sequel (sort of) or an extension to Barakamon that expands more on Handa's life on the island because it felt way too short.    \\n\\n\\n\r\n[OVERALL]: (7/10)\\n\\n\\n\r\nPros:\\n\r\n+Enjoyable series to watch\\n\r\n+Show turned out to be alright at the end\\n\r\n+Decent comedy, with some parts of the show that made me laugh\\n\r\n+Enjoyable characters with different varieties in their personalities\\n\r\n+Nice touch on the Barakamon references. \\n\\n\r\nCons:\\n\r\n-Cheap looking background\\n\r\n-Handa's dense level annoyed me on the first couple of episodes\\n\r\n-Handa-kun, being a prequel to Barakamon, doesn't exactly feel like a prequel to said series.\\n",
            "date": "2016-10-22T12:11:00+00:00",
            "helpful_count": 9,
            "mal_id": 232348,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=232348"
        },
        {
            "content": "As you've probably noticed, the reviews for Handa-kun are varied, ranging from excessive praise to blind hatred. This is largely caused by the show's setting as a prequel to Barakamon, a heart-warming comedy series which aired back in 2014. \r\nNegative reviews seem to centre around the argument that Handa-kun wasn't worthy as a predecessor to such a well-reviewed anime, and despite having some returning characters, doesn't actually share much in theme with Barakamon, disappointing hardcore fans. Handa-kun's comedy is quite different to Barakamon's and is far more comparable as a series to Danshi Koukousei no Nichijou or Sakamoto desu ga?, than it is to theanime it is supposed to set the stage for. I can understand some disappointment, if you were hoping for more Barakamon content, but it really was quite clear from the start of episode 1 that this show wasn't really attempting that, at that point one ought to shift their expectations for the content rather than rile oneself up over the differences between the two anime. I think it's unfair to blast the series with a '2' or a '3' simply because you're annoyed that you might have to wait a while longer for an actual continuation of Barakamon's story. It's not worthy of a '10' or '9' either in my opinion, but I think that's just an attempt by some to boost the score to offset the overly-negative reviews, which is not what the scoring system is for.\\n\\n\r\nIn my opinion, Handa-kun is a fun and refreshing comedy, undeserving of the hatred it receives from some Barakamon fans. In a way, it isn't really a prequel at all, Handa goes through very little character development until the final episode, and it doesn't really tell us anything relevant to the story of Barakamon. You really could question why the series even bothers to use the same characters. Despite being a different type of show to Barakamon, it doesn't negatively impact on its sequel either. The characters, while not revolutionary or multidimensional, are entertaining and give the whole anime a carefree, relaxed vibe making it easy and pleasant to watch. The whole show is very easy on the eye and ear, the characters, the palette and the soundtrack all contribute to making the show something you can enjoy casually watching, not demanding your full concentration. It certainly had me refreshing my browser waiting for the next episode to come out.\\n\\n\r\nTL;DR - If you haven't watched Barakamon, watch them both, the order doesn't matter, they're both good albeit in different ways.  If you have watched Barakamon and DON'T feel a primal urge to protect the thematic integrity of its universe and lampoon anything which taints your holy anime, then watch Handa-kun, you'll have fun, it's not as good as Barakamon, but that doesn't mean it's an insult either.",
            "date": "2016-09-24T06:27:00+00:00",
            "helpful_count": 8,
            "mal_id": 229995,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3836815.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Enpsychopedia",
                "username": "Enpsychopedia"
            },
            "url": "https://myanimelist.net/reviews.php?id=229995"
        },
        {
            "content": "Here is my first review:\r\nSpoilers ahead\r\nHanda-kun is a prequel to the Slice of Life series Barakamon. However there except a few characters there were hardly any similarities between the two. To watch this series you don't need knowledge of Barakamon characters a priori.\r\nStory: 4/10: The story revolves around the main character Handa-Sei in his high school life. There is utter misunderstanding between Handa and other characters. Handa constantly believes that people around him hates him which is not at all in reality. There is no such plot here. In each and every episode a new character is introduced and for some stupid misunderstanding he/she startsto worship Handa. The logic may seems funny for one or two episode. However the same annoying thing to happen for 12 episodes gives you an headache.\\n\\n\r\nArt: 7/10:  The art is okay. Nothing spectacular in particular.\\n\\n\r\nSound: 7/10: Opening song \"The LiBERTY\" by Fo'xTails is pretty rough in my opinion. However, the ending theme by \"HIDE-AND-SEEK\" by Kenichi Suzumura is nice to hear. The OSTs were nothing worth of remembering.\\n\\n\r\nCharacter: 6/10:  Only 3-4 characters were present probably most of the time. Otherwise remaining characters were episodic. There were hardly any character development in the series. \\n\\n\r\nEnjoyment: 7/10: Handa-kun offers comedy and nothing else. I personally enjoyed those comedies initially. But later on it became quite repetitive and silly. \\n\\n\r\nOverall: 6/10: Handa-kun is a watchable series overall. However people searching for Barakamon elements here should refrain from watching this shit.",
            "date": "2016-10-12T05:00:00+00:00",
            "helpful_count": 7,
            "mal_id": 231655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4699598.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/xadon",
                "username": "xadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=231655"
        },
        {
            "content": "Note: Before I get into this review, I will say earlier on that this IS NOT a prequel to Barakamon. It doesn't relate to Barakamon in any way storywise.\r\nNow, avoiding the fact that this wasn't much of a prequel for Barakamon and more of a comedy of Handa's high school life, it was highly enjoyable. I would also say that his calligraphy wasn't a big part in it, although it is brought up many times.\r\nThere is no main story to follow throughout the series, but each episode has its own story to follow. Each episode usually revolves around everyone completely misunderstanding whatever Hand-kun is thinking/doingwhich leads to some funny scenarios. I even nicknamed this Misunderstandings-kun at one point haha. \\n\\n\r\nNow to pick it apart.\\n\\n\r\nStory: 6/10..... again, it doesn't really have a story to follow but more of a different story every episode with quite a lot of comedy.\\n\\n\r\nArt: 7/10..... it was good but nothing particularly impressive (other than Handa's calligraphy haha)\\n\\n\r\nSound: 8/10..... the background music for the most part was good, but I really liked the OP and ED. The OP is not what you would expect for this anime but it fit surprising well for me. The ED was nice to listen to as well.\\n\\n\r\nCharacter: 7/10..... Overall there were a lot of different character types which clashed together fairly well. \\n\\n\r\nEnjoyment: 8/10..... I found many of the comedic scenes highly enjoyable. Especially when Yukio was involved. He always recognized what Handa-kun actually wanted when everyone \"misunderstood\" him and it was funny seeing his reactions to them haha.\\n\\n\r\nOverall: 7.2/10..... If you are looking for a comedy with no real story to follow that is highly enjoyable, I would highly suggest Handa-kun.",
            "date": "2016-09-23T21:08:00+00:00",
            "helpful_count": 7,
            "mal_id": 229958,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5479652.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TeejSSX16",
                "username": "TeejSSX16"
            },
            "url": "https://myanimelist.net/reviews.php?id=229958"
        },
        {
            "content": "GENERAL - In Handa-kun we dive into Handa's high school life. While we do nto receive anymore of Naru and the rest of the islanders form Barakamon, Handa-kun  is sitll enjoyable to watch as an act of beign a prequel.\r\nSo the majority of the comedy comes from  Handa endlessly thinking that his clas hates him. With Handa be a well known calligrapher he often gets stares and this leads to him thinking taht they hate him. (Along with other many situations).\r\nWhile its comedy is nto as great as Barakamon it is still a fun series to watch I was  surprised by itas I wasn't expecting to much out of a prequel.\\n\\n\r\nCHARACTERS - So the characters are Handa and the Handa  squad.\\n\\n\r\nHanda seems a bit different here. In Barakamon he started off more rude and inconsiderate, here he seems more obliviou to what the people around him are thinking. Its somewhat odd to get use to this change in personality.\\n\\n\r\nHanda squad - Overall I would say they aren't too memorable. They do have there comedic bits but aren't anything special as characters.\\n\\n\r\nSOUND - The sound is nto really memorable either it is just your normal comedy slice of life music and does not have a stand out track.\\n\\n\r\nART / ANIMATION - For a slice of life the animation is fairly solid. Nothing insane but tis a nice art style and animation for thsi type of series.\\n\\n\r\nOVERALL - While its not Barakamon it is sitll enjoyable to watch and worth a watch. If you want to see mroe of Handa then you will get that from here.\\n\\n\r\nSCORE - 7.0\\n\r\nPERSONAL ENJOYMENT - 7.2",
            "date": "2016-12-23T01:10:00+00:00",
            "helpful_count": 5,
            "mal_id": 236202,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5491185.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/FT1278",
                "username": "FT1278"
            },
            "url": "https://myanimelist.net/reviews.php?id=236202"
        },
        {
            "content": "Throughout my entire otaku career I’ve met tons of dense male MCs that have a lot of girls fall for them, it’s just the thing with anime.\r\nHanda-Kun is different, Handa is not just dense, he’s overwhelmingly negative. A type of MC that is pretty rare, combined with the way the anime works, showing Handa’s thoughts make the anime extremely hilarious.\r\nAn example would be Handa thinking an obvious love letter is a letter of misfortune. And a cute girl asking him out is secretly trying to beat him up or bully him!\r\nHanda is a handsome, smart and introverted individual that many people like because his introversionmakes him a ‘mystery’ and girls seem to like it... He is Mr.Popular except that he assumes everyone hates him because he interprets what people say wrongly all the time and because he is dense and introverted, makes him think that he is hated throughout the school while on the contrary is loved by many girls and boys and even has his own mini fanclub (not that he notices)\\n\\n\r\nHe subconsciously makes himself seem cooler, kinder and overall a better person by doing stuff with a personal intention and others having the impression that he’s doing it for the other person.\\n\\n\r\nFor example (not taken from anime) Handa would push someone with an injured back and that person would think that Handa was trying to help his/her back \\n\\n\r\nHis mini fanclub are diehard fans and would be something like\\n\\n\r\nHanda rubs his stomach because it was abit itchy and his friends (fans) would think he is hungry and cook a bunch of stuff or smth\\n\\n\r\nThe best part is Handa only has one Friend whom he tries to not let anyone know they are friends as Handa is afraid he might bring his loner-ness to his only Friend while on the contrary his only Friend is having a blast watching Handa’s introversion because it is extremely funny and although he feels guilty, plans to just let Handa be for awhile longer XD\\n\\n\\n\r\nThe Seiyū were pretty decent, nothing particularly special and the art was fine too!\\n\\n\\n\\n\r\nTL;DR\\n\\n\r\nA dense calligraphist that draws no relation to Barakamon except for being the same person\\n\\n\r\nThings always work out oppositely or at least people have the opposite impression to Handa’s negativity making them think he is great.",
            "date": "2019-01-13T08:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 298931,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6221320.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DoomRanger",
                "username": "DoomRanger"
            },
            "url": "https://myanimelist.net/reviews.php?id=298931"
        },
        {
            "content": "After seeing so bad reviews about this anime here, I really have to defend it in some way. As different as this prequel is from Barakamon, it is originally based off a manga of the same name. As such, I would say read the manga instead of watching this anime as the comedic timing, the jokes and the different portrayals of the characters are masterful in the manga, but poorly delivered in the anime adaptations. Many gag insertions and unnecessarily timed extras resulted in the anime becoming confusing for viewers who might not have read the manga and understood who the characters were. I dothink that this anime is ways off from Barakamon, but do give the manga a shot as the manga made me laugh and cry in many different ways and its one of the best comedy mangas that I have ever read, and that this anime adaptation did not do it justice.",
            "date": "2018-12-24T08:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 296708,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3903507.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kaedecchi",
                "username": "kaedecchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=296708"
        },
        {
            "content": "This anime gets a lot of hate which is a bit reasonable when you think because handa-kun is a prequel to probably one of the best slice of lives ever made which is barakamon so of course people would want to compare them and see the same type of comedy and humor in handa . \r\nNow this anime is written under the comedy slice of life shounen genres but to me i think this falls under the Drama genre a lot more , i'm not sure if the mangaka intended for that to happen or not but this anime felt sad more than anything ,i couldn't help but feel sad for handa almost every episode , there was one episode in particular where he finally had the courage to talk to someone and he was extremely happy then he told his mother that and she replied \" oh that's good \" and then he realized how all that hard work he did was almost nothing special compared to normal people so he just sad there doing nothing , man that was heart breaking .\\n\\n\r\nAnyway now moving on to The characters : there were good characters in this anime and almost all of them had unique personalities like Eraser , Junichi , Reo and all the others but there were 2 characters that stood out in this anime other than handa of course and those 2 are Yukio and Kawafuji .\\n\r\nYukio was the normal character but he knew how bad handa-kun felt and tried to help him out as much as possible which i think was nice to see but kawafuji on the other hand was probably the worst one in the anime , he was the reason handa's life was miserable just because he was rejected and yet he never really tried to help him get back to his normal good life that he had even after seeing him suffer .\\n\\n\r\nThe comedy in handa was good but sometimes gets way too repetitive which i think was the reason many people hated this show , i almost dropped it myself but i wanted to how it would all end at so i continued watching .\\n\\n\r\nOverall : i did enjoy this anime , now would i recommend it ? probably but i would tell anyone to watch this before barakamon because barakamon sets the bar way too high for an anime like handa to be able to catch up to it .",
            "date": "2017-06-02T04:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 249109,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4063361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mezo-RPWPA",
                "username": "Mezo-RPWPA"
            },
            "url": "https://myanimelist.net/reviews.php?id=249109"
        }
    ],
    [
        {
            "content": "It's hilarious.\r\n+Funny.\r\n+Premise.\r\n+Feel good.\r\n-Niche humor.\r\n-Art & Sound.\r\nHanda-Kun is, in my opinion hilarious. It hit's  a niche spot for japanese anime humor that many might not like very much. \r\nHanda is loved by all, he just doesn't get it. \r\nThats the joke. Series explained. \r\nAll that's left then is to witness 12 episodes of misunderstandings, missed connections, running gag's and inside jokes. The series doesn't actually get worse over time, it just dig's further into it's strange premise which may not be everyone's cup of tea. Despite the strange premise the story actually makes a lot of sense, sort of, relatively relatable/realistic character themes help laya foundation to build the absurdity on top of.\\n\\n\r\nStill, my overal lscore is \"7\", so whats the downside in my opinion?\\n\r\nThis anime has barely passable cinematography, low-mid tier character design and sub-par sound. The visuals and sound round out at episode 3-4 (as if someone new to TV-anime was learning some much needed lessons during production).",
            "date": "2017-05-03T11:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 246883,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tsuruki23",
                "username": "Tsuruki23"
            },
            "url": "https://myanimelist.net/reviews.php?id=246883"
        },
        {
            "content": "You can say that this anime is a bit boring than I thought. I don't care about the element where the running gag is always repeated so the punchline it always can't get it. Even so, I enjoy every second when I watch this anime. Barakamon is a comedy anime that I admit the funniest slice of life anime ever. However, Handa-kun can't expect much of what is presented in this anime.\r\nHonestly, I'm a slight enjoy with what's presented in this anime although some of the reviews I read undergone the same experience about the problem of a running gag in it. In the firstepisode, Handa fanatics who call themselves Handa gang discussed to make an anime about Handa. In this scene, they use a little breaking the 4th wall inside of it although, for me, it doesn't work at all. Actually, the premise here is a story where he thinks he is hated by the people around him while the people around him actually think he is the actor at the school. He is familiar enough with his school to the outside of his school but, the premise will go on and on until we think that this is simply a story that is only repeated. A story that became the trigger even made it messy even though I enjoy it.\\n\\n\r\nThe art was built in such a way by Diomedia's studio. This studio works on famous projects like Mondaiji-tachi ga Isekai kara Kuru Sou Desu yo?, Ore no Nounai Sentakushi ga, Gakuen Love Comedy wo Zenryoku de Jama Shiteiru, and Aho Girl. So, I don't really give recognition to what is the point. Instead, it's like a typical slice of life anime in general. Not too exaggerated and nothing less.\\n\\n\r\nLike Barakamon, the opening song entitled 'Rashisa' by SUPER BEAVER is a rock genre. To Handa-kun, it's over the limit. I mean, I don't think if the opening song is ideal for the anime that discusses the taboo thing but it's something that rocks out's heavy metal. With screams and passionate guitar riffs, it might be a bit weird if I revive it. However, as a person who really likes metal music, I will not dispute it. The ending song also I think is very mediocre so I will not talk much about this. In this anime, they don't use the same seiyuu as in Barakamon. Sei Handa who are filled by Daisuke Ono in Barakamon instead of voiced by Nobunaga Shimazaki which I feel there is no uniqueness if I distinguish it with Daisuke Ono. Same as Kazuyuki Okitsu who fills the voice of Takao Kawafuji, no one with Junichi Suwabe although I consider it all mediocre as well.\\n\\n\r\nWe will see the daily life of Sei Handa where he went through his school with full of misunderstandings among his friends at school. Sei Handa is a closed person and thinks that all the people in his school hate him. He ends up keeping his distance from talking to the people around him. Each story goes with cliches thing, each character will live the day and will be introduced one by one where the originally hated with Sei Handa became inspired because of a rather funny misunderstanding. However, there are a lot of misremembered characters in this anime. Perhaps, in here is a bit too focused on a story that leads more to the Handa gang of Yukio Kondou, Akane Tsutsui, Reo Nikaidou, and Junichi Aizawa. In the first episode, Juri and Maiko Mori experience a mellow story that leads to a misunderstanding but solved fraternally by Sei Handa. The problem, these two characters immediately ignored in this anime and only get a small portion so it's considered a cameo. In fact, I almost forgot about these character at all. In addition to these two characters, in fact, there are much more besides these characters but I just don't know how big an omission that arises from this anime.\\n\\n\r\nIf I want to say that I enjoy watching this anime, I don't know. But, I really enjoy this anime although is a bit. Initially, my first impression of this anime initially declined after entering the core of the story about a misunderstanding that made me even more interested. It's just that, the comedy is always repeated until in the end, all of that becomes a below my mood little by little so it must be demanded to watch it. Moreover, the ending of the story in this anime also pissed me off when I remembered it as typical of anime slice of life in general. However, I've been watching a lot of slice of life anime but it doesn't end like this. So, I'm in the middle of my mood that looks ordinary.\\n\\n\r\nFrom the beginning, I didn't expect as much with this prequel from Barakamon. I was thinking this would be something of a hype like Barakamon but, I don't know how many times I said Barakamon in this review so I almost forgot this anime. For those of you who just want to find a slight comedy, this anime will be very suitable for you. So, I recommend for those of you who want to enjoy it and not too much attention to all aspects that exist. Handa-kun is a typical anime actually but not in accordance with what I'm looking for though I also enjoy it until the end.",
            "date": "2018-04-21T00:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 278627,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5592817.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Crack-san",
                "username": "Crack-san"
            },
            "url": "https://myanimelist.net/reviews.php?id=278627"
        },
        {
            "content": "The only reason Handa-kun receives a 5 is due to my love for Barakamon.  I was wishing so much for an amazing prequel for my favorite anime of all time, Barakamon.  Sadly, I was disappointed.  \r\nI really only enjoyed the Handa parts and his voice acting.  The overall story and other characters (that are not even mentioned in Barakamon) were pretty lame.  It was pretty unbelievable that Handa was the most popular kid in school but had no idea that he was that loved by his fellow students.  While in Barakamon he does have insecurities of being liked forhis work, he never seemed so socially inept.  Handa-Kun makes Handa look like a complete idiot.  Plus the internal dialogue of EVERY involved student in Handa's story was very annoying.  I wish the story focused more on Handa's progress as a calligraphy writer and relationship with Kayafugi (his manager in Barakamon) rather than this weird fan club and student body obsession with him.\\n\r\nMore than anything I just wanted more Natsu!",
            "date": "2018-03-20T13:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 274386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5973670.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/COGirl1985",
                "username": "COGirl1985"
            },
            "url": "https://myanimelist.net/reviews.php?id=274386"
        },
        {
            "content": "I was okey with this show the first time I saw it saw it as a poor mans watamote but after I actually watched the older sequel released two years before this one I really don't see any point in this one existing would go into more reasons why that is but they clearly did not put much effort into this show so stop wasting your time here and watch Barakamon instead a way better show in all and there you actually see the same protagonist develop unlike this mess that just laughs that how bad his worst traits are and leave it at thatuntil Barakamon the real show starts... still reading GO WATCH BARAKAMON NOW ITS WORTH YOUR TIME!!!",
            "date": "2017-12-27T11:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 266537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3755283.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Gnorim",
                "username": "Gnorim"
            },
            "url": "https://myanimelist.net/reviews.php?id=266537"
        },
        {
            "content": "I remember how I accidentally discover the manga, it was fun that I stayed late just to keep myself updated. Anime adapted the manga goodly, but knowing how the episode going left the fun and excitement as I read the manga. It's not that bad overall. Good job!\r\n---\r\nCharacter development got me suprised, I was expecting he will live inside his box. His surrounding were odd , it must have been rough staying sane around Handa and friends. haha. ED/ Ending Song and Visuals supported each episodes and how loving it is to add one character to another. Use of one subject as for overall comedyis brilliant.",
            "date": "2016-09-25T05:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 230133,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5010252.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TooLongDidntRead",
                "username": "TooLongDidntRead"
            },
            "url": "https://myanimelist.net/reviews.php?id=230133"
        },
        {
            "content": "Spoilers Alert\r\nwhen you use one idea in an anime over and over it becomes boring and hard to deal with and that is main problem with Handa kun.\r\nThe Story :\r\nhanda is normal guys who is good at calligraphy and very famous in his school but somehow he thinks that everyone in his school hates him and that it , the whole anime revolves around that idea for entire season . and that is the main problem here , i mean after 2 episodes its very hard to deal with him and other characters , how come it never occurred to author that this is aboring idea for entire season . i mean common man the whole season it never occurred to main  character everyone likes him rather then hates him , he only realize this in the last 10 minutes of the last episode , thats just plain stupid to me.\\n\\n\r\nCharacters :\\n\\n\r\ncharacters are boring and dull because there is not much character development in this anime , and character interaction seems out of the place  all the time. there is not single character that is lovable in this anime.\\n\\n\r\nSound and Animation: \\n\\n\r\nsound is just below average and some times does not match the premise at all , even unbearable some times. animation is just below average as sound , some times character movement seems rather odd. \\n\\n\r\nOverall:\\n\\n\r\nif you wish to watch this anime then be warned that after 2 episodes its unbearable and hard to watch because nothing new happens , just some stupid characters who hate handa in start and love him in the end and thats it , that is the whole anime folks .",
            "date": "2016-09-24T10:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 230029,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5480561.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/The-Observer95",
                "username": "The-Observer95"
            },
            "url": "https://myanimelist.net/reviews.php?id=230029"
        },
        {
            "content": "This show is what you show other people when trying to invite them into anime. It isn't wild or crazy. It is a simple story. The characters is what makes this story great. The comedy will make you pause the show in order to catch your breath and the ending will leaving you smiling. This is a wholesome show with fun people. Handa is such a relatable person. the art is nothing impressive. but it works perfectly for this kind of anime. If you like this then I suggest you watch \"Haven't you heard? I'm sakamoto.\" If you are looking to laugh or something towatch with the family. This is the show to put on. I like how every episode a side character learns a lesson and believes Handa wanted to teach them. This show not only has character arcs for the side characters. Handa's character slowly evolves as the people around him befriend him.",
            "date": "2019-01-05T12:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 298146,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7694714.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mollie2060",
                "username": "Mollie2060"
            },
            "url": "https://myanimelist.net/reviews.php?id=298146"
        },
        {
            "content": "This show seems to get a lot of shit for.... not being original? The first episode of this show is by far the best. After that it kinda is just a half decent running gag. But its honestly kinda fun to watch. Nothing amazing but enjoyable. The ending was kinda predictable based on the set up but it was still nice, honestly the main problem with this show is that it doesn't vary its jokes enough so it ends up being one of two running gags. Handa thinks he is hated when in fact he is super popular, and thus Handa does something Handa feelsbad about himself  while the other person is like \"OMG MR POPULAR.\" OR The Handa Force do something for Handa to try to help him when in reality its just creepy or misguided. That is basically the show. It's aight and funny but nothing amazing. 7/10",
            "date": "2018-12-02T20:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 295160,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/weebshit213",
                "username": "weebshit213"
            },
            "url": "https://myanimelist.net/reviews.php?id=295160"
        },
        {
            "content": "Handa kun is a decent series. It doesn’t compare to Barakamon in terms of quality or comedy though. \r\nOne of the main problems i feel is there’s no variety in comedy. Every character plays up to the same comedic traits/gags they have. I kinda got bored of the same old misunderstandings, everyone dickriding how great Handa is and Handa being such a shy, negative, loner teen that interprets everything as some hate towards him. It’s why when Kawafuji points out that he’s actually popular and liked in the last 10 mins of the last episode it felt forced. Like it took Handa 11 1/2 episodesto realise that, really?? \\n\\n\r\nMost of the characters were fleshed out well and had some development (even if it was because of some influence that Handa inadvertly did). However, Handa got no development in comparison, which is ironic considering one of the criticisms I had with Barakamon is only Handa received character development. I kinda wanted to see him develop into the more outgoing and fun version he is as an adult because his teen self almost feels like a completely different character.\\n\\n\r\nThe opening song is alright, I like how creative and fun the visuals are. The osts are great, i love “Handa’s theme” that plays whenever he’s on screen. It’s like a aloof, lighthearted soundtrack. The ending song is kinda weak and forgettable.  \\n\\n\r\nOverall, I’ll give Handa-kun a 4/10 because it allowed me to learn more about my Handa-kun. I hope to see the Handa force in Barakamon or i’m going be really disappointed ;(",
            "date": "2018-09-29T15:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 290424,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6370674.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/OG_Guts",
                "username": "OG_Guts"
            },
            "url": "https://myanimelist.net/reviews.php?id=290424"
        },
        {
            "content": "Handa-kun, in my opinion, is a relaxing but comical anime. As the summery states, it really is about a guy who thinks everyone is out to get him when instead everyone loves him. To see the dynamic between the two and how Handa freaks out when he's the center of attention makes it absolutely hilarious to watch and honestly what kept me hooked onto all 12 episodes. Not to mention all the \"life lessons\" everyone learns after Handa does something. I liked how the anime was pretty simple in of its self. Yeah it was a tad bit on the bland side, but nothing toobad. I highly recommend this anime if you're having a long day at work/school or when you've finished studying. Like i stated it's a chill anime, and just quirky in it's own way.",
            "date": "2018-09-19T18:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 289446,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5443761.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ArisaNightingale",
                "username": "ArisaNightingale"
            },
            "url": "https://myanimelist.net/reviews.php?id=289446"
        },
        {
            "content": "This show have a lot of undeserved bad reviews. I think the reason is people was expecting this to be the same of Barakamon and it was not. When you like something in the way it is, you don't want it to change. And Handa-kun have a diferent spirit than it's sequel, which is not so oriented to humor but to a heartwarming slice of life kind of thing. If you haven't watched Barakamon yet or you have not problem with this to be diferent, you will able to enjoy an actually good comedy with a unique personality. I rate by enjoyment and I gaveit a solid eight.",
            "date": "2018-04-19T08:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 278465,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5451938.jpg",
                "scores": {
                    "animation": 0,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Djerabis",
                "username": "Djerabis"
            },
            "url": "https://myanimelist.net/reviews.php?id=278465"
        },
        {
            "content": "A prologue to Barakamon, Handa-kun gives fans of the first series a peek into Handa Sei's life as a high school student before he became the arrogant yet insecure calligrapher we came to know and love.\r\nFirst off, what's wrong with Handa-kun?  Lots of things, when you compare it to Barakamon.  While the previous series allowed us to experience Handa's journey as he discovered different aspects of himself and his work in a very comedic and inspiring way, Handa-kun imply reminds us in each and every episode that Handa is incredibly insecure, overly anxious, and surrounded by idiotic Handa-worshipers who read into everything waytoo much and, in their pursuit of making Handa happy, actually make him pretty miserable.\\n\\n\\n\r\nPutting that aside, Handa-kun will make you laugh, or at least chuckle.  It was easier for me to enjoy this series after I told myself this isn't meant to be like Barakamon, it's just a ridiculous high school slice of life comedy that's supposed to show the ridiculous antics of Handa's class mates and how their over enthusiasm affects Handa.  \\n\\n\r\nThere is no development until the last episode, and I can't even call it development, it was more like someone finally popped the bubble and said \"Hey, no one actually hates you!\"  \\n\\n\r\nThe art isn't as good as Barakamon, it actually looked like it took a step down. \\n\\n\r\n The characters were stupid, I'm not kidding here, they were dumb.  The only smart one was Kawafuji, but he was barely in the series....\\n\\n\r\nI didn't commit to the series, it took me months to watch all 12 episodes, unlike Barakamon, which I committed to all night and part of a day.  It doesn't really add to Barakamon's story, it barely even touches on Handa and Kawafuji's friendship, and if you watched Barakamon and never even considered to watcha Handa-kun, you wouldn't be missing a thing.  \\n\\n\r\nIn the end, it wasn't all that bad.  I laughed, and I even related to Handa (not so much on the popularity scale, but the walls and teen anxiety).  Watch it if you want, but you don't have to.....",
            "date": "2018-01-28T00:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 269871,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Denizu",
                "username": "Denizu"
            },
            "url": "https://myanimelist.net/reviews.php?id=269871"
        },
        {
            "content": "Main feature was the humor. Watching how two absolutely different views unwittingly continued to develop each other was hilarious. Although it wasn't the most sophisticated kind of humour, it combined with this story made me laugh every episode. So yeah it is pritty good comedy, it will make you laugh, but I feel like It could be something more ...\r\nAnyway, what kind of buged were the (unintentional I presume) gay vibes ... I just could not fully enjoy segments with them. .  . and rather slow and confusing start.\r\nI gave i only 7/10 because I feel like it could do (somehow) more than this.But still, good anime.",
            "date": "2017-11-30T12:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 264251,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6533814.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/rkuci",
                "username": "rkuci"
            },
            "url": "https://myanimelist.net/reviews.php?id=264251"
        },
        {
            "content": "When I heard about the spin-off of Barakamon about Handa-sensei's high school career, I thought it sounded really lame and put off watching it for quite a while.\r\nWhen I finally got around to watching it, it seemed... really lame! I thought the first episode (or at least, the first half of it) was weird and not funny at all. I had low expectations for the show and it seemed like those expectations were going to be accurate.\r\nAfter watching a few episodes, though, I started to enjoy the humor of it. Handa's character was really funny and cute to me. The characters around him (the HandaForce) were definitely a stretch and a little cringe-y, but I got used to them and they were okay. I liked Yukio a lot.\\n\\n\r\nI ended up laughing a lot from the show, in the end. I think if you end up basing your judgement of it by Barakamon, you won't enjoy it, but if you have an open mind, you might. In the end, it was kind of lame, in the way that a bad pun is lame. But I enjoyed it for that.",
            "date": "2017-09-23T12:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 258399,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/201354.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Karudima",
                "username": "Karudima"
            },
            "url": "https://myanimelist.net/reviews.php?id=258399"
        },
        {
            "content": "i'm going to talk about a single episode of the anime which is\r\nspoiler alert \r\nthe episode which handa loses his memory \r\nit was really sad story from my perspective\r\nit shows me how fragile the friendship  between handa's army and the true handa \r\nwhen handa try to act like himself or at least the actual version of him -\r\nif his friend had told him the truth when he was younger -  \r\nthey rejected him \r\nthe anime was and still funny but this episode just ruined it \r\nbut I'll give him a 7 because it made me laugh \r\nsorry for my poor english",
            "date": "2017-05-14T07:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 247651,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lolsad",
                "username": "lolsad"
            },
            "url": "https://myanimelist.net/reviews.php?id=247651"
        },
        {
            "content": "I had the impression that this was a prequel, well its not(IMO). If i had to say, this is more of a spin-off or a side story than a prequel since it has nothing to do with its successor.\r\nFew things linking this series to Barakamon are 3 Characters and Calligraphy(not even overly implied).\r\nThat aside, the anime itself is not bad even though there's not much of a story(there is,  just a different one). I still enjoyed it due to its comedy.\r\nIf this was a standalone series. I would have rated this differently since its fun to watch and \"kinda\" resembles a certain show airedduring Spring 2016.\\n\\n\\n\r\nOverall 6/10",
            "date": "2017-01-06T23:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 237673,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Denpahai",
                "username": "Denpahai"
            },
            "url": "https://myanimelist.net/reviews.php?id=237673"
        },
        {
            "content": "I've only watched about 4 episodes of Barakamon, the anime that Handa-kun is based off. I remember thinking it was pretty good but for some reason or another, stopped watching it. But I did watch this show which is completely different from Barakamon. Whereas Barakamon is a more serious show about Handa's calligraphy, this is more to do with Handa in highschool and although he still does calligraphy as part of his character, its not very important in the this show.\r\nHanda-kun is a spin-off and a gag anime without any real plot. I don't think you need to watch barakamon or know anything about theshow to gain some enjoyment from this show. This could be a good if you've never watched Barakamon but it may also be dissapointing for fans of Barakamon that expected something more substantial. \\n\\n\r\nThe whole show centers around the running-gag that Handa is extremely popular in the school but that Handa himself thinks that he is hated by everyone. This is done ad nasuem throughout the entire show and it's predictable and gets boring pretty much after maybe episode 7. It has its peak moments but for the most part the show is fine with treading safely and not taking too many risks in terms of story, character development or in the comedy. \\n\\n\r\nIt's an okay show if you want something to just pass the time or are running low on anime to watch and don't want to watch something that you know you want to set aside time to really enjoy.",
            "date": "2018-06-28T17:55:00+00:00",
            "helpful_count": 0,
            "mal_id": 282488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3555085.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LightIsKirai",
                "username": "LightIsKirai"
            },
            "url": "https://myanimelist.net/reviews.php?id=282488"
        }
    ]
]