[
    [
        {
            "content": "Over the last couple of years we've seen a steady stream of light novels being adapted to anime series and now we get yet another with this series, produced by C-Station a former offshoot of Bee Train Production Inc. and the overall result is a marginal failure.\r\nAnime is full of time honored clichés that never seem to die and Dragonar Academy is so packed full of them it shows just how void this show is of any creativity or imagination. Giant bouncing breasts on all women characters, naked magic girls showing up from nowhere and mood swinging tsundere characters are ripe and abound in thisseries; it feels less like this is less of a story of it's own and more of a copy paste job from a few dozen other series of it's kind.\\n\\n\r\nTaking from probably equally lazy source material, the scripts written by Noboru Kimura are shoddy and thrown together with no thought or effort behind them.  The large cast of cookie cutter characters will bore you with just how uninspired they are.\\n\\n\r\nThis kind of tripe is barely forgivable from a group of first time creators but the fact this comes from several long time animators who had once made excellent shows in the past with their old studio, before breaking away to form this new company, adds more insult to injury.\\n\\n\r\nTopping off the cliche storm is a number of soft-core moments between a nude dragon lady giving oral to a pseudo tentacle rape scene, you would think they'd rather be making a hentai series.\\n\\n\r\nAnimation and art is just as awful with ugly looking dragons to top off the grossly exaggerated character designs. One would think with a show centered all around dragons it would be the one thing you could get right but the dragons look like a mix of generic fantasy dragons painted in pastels that makes them look like they're covered in hard water spots or they're wearing the projection clothes from the Count of Monte Cristo anime.   \\n\\n\r\nInterestingly, half the time you won't see any dragons and it will be mostly focused on whatever lame slice-of-life scenarios ripped from every other show of it's kind.  Echo while being presented as a dragon is little more than a magical loli with some horns glued onto her head.\\n\\n\r\nThe musical score was somewhat interesting and entertaining and might be the one redeemable factor but it's tie to this awful show doesn't make me enthusiastic to  to listen to it.  The theme songs are typical for a show like this, shoehorning in as many voice actors, who may or may not have any musical talent, as you can to sing an ear shrieking J-pop song to sell some more CDs,  \\n\\n\r\nDragonar Academy is uninspired, lazy and contrived. Beating down dead clichés that have saturated the market of the last couple years alone this would barely make the grade for a crappy one episode OVA, forget a 12 episode season.  I get the feeling even if you are looking for a silly fanservice show there are likely far more entertaining options out there that are less copy-and-paste than this show.\\n",
            "date": "2014-07-20T12:12:00+00:00",
            "helpful_count": 58,
            "mal_id": 152905,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/44864.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ShadowBlazer3000",
                "username": "ShadowBlazer3000"
            },
            "url": "https://myanimelist.net/reviews.php?id=152905"
        },
        {
            "content": "Story\r\nThe story was since episode 1 really interesting, i liked the idea that Ash Blake the MC could ride any Dragon he wanted because of what happened to him in his childhood by saving a girl that he doesn't remember in the present, you will predict since the begining who she is, well he is about to die by a girl he saved again and that's when his dragon Eco appears and not just a dragon a humanoid dragon. I would have rated higher but they left little questions that were important for the viewer to understand more the story.\r\nArt & Sound\r\nBoth were very goodbecause i really liked the music on the battle scenes, the voice acting was very good could have been great though and the ED song for some reason i liked it but that is my opinion you may not like the ED song, the art was very good i liked the dragons art style and even more with the bigger ones, bewbs are there too but you won't mind it like me.\\n\\n\r\nCharacter\\n\r\nThis is why i didn't rated higher, because i didn't got to know the backround of the character, they never remembered they met when they were kids, both Ash & Silvia, despite that, the characters were interesting because you want to know more about the majority of them.\\n\\n\r\nEnjoyment\\n\r\nI really enjoyed this anime, i wanted to see more, i wanted a 2nd season because of the questions at the end and to know the characters even more than what is shown here.",
            "date": "2015-08-03T11:56:00+00:00",
            "helpful_count": 45,
            "mal_id": 195076,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195076"
        },
        {
            "content": "After watching the first episode, I thought that this had a lot of potential to be a good series but unfortuantly it lost it's potential as the episodes went by. \r\nStory: \r\nAt first the story interested me, it felt quite unique in a way and parts of the story reminded me of Soul Eater at times ( for some reason ) but after a few episodes in; it seemed to abandon its interesting plot and instead turn it into more of a regular harem/ecchi anime. I actually do enjoy harems to a degree but when you have an actual story first and then abandon it1/3 of the way through, it can make you feel disapointed because of its wasted potential.\\n\r\n That being said, the pacing felt fine and didn't feel slow or rushed barely at all. \\n\\n\r\nArt: \\n\r\nI did enjoy the art, it had some interesting designs and the girl characters were cute. Although, the actual dragons in the show could have had something more in their designs but they're not at all completely bad. \\n\\n\r\nSound: \\n\r\nIn my opinion, one of the best things in the entire show was the opening and ending themes. The opening was really good and showed some really cool scenes. The ending was cute and had a fun song which was a nice reward after going through each episode. The voice actors/actresses did a good job throught the show ( you know they wanted the villian to be mysterious and cool when they cast Dio Brando's voice actor )\\n\\n\r\nCharacter: \\n\r\nNow this is where everything goes wrong. I thought most of the characters were paper-thin with nothing really going on with them. Some of the characters got character development while most just had no layers even if you thought they did. I also thought the villian was just bad and i wish we had gotten more depth to the character but unfortuantly we didn't. \\n\\n\r\nEnjoyment: \\n\r\nHere's the weird part; i actually really enjoyed it. I got the same enjoyment as I would watching any harem. Even though I had so much problems with it, i actually looked foward to watching more. If you enjoy harem/ecchi shows i think you would actually enjoy this even though it has many flaws. \\n\\n\r\nOverall: \\n\r\nWith the potential I thought it had at the beginning being destroyed as time went on, after watching the whole thing I feel disappointed. However like I said, if you enjoy harems and ecchi anime then by all means watch this one. But I don't think that this will be a very rememberable one with its very plain characters and interesting story it mostly abandoned. Seikoku no Dragonar turned out as a mediocre harem.",
            "date": "2014-07-17T11:59:00+00:00",
            "helpful_count": 43,
            "mal_id": 152491,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2778347.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SamuraiScythe",
                "username": "SamuraiScythe"
            },
            "url": "https://myanimelist.net/reviews.php?id=152491"
        },
        {
            "content": "So, this is my first official review, and I hope to write many more after this one.\r\nStory: 6\r\nThe story is a generic harem/fantasy story, filled with \"Plot\" and some battles. I liked the story and its concept, though halfway through the show, it became a bit too predictable. Though I really enjoyed certain parts, I also found myself wanting to fast forward others.\r\nArt & Sound: 7\r\nI grouped these two together because I felt like they complimented each other in this anime. The art was pretty good and consistent throughout the show, which is important. No particular sound stood out for me, but I did feellike the bgm (background music) in the battle scenes intensified the character's moves and passion.\\n\\n\r\nCharacter: 7\\n\\n\r\nThe characters were good. Nothing more, nothing less. There weren't any exceptional or very outstanding and original traits between them, but they were good. The show had the usual harem girls, for example: a busty one, a rich one, a loli, a tsundere, and an erotic teacher etc. There were a few more, but that was the gist of it.\\n\\n\r\nEnjoyment & Overall: 7\\n\\n\r\nI did enjoy the show quite a bit, but it didn't really strike me as exceptional, partly because I have watched hundreds of similar anime and so I've kind of gotten used to all the recurring things in harem anime. The characters were alright, but neither them nor the story were able to pique my interest past the point of amusement.",
            "date": "2015-02-28T17:03:00+00:00",
            "helpful_count": 37,
            "mal_id": 181412,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2180965.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lyevino95",
                "username": "Lyevino95"
            },
            "url": "https://myanimelist.net/reviews.php?id=181412"
        },
        {
            "content": "Seikoku no Dragonar... If there's something like a huge basketball ring in front of you, larger than the usual and there's a normal basketball ball in your front. You can't definitely miss from close range, can you? That's how I can picture a perfect analogy to the premise of Seikoku no Dragonar. But in this case, we are left wondering how Seikoku no Dragonar missed a blatant open chance for winning its potential.\r\n***************************************************************************\r\nStory...\r\nI gave it a 6, honestly. Sometimes, even the most generic story can achieve better heights if given a thoroughly direction. But yet again, ruing their chances is this particular series. The storyitself is solid. With a fantasy setting, the variable factors that can be used were supposed to be almost unlimited. But why? Why did Seikoku no Dragonar limited themselves to such product?\\n\\n\r\nBlaming the storyboards and the director must be a vain thing to do. Why? Because from what I saw, the director had very good series to his helm, so the last definite thing that could've dragged Dragonar to the bottom must be, yeah, the reference material.\\n\\n\r\n***************************************************************************\\n\r\nArt...\\n\\n\r\nA beautiful realm was presented, with fictional beauty that is out of this world. I can easily point this out as a standout in terms of the drawings. Whether it be character designs or the setting world, it was consistently beautiful. There's nothing to doubt that the art department definitely wins a deserving 10, isn't it?\\n\\n\r\n***************************************************************************\\n\r\nSound...\\n\\n\r\n6, I guess... Something inside me just made me skipped the OP and ED successively whilst watching in marathon since I didn't enjoyed the theme songs. The BGM(s) were also quite bland in my opinion. So a 6 makes perfect sense...\\n\\n\r\n***************************************************************************\\n\r\nCharacter(s)...\\n\\n\r\nThis is where they got nastily messy. I am no reader of the reference, but if the anime makers had been thoroughly confused on the characters, then I can find the salvation to pardon them.\\n\\n\r\nMost of the characters were so... plainly bland boring... No one is even interesting at the slightest. Eco, the generic loli and Silvia, the voluptuous princess as tsunderes failed to materialize the true charm of their characters. Neither the supporting casts, including the smexy maids or the student extras in the background had even made a scene worth praising. All is played by the point of \"seduce the men\" and \"show your booty and tits for fanservice's sake\".\\n\\n\r\nNow, focal character, Ash Blake. Is he decent? Maybe, to some, I guess. I suppose I've outgrown his types, but frankly, he did a fair job as MC. Started out simply as an outcast then gaining new powers, he played the MC well. But in the end, he is not interesting. That's the point in appreciating the MC, right? Whether he/she is interesting, it all comes down to this focal issue. And this is where Dragonar failed miserably. The ability to make the MC interesting, is the least they should've done keenly.\\n\\n\r\nWe go to their adversaries faction. Do anybody stroke as interesting? The answer yet again, is a big \"no.\" There's really little point in delving too much on the characters since Dragonar had utterly failed on this aspect.\\n\\n\r\n***************************************************************************\\n\r\nEnjoyment and Overall...\\n\\n\r\nNothing except for a 3. Was it too harsh? No, I guess not. Enjoyment was scarce but I'll tell you, even most of the fanservice scenes didn't inject a life to my watching interest. I guess all my laughs whilst watching is part where I am in absolute confusion as to why I even thought of watching a series that I already foresaw would be bland and boring. My thoughts were in jumble whether to drop it by episode 06, but I won't lie. I am a die-hard fanatic of Koyasu Takehito and even his most utter craps is something I've watched.\\n\\n\r\nSo concluding. Dragonar might be a winner in terms of sales. But in terms of worthiness(money and time watching), it's not. It's like paying a gold bar in exchange for a single bad-tasting moldy bread, leaving you feeling ripped afterwards the entire running time. \\n\\n\r\nBut like I said, Dragonar is directly oriented to booty-and-tits- lovers. But in my head, I think I'll just go settle for a bonafide H material instead of watching borderline tentacles ripping panties and groping tits.",
            "date": "2015-01-25T21:47:00+00:00",
            "helpful_count": 19,
            "mal_id": 178984,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302451.jpg",
                "scores": {
                    "animation": 10,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nanyatimz",
                "username": "nanyatimz"
            },
            "url": "https://myanimelist.net/reviews.php?id=178984"
        },
        {
            "content": "This is one of those animes that had great potential, but falls short thanks to a combination of clichés, poorly developed characters, uninteresting story, excessive fanservice, etc.\r\nIts a shame, but the most enjoyable part of this serie would have to be the very begining of the ending song, aside from that, I didnt really got to enjoy anything else. I even feel I was too generous with my rating.\r\nI would only recommend this anime if you are very bored and want a lot of random fanservice (tentacles included), because I doubt you will watch it for either the characters or story, but that is upto you to decide.",
            "date": "2014-06-28T23:47:00+00:00",
            "helpful_count": 15,
            "mal_id": 149205,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1571483.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yamigami",
                "username": "Yamigami"
            },
            "url": "https://myanimelist.net/reviews.php?id=149205"
        },
        {
            "content": "In an amazing world filled with magic, we are introduced to the world of the great Dragons. Dragons as far as the eye can see, and tsundre lollis, wait i thought this was Seikoku no Dragonar and not Toradora? \r\nHello ladies and gentlemen, this is a brief review of what to expect from another mediocre anime that doesn't know what it wants to be. \r\nLet's start with an overview: \r\nWe are following our main male protagonist, a young sixteen year old boy Ash Blake. Ash Blake is your typical young male with a problem, he is the only one in his school who has yetto acquire a dragon of any form. While his comrades all have majestically grown dragons. This proves to be quite a problem as he gets teased and bullied over his yet-to-exist dragonkin, and hence he get's the name of \"Problem Child\", because who wouldn't get mad and beat up people for not having a dragon? Yet as not having his own dragon, he has an ability; to ride any dragon he wants, and be perfect at it.(OVERPOWERED MAIN CHARACTER INCOMING?). \\n\\n\r\nA new year has started and the first class lessons is dragon fight, Ash has to borrow a friends Dragon and accidentally pushes into a female and her dragon, the beautiful female princess Silvia Lautreamont. In a heated discussion with \"shots being fired\" at each other, they agree to settle their difference in an upcoming festival's race. Some time in the race the dragon of Ash's friend gets exhausted in a forest, Ash suddenly feels a uncomfortable feeling and decides to check it out. After a short walk he finds a mysterious man with a phantom of the opera mask on his face. The man is our main villain and is nothing out of the ordinary. The man tells his underling to fight the young boy after analyzing his potential as a dragon-master. The battle is short and the underling get's thrown off a cliff. Ash's hero senses start to tingle and he knows he have to save her, by the time he manages somehow to grab her arm, the sides have changed. The young girl switches sides with our young protagonist and Ash is falling to his doom. But not for long!! A mysterious glow on his arm appears, and Ash knows, this is his dragon appearing before him. And who would have thought, that his dragon is a super overpowered machine of lollies thrown to the story for no reason, except to imitate Toradoras - Asaika Taiga. Yes, i said it.\\n\\n\r\nCharacters:\\n\\n\r\nHuff, where to begin? This anime has major problems with where it wants to go. Fantasy, ecchi, tsundre? WHERE? Let me spit it right out, the anime's characters are bland and bring nor nothing new, nor anything worthwhile watching. Main Characters are basically copies of the main characters of Toradora.....Ash Blake is a normal guy, with surreal powers that he gets for no good reason really, except for meeting a overpowered dragon empress inside a forest when he was small(what animes has this happened in before? oh like 10 of em). He is your \"I am a badass\" and \"I Try to be cool and kind hearted\" type of character which brings no flavor to the anime, and get's boring to watch. The Tsundre, is tsundre, just like any \"original anime\" we get introduced to a little girl who falls in love with his master, but can't really tell him that, so she pushes him around calling herself his master. The other characters have no story or at least one good enough to enjoy the series, as the most of them are just big boobed bimboes with dragons.\\n\\n\r\nAnimations and Sound:\\n\\n\r\nThis is where we the anime exceeds imo, the art is fantastic. The dragons, armors and the characters themselves are well designed, but still have something missing to them, which i to date can't really put my finger on. And the great arts spring is even better looking with the awesome classical type soundtrack which you normally would find in any good fantasy series. I could easily download the tracks and enjoy them for many hours, so on that front there are really no problems!\\n\\n\r\nOverall:\\n\\n\r\nThis anime leaves much to be desired.  it has a good animation design and soundtrack that has little flaws, countered by a failed attempt on genre's that in my opinion does not go well. It starts of as a pretty typical and not that bad of a fantasy anime, but it develops into this monstrous tentacle hentai wannabee.(Yes there are a lot of tentacles action that fondle them triple D'sized cups that all girls in this anime have). \\n\\n\r\nI guess i was thrown of the chair, not that I don't enjoy some fan service, I just found it unappealing in what could have been a not so bad anime. The characters are straight bland, and the series tries to much to be like Toradora and Zero no Tsukaima(which are FANTASTIC), and pretty much leaves you hanging and loathing for more. Maybe a rich backstory and less fan service, could have been the justice this fantasy anime needed. \\n\r\nAll in all, I give this anime a 4/10. With a disappointing and almost non existent plot, the art and sound was top notch, but not enough to carry a whole bunch of pathetic characters to a form for any glory.  \\n\\n\r\nThis is my first review, and hope you guys enjoyed it. All form for criticism is welcomed with a good embrace. \\n",
            "date": "2014-11-17T17:43:00+00:00",
            "helpful_count": 11,
            "mal_id": 168993,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3915137.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/darkkugan",
                "username": "darkkugan"
            },
            "url": "https://myanimelist.net/reviews.php?id=168993"
        },
        {
            "content": "All I have to say is... wow. Simply, wow. \r\nThe show had much potential, but halfway through the series, the directors realized that not everything from the LN could fit within a 12 episode series. \r\nToo bad. \r\nInitially, the story was great. A male lead with a hidden power, a cute heroine, a equally as cute \"main chick\" for the lead... and all set within the school setting. It had great potential. Unfortunately, with the introduction of flat characters and a story filled with plot holes, the quintessential (to me at least) anime quickly fell apart. \r\nI swear man, the ending did not leave mesatisfied. Did Sylvia actually find out it was.... hmm. I seem to have forgotten the MC's name. That's funny, since I just finished watching the series 30 mins ago. \\n\\n\r\nOr the other really infuriating plot hole of Anya's sister not recognizing her. Seriously? She's the only other dark female in the entire world! She was right in front of you! Dammit!\\n\\n\\n\r\nThe only thing OK with the series was the art, and even then, the quality of the breasts were of lesser quality than even some of the worst hentais!! \\n\\n\\n\r\nGeez...",
            "date": "2014-12-14T03:51:00+00:00",
            "helpful_count": 11,
            "mal_id": 172167,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4120483.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SaigoNoAkuma",
                "username": "SaigoNoAkuma"
            },
            "url": "https://myanimelist.net/reviews.php?id=172167"
        },
        {
            "content": "Story: The plot is almost a copy of the light novel series, so adaptation-wise, they followed the script. However this story seems better told in words than animation, given its almost cliche cut-and-paste nature. It's the standard \"magic knight saves princess\" story with an ecchi direction. Possibly enjoyable for those looking for this kind of genre  but unimpressive. \r\nArt: The art style was somewhat simple with the shading almost exclusively reserved for blushes and cleavage. It was easy on the eyes but lackluster. \r\nSound: 12 episode harem fantasy  doesn't have dramatic soundtrack, so the main focus is OP/ED. I found Sakakibara Yui's OPcatchy but her distinctive style of singing isn't for everyone. The ED was cute but it seemed more appropriate for a purely slice-of-life show. Looking at the soundtrack as a whole, it delivered for the type of magic harem shenanigans the show was aiming for. It wasn't superb but appropriate. \\n\\n\r\nCharacter: Standard tropes. The characters were not creative, even regarding character design. It's sometimes enjoyable seeing a cliche like a loli tsundere but there were too many cliches  in this show. There's a static nature to the characters I didn't find enjoyable. \\n\\n\r\nEnjoyment: If loli tentacle harem was the show you were expecting, it hit the mark. For everyone else, the ecchi was excessive and the show weak. It was somewhat fun seeing cliche after cliche but it got old quick. \\n\\n\r\nOverall: A show I wouldn't personally recommend to many. The amount of effort put into the adaptation is mediocre but acceptable. Not the worst but almost niche due to its multiple cringe tentacle molestation scenes. \\n",
            "date": "2014-08-19T18:25:00+00:00",
            "helpful_count": 8,
            "mal_id": 157189,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3371023.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mystry08",
                "username": "mystry08"
            },
            "url": "https://myanimelist.net/reviews.php?id=157189"
        },
        {
            "content": "Seikoku no Dragonar truly is one of the worst things I have watched. It is an awful series and I would not recommend it to anyone. Despite having potential the creators disappointed me gravely. I watched the entire series thinking at the end of each episode that it cannot get any worse. I was mistaken. \r\nStory : 3\r\nAs I said before the series had potential primarily due to the general story idea. Regrettably the end result was horrible. The story, in several cases, made absolutely no sense. Dozens of plot holes and the poorly written backgrounds for the main and supporting characters made a badstory line into something utterly pathetic. \\n\\n\r\nArt :4\\n\\n\r\nArt may well have been the only decent thing about this series and when I say decent I do not mean that it was neither innovating or unique. It is more like what you would expect from this type of anime. The art in several cases seemed rushed and uncreative since no effort seemed to have been made to give that extra spark or glamour. Plus I did not enjoy the strong influence from hentais.\\n\\n\r\nSound : 2\\n\\n\r\nEverything in relation to sound was completely subpar. The soundtrack was at best mediocre. Nothing really stuck with you except an annoying ending theme. The opening was not much better. As for voice acting I have to admit that once again they made no effort to create something unique. All characters were poorly voiced to the degree that almost all characters reminded you characters from other anime. It seems to me that no attempt was made to make them 'unique'.\\n\\n\r\nCharacter : 1\\n\\n\r\nAs I said before the characters were poorly written, portrayed and voiced. Nothing good can be said about them. No information was provided during the series about them, none that made any sense at least. Even when an attempt was made to introduce some piece of information about the characters background it was swiftly demolished by some random event that had no place being there or irrelevant interruption from another character thus creating the illusion of a cliffhanger. \\n\\n\r\nEnjoyment & Overall: 3\\n\\n\r\nIn essence this a horrible series that I would not recommend. Nothing in it can be viewed as good or average. The creators failed miserably and this failure could only be explained if this was their first attempt in anime creation. Furthermore I blame the stations that decided this was a good anime to air and further pollute the anime world. In my humble opinion nobody should have to suffer viewing this series unless you feel you need to punish yourselves.\\n\\n\\n",
            "date": "2014-06-25T12:12:00+00:00",
            "helpful_count": 7,
            "mal_id": 148541,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/549351.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/partali",
                "username": "partali"
            },
            "url": "https://myanimelist.net/reviews.php?id=148541"
        },
        {
            "content": "Don't go into this anime expecting a great story and nice characters/(developement) because there isn't.\r\nThis is your standart harem/magic/school anime in a fantasy world. (If you have some anime of the sort I haven't watched yet feel free to pm me ;))\r\nThe characters don't really have anything special going for them but that doesn't mean this show is bad. It's not the greatest, sure, but it's not necessarily bad. It's just your typical show with a more or less predicatable storyline.\r\nThere is our main dude. And as the show progresses more and more girls seem to fall in love with him, pretty standart.\r\nThe art forquite pleasant but again nothing crazy good, same goes for the music.\\n\\n\r\nAll in all a quite predicatable show with matching characters.\\n\\n\r\nStill, I enjoyed this show.\\n\\n\r\nIf you just wan't to watch a harem with some \"hot\" girls and a bit of action then go for it, if you are looking for more than that, it's probably not for you.\\n",
            "date": "2019-02-09T07:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 301250,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7571142.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sching-Ling-Bing",
                "username": "Sching-Ling-Bing"
            },
            "url": "https://myanimelist.net/reviews.php?id=301250"
        },
        {
            "content": "Seikoku no Dragonar is an average anime with an average plot, average characters and one of 'those' endings. I don't mind ecchi shows in general but the premise was interesting so I was hoping that this one would maintain a better balance between having a plot and finding excuses to show everyone's boobs.\r\nPositives\r\n- The OST is quite nice.\r\n- The opening is quite nice.\r\n- Eco is cute.\r\n- Character interactions are quite funny most of the time.\r\nNegatives\r\n- As the show went on the art choice for how characters hair and eyes interact really got on my nerves.\r\n- 100% needless inclusion of tentacle enemies and dedicating lots oftime to scenes with tentacles whenever they show up. (bleh)\\n\r\n- It was like half way through the show before they realised they didn't have enough time to wrap it up so they rushed it.\\n\r\n- Absolutely pointless side characters.\\n\r\n- That damn tease ending.\\n\\n\r\nOverall not something you should go out of your way to watch but I don't regret giving it a go.",
            "date": "2014-06-23T11:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 148241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2653305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Doubleagent",
                "username": "Doubleagent"
            },
            "url": "https://myanimelist.net/reviews.php?id=148241"
        },
        {
            "content": "Hmm, well, just like everyone else, I feel the ZNT vibe here, although it's clearly quite different. The setting feels a bit like louise and saito with their roles switched around BUT if louise weren't as much of a bitch and saito weren't as much of a wimp.\r\nCan't say I like how pretty much every japanese mc in a setting like this is giant pushovers who cares too much about people around them though. Get some balls and learn how to stop getting pushed around, also, learn how to be merciless and kill people when necessary, at least in a fantasy world where the ruleis kill or be killed. This isn't our modern day society, crap like that is not admirable, it's just pure stupidity.\\n\\n\r\nThen there's annoying characters everywhere, seems like almost every character comes across as extremely annoying at the start only to become kinda annoying later on or just boring altogether. All of them have their own overly strong sense of justice and seems to believe that everyone who doesn't agree with them are foolish and completely wrong. I especially hate people like the researcher from the second episode who became the mc's teacher, she did something horrible enough that ought to warrant execution, but got away with no lessons learned whatsoever, not even any insults or physical harm when she was \"defeated\". \\n\\n\r\nThe author is barely half-decent, average might be overpraising him. Really, the setting itself feels quite weird. It seems to me the author couldn't decide on what he wanted, a modern day school setting or a medieval fantasy setting, so he went for both and combined them into some weird world where we have a lot of modern day elements such as food, buildings, schools etc yet we have a medieval world with no real technology and medieval buildings. It feels chaotic and half-assed. Honestly, after two episodes, I started to lose interest already. The characters are kinda plain, some are just plain boring and some are just annoying altogether. The story is similarly uninteresting. It doesn't grab your attention. \\n\\n\r\nThe only saving grace is that I really like dragons and fantasy, but this author not only managed to turn the fantasy into something that feels like \"fake\" fantasy, he also managed to turn the dragons into seriously boring creatures that are both ugly, lacks any personality whatsoever and seems to be pretty weak, they might as well be dinosaurs instead of dragons. Giving them more human-like personalities and perhaps the ability to speak would've made things much more interesting. Meanwhile, eco doesn't feel like a dragon at all since she doesn't even seem to have a dragon form, at least nothing has been revealed about it yet, she's also not that powerful and is pretty damn weak, maybe that has to do with her still being a \"newborn\" though. The astral flow thing and other settings are cringeworthy, especially the use of the random words that hardly make any sense, I also can't even count the amount of times I cringed at the numerous clichés that has been seen a million times before but was executed badly here. Urgh.\\n\\n\r\nWell, whatever. I like how eco is so protective of the mc, that's something good, not that it's presented in a good way because she has to mention how he is her pet dog or something all the time, super tsunderes like this are really overrated and I think all of us are dead tired of them by now and just find them obnoxious instead of interesting or funny. The romance feels really half-assed, what is even going on? This is actually the type of story where I feel a harem would be in the way, the mc and his dragon are better as the only pair, yet we have unnecessary additional settings such as the ultra cliché where there's this girl the mc helped as a child and she doesn't realize he's currently by her side etc...\\n\\n\r\nNow, one of the biggest flaws is that the ecchi is excessive and ruins serious scenes by being too random, it might also be me not being a teenager anymore and unable to appreciate the mindless erotic scenes that are there for absolutely no reason whatsoever except to give the viewers a boner. Things such as tentacles being used to attack from a creature that reasonably shouldn't have any, scenes that are just there to be erotic or armor/battle clothes that leaves breasts and thighs exposed for absolute no reason, looking more like an erotic bathing suit than actual clothes, much less armor/battle clothes(and this is a kinda haughty and strict battle-freak princess we're talking about), looking more like she's about to go to an orgy than a battlefield, or even events where clothes are destroyed for completely illogical reasons that makes you think \"what's up with this retarded garbage? did the author become temporarily brain damaged when writing shit like this?\", are ever present, which begs to suspend disbelief, but since it's so utterly idiotic, even I, as a master of suspending disbelief, can't possibly lower my standards to the point where I find this to be acceptable.\\n\\n\r\nI tried my very best to watch this, but after watching 6 full episodes over around two hours of time, I finally gave up and couldn't take it anymore since it got worse and worse the longer I watched. The setting is bad(even cringeworthy), the dragons are boring, the people are uninteresting and plain, might even call them extremely shallow and superficial, the scenery is subpar and fails to immerse me, the story is dreadfully lacking and most of the characters are irritating. I bet this story would do way better as a revenge-type story instead of this garbage, the mc would just have to man up and the loli dragon would have to lose about 70% of her tsun. Seeing the mc screwing over all of these irritating characters would be sweet.",
            "date": "2018-09-20T17:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 289534,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=289534"
        },
        {
            "content": "A Promising story with terrible delivery, average art, poorly placed music clips, dreadful characters with ridiculous and shallow narratives, and utterly annoying presentation all this anime is is a massive disappointment of what it could have been. i wanted to like this but it just kept pissing me off with stupid choices and neglectful writing. the main charter is an incompetent buffoon who could have easily been fixed with slight tweaks, his dragon is just stupid useless and annoying the entire time over using the excessively violent little cute girl cliche, there is the gutless female love interest who's shining moment is standing naked infront of a crowd of people and suddenly she is a hero and not a total loser, then there are a bunch of forgettable supporting characters who you feel were added just to give it the harem aspect and light comedy. also tentacles because fan service!",
            "date": "2018-09-05T09:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 288175,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 3,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheRedGojo",
                "username": "TheRedGojo"
            },
            "url": "https://myanimelist.net/reviews.php?id=288175"
        },
        {
            "content": "Dragons? I'm ready!\r\nIt starts off with introducing characters, you learn that poor Ash doesn't have a dragon, but has a different sort of ability, and people make fun of him for it.\r\nBy the end of episode 1, Ash gets his... dragon? \r\nIf dragons had long pink hair and took the form of young girls, sure. \r\nEco is adorable, but she's a bit bossy. The little girl brat type. She's a little hard to like at first, she starts to grow on you.\r\nSome of the Ecchi feels misplaced. Like it's just for the sake of it, which yes, a lot of it is, but there's alsoEcchi done well. Some of this is kind of in the middle. \\n\\n\r\nThe story isn't just focused on Ash and Eco, you learn about Silvia and Rebecca too. Their pasts, their dragons. Plus other characters get parts too. It's a wide variety. \\n\\n\r\nHalfway through I was enjoying it a lot more than I thought I would. It's definitely worth checking out.",
            "date": "2016-10-31T17:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 232978,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526839.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mikame-",
                "username": "Mikame-"
            },
            "url": "https://myanimelist.net/reviews.php?id=232978"
        },
        {
            "content": "The first part isn't so bad ( grade 4/10 ), but as it is a copy of the basic introduction of harem story that normal. Once the anime began the real part of the story, it become really bad.\r\nCharacters lost all their logic ( the tsundere ( which represent half of the female characters ) became docile in lot of scene without any reason), and the worst caracter ( the elf ) become a principal one during a long arc. The story is full of random stereotype scene, badly done without any surprise except that boobs grow more and more.\r\nTo be honest, I had todo something else during the second part of the anime as it was really boring. Even the plot twists are badly done, not even suprising, and they have noone real impact on the story, making them totally useless and free.\\n\r\nWhen the anime try something new, that is really confuse for something supposed to be simply to explain ( All \"kidnapping\" and hostage episodes ). It could be a better anime if it had passed the useless scene fast instead of focus on them ( All bathpassages ).\\n\r\nNoone feeling come from the anime. It is just bland.\\n\r\nTo finish, the fight aren't dynamic, and the contract with dragon is really a bad thing, making the fight, again, really confuse ( \"invocation-crafting\" scene duration is most important that the real time of the fight, during the time the opponent could destroy 3 cities )",
            "date": "2018-05-01T16:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 279522,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3978953.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/coucoupoc",
                "username": "coucoupoc"
            },
            "url": "https://myanimelist.net/reviews.php?id=279522"
        },
        {
            "content": "Beautiful girls and dragons. With a ton of fanservice.\r\nSeikoku no Dragonar is definitely your typical harem. The entire series based around the hero, who has multiple girls fall in love with him. The difference is, this series throws dragons into the mix.\r\nBrief summary: Learning to ride and tame dragons comes easy to most students at Ansarivan Dragonar Academy  except for first-year student Ash Blake. Ash is the laughing stock at school because, despite his unfashionably large star-shaped brand that marks him as a future dragon master, he has nothing to show for it. His dragon has never appeared. One fateful day, Ash's dragon awakesin full glory, but appears different than any dragon ever seen before,  in the form of a beautiful girl, Eco! What's worse, Ash soon discovers that this new dragon has attitude to spare, as she promptly informs him that she is the master, and he, the servant. Ash's problems with dragon riding have only just begun. But as the series progresses, Eco begins to develop feelings for Ash, and their relationship soon begins to take on a new shape.\\n\\n\r\nThe story is definitely not the most unique plot that I have ever watched and is highly predictable.The MC helps girl, the girl falls in love, and the cycle is repeated as is true with most harems. It has a ton of action, and does transition very smoothly. It was not confusing in the slightest bit. The best aspect of the story however are the dragons. It's very interesting and intriguing to see the relationship the dragons and humans have, and to see them work together to accomplish goals. The story is indeed a fun ride though if you don't nitpick at every little detail. \\n\\n\r\nThe art and sound of the series are good. I enjoyed all the music used and thought it fit the mood of each episode and series as a whole. The characters are unique from one another. You don't have the cookie cutter anime girl used for all the females. Plus, they are all animated very well. \\n\\n\r\nOther than that, you have the fan service. The fan service definitely plays a huge role in this series, and is present in almost every episode. Although, I must say that I don't feel it was being shoved down my throat as with some other series. \\n\\n\r\nOverall, if you are looking for a series that has action, beautiful girls, and dragons, this show is for you. It has great deal of fan service, and the story will keep you entertained. It is a fun ride, though very predictable, but in the end will keep your interest if you don't over analyze it. \\n\\n\\n\\n\\n\\n",
            "date": "2014-06-22T19:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 148101,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3093261.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DatDamnPR",
                "username": "DatDamnPR"
            },
            "url": "https://myanimelist.net/reviews.php?id=148101"
        },
        {
            "content": "Seikoku no Dragnoar a typical generic harem but with dragons and power ranger armour.\r\nActual Score: 6.8\r\nStory: 7\r\nThe story is highly predictable in a sense of its harem nature as it follows MC helps girl, girl falls in love and gets added to the harem which is basically what happens during most of the show. Yes there are dragons are very cool and one of the best aspects of the show but if what you want is a serious story your not going to find but it is a fun ride though and is not boring.\r\nArt: 6\r\nThe art is fairly normal its not crap but itsnot good its okay; but the dragons I found to be well done and were the only things that really stood out me from the rest of the art.\\n\\n\r\nSound: 7\\n\r\nThe opening and endings of the show where nothing to interesting with a fairly mild piece as the opening that was skipped every time but the ending was more interesting and fitted the show well.\\n\\n\r\nCharacter: 7\\n\r\nThe characters of show were ok but were to flat as most followed there classic harem archetypes like the Tsundere e.g Eco and Silivia and the heroic male Ash who without the help of the girls and his one awesome super power would be a pile of charcoal by the 2nd episode also he is really nice. But aside from some of them do get some character development which does give the characters more depth and creates a bigger interest.  \\n\\n\r\nEnjoyment: 7\\n\r\nNow then I did enjoy the show as it was a break from all the serious anime of spring 2014 and was a fun ride all the way through but was a bit too predictable.",
            "date": "2014-06-21T12:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 147885,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=147885"
        },
        {
            "content": "Seikoku no Dragonar is set in an alternative universe were people can be chosen to bare a pal, or dragon, during a certain age. Its genres are ecchi and harem, and so you can't really expect much from it. While people may complain about its overuse of large breasts just to use as fan service and eye candy for the audience, this is expected for typical harem and so is easily understandable in this review.\r\nStory: 6\r\nAs mentioned before, this is a stereotypical harem laced with lots of ecchi scenes. It's got everything in it to qualify it as a harem and so most scenes placedthroughout the entire anime are easy to undermine and could, in most cases, be classified as cliche. While this may be true, the anime still presents to us an interesting story line filled with unexpected twists that would make you watch more, despite its overuse of ecchi scenes you would see in just about any harem anime. Adding to this fact, its pacing is slightly too fast, yet is a bit understandable at times.\\n\\n\r\nArt: 8\\n\r\nThe first thing you would think of when watching this anime is that ITS ART IS SO HIGH QUALITY. Actions done by the characters are done very fluidly with its backgrounds also drawn with the same amount of detail. Despite this said, there are not really any scenes where the art would take your breath away. They all seem to be there just because they need to be there and in that quality to match. Its purpose is to basically present its surroundings simply for you to forget about it a few seconds later. \\n\\n\r\nSound: 7\\n\r\nNot that much to say about sound. The OP and ED are catchy and the voices really match their characters. The stereotypical tsundere gets an abnormally high, yet cute voice and the somewhat arrogant princess gets a low proud voice that still never fails to actually say certain inappropriate lines that, in the end, may sound much more befitting to her character. That said, its sound affects are things that we've already heard before, nothing special, but still very appropriate to whatever is played out to us.\\n\\n\r\nCharacter: 5\\n\r\nWe have a tsundere dragon that has some kind of connection with the queen of Avalon, a stubborn princess that refuses to say what she really feels, and a dense male protagonist, who for some inexplicable reason, gets himself a special dragon that comes in a form of a human girl. If you ask me, thats just about all you need to make up a harem anime. Though we are given quite a bit of development behind them, the very fundamentals of each of their characters are still very much missing. I, personally, is very keen to know who exactly Ash's parents and how exactly did he meet the princess so easily. Moving away from that, some characters also just come and go very quickly. Most appear out of nowhere just to give some random fan service. With this, this part of the review gives a five to its characters.\\n\\n\r\nEnjoyment: 9\\n\r\nDespite all of these setbacks, the enjoyment factor of this anime is very high, though that may just be for me. Of course, people who don't like the harem and ecchi genres would think otherwise, but there is a reason to why this anime was categorised under these titles. Why would someone who can't take horror watch a horror anime? Even if one did, their review would be bias by saying 'its too scary' when that is the whole point of the anime. Getting back on topic, this anime is so far very enjoyable. Though the stereotypical harem jokes may seem like nothing, some are still nonetheless rather funny. Action scenes are also well capable of stealing your attention away and putting you back on its semi serious plot. \\n\\n\r\nOverall: 7\\n\r\nNot too high and not too low. This is an anime to be watched and forget about, though it does show some potential to move away from that. It is recommended that you watch it when you are bored and just want to kill time.",
            "date": "2014-06-07T20:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 146239,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3827391.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Anlanther",
                "username": "Anlanther"
            },
            "url": "https://myanimelist.net/reviews.php?id=146239"
        },
        {
            "content": "This is my first ever review so bear with me, this may look sloppy\r\nGenerally i liked this anime even though many didnt and i would say that much of it belongs to the ending that most people dont agree with, one of those people being myself. Though i am not saying that you wont.\r\nStory: 7\r\nThe story is pretty interesting though it has alot of Familiar of Zero feel to it, i liked the story as it was an interesting take on the situation\r\nSound: 4\r\nThe opening and ending music were very disappointing to me, i didnt enjoy either and i would mainly skip them which issomething i wouldnt normally do, i will say though during battles the music is grand and works well with the action\\n\\n\\n\r\nArt: 6\\n\\n\r\nDont have much to say about the art, though if i would put it somewhere i would put it here; i enjoyed the fan service as there is a good amount in this show though this may be a turn off for some of you guys out there\\n\\n\r\nCharacter: 8\\n\\n\r\nGood character development for most of the main characters though some of the more side characters are mainly forgotten about but i really like the bunch of main characters and they were enjoyable to me \\n\\n\r\nOverall: 7\\n\\n\r\nI liked this show as i thought it was cool with the dragon concept and the weapons that they could use were all really cool to me. The only parts i really disliked was the honestly the ending which i cant stand.\\n\\n\\n\r\nI would very much so want a second season to this as it would be a favorite show of mine if they were to tweak a few things in the story",
            "date": "2015-06-18T19:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 190583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4556259.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VexxumTrickz",
                "username": "VexxumTrickz"
            },
            "url": "https://myanimelist.net/reviews.php?id=190583"
        }
    ],
    [
        {
            "content": "Over the last couple of years we've seen a steady stream of light novels being adapted to anime series and now we get yet another with this series, produced by C-Station a former offshoot of Bee Train Production Inc. and the overall result is a marginal failure.\r\nAnime is full of time honored clichés that never seem to die and Dragonar Academy is so packed full of them it shows just how void this show is of any creativity or imagination. Giant bouncing breasts on all women characters, naked magic girls showing up from nowhere and mood swinging tsundere characters are ripe and abound in thisseries; it feels less like this is less of a story of it's own and more of a copy paste job from a few dozen other series of it's kind.\\n\\n\r\nTaking from probably equally lazy source material, the scripts written by Noboru Kimura are shoddy and thrown together with no thought or effort behind them.  The large cast of cookie cutter characters will bore you with just how uninspired they are.\\n\\n\r\nThis kind of tripe is barely forgivable from a group of first time creators but the fact this comes from several long time animators who had once made excellent shows in the past with their old studio, before breaking away to form this new company, adds more insult to injury.\\n\\n\r\nTopping off the cliche storm is a number of soft-core moments between a nude dragon lady giving oral to a pseudo tentacle rape scene, you would think they'd rather be making a hentai series.\\n\\n\r\nAnimation and art is just as awful with ugly looking dragons to top off the grossly exaggerated character designs. One would think with a show centered all around dragons it would be the one thing you could get right but the dragons look like a mix of generic fantasy dragons painted in pastels that makes them look like they're covered in hard water spots or they're wearing the projection clothes from the Count of Monte Cristo anime.   \\n\\n\r\nInterestingly, half the time you won't see any dragons and it will be mostly focused on whatever lame slice-of-life scenarios ripped from every other show of it's kind.  Echo while being presented as a dragon is little more than a magical loli with some horns glued onto her head.\\n\\n\r\nThe musical score was somewhat interesting and entertaining and might be the one redeemable factor but it's tie to this awful show doesn't make me enthusiastic to  to listen to it.  The theme songs are typical for a show like this, shoehorning in as many voice actors, who may or may not have any musical talent, as you can to sing an ear shrieking J-pop song to sell some more CDs,  \\n\\n\r\nDragonar Academy is uninspired, lazy and contrived. Beating down dead clichés that have saturated the market of the last couple years alone this would barely make the grade for a crappy one episode OVA, forget a 12 episode season.  I get the feeling even if you are looking for a silly fanservice show there are likely far more entertaining options out there that are less copy-and-paste than this show.\\n",
            "date": "2014-07-20T12:12:00+00:00",
            "helpful_count": 58,
            "mal_id": 152905,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/44864.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ShadowBlazer3000",
                "username": "ShadowBlazer3000"
            },
            "url": "https://myanimelist.net/reviews.php?id=152905"
        },
        {
            "content": "Story\r\nThe story was since episode 1 really interesting, i liked the idea that Ash Blake the MC could ride any Dragon he wanted because of what happened to him in his childhood by saving a girl that he doesn't remember in the present, you will predict since the begining who she is, well he is about to die by a girl he saved again and that's when his dragon Eco appears and not just a dragon a humanoid dragon. I would have rated higher but they left little questions that were important for the viewer to understand more the story.\r\nArt & Sound\r\nBoth were very goodbecause i really liked the music on the battle scenes, the voice acting was very good could have been great though and the ED song for some reason i liked it but that is my opinion you may not like the ED song, the art was very good i liked the dragons art style and even more with the bigger ones, bewbs are there too but you won't mind it like me.\\n\\n\r\nCharacter\\n\r\nThis is why i didn't rated higher, because i didn't got to know the backround of the character, they never remembered they met when they were kids, both Ash & Silvia, despite that, the characters were interesting because you want to know more about the majority of them.\\n\\n\r\nEnjoyment\\n\r\nI really enjoyed this anime, i wanted to see more, i wanted a 2nd season because of the questions at the end and to know the characters even more than what is shown here.",
            "date": "2015-08-03T11:56:00+00:00",
            "helpful_count": 45,
            "mal_id": 195076,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195076"
        },
        {
            "content": "After watching the first episode, I thought that this had a lot of potential to be a good series but unfortuantly it lost it's potential as the episodes went by. \r\nStory: \r\nAt first the story interested me, it felt quite unique in a way and parts of the story reminded me of Soul Eater at times ( for some reason ) but after a few episodes in; it seemed to abandon its interesting plot and instead turn it into more of a regular harem/ecchi anime. I actually do enjoy harems to a degree but when you have an actual story first and then abandon it1/3 of the way through, it can make you feel disapointed because of its wasted potential.\\n\r\n That being said, the pacing felt fine and didn't feel slow or rushed barely at all. \\n\\n\r\nArt: \\n\r\nI did enjoy the art, it had some interesting designs and the girl characters were cute. Although, the actual dragons in the show could have had something more in their designs but they're not at all completely bad. \\n\\n\r\nSound: \\n\r\nIn my opinion, one of the best things in the entire show was the opening and ending themes. The opening was really good and showed some really cool scenes. The ending was cute and had a fun song which was a nice reward after going through each episode. The voice actors/actresses did a good job throught the show ( you know they wanted the villian to be mysterious and cool when they cast Dio Brando's voice actor )\\n\\n\r\nCharacter: \\n\r\nNow this is where everything goes wrong. I thought most of the characters were paper-thin with nothing really going on with them. Some of the characters got character development while most just had no layers even if you thought they did. I also thought the villian was just bad and i wish we had gotten more depth to the character but unfortuantly we didn't. \\n\\n\r\nEnjoyment: \\n\r\nHere's the weird part; i actually really enjoyed it. I got the same enjoyment as I would watching any harem. Even though I had so much problems with it, i actually looked foward to watching more. If you enjoy harem/ecchi shows i think you would actually enjoy this even though it has many flaws. \\n\\n\r\nOverall: \\n\r\nWith the potential I thought it had at the beginning being destroyed as time went on, after watching the whole thing I feel disappointed. However like I said, if you enjoy harems and ecchi anime then by all means watch this one. But I don't think that this will be a very rememberable one with its very plain characters and interesting story it mostly abandoned. Seikoku no Dragonar turned out as a mediocre harem.",
            "date": "2014-07-17T11:59:00+00:00",
            "helpful_count": 43,
            "mal_id": 152491,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2778347.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SamuraiScythe",
                "username": "SamuraiScythe"
            },
            "url": "https://myanimelist.net/reviews.php?id=152491"
        },
        {
            "content": "So, this is my first official review, and I hope to write many more after this one.\r\nStory: 6\r\nThe story is a generic harem/fantasy story, filled with \"Plot\" and some battles. I liked the story and its concept, though halfway through the show, it became a bit too predictable. Though I really enjoyed certain parts, I also found myself wanting to fast forward others.\r\nArt & Sound: 7\r\nI grouped these two together because I felt like they complimented each other in this anime. The art was pretty good and consistent throughout the show, which is important. No particular sound stood out for me, but I did feellike the bgm (background music) in the battle scenes intensified the character's moves and passion.\\n\\n\r\nCharacter: 7\\n\\n\r\nThe characters were good. Nothing more, nothing less. There weren't any exceptional or very outstanding and original traits between them, but they were good. The show had the usual harem girls, for example: a busty one, a rich one, a loli, a tsundere, and an erotic teacher etc. There were a few more, but that was the gist of it.\\n\\n\r\nEnjoyment & Overall: 7\\n\\n\r\nI did enjoy the show quite a bit, but it didn't really strike me as exceptional, partly because I have watched hundreds of similar anime and so I've kind of gotten used to all the recurring things in harem anime. The characters were alright, but neither them nor the story were able to pique my interest past the point of amusement.",
            "date": "2015-02-28T17:03:00+00:00",
            "helpful_count": 37,
            "mal_id": 181412,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2180965.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lyevino95",
                "username": "Lyevino95"
            },
            "url": "https://myanimelist.net/reviews.php?id=181412"
        },
        {
            "content": "Seikoku no Dragonar... If there's something like a huge basketball ring in front of you, larger than the usual and there's a normal basketball ball in your front. You can't definitely miss from close range, can you? That's how I can picture a perfect analogy to the premise of Seikoku no Dragonar. But in this case, we are left wondering how Seikoku no Dragonar missed a blatant open chance for winning its potential.\r\n***************************************************************************\r\nStory...\r\nI gave it a 6, honestly. Sometimes, even the most generic story can achieve better heights if given a thoroughly direction. But yet again, ruing their chances is this particular series. The storyitself is solid. With a fantasy setting, the variable factors that can be used were supposed to be almost unlimited. But why? Why did Seikoku no Dragonar limited themselves to such product?\\n\\n\r\nBlaming the storyboards and the director must be a vain thing to do. Why? Because from what I saw, the director had very good series to his helm, so the last definite thing that could've dragged Dragonar to the bottom must be, yeah, the reference material.\\n\\n\r\n***************************************************************************\\n\r\nArt...\\n\\n\r\nA beautiful realm was presented, with fictional beauty that is out of this world. I can easily point this out as a standout in terms of the drawings. Whether it be character designs or the setting world, it was consistently beautiful. There's nothing to doubt that the art department definitely wins a deserving 10, isn't it?\\n\\n\r\n***************************************************************************\\n\r\nSound...\\n\\n\r\n6, I guess... Something inside me just made me skipped the OP and ED successively whilst watching in marathon since I didn't enjoyed the theme songs. The BGM(s) were also quite bland in my opinion. So a 6 makes perfect sense...\\n\\n\r\n***************************************************************************\\n\r\nCharacter(s)...\\n\\n\r\nThis is where they got nastily messy. I am no reader of the reference, but if the anime makers had been thoroughly confused on the characters, then I can find the salvation to pardon them.\\n\\n\r\nMost of the characters were so... plainly bland boring... No one is even interesting at the slightest. Eco, the generic loli and Silvia, the voluptuous princess as tsunderes failed to materialize the true charm of their characters. Neither the supporting casts, including the smexy maids or the student extras in the background had even made a scene worth praising. All is played by the point of \"seduce the men\" and \"show your booty and tits for fanservice's sake\".\\n\\n\r\nNow, focal character, Ash Blake. Is he decent? Maybe, to some, I guess. I suppose I've outgrown his types, but frankly, he did a fair job as MC. Started out simply as an outcast then gaining new powers, he played the MC well. But in the end, he is not interesting. That's the point in appreciating the MC, right? Whether he/she is interesting, it all comes down to this focal issue. And this is where Dragonar failed miserably. The ability to make the MC interesting, is the least they should've done keenly.\\n\\n\r\nWe go to their adversaries faction. Do anybody stroke as interesting? The answer yet again, is a big \"no.\" There's really little point in delving too much on the characters since Dragonar had utterly failed on this aspect.\\n\\n\r\n***************************************************************************\\n\r\nEnjoyment and Overall...\\n\\n\r\nNothing except for a 3. Was it too harsh? No, I guess not. Enjoyment was scarce but I'll tell you, even most of the fanservice scenes didn't inject a life to my watching interest. I guess all my laughs whilst watching is part where I am in absolute confusion as to why I even thought of watching a series that I already foresaw would be bland and boring. My thoughts were in jumble whether to drop it by episode 06, but I won't lie. I am a die-hard fanatic of Koyasu Takehito and even his most utter craps is something I've watched.\\n\\n\r\nSo concluding. Dragonar might be a winner in terms of sales. But in terms of worthiness(money and time watching), it's not. It's like paying a gold bar in exchange for a single bad-tasting moldy bread, leaving you feeling ripped afterwards the entire running time. \\n\\n\r\nBut like I said, Dragonar is directly oriented to booty-and-tits- lovers. But in my head, I think I'll just go settle for a bonafide H material instead of watching borderline tentacles ripping panties and groping tits.",
            "date": "2015-01-25T21:47:00+00:00",
            "helpful_count": 19,
            "mal_id": 178984,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302451.jpg",
                "scores": {
                    "animation": 10,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nanyatimz",
                "username": "nanyatimz"
            },
            "url": "https://myanimelist.net/reviews.php?id=178984"
        },
        {
            "content": "This is one of those animes that had great potential, but falls short thanks to a combination of clichés, poorly developed characters, uninteresting story, excessive fanservice, etc.\r\nIts a shame, but the most enjoyable part of this serie would have to be the very begining of the ending song, aside from that, I didnt really got to enjoy anything else. I even feel I was too generous with my rating.\r\nI would only recommend this anime if you are very bored and want a lot of random fanservice (tentacles included), because I doubt you will watch it for either the characters or story, but that is upto you to decide.",
            "date": "2014-06-28T23:47:00+00:00",
            "helpful_count": 15,
            "mal_id": 149205,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1571483.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yamigami",
                "username": "Yamigami"
            },
            "url": "https://myanimelist.net/reviews.php?id=149205"
        },
        {
            "content": "In an amazing world filled with magic, we are introduced to the world of the great Dragons. Dragons as far as the eye can see, and tsundre lollis, wait i thought this was Seikoku no Dragonar and not Toradora? \r\nHello ladies and gentlemen, this is a brief review of what to expect from another mediocre anime that doesn't know what it wants to be. \r\nLet's start with an overview: \r\nWe are following our main male protagonist, a young sixteen year old boy Ash Blake. Ash Blake is your typical young male with a problem, he is the only one in his school who has yetto acquire a dragon of any form. While his comrades all have majestically grown dragons. This proves to be quite a problem as he gets teased and bullied over his yet-to-exist dragonkin, and hence he get's the name of \"Problem Child\", because who wouldn't get mad and beat up people for not having a dragon? Yet as not having his own dragon, he has an ability; to ride any dragon he wants, and be perfect at it.(OVERPOWERED MAIN CHARACTER INCOMING?). \\n\\n\r\nA new year has started and the first class lessons is dragon fight, Ash has to borrow a friends Dragon and accidentally pushes into a female and her dragon, the beautiful female princess Silvia Lautreamont. In a heated discussion with \"shots being fired\" at each other, they agree to settle their difference in an upcoming festival's race. Some time in the race the dragon of Ash's friend gets exhausted in a forest, Ash suddenly feels a uncomfortable feeling and decides to check it out. After a short walk he finds a mysterious man with a phantom of the opera mask on his face. The man is our main villain and is nothing out of the ordinary. The man tells his underling to fight the young boy after analyzing his potential as a dragon-master. The battle is short and the underling get's thrown off a cliff. Ash's hero senses start to tingle and he knows he have to save her, by the time he manages somehow to grab her arm, the sides have changed. The young girl switches sides with our young protagonist and Ash is falling to his doom. But not for long!! A mysterious glow on his arm appears, and Ash knows, this is his dragon appearing before him. And who would have thought, that his dragon is a super overpowered machine of lollies thrown to the story for no reason, except to imitate Toradoras - Asaika Taiga. Yes, i said it.\\n\\n\r\nCharacters:\\n\\n\r\nHuff, where to begin? This anime has major problems with where it wants to go. Fantasy, ecchi, tsundre? WHERE? Let me spit it right out, the anime's characters are bland and bring nor nothing new, nor anything worthwhile watching. Main Characters are basically copies of the main characters of Toradora.....Ash Blake is a normal guy, with surreal powers that he gets for no good reason really, except for meeting a overpowered dragon empress inside a forest when he was small(what animes has this happened in before? oh like 10 of em). He is your \"I am a badass\" and \"I Try to be cool and kind hearted\" type of character which brings no flavor to the anime, and get's boring to watch. The Tsundre, is tsundre, just like any \"original anime\" we get introduced to a little girl who falls in love with his master, but can't really tell him that, so she pushes him around calling herself his master. The other characters have no story or at least one good enough to enjoy the series, as the most of them are just big boobed bimboes with dragons.\\n\\n\r\nAnimations and Sound:\\n\\n\r\nThis is where we the anime exceeds imo, the art is fantastic. The dragons, armors and the characters themselves are well designed, but still have something missing to them, which i to date can't really put my finger on. And the great arts spring is even better looking with the awesome classical type soundtrack which you normally would find in any good fantasy series. I could easily download the tracks and enjoy them for many hours, so on that front there are really no problems!\\n\\n\r\nOverall:\\n\\n\r\nThis anime leaves much to be desired.  it has a good animation design and soundtrack that has little flaws, countered by a failed attempt on genre's that in my opinion does not go well. It starts of as a pretty typical and not that bad of a fantasy anime, but it develops into this monstrous tentacle hentai wannabee.(Yes there are a lot of tentacles action that fondle them triple D'sized cups that all girls in this anime have). \\n\\n\r\nI guess i was thrown of the chair, not that I don't enjoy some fan service, I just found it unappealing in what could have been a not so bad anime. The characters are straight bland, and the series tries to much to be like Toradora and Zero no Tsukaima(which are FANTASTIC), and pretty much leaves you hanging and loathing for more. Maybe a rich backstory and less fan service, could have been the justice this fantasy anime needed. \\n\r\nAll in all, I give this anime a 4/10. With a disappointing and almost non existent plot, the art and sound was top notch, but not enough to carry a whole bunch of pathetic characters to a form for any glory.  \\n\\n\r\nThis is my first review, and hope you guys enjoyed it. All form for criticism is welcomed with a good embrace. \\n",
            "date": "2014-11-17T17:43:00+00:00",
            "helpful_count": 11,
            "mal_id": 168993,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3915137.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/darkkugan",
                "username": "darkkugan"
            },
            "url": "https://myanimelist.net/reviews.php?id=168993"
        },
        {
            "content": "All I have to say is... wow. Simply, wow. \r\nThe show had much potential, but halfway through the series, the directors realized that not everything from the LN could fit within a 12 episode series. \r\nToo bad. \r\nInitially, the story was great. A male lead with a hidden power, a cute heroine, a equally as cute \"main chick\" for the lead... and all set within the school setting. It had great potential. Unfortunately, with the introduction of flat characters and a story filled with plot holes, the quintessential (to me at least) anime quickly fell apart. \r\nI swear man, the ending did not leave mesatisfied. Did Sylvia actually find out it was.... hmm. I seem to have forgotten the MC's name. That's funny, since I just finished watching the series 30 mins ago. \\n\\n\r\nOr the other really infuriating plot hole of Anya's sister not recognizing her. Seriously? She's the only other dark female in the entire world! She was right in front of you! Dammit!\\n\\n\\n\r\nThe only thing OK with the series was the art, and even then, the quality of the breasts were of lesser quality than even some of the worst hentais!! \\n\\n\\n\r\nGeez...",
            "date": "2014-12-14T03:51:00+00:00",
            "helpful_count": 11,
            "mal_id": 172167,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4120483.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SaigoNoAkuma",
                "username": "SaigoNoAkuma"
            },
            "url": "https://myanimelist.net/reviews.php?id=172167"
        },
        {
            "content": "Story: The plot is almost a copy of the light novel series, so adaptation-wise, they followed the script. However this story seems better told in words than animation, given its almost cliche cut-and-paste nature. It's the standard \"magic knight saves princess\" story with an ecchi direction. Possibly enjoyable for those looking for this kind of genre  but unimpressive. \r\nArt: The art style was somewhat simple with the shading almost exclusively reserved for blushes and cleavage. It was easy on the eyes but lackluster. \r\nSound: 12 episode harem fantasy  doesn't have dramatic soundtrack, so the main focus is OP/ED. I found Sakakibara Yui's OPcatchy but her distinctive style of singing isn't for everyone. The ED was cute but it seemed more appropriate for a purely slice-of-life show. Looking at the soundtrack as a whole, it delivered for the type of magic harem shenanigans the show was aiming for. It wasn't superb but appropriate. \\n\\n\r\nCharacter: Standard tropes. The characters were not creative, even regarding character design. It's sometimes enjoyable seeing a cliche like a loli tsundere but there were too many cliches  in this show. There's a static nature to the characters I didn't find enjoyable. \\n\\n\r\nEnjoyment: If loli tentacle harem was the show you were expecting, it hit the mark. For everyone else, the ecchi was excessive and the show weak. It was somewhat fun seeing cliche after cliche but it got old quick. \\n\\n\r\nOverall: A show I wouldn't personally recommend to many. The amount of effort put into the adaptation is mediocre but acceptable. Not the worst but almost niche due to its multiple cringe tentacle molestation scenes. \\n",
            "date": "2014-08-19T18:25:00+00:00",
            "helpful_count": 8,
            "mal_id": 157189,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3371023.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mystry08",
                "username": "mystry08"
            },
            "url": "https://myanimelist.net/reviews.php?id=157189"
        },
        {
            "content": "Seikoku no Dragonar truly is one of the worst things I have watched. It is an awful series and I would not recommend it to anyone. Despite having potential the creators disappointed me gravely. I watched the entire series thinking at the end of each episode that it cannot get any worse. I was mistaken. \r\nStory : 3\r\nAs I said before the series had potential primarily due to the general story idea. Regrettably the end result was horrible. The story, in several cases, made absolutely no sense. Dozens of plot holes and the poorly written backgrounds for the main and supporting characters made a badstory line into something utterly pathetic. \\n\\n\r\nArt :4\\n\\n\r\nArt may well have been the only decent thing about this series and when I say decent I do not mean that it was neither innovating or unique. It is more like what you would expect from this type of anime. The art in several cases seemed rushed and uncreative since no effort seemed to have been made to give that extra spark or glamour. Plus I did not enjoy the strong influence from hentais.\\n\\n\r\nSound : 2\\n\\n\r\nEverything in relation to sound was completely subpar. The soundtrack was at best mediocre. Nothing really stuck with you except an annoying ending theme. The opening was not much better. As for voice acting I have to admit that once again they made no effort to create something unique. All characters were poorly voiced to the degree that almost all characters reminded you characters from other anime. It seems to me that no attempt was made to make them 'unique'.\\n\\n\r\nCharacter : 1\\n\\n\r\nAs I said before the characters were poorly written, portrayed and voiced. Nothing good can be said about them. No information was provided during the series about them, none that made any sense at least. Even when an attempt was made to introduce some piece of information about the characters background it was swiftly demolished by some random event that had no place being there or irrelevant interruption from another character thus creating the illusion of a cliffhanger. \\n\\n\r\nEnjoyment & Overall: 3\\n\\n\r\nIn essence this a horrible series that I would not recommend. Nothing in it can be viewed as good or average. The creators failed miserably and this failure could only be explained if this was their first attempt in anime creation. Furthermore I blame the stations that decided this was a good anime to air and further pollute the anime world. In my humble opinion nobody should have to suffer viewing this series unless you feel you need to punish yourselves.\\n\\n\\n",
            "date": "2014-06-25T12:12:00+00:00",
            "helpful_count": 7,
            "mal_id": 148541,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/549351.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/partali",
                "username": "partali"
            },
            "url": "https://myanimelist.net/reviews.php?id=148541"
        },
        {
            "content": "Don't go into this anime expecting a great story and nice characters/(developement) because there isn't.\r\nThis is your standart harem/magic/school anime in a fantasy world. (If you have some anime of the sort I haven't watched yet feel free to pm me ;))\r\nThe characters don't really have anything special going for them but that doesn't mean this show is bad. It's not the greatest, sure, but it's not necessarily bad. It's just your typical show with a more or less predicatable storyline.\r\nThere is our main dude. And as the show progresses more and more girls seem to fall in love with him, pretty standart.\r\nThe art forquite pleasant but again nothing crazy good, same goes for the music.\\n\\n\r\nAll in all a quite predicatable show with matching characters.\\n\\n\r\nStill, I enjoyed this show.\\n\\n\r\nIf you just wan't to watch a harem with some \"hot\" girls and a bit of action then go for it, if you are looking for more than that, it's probably not for you.\\n",
            "date": "2019-02-09T07:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 301250,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7571142.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sching-Ling-Bing",
                "username": "Sching-Ling-Bing"
            },
            "url": "https://myanimelist.net/reviews.php?id=301250"
        },
        {
            "content": "Seikoku no Dragonar is an average anime with an average plot, average characters and one of 'those' endings. I don't mind ecchi shows in general but the premise was interesting so I was hoping that this one would maintain a better balance between having a plot and finding excuses to show everyone's boobs.\r\nPositives\r\n- The OST is quite nice.\r\n- The opening is quite nice.\r\n- Eco is cute.\r\n- Character interactions are quite funny most of the time.\r\nNegatives\r\n- As the show went on the art choice for how characters hair and eyes interact really got on my nerves.\r\n- 100% needless inclusion of tentacle enemies and dedicating lots oftime to scenes with tentacles whenever they show up. (bleh)\\n\r\n- It was like half way through the show before they realised they didn't have enough time to wrap it up so they rushed it.\\n\r\n- Absolutely pointless side characters.\\n\r\n- That damn tease ending.\\n\\n\r\nOverall not something you should go out of your way to watch but I don't regret giving it a go.",
            "date": "2014-06-23T11:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 148241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2653305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Doubleagent",
                "username": "Doubleagent"
            },
            "url": "https://myanimelist.net/reviews.php?id=148241"
        },
        {
            "content": "Hmm, well, just like everyone else, I feel the ZNT vibe here, although it's clearly quite different. The setting feels a bit like louise and saito with their roles switched around BUT if louise weren't as much of a bitch and saito weren't as much of a wimp.\r\nCan't say I like how pretty much every japanese mc in a setting like this is giant pushovers who cares too much about people around them though. Get some balls and learn how to stop getting pushed around, also, learn how to be merciless and kill people when necessary, at least in a fantasy world where the ruleis kill or be killed. This isn't our modern day society, crap like that is not admirable, it's just pure stupidity.\\n\\n\r\nThen there's annoying characters everywhere, seems like almost every character comes across as extremely annoying at the start only to become kinda annoying later on or just boring altogether. All of them have their own overly strong sense of justice and seems to believe that everyone who doesn't agree with them are foolish and completely wrong. I especially hate people like the researcher from the second episode who became the mc's teacher, she did something horrible enough that ought to warrant execution, but got away with no lessons learned whatsoever, not even any insults or physical harm when she was \"defeated\". \\n\\n\r\nThe author is barely half-decent, average might be overpraising him. Really, the setting itself feels quite weird. It seems to me the author couldn't decide on what he wanted, a modern day school setting or a medieval fantasy setting, so he went for both and combined them into some weird world where we have a lot of modern day elements such as food, buildings, schools etc yet we have a medieval world with no real technology and medieval buildings. It feels chaotic and half-assed. Honestly, after two episodes, I started to lose interest already. The characters are kinda plain, some are just plain boring and some are just annoying altogether. The story is similarly uninteresting. It doesn't grab your attention. \\n\\n\r\nThe only saving grace is that I really like dragons and fantasy, but this author not only managed to turn the fantasy into something that feels like \"fake\" fantasy, he also managed to turn the dragons into seriously boring creatures that are both ugly, lacks any personality whatsoever and seems to be pretty weak, they might as well be dinosaurs instead of dragons. Giving them more human-like personalities and perhaps the ability to speak would've made things much more interesting. Meanwhile, eco doesn't feel like a dragon at all since she doesn't even seem to have a dragon form, at least nothing has been revealed about it yet, she's also not that powerful and is pretty damn weak, maybe that has to do with her still being a \"newborn\" though. The astral flow thing and other settings are cringeworthy, especially the use of the random words that hardly make any sense, I also can't even count the amount of times I cringed at the numerous clichés that has been seen a million times before but was executed badly here. Urgh.\\n\\n\r\nWell, whatever. I like how eco is so protective of the mc, that's something good, not that it's presented in a good way because she has to mention how he is her pet dog or something all the time, super tsunderes like this are really overrated and I think all of us are dead tired of them by now and just find them obnoxious instead of interesting or funny. The romance feels really half-assed, what is even going on? This is actually the type of story where I feel a harem would be in the way, the mc and his dragon are better as the only pair, yet we have unnecessary additional settings such as the ultra cliché where there's this girl the mc helped as a child and she doesn't realize he's currently by her side etc...\\n\\n\r\nNow, one of the biggest flaws is that the ecchi is excessive and ruins serious scenes by being too random, it might also be me not being a teenager anymore and unable to appreciate the mindless erotic scenes that are there for absolutely no reason whatsoever except to give the viewers a boner. Things such as tentacles being used to attack from a creature that reasonably shouldn't have any, scenes that are just there to be erotic or armor/battle clothes that leaves breasts and thighs exposed for absolute no reason, looking more like an erotic bathing suit than actual clothes, much less armor/battle clothes(and this is a kinda haughty and strict battle-freak princess we're talking about), looking more like she's about to go to an orgy than a battlefield, or even events where clothes are destroyed for completely illogical reasons that makes you think \"what's up with this retarded garbage? did the author become temporarily brain damaged when writing shit like this?\", are ever present, which begs to suspend disbelief, but since it's so utterly idiotic, even I, as a master of suspending disbelief, can't possibly lower my standards to the point where I find this to be acceptable.\\n\\n\r\nI tried my very best to watch this, but after watching 6 full episodes over around two hours of time, I finally gave up and couldn't take it anymore since it got worse and worse the longer I watched. The setting is bad(even cringeworthy), the dragons are boring, the people are uninteresting and plain, might even call them extremely shallow and superficial, the scenery is subpar and fails to immerse me, the story is dreadfully lacking and most of the characters are irritating. I bet this story would do way better as a revenge-type story instead of this garbage, the mc would just have to man up and the loli dragon would have to lose about 70% of her tsun. Seeing the mc screwing over all of these irritating characters would be sweet.",
            "date": "2018-09-20T17:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 289534,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=289534"
        },
        {
            "content": "A Promising story with terrible delivery, average art, poorly placed music clips, dreadful characters with ridiculous and shallow narratives, and utterly annoying presentation all this anime is is a massive disappointment of what it could have been. i wanted to like this but it just kept pissing me off with stupid choices and neglectful writing. the main charter is an incompetent buffoon who could have easily been fixed with slight tweaks, his dragon is just stupid useless and annoying the entire time over using the excessively violent little cute girl cliche, there is the gutless female love interest who's shining moment is standing naked infront of a crowd of people and suddenly she is a hero and not a total loser, then there are a bunch of forgettable supporting characters who you feel were added just to give it the harem aspect and light comedy. also tentacles because fan service!",
            "date": "2018-09-05T09:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 288175,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 3,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheRedGojo",
                "username": "TheRedGojo"
            },
            "url": "https://myanimelist.net/reviews.php?id=288175"
        },
        {
            "content": "Dragons? I'm ready!\r\nIt starts off with introducing characters, you learn that poor Ash doesn't have a dragon, but has a different sort of ability, and people make fun of him for it.\r\nBy the end of episode 1, Ash gets his... dragon? \r\nIf dragons had long pink hair and took the form of young girls, sure. \r\nEco is adorable, but she's a bit bossy. The little girl brat type. She's a little hard to like at first, she starts to grow on you.\r\nSome of the Ecchi feels misplaced. Like it's just for the sake of it, which yes, a lot of it is, but there's alsoEcchi done well. Some of this is kind of in the middle. \\n\\n\r\nThe story isn't just focused on Ash and Eco, you learn about Silvia and Rebecca too. Their pasts, their dragons. Plus other characters get parts too. It's a wide variety. \\n\\n\r\nHalfway through I was enjoying it a lot more than I thought I would. It's definitely worth checking out.",
            "date": "2016-10-31T17:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 232978,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526839.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mikame-",
                "username": "Mikame-"
            },
            "url": "https://myanimelist.net/reviews.php?id=232978"
        },
        {
            "content": "The first part isn't so bad ( grade 4/10 ), but as it is a copy of the basic introduction of harem story that normal. Once the anime began the real part of the story, it become really bad.\r\nCharacters lost all their logic ( the tsundere ( which represent half of the female characters ) became docile in lot of scene without any reason), and the worst caracter ( the elf ) become a principal one during a long arc. The story is full of random stereotype scene, badly done without any surprise except that boobs grow more and more.\r\nTo be honest, I had todo something else during the second part of the anime as it was really boring. Even the plot twists are badly done, not even suprising, and they have noone real impact on the story, making them totally useless and free.\\n\r\nWhen the anime try something new, that is really confuse for something supposed to be simply to explain ( All \"kidnapping\" and hostage episodes ). It could be a better anime if it had passed the useless scene fast instead of focus on them ( All bathpassages ).\\n\r\nNoone feeling come from the anime. It is just bland.\\n\r\nTo finish, the fight aren't dynamic, and the contract with dragon is really a bad thing, making the fight, again, really confuse ( \"invocation-crafting\" scene duration is most important that the real time of the fight, during the time the opponent could destroy 3 cities )",
            "date": "2018-05-01T16:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 279522,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3978953.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/coucoupoc",
                "username": "coucoupoc"
            },
            "url": "https://myanimelist.net/reviews.php?id=279522"
        },
        {
            "content": "Beautiful girls and dragons. With a ton of fanservice.\r\nSeikoku no Dragonar is definitely your typical harem. The entire series based around the hero, who has multiple girls fall in love with him. The difference is, this series throws dragons into the mix.\r\nBrief summary: Learning to ride and tame dragons comes easy to most students at Ansarivan Dragonar Academy  except for first-year student Ash Blake. Ash is the laughing stock at school because, despite his unfashionably large star-shaped brand that marks him as a future dragon master, he has nothing to show for it. His dragon has never appeared. One fateful day, Ash's dragon awakesin full glory, but appears different than any dragon ever seen before,  in the form of a beautiful girl, Eco! What's worse, Ash soon discovers that this new dragon has attitude to spare, as she promptly informs him that she is the master, and he, the servant. Ash's problems with dragon riding have only just begun. But as the series progresses, Eco begins to develop feelings for Ash, and their relationship soon begins to take on a new shape.\\n\\n\r\nThe story is definitely not the most unique plot that I have ever watched and is highly predictable.The MC helps girl, the girl falls in love, and the cycle is repeated as is true with most harems. It has a ton of action, and does transition very smoothly. It was not confusing in the slightest bit. The best aspect of the story however are the dragons. It's very interesting and intriguing to see the relationship the dragons and humans have, and to see them work together to accomplish goals. The story is indeed a fun ride though if you don't nitpick at every little detail. \\n\\n\r\nThe art and sound of the series are good. I enjoyed all the music used and thought it fit the mood of each episode and series as a whole. The characters are unique from one another. You don't have the cookie cutter anime girl used for all the females. Plus, they are all animated very well. \\n\\n\r\nOther than that, you have the fan service. The fan service definitely plays a huge role in this series, and is present in almost every episode. Although, I must say that I don't feel it was being shoved down my throat as with some other series. \\n\\n\r\nOverall, if you are looking for a series that has action, beautiful girls, and dragons, this show is for you. It has great deal of fan service, and the story will keep you entertained. It is a fun ride, though very predictable, but in the end will keep your interest if you don't over analyze it. \\n\\n\\n\\n\\n\\n",
            "date": "2014-06-22T19:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 148101,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3093261.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DatDamnPR",
                "username": "DatDamnPR"
            },
            "url": "https://myanimelist.net/reviews.php?id=148101"
        },
        {
            "content": "Seikoku no Dragnoar a typical generic harem but with dragons and power ranger armour.\r\nActual Score: 6.8\r\nStory: 7\r\nThe story is highly predictable in a sense of its harem nature as it follows MC helps girl, girl falls in love and gets added to the harem which is basically what happens during most of the show. Yes there are dragons are very cool and one of the best aspects of the show but if what you want is a serious story your not going to find but it is a fun ride though and is not boring.\r\nArt: 6\r\nThe art is fairly normal its not crap but itsnot good its okay; but the dragons I found to be well done and were the only things that really stood out me from the rest of the art.\\n\\n\r\nSound: 7\\n\r\nThe opening and endings of the show where nothing to interesting with a fairly mild piece as the opening that was skipped every time but the ending was more interesting and fitted the show well.\\n\\n\r\nCharacter: 7\\n\r\nThe characters of show were ok but were to flat as most followed there classic harem archetypes like the Tsundere e.g Eco and Silivia and the heroic male Ash who without the help of the girls and his one awesome super power would be a pile of charcoal by the 2nd episode also he is really nice. But aside from some of them do get some character development which does give the characters more depth and creates a bigger interest.  \\n\\n\r\nEnjoyment: 7\\n\r\nNow then I did enjoy the show as it was a break from all the serious anime of spring 2014 and was a fun ride all the way through but was a bit too predictable.",
            "date": "2014-06-21T12:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 147885,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=147885"
        },
        {
            "content": "Seikoku no Dragonar is set in an alternative universe were people can be chosen to bare a pal, or dragon, during a certain age. Its genres are ecchi and harem, and so you can't really expect much from it. While people may complain about its overuse of large breasts just to use as fan service and eye candy for the audience, this is expected for typical harem and so is easily understandable in this review.\r\nStory: 6\r\nAs mentioned before, this is a stereotypical harem laced with lots of ecchi scenes. It's got everything in it to qualify it as a harem and so most scenes placedthroughout the entire anime are easy to undermine and could, in most cases, be classified as cliche. While this may be true, the anime still presents to us an interesting story line filled with unexpected twists that would make you watch more, despite its overuse of ecchi scenes you would see in just about any harem anime. Adding to this fact, its pacing is slightly too fast, yet is a bit understandable at times.\\n\\n\r\nArt: 8\\n\r\nThe first thing you would think of when watching this anime is that ITS ART IS SO HIGH QUALITY. Actions done by the characters are done very fluidly with its backgrounds also drawn with the same amount of detail. Despite this said, there are not really any scenes where the art would take your breath away. They all seem to be there just because they need to be there and in that quality to match. Its purpose is to basically present its surroundings simply for you to forget about it a few seconds later. \\n\\n\r\nSound: 7\\n\r\nNot that much to say about sound. The OP and ED are catchy and the voices really match their characters. The stereotypical tsundere gets an abnormally high, yet cute voice and the somewhat arrogant princess gets a low proud voice that still never fails to actually say certain inappropriate lines that, in the end, may sound much more befitting to her character. That said, its sound affects are things that we've already heard before, nothing special, but still very appropriate to whatever is played out to us.\\n\\n\r\nCharacter: 5\\n\r\nWe have a tsundere dragon that has some kind of connection with the queen of Avalon, a stubborn princess that refuses to say what she really feels, and a dense male protagonist, who for some inexplicable reason, gets himself a special dragon that comes in a form of a human girl. If you ask me, thats just about all you need to make up a harem anime. Though we are given quite a bit of development behind them, the very fundamentals of each of their characters are still very much missing. I, personally, is very keen to know who exactly Ash's parents and how exactly did he meet the princess so easily. Moving away from that, some characters also just come and go very quickly. Most appear out of nowhere just to give some random fan service. With this, this part of the review gives a five to its characters.\\n\\n\r\nEnjoyment: 9\\n\r\nDespite all of these setbacks, the enjoyment factor of this anime is very high, though that may just be for me. Of course, people who don't like the harem and ecchi genres would think otherwise, but there is a reason to why this anime was categorised under these titles. Why would someone who can't take horror watch a horror anime? Even if one did, their review would be bias by saying 'its too scary' when that is the whole point of the anime. Getting back on topic, this anime is so far very enjoyable. Though the stereotypical harem jokes may seem like nothing, some are still nonetheless rather funny. Action scenes are also well capable of stealing your attention away and putting you back on its semi serious plot. \\n\\n\r\nOverall: 7\\n\r\nNot too high and not too low. This is an anime to be watched and forget about, though it does show some potential to move away from that. It is recommended that you watch it when you are bored and just want to kill time.",
            "date": "2014-06-07T20:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 146239,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3827391.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Anlanther",
                "username": "Anlanther"
            },
            "url": "https://myanimelist.net/reviews.php?id=146239"
        },
        {
            "content": "This is my first ever review so bear with me, this may look sloppy\r\nGenerally i liked this anime even though many didnt and i would say that much of it belongs to the ending that most people dont agree with, one of those people being myself. Though i am not saying that you wont.\r\nStory: 7\r\nThe story is pretty interesting though it has alot of Familiar of Zero feel to it, i liked the story as it was an interesting take on the situation\r\nSound: 4\r\nThe opening and ending music were very disappointing to me, i didnt enjoy either and i would mainly skip them which issomething i wouldnt normally do, i will say though during battles the music is grand and works well with the action\\n\\n\\n\r\nArt: 6\\n\\n\r\nDont have much to say about the art, though if i would put it somewhere i would put it here; i enjoyed the fan service as there is a good amount in this show though this may be a turn off for some of you guys out there\\n\\n\r\nCharacter: 8\\n\\n\r\nGood character development for most of the main characters though some of the more side characters are mainly forgotten about but i really like the bunch of main characters and they were enjoyable to me \\n\\n\r\nOverall: 7\\n\\n\r\nI liked this show as i thought it was cool with the dragon concept and the weapons that they could use were all really cool to me. The only parts i really disliked was the honestly the ending which i cant stand.\\n\\n\\n\r\nI would very much so want a second season to this as it would be a favorite show of mine if they were to tweak a few things in the story",
            "date": "2015-06-18T19:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 190583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4556259.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VexxumTrickz",
                "username": "VexxumTrickz"
            },
            "url": "https://myanimelist.net/reviews.php?id=190583"
        }
    ],
    [
        {
            "content": "Seikoku no Dragonar is an interesting anime, and probably one of the few I find quite enjoyable about dragons. As most people would suspect, the comedy ecchi harem action genre isn't exactly new, and this anime makes no exceptions in that. It doesn't deviate too much to typical cliche and it doesn't do anything super special either. The story is what you expect from this type of genre, and the character development is about average. I feel the story is probably where it falls a little short as it isn't spectacular or even anything that you would find surprising.\r\nIn saying that though I personally lovedthis anime, it was enjoyable as the main character actually attempted to fight, and the few female characters also added the needed substance for this anime. I found myself laughing a few times, and even caring about the characters which is a really good sign. The action unfortunately feels quite short, considering a 12 episode anime, its understandable but it loses its impact if the character either wins or loses within a few minutes. \\n\\n\r\nI thought the art was done nicely enough, and I was able to happily marathon the whole show in one sitting. In the end though this seems like the sort of anime which will appeal to a certain group of people but not all. While the fan service was quite comedic, certain choices such as tentacle monsters really detract from the overall story, at first it felt like a bad boss to fight, and the next second you are having a hard time taking it seriously since tentacles come out, and then you wonder whether the main character is even fighting it at all or if its just some sort of fan service monster. Ultimately that feels like the biggest fault for me, I would have a better feel of the characters if they fought monsters doing more then just adding fan service.\\n\\n\r\nStill though there was enough typical action, the male lead wasn't a complete wuss like some anime, and I felt like I enjoyed the ending.\\n\\n\r\nMy last thoughts are, if you are the type of person who enjoys action harems, can tolerate the fan service, and enjoyed anime such as machine doll and familiar of zero. You will likely enjoy this anime.\\n\\n\r\nIf you prefer anime with a more in depth plot, something you have to seriously think about or something that will be completely amazing, then this probably won't be the first choice on your list.",
            "date": "2014-07-19T04:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 152713,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2379187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/trustnoone",
                "username": "trustnoone"
            },
            "url": "https://myanimelist.net/reviews.php?id=152713"
        },
        {
            "content": "I won't be reviewing the story now, but rather critizing the anime itself, so try not to pay attention to the ratings as that wasn't anything I spent any time on.\r\nAt first when I spotted this anime and saw it's low score I was really hesitant to whether or not I should watch it, but I decided I'd give it a try as I'm desperate with finding new 'watchable' animes.\r\nThe anime started out decently and I was quite early ready to score it a \"9\" but which gradually dropped to \"8\" and now at the end of the story I'm at \"7\" asking myself ifI praise the anime too much.\\n\r\nYet you somehow continue to watch the anime hoping it will turn to the better.\\n\\n\r\nPeople talk about Fanservice, some people are for and some people are against it and personally I'm a fan of service. But the Fanservice in this anime was poor, not poor as in \"just from time to time\" but poor as in it was badly made. I wish for more kisses and romance when it comes to fanservice, this was pure tentacle fanservice that I found gross.\\n\\n\r\nBesides from 90% of the anime's main characters being female and the protagonist who at first sight seemed to be interesting is in truth nothing but a wimp uncapable of thinking for himself. A weak wimp that is that can only rely on the females around him, I also don't like how the story progresses\\n\r\n.\\n\r\nIt sort of feels like that the protagonist makes irrational decisions purely to favour the 'bad guys' in the anime so their plot can continue to then when he face them which he wouldn't even have needed to in the first place if he would just have considered his options, he can't do anything but rely on the females in the harem once again.\\n\\n\r\nThis are just my thoughts, thanks for reading.\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-06-25T08:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 148505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3754433.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Duuuuuuuuh",
                "username": "Duuuuuuuuh"
            },
            "url": "https://myanimelist.net/reviews.php?id=148505"
        },
        {
            "content": "In Lautreamont Knight Country which famous name is \"Dragon-Rearing Land\", well-known for largest dragon population, there is Ansullivan Dragonar Academy with purpose and its capability to train the Breeders (dragon master). The main hero, named Ash Blake, is one of the students there who unluckily haven't got any dragon to ride for himself. He is in a harem situation with few girls that take liking at him and get closer to him. It seems as the story goes, the school is in danger due to threats from others, and soon, the main hero who's currently a member of student council face the enemy as thefront-liner. Regardless of his no-dragon-to-ride, Ash Blake has his own gift, that is he is the one who can ride any dragon (when nobody could do that, a dragon just belongs to its owner).\\n\r\n    [somewhat SPOILER] Unpredictably, Ash Blake's dragon awakened and in a form as human. Ash gives his dragon a name, she is Eco. A pink-haired sharp mouth loli there to accompany Ash in his dragon world. As the story goes, Eco's true identity reveals, even Eco herself doesn't know about it. She is the Avalon's Holy Dragon, let's make it simple, it means that Eco's ancestor is from royal family of dragon itself. . .\\n\\n\r\n    The story isn't special at all, I can't say I was fascinated by its plot nor animation when the poster appeared. Both the story and the animation are decent, stuffs that you can get in almost every anime series like the battling scenes, average detail for visualization, and so-so characters. It's apologetical since the character development is not approaching the characters deeply. It does, but only to the extent its needed, the rest is how to tame the dragon nor fighting the enemies with their pets—dragon.\\n\r\n    Like when the first appearance of duo the-man-in-mask and his subordinate, mountain guerrilla terrorist known as Avdocha (She Who Condemns), who purposely visits the town to kill the strongest Dragonar or Princess Veronica during her observation in the town while the true purpose of Avdocha is actually... (well why don't you try to watch the show anyway? lol). The main hero and main heroine developments aren't too much, as long as the battle and new facts revealed they are there and connected, sadly wasn't the reason to be discussed.\\n\\n\r\n    The graphics itself wasn't give us any detailed view, like a rough peek and simple blended colouring. Mostly the show uses dense colours, it has its own disadvantages and advantages, like the clearer view but not too satisfying.\\n\\n\r\n    The music is good (unfortunately just good), OP theme is sung by Yui Sakakibara titled \"Seiken nante Iranai (聖剣なんていらない)\" and ED theme is \"MOST Ijou no \"MOSTEST\" (MOST以上の“MOSTEST”)\". For the ED theme, the song is the same but sung by various and different seiyuus for few episodes.\\n\\n\\n\r\n    My time is spoiled by this show, eventho' the whole show wasn't leave any remarkable impression. I gave 6 for the rate.\\n\r\nCons:\\n\r\nThe character development is not found\\n\r\nThe plot is not interesting enough\\n\r\nAverage animation, and not too satisfying colouring",
            "date": "2016-07-21T23:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 224635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224635"
        },
        {
            "content": "[Portuguese-BR]\r\nMeu estilo de anime favorito, onde o protagonista estuda em uma escola de magia ou quase isso com bastante lutas e cenas \"empolgantes\".\r\nO que eu mais gostei do anime foi sua história em si, pois eu achei muito parecido com alguns outros animes. Mas acho que deveria ter mais animes nesse estilo.\r\nAsh Blake, um menino que \"sacrificou\" sua vida para salvar uma menina e foi salvo pela mãe dos dragões (se não me engano, foi ela), que gostou da atitude do menino ao salvar a menina. A menina que foi salva mais é revelada mais para frente no anime, porém Ash não se lembra denada da queles dias pelo visto. \\n\r\nE agora ele vive na Academia Ansarivan Dragonar, que todos os estudantes são mestres de dragões, e Ash Blake ainda não conseguiu despertar seu dragão. O então chamado \"garoto problema\" pois se envolve em muitos problemas quando falam de seu \"parr\" que é o nome dado ao dragão. Ash tem um talento, que é montar em qualquer dragão, até dragões divinos. Outras pessoas ao tentarem montar em outros dragões que não são seus, podem acabar feridos, pois o dragão não deixa.\\n\r\nQuando Ash \"desperta\" o seu dragão, ele vêm com outra forma, sim a forma de um Humano. Sortudo, seu dragão vem em forma humana uma bela jovem com cabelos cor de rosa e Lolicon.\\n\\n\r\nO legal do anime é que tem muitas cenas ecchi, em alguns casos parecendo até um verdadeiro Hentai, com muitos tentaculos. \\n\\n\r\nAo meu ver o anime poderia ter uma segunda temporada tranquilo pois deixou muitas coisas em aberto. Pena não ser tão simples assim\\n\\n\r\nObservando minhas preferencias ao assistir um anime, eu não deveria gostar desse anime por ter muito clichê, como a personalidade do protagonista, e as antagonistas.\\n\r\nMas a história ficou muito boa e me atraiu muito. \\n\r\nRecomendo muito, assistam!\\n\\n\r\n[English-EUA] \\n\r\nMy favorite anime style, where the protagonist studies in a school of magic or almost this with enough fights and scenes \"exciting\".\\n\r\nWhat I liked the most about anime was its history itself, because I found it very similar to some other anime. But I think I should have more animes in that style.\\n\\n\r\nAsh Blake, a boy who \"sacrificed\" his life to save a girl and was saved by the mother of the dragons (if I'm not mistaken, it was her), who liked the boy's attitude in saving the girl. The girl who was saved more is revealed later in the anime, however Ash does not remember anything of those days apparently.\\n\r\nAnd now he lives at Ansarivan Dragonar Academy, that all students are masters of dragons, and Ash Blake still can not wake his dragon. The so-called \"problem boy\" because he gets involved in many problems when they talk about his \"parr\" which is the name given to the dragon. Ash has a talent, which is riding on any dragon, up to divine dragons. Other people in trying to ride on other dragons that are not theirs may end up injured, as the dragon will not let it.\\n\r\nWhen Ash \"awakens\" his dragon, he comes in another form, rather the form of a Human. Lucky, his dragon comes in human form a beautiful young woman with pink hair and Lolicon.\\n\\n\r\nThe cool thing about the anime is that it has a lot of ecchi scenes, in some cases looking like a real Hentai with lots of tentacles.\\n\\n\r\nIn my view the anime could have a quiet second season because it left many things open. Too bad it's not as simple as that.\\n\\n\r\nObserving my preferences when watching an anime, I should not like this anime because it has a lot of cliché, like the personality of the protagonist, and the antagonists.\\n\r\nBut the story was very good and attracted me a lot.\\n\r\nHighly recommend, watch!\\n",
            "date": "2017-12-09T19:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 264878,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6735960.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Neurose",
                "username": "Neurose"
            },
            "url": "https://myanimelist.net/reviews.php?id=264878"
        },
        {
            "content": "Such potential, but it all fell rather flat.  Who doesn't like dragons?  Who wouldn't love a dragon to call their own?  As a male, who wouldn't give their left arm to be bonded to a dragon who was a cute girl especially when you had a pretty good idea how she would grow up?  I was surprised this was a ecchi/pseudo-harem, but then I seem to be drawn to them.  Meh, it's a living.  Everything but one major plot point was resolved by the last episode, but it seemed like they rushed to just throw in the resolution.That was rather disappointing.  That being said; by the numbers.\\n\\n\r\nStory:  The first episode made me want to watch, and I was willing to forgive the rather  elementary school presentation in the hopes that it would pick up the gauntlet that it threw down with the premise, and kick some butt.  That didn't happen, but I'm a fan of the service, and there was plenty of that.  I was surprised by just how ecchi this was, and if there had been a few more pixels revealed it could have been hentai easily.  Maybe that would have made the story-lite presentation better, but I was left wanting more in the way of development.  6\\n\\n\r\nArt:  It's anime, so I'm a fan of the art, and the vistas were beautiful, the cities fantastic and detailed, as were the outfits, and the girls were sexy.  Somebody does need to get the potential warrior males in anime to grab a protein shake, and hit the gym once in a while though.  Honestly, The ladies are drawn so I can see each muscle group, and the pleasant hint and jiggle of avoirdupois in all the right places, but I can count the number of male biceps I've seen in almost all anime on one hand.  Of course, I'm not counting the super saiyans and monster men out there; just the average warriors in training.  Help me artiste; you're our only hope.  8\\n\\n\r\nSound:  I usually like the OP and ED songs in anime, and have downloaded many that I listen to while driving, but these two were pretty forgettable if not nearly unlistenable.  I love bubblegum pop, but these songs even embarrassed me.  As for the ambience music throughout; there was nothing remarkable, or notable.  4\\n\\n\r\nCharacter:  Yes.  Next!  Okay, to elucidate; the characters had just enough to prove they were indeed written as human beings except for the dragons; they were written as dragons.  At least the dragons had some depth of character.  The humans could've been replaced by poster boards with smiley faces on them.  In my never to be humble opinion, this is where the genre falls flattest.  You can't make a real character truly \"real\" to the viewer with 23 minutes times 12 episodes even if there were an OVA, or at least it appears fairly rare.  4\\n\\n\r\nEnjoyment:  I wanted to, and tried to enjoy this.  If it was just for the fan service, I would give this  a 9 or 10.   All I could say was \"what potential\".  Too formulaic.  I would've dropped this, but I loved Eco (the MC's dragon).  Cute as a button, and feisty as a fighter pilot just before lighting the afterburner.  Just the way I like my tsunderes.  She reminds me of my daughter who I love dearly.  Not that way; you perv!  Which both Eco and my daughter are fond of saying.  I'm also a sucker for a poorly written love story.  5\\n\\n\r\nOverall:  I could have lowered each rating by one or two points, but there was just so much potential for a good series that I didn't have the heart, and the hope of it improving kept me clicking to the next episode.  Pretty much a solid C in execution.  6",
            "date": "2017-12-09T00:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 264826,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6732575.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Teleg",
                "username": "Teleg"
            },
            "url": "https://myanimelist.net/reviews.php?id=264826"
        },
        {
            "content": "at first i was like the story is good but as the show goes on it makes you wonder. it is a good story for the most part the ending i would have to say is by far not good. the amount of emotion struggle some of the relationships contain is just downright pathetic its  has a harem like structure to it. big boobs everywhere and every ep the sexual references but besides that overall enjoyness would be like a 7.4 its good but it has the potential to be so much more. while your watching it does not leave anything really as amystery you can clearly tell whats going on whos who and whats about to happen i still enjoyed the watch though and hope that the next season they will out due themselves",
            "date": "2016-07-17T23:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 224307,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4613473.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/iScreamDragon",
                "username": "iScreamDragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=224307"
        },
        {
            "content": "I'm a fan of harem, horror, ecchi and more adult oriented Anime. Blood, gore. Occasionally I'll watch some cutsie stuff to break things up. Heck, I photograph cosplay for a couple of Anime cons, so I'll watch some Anime just to become familiar with the characters.\r\nThis anime, while mildly entertaining, left a lot to be desired. All the anime budget was blown on overly-bounce-able boobs and bizarre Hentai tentacle inspired scenes that were 100% out of place here. When there were battle scenes or gigantic dragons, it looked like someone drew a single cell then moved it around the screen.\r\nI really am getting tired ofthese cookie cutter characters. Every Anime now seems to have a generic German chick, Russian babe, English Aristocrat and so on. Variations of that are here. Of course there's the ditz that has to run around in her bra and panties for no discernible reason except to make the generic clueless boy hero uncomfortable.  Don't get me wrong - humorous sexual tension can be laugh-out-loud funny (I loved Shimonetta) - here they were just idiotic.\\n\\n\r\nYea, I watched all 12 episodes.  A had already finished up Gangsta, Gate, God Eater, Prison School, Assassination Classroom and many others and needed something to satisfy my Anime craving.  It was good enough for that. Unlike Elfen Lied or Deadman Wonderland, I'd never watch this series again.",
            "date": "2015-10-12T15:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 201119,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4902734.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rickcir",
                "username": "Rickcir"
            },
            "url": "https://myanimelist.net/reviews.php?id=201119"
        },
        {
            "content": "So ill first say that this anime is WAY better than having a 6.75 rating i think people say it has all the cliche that a anime would have honestly it does but for me it was good and some people need too learn from that cliche of anime sometimes also ill say if you dont like tentacle parts or boobs just shoved in your faces than yeah dont watch\r\nStory: so the story pretty much starts with ash blake who is a future dragon master but the reasons have show en that he isn't up too that par yet because he hasn't even showing upyet after all that time well that's until now (at the end of episode 1 so sorry for that little spoiler) the dragon ends up being a girl but she isnt her true from cause over time she will be but wont spoil anything else\\n\\n\r\nArt: art was very good some people knack on this for the art  when the hell did art matter too people  \\n\\n\r\nSound: now the OP and the ED were ok nothing id download cause they were meh too me everything else was good\\n\\n\r\nCharacters: now with this at first i never really cared for Eco and Silvia but as the anime went on i liked them otherwise i liked all the characters nothing wrong with them at all\\n\\n\r\nEnjoyment: so yes i did enjoy this anime it did seem more of a slice of life than a real action anime but i liked this anime form the comedy too the action them both were very good\\n\\n\r\nOverall: im giving this a 8 yes it was that good the comedy was very good and the action of what there was of it was actually pretty good again people knack on this anime for DUMB reasons dont let the 6.75 rating fool you this anime was good and id so recommend this anime \\n\\n",
            "date": "2016-10-02T22:57:00+00:00",
            "helpful_count": 0,
            "mal_id": 230968,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=230968"
        }
    ]
]