[
    [
        {
            "content": "For all who only watched the first season of the anime, and are understanding hints pretty fast DO NOT WATCH THE SPIN-OFF FOR NOW because you may get spoiled (like me) \r\nAside from that the anime is pretty good and is adorable, and is showing multiple sides of the Shingeki no kyojin cast.\r\nIt's also showing how characters would interact if they were in our same time-line, at school! But it might get not interesting\r\nThe art is pretty good and is super-cute, and I liked the opening so much!\r\nIf you are interested in spin-off, cute and reference based anime you might like this!",
            "date": "2015-11-28T12:50:00+00:00",
            "helpful_count": 155,
            "mal_id": 204365,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4785126.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TsuAsakO",
                "username": "TsuAsakO"
            },
            "url": "https://myanimelist.net/reviews.php?id=204365"
        },
        {
            "content": "First things first, you HAVE to watch the first season of Attack on Titan before watching this. If not, you'll get spoiled a fair bit and not get the full potential out of this fantastic parody.\r\nIn short, Shingeki! Kyojin Chuugakkou is a fantastic parody. It absolutely nails the scenes from the original series. The impact, intensity and music are close to perfect in each and every scene that the show is \"making fun\" of.\r\nStory: 6/10\r\nThe story (VERY loosely) follows the original Attack on Titan story line. The same music and phrases are used for each scene in the parody, as it was used in theoriginal series. It has TONS of references, like when *you know who* is eaten and *you know him* screams/cries teary eyed with his arm extended.\\n\\n\r\nArt: 8/10\\n\\n\r\nThe art uses a light color palette to bring the chibi characters to life (I couldn't word that better, sorry...)\\n\r\nThere's a bit of recycled animation from the first season, like when titans are running, or when the big ol' colossal titan is peeking over the wall.\\n\r\nBut here's a twist!\\n\\n\r\nSometimes, (when something scary/shocking happens) the art turns into some of the manga drawings from the original manga. I was pleasantly surprised when it first happened, but it doesn't happen a lot during the anime, sadly.\\n\\n\r\nSound: 9/10\\n\\n\r\nIf you're a big fan of the Attack on Titan soundtrack, then rejoice! They use nearly all of the songs from AoT in this parody. It's incredible how well they manage to weave the soundtrack into every scene, without it feeling out of place or stitched on.\\n\\n\r\nMy only gripe about the sound, is that they didn't introduce any new songs in the show.\\n\\n\r\nCharacters: 7/10\\n\\n\r\nTake the strongest traits of each character (Eren -> Kill all titans! Mikasa -> Protect Eren! Levi -> Cleaning.) and exaggerate the living shit out of it.\\n\\n\r\nI don't mean this in a bad way. It goes really well with the tone of the show, but if you're a newcomer to the Attack on Titan universe and start with this series... Oh boy.\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nI absolutely fucking loved it!\\n\\n\r\nHoly shit I've never been this pumped when watching a \"comedy\" show.\\n\r\nThe music, the fucking references man! Everything goes so fucking well together!\\n\\n\r\nWhen i heard about Shingeki! Kyojin Chuugakkou i thought, \"Great... Just HOW much are they going to milk the franchise?\" Then i watched the first episode and found out that i hadn't laughed that much in ages. It's a really good time.\\n\\n\r\nOverall 8/10\\n\\n\r\nShingeki! Kyojin Chuugakkou is a great supplementary show to watch while waiting for Attack on Titan season 2.\\n\\n\r\nJust make sure that you already have watched the first season.",
            "date": "2015-12-19T13:24:00+00:00",
            "helpful_count": 92,
            "mal_id": 206020,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3317453.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Millawls",
                "username": "Millawls"
            },
            "url": "https://myanimelist.net/reviews.php?id=206020"
        },
        {
            "content": "Do you ever feel like milking the shit out of something that's popular? No? Then you wouldn't relate to this crap. Attack on Chibi is a spin-off parody anime to one of the most popular shows ever made. It's done by a different studio, focusing more on comedy and having this chibi artform instead of the dark and greedy look that the original show has. \r\nThe show fails at everything. You would expect that a parody of Attack on Titan would succeeed at poking fun at it, while having some clever stuff thrown in. Instead, we have this show pandering towards fans for the sakesof getting another dollar. A lot of the characters felt like they were pulled out from fanfictions and Tumblr. One of the most popular characters in AoT is Levi, who is now known in the fandom as that guy that has a thing for cleaning, though this was barely present in the original show. In Attack on Chibi, they decide that it would be a good idea if they drag that cleaning joke for Tumblr users to fangasm. \\n\\n\r\nDoes it work? \\n\\n\r\nI don't see too many people really talking about this. \\n\r\nThe only reason this cashgrab exists is to remind you that AoT is still a thing and that the second season will be out in 2016, but there was no point in making this. \\n\\n\r\nEvery character is an exaggerated version of their fanfictions, the comedy is slaptstick nonsense and everything else is not note worthy. But I will give them credit for one thing. At times, they play serious music in the background while parodying a scene from the show, and I'm not sure how, but it works pretty well. Unfortunetely, this is barely present in the show, and is only used in episode 1 and episode 12, which are the best episodes. \\n\\n\r\nThe rest? It's hard to watch. It really is. Not only that, but the episodes are only 17 minutes for some reason, and it doesn't help that each episode feels longer than the average 22 minutes, too. \\n\\n\r\nThis show is like anime, a mistake. 3/10",
            "date": "2015-12-20T07:39:00+00:00",
            "helpful_count": 49,
            "mal_id": 206113,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4495158.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/jumpy",
                "username": "jumpy"
            },
            "url": "https://myanimelist.net/reviews.php?id=206113"
        },
        {
            "content": "Alright then Attack on Titan: Junior High has ended, so I took it upon myself to review it. In short, it was hilarious. Let's get into this:\r\nStory\r\nWith this type of show there's nothing much to say in terms of story. The entire show is just a parody of Attack on Titan, it makes fun of the series and references the show in all sorts of ways, in a funny way too. It also makes a lot of references to the manga for manga readers, such as myself and they really were like icing on a cake and made it heck of a lot more enjoyablethan one would suspect.\\n\\n\r\nArt & Sound\\n\r\nThe art was really good, okay it was low-key compared to the original but it was still good, it was a stylized in the cartoonish way to show that it isn't the show, it's just lighthearted fun not meant to be taken serious.\\n\\n\r\nThe show has the original music that was used in Attack on Titan, it also adds it's own music. The opening is a parody of the first opening and the ending song being, well, not a parody but each are not something I would listen to on their own. To be completely honest the music for this show is lazy, can't fault them since it's a parody show.\\n\\n\r\nCharacter\\n\r\nI'd like to say that the characters in this are better than the original. The show takes the original cast and makes them more sillier. With Eren they made him an idiot who wants to destroy the titans who doesn't give up, making him a bonehead if you will. Armin is the wimpy smart character, they add on him by making him do things that he wouldn't do such as being in a blanket, kind of like being conservative to himself, same with the others. Mikasa is still emotionless, nah just kidding she actually has emotions! Can you believe it?\\n\\n\r\nFrom the original characters they are well bland in a sense, in this they are more \"colorful\" and express more emotions and actually make a lot more sense, with the context of the show, of the character troupes that the show presents them as, with their character troupes it makes them shine more and makes them more memorable and fun.\\n\\n\r\nEnjoyment\\n\r\nThis was very funny, I was laughing all the time. This is the type of show that derives on just pure enjoyment, a show to just have fun, turn off your brain and watch. Yeah there are those people that say \"just give us season 2 not this crap, blah blah blah\" and I say just learn to have fun with a show once in awhile, you'll see that it's actually quite enjoyable.\\n\\n\r\nOverall\\n\r\nSome people may find it annoying and pointless, I understand, I, on the other hand, didn't find it annoying I just found it to be fun, dumb ole fun of the original. So overall I'll give Attack on Titan: Junior High a 6/10, I'd recommend it to anyone who likes Attack on Titan and wants to have some fun with it.",
            "date": "2015-12-19T11:41:00+00:00",
            "helpful_count": 24,
            "mal_id": 206000,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4704461.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LangbaltXCI",
                "username": "LangbaltXCI"
            },
            "url": "https://myanimelist.net/reviews.php?id=206000"
        },
        {
            "content": "Spin-offs are often a way to pander to fans and give them something similar to what they were looking for, but not really.  Often times, these spin-offs come in the form of OVA's, extra episodes that usually don't pertain to the original plot and go off on their own little sidestories.  Other times, we have completely different stories that are usually for comedic reasons and pander to fans of this series.  This...is the latter.  \r\nStory: Attack! Titan Junior High, as it's known in English travels into a different world of the SNK world where all of our 'lovable' characters go tojunior high school (or middle school) at Titan Junior high where they experience the best school life possible, filled with fun, excitement, and the signature rampaging monsters known as titans.  What fun!\\n\\n\r\nThe main thing here to realize is that the SNK that a lot of people know and love has been turned into a school comedy.  All of the events that have happened in the series both in the anime and the manga have not transpired, and everyone is alive.  Note, EVERYONE is alive.  So, what does this say about this show?  Well, not much really.\\n\\n\r\nTo be honest, there's nothing really interesting about the story of Attack Junior High.  Every episode, our merry band of lovable titan killers go about their daily school lives, doing what apparently every middle/high school in Japan does according to anime such as: school festivals, club activities, getting love letters, and sacrificing your lunch to the oppressive titan species that for some reason has a school right next to you.  And honestly, that's all the show has to offer.  In every episode, we follow Eren, or some other member of the main SNK cast on a mini adventure that usually has some kind of throwback to the original series be it a reference to an iconic scene, or hidden little references that every SNK that sees it will go, \"Oh!  It's that!  Nice!\" or something of that sort.  \\n\\n\r\nIn the end, Attack! Titan Junior High is a bland piece of cheap entertainment that only really services hardcore fans of the SNK series.  Its entire potential was wasted at the start since it tried to take a series and turn it into something it both wasn't and could never be.  \\n\\n\r\nOverview:\\n\r\n-  Bland, marketed spin-off\\n\r\n-  Seriously though, there is nothing worth about this series.\\n\\n\r\nCharacters: Similar to their original counterparts, the cast of this show is essentially a devolved version of the entire SNK cast, with each character retaining only one of their 'vast' amount of traits.  Eren is the same genocidal maniac who wants to kill all titans, Mikasa is her same \"only sustained by Eren\", Jean wants to be popular with the ladies, Sasha wants food, Conny could give less of a crap about anything, etc.  \\n\\n\r\nThe most noticeable difference I can see in terms of cast is the fact that Armin for some reason is a temperature freak who for the life of him cannot take cold, even if it's 70 degrees Fahrenheit outside, and requires a futon on or around him at all times, which really makes him look and seem more ridiculous than he already was.  (And that's saying something.)  \\n\\n\r\nAnd as I mentioned before, every character, and I mean every character of the SNK series appears in this spin-off, including Levi's dead patrol, Sawny and Bean, and the other nobodies who died during the first arc of the series. \\n\\n\r\nIn the end though, there still really isn't much to say.  These characters already weren't really that good as proper characters in the original series and seeing them again, especially in a format that really doesn't try and make them seem likable, doesn't really help this show in a positive light.\\n\\n\r\nOverview:\\n\r\n+ Everyone comes back\\n\r\n-  Everyone is one-note and/or boring.  (We get it, Eren.  You want to kill all the titans.  Shout something else for once, will ya?!)\\n\\n\r\nArt: Now, the art.  The art is one of the more peculiar things about this spin-off.  Wit Studio made the original SNK with a very definied artstyle with everything looking somewhat melancholy with these thick black lines to define character outline, folds in the face, etc.  But for this spin-off, we have Production I.G. taking the reins in development and you know...there's just something...off, about this.\\n\\n\r\nAttack! Titan Junior High uses a chibi or moe style of animation that isn't really all that unique in any way.  Nothing about the show really stands out except for the way the characters were made.  To put it in simple terms, the characters look both great, and terrifying in Chibi form.  Now, why do I say they look great and terrifying?  Well, it's because the chibi format really doesn't work for everyone.  \\n\\n\r\nThere are certain characters in the SNK universe that have an inherently defined look to them like Erwin, Jean, and Keith.  And as such, when being transferred, look really, REALLY weird in this format to the point that they look laughable or out of place.  (Seriously, who thought that was a good idea?)  They look so off with the chibi proportions that are displayed that it's just jarring to look at.  Other characters like our three main characters, Christa, Sasha, and even Conny look fine, but it's just hard not to remember how creepy it looks to see Jean's unmodified face stuck onto a Chibi body.  (Now THAT'S true nightmare fuel)\\n\\n\r\nOverview\\n\r\n+/- Average and generally normal quality\\n\r\n-  Some of the characters look off; VERY off.  \\n\\n\r\nSound:  The soundtrack for Attack! Titan Junior High is basically what you heard in the original SNK with only a few minor differences.  Every so often in the show, they will play one or two sound bites that will sound familiar if you've seen the original series, but that's about it for relation to the original.  \\n\\n\r\nWhat makes this series different than its predecessor is its opening.  Essentially, it's a rehash of the first opening of SNK with a more 'school-related' sound to it with ringing bells and sounding more upbeat than its original melancholy self.  The ending is rather generic, so it really doesn't deserve much special mention either.\\n\\n\r\nOverview:\\n\r\n+  Throwbacks to the original\\n\r\n-   Any music made specifically for this is meh at best.\\n\\n\r\nPersonal Enjoyment: First of all, I didn't really like the original SNK.  And it's not because I'm inherently someone who just doesn't like THE popular thing, but rather because it was a show that had promising potential, but just had a lot of flaws that hampered the quality of the show.  (Plus fandom.  I hate fandom.)  So, after finishing this what are my thoughts?\\n\\n\r\nDid I like this show?\\n\\n\r\nOk, for the first episode, sure.  It's the kind of one-off experience thing where you're like, \"Wow, this is a thing.  That's a little funny.\"  because it's a parody of a series that's just so bad, it's funny.  But, with every new episode, the show got tired fast and there really wasn't anything to enjoy watching.  At least it's only like 15 minutes an episode, so you don't have to suffer a full-length episode worth of soulless material.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nMost of all, it's just how bland and tasteless this felt.  It's a spin-off that only really served to market SNK even more as a series, pandering to the fandom and following it has, thus creating a series that even as a comedy, failed to fulfill.  There just didn't seem like there was much effort put into it, like I.G. thought, \"We can make this as crap as we want; people'll still watch it.\"  Which...kinda came true in the end.\\n\\n\r\nWould I recommend this show?\\n\\n\r\nIf you love SNK.  And I mean LOVE SNK, then this is a show you should probably watch, since its got all of the SNK wrapped up in a different setting package.  But if you're not one of those die-hard fans, just don't even consider this; you're only wasting your time with this series if you decide to watch it.",
            "date": "2015-12-19T15:36:00+00:00",
            "helpful_count": 14,
            "mal_id": 206041,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=206041"
        },
        {
            "content": "This series relies entirely on the viewer's having-seen and having-loved Shingeki no Kyojin. If you have not seen or did not enjoy the world of Attack on Titan, don't watch this. Straight up don't do it. You will be on the outside of an inside joke. Knowledge of the original series is absolutely critical to getting anything out of this spin-off. It is a parody that relies heavily on the parallels it draws between the original characters and events and the irony of twisting the setting in which those events take place. If you haven't seen the original version, this is going to come offlike an episode of Dora the Explorer or some shit, and it's also going to spoil the events of the original series, so just don't do it. Don't.\\n\\n\r\nOkay, so everyone left reading has seen the original at this point, right? Excellent. Here we go.\\n\\n\r\nI expected to think that this series was stupid. I literally only watched it out of morbid curiosity, the ease of time commitment (episodes are roughly 15 minutes long), and the fact that I really missed the original cast of characters while waiting on Shingeki no Kyojin's third season. I was pleasantly surprised to discover a well-crafted parody that is at once naively childish AND smart.\\n\\n\r\nIf you've never seen the original, this series is going to consist of a bunch of hammy characters trying to naively solve silly, inconsequential problems in the wholesomest of ways. It's very hard-work-and-friendship-conquer-all. It's cutesy. It's corny. It feels like an episode of My Little Pony. However, that's kind of where its brilliance lies. What the series is actually doing is wryly mocking the very R-rated, tragic, and horrifying events of the original story. With that in mind, Chuugakkou is quite sick, twisted, and wryly hilarious.\\n\\n\r\nThe characters are overblown, exaggerated versions of themselves, each one successfully lampshading their defining traits. It helps the comedy that the same cast of actors returned to voice them and treated them with the same emotional depth and gravitas as the original series, expounding the dramatic irony. What references are made to the events of Shingeki no Kyojin are both unexpected and hilariously underplayed, leading to genuine laugh-out-loud moments in each episode. The plot of each episode is more or less irrelevant nonsense--it's merely a vehicle for character-driven and context-based mockery. Frankly, the inclusion of a real plot with actual emotional stakes would likely undermine the humour of the series. It's necessary only as a backdrop for a bunch of darkly funny silliness.\\n\\n\r\nShingeki! Kyojin Chuugakkou is a splendid supplement for Attack on Titan fans twiddling their thumbs between seasons. It gives you a light-hearted dose of your favourite cast of characters and successfully lampoons the horrors-of-war storyline in a way that would frankly be insulting if it weren't written, produced, and performed by all of the people involved in the original project. Chuugakkou is a wink and a playful nudge from the writers to the fans and will tide you over until the bloodbath returns in 2018.\\n\\n",
            "date": "2017-10-04T15:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 259711,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6552770.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/paedanticbasterd",
                "username": "paedanticbasterd"
            },
            "url": "https://myanimelist.net/reviews.php?id=259711"
        },
        {
            "content": "There they go again with their hilariously crazy meming nature, man I just love this show, so sad it had to end this soon. I just have so much to say about this show as a whole, I figured out I might as well make a full-fledged review and call it a day.\r\nImaging going through every big moment in the Attack on Titan franchise, bit by bit, and turning the saddest and serious plot points into the most hilarious in context jokes, put it simply, this is just a huge meme of a show.\r\n- Story (7/10):\r\nAs the story starts, this is an alternative timeline, whereall the events of the story take a more comedy-oriented approach, no over gory deaths, and none of that, just pure Attack on Titan memes.\\n\r\nAll your typical familiar faces from the original shaw and OVAs make a comeback, It's about school struggles, and activities along the way, very basic story progression that focuses more on telling jokes than development.\\n\\n\r\n- Art (8/10):\\n\r\nVery basic chibi art, but in a super cute way, (but not as cute as Attack on Titan drama pictures), the animation is very subtle;, really nothing remarkable to mention here, other than the phenomenal camera movements on some parts, and the great use of CG and particle effects.\\n\\n\r\n- Sound (8.5/10):\\n\r\nI can't get enough of the original opening's ripoff, and the same can be said about the ending song too. the soundtrack is just as strong, and the voice acting is on point, man, I just love Sasha's voice act, among all of the characters, she has the perfect one for a chibi makeover.\\n\\n\r\n- Character (8/10):\\n\r\nMy, very hilarious  recreations, what I really adore about this cast, is the comeback of characters from the OVAs, like for instance, Ilse, Isabel, and Farlan, not only the human characters are amazing, but also the Titans as a counterparts, yes, there is a supposed -best-titan in this show, and they bring a lot of joy to see in a more goofy way.\\n\\n\r\n- Enjoyment (9/10):\\n\r\nThe humor is what makes this show stand out, it's just pure (sometimes hysterical) laughter one after the other. the humor is very easy to catch on with, as far as I know, every typical Attack on Titan fan would get a grasp on it, it really enjoyment comes from real event recreations, the ripoffs and references are killing it.\\n\\n\r\n- Overall (8.1/10):\\n\r\nAs much as I love this show, and willing to recommend it to basically everyone, there is a very specific audience that this show is aimed at, as a big Attack on Titan fan, having watched the two original seasons and OVAs for no less than 3 times, I found some jokes to be very hard to catch upon unless you know the references very well, only then, the humour flash would trigger you up.",
            "date": "2018-04-13T04:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 277938,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5898843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Eoussama",
                "username": "Eoussama"
            },
            "url": "https://myanimelist.net/reviews.php?id=277938"
        },
        {
            "content": "I have no prior experience watching Attack on Titan save five minutes of an episode on Toonami, but after this parody, I'm sold to watch the original series.\r\nI've seen this series get a lot of flock from some folks online because it's a \"cash grab\", but unlike other works of the same nature, this one still retains the heart of the original and reinterprets it to create a fun and refreshing new story without the urgency and peril of the Attack on Titan most people are familiar with.\r\nAttack on Titan: Junior High's story follows Eren Jaeger and his friends as they begin their first yearof middle school. On the first day of school, a titan steals Eren's lunch; a cheeseburger, and this becomes Eren's plight and motivation for the rest of the 12 episode series. The titans don't play a huge role in every episode and the ones they do, they're never threatening to the point of fatality. Characters are frequently stepped on and thrown resembling comic relief you'd find in a rom-com, and when the mood gets serious, it's hardly ten seconds before somebody gets interrupted by some ridiculous incident. \\n\\n\r\nIt's hard to focus on the story because for much of the series, it's apparently absent right up until the very end when something relating to Eren's first incident occurs again on a bigger scale and reminds you what he was fighting for.\\n\\n\r\nEren's noble quest to protect everyone's lunch from the titans seems silly in the grand scheme of other issues titan's cause, but in the context of this fun parody, it's motivation enough to stir some powerful and unsettling reactions in Eren. \\n\\n\r\nHis character is exaggerated and he's usually the loudest in any scene whether the situation warrants it or not, but he's still someone who inspires those around him. When it's time for someone to step up to the plate and fight, Eren's the first one to do it.\\n\\n\r\nIt's interesting to watch the dynamic between Eren and the rest of the first years because even though he's virtually the same in every episode, the interactions each character has with him is always unique and something to look forward to. The relationship between Eren, Armin, and Mikasa notably becomes the strongest towards the end and their companionship in this parody hints at something stronger and unbreakable in the original.\\n\\n\r\nEven for someone who has not sat through Season One, and now, Season Two of Attack on Titan, by paying enough attention and connecting a few dots, it's not hard to guess what might happen to these characters in the original. \\n\\n\r\nOverall, even though it's a parody, the characters still retain the soul of who they're supposed to be and make each episode humorous by playing off their flaws and warping them to extreme degrees.\\n\\n\r\nIn regards to the art, the original style returns, only shrunken, to create chibi variations of otherwise intimidating cast members such as the titans, Levi, the teachers, and some of the second year students. The style works fine to communicate the nature of the series and you know what you're getting into just looking at the cover. No complaints on that front, but the backgrounds are forgettable if you start to remember they exist.\\n\\n\r\nThe sound quality is great. The opening theme is a reinterpretation of Attack on Titan's original and unforgettable first theme song, \"Guren no Yamiya\", and the ending theme, \"Hangeki no Daichi\", is a lively J-Rock song sung by the Japanese voices of Eren (Yuki Kaji), Mikasa (Yui Ishikawa), and Jean (Kishō Taniyama). The background OST adjusts for each mood like it should and when the situation is romantic or tinged with danger, the soundtrack does not disappoint and provides some stirring tracks.\\n\\n\r\nI could go on and on about everything well this series does, but for a person who sat through the original Attack on Titan and cried and struggled with those characters, I can understand their irritation. I imagine their feeling is the same as a person who grew up watching Teen Titans and waited years for its return only to get Teen Titans Go on Cartoon Network. But set all that aside and take this show for what it is: a joke. It's taking everything that scared you, Eren, and the rest of the first years in the original and putting a baby face on it so it's not anywhere near as intimidating as before. And maybe that's not for you. Maybe that's not what you look for when you watch anime. That's fine. But this anime, even if it's a parody, has a lot to offer. It still bears a lot of the same emotion I imagine was present in the original and reconstructs it to fit inside a fun and cute story about a man and his burger.\\n\\n\r\nIf you like Attack on Titan and you've already seen everything else; while you're waiting for that third season, you may as well sit down and at least tolerate this 12 episode series. Nothing ventured, nothing gained. And if you don't like it, there's still casuals like me who have money at the ready to pay for more cash grabs like this and the toys that come with it.\\n\\n\r\nSo you may as well come along for the ride.\\n\\n\\n",
            "date": "2017-08-03T13:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 254603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5252901.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_Poochyena_",
                "username": "_Poochyena_"
            },
            "url": "https://myanimelist.net/reviews.php?id=254603"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI want to save my nostalgic anecdote related to Attack on Titan for when the second season eventually rolls around. (It recently got pushed back to 2017, so we have a bit of time before I share the tale.)\r\nIn the meantime, I will say that, based on the contents of Shingeki! Kyojin Chuugakkou, I would not consider myself a clean-freak. I like doing the dishes, taking out the garbage, and making sure my abode is relatively clean, but I have no qualms with keeping my room messy.\r\nIf I had the three-dimensional maneuver gear that Mikasa,Eren, and the rest of the gang use to clean the massive walls at their junior high, however, I am positive that I would do a lot more cleaning than I already do. Until I get that gear, I can bide my time with Chuugakkou, a more-than-solid anime based on its more-than-popular relative.\\n\\n\r\nSTORY\\n\\n\r\nChuugakkou stems from the famous Attack on Titan series. But this anime is no sequel, and it is technically no spin-off. Instead, Chuugakkou is a parody of Titan proportions.\\n\\n\r\nThe premise loosely relates to the main series: Humans live among the Titans. But rather than practicing fighting mechanics and protecting their loved ones, they practice mathematics and protect their lunchboxes. The Titans disrupt their daily lives on occasion, but they are never a pressing issue – at least, to the extent that they are in the main series.\\n\\n\r\nFor example, one episode has a female Titan falling in love with Jean. Another episode has a bunch of the Titans stealing the students’ cheeseburger stand. In reality, these two instances (and discounting Hange’s strange obsession with tickling Titans) showcase the Titans the most. Arguably, foregoing the Titans in favor of focusing on the classroom activities, the test of courage, and the student council presidential election may be a mistake. After all, the anime is poised as a parody of the main series. Meaning, no Titans equals no parody.\\n\\n\r\nThankfully, Chuugakkou realizes the lack of Titans and pursues parodying the other parts of the main series. And it does so expertly. Many of the scenes mirror those in the main series – right down to the dialogue used. A nice example is in episode seven. Their year’s class is getting crushed in the sport’s day games. Mikasa, wanting to rally everyone, gives a goading speech, declaring how strong she is and how weak they are. Her speech matches the one she gives following a devastating event in the main series. Even Jean’s response – that Mikasa’s oratory skills need work – is the same.\\n\\n\r\nThe anime does this scene-for-scene parody a lot.\\n\\n\r\nEpisode twelve contains some advice from Levi to Eren about making decisions and relying either on oneself or one’s comrades (with accompanying desperation look from Petra).\\n\\n\r\nEpisode ten has Marco giving an encouraging speech for Jean, a (similar) speech that he also gives in the main series following Armin’s risky plan.\\n\\n\r\nEpisode eight has Erwin Smith standing behind Eren, Erwin’s hands on Eren’s shoulders and asking Eren what he sees. Same as he did in the main series.\\n\\n\r\nThese are just a handful of examples. In reality, the amount of parody that goes on is substantial, indicating the anime’s tight focus throughout the entire season.\\n\\n\r\nThis direct parodying is not always comedic, but it is nostalgic. At least, for those that have seen the main series. And, to be fair to Chuugakkou, that is the audience for this anime – fans of the Attack on Titan series.\\n\\n\r\nArmin dresses up as a poster girl (highlighting his effeminate appearance). Eren carries a key on his shoulder with glowing-green eyes (simultaneously referring to the boulder-carrying sequence and the all-important key to the basement). The anime states how almost inconceivable it would be to have broken three-dimensional maneuver gear (which, of course at this point, happens in the anime). Jokes, events, and tropes lost on non-main-series watchers, but, for those familiar with the series, become welcomed allusions.\\n\\n\r\nChuugakkou also adds subtle parodic elements that boost the show’s comedy chops that much further. In the classroom, Mikasa’s drawing of Eren is, for a junior-high student, a literal work of art, joking about Mikasa’s perfection in everything she does. The masks and puppets that sometimes pop up match some of the iconic Titans. And Levi calling Hange “Abnormal” is a reference to the above and other, irregular Titans while also acting as an insult.\\n\\n\r\nBeyond the parody, the anime also includes other comedic bits. Background dialogue between Ymir and Krista about Eren incorrectly putting his name on a makeshift stamp. The characters nicely timing a repeat joke about Annie going to a Titan-and-human-mixed cram school. Mikasa unfazed by nearly every ridiculous event that happens around her.\\n\\n\r\nAnd that is the extent of the anime. Chuugakkou does not go for worthwhile themes, and it does not have to. In its seventeen-minute episodes, the anime focuses purely on being a parodic, comedic experience. An experience that does almost everything right.\\n\\n\r\nANIMATION\\n\\n\r\nChuugakkou continues its strengths through its art and animation.\\n\\n\r\nActual animation remains surprisingly high throughout most of the season. The exaggerated nature of the anime allows for a lot of character movement in the form of three-dimensional maneuver gear, cooking food, and running Titans. Even when characters are not doing much, their eyes, limbs, and other attachments move with fluidity.\\n\\n\r\nArtistically, however, the anime is a toss-up.\\n\\n\r\nOn the one hand, the backgrounds and the places visited are bland. The school grounds do not invite many opportunities for gritty details or impressive-looking locations.\\n\\n\r\nOn the other hand, the comedy and the parody does not stop. Characters wear silly expressions to elicit laughter, and specific scenes will literally be identical to those in the main series – frame-for-frame, perspective, and orientation.\\n\\n\r\nAs for the character designs, they stay mostly true to their originals. “Mostly” because there are some changes. Mikasa’s eyes are more passive. Armin wears a futon wrapped around his head. Hannes dons a janitor’s outfit.\\n\\n\r\nThe thick, black lines, the attire of the corps, and the realness is exchanged for a small (pun intended) difference: The designs are all in miniature form. The characters have heads pretty much as big as their bodies, giving them all a silly look that boosts the comedy once again.\\n\\n\r\nCHARACTERS\\n\\n\r\nAlmost every character from the main series appears here in Chuugakkou.\\n\\n\r\nNaturally, the big three – Mikasa, Eren, and Armin – are front and center. Mikasa still has her unwavering devotion to Eren and her impossibly impeccable skills. Eren’s hatred for the Titans is as fervent as ever. And Armin’s baby behavior burns brightly. They are the same characters that the majority of the anime community have come to know and love.\\n\\n\r\nMany of the other characters are the same way, sticking to well-known tropes. Sasha loves food more than anything. Connie is somewhat dimwitted. Jean vies for popularity with the ladies. Oluo bites his tongue whenever he talks. Levi is scarily intimidating yet helpful. Ymir fawns and protects Krista who in turn continues being the nicest person imaginable (and a cutie to boot). Annie acts standoffish, Hange is slightly insane, and Hannah and Franz are madly in love.\\n\\n\r\nWhat gets lost in translation between the main series and Chuugakkou is the drama the cast experience. Without the looming threat of Titans, the potential loss of loved ones, and the intense interactions of the cast, the characters become only their aforementioned superficial traits. I.e., they lack depth.\\n\\n\r\nThe result is a lot of repetition on the characters’ part. Mikasa does nothing more than say “Eren!” the whole time. Connie exists to say something slightly stupid sometimes. Oluo always bites his tongue whenever he appears.\\n\\n\r\nNow, the argument is that this repetitive behavior is yet another parodic element of Chuugakkou because the main series takes this route with its characters as well. The argument does not work, however, for two reasons.\\n\\n\r\nOne, only two characters are as repetitive here as they are in the main series: Mikasa and Eren. The majority of Mikasa’s dialogue in the main series includes Eren’s name, and, for Eren, his dialogue is some variation of “I will kill all the Titans!” Even then (and has been brought up), more happens to and is shown of their characters in the main series, so the repetition (however slightly) is cut down.\\n\\n\r\nTwo, the frequency of the characters here compared to the main series is wildly different. In the main series, some of these characters only appear just in the first half or just in the second half, and some of these and other characters are killed off, eliminating them from the anime entirely. In Chuugakkou, nothing horrible ever happens to the characters and they are always around (since they are in the same class and clubs), so their traits are simply present more than usual.\\n\\n\r\nSo while the lack of depth for the characters can be explained away by the extreme focus on parody and comedy, the repetition cannot. The repetition causes Chuugakkou to lean on the same jokes with its cast time and again, reducing the efficacy of the parody and comedy it strives for.\\n\\n\r\nSOUND\\n\\n\r\nParody continues with the music employed by Chuugakkou.\\n\\n\r\nIn particular, the original soundtrack uses many of the same iconic pieces that the main series is known for. Perhaps obviously, the intense and melancholic tracks are nowhere near as impactful when compared to the main series, but they are just as awesome to hear. Plus, they contrast with the everyday happenings and the exaggerated reactions. This contrast adds yet another layer to the comedy, making the show that much more focused.\\n\\n\r\nThe voice-acting performances are nice in the sense that the actors and actresses who portray these characters in the main series return to portray these characters in this series. Yui Ishikawa, Yuki Kaji, and Marina Inoue reprise their roles as Mikasa, Eren, and Armin respectively to make the main-series fans feel as if they are at the Walls once more.\\n\\n\r\nThe voice-acting performances are not-so-nice in the sense that the characters do not have many chances to demonstrate their chops. Not as much yelling, screaming, and emotion goes on. They (obviously) sound the same as when they speak in the main series, but the performances simply do not stand out as anything special.\\n\\n\r\nThe opening theme (as one should guess) parodies the OP of the main series (right down to the subtle glance Mikasa gives Eren). Per usual, this iteration of the OP is not as intense, choosing a much happier and optimistic tone. The end of Chuugakkou’s OP makes this tone quite apparent with its less-than-serious lyrics and upbeat nature. As a parody song, it works. As a standalone song, it does not have the power and emotion to carry itself.\\n\\n\r\nThe ending theme is reminiscent of Attack on Titan’s second ED, but it does not feel like a parody of the track as the OP does. Following the mood of the show, the piece is quite lighthearted, filled with guitars and drums that seem to erupt from a makeshift garage band. The track does not have any catchy or memorable sections, unfortunately. Combined with its non-parody status, this ED ends up being subpar at best.\\n\\n\r\nENJOYMENT\\n\\n\r\nI am not sure how many of my readers know this, but I am a big fan of the main series. A few reasons make this so. One of the biggest – perhaps the biggest – is Mikasa.\\n\\n\r\nMikasa is one of my favorite female characters in anime, and, in this one, Mikasa was amazing throughout the season. I loved everything she did. Her nonchalant attitude, her incessant need to do everything with or about Eren, and her general adorableness and awesomeness all made me smile and laugh and be happy.\\n\\n\r\nThus, episode three was my favorite. Seeing Mikasa utterly depressed without Eren around, and then seeing her push Jean out of the way when Eren arrived made me laugh out loud. While her main-series counterpart is even better, Mikasa made this anime for me.\\n\\n\r\nWhile I do not like the rest of the cast nearly as much as I do Mikasa, a lot of them were fun, too. Krista being way too cute. Annie’s shyness. Sasha and Connie wanting food and acting dumb. Eren, however, not so much. A ginormous difference compared to the main series makes him a lot less cool, and the difference severely hurts the likability of his character.\\n\\n\r\nAnd, in order to make valid comparisons, this one gave me an easy excuse to watch a large chunk of the main series. Getting to rewatch the main series made me more than happy, but it also made it apparent how much weaker the school setting is. The magnitude and the intensity is a large part of what makes the main series so thrilling, and this one just cannot reach that same level with a bunch of junior-high kids. Mikasa or otherwise.\\n\\n\r\nShingeki! Kyojin Chuugakkou parodies its way to victory. The comedy is focused. The characters, while repetitive in behavior, are reminiscent of their main-series counterparts. And the art, music, and entertainment are strong in their own respective ways. The anime makes it hard to doubt just how clean it is.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, the parodic and comedic focus never wavers\\n\\n\r\nAnimation: Good, above average actual animation, mixed artistic direction, and reminiscent yet silly character designs\\n\\n\r\nCharacters: Fine, while repetitive, Mikasa, Eren, and the rest of the gang accentuate their main-series counterparts\\n\\n\r\nSound: Fine, okay OP, bad ED, good OST, okay VA performances\\n\\n\r\nEnjoyment: Good, Mikasa is amazing but she and everything else cause yearning for more of the original\\n\\n\r\nFinal Score: 7/10",
            "date": "2016-09-09T21:31:00+00:00",
            "helpful_count": 7,
            "mal_id": 228673,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=228673"
        },
        {
            "content": "Firstly, lots of others have said it, but I'm going to repeat them;\r\nDon't watch this unless you have watched the first season! If you do, you'll completely ruin it for yourself. \r\nAttack on Titan is a great anime, in my opinion, so seeing them do a parody with cutesy characters, I was really excited. \r\nThe intro is the same awesome tune with a bit of a spin to it. \r\nThe voices are the same as the anime too, so that makes it even better.\r\nIt shows a lot of happenings from the base anime in comedic ways. Like Eren proclaiming on his first day he willerase the Titans, shortly after being hit with a giant eraser. \\n\r\nMikasa is still obsessed with Eren. Sasha loves food. Ymir is really protective of Krista. Hange is still tormenting Levi.\\n\\n\r\nIf you love the series and want something fun to watch, definitely give this a go.",
            "date": "2016-11-07T01:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 233373,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mikame-",
                "username": "Mikame-"
            },
            "url": "https://myanimelist.net/reviews.php?id=233373"
        },
        {
            "content": "I'm going to make this short since my main reason for this review is to get people to understand my point that this anime might be milked to the limit, yet not really.\r\nSo what I want to point out right now is that people are leaving poor reviews for this anime, but let's get down to it point by point...\r\nStory - 9\r\nSo as people are stating, this is pretty much the \"same plot\" as the original Shingeki no Kyojin anime. But then why would I still rate it 7? \r\nYou see... As far as it's right that the plot is very alike it's still afact as well that this anime has a far more humorous aspect to the story. This creates a whole new dimension which is way too looked upon as this is actually a very clever and creative idea. \\n\\n\r\nArt - 8\\n\r\nThe art concept is not bad but rather somewhat medicore. I've seen better, I've seen worse. But for this plot and the whole chibi act this art is absolutely fitting and wouldn't be half as good with lovely realistic rivers and perfect looking building. \\n\r\nIn the end it's a great art for this type of anime, yet it's not as good as it could've been if the genre had been otherwise. Therefore I decided to give it a somewhat reasonable high grade.\\n\\n\r\nSound - 9\\n\r\nThe original opening was amazing, this new opening is very alike but again somehow manages to succed in replacing the old opening in a humourous way. In the end it's creative, funny and more importantly extremely enjoyable. I see absolutely no reason to call of this to a low grade as all the other sounds such as the ost and ending are all of the same caliber.\\n\\n\r\nCharacter - 10\\n\r\nThey were awesome and rad before right? I mean if you disliked the original, then why would you watch this? \\n\r\nJust as amazingly cool the characters were before, just as chill, funny and ironic are they now. They're literally the same chracters, but once again they're just turned into the comedy genre rather than the original action one. They're literally perfect and I see no way to improve them... Therefore It had to be a 10!\\n\\n\r\nEnjoyment - 9\\n\r\nAs I stated earlier, this might very well be milking the cow a bit much, but I mean hey! It's funny, it's entertaining and the 18 minutes that each episodes take is 18 minutes that passes by in what feels like 3-5. It's incredibly enjoyable as the story unfolds perfectly in sync with the comedy genre and they even use the main story as a leading thread. By any means this is undoubtfully the best parody of an anime we've had in a VERY long time and it deserves a top spot.\\n\\n\r\nOverall\\n\r\nI'm just going to leave a simple math calculation for my explanation on the 9\\n\r\n9 + 8 + 9 + 10 + 9 = 45 (simply the scores plused together)\\n\r\n45 / 5 = 9 (finding the average)\\n\r\nAnd there you have it. \\n\r\nThe reason this anime should have a higher rating than 1-3. Just because it's somewhat \"just another bottle of milk\", doesn't mean it can't be a great show with some amazing aspects to it.\\n\\n\r\nThanks for reading (Y)\\n",
            "date": "2015-12-20T18:57:00+00:00",
            "helpful_count": 6,
            "mal_id": 206203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3949083.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Hunail",
                "username": "Hunail"
            },
            "url": "https://myanimelist.net/reviews.php?id=206203"
        },
        {
            "content": "*This Review WILL contain Spoilers*\r\nI have to say that I was expecting a normal parody from this, but this show was far beyond a casual parody. It's full of character development that the anime or even the manga haven't particularly touched yet. Also the foreshadowing for events to come are actually rather brutal once you realise them. This is not an anime to watch if you're not up-to-date with Season 2 and perhaps even the manga, though the spoilers for the manga are a lot subtler.\r\n[POSSIBLE SPOILERS]\r\nShingeki! Kyojin Chuugakkou is actually pretty far ahead of even the Season 2 timeline of Shingeki no Kyojin andit quite excellently shows the characters of the original show as (decently) normal kids with everyday problems. In this show you can see much more clearly how there was and still are things between characters:\\n\r\nEren <--> Annie, Mikasa <--> Eren, Berthold --> Annie, Christa <--> Ymir and Reiner --> Christa\\n\r\nIt's fun to see these normally stone-faced heroes just be kids that have feelings towards one another and try to survive in school against bullies (Titans) and due to the way that Shingeki No Kyojin is made (it's not exactly a romance) this is probably the only way to give the viewers confirmation on how the characters truly feel.\\n\\n\r\n[EVEN MORE SERIOUS SPOILERS FOR SEASON 2 AND 3-4]\\n\r\nAnd on about the foreshadowing aspects of this anime, well let's say that when I realised that Armin can't stand the cold and his room is burning hot OR when I noticed how Annie wore the \"Femal titan\"-halloween mask and Berthold wore the \"Colossal titan\"-halloween mask I had a wide grin in my face. This show is a must-watch for Shingeki no Kyojin -fans, but ONLY if you're up-to-date with the manga. It heavily spoils even Season 2 events for Shingeki no Kyojin and manga-readers will undestand how extremely hot conditions are linked with Armin. And that moment when you realise that the ghost girl that helped Christa/Historia is actually Frieda Reiss, I have no idea how they came up with these parts, but they are incredible and bring a joy of realisation for the manga-readers.\\n\\n\r\nShingeki! Kyojin Chuugakkou is in my opinion a Great 9/10, because it's far more than just a parody. It handles the characters well and even without a full lenght story to tell it manages to entertain with each separate episode with its fantastic humour, fun animation, cute moments and top-notch foreshadowing and character development.",
            "date": "2017-06-24T06:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 250844,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6330912.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MiiQeX",
                "username": "MiiQeX"
            },
            "url": "https://myanimelist.net/reviews.php?id=250844"
        },
        {
            "content": "I absolutely adore this anime but it's not for everyone. In my opinion/experience you need to be a fan of both the original (at least the first season) and of the ridiculous fandom that exists around it. I spent most of the time laughing and really enjoying it where as it made my hubby just want to re-watch the first season of the original. I hope they do this for every season!\r\nThe story closely follows the first season but it really emphasizes some of the sillier elements. Things like Levi's cleaning and how Jean is a horse. \r\nThe art is adorable, character designs all gowith the original just cuter and chibi-er. Same for sound.\\n\\n\r\n10 of 10!",
            "date": "2018-04-06T12:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 277132,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6908771.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hikari-Are",
                "username": "Hikari-Are"
            },
            "url": "https://myanimelist.net/reviews.php?id=277132"
        },
        {
            "content": "Note: If you have not watched the original please do so to understand the plot and reference jokes that are thrown here an there. \r\nThis anime is a spin off of the original anime \"Attack On Titan\" this anime is filled with humor that can make your day if you're bored or feeling down. I found the characters enjoyable to the story. The characters are all diverse having their different intentions in junior high you can find humor and some romance here, if you're into what the original anime genre which are drama/dark fantasy/Post-Apocalyptic fiction genre then this anime anime isn't for you. If youhappen to enjoy a humor/slice of life anime with a bit of romance and want to try something new then check it out! There isn't much to lose as well since this anime is short. Overall I would totally recommend this anime.",
            "date": "2016-04-03T18:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 215406,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5312236.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/evensteventbh",
                "username": "evensteventbh"
            },
            "url": "https://myanimelist.net/reviews.php?id=215406"
        },
        {
            "content": "Warning possible Spoilers\r\nNow when an anime does get to a certain popularity there's always that chance it'll get a series that is made for the purpose of being a parody and of course AoT is part of that.\r\nAoT Junior High is basically some of the moments during season 1 that has been restyled as a school anime in a Chibi aspect so now you get to see your favourite characters in a more cuter look.\r\nNow before I watched Koro-sensi's Quest I watched this which was my first parody series of a popular show and it was actually pretty entertaining with the fact they decided tomake AoT a show about people fighting and dying from giant monsters known as Titans and somehow change it into something cute which was a definite surprise and it mostly works, most of the time it was entertaining, but there were some cringey moments and it definitely spoils some things for season 2 like Bertholdt wearing a colossal titan mask which surely isn't a dead give away.\\n\r\nIt definitely turns out like your usual school anime with the sports festival, running for council president, test of courage and even a cook off and along the way it manages to incorporate moments from the main series into this which actually played out pretty well.\\n\\n\r\nThe characters are basically comedy versions of themselves as the show really uses the aspects we thought were funny about them in the main series and make it their entire character in this like Sasha eating a lot of food, Mikasa's obsession with Eren really makes her out to be a really tense Yandere, Levi's cleanliness powers are certainly off the scale and then there's Reiner's and Ymir's obsession with Krista as they fight over for her.\\n\r\nThe show used these aspects to great effect and they worked really well although sometimes Eren's titan slaughtering behaviour did get on my nerves and I never really understood why Armin was always in the state of having a constant cold which just didn't make any sense and the fact they dressed him up in a bunny outfit just made him look like a trap which is something I didn't really want to see.\\n\\n\r\nI thought the artstyle was actually pretty good and it suited the characters well especially for some like Mikasa, Annie, Sasha, Connie, Armin, Eren and even Levi as it made them look really cute. The titans themselves looked somewhat stupidly cute as well since their not trying to eat people just their lunches so they would go around causing mischief for the students.\\n\\n\r\nI thought the comedy was pretty funny and they would constantly use stuff from the original series and turn them into jokes like Oluo biting his tongue while he monologues or Hange being a completely crazy person because of her interests in titans and I think this version of her is probably more crazy than the original.\\n\\n\r\nOverall I thought this was actually a pretty good parody, but I wouldn't recommend watching it until after you've seen the second season because it does easter egg some spoilers in here if you notice them, other than that I think AoT fans would definitely enjoy this.",
            "date": "2017-07-27T09:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 253952,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=253952"
        },
        {
            "content": "Spoiler Free Review\r\nSo, it's kind of obvious that Attack on Titan Junior High is just a cute little show that uses the characters from Attack on Titan. I will say that I had more fun in this show than I did with Koro-Sensei Quest. The characters were fun and it was nice to see them in a peaceful environment for a change. This show doesn't even try to be something that it isn't. This could be a good thing, but it stops this show from being a great show. It cannot be compared to the originals (obviously), but for an OVA, it's really fun. Ihad fun with it, and I'm sure most of you will too.",
            "date": "2019-01-29T16:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 300344,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6019498.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TwoSwordStyle",
                "username": "TwoSwordStyle"
            },
            "url": "https://myanimelist.net/reviews.php?id=300344"
        },
        {
            "content": "Very cute and with really good animation (though at times it was a little stilted and weird), if you liked the first season of Attack on Titan you'll enjoy all the little references to the show that are in this. Very funny but honestly one of the worst cases of character reductionism and Flanderization I've ever seen. If you can handle viewing the characters of Attack on Titan as one-dimensional and with none of the depth they enjoy in the original series, you'll like this. Its practically required to have seen the first season of Attack on Titan to understand many of the references inthis series.",
            "date": "2017-01-03T12:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 237345,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/235337.jpg",
                "scores": {
                    "animation": 10,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SenaMinomori",
                "username": "SenaMinomori"
            },
            "url": "https://myanimelist.net/reviews.php?id=237345"
        },
        {
            "content": "honestly watched the entire season to hear Kamiya Hiroshi's Levi voice in chibi form. Totally. Worth. It. noshame.\r\nIf you're an avid SnK fan and don't take yourself too seriously, you may find this amusing and worth giving it a try (each episode is only 17 minutes long!). There's honestly no real continuing \"story\" to the episodes but it is terribly cute seeing the SnK cast in a semi-alternate universe of a traditional school setting + relatively harmless titans. The art is also seriously adorable and although not as \"action packed\" as the original in terms of animation design, the art doesn't really falter in termsof the character and scene portrayals.\\n\\n\r\nWorth watching if you have a few hours to kill and want to watch some of your favorite characters in some pretty endearing situations!",
            "date": "2015-12-26T19:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 206907,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3704087.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ArtemiS2",
                "username": "ArtemiS2"
            },
            "url": "https://myanimelist.net/reviews.php?id=206907"
        },
        {
            "content": "Why does this exist? Don't get me wrong, transposing the characters of a serious action-horror series into a high school for a chibi comedy series might have worked if it was well written... but it wasn't. All we got were scenes and lines from the main series thrown into a high school context without much context. That's not funny, it's not even a joke. And it gets worse when the same \"jokes\" are repeated over and over, like the scene of Hange nearly getting her head chopped off. Did you laugh seeing it once? Well, you won't after the fifth freaking time!\r\nThrowaway lines from theseries, like Eren telling Mikasa that \"I'm not your little brother and not some snot-nosed toddler\" are also repeated several times throughout the series, and I just don't get why. They add nothing and feel really out-of place when added. Characters frequently have inconsistent personalities between scenes (especially Jean and Mikasa) as a result of the writers trying to combine the personalities of the original versions of the characters with the exaggerated weird personalities that the show is trying to give them.\\n\r\nWith that said, the Dodgeball episode was hilarious, and I love how adorable they made chibi-Armin. The best episode by far though was the Halloween special, which combines so many insane ideas and ends with such a stupid nonsensical resolution that I couldn't help but laugh... But as I said, the laughs were rare and most of the jokes kept being repeated.\\n\r\nIt also sucks that in this series, titans go to school just like humans (they eat people's lunch boxes instead of eating people), because it means that the school allowed Zoe Hange (one of their students) to kidnap and experiment on other students for science club. How would the parents feel about that?\\n\r\nIn short, it's a mostly unfunny, endlessly repetitive series with only two (really) good episodes. Oh, and one where Jean falls in love with two vegetables. 3/10 not recommended.",
            "date": "2018-09-05T14:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 288196,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6526526.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheLegendOfDan",
                "username": "TheLegendOfDan"
            },
            "url": "https://myanimelist.net/reviews.php?id=288196"
        },
        {
            "content": "Before I start I should probably make an important distinction. This is a loosely based Shingeki No Kyojin spin-off series, therefore in the (however unlikely) event that you watched this show without having watched the main anime, this review might not be for you, however I will be regarding the aspects of this show both in regards to the original show, and without. \r\nStory 6/10 \r\nThe story is basically an alternate more comedic version of the original SnK anime. Humanity exists in a confined space, due to the presence of Titans. In SnK Titans threaten humanity itself, in this show the humans school lunch. \r\nAlot more comedic and with a much more upbeat and softer tone, the story is entertaining, but not much else can be said about it, gets the job done. If you have not watched SnK then this story might be a bit silly and not really able to hold up on it's own. \\n\\n\r\nCharacters 6/10 \\n\\n\r\nThe cast is the SnK characters, but made in a chibi like design and shifted to a high-school setting. Character traits and personality are the same but are a bit more exaggerated and greatly applied in the various school situations to enhance comedic effect. Interactions with characters that never happened (or cannot happen) in the original SnK are present in this one. The show takes full advantage of the characters and creates some pretty funny sequences with them. I'd say that the characters are the meat and potatoes of the show since they are the key ingredient to making this show work. Finishing the show you might feel that you learned a bit more about the characters, and it's overall a pleasant change to see them in that setting.\\n\r\nHowever, If you haven't watched SnK then much like with the story, you are out of context and most of the comedic effect of the characters will be greatly diminished. \\n\\n\r\nArt 6/10\\n\\n\r\nThe aesthetic of the show is very fitting and appropriately transformed. Much like the opening credits everything is given more color a happier, campier look and an overall \"shrinkage\" if you think how Titanic (ba dum tss) SnK seems to feel. Characters much like the rest of the show are all drawn in chibi-like versions of themselves. Overall I'd say the show did a perfect job of transitioning the setting and characters of Snk to SnC without compromising any of the aesthetics and personality we come to expect from these characters. Motion looks fluid and various scenes and tension are executed pretty well. My rating here is more influenced on the technical aspect of the Art, at the end of the day it's nothing groundbreaking or unprecedented. \\n\\n\r\nSound 6/10 \\n\\n\r\nAgain much like everything else on this show, the soundtrack seems like a transformed version of the SnK soundtrack. There is epic orchestral music, a happier campier version of the 1st SnK opening, and pretty much what you would expect from SnK itself in terms of atmosphere. (Again just a bit different) \\n\\n\r\nEnjoyment 7/10\\n\\n\r\nIf you are a fan of SnK, patiently waiting for season 2, this will definitely get you your SnK fix without diminishing your appetite. There is definitely enjoyment to be had with watching the SnK cast in this alternate setting pulling of zany shenanigans and a pleasant change of tone from the original SnK. If you haven't watched SnK , then I really can't say if the show will be nearly as enjoyable as it was to me and other fans. \\n\r\nIn conclusion, SnC is a great spin-off both in concept and execution, it's a good way to refresh the characters but giving them a different spin, while filling some time until season 2 is here. However that being said the show by itself is nothing groundbreaking but it gets the job done\\n\\n\r\nOverall 6/10\\n\\n",
            "date": "2015-12-20T14:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 206170,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2736349.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yagyuu_Mugen",
                "username": "Yagyuu_Mugen"
            },
            "url": "https://myanimelist.net/reviews.php?id=206170"
        }
    ],
    [
        {
            "content": "For all who only watched the first season of the anime, and are understanding hints pretty fast DO NOT WATCH THE SPIN-OFF FOR NOW because you may get spoiled (like me) \r\nAside from that the anime is pretty good and is adorable, and is showing multiple sides of the Shingeki no kyojin cast.\r\nIt's also showing how characters would interact if they were in our same time-line, at school! But it might get not interesting\r\nThe art is pretty good and is super-cute, and I liked the opening so much!\r\nIf you are interested in spin-off, cute and reference based anime you might like this!",
            "date": "2015-11-28T12:50:00+00:00",
            "helpful_count": 155,
            "mal_id": 204365,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4785126.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TsuAsakO",
                "username": "TsuAsakO"
            },
            "url": "https://myanimelist.net/reviews.php?id=204365"
        },
        {
            "content": "First things first, you HAVE to watch the first season of Attack on Titan before watching this. If not, you'll get spoiled a fair bit and not get the full potential out of this fantastic parody.\r\nIn short, Shingeki! Kyojin Chuugakkou is a fantastic parody. It absolutely nails the scenes from the original series. The impact, intensity and music are close to perfect in each and every scene that the show is \"making fun\" of.\r\nStory: 6/10\r\nThe story (VERY loosely) follows the original Attack on Titan story line. The same music and phrases are used for each scene in the parody, as it was used in theoriginal series. It has TONS of references, like when *you know who* is eaten and *you know him* screams/cries teary eyed with his arm extended.\\n\\n\r\nArt: 8/10\\n\\n\r\nThe art uses a light color palette to bring the chibi characters to life (I couldn't word that better, sorry...)\\n\r\nThere's a bit of recycled animation from the first season, like when titans are running, or when the big ol' colossal titan is peeking over the wall.\\n\r\nBut here's a twist!\\n\\n\r\nSometimes, (when something scary/shocking happens) the art turns into some of the manga drawings from the original manga. I was pleasantly surprised when it first happened, but it doesn't happen a lot during the anime, sadly.\\n\\n\r\nSound: 9/10\\n\\n\r\nIf you're a big fan of the Attack on Titan soundtrack, then rejoice! They use nearly all of the songs from AoT in this parody. It's incredible how well they manage to weave the soundtrack into every scene, without it feeling out of place or stitched on.\\n\\n\r\nMy only gripe about the sound, is that they didn't introduce any new songs in the show.\\n\\n\r\nCharacters: 7/10\\n\\n\r\nTake the strongest traits of each character (Eren -> Kill all titans! Mikasa -> Protect Eren! Levi -> Cleaning.) and exaggerate the living shit out of it.\\n\\n\r\nI don't mean this in a bad way. It goes really well with the tone of the show, but if you're a newcomer to the Attack on Titan universe and start with this series... Oh boy.\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nI absolutely fucking loved it!\\n\\n\r\nHoly shit I've never been this pumped when watching a \"comedy\" show.\\n\r\nThe music, the fucking references man! Everything goes so fucking well together!\\n\\n\r\nWhen i heard about Shingeki! Kyojin Chuugakkou i thought, \"Great... Just HOW much are they going to milk the franchise?\" Then i watched the first episode and found out that i hadn't laughed that much in ages. It's a really good time.\\n\\n\r\nOverall 8/10\\n\\n\r\nShingeki! Kyojin Chuugakkou is a great supplementary show to watch while waiting for Attack on Titan season 2.\\n\\n\r\nJust make sure that you already have watched the first season.",
            "date": "2015-12-19T13:24:00+00:00",
            "helpful_count": 92,
            "mal_id": 206020,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3317453.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Millawls",
                "username": "Millawls"
            },
            "url": "https://myanimelist.net/reviews.php?id=206020"
        },
        {
            "content": "Do you ever feel like milking the shit out of something that's popular? No? Then you wouldn't relate to this crap. Attack on Chibi is a spin-off parody anime to one of the most popular shows ever made. It's done by a different studio, focusing more on comedy and having this chibi artform instead of the dark and greedy look that the original show has. \r\nThe show fails at everything. You would expect that a parody of Attack on Titan would succeeed at poking fun at it, while having some clever stuff thrown in. Instead, we have this show pandering towards fans for the sakesof getting another dollar. A lot of the characters felt like they were pulled out from fanfictions and Tumblr. One of the most popular characters in AoT is Levi, who is now known in the fandom as that guy that has a thing for cleaning, though this was barely present in the original show. In Attack on Chibi, they decide that it would be a good idea if they drag that cleaning joke for Tumblr users to fangasm. \\n\\n\r\nDoes it work? \\n\\n\r\nI don't see too many people really talking about this. \\n\r\nThe only reason this cashgrab exists is to remind you that AoT is still a thing and that the second season will be out in 2016, but there was no point in making this. \\n\\n\r\nEvery character is an exaggerated version of their fanfictions, the comedy is slaptstick nonsense and everything else is not note worthy. But I will give them credit for one thing. At times, they play serious music in the background while parodying a scene from the show, and I'm not sure how, but it works pretty well. Unfortunetely, this is barely present in the show, and is only used in episode 1 and episode 12, which are the best episodes. \\n\\n\r\nThe rest? It's hard to watch. It really is. Not only that, but the episodes are only 17 minutes for some reason, and it doesn't help that each episode feels longer than the average 22 minutes, too. \\n\\n\r\nThis show is like anime, a mistake. 3/10",
            "date": "2015-12-20T07:39:00+00:00",
            "helpful_count": 49,
            "mal_id": 206113,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4495158.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/jumpy",
                "username": "jumpy"
            },
            "url": "https://myanimelist.net/reviews.php?id=206113"
        },
        {
            "content": "Alright then Attack on Titan: Junior High has ended, so I took it upon myself to review it. In short, it was hilarious. Let's get into this:\r\nStory\r\nWith this type of show there's nothing much to say in terms of story. The entire show is just a parody of Attack on Titan, it makes fun of the series and references the show in all sorts of ways, in a funny way too. It also makes a lot of references to the manga for manga readers, such as myself and they really were like icing on a cake and made it heck of a lot more enjoyablethan one would suspect.\\n\\n\r\nArt & Sound\\n\r\nThe art was really good, okay it was low-key compared to the original but it was still good, it was a stylized in the cartoonish way to show that it isn't the show, it's just lighthearted fun not meant to be taken serious.\\n\\n\r\nThe show has the original music that was used in Attack on Titan, it also adds it's own music. The opening is a parody of the first opening and the ending song being, well, not a parody but each are not something I would listen to on their own. To be completely honest the music for this show is lazy, can't fault them since it's a parody show.\\n\\n\r\nCharacter\\n\r\nI'd like to say that the characters in this are better than the original. The show takes the original cast and makes them more sillier. With Eren they made him an idiot who wants to destroy the titans who doesn't give up, making him a bonehead if you will. Armin is the wimpy smart character, they add on him by making him do things that he wouldn't do such as being in a blanket, kind of like being conservative to himself, same with the others. Mikasa is still emotionless, nah just kidding she actually has emotions! Can you believe it?\\n\\n\r\nFrom the original characters they are well bland in a sense, in this they are more \"colorful\" and express more emotions and actually make a lot more sense, with the context of the show, of the character troupes that the show presents them as, with their character troupes it makes them shine more and makes them more memorable and fun.\\n\\n\r\nEnjoyment\\n\r\nThis was very funny, I was laughing all the time. This is the type of show that derives on just pure enjoyment, a show to just have fun, turn off your brain and watch. Yeah there are those people that say \"just give us season 2 not this crap, blah blah blah\" and I say just learn to have fun with a show once in awhile, you'll see that it's actually quite enjoyable.\\n\\n\r\nOverall\\n\r\nSome people may find it annoying and pointless, I understand, I, on the other hand, didn't find it annoying I just found it to be fun, dumb ole fun of the original. So overall I'll give Attack on Titan: Junior High a 6/10, I'd recommend it to anyone who likes Attack on Titan and wants to have some fun with it.",
            "date": "2015-12-19T11:41:00+00:00",
            "helpful_count": 24,
            "mal_id": 206000,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4704461.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LangbaltXCI",
                "username": "LangbaltXCI"
            },
            "url": "https://myanimelist.net/reviews.php?id=206000"
        },
        {
            "content": "Spin-offs are often a way to pander to fans and give them something similar to what they were looking for, but not really.  Often times, these spin-offs come in the form of OVA's, extra episodes that usually don't pertain to the original plot and go off on their own little sidestories.  Other times, we have completely different stories that are usually for comedic reasons and pander to fans of this series.  This...is the latter.  \r\nStory: Attack! Titan Junior High, as it's known in English travels into a different world of the SNK world where all of our 'lovable' characters go tojunior high school (or middle school) at Titan Junior high where they experience the best school life possible, filled with fun, excitement, and the signature rampaging monsters known as titans.  What fun!\\n\\n\r\nThe main thing here to realize is that the SNK that a lot of people know and love has been turned into a school comedy.  All of the events that have happened in the series both in the anime and the manga have not transpired, and everyone is alive.  Note, EVERYONE is alive.  So, what does this say about this show?  Well, not much really.\\n\\n\r\nTo be honest, there's nothing really interesting about the story of Attack Junior High.  Every episode, our merry band of lovable titan killers go about their daily school lives, doing what apparently every middle/high school in Japan does according to anime such as: school festivals, club activities, getting love letters, and sacrificing your lunch to the oppressive titan species that for some reason has a school right next to you.  And honestly, that's all the show has to offer.  In every episode, we follow Eren, or some other member of the main SNK cast on a mini adventure that usually has some kind of throwback to the original series be it a reference to an iconic scene, or hidden little references that every SNK that sees it will go, \"Oh!  It's that!  Nice!\" or something of that sort.  \\n\\n\r\nIn the end, Attack! Titan Junior High is a bland piece of cheap entertainment that only really services hardcore fans of the SNK series.  Its entire potential was wasted at the start since it tried to take a series and turn it into something it both wasn't and could never be.  \\n\\n\r\nOverview:\\n\r\n-  Bland, marketed spin-off\\n\r\n-  Seriously though, there is nothing worth about this series.\\n\\n\r\nCharacters: Similar to their original counterparts, the cast of this show is essentially a devolved version of the entire SNK cast, with each character retaining only one of their 'vast' amount of traits.  Eren is the same genocidal maniac who wants to kill all titans, Mikasa is her same \"only sustained by Eren\", Jean wants to be popular with the ladies, Sasha wants food, Conny could give less of a crap about anything, etc.  \\n\\n\r\nThe most noticeable difference I can see in terms of cast is the fact that Armin for some reason is a temperature freak who for the life of him cannot take cold, even if it's 70 degrees Fahrenheit outside, and requires a futon on or around him at all times, which really makes him look and seem more ridiculous than he already was.  (And that's saying something.)  \\n\\n\r\nAnd as I mentioned before, every character, and I mean every character of the SNK series appears in this spin-off, including Levi's dead patrol, Sawny and Bean, and the other nobodies who died during the first arc of the series. \\n\\n\r\nIn the end though, there still really isn't much to say.  These characters already weren't really that good as proper characters in the original series and seeing them again, especially in a format that really doesn't try and make them seem likable, doesn't really help this show in a positive light.\\n\\n\r\nOverview:\\n\r\n+ Everyone comes back\\n\r\n-  Everyone is one-note and/or boring.  (We get it, Eren.  You want to kill all the titans.  Shout something else for once, will ya?!)\\n\\n\r\nArt: Now, the art.  The art is one of the more peculiar things about this spin-off.  Wit Studio made the original SNK with a very definied artstyle with everything looking somewhat melancholy with these thick black lines to define character outline, folds in the face, etc.  But for this spin-off, we have Production I.G. taking the reins in development and you know...there's just something...off, about this.\\n\\n\r\nAttack! Titan Junior High uses a chibi or moe style of animation that isn't really all that unique in any way.  Nothing about the show really stands out except for the way the characters were made.  To put it in simple terms, the characters look both great, and terrifying in Chibi form.  Now, why do I say they look great and terrifying?  Well, it's because the chibi format really doesn't work for everyone.  \\n\\n\r\nThere are certain characters in the SNK universe that have an inherently defined look to them like Erwin, Jean, and Keith.  And as such, when being transferred, look really, REALLY weird in this format to the point that they look laughable or out of place.  (Seriously, who thought that was a good idea?)  They look so off with the chibi proportions that are displayed that it's just jarring to look at.  Other characters like our three main characters, Christa, Sasha, and even Conny look fine, but it's just hard not to remember how creepy it looks to see Jean's unmodified face stuck onto a Chibi body.  (Now THAT'S true nightmare fuel)\\n\\n\r\nOverview\\n\r\n+/- Average and generally normal quality\\n\r\n-  Some of the characters look off; VERY off.  \\n\\n\r\nSound:  The soundtrack for Attack! Titan Junior High is basically what you heard in the original SNK with only a few minor differences.  Every so often in the show, they will play one or two sound bites that will sound familiar if you've seen the original series, but that's about it for relation to the original.  \\n\\n\r\nWhat makes this series different than its predecessor is its opening.  Essentially, it's a rehash of the first opening of SNK with a more 'school-related' sound to it with ringing bells and sounding more upbeat than its original melancholy self.  The ending is rather generic, so it really doesn't deserve much special mention either.\\n\\n\r\nOverview:\\n\r\n+  Throwbacks to the original\\n\r\n-   Any music made specifically for this is meh at best.\\n\\n\r\nPersonal Enjoyment: First of all, I didn't really like the original SNK.  And it's not because I'm inherently someone who just doesn't like THE popular thing, but rather because it was a show that had promising potential, but just had a lot of flaws that hampered the quality of the show.  (Plus fandom.  I hate fandom.)  So, after finishing this what are my thoughts?\\n\\n\r\nDid I like this show?\\n\\n\r\nOk, for the first episode, sure.  It's the kind of one-off experience thing where you're like, \"Wow, this is a thing.  That's a little funny.\"  because it's a parody of a series that's just so bad, it's funny.  But, with every new episode, the show got tired fast and there really wasn't anything to enjoy watching.  At least it's only like 15 minutes an episode, so you don't have to suffer a full-length episode worth of soulless material.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nMost of all, it's just how bland and tasteless this felt.  It's a spin-off that only really served to market SNK even more as a series, pandering to the fandom and following it has, thus creating a series that even as a comedy, failed to fulfill.  There just didn't seem like there was much effort put into it, like I.G. thought, \"We can make this as crap as we want; people'll still watch it.\"  Which...kinda came true in the end.\\n\\n\r\nWould I recommend this show?\\n\\n\r\nIf you love SNK.  And I mean LOVE SNK, then this is a show you should probably watch, since its got all of the SNK wrapped up in a different setting package.  But if you're not one of those die-hard fans, just don't even consider this; you're only wasting your time with this series if you decide to watch it.",
            "date": "2015-12-19T15:36:00+00:00",
            "helpful_count": 14,
            "mal_id": 206041,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=206041"
        },
        {
            "content": "This series relies entirely on the viewer's having-seen and having-loved Shingeki no Kyojin. If you have not seen or did not enjoy the world of Attack on Titan, don't watch this. Straight up don't do it. You will be on the outside of an inside joke. Knowledge of the original series is absolutely critical to getting anything out of this spin-off. It is a parody that relies heavily on the parallels it draws between the original characters and events and the irony of twisting the setting in which those events take place. If you haven't seen the original version, this is going to come offlike an episode of Dora the Explorer or some shit, and it's also going to spoil the events of the original series, so just don't do it. Don't.\\n\\n\r\nOkay, so everyone left reading has seen the original at this point, right? Excellent. Here we go.\\n\\n\r\nI expected to think that this series was stupid. I literally only watched it out of morbid curiosity, the ease of time commitment (episodes are roughly 15 minutes long), and the fact that I really missed the original cast of characters while waiting on Shingeki no Kyojin's third season. I was pleasantly surprised to discover a well-crafted parody that is at once naively childish AND smart.\\n\\n\r\nIf you've never seen the original, this series is going to consist of a bunch of hammy characters trying to naively solve silly, inconsequential problems in the wholesomest of ways. It's very hard-work-and-friendship-conquer-all. It's cutesy. It's corny. It feels like an episode of My Little Pony. However, that's kind of where its brilliance lies. What the series is actually doing is wryly mocking the very R-rated, tragic, and horrifying events of the original story. With that in mind, Chuugakkou is quite sick, twisted, and wryly hilarious.\\n\\n\r\nThe characters are overblown, exaggerated versions of themselves, each one successfully lampshading their defining traits. It helps the comedy that the same cast of actors returned to voice them and treated them with the same emotional depth and gravitas as the original series, expounding the dramatic irony. What references are made to the events of Shingeki no Kyojin are both unexpected and hilariously underplayed, leading to genuine laugh-out-loud moments in each episode. The plot of each episode is more or less irrelevant nonsense--it's merely a vehicle for character-driven and context-based mockery. Frankly, the inclusion of a real plot with actual emotional stakes would likely undermine the humour of the series. It's necessary only as a backdrop for a bunch of darkly funny silliness.\\n\\n\r\nShingeki! Kyojin Chuugakkou is a splendid supplement for Attack on Titan fans twiddling their thumbs between seasons. It gives you a light-hearted dose of your favourite cast of characters and successfully lampoons the horrors-of-war storyline in a way that would frankly be insulting if it weren't written, produced, and performed by all of the people involved in the original project. Chuugakkou is a wink and a playful nudge from the writers to the fans and will tide you over until the bloodbath returns in 2018.\\n\\n",
            "date": "2017-10-04T15:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 259711,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6552770.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/paedanticbasterd",
                "username": "paedanticbasterd"
            },
            "url": "https://myanimelist.net/reviews.php?id=259711"
        },
        {
            "content": "There they go again with their hilariously crazy meming nature, man I just love this show, so sad it had to end this soon. I just have so much to say about this show as a whole, I figured out I might as well make a full-fledged review and call it a day.\r\nImaging going through every big moment in the Attack on Titan franchise, bit by bit, and turning the saddest and serious plot points into the most hilarious in context jokes, put it simply, this is just a huge meme of a show.\r\n- Story (7/10):\r\nAs the story starts, this is an alternative timeline, whereall the events of the story take a more comedy-oriented approach, no over gory deaths, and none of that, just pure Attack on Titan memes.\\n\r\nAll your typical familiar faces from the original shaw and OVAs make a comeback, It's about school struggles, and activities along the way, very basic story progression that focuses more on telling jokes than development.\\n\\n\r\n- Art (8/10):\\n\r\nVery basic chibi art, but in a super cute way, (but not as cute as Attack on Titan drama pictures), the animation is very subtle;, really nothing remarkable to mention here, other than the phenomenal camera movements on some parts, and the great use of CG and particle effects.\\n\\n\r\n- Sound (8.5/10):\\n\r\nI can't get enough of the original opening's ripoff, and the same can be said about the ending song too. the soundtrack is just as strong, and the voice acting is on point, man, I just love Sasha's voice act, among all of the characters, she has the perfect one for a chibi makeover.\\n\\n\r\n- Character (8/10):\\n\r\nMy, very hilarious  recreations, what I really adore about this cast, is the comeback of characters from the OVAs, like for instance, Ilse, Isabel, and Farlan, not only the human characters are amazing, but also the Titans as a counterparts, yes, there is a supposed -best-titan in this show, and they bring a lot of joy to see in a more goofy way.\\n\\n\r\n- Enjoyment (9/10):\\n\r\nThe humor is what makes this show stand out, it's just pure (sometimes hysterical) laughter one after the other. the humor is very easy to catch on with, as far as I know, every typical Attack on Titan fan would get a grasp on it, it really enjoyment comes from real event recreations, the ripoffs and references are killing it.\\n\\n\r\n- Overall (8.1/10):\\n\r\nAs much as I love this show, and willing to recommend it to basically everyone, there is a very specific audience that this show is aimed at, as a big Attack on Titan fan, having watched the two original seasons and OVAs for no less than 3 times, I found some jokes to be very hard to catch upon unless you know the references very well, only then, the humour flash would trigger you up.",
            "date": "2018-04-13T04:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 277938,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5898843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Eoussama",
                "username": "Eoussama"
            },
            "url": "https://myanimelist.net/reviews.php?id=277938"
        },
        {
            "content": "I have no prior experience watching Attack on Titan save five minutes of an episode on Toonami, but after this parody, I'm sold to watch the original series.\r\nI've seen this series get a lot of flock from some folks online because it's a \"cash grab\", but unlike other works of the same nature, this one still retains the heart of the original and reinterprets it to create a fun and refreshing new story without the urgency and peril of the Attack on Titan most people are familiar with.\r\nAttack on Titan: Junior High's story follows Eren Jaeger and his friends as they begin their first yearof middle school. On the first day of school, a titan steals Eren's lunch; a cheeseburger, and this becomes Eren's plight and motivation for the rest of the 12 episode series. The titans don't play a huge role in every episode and the ones they do, they're never threatening to the point of fatality. Characters are frequently stepped on and thrown resembling comic relief you'd find in a rom-com, and when the mood gets serious, it's hardly ten seconds before somebody gets interrupted by some ridiculous incident. \\n\\n\r\nIt's hard to focus on the story because for much of the series, it's apparently absent right up until the very end when something relating to Eren's first incident occurs again on a bigger scale and reminds you what he was fighting for.\\n\\n\r\nEren's noble quest to protect everyone's lunch from the titans seems silly in the grand scheme of other issues titan's cause, but in the context of this fun parody, it's motivation enough to stir some powerful and unsettling reactions in Eren. \\n\\n\r\nHis character is exaggerated and he's usually the loudest in any scene whether the situation warrants it or not, but he's still someone who inspires those around him. When it's time for someone to step up to the plate and fight, Eren's the first one to do it.\\n\\n\r\nIt's interesting to watch the dynamic between Eren and the rest of the first years because even though he's virtually the same in every episode, the interactions each character has with him is always unique and something to look forward to. The relationship between Eren, Armin, and Mikasa notably becomes the strongest towards the end and their companionship in this parody hints at something stronger and unbreakable in the original.\\n\\n\r\nEven for someone who has not sat through Season One, and now, Season Two of Attack on Titan, by paying enough attention and connecting a few dots, it's not hard to guess what might happen to these characters in the original. \\n\\n\r\nOverall, even though it's a parody, the characters still retain the soul of who they're supposed to be and make each episode humorous by playing off their flaws and warping them to extreme degrees.\\n\\n\r\nIn regards to the art, the original style returns, only shrunken, to create chibi variations of otherwise intimidating cast members such as the titans, Levi, the teachers, and some of the second year students. The style works fine to communicate the nature of the series and you know what you're getting into just looking at the cover. No complaints on that front, but the backgrounds are forgettable if you start to remember they exist.\\n\\n\r\nThe sound quality is great. The opening theme is a reinterpretation of Attack on Titan's original and unforgettable first theme song, \"Guren no Yamiya\", and the ending theme, \"Hangeki no Daichi\", is a lively J-Rock song sung by the Japanese voices of Eren (Yuki Kaji), Mikasa (Yui Ishikawa), and Jean (Kishō Taniyama). The background OST adjusts for each mood like it should and when the situation is romantic or tinged with danger, the soundtrack does not disappoint and provides some stirring tracks.\\n\\n\r\nI could go on and on about everything well this series does, but for a person who sat through the original Attack on Titan and cried and struggled with those characters, I can understand their irritation. I imagine their feeling is the same as a person who grew up watching Teen Titans and waited years for its return only to get Teen Titans Go on Cartoon Network. But set all that aside and take this show for what it is: a joke. It's taking everything that scared you, Eren, and the rest of the first years in the original and putting a baby face on it so it's not anywhere near as intimidating as before. And maybe that's not for you. Maybe that's not what you look for when you watch anime. That's fine. But this anime, even if it's a parody, has a lot to offer. It still bears a lot of the same emotion I imagine was present in the original and reconstructs it to fit inside a fun and cute story about a man and his burger.\\n\\n\r\nIf you like Attack on Titan and you've already seen everything else; while you're waiting for that third season, you may as well sit down and at least tolerate this 12 episode series. Nothing ventured, nothing gained. And if you don't like it, there's still casuals like me who have money at the ready to pay for more cash grabs like this and the toys that come with it.\\n\\n\r\nSo you may as well come along for the ride.\\n\\n\\n",
            "date": "2017-08-03T13:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 254603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5252901.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_Poochyena_",
                "username": "_Poochyena_"
            },
            "url": "https://myanimelist.net/reviews.php?id=254603"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI want to save my nostalgic anecdote related to Attack on Titan for when the second season eventually rolls around. (It recently got pushed back to 2017, so we have a bit of time before I share the tale.)\r\nIn the meantime, I will say that, based on the contents of Shingeki! Kyojin Chuugakkou, I would not consider myself a clean-freak. I like doing the dishes, taking out the garbage, and making sure my abode is relatively clean, but I have no qualms with keeping my room messy.\r\nIf I had the three-dimensional maneuver gear that Mikasa,Eren, and the rest of the gang use to clean the massive walls at their junior high, however, I am positive that I would do a lot more cleaning than I already do. Until I get that gear, I can bide my time with Chuugakkou, a more-than-solid anime based on its more-than-popular relative.\\n\\n\r\nSTORY\\n\\n\r\nChuugakkou stems from the famous Attack on Titan series. But this anime is no sequel, and it is technically no spin-off. Instead, Chuugakkou is a parody of Titan proportions.\\n\\n\r\nThe premise loosely relates to the main series: Humans live among the Titans. But rather than practicing fighting mechanics and protecting their loved ones, they practice mathematics and protect their lunchboxes. The Titans disrupt their daily lives on occasion, but they are never a pressing issue – at least, to the extent that they are in the main series.\\n\\n\r\nFor example, one episode has a female Titan falling in love with Jean. Another episode has a bunch of the Titans stealing the students’ cheeseburger stand. In reality, these two instances (and discounting Hange’s strange obsession with tickling Titans) showcase the Titans the most. Arguably, foregoing the Titans in favor of focusing on the classroom activities, the test of courage, and the student council presidential election may be a mistake. After all, the anime is poised as a parody of the main series. Meaning, no Titans equals no parody.\\n\\n\r\nThankfully, Chuugakkou realizes the lack of Titans and pursues parodying the other parts of the main series. And it does so expertly. Many of the scenes mirror those in the main series – right down to the dialogue used. A nice example is in episode seven. Their year’s class is getting crushed in the sport’s day games. Mikasa, wanting to rally everyone, gives a goading speech, declaring how strong she is and how weak they are. Her speech matches the one she gives following a devastating event in the main series. Even Jean’s response – that Mikasa’s oratory skills need work – is the same.\\n\\n\r\nThe anime does this scene-for-scene parody a lot.\\n\\n\r\nEpisode twelve contains some advice from Levi to Eren about making decisions and relying either on oneself or one’s comrades (with accompanying desperation look from Petra).\\n\\n\r\nEpisode ten has Marco giving an encouraging speech for Jean, a (similar) speech that he also gives in the main series following Armin’s risky plan.\\n\\n\r\nEpisode eight has Erwin Smith standing behind Eren, Erwin’s hands on Eren’s shoulders and asking Eren what he sees. Same as he did in the main series.\\n\\n\r\nThese are just a handful of examples. In reality, the amount of parody that goes on is substantial, indicating the anime’s tight focus throughout the entire season.\\n\\n\r\nThis direct parodying is not always comedic, but it is nostalgic. At least, for those that have seen the main series. And, to be fair to Chuugakkou, that is the audience for this anime – fans of the Attack on Titan series.\\n\\n\r\nArmin dresses up as a poster girl (highlighting his effeminate appearance). Eren carries a key on his shoulder with glowing-green eyes (simultaneously referring to the boulder-carrying sequence and the all-important key to the basement). The anime states how almost inconceivable it would be to have broken three-dimensional maneuver gear (which, of course at this point, happens in the anime). Jokes, events, and tropes lost on non-main-series watchers, but, for those familiar with the series, become welcomed allusions.\\n\\n\r\nChuugakkou also adds subtle parodic elements that boost the show’s comedy chops that much further. In the classroom, Mikasa’s drawing of Eren is, for a junior-high student, a literal work of art, joking about Mikasa’s perfection in everything she does. The masks and puppets that sometimes pop up match some of the iconic Titans. And Levi calling Hange “Abnormal” is a reference to the above and other, irregular Titans while also acting as an insult.\\n\\n\r\nBeyond the parody, the anime also includes other comedic bits. Background dialogue between Ymir and Krista about Eren incorrectly putting his name on a makeshift stamp. The characters nicely timing a repeat joke about Annie going to a Titan-and-human-mixed cram school. Mikasa unfazed by nearly every ridiculous event that happens around her.\\n\\n\r\nAnd that is the extent of the anime. Chuugakkou does not go for worthwhile themes, and it does not have to. In its seventeen-minute episodes, the anime focuses purely on being a parodic, comedic experience. An experience that does almost everything right.\\n\\n\r\nANIMATION\\n\\n\r\nChuugakkou continues its strengths through its art and animation.\\n\\n\r\nActual animation remains surprisingly high throughout most of the season. The exaggerated nature of the anime allows for a lot of character movement in the form of three-dimensional maneuver gear, cooking food, and running Titans. Even when characters are not doing much, their eyes, limbs, and other attachments move with fluidity.\\n\\n\r\nArtistically, however, the anime is a toss-up.\\n\\n\r\nOn the one hand, the backgrounds and the places visited are bland. The school grounds do not invite many opportunities for gritty details or impressive-looking locations.\\n\\n\r\nOn the other hand, the comedy and the parody does not stop. Characters wear silly expressions to elicit laughter, and specific scenes will literally be identical to those in the main series – frame-for-frame, perspective, and orientation.\\n\\n\r\nAs for the character designs, they stay mostly true to their originals. “Mostly” because there are some changes. Mikasa’s eyes are more passive. Armin wears a futon wrapped around his head. Hannes dons a janitor’s outfit.\\n\\n\r\nThe thick, black lines, the attire of the corps, and the realness is exchanged for a small (pun intended) difference: The designs are all in miniature form. The characters have heads pretty much as big as their bodies, giving them all a silly look that boosts the comedy once again.\\n\\n\r\nCHARACTERS\\n\\n\r\nAlmost every character from the main series appears here in Chuugakkou.\\n\\n\r\nNaturally, the big three – Mikasa, Eren, and Armin – are front and center. Mikasa still has her unwavering devotion to Eren and her impossibly impeccable skills. Eren’s hatred for the Titans is as fervent as ever. And Armin’s baby behavior burns brightly. They are the same characters that the majority of the anime community have come to know and love.\\n\\n\r\nMany of the other characters are the same way, sticking to well-known tropes. Sasha loves food more than anything. Connie is somewhat dimwitted. Jean vies for popularity with the ladies. Oluo bites his tongue whenever he talks. Levi is scarily intimidating yet helpful. Ymir fawns and protects Krista who in turn continues being the nicest person imaginable (and a cutie to boot). Annie acts standoffish, Hange is slightly insane, and Hannah and Franz are madly in love.\\n\\n\r\nWhat gets lost in translation between the main series and Chuugakkou is the drama the cast experience. Without the looming threat of Titans, the potential loss of loved ones, and the intense interactions of the cast, the characters become only their aforementioned superficial traits. I.e., they lack depth.\\n\\n\r\nThe result is a lot of repetition on the characters’ part. Mikasa does nothing more than say “Eren!” the whole time. Connie exists to say something slightly stupid sometimes. Oluo always bites his tongue whenever he appears.\\n\\n\r\nNow, the argument is that this repetitive behavior is yet another parodic element of Chuugakkou because the main series takes this route with its characters as well. The argument does not work, however, for two reasons.\\n\\n\r\nOne, only two characters are as repetitive here as they are in the main series: Mikasa and Eren. The majority of Mikasa’s dialogue in the main series includes Eren’s name, and, for Eren, his dialogue is some variation of “I will kill all the Titans!” Even then (and has been brought up), more happens to and is shown of their characters in the main series, so the repetition (however slightly) is cut down.\\n\\n\r\nTwo, the frequency of the characters here compared to the main series is wildly different. In the main series, some of these characters only appear just in the first half or just in the second half, and some of these and other characters are killed off, eliminating them from the anime entirely. In Chuugakkou, nothing horrible ever happens to the characters and they are always around (since they are in the same class and clubs), so their traits are simply present more than usual.\\n\\n\r\nSo while the lack of depth for the characters can be explained away by the extreme focus on parody and comedy, the repetition cannot. The repetition causes Chuugakkou to lean on the same jokes with its cast time and again, reducing the efficacy of the parody and comedy it strives for.\\n\\n\r\nSOUND\\n\\n\r\nParody continues with the music employed by Chuugakkou.\\n\\n\r\nIn particular, the original soundtrack uses many of the same iconic pieces that the main series is known for. Perhaps obviously, the intense and melancholic tracks are nowhere near as impactful when compared to the main series, but they are just as awesome to hear. Plus, they contrast with the everyday happenings and the exaggerated reactions. This contrast adds yet another layer to the comedy, making the show that much more focused.\\n\\n\r\nThe voice-acting performances are nice in the sense that the actors and actresses who portray these characters in the main series return to portray these characters in this series. Yui Ishikawa, Yuki Kaji, and Marina Inoue reprise their roles as Mikasa, Eren, and Armin respectively to make the main-series fans feel as if they are at the Walls once more.\\n\\n\r\nThe voice-acting performances are not-so-nice in the sense that the characters do not have many chances to demonstrate their chops. Not as much yelling, screaming, and emotion goes on. They (obviously) sound the same as when they speak in the main series, but the performances simply do not stand out as anything special.\\n\\n\r\nThe opening theme (as one should guess) parodies the OP of the main series (right down to the subtle glance Mikasa gives Eren). Per usual, this iteration of the OP is not as intense, choosing a much happier and optimistic tone. The end of Chuugakkou’s OP makes this tone quite apparent with its less-than-serious lyrics and upbeat nature. As a parody song, it works. As a standalone song, it does not have the power and emotion to carry itself.\\n\\n\r\nThe ending theme is reminiscent of Attack on Titan’s second ED, but it does not feel like a parody of the track as the OP does. Following the mood of the show, the piece is quite lighthearted, filled with guitars and drums that seem to erupt from a makeshift garage band. The track does not have any catchy or memorable sections, unfortunately. Combined with its non-parody status, this ED ends up being subpar at best.\\n\\n\r\nENJOYMENT\\n\\n\r\nI am not sure how many of my readers know this, but I am a big fan of the main series. A few reasons make this so. One of the biggest – perhaps the biggest – is Mikasa.\\n\\n\r\nMikasa is one of my favorite female characters in anime, and, in this one, Mikasa was amazing throughout the season. I loved everything she did. Her nonchalant attitude, her incessant need to do everything with or about Eren, and her general adorableness and awesomeness all made me smile and laugh and be happy.\\n\\n\r\nThus, episode three was my favorite. Seeing Mikasa utterly depressed without Eren around, and then seeing her push Jean out of the way when Eren arrived made me laugh out loud. While her main-series counterpart is even better, Mikasa made this anime for me.\\n\\n\r\nWhile I do not like the rest of the cast nearly as much as I do Mikasa, a lot of them were fun, too. Krista being way too cute. Annie’s shyness. Sasha and Connie wanting food and acting dumb. Eren, however, not so much. A ginormous difference compared to the main series makes him a lot less cool, and the difference severely hurts the likability of his character.\\n\\n\r\nAnd, in order to make valid comparisons, this one gave me an easy excuse to watch a large chunk of the main series. Getting to rewatch the main series made me more than happy, but it also made it apparent how much weaker the school setting is. The magnitude and the intensity is a large part of what makes the main series so thrilling, and this one just cannot reach that same level with a bunch of junior-high kids. Mikasa or otherwise.\\n\\n\r\nShingeki! Kyojin Chuugakkou parodies its way to victory. The comedy is focused. The characters, while repetitive in behavior, are reminiscent of their main-series counterparts. And the art, music, and entertainment are strong in their own respective ways. The anime makes it hard to doubt just how clean it is.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, the parodic and comedic focus never wavers\\n\\n\r\nAnimation: Good, above average actual animation, mixed artistic direction, and reminiscent yet silly character designs\\n\\n\r\nCharacters: Fine, while repetitive, Mikasa, Eren, and the rest of the gang accentuate their main-series counterparts\\n\\n\r\nSound: Fine, okay OP, bad ED, good OST, okay VA performances\\n\\n\r\nEnjoyment: Good, Mikasa is amazing but she and everything else cause yearning for more of the original\\n\\n\r\nFinal Score: 7/10",
            "date": "2016-09-09T21:31:00+00:00",
            "helpful_count": 7,
            "mal_id": 228673,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=228673"
        },
        {
            "content": "Firstly, lots of others have said it, but I'm going to repeat them;\r\nDon't watch this unless you have watched the first season! If you do, you'll completely ruin it for yourself. \r\nAttack on Titan is a great anime, in my opinion, so seeing them do a parody with cutesy characters, I was really excited. \r\nThe intro is the same awesome tune with a bit of a spin to it. \r\nThe voices are the same as the anime too, so that makes it even better.\r\nIt shows a lot of happenings from the base anime in comedic ways. Like Eren proclaiming on his first day he willerase the Titans, shortly after being hit with a giant eraser. \\n\r\nMikasa is still obsessed with Eren. Sasha loves food. Ymir is really protective of Krista. Hange is still tormenting Levi.\\n\\n\r\nIf you love the series and want something fun to watch, definitely give this a go.",
            "date": "2016-11-07T01:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 233373,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mikame-",
                "username": "Mikame-"
            },
            "url": "https://myanimelist.net/reviews.php?id=233373"
        },
        {
            "content": "I'm going to make this short since my main reason for this review is to get people to understand my point that this anime might be milked to the limit, yet not really.\r\nSo what I want to point out right now is that people are leaving poor reviews for this anime, but let's get down to it point by point...\r\nStory - 9\r\nSo as people are stating, this is pretty much the \"same plot\" as the original Shingeki no Kyojin anime. But then why would I still rate it 7? \r\nYou see... As far as it's right that the plot is very alike it's still afact as well that this anime has a far more humorous aspect to the story. This creates a whole new dimension which is way too looked upon as this is actually a very clever and creative idea. \\n\\n\r\nArt - 8\\n\r\nThe art concept is not bad but rather somewhat medicore. I've seen better, I've seen worse. But for this plot and the whole chibi act this art is absolutely fitting and wouldn't be half as good with lovely realistic rivers and perfect looking building. \\n\r\nIn the end it's a great art for this type of anime, yet it's not as good as it could've been if the genre had been otherwise. Therefore I decided to give it a somewhat reasonable high grade.\\n\\n\r\nSound - 9\\n\r\nThe original opening was amazing, this new opening is very alike but again somehow manages to succed in replacing the old opening in a humourous way. In the end it's creative, funny and more importantly extremely enjoyable. I see absolutely no reason to call of this to a low grade as all the other sounds such as the ost and ending are all of the same caliber.\\n\\n\r\nCharacter - 10\\n\r\nThey were awesome and rad before right? I mean if you disliked the original, then why would you watch this? \\n\r\nJust as amazingly cool the characters were before, just as chill, funny and ironic are they now. They're literally the same chracters, but once again they're just turned into the comedy genre rather than the original action one. They're literally perfect and I see no way to improve them... Therefore It had to be a 10!\\n\\n\r\nEnjoyment - 9\\n\r\nAs I stated earlier, this might very well be milking the cow a bit much, but I mean hey! It's funny, it's entertaining and the 18 minutes that each episodes take is 18 minutes that passes by in what feels like 3-5. It's incredibly enjoyable as the story unfolds perfectly in sync with the comedy genre and they even use the main story as a leading thread. By any means this is undoubtfully the best parody of an anime we've had in a VERY long time and it deserves a top spot.\\n\\n\r\nOverall\\n\r\nI'm just going to leave a simple math calculation for my explanation on the 9\\n\r\n9 + 8 + 9 + 10 + 9 = 45 (simply the scores plused together)\\n\r\n45 / 5 = 9 (finding the average)\\n\r\nAnd there you have it. \\n\r\nThe reason this anime should have a higher rating than 1-3. Just because it's somewhat \"just another bottle of milk\", doesn't mean it can't be a great show with some amazing aspects to it.\\n\\n\r\nThanks for reading (Y)\\n",
            "date": "2015-12-20T18:57:00+00:00",
            "helpful_count": 6,
            "mal_id": 206203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3949083.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Hunail",
                "username": "Hunail"
            },
            "url": "https://myanimelist.net/reviews.php?id=206203"
        },
        {
            "content": "*This Review WILL contain Spoilers*\r\nI have to say that I was expecting a normal parody from this, but this show was far beyond a casual parody. It's full of character development that the anime or even the manga haven't particularly touched yet. Also the foreshadowing for events to come are actually rather brutal once you realise them. This is not an anime to watch if you're not up-to-date with Season 2 and perhaps even the manga, though the spoilers for the manga are a lot subtler.\r\n[POSSIBLE SPOILERS]\r\nShingeki! Kyojin Chuugakkou is actually pretty far ahead of even the Season 2 timeline of Shingeki no Kyojin andit quite excellently shows the characters of the original show as (decently) normal kids with everyday problems. In this show you can see much more clearly how there was and still are things between characters:\\n\r\nEren <--> Annie, Mikasa <--> Eren, Berthold --> Annie, Christa <--> Ymir and Reiner --> Christa\\n\r\nIt's fun to see these normally stone-faced heroes just be kids that have feelings towards one another and try to survive in school against bullies (Titans) and due to the way that Shingeki No Kyojin is made (it's not exactly a romance) this is probably the only way to give the viewers confirmation on how the characters truly feel.\\n\\n\r\n[EVEN MORE SERIOUS SPOILERS FOR SEASON 2 AND 3-4]\\n\r\nAnd on about the foreshadowing aspects of this anime, well let's say that when I realised that Armin can't stand the cold and his room is burning hot OR when I noticed how Annie wore the \"Femal titan\"-halloween mask and Berthold wore the \"Colossal titan\"-halloween mask I had a wide grin in my face. This show is a must-watch for Shingeki no Kyojin -fans, but ONLY if you're up-to-date with the manga. It heavily spoils even Season 2 events for Shingeki no Kyojin and manga-readers will undestand how extremely hot conditions are linked with Armin. And that moment when you realise that the ghost girl that helped Christa/Historia is actually Frieda Reiss, I have no idea how they came up with these parts, but they are incredible and bring a joy of realisation for the manga-readers.\\n\\n\r\nShingeki! Kyojin Chuugakkou is in my opinion a Great 9/10, because it's far more than just a parody. It handles the characters well and even without a full lenght story to tell it manages to entertain with each separate episode with its fantastic humour, fun animation, cute moments and top-notch foreshadowing and character development.",
            "date": "2017-06-24T06:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 250844,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6330912.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MiiQeX",
                "username": "MiiQeX"
            },
            "url": "https://myanimelist.net/reviews.php?id=250844"
        },
        {
            "content": "I absolutely adore this anime but it's not for everyone. In my opinion/experience you need to be a fan of both the original (at least the first season) and of the ridiculous fandom that exists around it. I spent most of the time laughing and really enjoying it where as it made my hubby just want to re-watch the first season of the original. I hope they do this for every season!\r\nThe story closely follows the first season but it really emphasizes some of the sillier elements. Things like Levi's cleaning and how Jean is a horse. \r\nThe art is adorable, character designs all gowith the original just cuter and chibi-er. Same for sound.\\n\\n\r\n10 of 10!",
            "date": "2018-04-06T12:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 277132,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6908771.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hikari-Are",
                "username": "Hikari-Are"
            },
            "url": "https://myanimelist.net/reviews.php?id=277132"
        },
        {
            "content": "Note: If you have not watched the original please do so to understand the plot and reference jokes that are thrown here an there. \r\nThis anime is a spin off of the original anime \"Attack On Titan\" this anime is filled with humor that can make your day if you're bored or feeling down. I found the characters enjoyable to the story. The characters are all diverse having their different intentions in junior high you can find humor and some romance here, if you're into what the original anime genre which are drama/dark fantasy/Post-Apocalyptic fiction genre then this anime anime isn't for you. If youhappen to enjoy a humor/slice of life anime with a bit of romance and want to try something new then check it out! There isn't much to lose as well since this anime is short. Overall I would totally recommend this anime.",
            "date": "2016-04-03T18:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 215406,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5312236.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/evensteventbh",
                "username": "evensteventbh"
            },
            "url": "https://myanimelist.net/reviews.php?id=215406"
        },
        {
            "content": "Warning possible Spoilers\r\nNow when an anime does get to a certain popularity there's always that chance it'll get a series that is made for the purpose of being a parody and of course AoT is part of that.\r\nAoT Junior High is basically some of the moments during season 1 that has been restyled as a school anime in a Chibi aspect so now you get to see your favourite characters in a more cuter look.\r\nNow before I watched Koro-sensi's Quest I watched this which was my first parody series of a popular show and it was actually pretty entertaining with the fact they decided tomake AoT a show about people fighting and dying from giant monsters known as Titans and somehow change it into something cute which was a definite surprise and it mostly works, most of the time it was entertaining, but there were some cringey moments and it definitely spoils some things for season 2 like Bertholdt wearing a colossal titan mask which surely isn't a dead give away.\\n\r\nIt definitely turns out like your usual school anime with the sports festival, running for council president, test of courage and even a cook off and along the way it manages to incorporate moments from the main series into this which actually played out pretty well.\\n\\n\r\nThe characters are basically comedy versions of themselves as the show really uses the aspects we thought were funny about them in the main series and make it their entire character in this like Sasha eating a lot of food, Mikasa's obsession with Eren really makes her out to be a really tense Yandere, Levi's cleanliness powers are certainly off the scale and then there's Reiner's and Ymir's obsession with Krista as they fight over for her.\\n\r\nThe show used these aspects to great effect and they worked really well although sometimes Eren's titan slaughtering behaviour did get on my nerves and I never really understood why Armin was always in the state of having a constant cold which just didn't make any sense and the fact they dressed him up in a bunny outfit just made him look like a trap which is something I didn't really want to see.\\n\\n\r\nI thought the artstyle was actually pretty good and it suited the characters well especially for some like Mikasa, Annie, Sasha, Connie, Armin, Eren and even Levi as it made them look really cute. The titans themselves looked somewhat stupidly cute as well since their not trying to eat people just their lunches so they would go around causing mischief for the students.\\n\\n\r\nI thought the comedy was pretty funny and they would constantly use stuff from the original series and turn them into jokes like Oluo biting his tongue while he monologues or Hange being a completely crazy person because of her interests in titans and I think this version of her is probably more crazy than the original.\\n\\n\r\nOverall I thought this was actually a pretty good parody, but I wouldn't recommend watching it until after you've seen the second season because it does easter egg some spoilers in here if you notice them, other than that I think AoT fans would definitely enjoy this.",
            "date": "2017-07-27T09:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 253952,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=253952"
        },
        {
            "content": "Spoiler Free Review\r\nSo, it's kind of obvious that Attack on Titan Junior High is just a cute little show that uses the characters from Attack on Titan. I will say that I had more fun in this show than I did with Koro-Sensei Quest. The characters were fun and it was nice to see them in a peaceful environment for a change. This show doesn't even try to be something that it isn't. This could be a good thing, but it stops this show from being a great show. It cannot be compared to the originals (obviously), but for an OVA, it's really fun. Ihad fun with it, and I'm sure most of you will too.",
            "date": "2019-01-29T16:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 300344,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6019498.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TwoSwordStyle",
                "username": "TwoSwordStyle"
            },
            "url": "https://myanimelist.net/reviews.php?id=300344"
        },
        {
            "content": "Very cute and with really good animation (though at times it was a little stilted and weird), if you liked the first season of Attack on Titan you'll enjoy all the little references to the show that are in this. Very funny but honestly one of the worst cases of character reductionism and Flanderization I've ever seen. If you can handle viewing the characters of Attack on Titan as one-dimensional and with none of the depth they enjoy in the original series, you'll like this. Its practically required to have seen the first season of Attack on Titan to understand many of the references inthis series.",
            "date": "2017-01-03T12:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 237345,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/235337.jpg",
                "scores": {
                    "animation": 10,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SenaMinomori",
                "username": "SenaMinomori"
            },
            "url": "https://myanimelist.net/reviews.php?id=237345"
        },
        {
            "content": "honestly watched the entire season to hear Kamiya Hiroshi's Levi voice in chibi form. Totally. Worth. It. noshame.\r\nIf you're an avid SnK fan and don't take yourself too seriously, you may find this amusing and worth giving it a try (each episode is only 17 minutes long!). There's honestly no real continuing \"story\" to the episodes but it is terribly cute seeing the SnK cast in a semi-alternate universe of a traditional school setting + relatively harmless titans. The art is also seriously adorable and although not as \"action packed\" as the original in terms of animation design, the art doesn't really falter in termsof the character and scene portrayals.\\n\\n\r\nWorth watching if you have a few hours to kill and want to watch some of your favorite characters in some pretty endearing situations!",
            "date": "2015-12-26T19:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 206907,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3704087.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ArtemiS2",
                "username": "ArtemiS2"
            },
            "url": "https://myanimelist.net/reviews.php?id=206907"
        },
        {
            "content": "Why does this exist? Don't get me wrong, transposing the characters of a serious action-horror series into a high school for a chibi comedy series might have worked if it was well written... but it wasn't. All we got were scenes and lines from the main series thrown into a high school context without much context. That's not funny, it's not even a joke. And it gets worse when the same \"jokes\" are repeated over and over, like the scene of Hange nearly getting her head chopped off. Did you laugh seeing it once? Well, you won't after the fifth freaking time!\r\nThrowaway lines from theseries, like Eren telling Mikasa that \"I'm not your little brother and not some snot-nosed toddler\" are also repeated several times throughout the series, and I just don't get why. They add nothing and feel really out-of place when added. Characters frequently have inconsistent personalities between scenes (especially Jean and Mikasa) as a result of the writers trying to combine the personalities of the original versions of the characters with the exaggerated weird personalities that the show is trying to give them.\\n\r\nWith that said, the Dodgeball episode was hilarious, and I love how adorable they made chibi-Armin. The best episode by far though was the Halloween special, which combines so many insane ideas and ends with such a stupid nonsensical resolution that I couldn't help but laugh... But as I said, the laughs were rare and most of the jokes kept being repeated.\\n\r\nIt also sucks that in this series, titans go to school just like humans (they eat people's lunch boxes instead of eating people), because it means that the school allowed Zoe Hange (one of their students) to kidnap and experiment on other students for science club. How would the parents feel about that?\\n\r\nIn short, it's a mostly unfunny, endlessly repetitive series with only two (really) good episodes. Oh, and one where Jean falls in love with two vegetables. 3/10 not recommended.",
            "date": "2018-09-05T14:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 288196,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6526526.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheLegendOfDan",
                "username": "TheLegendOfDan"
            },
            "url": "https://myanimelist.net/reviews.php?id=288196"
        },
        {
            "content": "Before I start I should probably make an important distinction. This is a loosely based Shingeki No Kyojin spin-off series, therefore in the (however unlikely) event that you watched this show without having watched the main anime, this review might not be for you, however I will be regarding the aspects of this show both in regards to the original show, and without. \r\nStory 6/10 \r\nThe story is basically an alternate more comedic version of the original SnK anime. Humanity exists in a confined space, due to the presence of Titans. In SnK Titans threaten humanity itself, in this show the humans school lunch. \r\nAlot more comedic and with a much more upbeat and softer tone, the story is entertaining, but not much else can be said about it, gets the job done. If you have not watched SnK then this story might be a bit silly and not really able to hold up on it's own. \\n\\n\r\nCharacters 6/10 \\n\\n\r\nThe cast is the SnK characters, but made in a chibi like design and shifted to a high-school setting. Character traits and personality are the same but are a bit more exaggerated and greatly applied in the various school situations to enhance comedic effect. Interactions with characters that never happened (or cannot happen) in the original SnK are present in this one. The show takes full advantage of the characters and creates some pretty funny sequences with them. I'd say that the characters are the meat and potatoes of the show since they are the key ingredient to making this show work. Finishing the show you might feel that you learned a bit more about the characters, and it's overall a pleasant change to see them in that setting.\\n\r\nHowever, If you haven't watched SnK then much like with the story, you are out of context and most of the comedic effect of the characters will be greatly diminished. \\n\\n\r\nArt 6/10\\n\\n\r\nThe aesthetic of the show is very fitting and appropriately transformed. Much like the opening credits everything is given more color a happier, campier look and an overall \"shrinkage\" if you think how Titanic (ba dum tss) SnK seems to feel. Characters much like the rest of the show are all drawn in chibi-like versions of themselves. Overall I'd say the show did a perfect job of transitioning the setting and characters of Snk to SnC without compromising any of the aesthetics and personality we come to expect from these characters. Motion looks fluid and various scenes and tension are executed pretty well. My rating here is more influenced on the technical aspect of the Art, at the end of the day it's nothing groundbreaking or unprecedented. \\n\\n\r\nSound 6/10 \\n\\n\r\nAgain much like everything else on this show, the soundtrack seems like a transformed version of the SnK soundtrack. There is epic orchestral music, a happier campier version of the 1st SnK opening, and pretty much what you would expect from SnK itself in terms of atmosphere. (Again just a bit different) \\n\\n\r\nEnjoyment 7/10\\n\\n\r\nIf you are a fan of SnK, patiently waiting for season 2, this will definitely get you your SnK fix without diminishing your appetite. There is definitely enjoyment to be had with watching the SnK cast in this alternate setting pulling of zany shenanigans and a pleasant change of tone from the original SnK. If you haven't watched SnK , then I really can't say if the show will be nearly as enjoyable as it was to me and other fans. \\n\r\nIn conclusion, SnC is a great spin-off both in concept and execution, it's a good way to refresh the characters but giving them a different spin, while filling some time until season 2 is here. However that being said the show by itself is nothing groundbreaking but it gets the job done\\n\\n\r\nOverall 6/10\\n\\n",
            "date": "2015-12-20T14:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 206170,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2736349.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yagyuu_Mugen",
                "username": "Yagyuu_Mugen"
            },
            "url": "https://myanimelist.net/reviews.php?id=206170"
        }
    ]
]