[
    [
        {
            "content": "This anime is not an ordinary or Cliché Sports anime. To tell you the truth, despite having a low score and bad picture displayed, I know you know what I mean you really wondered why too. But if you watch this anime It's too far from your expectation. \r\nTo put it simple for the overall about Baby Steps, it is one of the best, or a Masterpiece in Sports genre in Anime and a MASTERPIECE IN TENNIS. I'm not exaggerating, I'm telling the truth. If you are a fan or Realistic  or sports anime  then you'll probably love this show.\r\nHonestly the animation isgood, sound is good, enjoyment is pretty good, Realistic story is pretty damn good. Yeah, you will wondered why, why you can't stop watching every episode. \\n\\n\r\nThat's because it's realistic, unlike other Sports anime that you will wondered why they are already a good player and even already good player in just short period of time. But this, it took him year or probably years of Training and playing to become a good player. This is not a Magic sports anime that you know that  why he/she has that Ultra Sonic Power Attack. You wouldn't even get bored unlike other sports anime, it's like you will get addicted to it. \\n\\n\r\nThe romance is also slow and you would expect that romance will come out soon, it's like how we deal our love life in real life. Love life is not just a magic to pop up in your front instantly, it also the same way about this anime.  \\n\\n\r\nBy watching this, it is like a TENNIS 101 with an enjoyment it really gives you an idea how the tennis works, how the player works, and how a player felt during the game. It gives you a knowledge that Tennis is based in Physically, mentally, sociology, psychologically,  etc. This is what the anime is made for, is to make you appreciate the Tennis in realistic way. \\n\r\nI would say that this anime will never disappoint you nor will betray your enjoyment.",
            "date": "2014-06-16T03:19:00+00:00",
            "helpful_count": 131,
            "mal_id": 147207,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2028517.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/coffeeworld",
                "username": "coffeeworld"
            },
            "url": "https://myanimelist.net/reviews.php?id=147207"
        },
        {
            "content": "To be completely honest, I can’t begin to comprehend the lack of popularity surrounding Baby Steps. The title Baby Steps may often make people prolong watching this sensational series or even drop it completely. Baby Steps art style can push people away from watching it, but once you get past the art style you will be be engaged in this show.\r\nI will not go into full detail of the story, and will try to make this review nice and short. \r\nThis series is typically about an honour student Maruo Eiichirou, (also called Ei-chan for his exceedingly high grades) and he is living an unhappy life.A life of studying, to make his parents happy. But what this really making him happy? He decides to take up tennis, with having no prior experience in sport whatsoever. This is when his love for tennis, started to begin. It is also really provoking to see how, Maruo takes notes in his practices and how he involves his studying and note-taking into his matches. This is such a different character, to what we are used to seeing and Maruo’s potential as he trains and takes notes is infinite. \\n\\n\r\nStory 10/10:\\n\r\nBaby Steps does not follow the routine of every other cliché sports anime. It is such a rarity that you come across an anime with such an engaging story and cliffhangers that make you rushing to finish the next episode. As Maruo starts to play tennis, he finds that his lack of fitness is making it hard for him to improve and get better. He trains indefinitely to improve just hitting the tennis ball at first and then he gradually gets better as his fitness level rises. Baby Steps does a really good job engaging its audience, by taking a realistic approach on a sports anime. Maruo does not have super-human powers and gets professional instantly. You watch him grow on his journey from becoming a straight A student, to a person who finds passion in his life, that he never knew he has before. \\n\\n\r\nArt 8/10:\\n\r\nHas anyone ever told you to not judge a book by its cover? The same thing can be said for Baby Steps. The art style for it can often be misunderstood and make people score this series a lot lower score than it deserves. Once you get used to the different approach on the art, then you will sure be in for a surprise!\\n\\n\r\nCharacters 9/10:\\n\r\nBaby Steps does a magnificent job portraying all of the different characters, especially the relationships between Maruo, and his classmates and family. As this is a slow pacing anime, do not get turned off if it takes a while until you feel engaged. After every episode there are only more positive things to come and as you are watching Maruo grow as a tennis player he also grows fundamentally as a person in all aspects. The relationship between Maruo and his mother also grow throughout the series, as she sees how much Maruo is enjoying his studies and has finally found a hobby that peaks his interest. \\n\\n\r\nSound 8/10:\\n\r\nThe soundtrack in Baby Steps is not “ sensational “, but the sound does a great job in adding different atmospheres in certain situations. The opening song “ Believe in Yourself “ by Mao Abe fits the series just perfectly. It reinforces the idea that even though Maruo had never held a tennis racket before in his life, the amount of dedication and love that he had found for this sport would astonish, not only those around him, but himself as well.  The soundtrack fulfils its job well as setting the mood and tone in various settings. It can make a regular tennis match turn, intense and thought provoking in a matter of seconds. \\n\\n\r\nOverall 10/10:\\n\r\nI highly recommend this Anime to not only people who enjoy watching sports anime, but to everyone as well. Baby Steps takes a very different approach on a sports anime, and it deserves more recognition for how well the series went.\\n\\n",
            "date": "2015-01-01T13:01:00+00:00",
            "helpful_count": 87,
            "mal_id": 175601,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3919631.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Compete",
                "username": "Compete"
            },
            "url": "https://myanimelist.net/reviews.php?id=175601"
        },
        {
            "content": "Watching Baby Steps is like trying to learn how to ride a bike, an activity that may seem hard at first but will find its way eventually if you put your efforts through. But a bike isn’t without rules and similarly, Baby Steps has its own guidelines when it comes to tennis. For Maruo Eiichirou, a straight A-student, almost everything he has done in his life came with effort in order to become successful. And that’s no understatement when he has earned nicknames such as “All-A”. However, one thing he lack is a dream, a real goal in his life. After a faithful encounter oneday with popular student Takasaki Natsu, he may have just realized what it means to follow a dream.\\n\\n\r\nWritten by Hikaru Katsuki, the series is built on the foundation of tennis, a competitive sport of cunning nature. For Eiichriou, he quickly finds out that he isn’t really in shape when it comes to the nature of the sport. This is quickly realized during the first day when he joins a gym that Natsu is part of where he quickly succumbs to burnout. In retrospect, training for tennis is something completely new to him and requires a different perspective than studying. Luckily, he pays close attention with his precision and while lacking talent for the actual sport, Eiichriou’s observation skills earns him praise.\\n\\n\r\nPraise doesn’t come easy though on the field. In the beginning, Eiichriou learns the hard way not only during training sessions but also gets annihilated in actual competition against tennis prodigy Takuma Egawa. The rivalry between them is fairly fresh and simple though: Eiichriou simply wants to return one of his serves. And while he makes little success in the beginning, he is able to use his observational skills at first hand. By doing just that, others realize that the kid has potential because in tennis, it also takes more than just muscles and speed to outwit an opponent. Nonetheless, Eiichriou’s journey as a tennis player quickly becomes a routine schedule. Unlike others born with raw talent, he works his way up. Perhaps the show itself is synonymous when it comes to “baby steps”. Essentially, Eiichriou is taking those first steps to follow a dream. It’s no difference with prodigies or professionals already though. Even they started out as newbies and worked their way to the top of the game. For Eiichriou, his steps are easily worth noting for his persistence, integrity, and value.\\n\\n\r\nThroughout the show, Eiichriou has influence on other players even if he doesn’t notice it himself. This is clearly evidenced through his relationship with Takuma. While the latter essentially views him as an inferior opponent, he comes to acknowledge and even sets his mind back forth to becoming a professional tennis player. This influence is the seed to characterization and development. While some players lacks quality in this field compared to others, the main characters gets that firsthand. We witness this through strategic flashbacks and realistic revelations. And while plot twists aren’t prominent in the show, some scenarios can be surprising and strikingly influential. The show is also honest when it comes to development with a sincere plot. Eiichriou works his way up through his own ways such as taking notes on opponents and analyzing matches. His notebook contains full of diagrams and calculations with precision. In other words, he doesn’t take an easy way out and proves his worth with his unique skills. It shows that a good tennis player doesn’t always rely on their brawn but a clear mind can be just as dangerous on the field.\\n\\n\r\nThe journey to becoming a professional tennis player isn’t an easy road to take. Takuma and Natsu already knows this but Eiichriou quickly finds out as well. His first real match takes a lot out of him but Eiirchriou uses his skills, determination, and even a bit of luck to follow his dream. The way the show depict each of his opponent tests Eiirchriou as both a player and a person. In essence, opponents he faces makes him realize his strengths and weaknesses. And like most tennis players, each has their own different playing style. The show features this exclusively with certain characters with their unique gameplay gimmicks. Some of the more elite players in the tournament (depicted by the level of their seed) are also characterized by their reputation and even with flashbacks to show their testament. On the other hand, Natsu, the main female character suffers a bit when it comes to characterization. While her outer appearance seems to be of a cute girl, her personality fits more of a tomboy and even a clumsy side during her debut. Her interactions with Eiirchou can also seems awkward at times. This is evidenced during their first encounter when Natsu accidentally ruins Eiirchou’s notes because of her klutzy actions. Not to say she is a klutz though, because out on the field, she can really shine like a superstar. The relationship she has with Natsu is something I’d describe as innocent and charming. But at the same time, their connection isn’t entirely too focused when it comes to a personal level. It’s clearly shown (or at least implied) that Eiirchou has a crush on Natsu. On the other hand, it’s hard to say Natsu feels the same way for him. As the show focuses more on competition, the romance development between the duos is subtle and dense. There is also hints of a potential love triangle as another girl enters the picture. However, that territory is never explored. In the end, don’t expect this show to be some Romeo & Juliet love story.\\n\\n\r\nDespite the story being fictional, there is surprisingly amount of realism. The series shows Eiirchou’s life in his perspective and what’s like every day for him in the beginning. Whether at home or at school, it’s easy to realize the type of person he is – responsible, determined, and also persistent when it comes to anything. But on the field, tennis is explored dynamically in two ways. In one way, Eiirchou’s novice shows the viewers firsthand on the mechanics of the game such as the basic fundamentals. Terms such as love, ace, seed, lob, spin, volley, and among others are shown and explained in concise details. Then, there’s the actual explanation by outside parties and in Eiirchou’s notes relating to various strategies that are utilized. The show spends a decent amount of time in the beginning to let audiences who are unfamiliar with the game of tennis the general aspects. \\n\\n\r\nIndeed, the show is charming with a solid cast of characters and credible comedy. It understands the premise and fundamentally delivers that in the eyes of Eiirchou. But for the character himself, his personality can be a mixed bag. While some people may like his determined personality, his persistence can get annoying. It’s also easy to label him as the ‘nice guy’ type and someone hard to get out of the friend zone. As mentioned before, the show’s romance is dense and so is Natsu when it comes to her love life. Essentially, it focuses much time on Eiirchou’s advancement as a tennis player rather than his personal life. Shortcomings can also be hammered down to the comedy itself. Sometimes it feels flat. Other times, it’s oddly balanced, seems forced, and in general lacking with odd timings. Character dialogues also feels repetitive. And speaking of that, the story itself is also dealt this way. Based on manga, the adaptation is faithful but also has anime original material that neglects some important factors. As expected of Studio Pierrot, not everyone will get what they want. Luckily, a season 2 has been confirmed so expect new rivals and a whole continent of a journey for our tennis player to explore.\\n\\n\r\nVisual wise, the character designs are moderate. Nothing really stands out for the main character Eiirchou besides his haircut which almost looks like a rooster. On the other hand, Natsu is designed as a graceful girl with tomboyish characteristics. Her short hair and athleticism are clear demonstration of this. Other characters are designed with clarity. In particular though, Takuma stands out as a firm competitor and ironclad figure with his expressions. The animation for the backgrounds and interior designs of the game settings can be described as a mixed bag. Nothing stands out impressive as some game-play movements feels like washed out while other times has impressive camera angle features. The plus side is that the show doesn’t employ usage of shock footage or fan service to allure the audience. Instead, it’s simple and realistic enough to typify the show’s message.\\n\\n\r\nSoundtrack can be colorful and seems so on most occasions. During many matches, the OST is consistent to match with a game’s intensity. During more climatic moments, the show proves itself to be able to handle its way to convey the delivery. Most voice mannerisms seems standard though and nothing impressive. But if there’s one person to take notice of would be Takuma for his stoic nature. The ‘bad boy’ attitude he displays is clearly shown in his egoistic and arrogant voice in the beginning. Similarly, the OP and ED song illustrates a message in believing his motives. In fact, the final few words of the OP song mentions “believe in yourself” as a moral to follow one’s dreams from baby steps.\\n\\n\r\nBaby Steps is more or less underrated but can be memorable when it comes to a realistic journey. Eiirchou is a good example of that, a person with no natural skills but works hard in following his dreams through simple steps. His development as both a person and tennis player can be entrancing to watch. And as a role model, we can learn from him. On the other hand, his personal development with other characters isn’t as impressive when it comes to romance. In particular, Baby Steps spends most of its time at the tennis court with Eiirchou being the highlight. And despite not being mainstream, the series is a fine example of a tennis showcase. The first baby step begins with the swing of that racket.\\n",
            "date": "2014-09-21T11:43:00+00:00",
            "helpful_count": 75,
            "mal_id": 161385,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=161385"
        },
        {
            "content": "I've seen several sports-themed anime, and in my opinion this one of the two or three best.\r\nTo me, one of the most attractive aspects of this story is the method by which the protagonists attain their expertise at the sport.  Not a single character spends time meditating by standing under a waterfall.  No one ever packs up camping gear and hikes to remote areas in distant mountains for training (defeating bears and wildcats along the way.)  There is not a single \"secret\" or \"special\" move that \"magically defeats one's opponent.\r\nWhat stands out is the main character's ability to analyze not only hisopponent's strengths and weaknesses, but his own as well. You could call this \"effective reflection\", I guess.  Skill is invariably gained by realistic training activity and practice.\\n\\n\r\nSome facial expressions / reactions are \"over the top\", but do not materially detract from the story; some are funny.  After all, this is a story about an accomplished nerd transforming himself into an accomplished athlete.  The main protagonist's reactions/interactions with the main female protagonist are  consistent with their established characters.  The slowly developing romance between the two is realistic and believable.  Those looking for fan service will be disappointed, as there is none.\\n\\n\r\nThe strength of the story carries this anime, and even if your interest in tennis is zero, that fact will not detract from your enjoyment!\\n\\n\r\nBaby Steps 2 just started as part of the Spring 2015 anime line-up, and after viewing the first episode I have high hopes for the continuation of the Baby Steps story.  I will probably review it separately at a later date.   \\n\\n",
            "date": "2014-09-05T21:13:00+00:00",
            "helpful_count": 60,
            "mal_id": 159299,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/403907.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Davi3d",
                "username": "Davi3d"
            },
            "url": "https://myanimelist.net/reviews.php?id=159299"
        },
        {
            "content": "The shounen sports genre is often known for focusing primarily on the 'badassery' of the protagonist. Whether it'd take borderline supernatural powers, world-class talent, or the glorification of matches complete with equally badass rivals and an audience that's shocked out of their seat every 5 seconds, the series will always pull through with demonstrating that there is something special about what's going on. Protagonists are idols, absolutely extraordinary characters whom you watch from the side lines with awe. It's about the thrill. It's about the fantasy. \r\nBaby Steps is different. As indicated by the title, Maruo's tennis career is built steadily from the ground up,and we're there to see every crucial step that's taken for him to rise from an unathletic straight-A high school student to an aspiring tennis professional. From mild interest to inspiration, from inspiration to resolve, and finally from resolve to brutal matches and even more brutal training regimens, it's both a test of body and soul, and a journey to discover who he truly wants to be. That may sound dramatic for 'just a high school sports series', but Baby Steps actually takes the effort to make the progression natural and believable. After all, Maruo will have to throw away his academic studies and the 'safe route' of college to workforce in order to take tennis seriously. He doesn't even know if he's cut out for international competition, and he actually has to convince his parents that these are sound, rational decisions on his part. Yes, in case you haven't gotten the vibe yet, this is a series about becoming a professional. It's not just about winning matches and being badass. It's about falling in love with the sport and gaining the willingness to throw away everything in a gamble for a dream.  \\n\\n\r\nWhat makes this plotline work so well is the nature of the main character. Outside of having good reaction time and excellent eyesight, he's quite an everyday guy. His fitness is pretty average. He has no killer moves. Every victory is won through precise strategy, astute observation, and consistent execution that comes from practiced repetition. While this approach may sound boring on paper, it brings about the show's primary strength: because we learn virtually every aspect of tennis from the ground up with the protagonist, and because we get to see him apply practice to matches with calculated success, every match brings to fruition the satisfaction of having achieved success through hard work. There's a real sense of growth, and when he crushes opponents whom he previously would have been crushed by, it's a well-deserved outcome. Believe it or not, earned successes feel way more satisfying than god given talent. At least I think so. \\n\\n\r\nSo what about the actual matches? None of them last more than two episodes, and as I indicated earlier, Baby Steps is less about showcasing the thrilling wins of a match and more about what can be learned from each experience. But don't get the wrong idea; the matches are exciting! Every moment showcased throughout the matches is accompanied with tons of thought as Maruo adapts to each situation, and Baby Steps effectively shows that tennis is a dynamic sport with tons of mind games and research involved. Maruo collects data on his opponents' tendencies throughout the match, recognizes their forms, predicts what kinds of shots they're making fractions of a second beforehand, strategizes for quick turns in momentum, makes YOLO plays at crucial moments, and abuses every single technical and mental weakness he can observe to the fullest. More often than not, he's faced with opponents who have been playing tennis since they were five, and he has to fight tooth-and-nail with every trick in the book for every single point he gets. He takes on seemingly insurmountable challenges, and he actually loses a lot; it's awe-inspiring how well Maruo can collect himself and turn what would've been a morally crushing defeat into an invaluable experience to grow as a sports player. He never gives up, he rarely chokes, and he's eager to learn. He even takes extremely detailed notes (courtesy of his academic diligence) on everything possible to reflect upon during his free time. Again, it's success through a butt ton of hard work. \\n\\n\r\nNow let's take a few steps back and look at the overall picture. MyAnimeList has Baby Steps listed as a romance, but take that with a grain of salt, as the first season chooses to focus primarily on Maruo's growth as an athlete. Similarly, the character focus is on Maruo, with all the other characters playing a support role in his life story, including the female lead Natsu. They're good characters for sure, and Natsu in particular is a breath of fresh air with her charming personality and optimistic attitude, but you have to like the main character to even have a chance of liking this show. Thankfully, Maruo isn't too hard to like. He's pleasant, easily relatable, and makes a good impression despite his generic looks. Key word is relatable: this shounen protagonist isn't meant to be idolized. He's a guy that you may know in real life. Heck, he might even be just like you. Either way, it's through this sense of an everyday relatability that makes it feel like we're on this journey with him, and with every success comes an equally rewarding sense of accomplishment for both Maruo and the audience. \\n\\n\r\nAs usual, don't limit yourself too much in your choice of media. Not a fan of sports anime? Never watched tennis before? Me neither, and guess what, I really like this show! Don't hesitate to give Baby Steps an episode or two; it might just surprise you with its pleasant atmosphere and endearing characters. It's a good show.",
            "date": "2015-06-13T18:23:00+00:00",
            "helpful_count": 17,
            "mal_id": 190247,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2253295.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ZeroHumor",
                "username": "ZeroHumor"
            },
            "url": "https://myanimelist.net/reviews.php?id=190247"
        },
        {
            "content": "I'm a big fan of sports anime, and Baby Steps, for me it's one of the best that i've ever seen just for a reason: It shows us the reality about tennis.\r\nMaruo, the main character, isn't a genius. He is a character that focus in his control, and the \"feeling about tennis\" on him keep growing until one episode passes.\r\nFor me particularly, i think that i love it because i remember a bit of my old self when i play tennis. This anime give that feeling, that made me remember that isn't easy to become a great player, isn't easy to win matches. This animeshow us that for win, you need to train more, and that is the only way to get better.\\n\\n\r\nBecause of this realistic way to focus the anime, Baby Steps become so awesome, even in romance that have in the anime, things isn't this easy. The story is truly amazing and we can see clearly the grown of Maruo as a player as long as the matches passes.\\n\\n\r\nThe opening theme \"Believe in Yourself\" is amazing. The ending is pretty good too, the sound in generally is pretty good too. The art isn't the best but this don't make the show unwatchable, because isn't bad too.\\n\\n\r\nThis anime make you enjoy tennis in a realistic way, and this is what makes this so amazing, it's one amazing anime and i think that no one will be disappointed!",
            "date": "2014-09-21T11:56:00+00:00",
            "helpful_count": 10,
            "mal_id": 161387,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1560313.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Allen-KT",
                "username": "Allen-KT"
            },
            "url": "https://myanimelist.net/reviews.php?id=161387"
        },
        {
            "content": "Baby Steps is sports anime done right. No power ups, final bosses, character gimmicks, overpowered main characters, or formulaic plot.\r\nThe shonen battle-arena format is done so thoughtfully that it hardly feels like one at all. While the story ultimately consists of a generic underdog main character training and battling against increasingly stronger opponents, it manages to feel unique and refreshing due to its detailed and compelling portrayal of competitive tennis.\r\nThe underdog trope is used to successfully make Maruo's (the main character) foray into competitive tennis at a late age (sixteen) feel intimidating, challenging, and all the more impressive when he nails it. Maruo doesn't catchup to everyone else because he has prodigious talent or a super gimmick, he earns it though lots and lots of methodical practice and careful analysis of his every mistake and success. He isn't motivated by a desire to be the best, or his love for a girl, or avenging someone; he simply found a great community surrounding an activity that he truly enjoys, and he is inspired by the passion of his peers to try and become a better player. Maruo does have a love interest and she is part of his inspiration for playing tennis, but Maruo plays for himself.\\n\\n\r\nUnfortunately, it is hard to stay fully interested in a show that is entirely about tennis. While the show features a decent cast of characters, none of them are fleshed out at all.  The narrative is very impersonal and all of the characters are defined entirely by their tennis careers, which makes for little drama and boring character relations. The show establishes a few interesting relationships in the first episodes, but they are never developed later on. Maruo's drive to become a better player is the only thing moving the plot forward, there are no stakes (this is fixed somewhat later in the series) and no external events occur that change the course of the story or add new elements to the it. There's very little to break up the monotony of practicing and playing tennis to keep the show from feeling tiring and repetitive. You're never really left wondering what's coming next: it's always more tennis.\\n\\n\r\nWhere this show really shines, and where most sports shows SHOULD shine, is in its portrayal of its sport. The show is done in a limited third person point of view, meaning there is no narration but we get to hear our main character's thoughts and a take on his perspective. This makes for very exciting matches, where Maruo is constantly observing his opponent and trying to figure out what he is thinking. Maruo's thoughts are detailed and analytical, he makes challenging but believable estimates of his opponent's abilities and strategies, all backed by real data that he gathers mid-match. Maruo's powerful mental fortitude allows him to relentlessly try his hardest, and emotions are never central to any conflict. The matches are engaging and believable, by having realistic and complicated strategies, constant mind games between players, and the abuse of each players' strengths and weaknesses. The opponents are not gimmicky (except for one guy) and they are convincingly strong players - they don't have bigger muscles or special moves; they have specific skills and strengths that Maruo must find a winning strategy against, while they try to resist having their play-styles dismantled by Maruo's analytical prowess.\\n\\n\r\nBaby Steps has plenty of exciting moments that can last for episodes at a time, but there is very little to fill the void between matches. Maruo's relationship with Natsu is only developed in a few episodes, and by the end it still feels extremely awkward and superficial. He never has to face any legimitate problems other than tough opponents, he experiences no growth as a character outside of playing tennis, and there is practically nothing else going on in the story. Side characters contribute nothing, Maruo's school life is just an occasional backdrop, the opponents are one-dimensional in everything but their styles of tennis, and the plot is completely defined by Maruo's training and tournament schedule. \\n\\n\r\nIt's worth the watch for exciting tennis and viewing the growth of a player from newbie to amateur star, but that's about it. If Maruo wins his matches, he goes on to play more tennis, if he loses, he still plays more tennis. There's not a lot to keep you interested aside from the matches themselves. Some exploration into what it's like being a student trying to go pro (other than practicing a LOT), expanding on Maruo's incredibly simple relationships with all of the support characters, some actual development of his relationship with Natsu, or simply making Maruo a realistic teenager instead of an naive goodguy with infinite motivation and the most boring personal life imaginable would have made the story a lot more interesting.",
            "date": "2017-02-24T19:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 241318,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1364157.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/anaract",
                "username": "anaract"
            },
            "url": "https://myanimelist.net/reviews.php?id=241318"
        },
        {
            "content": "In short: Go watch it now, even if it's your first sports anime!\r\nOverall: Oh my gosh! Sports anime genre, you must forgive me for giving you the cold shoulder for so many years! This anime is quite simple, mostly straightforward with a clean premise - have fun and go pro at playing tennis, obviously. What it does differently is that it gives the viewer a very personal journey by explaining the game itself, by showing the multiple frustrations a person dedicated to a sport has to go through and by giving motive and fullness to most characters in the show. And, the way each episodebuilds anticipation, suspense and hooks you up to the next episode is incredible. This definitely opened my eyes to the genre and I hope it is not the only anime that gives this type of magnificent thrill. \\n\\n\r\nSome details: The art is a bit wobbly at times, but I find it pretty enjoyable. The OP & ED songs were nothing too great, but they were okay. As I said the story is simple, but played in a very original way with quite some twists and turns and keeping the viewer at an edge. I think even most of the extras are very well-built. I love how believable, even though a bit stiff at times, the MC is. Also, he recurringly breaks anime stereotypes in a very humanly way by not being too weak, whimpy or shy in certain key situations which made me feel really connected to him and his hurdles. I am not sure how interesting it would be for a person who knows a lot about tennis as this was my only touch with the game in my life, I believe it is very well put in comparison to other animes. There is not too much flashiness, but it's definitely a good thrill.",
            "date": "2015-07-18T14:55:00+00:00",
            "helpful_count": 8,
            "mal_id": 193760,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38352.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Flauen",
                "username": "Flauen"
            },
            "url": "https://myanimelist.net/reviews.php?id=193760"
        },
        {
            "content": "I really did try to like this series...\r\nThe single best thing about Baby Steps is Eiichirou, the central protagonist: great lengths are taken to establish that outside of his one talent, his skill comes entirely from analysis and excessive amounts of repetitious practice.  While in interactions he comes across as somewhat bland, he doesn't strain suspension of disbelief the way one might expect, because of how much time he spends practicing.  This reminded me a great deal of the title character from History's Strongest Disciple Kenichi, which in my opinion does this kind of underdog story a lot better.\r\nAside from him, Takuma isthe only other character that really stands out in the core cast; while he falls squarely into the 'rival with the troubled past' archetype, he serves as an interesting take on it, as his principal character flaw is quickly established as being his lack of motivation.  Every other character is too stock to really care much about.  \\n\\n\r\nNot helping this is the pacing: Ei's first match starts in episode 4, and gets wrapped up in episode 5.  This is the first time that the series actually has any kind of dramatic stakes.  Suffice it to say that the series thoroughly undercuts these by skipping over large chunks of the match, including what should have been a climactic ending.  The second major conflict doesn't come around until episode TEN.  Almost all of this time is spent either on Ei training, bland characters trying to banter with eachother, and, of course, gratuitously reusing footage.\\n\\n\r\nIt's this last one that finally made me drop the series.  Episode 9 has a flashback to establish Ei's opponent's backstory (he's the 'I was only able to learn how to do one thing so I learned how to do it really well' archetype).  Episode 10 reuses the ENTIRE FLASHBACK.  Every episode starts with at least a solid minute clipped from the end of the previous episode, almost never edited, so that every episode is really only 15 minutes or so long once you cut out the opening and ending.  Large chunks of these are devoted to either scenes of Ei practicing - sometimes members of the cast will provide commentary about how much potential Ei has - throwaway interactions between the characters that don't really help to give them more character, and occasionally a legitimately interesting bit of Tennis.  Repeated short scenes are given to showing that Ei's grades are starting to suffer - and by 'repeated', I mean 'several more after the point has already been made'.  \\n\\n\r\nThis isn't helped by the art style, which I intensely dislike.  The characters have eyes that are half the size of their face and eyebrows that would be in the middle of a normal person's forehead, several people look like someone used a Mii as a reference, and the animation quality is nothing to write home about even at the best of times.  The music only stood out to me on the occasions that it sounded alarmingly close to something one might hear in Wii Sports which coupled with the character designs made me wonder if I weren't having some kind of fever-dream after passing out during the tennis minigame.\\n\\n\r\nThe series has potential, but - ironically enough - its insistence on repetition buries it under a massive blanket of monotony.",
            "date": "2016-07-30T13:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 225441,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Camkitsune",
                "username": "Camkitsune"
            },
            "url": "https://myanimelist.net/reviews.php?id=225441"
        },
        {
            "content": "I loved this show.  I am not usually a big sports anime fan because most sports anime is shounen, and the typical shounen treatment is so over the top.  I did sit through many episodes of \"Prince of Tennis\" but I blame a friend who said \"it gets better\" (it didn't, not really). She shipped various guys, which might explain that.  ;)\r\nCompared to PoT this is a whole different world, and it's a lot closer to reality.  No sports anime can ever be truly realistic because it would be too boring, but Baby Steps tries its best.  There are nohyper-talented people who rarely need to practice here, no magic swings and power-ups to make the action pop off the screen, no artificially pumped up rivalries to add drama.\\n\\n\r\nOh, and lets get this out of the way, because the anime is miscategorized on MAL:  there's no romance either.  Not as anything worth mentioning.  Our hero Eiichiro doesn't even become conscious of having actual feelings for Natsu, the cute tennis player everyone adores; most we get is innuendo from his pal Kageyama who's playing the role of the usual nudge-nudge-wink-wink guy, which goes mostly over Ei-chan's head.  This anime is about tennis.\\n\\n\r\nStory:  Eiichiro is a regular guy, for whom nothing comes easy, and so he studies hard, and takes meticulous notes because that helps him learn.  But it's come to his attention that he doesn't get enough exercise, and since he saw a flyer for a local tennis club offering a free trial, he checks it out.  It becomes clear to him right away that he's in real sorry shape physically, a much younger and smaller kid laps him during warmup and he ends up passing out from the exertion.  But Natsu, much admired, cheerful tennis player, who once borrowed his notes and promptly spilled food all over them, encourages him to try again, and the offer for a free trial is still good since he never actually even got to hold a racket.  And so he works out for a week to not be quite as wimpy and then he tries again.  And somehow, he has fun.\\n\\n\r\nI really like the story line.  Eiichiro isn't super talented or even athletic, he's just a hardworking guy whose entire life basically consists of studying to be an A-student, who has no real passions.  One can easily see him become a salaryman, just another drone, without ever really enjoying himself.  Which would be too bad, since he's a really decent guy without a big ego.  But tennis changes all that for him.  And still, he remains who he was -- things don't come easy, and he keeps taking painstaking notes, analyzing every detail.  I can really empathize with him because that's the kind of person I am (less single-mindedly hardworking, but just as analytical).  Eiichiro has parents (!!!) who give a damn.  His coaches are not abusive but actually teach.  Nothing is magical here, but one can't but root for Eiichiro because he really works at it, and his successes never go to his head.\\n\\n\r\nArt:  My least favourite thing about this anime.  What the heck is it with Eiichiro's hair?  It makes him look like a chickenboy, and it remained distracting for all 25 episodes.  Also, while I appreciate the effort to not have only beautiful people in this anime, the way that was handled failed IMO; it looked like there were people from two different anime mixed together.  I later had a look at the manga, and it's not so bad there because we get more detail, but it's still not entirely successful, not a cohesive art style. The animation is fine, nothing horrible, nothing special.\\n\\n\r\nSound:  Peppy OP, decent ED, BGM a little repetitive but not annoying. Nothing really stands out.  The voice talent is competent, and I was happy to hear Sakurai Takahiro (Nabae), Namikawa Daisuke (Takuma) and Toriumi Kousuke (Coach Aoi).  I hadn't heard Murata Taishi (Eiichiro) consciously before, but will watch for him now; he had a lot to do here, and it never became boring during the internal monologues.\\n\\n\r\nCharacter:  Eiichiro is extremely well handled, we get to see every bit of his development because we hear much of his internal monologue.  On the other hand, everybody else falls a little short, including Natsu, and that's a shame.  She's basically treated like just a cheerful prop.  We find out more about the people Eiichiro's plays matches against than about her. There are a couple annoying sidekick characters; Eiichiro's friend Kageyama who starts out as the one who teases him about romantic feelings he doesn't even have yet, and totally useless, meek Sasaki who has a crush on Eiichiro, but can barely get herself to say good morning.  Every time she got screen time with her squeaky, shrill voice (sorry, Japan, I don't find that kawaii, but irritating), I couldn't wait for her to be gone.  The whole anime is a little sexist, because Natsu is a top seeded player and we get to see almost nothing of her, while we waste time on random male side characters who don't matter, and get too much Sasaki.  But that's Japan for you.\\n\\n\r\nI still enjoyed every minute of this, watching Eiichiro figure things out, and grow.  There's a second season to watch, and a much longer manga to read, yay.  If only more sports anime were like this.",
            "date": "2016-08-29T06:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 227862,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/127437.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pleochroic",
                "username": "pleochroic"
            },
            "url": "https://myanimelist.net/reviews.php?id=227862"
        },
        {
            "content": "Baby Steps is a very interesting and somewhat unique take on the regular sports anime.\r\nThe show follows highschooler Eiichirou, a complete newbie at tennis, who uses his hard-working and determined personality to quickly improve his skill, and rise to the level of the players he meets during his journey.\r\n-Story- 7/10\r\nThe story itself is nothing extraordinary. That doesn't mean it's bad in any way, but it isn't anything groundbreaking - it's just good.\r\n-Art and animation- 6/10\r\nThe art-style of the show is somewhat unique - different to the typical 'all hot guys' design that most sports anime these days tend to have. Although the art-style is nice,the animation is noticeably lackluster in some scenes. Usually it's nothing terrible, but there are some parts which might leave you wondering where the budget went.\\n\\n\r\n-Sound- 7/10\\n\r\nThe voice acting in this series is pretty good, and the sound effects make you feel like you're watching a real tennis match. The music is very difficult to review, as it's extremely subjective, but in my opinion it was nothing special or memorable.\\n\\n\r\n-Characters- 9/10\\n\r\nI think that the characters are probably the best part of this show. It actually has believable romance, which is rare for any kind of shounen anime. The main character, Eiichirou, is very likable. \\n\r\nThe supporting cast of this series is incredible, each character is extremely unique and well thought-out, not just a cliche 'great at this one particular move' as characters in sports anime tend to be. Most of them have clear motivations and well written character arcs.\\n\\n\r\nAll in all, this is a pretty good sports anime, with great characters, and it sets up an even better season 2.\\n\\n\r\n-Overall- 7/10",
            "date": "2016-08-16T15:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 226877,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3268381.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DeMilan",
                "username": "DeMilan"
            },
            "url": "https://myanimelist.net/reviews.php?id=226877"
        },
        {
            "content": "Baby steps seems very simplistic from the outside. From first impressions it is a general show about the protagonist Maruo and him fighting his way up the tennis ladder with a romance story thrown in. This however is simply not the case.\r\nWhat I love about Baby Steps is the characters are really what makes the story which is what is really unique about this show. The story is good but it is very general but the way it is executed by the characters is great which makes this very average story into a attractive and moreish tale. \r\nOne of the best things about this showis the relationship between Maruo and the main female protagonist, Natsu. What I like about them is their relationship feels so very real and what I find about some relationships in show is that the female character can sometimes feel a bit fake but this is not at all the case with Natsu. She acts like a normal girl would in terms of her relationship between her and Maruo. They don't treat her in the whole \"A GRILL SHE IS MYSTERIOUS AND WE DON'T KNOW WHAT SHE'S THINKING CUS SHE GRILL\". You see things from her side sometimes and it is clear what she wants. Of course I'm not saying woman aren't complicated because some are but what I like about this is that Natsu's feeling aren't dismissed until right at the end when they will inevitably go out and she shows how she  feels throughout the show.\\n\\n\r\nThe tennis aspect which could seem a bit overshadowed is still great. Maruos development in tennis is fascinating to watch and you genuinely feel for Maruo when he succeeds and fails. The mechanics of tennis are explored in depth quite a bit and it is always interesting to learn about something you thought was pretty simple. I may not have a lot to say about this but it's definitely on par with and if not better than the romance spectrum of the show. \\n\\n\r\nThe show looks very nice aesthetically and it's style really suits it. The Opening and Ending are both good the opening really grew on me (and they luckily use it in the second season as well)\\n\\n\r\nOverall these factor really come together to make the show an entertaining watch that caters to whatever you want. Good sports action or a good love story but I would watch it more for the sports action.\\n\\n\r\nI know many may dismiss this show as a \"love story with a bit of tennis in it\" but it isn't, while my review may give this impression do not mistake me. I prefer the tennis aspect of the show to the romance and I believe this show  is a good story of a developing athlete with a refreshing romance thrown in.",
            "date": "2015-08-27T05:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 197200,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4833262.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MalteseCartoons",
                "username": "MalteseCartoons"
            },
            "url": "https://myanimelist.net/reviews.php?id=197200"
        },
        {
            "content": "First of all this anime is all about tennis.\r\nWell about the story it's really interesting and the settings are on the spot. This anime shows how a goal can change someone. Facing all the hardship, working on your weakness and using your strength to grow. Pursuing your goal as your future in on the line.\r\nWhy do I want this anime is because\r\n- interesting\r\n- good story\r\n- outstanding characters\r\n- mind blowing\r\n- surprising\r\n- tactics\r\n- strategy\r\n- skills\r\n- romance\r\n- comedy\r\nThough anime is fantasy I don't really like it when it lacks reality. But other anime like Baby Steps will really get you to watch it.\r\nPlease watch.. Thank you..",
            "date": "2015-06-09T22:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 189976,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3858643.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dwolf",
                "username": "dwolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=189976"
        },
        {
            "content": "I am going to try and keep my review short yet informative.\r\nThis anime has come and replaced Prince of Tennis as the no. 1 tennis anime out there. For those of you who haven't watched PoT it's an anime that focuses on turning tennis into something supernatural in order to make it more entertaining to obviously watch. While it did excel in that area is wasn't realistic. If it didn't have that element it would have the popularity it has today. This anime on the other hand makes normal tennis extremely enjoyable to watch. Yes it is slightly exaggerated but not in a bad wayat all and not on the same wavelength as PoT. This has become one of my all time favourite anime and I will explain briefly below.\\n\\n\r\n[b]Story 10[/b]\\n\\n\r\nHonour student wants to get some exercise and chooses tennis as a hobby. Great storyline, very original (sarcasm in case your dense). Nevertheless it is very good at it. Nothing is unique here but it makes so enjoyable to watch and to this day I still am not sure what it is. Another great point is that the matches are also equally if not more entertaining to watch.\\n\\n\r\n[b]Art 9[/b]\\n\\n\r\nPretty standard nothing special. Has its odd moments where the proportioning is  a little iffy but nothing major. Not its best quality.\\n\\n\r\n[b]Sound 9[/b]\\n\\n\r\nI will confess that this score is based a lot on the opening. When I first heard it I rewatched it about 6 times before actually starting the series. Apart from that nothing really sticks out. Has good music during matches but because of how tense theya re you kind of forget about it as you are on the edge of your seat.\\n\\n\r\n[b]Character 10[/b]\\n\\n\r\nAgain nothing unique about the characters but what I really like is that they actually progress through the series. It isn't 25 episodes of people who are exactly the same (excluding looks) form beginning to end. There is actual character development, nothing crazy but enough for to not pull my hair out from frustration and that makes me happy.\\n\\n\r\n[b]Enjoyment 10[/b]\\n\\n\r\nHad my eyes glued to the monitor for 2 days and have had to wear glasses ever since...\\n\\n\r\n[b]Overall[/b]\\n\\n\r\nHad to buy glasses.",
            "date": "2015-09-04T15:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 197813,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/77497.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DMDetonator",
                "username": "DMDetonator"
            },
            "url": "https://myanimelist.net/reviews.php?id=197813"
        },
        {
            "content": "If you love Prince of Tennis series , you will also love Baby Steps . Both anime involved tennis of course . While Prince of Tennis have serious skill using , Baby Steps goes to a more realistic kind of way .\r\nStory:8\r\nFrom the first episode till the end , the story plot goes on just fine . Its was good . I enjoy it just fine .\r\nArt:9\r\nThe arts for Baby Steps are quite actually good for a sport genre . It did take my interest . The view of the arts are just beautiful .\r\nSound:9\r\nI love every of the voice actors . No voice actorthat ruined the show or anything . I also love the OP and ED of the anime . Especially the OP . Its a total of 9 for me .\\n\\n\r\nCharacter:9\\n\r\nEvery characters from Baby Steps have its on way . From Maruo to the rest of them . I like how Maruo take risk if he finds himself losing . I also love Takasaki Natsu . She is just too cute . Either way , the characters plot are just fine .\\n\\n\r\nEnjoyment:9\\n\r\nThe enjoyment for Baby Steps never make me bored or anything . It did a good job at keeping my interest . Never once did i feel Baby Steps bored me or even making me thinking of dropping it . Long story short , i enjoy the anime just fine .\\n\\n\r\nOverall:9\\n\r\nThis is one of the anime that makes me wanting more . Its actually quite ironic why the name of the anime is Baby Steps if you think about it .",
            "date": "2015-02-07T19:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 179909,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4425611.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ToshibaKenichi",
                "username": "ToshibaKenichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=179909"
        },
        {
            "content": "- This is a joint review of seasons 1 & 2 of Baby Steps. There will be mild spoilers. -\r\nOf all the sports anime I’ve seen so far (which is not actually a whole lot), Baby Steps is my first foray into tennis. Overall, I am pleasantly surprised at how good it is. Perhaps it’s because I’ve been watching team sports all this time and tennis is a single player sport, but it does feel like it did something different.\r\nFirst, let me just say that the main character Eiichiro (or Ei-chan) is not your typical sports protagonist. I mean sure, he’s another \"complete newbie\"-type whogets into a sport for the first time in high school, but unlike many other sports protagonists, he’s also an excellent student. Almost always, a sports protagonist is book dumb or at best average at school. On top of that, he is a meticulous note taker who is incredibly organized. These traits help him when it comes to playing tennis, and in a rather clever way, make it possible for the audience to get educated on the intricacies of tennis game play in a way that feels relatively natural. Watching him analyze his opponents and himself play tennis is easy to follow because of that. Oh, and his notes and handwriting are absolutely beautiful; a real joy to look at (if you care at all about typography and aesthetics like I do). It's really interesting seeing Eiichiro's methodical play style against opponents with wildly different styles and strengths, and in one case, someone who's very similar to him that proves to be his biggest challenge.\\n\\n\r\nAll of the rivals and opponents are great characters too in their own right for the amount of screen time they get. Instead of being exaggerated, over-the-top archetypes like they are in most other sports animanga, they feel very down-to-earth and likable. There are no massive jerks or characters who are made intentionally hateable because the author wanted an easy way to get people to root for the protagonist/main team. There are just young adults who are skilled at tennis (and possibly looking to become a professional athlete) but are otherwise pretty normal. Sure, even if some of them are a little aggressive, prickly, or rude, none of them are genuinely bad people. I think that’s a challenge in the sports because it’s not as easy to craft interesting, likable rivals as it is to make douchebags who happen to be skilled at a sport. When all the rivals are likable too, it makes for more compelling matches.\\n\\n\r\nMoving on from the characters, the other good thing is that because tennis is not a team sport and Eiichiro is not part of his school’s team, it also allows for a bit of freedom. Usually, time-wise, a sports animanga moves incredibly slowly because the author (and their fanbase) don’t want their favorite third years to move on before winning. A few might take that chance, but most do not, and those that do (like Diamond no Ace) take a while to get there. That means first years are first years for a long time, and it never gets to a point where playing in college or playing professionally is even considered by them. That’s obviously not the case here and the anime skips through time a lot faster than I’m used to. The pacing of the matches is also spot on. I've seen sports anime where the matches often get way too long and drag the pace to screeching halt, but the matches here never exceed three episodes. That means important matches get as much time as they need without ever feeling too long.\\n\\n\r\nSo, the main character’s somewhat unique personality, his rivals, and the actual tennis are praiseworthy, but that doesn’t mean Baby Steps has no flaws. The most noticeable thing is that the character design is pretty mediocre. Either it’s totally generic (all the girls, some of the supporting male characters) or it’s totally gonk (some of the other supporting male characters), and I just wish there was a more consistent style because it’s kind of distracting. In this case, I would’ve prefer that everyone looked more generic because the gonk is just plain ugly. In a sports anime, character designs are fairly important because characters in general are very important, so seeing it fail in this aspect is definitely disappointing. Oh, and Eiichiro’s little dinosaur-like hair spike? Yeah, that looks dumb. He would’ve looked fine enough without it, if a tad plain. To be fair though, the gonk designs happen less and less over time and it becomes more generic looking, which is fine cause it's still an improvement.\\n\\n\r\nThe other rather huge criticism I have is Natsuki Takasaki, Eiichiro’s love interest. Perhaps it’s asking a lot for a male dominated sports anime to have good female characters, but since Baby Steps has a romance tag and does at least try to have a slow burn romance subplot, I would expect the main female character to be at least a little well written. Hm... nope. She’s such a generic ~cute girl~ that it’s eye-roll worthy, and OF COURSE she just happens to be most beautiful girl in the grade. It’s way too power fantasy like in a genre and an anime that’s about an underdog. What’s worse is that she literally has no personality outside being the perfect, cute waifu who’s unconditionally supportive of the main character. Sure, she’s a tennis player who plans on going pro, but let’s just say that her entire motivation revolves around a boy. There’s no time spent with her outside of her supporting Eiichiro, not even her tennis playing. You would think that because Natsuki was kind of the one who pulled Eiichiro into tennis in the first place, that would at least discuss tennis...? Well, that doesn’t really happen (again, aside from her providing unconditional support for him). \\n\\n\r\nIt is even said again and again that Natsuki’s an ace tennis player and is at the top of the girl’s division, but we barely get to see it aside from her occasionally winning at the tail end of her matches. Does “show, not tell” ring a bell? She’s not a rival, so its not like it’d be revealing too much too early and ruining the tension of future games. There’s really no excuse. Narratively, she’s treated almost like a trophy for the main character. It’s not that the other (non-rival) supporting characters are written a whole lot better, just that, y’know, as the LOVE INTEREST, Natsuki needed way more depth and complexity than she got. It’s not until well into season two that we get even get the slightest glimpse into Natsuki’s character, and even that is pretty bare bones.\\n\\n\r\nThis nicely leads to the biggest disappointment of all - the romance. When one half of the pairing is written so one dimensionally, and when the relationship in general is so halfheartedly developed, that will naturally result in a weak romance. The question really is, did Baby Steps even need a romance? The answer is obviously no. Frankly, Natsuki’s so shallowly written that if you remove her entirely, it would baaarely make a difference. You could cut her out, her teeny tiny subplot, the romance, and all of her and Eiichiro’s interactions and lose maybe three episodes worth of meaningful content across both seasons. Then that time could’ve been spent on the more interesting rival characters.\\n\\n\r\nAs the love interest, something that would’ve really helped give Natsuki more depth is if she provided some insightful commentary on Eiichiro’s while he's in matches, being a tennis player since childhood, but all she does is say “do your best!” and other vaguely supportive things. If she was NOT a love interest in the first place and was just another supporting character like Eiichiro’s best friend and the megane girl who has a crush on him, then that would've been acceptable. Speaking of those two, they provide better commentary than Natsuki ever does, despite not knowing anything about tennis at all. Hell, even their subtle romance is better developed than Eiichiro and Natsuki's. It's kind of sad when the \"pair the spares\" ship gets more attention than the main romance. To be fair though, it does get a little better in season two when Eiichiro and Natsuki finally start going out. I can only hope that in future seasons, it gets more proper development. Coming from someone who hates romance in general, it is always weird when I say I want more focus on the romance, but that just means that I hate bad romances even more. Either have it or don't have it - just don't half ass it. The lost potential is a little upsetting... we could've seen Eiichiro and Natsuki advance as a badass young couple getting into professional sports together, but it is exceedingly one-sided. Considering that tennis is a single player sports and there's no need to develop a whole team of 6-8+ guys, I don't see why Natsuki couldn't have gotten more screen time and better writing.\\n\\n\r\nOne final rather nitpicky complaint I have is that the anime relies on flashbacks too much. Thankfully, this is tone downed a lot by season two, but still, it's really irritating getting flashbacks to something that happened literally two minutes ago. Also, the first twenty seconds to three minutes of an episode get lost to recapping the very end of the previous episode. It would be a much more efficient use of time to scrap that in future seasons and either skip having a pre-opening scene at all or have a new scene before the OP.\\n\\n\r\nOther than that, I have to say there’s nothing in particular that stands out either way. The voice acting is fine, the music is adequate although it sounds very much like every other sports anime I've seen, and the animation is nothing bad (aside from the creepy CGI puppets of random audience members) but nothing spectacular either. Overall, the production values are about as good as they need to be but do not stand out in any meaningful way, but like a few other things, they do get a little nicer in season two. It’s kind of a shame because aside from great characters/gameplay, the only place a sports anime can really shine is in its production values.\\n\\n\r\nFinally, Baby Steps' highly realistic depiction of tennis is refreshing. There are no flashy superpowers or dumb gimmicks, and the progression of Eiichiro’s skill feels natural and goes at the right pace. The groundedness of the tennis, in my opinion, gives it an edge over a lot of other sports anime. Even if there are unrealistic aspects, it’s disguised well and is not noticeable to people who are not very familiar with sports. Not that it isn’t fun to have super powers or gimmicks, but the realism combined with the superb exposition of the ins-and-outs of tennis adds an extra layer. It makes it easier to compare to and appreciate real life athletes (more for people who don't care for sports irl). \\n\\n\r\nSeason two ended on a hook for a very important tournament, and I am really looking forward to the season three. Overall, Baby Steps is a solid 8/10.",
            "date": "2017-03-05T20:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 241970,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3227687.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tpfang56",
                "username": "Tpfang56"
            },
            "url": "https://myanimelist.net/reviews.php?id=241970"
        },
        {
            "content": "Is this your firts spokon (sport anime)?\r\nIf it is I wouldn´t recomend you this anime, i enjoyed it, but i think there are many other better options (haikyuu!!!!!!!!!!!!!!!)\r\nWhat do you want to see in a spokon?\r\nIn my case i like spokon cause they are relly motivating, you feel you can do what you want and music is really important in order to do it. And this anime don´t have the sountrack i expected isn´t bad but you won´t rebember any song in a few month.\r\nNow now lets start MY review\r\nStory: 7\r\nSpokons don´t usually have a good story but this one have it, it isnt onlyget to the final tournament and win it (only). And the most important nd strange thing i have found on this anime is that characters aren´t absurdly overpowered, so it´s a good change.\\n\\n\r\nArt: 7\\n\r\nThis anime has an average animation but it isnt bad at all, specially when they are playing tennis. But after 25 episodes I still hating ei-chan´s hear.\\n\\n\r\nSound: 5\\n\r\nI´m really disappointed with this opint, I like the anime because of their musique, and this one don´t have a good music soundtrack so sometimes you can get bored of watching it\\n\\n\r\nCharacter: 9\\n\r\nthe main characters are really well explained, motivations and goal, thir past... but in my opinion there are other characters a little bit poor, like ei-chan class mate, they appear very ofter but don´´t have a story behind ei-chan. But all in all as many other spokons they know how to use characters to improve the anime\\n\\n\r\nEnjoyment: 7\\n\r\nAsi said somtemis i got bored and advanced some minutes, but it´s an enjoyable serie. Nothing more to say\\n\\n\r\nOverall: 6\\n",
            "date": "2015-06-16T13:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 190424,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mrjosemanuel2",
                "username": "mrjosemanuel2"
            },
            "url": "https://myanimelist.net/reviews.php?id=190424"
        },
        {
            "content": "Animation / Art : Probably the weakest aspect of the show, the back grounds are terrible and the spectators are completely static throughout the match. A number of the character designs are very goofy whilst others are completely normal creating a stark contrast that doesn’t really fit the theme of the show. Characters drawn from a distance begin to look like fleshy featureless blobs and there are some real issues when portraying depth. One minute Maruo will be at the back of the court and the next shot is framed over the net and makes it look like he is right next to it, whenit switches back he is once again at the back of the court.\\n\\n\r\nThe show is absolutely filled with still frame expositions that are not particularly eye catching. Single characters will have flowing reactions whilst the characters around them will have fixed expressions, making it look like an animated character was thrown into what should otherwise be a still frame. \\n\\n\r\nSound: Nothing special, the OP theme song is pretty nice. Other than that there really isn’t much to talk about here, some of the VA’s were pretty decent and others not so much. \\n\\n\r\nCharacters: Probably where most people are going to be divided on this show. Every character other than Maruo feels pretty flimsy in my opinion. Compared to a show like Haikyuu!! Where all of the cast members receive considerable development and we get to know the opponents well enough we almost don’t want them to lose, Baby Steps falls totally flat. We get a brief background of the opponents and a quick explanation of their quirk (some of which seem very out of place in the show) and other than there is no real attachment to the opponents at all. I never once felt conflicted about wanting the opponent to lose or any tension when Maruo had them on the ropes. \\n\\n\r\nThe supporting cast is slightly better developed but not really, it feels as if every character other than Maruo exists simply as a plot device to further his development. Maruo himself is a pretty interesting MC but not good enough to carry the show on his own.\\n\\n\r\nHajime no Ippo (HnI) is probably the most similar sports anime (the sport itself withstanding of course) you will find. HnI is significantly better on this front as all of the opponents are fleshed out and made into enjoyable characters. The supporting cast receive a lot more attention and clearly exist for reasons other than to provide advice and inspiration to a newbie.\\n\\n\r\nStory: I actually really liked that the show did not instantly turn Maruo into a total tennis bad ass who stomped everyone he met, and that he had to work hard over a long period of time to get anywhere. However the pacing did feel quite rushed as by the time the show reaches the double digits episode Maruo is relatively cruising until he comes up against opponents aiming to go professional. \\n\\n\r\nI also enjoyed that there were no ‘special powers’ and secret moves, and that Maruo had to out think his opponents to win. This is somewhat dampened by the fact his opponents usually had bad personality traits that allowed Maruo to exploit them to win in the end.\\n\\n\r\nIt really grated on me that the show explained the rules and terms of the game inside the first 6 or so episodes, then continued to repeat this information on still frame information dumps even past the half way mark. The show really beats you over the head with the rules and terms of the game (which aren’t even difficult to understand). The show at least uses newbies to the sport to factor this information into the show, but it still felt ham-fisted and unnecessary. \\n\\n\r\nThere are an awful lot of mid match flashbacks which really disrupt the pace and the start of the show is always a recap of the previous episode which feels unwarranted.\\n\\n\r\nConclusion: This show had way too many still frame expositions and flashbacks for me. The pacing was a little too fast in terms of actual time passed within the show and then way too slow in matches with constant pans to the supporting characters explaining what just happened.\\n\\n\r\nIf you're a sports anime lover you will probably enjoy this show. \\n\r\nIf you’re a sports anime fans but not a lover, whether you enjoy this show will come down to your ability to stomach all the issues i've outlined above.\\n\r\nIf you don’t like sports anime there is nothing this show will offer to you, Haikyuu!! Is far superior at appealing to non-sports anime fans and trumps Baby Steps in every aspect by a notable margin. \\n\\n\r\nThanks for reading, have a nice day :) \\n",
            "date": "2016-04-16T04:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 216476,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4406889.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Rauru_Kurido",
                "username": "Rauru_Kurido"
            },
            "url": "https://myanimelist.net/reviews.php?id=216476"
        },
        {
            "content": "Baby Steps... From the title, maybe you will think about some bitchy heroine and some shitty animations. But, it's not. It's purely about Tennis.\r\nWhy I like this series? Cause I'm a tennist player that start from highschool too, and I understand how tennis is not so popular on Asia, and how there is a kid there. And it's feel like it was real.\r\nLike any other review, this anime not like other sports, this anime use logic to tell te story, there is no shadow player like KNB, there is no some electricity on their eyes.\r\nThe first story tell us about Honor Student at some highschoolthat he think he lack of excersice, so he check out Tennis sport. And it tell how hard to become a pro player, that I want to be but its just a dream.\\n\\n\r\nThe animation is good, no annoying laziness from the animator. The opening is great too. The movement of the racket is realistic too. The movement of the player too.\\n\\n\r\nIf you think that Sports anime only have special moves and illogical sport, try this one!\\n\\n\r\nStory (10/10) Art  (8/10) Sound (9/10) Character (9/10) Enjoyment (10/10) Overall (9/10)\\n\\n\r\nOh yeah, the opening is great too!!",
            "date": "2015-01-04T02:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 176089,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1262005.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dedoyxp",
                "username": "dedoyxp"
            },
            "url": "https://myanimelist.net/reviews.php?id=176089"
        },
        {
            "content": "In Baby Steps, we see how Eiichirou Marou a diligent student who appears to have perfected his note taking through his studies, but has no apparent talent in sport attempts progress in the world of tennis. In contrast to most sports anime were we see the main character constantly developing new skills, this anime depicts nicely how a transferring a skill such as “note taking” to a new area can result in a valuable asset when combined with HARD WORK. \r\nThis doesn’t however result in him always having the upper hand; rather it allows him to analyse his opponents, adapting skilfully to different situations inorder to maximise the effectiveness of the skills he has already acquired through training to develop his game play.  \\n\\n\r\nNevertheless, having played tennis myself, a noticeable flaw in this anime is the lack of relevance given to the psychological pressure during key moments in tennis matches.  A sport show, which has undoubtedly done this in a superior fashion, is “One Outs”. This results in the matches having a linear atmosphere, which becomes quite noticeable towards the end of the season and could put off some people.\\n\\n\r\n However, as a whole this is an enjoyable sports shounen anime with a romantic subplot that will keep most people interested.\\n",
            "date": "2016-01-27T14:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 209483,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488853.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/boub",
                "username": "boub"
            },
            "url": "https://myanimelist.net/reviews.php?id=209483"
        }
    ],
    [
        {
            "content": "This anime is not an ordinary or Cliché Sports anime. To tell you the truth, despite having a low score and bad picture displayed, I know you know what I mean you really wondered why too. But if you watch this anime It's too far from your expectation. \r\nTo put it simple for the overall about Baby Steps, it is one of the best, or a Masterpiece in Sports genre in Anime and a MASTERPIECE IN TENNIS. I'm not exaggerating, I'm telling the truth. If you are a fan or Realistic  or sports anime  then you'll probably love this show.\r\nHonestly the animation isgood, sound is good, enjoyment is pretty good, Realistic story is pretty damn good. Yeah, you will wondered why, why you can't stop watching every episode. \\n\\n\r\nThat's because it's realistic, unlike other Sports anime that you will wondered why they are already a good player and even already good player in just short period of time. But this, it took him year or probably years of Training and playing to become a good player. This is not a Magic sports anime that you know that  why he/she has that Ultra Sonic Power Attack. You wouldn't even get bored unlike other sports anime, it's like you will get addicted to it. \\n\\n\r\nThe romance is also slow and you would expect that romance will come out soon, it's like how we deal our love life in real life. Love life is not just a magic to pop up in your front instantly, it also the same way about this anime.  \\n\\n\r\nBy watching this, it is like a TENNIS 101 with an enjoyment it really gives you an idea how the tennis works, how the player works, and how a player felt during the game. It gives you a knowledge that Tennis is based in Physically, mentally, sociology, psychologically,  etc. This is what the anime is made for, is to make you appreciate the Tennis in realistic way. \\n\r\nI would say that this anime will never disappoint you nor will betray your enjoyment.",
            "date": "2014-06-16T03:19:00+00:00",
            "helpful_count": 131,
            "mal_id": 147207,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2028517.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/coffeeworld",
                "username": "coffeeworld"
            },
            "url": "https://myanimelist.net/reviews.php?id=147207"
        },
        {
            "content": "To be completely honest, I can’t begin to comprehend the lack of popularity surrounding Baby Steps. The title Baby Steps may often make people prolong watching this sensational series or even drop it completely. Baby Steps art style can push people away from watching it, but once you get past the art style you will be be engaged in this show.\r\nI will not go into full detail of the story, and will try to make this review nice and short. \r\nThis series is typically about an honour student Maruo Eiichirou, (also called Ei-chan for his exceedingly high grades) and he is living an unhappy life.A life of studying, to make his parents happy. But what this really making him happy? He decides to take up tennis, with having no prior experience in sport whatsoever. This is when his love for tennis, started to begin. It is also really provoking to see how, Maruo takes notes in his practices and how he involves his studying and note-taking into his matches. This is such a different character, to what we are used to seeing and Maruo’s potential as he trains and takes notes is infinite. \\n\\n\r\nStory 10/10:\\n\r\nBaby Steps does not follow the routine of every other cliché sports anime. It is such a rarity that you come across an anime with such an engaging story and cliffhangers that make you rushing to finish the next episode. As Maruo starts to play tennis, he finds that his lack of fitness is making it hard for him to improve and get better. He trains indefinitely to improve just hitting the tennis ball at first and then he gradually gets better as his fitness level rises. Baby Steps does a really good job engaging its audience, by taking a realistic approach on a sports anime. Maruo does not have super-human powers and gets professional instantly. You watch him grow on his journey from becoming a straight A student, to a person who finds passion in his life, that he never knew he has before. \\n\\n\r\nArt 8/10:\\n\r\nHas anyone ever told you to not judge a book by its cover? The same thing can be said for Baby Steps. The art style for it can often be misunderstood and make people score this series a lot lower score than it deserves. Once you get used to the different approach on the art, then you will sure be in for a surprise!\\n\\n\r\nCharacters 9/10:\\n\r\nBaby Steps does a magnificent job portraying all of the different characters, especially the relationships between Maruo, and his classmates and family. As this is a slow pacing anime, do not get turned off if it takes a while until you feel engaged. After every episode there are only more positive things to come and as you are watching Maruo grow as a tennis player he also grows fundamentally as a person in all aspects. The relationship between Maruo and his mother also grow throughout the series, as she sees how much Maruo is enjoying his studies and has finally found a hobby that peaks his interest. \\n\\n\r\nSound 8/10:\\n\r\nThe soundtrack in Baby Steps is not “ sensational “, but the sound does a great job in adding different atmospheres in certain situations. The opening song “ Believe in Yourself “ by Mao Abe fits the series just perfectly. It reinforces the idea that even though Maruo had never held a tennis racket before in his life, the amount of dedication and love that he had found for this sport would astonish, not only those around him, but himself as well.  The soundtrack fulfils its job well as setting the mood and tone in various settings. It can make a regular tennis match turn, intense and thought provoking in a matter of seconds. \\n\\n\r\nOverall 10/10:\\n\r\nI highly recommend this Anime to not only people who enjoy watching sports anime, but to everyone as well. Baby Steps takes a very different approach on a sports anime, and it deserves more recognition for how well the series went.\\n\\n",
            "date": "2015-01-01T13:01:00+00:00",
            "helpful_count": 87,
            "mal_id": 175601,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3919631.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Compete",
                "username": "Compete"
            },
            "url": "https://myanimelist.net/reviews.php?id=175601"
        },
        {
            "content": "Watching Baby Steps is like trying to learn how to ride a bike, an activity that may seem hard at first but will find its way eventually if you put your efforts through. But a bike isn’t without rules and similarly, Baby Steps has its own guidelines when it comes to tennis. For Maruo Eiichirou, a straight A-student, almost everything he has done in his life came with effort in order to become successful. And that’s no understatement when he has earned nicknames such as “All-A”. However, one thing he lack is a dream, a real goal in his life. After a faithful encounter oneday with popular student Takasaki Natsu, he may have just realized what it means to follow a dream.\\n\\n\r\nWritten by Hikaru Katsuki, the series is built on the foundation of tennis, a competitive sport of cunning nature. For Eiichriou, he quickly finds out that he isn’t really in shape when it comes to the nature of the sport. This is quickly realized during the first day when he joins a gym that Natsu is part of where he quickly succumbs to burnout. In retrospect, training for tennis is something completely new to him and requires a different perspective than studying. Luckily, he pays close attention with his precision and while lacking talent for the actual sport, Eiichriou’s observation skills earns him praise.\\n\\n\r\nPraise doesn’t come easy though on the field. In the beginning, Eiichriou learns the hard way not only during training sessions but also gets annihilated in actual competition against tennis prodigy Takuma Egawa. The rivalry between them is fairly fresh and simple though: Eiichriou simply wants to return one of his serves. And while he makes little success in the beginning, he is able to use his observational skills at first hand. By doing just that, others realize that the kid has potential because in tennis, it also takes more than just muscles and speed to outwit an opponent. Nonetheless, Eiichriou’s journey as a tennis player quickly becomes a routine schedule. Unlike others born with raw talent, he works his way up. Perhaps the show itself is synonymous when it comes to “baby steps”. Essentially, Eiichriou is taking those first steps to follow a dream. It’s no difference with prodigies or professionals already though. Even they started out as newbies and worked their way to the top of the game. For Eiichriou, his steps are easily worth noting for his persistence, integrity, and value.\\n\\n\r\nThroughout the show, Eiichriou has influence on other players even if he doesn’t notice it himself. This is clearly evidenced through his relationship with Takuma. While the latter essentially views him as an inferior opponent, he comes to acknowledge and even sets his mind back forth to becoming a professional tennis player. This influence is the seed to characterization and development. While some players lacks quality in this field compared to others, the main characters gets that firsthand. We witness this through strategic flashbacks and realistic revelations. And while plot twists aren’t prominent in the show, some scenarios can be surprising and strikingly influential. The show is also honest when it comes to development with a sincere plot. Eiichriou works his way up through his own ways such as taking notes on opponents and analyzing matches. His notebook contains full of diagrams and calculations with precision. In other words, he doesn’t take an easy way out and proves his worth with his unique skills. It shows that a good tennis player doesn’t always rely on their brawn but a clear mind can be just as dangerous on the field.\\n\\n\r\nThe journey to becoming a professional tennis player isn’t an easy road to take. Takuma and Natsu already knows this but Eiichriou quickly finds out as well. His first real match takes a lot out of him but Eiirchriou uses his skills, determination, and even a bit of luck to follow his dream. The way the show depict each of his opponent tests Eiirchriou as both a player and a person. In essence, opponents he faces makes him realize his strengths and weaknesses. And like most tennis players, each has their own different playing style. The show features this exclusively with certain characters with their unique gameplay gimmicks. Some of the more elite players in the tournament (depicted by the level of their seed) are also characterized by their reputation and even with flashbacks to show their testament. On the other hand, Natsu, the main female character suffers a bit when it comes to characterization. While her outer appearance seems to be of a cute girl, her personality fits more of a tomboy and even a clumsy side during her debut. Her interactions with Eiirchou can also seems awkward at times. This is evidenced during their first encounter when Natsu accidentally ruins Eiirchou’s notes because of her klutzy actions. Not to say she is a klutz though, because out on the field, she can really shine like a superstar. The relationship she has with Natsu is something I’d describe as innocent and charming. But at the same time, their connection isn’t entirely too focused when it comes to a personal level. It’s clearly shown (or at least implied) that Eiirchou has a crush on Natsu. On the other hand, it’s hard to say Natsu feels the same way for him. As the show focuses more on competition, the romance development between the duos is subtle and dense. There is also hints of a potential love triangle as another girl enters the picture. However, that territory is never explored. In the end, don’t expect this show to be some Romeo & Juliet love story.\\n\\n\r\nDespite the story being fictional, there is surprisingly amount of realism. The series shows Eiirchou’s life in his perspective and what’s like every day for him in the beginning. Whether at home or at school, it’s easy to realize the type of person he is – responsible, determined, and also persistent when it comes to anything. But on the field, tennis is explored dynamically in two ways. In one way, Eiirchou’s novice shows the viewers firsthand on the mechanics of the game such as the basic fundamentals. Terms such as love, ace, seed, lob, spin, volley, and among others are shown and explained in concise details. Then, there’s the actual explanation by outside parties and in Eiirchou’s notes relating to various strategies that are utilized. The show spends a decent amount of time in the beginning to let audiences who are unfamiliar with the game of tennis the general aspects. \\n\\n\r\nIndeed, the show is charming with a solid cast of characters and credible comedy. It understands the premise and fundamentally delivers that in the eyes of Eiirchou. But for the character himself, his personality can be a mixed bag. While some people may like his determined personality, his persistence can get annoying. It’s also easy to label him as the ‘nice guy’ type and someone hard to get out of the friend zone. As mentioned before, the show’s romance is dense and so is Natsu when it comes to her love life. Essentially, it focuses much time on Eiirchou’s advancement as a tennis player rather than his personal life. Shortcomings can also be hammered down to the comedy itself. Sometimes it feels flat. Other times, it’s oddly balanced, seems forced, and in general lacking with odd timings. Character dialogues also feels repetitive. And speaking of that, the story itself is also dealt this way. Based on manga, the adaptation is faithful but also has anime original material that neglects some important factors. As expected of Studio Pierrot, not everyone will get what they want. Luckily, a season 2 has been confirmed so expect new rivals and a whole continent of a journey for our tennis player to explore.\\n\\n\r\nVisual wise, the character designs are moderate. Nothing really stands out for the main character Eiirchou besides his haircut which almost looks like a rooster. On the other hand, Natsu is designed as a graceful girl with tomboyish characteristics. Her short hair and athleticism are clear demonstration of this. Other characters are designed with clarity. In particular though, Takuma stands out as a firm competitor and ironclad figure with his expressions. The animation for the backgrounds and interior designs of the game settings can be described as a mixed bag. Nothing stands out impressive as some game-play movements feels like washed out while other times has impressive camera angle features. The plus side is that the show doesn’t employ usage of shock footage or fan service to allure the audience. Instead, it’s simple and realistic enough to typify the show’s message.\\n\\n\r\nSoundtrack can be colorful and seems so on most occasions. During many matches, the OST is consistent to match with a game’s intensity. During more climatic moments, the show proves itself to be able to handle its way to convey the delivery. Most voice mannerisms seems standard though and nothing impressive. But if there’s one person to take notice of would be Takuma for his stoic nature. The ‘bad boy’ attitude he displays is clearly shown in his egoistic and arrogant voice in the beginning. Similarly, the OP and ED song illustrates a message in believing his motives. In fact, the final few words of the OP song mentions “believe in yourself” as a moral to follow one’s dreams from baby steps.\\n\\n\r\nBaby Steps is more or less underrated but can be memorable when it comes to a realistic journey. Eiirchou is a good example of that, a person with no natural skills but works hard in following his dreams through simple steps. His development as both a person and tennis player can be entrancing to watch. And as a role model, we can learn from him. On the other hand, his personal development with other characters isn’t as impressive when it comes to romance. In particular, Baby Steps spends most of its time at the tennis court with Eiirchou being the highlight. And despite not being mainstream, the series is a fine example of a tennis showcase. The first baby step begins with the swing of that racket.\\n",
            "date": "2014-09-21T11:43:00+00:00",
            "helpful_count": 75,
            "mal_id": 161385,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=161385"
        },
        {
            "content": "I've seen several sports-themed anime, and in my opinion this one of the two or three best.\r\nTo me, one of the most attractive aspects of this story is the method by which the protagonists attain their expertise at the sport.  Not a single character spends time meditating by standing under a waterfall.  No one ever packs up camping gear and hikes to remote areas in distant mountains for training (defeating bears and wildcats along the way.)  There is not a single \"secret\" or \"special\" move that \"magically defeats one's opponent.\r\nWhat stands out is the main character's ability to analyze not only hisopponent's strengths and weaknesses, but his own as well. You could call this \"effective reflection\", I guess.  Skill is invariably gained by realistic training activity and practice.\\n\\n\r\nSome facial expressions / reactions are \"over the top\", but do not materially detract from the story; some are funny.  After all, this is a story about an accomplished nerd transforming himself into an accomplished athlete.  The main protagonist's reactions/interactions with the main female protagonist are  consistent with their established characters.  The slowly developing romance between the two is realistic and believable.  Those looking for fan service will be disappointed, as there is none.\\n\\n\r\nThe strength of the story carries this anime, and even if your interest in tennis is zero, that fact will not detract from your enjoyment!\\n\\n\r\nBaby Steps 2 just started as part of the Spring 2015 anime line-up, and after viewing the first episode I have high hopes for the continuation of the Baby Steps story.  I will probably review it separately at a later date.   \\n\\n",
            "date": "2014-09-05T21:13:00+00:00",
            "helpful_count": 60,
            "mal_id": 159299,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/403907.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Davi3d",
                "username": "Davi3d"
            },
            "url": "https://myanimelist.net/reviews.php?id=159299"
        },
        {
            "content": "The shounen sports genre is often known for focusing primarily on the 'badassery' of the protagonist. Whether it'd take borderline supernatural powers, world-class talent, or the glorification of matches complete with equally badass rivals and an audience that's shocked out of their seat every 5 seconds, the series will always pull through with demonstrating that there is something special about what's going on. Protagonists are idols, absolutely extraordinary characters whom you watch from the side lines with awe. It's about the thrill. It's about the fantasy. \r\nBaby Steps is different. As indicated by the title, Maruo's tennis career is built steadily from the ground up,and we're there to see every crucial step that's taken for him to rise from an unathletic straight-A high school student to an aspiring tennis professional. From mild interest to inspiration, from inspiration to resolve, and finally from resolve to brutal matches and even more brutal training regimens, it's both a test of body and soul, and a journey to discover who he truly wants to be. That may sound dramatic for 'just a high school sports series', but Baby Steps actually takes the effort to make the progression natural and believable. After all, Maruo will have to throw away his academic studies and the 'safe route' of college to workforce in order to take tennis seriously. He doesn't even know if he's cut out for international competition, and he actually has to convince his parents that these are sound, rational decisions on his part. Yes, in case you haven't gotten the vibe yet, this is a series about becoming a professional. It's not just about winning matches and being badass. It's about falling in love with the sport and gaining the willingness to throw away everything in a gamble for a dream.  \\n\\n\r\nWhat makes this plotline work so well is the nature of the main character. Outside of having good reaction time and excellent eyesight, he's quite an everyday guy. His fitness is pretty average. He has no killer moves. Every victory is won through precise strategy, astute observation, and consistent execution that comes from practiced repetition. While this approach may sound boring on paper, it brings about the show's primary strength: because we learn virtually every aspect of tennis from the ground up with the protagonist, and because we get to see him apply practice to matches with calculated success, every match brings to fruition the satisfaction of having achieved success through hard work. There's a real sense of growth, and when he crushes opponents whom he previously would have been crushed by, it's a well-deserved outcome. Believe it or not, earned successes feel way more satisfying than god given talent. At least I think so. \\n\\n\r\nSo what about the actual matches? None of them last more than two episodes, and as I indicated earlier, Baby Steps is less about showcasing the thrilling wins of a match and more about what can be learned from each experience. But don't get the wrong idea; the matches are exciting! Every moment showcased throughout the matches is accompanied with tons of thought as Maruo adapts to each situation, and Baby Steps effectively shows that tennis is a dynamic sport with tons of mind games and research involved. Maruo collects data on his opponents' tendencies throughout the match, recognizes their forms, predicts what kinds of shots they're making fractions of a second beforehand, strategizes for quick turns in momentum, makes YOLO plays at crucial moments, and abuses every single technical and mental weakness he can observe to the fullest. More often than not, he's faced with opponents who have been playing tennis since they were five, and he has to fight tooth-and-nail with every trick in the book for every single point he gets. He takes on seemingly insurmountable challenges, and he actually loses a lot; it's awe-inspiring how well Maruo can collect himself and turn what would've been a morally crushing defeat into an invaluable experience to grow as a sports player. He never gives up, he rarely chokes, and he's eager to learn. He even takes extremely detailed notes (courtesy of his academic diligence) on everything possible to reflect upon during his free time. Again, it's success through a butt ton of hard work. \\n\\n\r\nNow let's take a few steps back and look at the overall picture. MyAnimeList has Baby Steps listed as a romance, but take that with a grain of salt, as the first season chooses to focus primarily on Maruo's growth as an athlete. Similarly, the character focus is on Maruo, with all the other characters playing a support role in his life story, including the female lead Natsu. They're good characters for sure, and Natsu in particular is a breath of fresh air with her charming personality and optimistic attitude, but you have to like the main character to even have a chance of liking this show. Thankfully, Maruo isn't too hard to like. He's pleasant, easily relatable, and makes a good impression despite his generic looks. Key word is relatable: this shounen protagonist isn't meant to be idolized. He's a guy that you may know in real life. Heck, he might even be just like you. Either way, it's through this sense of an everyday relatability that makes it feel like we're on this journey with him, and with every success comes an equally rewarding sense of accomplishment for both Maruo and the audience. \\n\\n\r\nAs usual, don't limit yourself too much in your choice of media. Not a fan of sports anime? Never watched tennis before? Me neither, and guess what, I really like this show! Don't hesitate to give Baby Steps an episode or two; it might just surprise you with its pleasant atmosphere and endearing characters. It's a good show.",
            "date": "2015-06-13T18:23:00+00:00",
            "helpful_count": 17,
            "mal_id": 190247,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2253295.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ZeroHumor",
                "username": "ZeroHumor"
            },
            "url": "https://myanimelist.net/reviews.php?id=190247"
        },
        {
            "content": "I'm a big fan of sports anime, and Baby Steps, for me it's one of the best that i've ever seen just for a reason: It shows us the reality about tennis.\r\nMaruo, the main character, isn't a genius. He is a character that focus in his control, and the \"feeling about tennis\" on him keep growing until one episode passes.\r\nFor me particularly, i think that i love it because i remember a bit of my old self when i play tennis. This anime give that feeling, that made me remember that isn't easy to become a great player, isn't easy to win matches. This animeshow us that for win, you need to train more, and that is the only way to get better.\\n\\n\r\nBecause of this realistic way to focus the anime, Baby Steps become so awesome, even in romance that have in the anime, things isn't this easy. The story is truly amazing and we can see clearly the grown of Maruo as a player as long as the matches passes.\\n\\n\r\nThe opening theme \"Believe in Yourself\" is amazing. The ending is pretty good too, the sound in generally is pretty good too. The art isn't the best but this don't make the show unwatchable, because isn't bad too.\\n\\n\r\nThis anime make you enjoy tennis in a realistic way, and this is what makes this so amazing, it's one amazing anime and i think that no one will be disappointed!",
            "date": "2014-09-21T11:56:00+00:00",
            "helpful_count": 10,
            "mal_id": 161387,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1560313.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Allen-KT",
                "username": "Allen-KT"
            },
            "url": "https://myanimelist.net/reviews.php?id=161387"
        },
        {
            "content": "Baby Steps is sports anime done right. No power ups, final bosses, character gimmicks, overpowered main characters, or formulaic plot.\r\nThe shonen battle-arena format is done so thoughtfully that it hardly feels like one at all. While the story ultimately consists of a generic underdog main character training and battling against increasingly stronger opponents, it manages to feel unique and refreshing due to its detailed and compelling portrayal of competitive tennis.\r\nThe underdog trope is used to successfully make Maruo's (the main character) foray into competitive tennis at a late age (sixteen) feel intimidating, challenging, and all the more impressive when he nails it. Maruo doesn't catchup to everyone else because he has prodigious talent or a super gimmick, he earns it though lots and lots of methodical practice and careful analysis of his every mistake and success. He isn't motivated by a desire to be the best, or his love for a girl, or avenging someone; he simply found a great community surrounding an activity that he truly enjoys, and he is inspired by the passion of his peers to try and become a better player. Maruo does have a love interest and she is part of his inspiration for playing tennis, but Maruo plays for himself.\\n\\n\r\nUnfortunately, it is hard to stay fully interested in a show that is entirely about tennis. While the show features a decent cast of characters, none of them are fleshed out at all.  The narrative is very impersonal and all of the characters are defined entirely by their tennis careers, which makes for little drama and boring character relations. The show establishes a few interesting relationships in the first episodes, but they are never developed later on. Maruo's drive to become a better player is the only thing moving the plot forward, there are no stakes (this is fixed somewhat later in the series) and no external events occur that change the course of the story or add new elements to the it. There's very little to break up the monotony of practicing and playing tennis to keep the show from feeling tiring and repetitive. You're never really left wondering what's coming next: it's always more tennis.\\n\\n\r\nWhere this show really shines, and where most sports shows SHOULD shine, is in its portrayal of its sport. The show is done in a limited third person point of view, meaning there is no narration but we get to hear our main character's thoughts and a take on his perspective. This makes for very exciting matches, where Maruo is constantly observing his opponent and trying to figure out what he is thinking. Maruo's thoughts are detailed and analytical, he makes challenging but believable estimates of his opponent's abilities and strategies, all backed by real data that he gathers mid-match. Maruo's powerful mental fortitude allows him to relentlessly try his hardest, and emotions are never central to any conflict. The matches are engaging and believable, by having realistic and complicated strategies, constant mind games between players, and the abuse of each players' strengths and weaknesses. The opponents are not gimmicky (except for one guy) and they are convincingly strong players - they don't have bigger muscles or special moves; they have specific skills and strengths that Maruo must find a winning strategy against, while they try to resist having their play-styles dismantled by Maruo's analytical prowess.\\n\\n\r\nBaby Steps has plenty of exciting moments that can last for episodes at a time, but there is very little to fill the void between matches. Maruo's relationship with Natsu is only developed in a few episodes, and by the end it still feels extremely awkward and superficial. He never has to face any legimitate problems other than tough opponents, he experiences no growth as a character outside of playing tennis, and there is practically nothing else going on in the story. Side characters contribute nothing, Maruo's school life is just an occasional backdrop, the opponents are one-dimensional in everything but their styles of tennis, and the plot is completely defined by Maruo's training and tournament schedule. \\n\\n\r\nIt's worth the watch for exciting tennis and viewing the growth of a player from newbie to amateur star, but that's about it. If Maruo wins his matches, he goes on to play more tennis, if he loses, he still plays more tennis. There's not a lot to keep you interested aside from the matches themselves. Some exploration into what it's like being a student trying to go pro (other than practicing a LOT), expanding on Maruo's incredibly simple relationships with all of the support characters, some actual development of his relationship with Natsu, or simply making Maruo a realistic teenager instead of an naive goodguy with infinite motivation and the most boring personal life imaginable would have made the story a lot more interesting.",
            "date": "2017-02-24T19:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 241318,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1364157.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/anaract",
                "username": "anaract"
            },
            "url": "https://myanimelist.net/reviews.php?id=241318"
        },
        {
            "content": "In short: Go watch it now, even if it's your first sports anime!\r\nOverall: Oh my gosh! Sports anime genre, you must forgive me for giving you the cold shoulder for so many years! This anime is quite simple, mostly straightforward with a clean premise - have fun and go pro at playing tennis, obviously. What it does differently is that it gives the viewer a very personal journey by explaining the game itself, by showing the multiple frustrations a person dedicated to a sport has to go through and by giving motive and fullness to most characters in the show. And, the way each episodebuilds anticipation, suspense and hooks you up to the next episode is incredible. This definitely opened my eyes to the genre and I hope it is not the only anime that gives this type of magnificent thrill. \\n\\n\r\nSome details: The art is a bit wobbly at times, but I find it pretty enjoyable. The OP & ED songs were nothing too great, but they were okay. As I said the story is simple, but played in a very original way with quite some twists and turns and keeping the viewer at an edge. I think even most of the extras are very well-built. I love how believable, even though a bit stiff at times, the MC is. Also, he recurringly breaks anime stereotypes in a very humanly way by not being too weak, whimpy or shy in certain key situations which made me feel really connected to him and his hurdles. I am not sure how interesting it would be for a person who knows a lot about tennis as this was my only touch with the game in my life, I believe it is very well put in comparison to other animes. There is not too much flashiness, but it's definitely a good thrill.",
            "date": "2015-07-18T14:55:00+00:00",
            "helpful_count": 8,
            "mal_id": 193760,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38352.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Flauen",
                "username": "Flauen"
            },
            "url": "https://myanimelist.net/reviews.php?id=193760"
        },
        {
            "content": "I really did try to like this series...\r\nThe single best thing about Baby Steps is Eiichirou, the central protagonist: great lengths are taken to establish that outside of his one talent, his skill comes entirely from analysis and excessive amounts of repetitious practice.  While in interactions he comes across as somewhat bland, he doesn't strain suspension of disbelief the way one might expect, because of how much time he spends practicing.  This reminded me a great deal of the title character from History's Strongest Disciple Kenichi, which in my opinion does this kind of underdog story a lot better.\r\nAside from him, Takuma isthe only other character that really stands out in the core cast; while he falls squarely into the 'rival with the troubled past' archetype, he serves as an interesting take on it, as his principal character flaw is quickly established as being his lack of motivation.  Every other character is too stock to really care much about.  \\n\\n\r\nNot helping this is the pacing: Ei's first match starts in episode 4, and gets wrapped up in episode 5.  This is the first time that the series actually has any kind of dramatic stakes.  Suffice it to say that the series thoroughly undercuts these by skipping over large chunks of the match, including what should have been a climactic ending.  The second major conflict doesn't come around until episode TEN.  Almost all of this time is spent either on Ei training, bland characters trying to banter with eachother, and, of course, gratuitously reusing footage.\\n\\n\r\nIt's this last one that finally made me drop the series.  Episode 9 has a flashback to establish Ei's opponent's backstory (he's the 'I was only able to learn how to do one thing so I learned how to do it really well' archetype).  Episode 10 reuses the ENTIRE FLASHBACK.  Every episode starts with at least a solid minute clipped from the end of the previous episode, almost never edited, so that every episode is really only 15 minutes or so long once you cut out the opening and ending.  Large chunks of these are devoted to either scenes of Ei practicing - sometimes members of the cast will provide commentary about how much potential Ei has - throwaway interactions between the characters that don't really help to give them more character, and occasionally a legitimately interesting bit of Tennis.  Repeated short scenes are given to showing that Ei's grades are starting to suffer - and by 'repeated', I mean 'several more after the point has already been made'.  \\n\\n\r\nThis isn't helped by the art style, which I intensely dislike.  The characters have eyes that are half the size of their face and eyebrows that would be in the middle of a normal person's forehead, several people look like someone used a Mii as a reference, and the animation quality is nothing to write home about even at the best of times.  The music only stood out to me on the occasions that it sounded alarmingly close to something one might hear in Wii Sports which coupled with the character designs made me wonder if I weren't having some kind of fever-dream after passing out during the tennis minigame.\\n\\n\r\nThe series has potential, but - ironically enough - its insistence on repetition buries it under a massive blanket of monotony.",
            "date": "2016-07-30T13:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 225441,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Camkitsune",
                "username": "Camkitsune"
            },
            "url": "https://myanimelist.net/reviews.php?id=225441"
        },
        {
            "content": "I loved this show.  I am not usually a big sports anime fan because most sports anime is shounen, and the typical shounen treatment is so over the top.  I did sit through many episodes of \"Prince of Tennis\" but I blame a friend who said \"it gets better\" (it didn't, not really). She shipped various guys, which might explain that.  ;)\r\nCompared to PoT this is a whole different world, and it's a lot closer to reality.  No sports anime can ever be truly realistic because it would be too boring, but Baby Steps tries its best.  There are nohyper-talented people who rarely need to practice here, no magic swings and power-ups to make the action pop off the screen, no artificially pumped up rivalries to add drama.\\n\\n\r\nOh, and lets get this out of the way, because the anime is miscategorized on MAL:  there's no romance either.  Not as anything worth mentioning.  Our hero Eiichiro doesn't even become conscious of having actual feelings for Natsu, the cute tennis player everyone adores; most we get is innuendo from his pal Kageyama who's playing the role of the usual nudge-nudge-wink-wink guy, which goes mostly over Ei-chan's head.  This anime is about tennis.\\n\\n\r\nStory:  Eiichiro is a regular guy, for whom nothing comes easy, and so he studies hard, and takes meticulous notes because that helps him learn.  But it's come to his attention that he doesn't get enough exercise, and since he saw a flyer for a local tennis club offering a free trial, he checks it out.  It becomes clear to him right away that he's in real sorry shape physically, a much younger and smaller kid laps him during warmup and he ends up passing out from the exertion.  But Natsu, much admired, cheerful tennis player, who once borrowed his notes and promptly spilled food all over them, encourages him to try again, and the offer for a free trial is still good since he never actually even got to hold a racket.  And so he works out for a week to not be quite as wimpy and then he tries again.  And somehow, he has fun.\\n\\n\r\nI really like the story line.  Eiichiro isn't super talented or even athletic, he's just a hardworking guy whose entire life basically consists of studying to be an A-student, who has no real passions.  One can easily see him become a salaryman, just another drone, without ever really enjoying himself.  Which would be too bad, since he's a really decent guy without a big ego.  But tennis changes all that for him.  And still, he remains who he was -- things don't come easy, and he keeps taking painstaking notes, analyzing every detail.  I can really empathize with him because that's the kind of person I am (less single-mindedly hardworking, but just as analytical).  Eiichiro has parents (!!!) who give a damn.  His coaches are not abusive but actually teach.  Nothing is magical here, but one can't but root for Eiichiro because he really works at it, and his successes never go to his head.\\n\\n\r\nArt:  My least favourite thing about this anime.  What the heck is it with Eiichiro's hair?  It makes him look like a chickenboy, and it remained distracting for all 25 episodes.  Also, while I appreciate the effort to not have only beautiful people in this anime, the way that was handled failed IMO; it looked like there were people from two different anime mixed together.  I later had a look at the manga, and it's not so bad there because we get more detail, but it's still not entirely successful, not a cohesive art style. The animation is fine, nothing horrible, nothing special.\\n\\n\r\nSound:  Peppy OP, decent ED, BGM a little repetitive but not annoying. Nothing really stands out.  The voice talent is competent, and I was happy to hear Sakurai Takahiro (Nabae), Namikawa Daisuke (Takuma) and Toriumi Kousuke (Coach Aoi).  I hadn't heard Murata Taishi (Eiichiro) consciously before, but will watch for him now; he had a lot to do here, and it never became boring during the internal monologues.\\n\\n\r\nCharacter:  Eiichiro is extremely well handled, we get to see every bit of his development because we hear much of his internal monologue.  On the other hand, everybody else falls a little short, including Natsu, and that's a shame.  She's basically treated like just a cheerful prop.  We find out more about the people Eiichiro's plays matches against than about her. There are a couple annoying sidekick characters; Eiichiro's friend Kageyama who starts out as the one who teases him about romantic feelings he doesn't even have yet, and totally useless, meek Sasaki who has a crush on Eiichiro, but can barely get herself to say good morning.  Every time she got screen time with her squeaky, shrill voice (sorry, Japan, I don't find that kawaii, but irritating), I couldn't wait for her to be gone.  The whole anime is a little sexist, because Natsu is a top seeded player and we get to see almost nothing of her, while we waste time on random male side characters who don't matter, and get too much Sasaki.  But that's Japan for you.\\n\\n\r\nI still enjoyed every minute of this, watching Eiichiro figure things out, and grow.  There's a second season to watch, and a much longer manga to read, yay.  If only more sports anime were like this.",
            "date": "2016-08-29T06:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 227862,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/127437.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pleochroic",
                "username": "pleochroic"
            },
            "url": "https://myanimelist.net/reviews.php?id=227862"
        },
        {
            "content": "Baby Steps is a very interesting and somewhat unique take on the regular sports anime.\r\nThe show follows highschooler Eiichirou, a complete newbie at tennis, who uses his hard-working and determined personality to quickly improve his skill, and rise to the level of the players he meets during his journey.\r\n-Story- 7/10\r\nThe story itself is nothing extraordinary. That doesn't mean it's bad in any way, but it isn't anything groundbreaking - it's just good.\r\n-Art and animation- 6/10\r\nThe art-style of the show is somewhat unique - different to the typical 'all hot guys' design that most sports anime these days tend to have. Although the art-style is nice,the animation is noticeably lackluster in some scenes. Usually it's nothing terrible, but there are some parts which might leave you wondering where the budget went.\\n\\n\r\n-Sound- 7/10\\n\r\nThe voice acting in this series is pretty good, and the sound effects make you feel like you're watching a real tennis match. The music is very difficult to review, as it's extremely subjective, but in my opinion it was nothing special or memorable.\\n\\n\r\n-Characters- 9/10\\n\r\nI think that the characters are probably the best part of this show. It actually has believable romance, which is rare for any kind of shounen anime. The main character, Eiichirou, is very likable. \\n\r\nThe supporting cast of this series is incredible, each character is extremely unique and well thought-out, not just a cliche 'great at this one particular move' as characters in sports anime tend to be. Most of them have clear motivations and well written character arcs.\\n\\n\r\nAll in all, this is a pretty good sports anime, with great characters, and it sets up an even better season 2.\\n\\n\r\n-Overall- 7/10",
            "date": "2016-08-16T15:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 226877,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3268381.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DeMilan",
                "username": "DeMilan"
            },
            "url": "https://myanimelist.net/reviews.php?id=226877"
        },
        {
            "content": "Baby steps seems very simplistic from the outside. From first impressions it is a general show about the protagonist Maruo and him fighting his way up the tennis ladder with a romance story thrown in. This however is simply not the case.\r\nWhat I love about Baby Steps is the characters are really what makes the story which is what is really unique about this show. The story is good but it is very general but the way it is executed by the characters is great which makes this very average story into a attractive and moreish tale. \r\nOne of the best things about this showis the relationship between Maruo and the main female protagonist, Natsu. What I like about them is their relationship feels so very real and what I find about some relationships in show is that the female character can sometimes feel a bit fake but this is not at all the case with Natsu. She acts like a normal girl would in terms of her relationship between her and Maruo. They don't treat her in the whole \"A GRILL SHE IS MYSTERIOUS AND WE DON'T KNOW WHAT SHE'S THINKING CUS SHE GRILL\". You see things from her side sometimes and it is clear what she wants. Of course I'm not saying woman aren't complicated because some are but what I like about this is that Natsu's feeling aren't dismissed until right at the end when they will inevitably go out and she shows how she  feels throughout the show.\\n\\n\r\nThe tennis aspect which could seem a bit overshadowed is still great. Maruos development in tennis is fascinating to watch and you genuinely feel for Maruo when he succeeds and fails. The mechanics of tennis are explored in depth quite a bit and it is always interesting to learn about something you thought was pretty simple. I may not have a lot to say about this but it's definitely on par with and if not better than the romance spectrum of the show. \\n\\n\r\nThe show looks very nice aesthetically and it's style really suits it. The Opening and Ending are both good the opening really grew on me (and they luckily use it in the second season as well)\\n\\n\r\nOverall these factor really come together to make the show an entertaining watch that caters to whatever you want. Good sports action or a good love story but I would watch it more for the sports action.\\n\\n\r\nI know many may dismiss this show as a \"love story with a bit of tennis in it\" but it isn't, while my review may give this impression do not mistake me. I prefer the tennis aspect of the show to the romance and I believe this show  is a good story of a developing athlete with a refreshing romance thrown in.",
            "date": "2015-08-27T05:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 197200,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4833262.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MalteseCartoons",
                "username": "MalteseCartoons"
            },
            "url": "https://myanimelist.net/reviews.php?id=197200"
        },
        {
            "content": "First of all this anime is all about tennis.\r\nWell about the story it's really interesting and the settings are on the spot. This anime shows how a goal can change someone. Facing all the hardship, working on your weakness and using your strength to grow. Pursuing your goal as your future in on the line.\r\nWhy do I want this anime is because\r\n- interesting\r\n- good story\r\n- outstanding characters\r\n- mind blowing\r\n- surprising\r\n- tactics\r\n- strategy\r\n- skills\r\n- romance\r\n- comedy\r\nThough anime is fantasy I don't really like it when it lacks reality. But other anime like Baby Steps will really get you to watch it.\r\nPlease watch.. Thank you..",
            "date": "2015-06-09T22:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 189976,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3858643.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dwolf",
                "username": "dwolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=189976"
        },
        {
            "content": "I am going to try and keep my review short yet informative.\r\nThis anime has come and replaced Prince of Tennis as the no. 1 tennis anime out there. For those of you who haven't watched PoT it's an anime that focuses on turning tennis into something supernatural in order to make it more entertaining to obviously watch. While it did excel in that area is wasn't realistic. If it didn't have that element it would have the popularity it has today. This anime on the other hand makes normal tennis extremely enjoyable to watch. Yes it is slightly exaggerated but not in a bad wayat all and not on the same wavelength as PoT. This has become one of my all time favourite anime and I will explain briefly below.\\n\\n\r\n[b]Story 10[/b]\\n\\n\r\nHonour student wants to get some exercise and chooses tennis as a hobby. Great storyline, very original (sarcasm in case your dense). Nevertheless it is very good at it. Nothing is unique here but it makes so enjoyable to watch and to this day I still am not sure what it is. Another great point is that the matches are also equally if not more entertaining to watch.\\n\\n\r\n[b]Art 9[/b]\\n\\n\r\nPretty standard nothing special. Has its odd moments where the proportioning is  a little iffy but nothing major. Not its best quality.\\n\\n\r\n[b]Sound 9[/b]\\n\\n\r\nI will confess that this score is based a lot on the opening. When I first heard it I rewatched it about 6 times before actually starting the series. Apart from that nothing really sticks out. Has good music during matches but because of how tense theya re you kind of forget about it as you are on the edge of your seat.\\n\\n\r\n[b]Character 10[/b]\\n\\n\r\nAgain nothing unique about the characters but what I really like is that they actually progress through the series. It isn't 25 episodes of people who are exactly the same (excluding looks) form beginning to end. There is actual character development, nothing crazy but enough for to not pull my hair out from frustration and that makes me happy.\\n\\n\r\n[b]Enjoyment 10[/b]\\n\\n\r\nHad my eyes glued to the monitor for 2 days and have had to wear glasses ever since...\\n\\n\r\n[b]Overall[/b]\\n\\n\r\nHad to buy glasses.",
            "date": "2015-09-04T15:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 197813,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/77497.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DMDetonator",
                "username": "DMDetonator"
            },
            "url": "https://myanimelist.net/reviews.php?id=197813"
        },
        {
            "content": "If you love Prince of Tennis series , you will also love Baby Steps . Both anime involved tennis of course . While Prince of Tennis have serious skill using , Baby Steps goes to a more realistic kind of way .\r\nStory:8\r\nFrom the first episode till the end , the story plot goes on just fine . Its was good . I enjoy it just fine .\r\nArt:9\r\nThe arts for Baby Steps are quite actually good for a sport genre . It did take my interest . The view of the arts are just beautiful .\r\nSound:9\r\nI love every of the voice actors . No voice actorthat ruined the show or anything . I also love the OP and ED of the anime . Especially the OP . Its a total of 9 for me .\\n\\n\r\nCharacter:9\\n\r\nEvery characters from Baby Steps have its on way . From Maruo to the rest of them . I like how Maruo take risk if he finds himself losing . I also love Takasaki Natsu . She is just too cute . Either way , the characters plot are just fine .\\n\\n\r\nEnjoyment:9\\n\r\nThe enjoyment for Baby Steps never make me bored or anything . It did a good job at keeping my interest . Never once did i feel Baby Steps bored me or even making me thinking of dropping it . Long story short , i enjoy the anime just fine .\\n\\n\r\nOverall:9\\n\r\nThis is one of the anime that makes me wanting more . Its actually quite ironic why the name of the anime is Baby Steps if you think about it .",
            "date": "2015-02-07T19:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 179909,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4425611.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ToshibaKenichi",
                "username": "ToshibaKenichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=179909"
        },
        {
            "content": "- This is a joint review of seasons 1 & 2 of Baby Steps. There will be mild spoilers. -\r\nOf all the sports anime I’ve seen so far (which is not actually a whole lot), Baby Steps is my first foray into tennis. Overall, I am pleasantly surprised at how good it is. Perhaps it’s because I’ve been watching team sports all this time and tennis is a single player sport, but it does feel like it did something different.\r\nFirst, let me just say that the main character Eiichiro (or Ei-chan) is not your typical sports protagonist. I mean sure, he’s another \"complete newbie\"-type whogets into a sport for the first time in high school, but unlike many other sports protagonists, he’s also an excellent student. Almost always, a sports protagonist is book dumb or at best average at school. On top of that, he is a meticulous note taker who is incredibly organized. These traits help him when it comes to playing tennis, and in a rather clever way, make it possible for the audience to get educated on the intricacies of tennis game play in a way that feels relatively natural. Watching him analyze his opponents and himself play tennis is easy to follow because of that. Oh, and his notes and handwriting are absolutely beautiful; a real joy to look at (if you care at all about typography and aesthetics like I do). It's really interesting seeing Eiichiro's methodical play style against opponents with wildly different styles and strengths, and in one case, someone who's very similar to him that proves to be his biggest challenge.\\n\\n\r\nAll of the rivals and opponents are great characters too in their own right for the amount of screen time they get. Instead of being exaggerated, over-the-top archetypes like they are in most other sports animanga, they feel very down-to-earth and likable. There are no massive jerks or characters who are made intentionally hateable because the author wanted an easy way to get people to root for the protagonist/main team. There are just young adults who are skilled at tennis (and possibly looking to become a professional athlete) but are otherwise pretty normal. Sure, even if some of them are a little aggressive, prickly, or rude, none of them are genuinely bad people. I think that’s a challenge in the sports because it’s not as easy to craft interesting, likable rivals as it is to make douchebags who happen to be skilled at a sport. When all the rivals are likable too, it makes for more compelling matches.\\n\\n\r\nMoving on from the characters, the other good thing is that because tennis is not a team sport and Eiichiro is not part of his school’s team, it also allows for a bit of freedom. Usually, time-wise, a sports animanga moves incredibly slowly because the author (and their fanbase) don’t want their favorite third years to move on before winning. A few might take that chance, but most do not, and those that do (like Diamond no Ace) take a while to get there. That means first years are first years for a long time, and it never gets to a point where playing in college or playing professionally is even considered by them. That’s obviously not the case here and the anime skips through time a lot faster than I’m used to. The pacing of the matches is also spot on. I've seen sports anime where the matches often get way too long and drag the pace to screeching halt, but the matches here never exceed three episodes. That means important matches get as much time as they need without ever feeling too long.\\n\\n\r\nSo, the main character’s somewhat unique personality, his rivals, and the actual tennis are praiseworthy, but that doesn’t mean Baby Steps has no flaws. The most noticeable thing is that the character design is pretty mediocre. Either it’s totally generic (all the girls, some of the supporting male characters) or it’s totally gonk (some of the other supporting male characters), and I just wish there was a more consistent style because it’s kind of distracting. In this case, I would’ve prefer that everyone looked more generic because the gonk is just plain ugly. In a sports anime, character designs are fairly important because characters in general are very important, so seeing it fail in this aspect is definitely disappointing. Oh, and Eiichiro’s little dinosaur-like hair spike? Yeah, that looks dumb. He would’ve looked fine enough without it, if a tad plain. To be fair though, the gonk designs happen less and less over time and it becomes more generic looking, which is fine cause it's still an improvement.\\n\\n\r\nThe other rather huge criticism I have is Natsuki Takasaki, Eiichiro’s love interest. Perhaps it’s asking a lot for a male dominated sports anime to have good female characters, but since Baby Steps has a romance tag and does at least try to have a slow burn romance subplot, I would expect the main female character to be at least a little well written. Hm... nope. She’s such a generic ~cute girl~ that it’s eye-roll worthy, and OF COURSE she just happens to be most beautiful girl in the grade. It’s way too power fantasy like in a genre and an anime that’s about an underdog. What’s worse is that she literally has no personality outside being the perfect, cute waifu who’s unconditionally supportive of the main character. Sure, she’s a tennis player who plans on going pro, but let’s just say that her entire motivation revolves around a boy. There’s no time spent with her outside of her supporting Eiichiro, not even her tennis playing. You would think that because Natsuki was kind of the one who pulled Eiichiro into tennis in the first place, that would at least discuss tennis...? Well, that doesn’t really happen (again, aside from her providing unconditional support for him). \\n\\n\r\nIt is even said again and again that Natsuki’s an ace tennis player and is at the top of the girl’s division, but we barely get to see it aside from her occasionally winning at the tail end of her matches. Does “show, not tell” ring a bell? She’s not a rival, so its not like it’d be revealing too much too early and ruining the tension of future games. There’s really no excuse. Narratively, she’s treated almost like a trophy for the main character. It’s not that the other (non-rival) supporting characters are written a whole lot better, just that, y’know, as the LOVE INTEREST, Natsuki needed way more depth and complexity than she got. It’s not until well into season two that we get even get the slightest glimpse into Natsuki’s character, and even that is pretty bare bones.\\n\\n\r\nThis nicely leads to the biggest disappointment of all - the romance. When one half of the pairing is written so one dimensionally, and when the relationship in general is so halfheartedly developed, that will naturally result in a weak romance. The question really is, did Baby Steps even need a romance? The answer is obviously no. Frankly, Natsuki’s so shallowly written that if you remove her entirely, it would baaarely make a difference. You could cut her out, her teeny tiny subplot, the romance, and all of her and Eiichiro’s interactions and lose maybe three episodes worth of meaningful content across both seasons. Then that time could’ve been spent on the more interesting rival characters.\\n\\n\r\nAs the love interest, something that would’ve really helped give Natsuki more depth is if she provided some insightful commentary on Eiichiro’s while he's in matches, being a tennis player since childhood, but all she does is say “do your best!” and other vaguely supportive things. If she was NOT a love interest in the first place and was just another supporting character like Eiichiro’s best friend and the megane girl who has a crush on him, then that would've been acceptable. Speaking of those two, they provide better commentary than Natsuki ever does, despite not knowing anything about tennis at all. Hell, even their subtle romance is better developed than Eiichiro and Natsuki's. It's kind of sad when the \"pair the spares\" ship gets more attention than the main romance. To be fair though, it does get a little better in season two when Eiichiro and Natsuki finally start going out. I can only hope that in future seasons, it gets more proper development. Coming from someone who hates romance in general, it is always weird when I say I want more focus on the romance, but that just means that I hate bad romances even more. Either have it or don't have it - just don't half ass it. The lost potential is a little upsetting... we could've seen Eiichiro and Natsuki advance as a badass young couple getting into professional sports together, but it is exceedingly one-sided. Considering that tennis is a single player sports and there's no need to develop a whole team of 6-8+ guys, I don't see why Natsuki couldn't have gotten more screen time and better writing.\\n\\n\r\nOne final rather nitpicky complaint I have is that the anime relies on flashbacks too much. Thankfully, this is tone downed a lot by season two, but still, it's really irritating getting flashbacks to something that happened literally two minutes ago. Also, the first twenty seconds to three minutes of an episode get lost to recapping the very end of the previous episode. It would be a much more efficient use of time to scrap that in future seasons and either skip having a pre-opening scene at all or have a new scene before the OP.\\n\\n\r\nOther than that, I have to say there’s nothing in particular that stands out either way. The voice acting is fine, the music is adequate although it sounds very much like every other sports anime I've seen, and the animation is nothing bad (aside from the creepy CGI puppets of random audience members) but nothing spectacular either. Overall, the production values are about as good as they need to be but do not stand out in any meaningful way, but like a few other things, they do get a little nicer in season two. It’s kind of a shame because aside from great characters/gameplay, the only place a sports anime can really shine is in its production values.\\n\\n\r\nFinally, Baby Steps' highly realistic depiction of tennis is refreshing. There are no flashy superpowers or dumb gimmicks, and the progression of Eiichiro’s skill feels natural and goes at the right pace. The groundedness of the tennis, in my opinion, gives it an edge over a lot of other sports anime. Even if there are unrealistic aspects, it’s disguised well and is not noticeable to people who are not very familiar with sports. Not that it isn’t fun to have super powers or gimmicks, but the realism combined with the superb exposition of the ins-and-outs of tennis adds an extra layer. It makes it easier to compare to and appreciate real life athletes (more for people who don't care for sports irl). \\n\\n\r\nSeason two ended on a hook for a very important tournament, and I am really looking forward to the season three. Overall, Baby Steps is a solid 8/10.",
            "date": "2017-03-05T20:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 241970,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3227687.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tpfang56",
                "username": "Tpfang56"
            },
            "url": "https://myanimelist.net/reviews.php?id=241970"
        },
        {
            "content": "Is this your firts spokon (sport anime)?\r\nIf it is I wouldn´t recomend you this anime, i enjoyed it, but i think there are many other better options (haikyuu!!!!!!!!!!!!!!!)\r\nWhat do you want to see in a spokon?\r\nIn my case i like spokon cause they are relly motivating, you feel you can do what you want and music is really important in order to do it. And this anime don´t have the sountrack i expected isn´t bad but you won´t rebember any song in a few month.\r\nNow now lets start MY review\r\nStory: 7\r\nSpokons don´t usually have a good story but this one have it, it isnt onlyget to the final tournament and win it (only). And the most important nd strange thing i have found on this anime is that characters aren´t absurdly overpowered, so it´s a good change.\\n\\n\r\nArt: 7\\n\r\nThis anime has an average animation but it isnt bad at all, specially when they are playing tennis. But after 25 episodes I still hating ei-chan´s hear.\\n\\n\r\nSound: 5\\n\r\nI´m really disappointed with this opint, I like the anime because of their musique, and this one don´t have a good music soundtrack so sometimes you can get bored of watching it\\n\\n\r\nCharacter: 9\\n\r\nthe main characters are really well explained, motivations and goal, thir past... but in my opinion there are other characters a little bit poor, like ei-chan class mate, they appear very ofter but don´´t have a story behind ei-chan. But all in all as many other spokons they know how to use characters to improve the anime\\n\\n\r\nEnjoyment: 7\\n\r\nAsi said somtemis i got bored and advanced some minutes, but it´s an enjoyable serie. Nothing more to say\\n\\n\r\nOverall: 6\\n",
            "date": "2015-06-16T13:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 190424,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mrjosemanuel2",
                "username": "mrjosemanuel2"
            },
            "url": "https://myanimelist.net/reviews.php?id=190424"
        },
        {
            "content": "Animation / Art : Probably the weakest aspect of the show, the back grounds are terrible and the spectators are completely static throughout the match. A number of the character designs are very goofy whilst others are completely normal creating a stark contrast that doesn’t really fit the theme of the show. Characters drawn from a distance begin to look like fleshy featureless blobs and there are some real issues when portraying depth. One minute Maruo will be at the back of the court and the next shot is framed over the net and makes it look like he is right next to it, whenit switches back he is once again at the back of the court.\\n\\n\r\nThe show is absolutely filled with still frame expositions that are not particularly eye catching. Single characters will have flowing reactions whilst the characters around them will have fixed expressions, making it look like an animated character was thrown into what should otherwise be a still frame. \\n\\n\r\nSound: Nothing special, the OP theme song is pretty nice. Other than that there really isn’t much to talk about here, some of the VA’s were pretty decent and others not so much. \\n\\n\r\nCharacters: Probably where most people are going to be divided on this show. Every character other than Maruo feels pretty flimsy in my opinion. Compared to a show like Haikyuu!! Where all of the cast members receive considerable development and we get to know the opponents well enough we almost don’t want them to lose, Baby Steps falls totally flat. We get a brief background of the opponents and a quick explanation of their quirk (some of which seem very out of place in the show) and other than there is no real attachment to the opponents at all. I never once felt conflicted about wanting the opponent to lose or any tension when Maruo had them on the ropes. \\n\\n\r\nThe supporting cast is slightly better developed but not really, it feels as if every character other than Maruo exists simply as a plot device to further his development. Maruo himself is a pretty interesting MC but not good enough to carry the show on his own.\\n\\n\r\nHajime no Ippo (HnI) is probably the most similar sports anime (the sport itself withstanding of course) you will find. HnI is significantly better on this front as all of the opponents are fleshed out and made into enjoyable characters. The supporting cast receive a lot more attention and clearly exist for reasons other than to provide advice and inspiration to a newbie.\\n\\n\r\nStory: I actually really liked that the show did not instantly turn Maruo into a total tennis bad ass who stomped everyone he met, and that he had to work hard over a long period of time to get anywhere. However the pacing did feel quite rushed as by the time the show reaches the double digits episode Maruo is relatively cruising until he comes up against opponents aiming to go professional. \\n\\n\r\nI also enjoyed that there were no ‘special powers’ and secret moves, and that Maruo had to out think his opponents to win. This is somewhat dampened by the fact his opponents usually had bad personality traits that allowed Maruo to exploit them to win in the end.\\n\\n\r\nIt really grated on me that the show explained the rules and terms of the game inside the first 6 or so episodes, then continued to repeat this information on still frame information dumps even past the half way mark. The show really beats you over the head with the rules and terms of the game (which aren’t even difficult to understand). The show at least uses newbies to the sport to factor this information into the show, but it still felt ham-fisted and unnecessary. \\n\\n\r\nThere are an awful lot of mid match flashbacks which really disrupt the pace and the start of the show is always a recap of the previous episode which feels unwarranted.\\n\\n\r\nConclusion: This show had way too many still frame expositions and flashbacks for me. The pacing was a little too fast in terms of actual time passed within the show and then way too slow in matches with constant pans to the supporting characters explaining what just happened.\\n\\n\r\nIf you're a sports anime lover you will probably enjoy this show. \\n\r\nIf you’re a sports anime fans but not a lover, whether you enjoy this show will come down to your ability to stomach all the issues i've outlined above.\\n\r\nIf you don’t like sports anime there is nothing this show will offer to you, Haikyuu!! Is far superior at appealing to non-sports anime fans and trumps Baby Steps in every aspect by a notable margin. \\n\\n\r\nThanks for reading, have a nice day :) \\n",
            "date": "2016-04-16T04:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 216476,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4406889.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Rauru_Kurido",
                "username": "Rauru_Kurido"
            },
            "url": "https://myanimelist.net/reviews.php?id=216476"
        },
        {
            "content": "Baby Steps... From the title, maybe you will think about some bitchy heroine and some shitty animations. But, it's not. It's purely about Tennis.\r\nWhy I like this series? Cause I'm a tennist player that start from highschool too, and I understand how tennis is not so popular on Asia, and how there is a kid there. And it's feel like it was real.\r\nLike any other review, this anime not like other sports, this anime use logic to tell te story, there is no shadow player like KNB, there is no some electricity on their eyes.\r\nThe first story tell us about Honor Student at some highschoolthat he think he lack of excersice, so he check out Tennis sport. And it tell how hard to become a pro player, that I want to be but its just a dream.\\n\\n\r\nThe animation is good, no annoying laziness from the animator. The opening is great too. The movement of the racket is realistic too. The movement of the player too.\\n\\n\r\nIf you think that Sports anime only have special moves and illogical sport, try this one!\\n\\n\r\nStory (10/10) Art  (8/10) Sound (9/10) Character (9/10) Enjoyment (10/10) Overall (9/10)\\n\\n\r\nOh yeah, the opening is great too!!",
            "date": "2015-01-04T02:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 176089,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1262005.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dedoyxp",
                "username": "dedoyxp"
            },
            "url": "https://myanimelist.net/reviews.php?id=176089"
        },
        {
            "content": "In Baby Steps, we see how Eiichirou Marou a diligent student who appears to have perfected his note taking through his studies, but has no apparent talent in sport attempts progress in the world of tennis. In contrast to most sports anime were we see the main character constantly developing new skills, this anime depicts nicely how a transferring a skill such as “note taking” to a new area can result in a valuable asset when combined with HARD WORK. \r\nThis doesn’t however result in him always having the upper hand; rather it allows him to analyse his opponents, adapting skilfully to different situations inorder to maximise the effectiveness of the skills he has already acquired through training to develop his game play.  \\n\\n\r\nNevertheless, having played tennis myself, a noticeable flaw in this anime is the lack of relevance given to the psychological pressure during key moments in tennis matches.  A sport show, which has undoubtedly done this in a superior fashion, is “One Outs”. This results in the matches having a linear atmosphere, which becomes quite noticeable towards the end of the season and could put off some people.\\n\\n\r\n However, as a whole this is an enjoyable sports shounen anime with a romantic subplot that will keep most people interested.\\n",
            "date": "2016-01-27T14:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 209483,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488853.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/boub",
                "username": "boub"
            },
            "url": "https://myanimelist.net/reviews.php?id=209483"
        }
    ],
    [
        {
            "content": "I love the realism of this show. In terms of realistic tennis, I definitely put this over Prince of Tennis. But the only reason I like Prince of Tennis better is because it was a longer lasting series and I was more attached to the characters and story. But as far as tennis animes go, this is the best in my opinion in terms of realism. They don't incorporate bullshit shots like Drive B, they call outs and double faults, take into account the physical and mental part of the game, and they depict minute details on how to improve. I love how analytical Maruois too. It makes it very interesting to watch.",
            "date": "2015-11-18T06:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 203642,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ExilixE",
                "username": "ExilixE"
            },
            "url": "https://myanimelist.net/reviews.php?id=203642"
        },
        {
            "content": "If you've seen many sports anime, then you will definitely enjoy this as a refreshing take on the genre. If you're just starting to dip your toes into the genre, this won't be a bad one to start off with.\r\nFirst, it's for the reason that many reviewers have said before me, it's definitely more realistic and grounded than its peers. The MC did not immediately have the innate talent for it, but he has built it through training and experiences shown throughout the series. Not to mention, no character was extremely exaggerated or shown to be exhibiting super-human skills. There were just people who weretalented and then there were those who weren't.\\n\\n\r\nSecond, it's not a purely sports story. It's a romance, a slice of life, and a coming of age as well. It tackled different parts of the protagonist's life, like his school life and home life (albeit the latter comes only in passing and only became somewhat prominent by the end,) painting us a good picture of what kind of character he is. While it features an individual sport such as tennis, you will still see the camaraderie and relationship-building between the characters. Not everyone is antagonistic to each other all the time. Personally, I wondered if it was going to be a bit boring to be only following one character throughout the series (I was so used to team sports animes!) but I found it hard not to root for Ei-chan after seeing how much he has grown. \\n\\n\r\nThird, what I found most refreshing in this series is that the storytelling and the pacing is tight. If you're a veteran in sports anime, you'll know the struggle of dragging out a match until the very (frustrating) end. With this series, sometimes I'm surprised that the fight is over and dealt with all in the same episode! Baby Steps' 25 episode run is very satisfying. Honestly, I did not expect that I would end up bingewatching this show from episode 9 to 25 in one day, but I did! It's easy to get into it yet the matches are timed so right that you can actually pace yourself while watching it, too. \\n\\n\r\nFor the most part, while Eiichiro is frankly a bit of a boring character to follow, it's hard not to watch him and root for him as he grows right before our very eyes. Baby Steps is just the right title for such a series where we see our lead comes into his own.",
            "date": "2015-12-05T12:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 204856,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4981482.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/chiibug",
                "username": "chiibug"
            },
            "url": "https://myanimelist.net/reviews.php?id=204856"
        },
        {
            "content": "This anime was great overall; however, the repetitive animations and explanations regarding tennis were a bit too much.  I found myself skipping every few seconds especially when the explanations have already been said previously.  The plot had a nice direction however I feel that two seasons are not enough for the whole story of the main character’s journey as a fresh tennis player.  Romance arc is fine and you can want to look for more romance-focused-episodes, but this anime revolves more on the main story than the romance for the two main characters.\r\nA great watch to learn a bit more about tennis,but it will leave you wanting more by the end of the second season. \\n\r\nNote before watching this anime: This work is a bit of an old one, so do not expect to be sucked in by the visual animations and artworks.  Instead, watch the series for the plot and character development and skills progress, it would be much more fulfilling that way.  \\n",
            "date": "2016-07-20T02:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 224459,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5563555.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/leezodne",
                "username": "leezodne"
            },
            "url": "https://myanimelist.net/reviews.php?id=224459"
        },
        {
            "content": "Written January 24th, 2019:\r\nThis is just brief thought and ratings for the first season of Baby Steps. My full review on the series, seasons 1 and 2 are on the page for the second season.\r\nStory: 9 - Well written, occasional pacing issues, ie. dragging out the tennis matches forever.\r\nArt: 6 - Lots of reuse of the same footage over and over. It was not terrible, just noticeable.\r\nSound: 8 - Sold voice acting. The opening/closing music is great, the FX? Okay. Sounds like tennis.\r\nCharacter: 8 - Very good, some of the secondary characters are weak, the main ones shine.\r\nEnjoyment: 9 - If it were not forthe reuse of the art assets and pacing issues, would be a 10.\\n\r\nOverall: 8 - I love this show, I hope there is a season 3, but it would need to be announced in 2019, or it is unlikely.",
            "date": "2019-01-24T01:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 299900,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7578995.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Garebear68",
                "username": "Garebear68"
            },
            "url": "https://myanimelist.net/reviews.php?id=299900"
        },
        {
            "content": "So this is my third sports anime that I've watched (The others are Kuroko no Basket and Haikyuu) and I am starting to fall in love with Sports anime. Usually, the genre of anime I usually watch are action and romance, but then I always give other genres a chance, maybe to relate with a lot more anime fans.\r\nIt starts of with a boy named Eiichiro Maruo, a smart and diligent student who doesn't really enjoy life. I mean, yes, he is a happy person, but he doesn't really have a hobby. I don't think writing notes is considered his hobby. It's just from hispersonality. One day, he wanted to exercise and wanted to try out a sport. That sport was (Obviously) tennis.\\n\\n\r\nBaby Steps is one of those sports anime series done right... In terms of build up from a weak character gradually developing into one of the best tennis players in the world. From other sports anime I've watched, they mostly start of with a character that already has a skill that he is good at, but the problem is the usage of that skill so he has to improve. This anime is different and much more realistic.\\n\\n\r\nWhat I truly like from this anime is how simple it is. It doesn't try to complicate itself. Sports anime like this are easily enjoyable. Not just that, this is probably one of the most well-paced sports anime I've ever seen. So there's not a moment where you'll feel bored (When it's slow-paced) and even if they skipped some parts in a tennis battle or skipping some tennis practice, I feel like they did the right decision to do so. They only show some parts where the thrill is at and/or where it's enjoyable to watch which I really like.\\n\\n\r\nI know that MAL also classify this show as \"Romance,\" but it's not heavily on romance. This show focuses heavily on sports, but there are indeed some romantic parts. Just don't expect a lot of its romance.\\n\\n\r\n8/10 for the story is a very good score, so if that isn't \"very good\" to you, translate it to a score that you consider it as \"very good.\" I didn't increase the score to 9 or 10 because it didn't conclude the series and this isn't really new. I just appreciate how well-paced this anime is.\\n\\n\r\nThe animation is good. Not bad. This anime doesn't really show smooth moments unlike other sports anime I've seen. It's usually rough. This anime also suffer from still frames, but they use this to visualize where the ball went, so it doesn't really bother me.\\n\\n\r\nWhat bothers me the most has to be it's art style. Eiichiro Maruo is good looking, but his rooster-hair bothers me the most... at first. I got used to it after watching more episodes of this anime. Most of it's female characters are really drawn well, but for the male characters especially the ones who are just supporting, the art style is weird. It has to be on how the nose is drawn. Most of their noses look like Squidward from Spongebob Squarepants and there are some noses where it's wide.\\n\\n\r\nFor the soundtrack, most of it's OST just makes you get pumped up, but I don't think it's as thrilling as some OST I hear from other sports anime. It's hard to explain (I do admit that I suck at explaining OSTs). It's just that I feel like it's \"lacking.\" For the opening theme and ending theme, I love it. They're catchy and it really makes you pump up for this show.\\n\\n\r\nFor the characters, they're enjoyable. The character development is really done right. You will see Maruo on how he develops with his friends and family and almost all of them aren't useless to him. I do admit that the characterization isn't perfect. Some of them end up being cliche like Takuma being one of your typical badass. Still, what really matters is how they change the story of Maruo and that's what made this show good.\\n\\n\r\nOverall, if you hate sports anime that rigs matches (In terms of pacing and how long the match is) or hate sports anime that are unrealistic, stop right there and try watching this anime. This sports anime doesn't really bring nothing new to the table for some, but this is new to me because this is only my third sports anime. If you love tennis (Or played some tennis before), I HIGHLY recommend this show.\\n\\n\r\nScore: 8/10",
            "date": "2015-12-11T06:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 205243,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4435225.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FurankuSan",
                "username": "FurankuSan"
            },
            "url": "https://myanimelist.net/reviews.php?id=205243"
        },
        {
            "content": "Baby Steps does a number of unique things in the way it tells its story. Nothing is predictable, and the pacing is actually very good given that the story spans several years. I didn't go in with any expectations except a general idea that an anime rated 8 should be good enough to watch to completion. I was pleasantly surprised every step of the way.\r\nThe animation in filler scenes and backgrounds is lackluster, especially in the first season, but during crucial scenes it gives you the information you need to engross yourself in the story, and that's where the anime really shines. The characters areall quite likable and relatable, and the story is above all, compelling. If you listen closely you'll hear some interesting foley work with the sound that I wasn't expecting given the relatively unimpressive animation. \\n\\n\r\nBaby Steps probably won't be on anyone's list as all time favorite anime, but it deserves credit for telling a compelling and unique story quite well. The second season is just as good as the first, with the added benefit of more and better animators leading to consistent scene quality in terms of the animation.",
            "date": "2017-11-08T20:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 262836,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6723578.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JasperFrost",
                "username": "JasperFrost"
            },
            "url": "https://myanimelist.net/reviews.php?id=262836"
        },
        {
            "content": "Overall I gave Baby Steps an 8 because this anime managed to keep me enticed in the story and wanting more. Despite the fact that the anime became quite repetitive by the end and its lack of a proper ending. \r\n  The animation Baby Steps is a great anime which I would suggest to anyone out there looking for an anime to waste time until another show aires. Despite the fact that it is repetitive I am sure that any one could love this anime if they were easy to please.\r\n  Another thing about baby steps that could turn you ofis how the anime gets cut off mid-story, I'm not sure if they are planning a new season but i would like you to know that it ends quite like bleach so if you really hated how bleach ended you may not like this one.\\n\\n\\n",
            "date": "2016-02-21T04:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 211367,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5212301.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jack_Henderson",
                "username": "Jack_Henderson"
            },
            "url": "https://myanimelist.net/reviews.php?id=211367"
        },
        {
            "content": "\"Baby Steps\" is an anime about tennis, but it also a great coming-of-age story that emphasizes celebrating small successes, finding passion, and making meaningful connections.\r\nThis show belongs to a place near and dear to my heart. The main cast is full of very likable characters, and the protagonist's story arc and development was very realistic and believable, which is a quality that lacks in its contemporaries. I don't typically watch anime in the \"sports\" genre, but I thoroughly enjoyed this one.\r\nThe main character, Ei-chan, is extremely relatable and kind-hearted. The show has a good way of making a person root for him, through his hardshipsand growth. The supporting characters, as well as the 'antagonists' are mostly unique and complex characters that embody true human struggles and emotions. Their methods and attitudes are reflected in the way they play tennis, which was a very good touch.\\n\\n\r\n\"Baby Steps\" has created a positive impact on my life, and inspired me to work harder, try my best, take risks, and find passion.",
            "date": "2017-06-13T09:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 249816,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4703535.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sheepishh",
                "username": "Sheepishh"
            },
            "url": "https://myanimelist.net/reviews.php?id=249816"
        },
        {
            "content": "This is my first review! :P\r\nShould you watch it? Yes, the story is very entertaining and the growth of the characters is excellent.\r\nIll rate the genres now (That are tagged). [Romance] 4/10. Sure there was some romance in the second season, but there wasn't much. Romance is barely there.\r\n[School] 6/10. There not much school in it as well. There is some of it in the beginning of the season, but after that there isn't much school. [Shounen] ?. This is a type of anime that anybody can watch. Sure, its focusing mainly for men, but everyone can have the same entertainment with this anime. [Sports]10/10. Sports is the main adjective of this anime, and does a fairly good job of showing it. It shows the struggles of playing tennis, and the strategies and skills needed in order to play tennis.\\n\\n\r\nIll rate the Story, Art, Sound, Character, Enjoyment, and Overall now.\\n\\n\r\nStory [8/10] I thought the story was very good. The story explains a guy who is very good at school, but wanted to do something new, so he decides to \"try\" tennis which leads him down a road. It explains the struggles and advantages he gets across the anime.\\n\\n\r\nArt [7/10] The art isn't fancy, but delivers an easy approach of what is happening on the field, when playing tennis. \\n\\n\r\nSound [8/10] I loved the intro/outro of this anime so much! Props to the Sound Producers.\\n\\n\r\nCharacters [9/10] This anime created character very well. It shows the main character fail at running a warm up, to fighting Japan's number one! It also shows how he and everyone else at the STC gotten even closer.\\n\\n\r\nEnjoyment [9/10] Sure this anime can be boring at points, but it brings you right back up with cliff hangers and close matches.\\n\\n\r\nOverall [8/10] This anime is a must watch for even for people who don't even watch sports anime (first sports anime I have watched). So if you have any free time, watch this entertaining anime.\\n\\n\r\n~MattNyte",
            "date": "2017-06-05T21:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 249356,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5734044.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MattNyte",
                "username": "MattNyte"
            },
            "url": "https://myanimelist.net/reviews.php?id=249356"
        },
        {
            "content": "Where sports anime is concerned, Baby Steps is definitely underrated. This anime has all your typical parts to a sports anime but with a way better story and main character. \r\nTypical Plot: \r\n- The MC is a novice at the sport. \r\n- The MC works hard towards a goal\r\nNot so typical plot:\r\n- The MC isn't a pansy.\r\n- The MC is incredibly likable\r\n- The improvement in the MC's skills are realistic. \r\n- The end of every episode leaves your heart racing and motivated to conquer the day. (Seriously how I felt after haha)\r\nArt: The art is nothing fancy.  It is good enough to tell thestory. \\n\\n\r\nOverall, this is a must watch. \\n\\n",
            "date": "2017-02-26T03:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 241416,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/732417.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/aedonis",
                "username": "aedonis"
            },
            "url": "https://myanimelist.net/reviews.php?id=241416"
        }
    ]
]