[
    [
        {
            "content": "The one thing that always impresses me about anime and manga is the attention to detail that the japanese creators of individual stories have, especially when they utilise culture, history, folklore, etc, from other parts of the world as integral parts of their tales. \r\nHakushaku to Yousei (or Earl and Fairy in english), began life as a series of light novels written by Tani Mizue, which were serialised in Cobalt magazine. The novels proved to be popular given the japanese love of western folklore and mythology, allowing the novels to be adapted for two drama CDs and a manga which is currently serialised in TheMargaret magazine.\\n\\n\r\nBefore I go any further, I should point out that the story is most definitely unfinished, so expect a second, and maybe a third season at some point. That said, this initial series was rather well done on the whole. \\n\\n\r\nThe story is set in Victorian England and follow the adventures of 17 year old Lydia Carlton, a &quot;Fairy Doctor&quot;. She has the ability to see and communicate with supernatural creatures like fairies, pixies, brownies, and other members of the Seelie Court, and for this reason she is chosen to help one Edgar J. C. Ashenbert in his quest to become the legendary Blue Knight Earl, the human ruler of the fairy nation. He is accompanied by his servant, a boy of around Lydia's age simply known as Raven, whilst Lydia is accompanied by a talking cat called Nico.\\n\\n\r\nThe story doesn't follow a straightforward path though, as Edgar's quest is borne from a desire for vengeance, and he has some extremely deadly enemies to contend with, as well as dealing with fey creatures who can twist the meaning of words and promises to suit their needs. It's for this reason that he desperately requires Lydia's help, especially as he can neither see nor talk to fairies.\\n\\n\r\nThe art and animation for this series is very well done, especially if you like bishies. The animation is generally very smooth, however my one gripe with the character designs was that Victorian England had a lot more plain looking people than the anime portrays (it would have been nice to see this, but it doesn't really affect the story). The characters that are in the show are all well designed though, especially Tomkins, whose features hint at his ancestry as one of the Merrow (merfolk). The fairy creatures are also well designed on the whole, and the members of the Unseelie Court all possess a suitably ominous appearance.\\n\\n\r\nThe music throughout the series is actually rather well done, and generally matches the time period. However, there are moments when the music definitely spoils the mood of the scene, especially with the more tension filled moments where a more ominous piece of something classical would have served better than the J-rock/pop track from the OP. The VAs are generally very good, however there is sometimes a slightly one dimesnional note to the main characters because of a lack of emotion being projected through the voice.\\n\\n\r\nOn the whole the characters were fairly solid. I found Lydia to be quite likeable, although this may be because she reminded me of Kou Shuurei from Saiunkoku Monogatari. Edgar was also quite likeable, however I found the supposed lack of emotion to be odd, especially given his feelings for Lydia. This is something that, unfortunately, carries over to many of the other characters, especially the males. For some reason they all seem to be protrayed as cool, icy, bishounens, when it would have served the story better if they let loose once in a while. It could be argued that this is in keeping with the Victorian setting, but it's more likely to be because this is most definitely a shoujo anime.\\n\\n\r\nI found this to be surprisingly enjoyable though, especially given it's flaws. I think that my enjoyment though, mainly comes from the fact that folklore is a hobby of mine, and I found that the numerous fey creatures and references were more closely related to what is in folklore than most people would believe (in other words, the old fairy tales where there's lots of blood, as opposed to the more modern version - the bedtime story). It shows that Tani Mizue actually referenced a fair amount of material during the writing of the light novels, and has used the information to good effect.\\n\\n\r\nThis isn't really a series that will appeal to everyone. It's not complete enough to be a true shoujo anime, however it does highlight the fact that fey creatures aren't nice on the whole. It won't appeal to action or sports junkies, and probabaly won't be liked by mecha and combat fans. Horror buffs may like it for it's portrayal of fairies and the like, but the ones who will probably enjoy watching it the most are fans of Angelique, Saiunkoku Monogatari, Gakuen Alice, etc, especially given the romance aspect between Edgar and Lydia.\\n\\n\r\nIf you do happen to like this because of the fairies though, then you may want to check out the following books:\\n\\n\r\n&quot;Faerie Tale&quot; by Raymond E Feist\\n\r\n&quot;Lords &amp; Ladies&quot; and &quot;The Wee Free Men&quot; by Terry Pratchett.",
            "date": "2009-01-06T06:54:00+00:00",
            "helpful_count": 217,
            "mal_id": 11167,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=11167"
        },
        {
            "content": "Hakushaku to Yosei is a delightful romantic shoujo fantasy. However, for one to enjoy it, expectations have to be set. The 12-episode anime is based only on a few volumes of the light novel series. Therefore, do not be surprised that at the end of the anime, there are still a lot of questions left unanswered. It is because the story still continues in the novels. Perhaps the producers are still planning or are leaving the door open for a second season. \r\nThe characters are beautifully drawn and the designs, in fact, are slightly better than in the manga. The music, on the other hand,is average. The opening theme is an upbeat rock song that is tolerable enough to listen to, but not very appropriate to the Victorian theme. The closing soundtrack is a sentimental love song that fits the mawkish ending sequence well. This gratuitous scene that features the male characters lying in bed half-naked is likely conceived in an effort to pander to young female audiences. They even made Edgar’s seiyuu sing it, even though his singing voice isn't as pleasant to hear as his speaking voice. (I may sound so negative, but I'm not exactly complaining).\\n\\n\r\nThe two main characters of this anime are quite endearing. Lydia isn't exactly an extraordinary character but she is enchanting, graceful and kind-hearted, unlike the stereotypical shoujo heroines who are plain looking, dumb, clumsy, shameless, and whose only merit is their genkiness. She is a female protagonist who has self-respect and will not immediately throw herself to the guy she likes.  \\n\\n\r\nEdgar is an intriguing character. While his bearing is not mysterious because of his rather pompous personality, everything about him is a mystery: his past and identity. But despite his shadiness, he is a sympathetic character. The others (including the villains), unfortunately, are somewhat boring and forgettable. They are incredibly generic and we get to know very little about them.\\n\\n\r\nIf the other guys weren’t so flat, the romance would have been a lot more exciting and complex. Unfortunately, it is so obvious who Lydia will end up with even though she is surrounded by hot guys who are all interested in her. Raven is too loyal to Edgar to be his rival. Paul is such a dull character and too passive to challenge Edgar. Kelpie, on the other hand, though handsome, is rather charmless. But it seems the question this story is trying to answer isn’t who Lydia is going to choose, but how Edgar is going to gain her trust and love.\\n\\n\r\nAlthough this is definitely not one of the best anime I’ve seen, I truly enjoyed watching this series. It is a good romance anime: charming and entertaining enough to engage shoujo fans. \\n\\n\r\nIf you are already a fan of the anime, I suggest that you read the light novels (the translations), so you'll know what happens after episode 12. They are also detailed and therefore more satisfying. The supporting characters are also more fleshed out and not dull as in the anime. I also recommend reading the manga since it is a more faithful adaptation (than the anime which is so condensed). It's also darker, whereas the anime is a little too girly.",
            "date": "2009-01-06T00:55:00+00:00",
            "helpful_count": 92,
            "mal_id": 11162,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/113279.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/miskat",
                "username": "miskat"
            },
            "url": "https://myanimelist.net/reviews.php?id=11162"
        },
        {
            "content": "I have to admit that this anime had failed to impress. I was expecting much more from the plot and the characters, but to my misfortune I had only ended up disappointed. Once I finished viewing the entire series, I was not satisfied with the overall outcome of the characters' journey.\r\nStory: [6]\r\nThere is still so many questions the anime has left unanswered. The viewer knows little of the Blue Knight Earl. The plot itself is mainly concentrated on Edgar's need to bear a name with a powerful presence, as well as to fight for his love for Lydia whilst others are after her. There wasstill much to be told of the fairy world, but due to the focused romance between Lydia and Edgar, all other information of the anime becomes lost. Hence the reason why the anime became more choppy rather than bearing the fluent motion that other wonderful animes had.\\n\\n\r\nArt: [7]\\n\r\nThe art could've been done better. A fairy world is meant to be magical and enthralling. Matter of fact, if the creators had done their art in an inconspicuous way as to make the viewer imagine they are in a fairy world indirectly [similar artistic appeal to EF - Tale Of Memories and 5 Centimetres Per Second], then they would've received a higher grade. I do praise the art done in O'Neill's paintings though. It almost suits the time setting of the story.\\n\\n\r\nSound: [7]\\n\r\nI bestow a 7 upon the sound because not only does some music pieces relate to the specific time period of the story, but even the suspense scenes can allow the viewer to understand that there is critical observation involved between characters [e.g. Nico helping Paul search for Banshee, Lydia and Edgar figuring out Ulysses' motive, etc]. Thus, the sound was not too bad. Allow me to point out, if you will, how the theme song sounded like a Japanese version of Yellowcard?\\n\\n\r\nCharacter: [4]\\n\r\nIndeed a 4 does seem pretty low, but I do have my reasons. Firstly, Edgar. The ash mauve eyes gave him a mysterious appeal. Yet his eyes implied nothing extravagant about his persona. Throughout the progression of the series, it felt to me that Edgar was a phony. The sincerity of his character was questionable. Was he a killer? Is he playing Lydia? What's going on? He didn't seem truthful enough. I had assumed he was only playing smooth as to win Lydia's trust in order to help him obtain the marrow sword. But as the plot proceeded, I wasn't too sure. Furthermore, his reactions are downright dull.   When he saw Ermine for the first time, it was as though he either kept on the smooth facade or was expecting her. What? Wasn't she dead? Wasn't he mourning her absence of some sort? It was ridiculous. Not to mention the cheesy romantic remarks made towards Lydia that further aggravated his reputation. \\n\\n\r\nI did take interest in Raven's mysterious, composed aura. Though I was left dissatisfied when he only mentioned his personal character in less than 2 episodes. I was craving for answers to the truth behind his sprite species, like what they were like and how it could be more of a disadvantage aside from the fact that possessing a sprite spirit caused him to kill on impulse. It's too bad though. Especially when he and Lydia shared their similarities, I was expecting the similarities to be elaborated. Oh well.\\n\\n\r\nAs for Lydia, we know more of her profession than we do of her personal character. It's understandable on how she is a fairy doctor, which is good for the series. But how do we know how she was able to become a fairy doctor aside from the fact that she inherited the gift through her mother's genes? What did she have to go through? Was it difficult to be a fairy doctor at first aside from others believing you have crossed the brink of insanity? And what was the mother like in order to win the heart of a human professor? Her emotions are also puzzling. We understand that her heart was meddled with by mischievous boys as a child. Still, is she insecure? Is she afraid? Even Edgar asks those questions and yet she has failed to answer them. But overall, Lydia is rather cute [more in nature than in appearance] and has great knowledge of different worlds. But that is only one slice of the cake. If she were to show her personal side a little more, the viewer would have the whole cake and eat it too.\\n\\n\r\nEnjoyment: [5]\\n\r\nI am not much of a fan of Shoujo animation. Nonetheless, I have encountered with Shoujo material that has caught my interest. Unfortunately for Hakushaku to Yousei, it failed to do justice. The corny romantic remarks made me laugh to a point where I questioned the seriousness. I am still sitting here questioning about over matters the series has not covered. The only thing good about the anime was its comedic nature. Truth be told, there isn't really anything unique about this anime. We've seen young, cute, silly girls attracting the attention of the dashing higherups. We've already seen supernatural matters that have brought two people together in holy matrimony. We've seen talking animals and non-human creatures causing trouble. At first glance, an Earl and a Fairy Doctor does sound different amongst the array of stereotypical Shoujo animes. But once peering through the depths, there isn't as much difference as I had initially perceived.\\n\\n\r\nOverall: [6]\\n\r\nKeep in mind, if you will, how I am not bashing the series at all. I have seen worst. But I can admit that this anime wasn't as good as I had expected. I am giving the series a &quot;fair&quot; 6. It did leave me wondering, as most animes should. If this series could've done better in the growth and development of both the characters and the plot, the anime would have done justice to all. It did not. C'est la vie.",
            "date": "2008-12-26T11:19:00+00:00",
            "helpful_count": 41,
            "mal_id": 10651,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/125181.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SilentMuse",
                "username": "SilentMuse"
            },
            "url": "https://myanimelist.net/reviews.php?id=10651"
        },
        {
            "content": "This show starts out with a decent premise: a Victorian romance with a touch of Celtic Twilight mythology.  The heroine is a \"fairy doctor,\" and throughout the show she demonstrates a touch of folklore, plus the useful ability to see fairies that are invisible to ordinary people.\r\nHowever, the folklore and mythology references, which could have carried the show, are under-used.  They are sprinkled over the top of a story which plainly is trying to drag itself out into the maximum number of episodes.  Unlike better stories (such as, say, Tweeny Witches, or Magical Shopping District Abenobashi) the mythology and folklore doesn't seeminternally consistent.  Thus the setting seems painfully generic.\\n\\n\r\nThe character designs are decent;  the scenery has a lot of eye candy for folks who like the visual trappings of Victorian mansions.\\n\\n\r\nThe animation is painfully sparse;  pan-and-scan tricks are over-used.  I give it a 6/10 for design but a 4/10 for animation, thus a 5/10 for overall art.  I enjoyed the initial three or four episodes, but I started to notice flaws by the middle, and by the last third I was painfully bored and waiting for a plot resolution that failed to arrive.  The ending seems to indicate that the producers would like to make a second season, but I don't know how much of the audience would stick around to watch it, were that second season to appear.",
            "date": "2009-01-28T23:56:00+00:00",
            "helpful_count": 19,
            "mal_id": 11915,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83256.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/formosan",
                "username": "formosan"
            },
            "url": "https://myanimelist.net/reviews.php?id=11915"
        },
        {
            "content": "-INTRODUCTION-\r\nI decided to watch this anime as soon as I saw the news about it. Romance, Victorian-like style, and yes, a cat wearing what looked like butler attire. All those factors and the overall feeling the promotional images and the trailer gave off got me attracted to this charming fairy tale.\r\n-STORY- 8/10\r\nMy only big disappointment was the ending. The story itself was quite exciting and adventurous, and was building up nicely toward its grand conclusion. Except that conclusion never came. The viewers were left with more questions than answers, and the issue that seemed to be the main focus of the plot, was never resolved.The relationship between Edgar and Lydia also stopped progressing in the second half. Nearly every potentially romantic moment was interrupted either by outside influence or by the characters' indecisiveness. Which is fine once or twice, but it is definitely not the method I would recommend overusing in a romantic storyline.\\n\\n\r\n-CHARACTERS- 8/10\\n\\n\r\nThe story managed to introduce a very large range of characters in such a short time, which was both a success and a downfall. If I was judging solely on the characters' diversity, I would have given it full marks. I don't think there was a single character toward whom I was indifferent, nor were they your usual shoujo stereotypes. However, the development of characters is just as important as making them appeal to the public. Due to such a small number of episodes, the same problem as the one discussed in the previous section occurred. Some characters did not move farther than their point of introduction. And the so-called main villain appeared so close to the end that the audience hardly had a chance to find out anything other than his name. \\n\\n\r\n-ART/ANIMATION- 9/10\\n\\n\r\nThe artwork is beautiful and suits the given genre very nicely. Pretty girls and handsome boys, flower gardens, starry skies, everything you would expect in a romantic fairy tale. It's quite colorful, but not overly bright, so it doesn't get in the way of enjoyment. I especially loved how the eyes were drawn. The animation quality could use some improvement though, and the characters on the background are not very detailed in comparison to close-ups.\\n\\n\r\n-SOUND- 10/10\\n\\n\r\nThis is the aspect of Hakushaku to Yosei for which I don't have a single complaint. Both the background music and the sound effects were perfectly tied in with all the other elements. The opening and ending songs were also very nice. The ending song, My Fairy by Midorikawa Hikaru (Edgar's seiyuu), was especially charming and captured the overall feel of the story.\\n\\n\r\n---\\n\\n\r\nSince there was no real ending to the anime and there is no second season in sight, you might have to look for manga and/or light novels to know the complete story.",
            "date": "2010-04-12T13:57:00+00:00",
            "helpful_count": 15,
            "mal_id": 25010,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66216.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Takai",
                "username": "Takai"
            },
            "url": "https://myanimelist.net/reviews.php?id=25010"
        },
        {
            "content": "First of all i must say that i do not like this anime, and i'm making a review because it seems that people only write reviews of the stuff they like so everything tends to be rated with a 10 or a 9 and that is frustrating.\r\n-Short review\r\nStory: 6-7 It's not that it's a bad concept but it's poorly written and developed.\r\nArt: 8 Plain but beautiful, especially the protagonists.\r\nSound: 6 The seiyus exaggerate the emotions, the background music is ridiculous. \r\nCharacter: 6 Extremely poorly written and \"unbelievable\" personas.\r\nEnjoyment: 7 I like the era and it has a pleasant feeling.\r\nOverall:6- 7 You could ignore it, youwon't lose anything by not watching this but it's not hideous. If you are a sucker for romance (like i tend to be) you will most likely watch it 'till the last episode.\\n\\n\r\n-The long one\\n\r\nWill be added after i watch a few more episodes.\\n\\n\\n",
            "date": "2008-11-23T10:59:00+00:00",
            "helpful_count": 10,
            "mal_id": 9784,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/35221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Anelis",
                "username": "Anelis"
            },
            "url": "https://myanimelist.net/reviews.php?id=9784"
        },
        {
            "content": "10/10\r\nSummary of Story:\r\nBased on the light novel series by Mizue Tani.\r\nSet in 19th century England this is the story of the 17-year old \"fairy doctor\" Lydia Carlton. Her life gets thrown into confusion after meeting Edgar, the count of the Blue Knights. She agrees to help him search for the precious sword that is his family heirloom.\r\nAnimation:\r\nThe animation for Earl and Fairy wasn't all that impressive. I mean, the coloring and backgrounds where beautiful, but the rest was just like any other shoujo anime. The movements where clean and the art style was pretty, and the background matched the setting very well. 8/10\r\nSound:\r\nI loved theost of this, even if half the time the music did NOT match the situation. Too much sparkly noise, especially in the scenes where Raven fought and killed people. There was great music to match the comedic scenes though, so it made up for it. Now, the opening was a great song. The vocals of AciD FLavoR where wonderful, but a different song should have been used. Again, it did NOT match the show's theme. The ending song, however, matched great. It was sung by Edgar Ashenbert's seiyuu Hikaru Midorikawa, and it was about Lydia. But... The vocals were awful. I mean. I like Hikaru'svoice an all, but it doesn't sound like he tried to hard in this one. 6/10\\n\\n\r\nStory:\\n\r\nI found the story to be very original, since I had yet to see an anime about fairies and Fae. Though, the story does get thrown off track and instead of finding the sword and all, it gets into the romance bits. Basically, it was more of Edgar trying to figure out a way to show Lydia that he truly loved her and Kelpi advancing more on Lydia trying to get her into the fairy world. I loved the story line, except the part where the anime ended long before it should have, meaning I hope there is a second and third season. 9/10\\n\\n\r\nCharacter:\\n\r\nThe characters are very widely based in this anime. First you have Edgar, a playboy Earl, who is also very arrogant. Lydia, a kind hearted but strong fairy doctor. Nico, Lydia's drunken, speaking, snotty cat partner. Raven, an emotionless servant of Edgar. Ulysses, the antagonist. Kelpie, a fairy with no more motive other than to marry Lydia. And lots of other fun characters. Without them all, the anime would be boring and not as fun as it was. I specifically liked Raven, and hoped for more time for him.   10/10\\n\\n\r\nValue/Enjoyment:\\n\r\nStep into the unknown with Earl and Fairy. With its genre being shoujo and romance, there isnt a thing in it other than that. The action is amazing, the story line keeps you hooked, and Im sure Kelpie will give you a laugh or two. (Especially when he eats a liver. LOL) 10/10",
            "date": "2009-01-08T16:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 11259,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46299.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MoMo-Da-Gr8",
                "username": "MoMo-Da-Gr8"
            },
            "url": "https://myanimelist.net/reviews.php?id=11259"
        },
        {
            "content": "When it comes to soujo anime, I'm always a little wary about watching them. Many rely on the overused character personas, sigh-worthy romance, and drop-dead gorgous men to sell the show. And let me tell you, Hakushaku to Yousei (aka, Earl and Fairy) does have these things. But at the same time, there's something really stand-out about this show that made me watch it in one sitting.\r\nPlot/Story: This is the anime's strongest point. The plot follows a teenage fairy doctor named Lydia, who suddenly finds herself employed by a mysterious earl, who is in search of a mystical sword that is held by the rulerof the merrow.\\n\\n\r\nThe story is left incomplete and mostly unexplained. I mean, with only twelve episodes, it's not possible for them to wrap this plot up. But, what they do cover is done very well; there's a fair balance of romance, and well as action. The \"Victorian Era\" element is nicely handled as well (but then, I am a sucker for Victorian and steampunk anime). Overall, I was pleased!\\n\\n\r\nSound/Music: This varied with me. The voicework was perfect; every characters' voice suited them greatly and the actors did a fabulous job. \\n\\n\r\nThe music, on the other hand, is odd. Sometimes it's worked into the scene wonderfully, but other times it feels out of place (this happens a lot in fight scenes). Same thing goes with the OP and ED; they kinda fit, but it's an odd fit. \\n\\n\r\nBut if you're paying attention to the voicework, the music becomes ignorable.\\n\\n\r\nCharacters: This is another strong-suit of Earl and Fairy. Though somewhat clichéd, its characters are cleverly-written and quite easy to fall in love with.\\n\\n\r\nLydia is by far, my favorite character. Her kind but strong personality shines as you watch her grow over the twelve episodes, and I really came to like her. She's the first \"typical shojo\" girl to win for full approval!\\n\\n\r\nEdgar is so much (almost too much) like Ouran High School Host Club's Tamaki Souh, that it's scary. But I think that's what I liked about him. His quirky playboy additude, mixed with his darker, more criminal acts, serious past, and attempts to redeem himself of this past, make him the show's most interesting character. I just couldn't get enough of him!\\n\\n\r\nThe other main characters (Raven, Kelpie, Paul, etc.) all prove to be wonderfully interesting characters as well! Their roles are not overshadowed by Edgar too seriously, so you are given time to get to know them. No complaints with the characters.\\n\\n\r\nAnimation: This could be considered the show's weak point. The animation in the show isn't very impressive; it lacks a lot of detail and relies a little heavily on pan-shots. The fight scenes are actually quite good though, so that makes up for some things.\\n\\n\r\nOverall:\\n\\n\r\nThough a very typical shojo, the magical elements and fasinating plot make up for any clichés they may play to. Heck, the clichés are enjoyable too! Here's hoping there's a second season on the horizon.\\n\\n\r\nIt's a short, sweet, and worth giving a chance! I'm glad I did!",
            "date": "2009-10-03T02:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 19333,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/208285.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PandoraxChan",
                "username": "PandoraxChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=19333"
        },
        {
            "content": "I watched this whole bloody thing bloody thing because it was only 12 episodes and I was hoping it would get better.\r\nI began watching because literally, I liked the look of the character I was after a nice romantic storyline, which there... sort of... was?\r\nI felt like there was no natural progression and there wasn't a clear difference between when the characters first met and how they felt at the end.\r\nI had to ask google to explain to me the storyline because it was very choppy and seemed to miss out some essential information that probably would have made it flow better. I have afeeling the manga probably tells the story better.\\n\\n\r\nEgar the main characters is using Lydia at first to get this powerful sword to prove his status in the world as since losing his parents, he has lost that. Eventually he falls in love with her. It sounds like a cool transitional romantic story line that many anime use as a base - you know, began with no feelings, progressed into love because one of the characters is just so kind they can't help it? Well! The problem is, Edgar is so flirtatious in the beginning that it isn't easy to see when his feeling become genuine. His flirting is borderline creepy too and slightly abusive. Although he never forces her to do something she doesn't want to, he looks as though it's a huge effort to make that decision.\\n\\n\r\nLydia also only progresses the tiniest bit towards falling for Edgar and it's kind of frustrating.\\n\\n\r\nThere is little character development for the others also. \\n\\n\r\nI really could go on. I kept up with this anime till the end as I was curious about the storyline.\\n\r\nMeh. It wasn't the worst thing I've seen. Ones I REALLY don't like I drop after a few episodes\\n",
            "date": "2017-02-23T09:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 241207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1345827.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JazCo",
                "username": "JazCo"
            },
            "url": "https://myanimelist.net/reviews.php?id=241207"
        },
        {
            "content": "Animation- As though it were a portrait of the countryside(to me), it has such soft nostalgic feeling. Yet, there are times in the episode where Raven's eye/fairies/hounds have an opposite effect with  its glowing effects and vivid colors- bringing out enthusiasm from the viewer. Animation and artwork are beautiful and in detail. It does give the feel of a \"fairy tale\" story.\r\nStoryline- The series was rather quick (but quickly addictive), but it didn't confuse me with the current plot the characters were facing. Although, it did leave a few questions, and the last episode was open-ended. The series has some good humorous scenes -Ilove that part about Edgar teasing Lydia about her wanting a french kiss- they had quite a few moments like that =) The romance in the story keeps you wanting and hoping that by the end it was what you were looking for.\\n\\n\r\nCharacters- Lydia and Edgar were the most developed out the series (but even they weren't completely developed -Lydia's past experience with the fairies, as well as Edgar's relation to the Blue Knight Earl. ). The rest of the characters, unfortunately, were a little two dimensional. You know there is something deeper with Raven and Ermine, but that is yet to be revealed. The main antagonist, Prince, is yet to make his appearance- we don't know anything important about him. I would have liked to know more about Kelpie, and why he is so infatuated with Lydia. The reason I rate this category higher is because even though we may not \"know\" the character's past/experience, by the end of the series, we almost \"know\" them as far as personality. I have an idea of what they could have been like and how their personality could have moved them though life.\\n\\n\r\nMusic - At first I was expecting something soothing to fit the mood but as the same theme came in during a few fight scenes, I thought, this definitely works. I think overall, the music was fine.\\n\\n\r\nOverall- \\n\r\nThroughout the series there were two things that I kept saying to myself- \\n\r\n1. Don't people knock before coming through the doors?! *Slaps Raven* \"Damn his perfect timing.\"\\n\r\n2. \"Someone is going to explain Ermine soon, just calm down.\" \\n\\n\r\nSince it's suggested to try not to write any spoilers, I will write my rant on the blog portion of my profile- if anyone is interested in reading that =)\\n\\n\r\nThis series was very addictive, and it left me in a good mood despite how it ended.\\n\\n\r\n**Seeing as there is a special recap episode that is coming out, there is a possibility we can expect a second season. -This is just speculation of course. \\n\r\nHelp support this show for more episodes in order to answer questions!",
            "date": "2009-09-04T09:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 18380,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/218763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AyaSeiran",
                "username": "AyaSeiran"
            },
            "url": "https://myanimelist.net/reviews.php?id=18380"
        },
        {
            "content": "The story for this anime is simple and easy to understand.\r\n The art is beyond amazing. There was a lot of time and effort being put into the art. All of the characters were absolutely hypnotizing.\r\nEach character did not resemble others, they were their own, that was what made this anime series very unique. \r\nI enjoyed watching this anime series SO much. I didn't want it to end. 12 episodes were pretty short. Time flys by when you're watching a good anime. As you watch this anime, you can tell right off the bat that this isn't an anime like any other. \r\nI give Hakushakuto Yousei a 10 in all areas.\\n\r\nI seriously recommend Hakushaku to Yousei. It's an easy to love series.",
            "date": "2011-01-01T17:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 33308,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/412610.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/StarrySkyline",
                "username": "StarrySkyline"
            },
            "url": "https://myanimelist.net/reviews.php?id=33308"
        },
        {
            "content": "At twelve episodes, it doesn't really advance as much as one hopes it would. It moved very quickly and fluidly, which I liked, but by the end of the series, the relationship between Edgar and Lydia is very much the same. I did enjoy the romance during the series, though, and I think it was quite cute.\r\nI liked how the manipulated all this myths and legends to fit the story. They really made them look quite different from what I imagined. Of course, it has something to do with anime's superficial nature. Some of the creatures they mentioned I never expected to have human form,and if they did most stories always add that they were but deformed representations of what they once were.\\n\\n\r\nThe music was cool. I really liked listening to it, but like any theme music, after watching a show continuously you sort of grow bored of it.\\n\\n\r\nAgain, I must bring up the point of it only had 12 episodes. For this reason I understand that the characters weren't meant to have really changed. It's not a fault, because they really handled it quite nicely. The characters were three dimensional, even though they didn't changed. It's not as if they had some stagnant personality. You see a couple sides of them as the series progresses.\\n\\n\r\nOver all it was short and simple and cute, and I think that made all the difference.",
            "date": "2009-12-29T22:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 21846,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/271113.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/inkmouse",
                "username": "inkmouse"
            },
            "url": "https://myanimelist.net/reviews.php?id=21846"
        },
        {
            "content": "Short review:\r\nHaving read the first volume of the manga, I was very excited to find out there was an anime adaptation of this. However, the story was paced a little too quickly, and often times felt disjointed. I also found it a bit difficult to get attached to the characters. Art and animation are kept to a minimum, like with most shojo anime. The voice acting was okay, and the music didn't really stand out to me. Overall, I don't think this anime can stand alone, meaning you wold have to get the original source material to fully enjoy this anime. \r\nLoooooooong review:\r\nStory and Characters:\r\nNow,I've read the manga, but not the light novels. And I will be making comparisons between the manga and anime. So, let me try to put the story into a satirical form (minor spoilers):\\n\r\nEdgar: Help me become the Blue Knight Earl. Lydia: Why do I have to?\\n\r\nEdgar. I can kill you. But I also think I love you. Lydia: Uhhh...\\n\r\nRaven: I am Edgar's loyal servant. Nico: MORE SHRIMP!!!\\n\r\nEdgar: Mr. Carlton, please let me marry your daughter. Lydia and her father: ?!?!?!?!\\n\r\nEdgar: You know, I was once in love with someone named Ermine. Kelpie: I want to mate with you, Lydia.\\n\r\nAnd then there's Huxley, who I really don't remember much about him.\\n\r\nI give the story creativity points. But looking at the story as a whole, it only vaguely made sense to me. The transition from different plot points is sometimes sudden and/or doesn't make sense. This is the kind of story that needs to marathoned in order to remember everything and to remember all the mysteries and \"clues\" in the anime. It's also not very enjoyable, either. But that may just be me, because I was waiting for some real chemistry between Lydia and Edgar.\\n\\n\r\nI am not afraid to say I was struck with bishi fever when watching this anime. Obviously, there's Edgar, but then there's Kelpie, the water spirit in love Lydia and kind of looks like Kaname from Vampire Knight (CURSE YOU). And there's (another) character every other fangirl seems to love but I didn't, Raven. All these bishis did have some sort of a (back)story, but was either applied too lightly (Paul, Kelpie), or too heavily (Raven, Edgar). The character relationships, especially the ones involving Ermine, seemed a bit confusing, and would be more confusing had I not read the manga. Okay, let's talk about Lydia. I have mixed feeling about her. I appreciate that she's not entirely helpless and she isn't stupid, either. But she's stubborn, although with good reason. She doesn't develop much, except for her (reluctant) feelings towards Edgar. And like Lydia, I also had mixed feelings about Edgar. He's manipulative, a charmer, and not afraid to get what he wants by any means necessary. But at least he didn't treat Lydia like trash. I think this \"split\" was a good idea, though, because it offers a bit of darkness and \"reality\" to a main male character in a fantasy anime. It's even better if that kind of guy is your thing, if you get what I'm saying. He isn't clueless, like Tamaki Suoh, or very abrasive, like Kyo Sohma. But I think Edgar is fine as he is, because he's a different type of male love interest in shojo anime.\\n\\n\\n\r\nArt and Animation:\\n\r\nThe Earl and The Fairy was produced by studio Artland, who also made the anime Mushi-shi. The art style isn't that different between the two, but it didn't suit The Earl and The Fairy very well. I thought the art was too flat and the colors were a little too pale. But I also thought they put more work into drawing Edgar than anyone else in the anime. Because this is a 2008 anime, I expected this to be a very beautiful looking shojo anime. Honestly, I expect shojo/romance anime to look nice (Ouran, Clannad). Cardcaptor Sakura, an anime that's 10 years older than The Earl and The Fairy looks better, in my opinion. Which is a shame, because the artwork in the light novels and the manga is VERY beautiful. And is it just me, or were all of Lydia's formal dresses really ugly? However, I can understand why they didn't want to put a lot of effort into drawing or the art.\\n\\n\r\nThe animation is about average as well. What comes to mind when thinking about the animation is whenever Raven fights. I just thought the flash of green and then seeing all the enemies go down was kind of cheap and cheesy. The opening animation also looks kind of cheap. But this is a shojo anime, and I think animation isn't supposed to be one of it's focuses.\\n\\n\r\nMusic:\\n\r\nBefore I talk about the music, I would just like to say there is no voice category for this review because this anime has never been dubbed. Yeah, after my Attack on Titan review, I realized I can't judge the original voices in an anime very well.\\n\r\nI don't think there was at least one memorable OST track. I think it \"set the mood\" of the anime, but just wasn't exceptional in any way. The opening theme was okay, but it wasn't that great. It really didn't fit a historical, shojo anime, either. And I'm pretty sure the ending (well, this is mostly the animation we're talking about here) caused almost as many ovaries to explode as did the trailer for the Free! anime.\\n\\n\r\nExecution and My Enjoyment:\\n\r\nKind of how I said a high school slice-of-life comedy should not be super-long, a shojo anime should not be only 12-13 episodes. I don't think that's enough time for true, satisfying romantic development. The story was just too much to be compressed into 12 episodes. Normally, one volume of manga = 4-5 anime episodes. The first volume of the manga became the first 2 episodes of the anime. Yeah, I think you get the idea what the pacing of this show is like. This anime had far too much (somewhat disjointed) story elements crammed into 12 episodes. I don't mind when an anime tries to do a lot of things, like in Angel Beats, but that balanced many different genres, while The Earl and The Fairy had too many plot points condensed and overlapping.\\n\\n\r\nOverall, this anime had nothing really special about it, and had a story that was too complicated (for me) in 12 episodes. The production quality is a bit low, in my opinion, and from episode 3 onward, I kept trying to remember what had happened and who was doing what. Along with the changes made from the manga, things got confusing fast, and watching this anime almost felt like a chore towards the end. But, like I've said many times before, I partially watched this to catch bishi fever. Enjoyment may vary between person to person depending if they prefer a complete retell of the original story or a different one.\\n\\n\r\nIf you liked this review, please check out my anime review blog! Link is on my profile.",
            "date": "2014-10-19T14:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 165299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3425659.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/SugoiChappy",
                "username": "SugoiChappy"
            },
            "url": "https://myanimelist.net/reviews.php?id=165299"
        },
        {
            "content": "So, Earl and fairy's plot was pretty creative and unique. I really like how you can tell the characters apart from their personalities.\r\nSometimes, I feel confused by male lead's feelings towards the female lead's feelings, and wonder - How did it even end up like this? XD. Sure, i like a lot of chemistry and romance but I feel like it was slowly progressing but then it was just rushed at the end. I like to see the progression but not that slow and I get confused when things get rushed.\r\nThe story plot, art, voice characters and characters were great. I just wish that therewas more progression and no rush when they made the anime, because I really don't know how they ended up like that.",
            "date": "2015-11-04T01:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 202635,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4928065.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ushi_Chan",
                "username": "Ushi_Chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=202635"
        },
        {
            "content": "Like:\r\n1. character background story,\r\n2. action scenes choreography,\r\n3. concept of mystical world.\r\nNo like:\r\n1. Character design. Faces are too deformed even for anime, bodies look as if everyone in this country suffers from severe anorexia,\r\n2. plain 100% predictable plot. At the same time it lacks logic a bit. Should circumstances of this anime be real, people wouldn't act this way,\r\n3. mixed style and mismatched clothes, furniture and other objects. Series' designer didn't put effort into actually representing XIX century Great Brittain,\r\n4. Ending. It leaves impression that authors were creating slow-paced narration for 10 series and then rushed to the end like \"there's no tomorrow\". Ending episodes lookcramped and lacking sense.\\n\r\nNo complaints:\\n\r\nVoice actors, mosuc, coloring.\\n\r\nGeneral impression:\\n\r\nit seems that series are imitating \"Howl's Moving Castle\". Both setting and main male character are extremely close. Other characters resemble those from Ghibli's movie too. Even their number and approximate age matches. Despite similarities \"Howl's Moving Castle\" stands on completely different level. \\n\r\nShould you watch it? \\n\r\nYes, if you like fairitales and romance. If you're a lady who likes Twilight, you'll love these series. If you're bored by both action and philosophy but still like art style of anime.\\n\r\nNo, if you prefer action, sci-fi or deep thoughts. If you hate cheesy romance or unexplained details.",
            "date": "2012-10-14T02:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 74917,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1532059.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/NeoYojik",
                "username": "NeoYojik"
            },
            "url": "https://myanimelist.net/reviews.php?id=74917"
        },
        {
            "content": "I enjoyed this anime alot. I actually gotten into it because I had read a little bit of the manga in this magezine I looked at. I don't remember which magezine it was nor do I know where it has disappeared to XD But it had been quite a while since I last saw this title. It was by chance that I found it again. \r\nI had only thought it was a manga but it turned out to be an anime as well, so that was a delight. And so, I have watched it and I have finished it, so on to a review ofit. ^^\\n\\n\r\nStory - Well, I've always loved fairies and I even am a firm believer that they truely exist, so this anime and story is quite in my area of interest. The story is indept and always keeps you wanting to know more. I've finished it and I still want to watch more XD But the story is a little difficult to comprehend at times and at times seems to be seen at a broader mindset. But it is rather easy to keep up and understand what is going on at the present moment. \\n\\n\r\nArt - I thorughly like the style of the art, it has a uniuqe yet familiar look to it. It's not overly detailed but also detailed enough that it keeps your eyes trained on it. The backgrounds are lush and always a beauty to look at. I love seeing paintings in this cause it just takes my breath away to see the lushness of the art within the art. Though, this is just a little thing that bugs me, don't know if it will anyone else, but I hate being able to see the eyes through the hair, it just drives me insane. But that's just me I think.\\n\\n\r\nSound - The sound is very simple yet exotic at the same time, it has a gentle sound to it at times and at others a lovely mood and feel. The music goes very well with the anime and it builds up, always letting know when something interesting or important is about to happen. I love that. The voice actors also have a certian quality to them, if you imagine that voice to go with that person, it is bound to be close to what you expect. I also loved hearing familiar voices and coming back here to look them up, realizing that they are in many other animes I have watched subbed. I have to say that the choice of actors for this was very well thought out.\\n\\n\r\nCharacter - I adore all the characters, they each have a certain role and none are unimportant, even if you think they mind. I thought Paul was just a random extra, but turned out he appeared in later episodes after his debut appearence. There are no random extras in this and that makes it rather interesting, that everyone has a part to play this grand story. And the good characters (even though some of them MIGHT seem bad) have a certain quality to them that makes you find them interesting and enjoy watching them. All in all, the characters ar well thought out and put together in this tale splendidly.\\n\\n\r\nEnjoyment - As I stated before, I may be a little biased with my enjoyment, since I have an interest in the fairy world and like. But keeping it unbiased, it was enjoyable. There are moments where you just can't help but laugh but others that keep you on the edge of your seat. The anime pulls you in and keeps you watching even if you have to stop to do something. I was reluctent to stop when it was time for bed. But right when I got up the next morning, I continued it. It calls up a thrill when watching and keeps you intriged with every little event that happens. But granted, it is a little fast-paced and confusing at the beginning. But as it continues on, it makes sense.\\n\\n\r\nOverall - So overall, I give it a 10 out of 10, it was just so enjoyable and a thrill to watch at even now that it's over, I'm rather disappointed that it is. But it leaves room for more enjoyment with reading the manga ^^ For that has a lot more story, background and little bits that didn't appear in the manga. I will be going to go read that soon. \\n\\n\r\nThat is my review of this grand anime that has caught my attention for quite some time. I should also mention that it only took me two days to watch it, for it was THAT addicting. Though, that might just be me ^^ For I love watching anime that much. Anyway, I hope you enjoy this anime as much as I have. I highly reccomend it to any fantasy/romance lovers who like a little silly but also slightly corny side to it.",
            "date": "2013-02-22T10:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 87569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/597359.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/moonlitneko",
                "username": "moonlitneko"
            },
            "url": "https://myanimelist.net/reviews.php?id=87569"
        },
        {
            "content": "I came in with expectations before watching this because I had finished reading the two-volume manga a week before. Both the anime and manga are based on the light novel, but it seems the anime took things a little further and didn’t include what was in the second volume of the manga.\r\nAnyway, I know this anime was probably quite popular back in the day with young girls. There’s a beautiful young lady who’s misunderstood and finds comfort in a mysterious and devilishly handsome man who is in need of her fairy services. She can see fairies! He sparkles so much when he saves her life!I think if I were years younger this show would have been the ultimate source of my fangirling.\\n\\n\r\nThe setting for this anime is charming and quaint. Historical anime, especially set in the Victorian era, is always quite interesting due to how well the writers pay attention to clothing, speech, and other little details that make the time period credible. If you like seeing people in dashing coats and open collars, long dresses with petticoats and ruffled sleeves, top hats and canes, then this will definitely be appealing to you.\\n\\n\r\nThere’s that fairy lore aspect as well. Even though I’m a grown adult, I’m still quite fascinated by magical fairy tales, having grown up in a time where Disney made my childhood. This show doesn’t shove information down your throat, either. Lydia doesn’t act like some kind of dictionary when she helps the earl with his fairy business. She feeds him tidbits of information when he asks or when it’s necessary. There’s no time to talk all about the fairy world. All there is to know is that it’s there and there are some rules to follow, which aids in keeping one’s imagination vibrant.\\n\\n\r\nAdventure-wise, though it keeps moving and engages the viewer, I think a little bit of it was muddled and confusing. While having legends to follow and read about is interesting, when they became more convoluted it was harder to follow what the characters had to do in order to accomplish their goals.\\n\\n\r\nThe earl’s true origins also brought the show to a new level. All I can say is that he’s not the perfect prince that he initially appears to be; he’s got a lot of dirt and it complicates the entire plot, especially the romance.\\n\\n\r\nEven though MAL doesn’t give this anime a romance tag, I think it definitely should have one. Anyone looking at the cover of the anime, manga, or light novel would know that there is a gigantic shipping between the fairy doctor Lydia and the earl Edgar. It would be a little too perfect if their feelings for each other were clear from the beginning, so there’s the problem of Edgar’s womanizing personality and Lydia’s difficulty in believing his declarations of love. It can get pretty frustrating, though it was much more annoying in the manga. The anime does better by giving an additional reason for Lydia spurning his advances, making the question of their relationship credible.\\n\\n\r\nThere’s something a little different about the way this romance is portrayed, though. I’m not sure if it’s customary in the Victorian era, but both characters are very earnest about their feelings. Though Edgar’s personality is a little bit murky, he’s still dead set on making Lydia his and showers her with compliments of love, especially those three little words. Lydia tells him honestly that she doesn’t believe him and even gives him the reasons why she doesn’t think so. It’s a constant battle of wills and reminds me a lot of Asian dramas.\\n\\n\r\nWhile one would expect Lydia to be quite a headstrong protagonist, a lot of the times she’s put in the position as a damsel in distress because she can’t fight against strong men with guns and knives. Her strengths as a character, therefore, are in her knowledge of fairy lore and her belief in herself. She’s a strong-willed person due to how long she’s had to endure people’s ridicule towards her profession. She trusts her instincts above all else, and she’s hardly wrong because of her fairy instincts.\\n\\n\r\nThough I wish she were nicer to Edward, she’s very much a friendly girl and is the kind of person I’d want to know. She’s smart and her desire to do a good job as a fairy doctor drives the show successfully. A lot of this show has to do with her becoming a new person because of Edgar and because of the trials she goes through which put her experience to the test. I think it’s wonderful to see a heroine bloom like this.\\n\\n\r\nEdgar is a whole different story. While I’m a sucker for attractive gentlemen, I’m annoyed when they almost never change their cool expression. It also may be the strange color of his eyes which makes it seem that way. His emotions are hard to read and at times I felt that Lydia may have been right to say he was bluffing. Additionally, his uncovered dark past is pretty bad and contrasts greatly with his current status, so it feels unreal and a bit over dramatic.\\n\\n\r\nYou have to like his suaveness, though. If you can sympathize with his history, his transformation into the earl he is now reflects the great strength he has inside of him. He’s a courageous person and stops at nothing to obtain what he desires. Of course, his aims change the longer he spends time with Lydia. He never fails to be the prince-like character that every girl dreams of.\\n\\n\r\nAs much as I hated how perfect Edgar seemed sometimes, he looked gorgeous, as did Lydia. The character designs imitated the delightful light and lovely look from the manga and light novel. While they do have the same large-eyed girls and smaller-eyed men that are frequent in shoujo, they’re still lovely. They even carry the important colors over: the long and springy hair of Lydia’s that people often call “rust-colored”, Edgar’s unique ash mauve eyes, Lydia’s peridot green ones that see everything of the world, and Edgar’s noticeable blond hair.\\n\\n\r\nThe fight scenes in here were hard to understand. The people moved too fast and it was difficult to comprehend who did what. I suppose part of that is due to the incredible speed of fairy world creatures, but it’s really quite a shame. I think otherwise the animation for this show was fine, though, given it was aired in 2008.\\n\\n\r\nI can’t say that the soundtrack was that spectacular. There were the light and quirky tracks for mischievous moments in which brownies stole cookies, little classical string pieces when the earl and his fairy doctor went out on walks, and so on. The soundtrack worked for most of the show.\\n\\n\r\nWhat I had an issue with was the OP. I didn’t think that poppy piece with electric guitars and violins suited the anime setting. I would have preferred a quieter piece to go with the seriousness of the story and ancient fairy lore. I suppose this type of OP would be appealing to the young folk it was geared toward, though.\\n\\n\r\nThe first episode left me quite skeptical, but I do have to say I enjoyed watching this anime. Though I’m irritated by how love in Asian dramas can turn out, I still like watching it, so the similar romance in The Earl and the Fairy gave me the same experience. It was also quite nice to see two lovely people in love. The touches of magical history and encounters with mythical creatures were interesting and kept the story going. If you’d really like to enjoy this story to the fullest, though, I’d encourage you to read the light novel.",
            "date": "2016-09-08T22:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 228616,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4817481.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Chinomi-san",
                "username": "Chinomi-san"
            },
            "url": "https://myanimelist.net/reviews.php?id=228616"
        },
        {
            "content": "Anime: Hakushaku to Yousei, also known as Earl and Fairy.\r\n- I would strongly recommend reading the manga before watching this anime. You would be confused otherwise.-\r\nThrough my understandings of this anime, Earl and Fairy is about a girl, named Lydia Carlton, who is a Fairy Doctor. Like her mother, Fairy Doctors can see what others can't. \r\nOne day Lydia received an invite to go to London to visit her father, then her whole world changed.\r\nPros- \r\n- It has mythical creatures in it, like fairies, selkies, and merrows.\r\n- I believe the anime is longer than the manga, which is always good I guess.\r\nCons-\r\n- It didn't explainthe things that you wanted to be explained. Like, for example, what selkies and merrows are. You either have to look it up or read the manga to understand.\\n\r\n- It doesn't really tell about the people's past. It tells you just a little bit about the past but not a lot.\\n\r\n- The ending wasn't what I had in mind; I was expecting something with more action.\\n\\n\r\nOverall-\\n\r\nThis was a good anime but has some flaws here and there. I personally liked the manga more.\\n\\n\r\nI would recommend this anime to people who like European myths. And also to people who have read the manga.",
            "date": "2014-08-04T14:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 155241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3495079.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HeyHarp",
                "username": "HeyHarp"
            },
            "url": "https://myanimelist.net/reviews.php?id=155241"
        },
        {
            "content": "Hakushaku to Yousei is an anime I have now watched twice, and thoroughly enjoyed both times. The story is set in Victorian Britain, and includes action/adventure, romance and fantasy-a strong starting point. \r\nThe main reason I enjoyed this anime was due to the fact it was relatively original, fast-paced, and has an interesting story-line. One of my favorite elements of this anime is the fairy doctor the story follows: Lydia. In most animes I watch the female protagonist is either sweet, week and does not do much or on the other hand, arrogant, loud and annoying. Thankfully Lydia is neither. Though she is feminine andhas a kind heart, she stands up for herself and is rather amusing doing so. \\n\\n\r\nHer relationship with Edgar is an engaging one, though if you are hoping for lots of hot romance you will not find it, the story focuses on the two coming to trust one another etc. Her fairy 'cat' Nico is also an invaluable addition to the cast, along with Cain, a Kelpie who is fighting for Lydias hand. \\n\\n\r\nOverall this anime is an interesting one, with good visuals, an engaging plot and characters who truly come to life.",
            "date": "2014-03-12T09:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 135502,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3623933.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rayandjim",
                "username": "rayandjim"
            },
            "url": "https://myanimelist.net/reviews.php?id=135502"
        },
        {
            "content": "Hakushaku to Yousei (Earl and Fairy) was a surprisingly fun and addictive watch. It takes awhile to get into the series, but after several episodes I was hooked. It wasn't the story that got me. To be honest, the plot wasn't what made the show for me. My enjoyment was much more character driven. The art was pretty good, I thought the style fit the characters and the story well. Lydia's hair was a bit out of hand, though. I'm not sure she brushed it very much :)  The characters were fun. Edgar was undoubtedly my favorite, but Kelpie and Raven were fun, too.Overall, I think this show is definitely worth watching. For fans of Victorian era stories and romance, especially.",
            "date": "2012-09-06T20:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 71733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/725957.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MayTail",
                "username": "MayTail"
            },
            "url": "https://myanimelist.net/reviews.php?id=71733"
        }
    ],
    [
        {
            "content": "The one thing that always impresses me about anime and manga is the attention to detail that the japanese creators of individual stories have, especially when they utilise culture, history, folklore, etc, from other parts of the world as integral parts of their tales. \r\nHakushaku to Yousei (or Earl and Fairy in english), began life as a series of light novels written by Tani Mizue, which were serialised in Cobalt magazine. The novels proved to be popular given the japanese love of western folklore and mythology, allowing the novels to be adapted for two drama CDs and a manga which is currently serialised in TheMargaret magazine.\\n\\n\r\nBefore I go any further, I should point out that the story is most definitely unfinished, so expect a second, and maybe a third season at some point. That said, this initial series was rather well done on the whole. \\n\\n\r\nThe story is set in Victorian England and follow the adventures of 17 year old Lydia Carlton, a &quot;Fairy Doctor&quot;. She has the ability to see and communicate with supernatural creatures like fairies, pixies, brownies, and other members of the Seelie Court, and for this reason she is chosen to help one Edgar J. C. Ashenbert in his quest to become the legendary Blue Knight Earl, the human ruler of the fairy nation. He is accompanied by his servant, a boy of around Lydia's age simply known as Raven, whilst Lydia is accompanied by a talking cat called Nico.\\n\\n\r\nThe story doesn't follow a straightforward path though, as Edgar's quest is borne from a desire for vengeance, and he has some extremely deadly enemies to contend with, as well as dealing with fey creatures who can twist the meaning of words and promises to suit their needs. It's for this reason that he desperately requires Lydia's help, especially as he can neither see nor talk to fairies.\\n\\n\r\nThe art and animation for this series is very well done, especially if you like bishies. The animation is generally very smooth, however my one gripe with the character designs was that Victorian England had a lot more plain looking people than the anime portrays (it would have been nice to see this, but it doesn't really affect the story). The characters that are in the show are all well designed though, especially Tomkins, whose features hint at his ancestry as one of the Merrow (merfolk). The fairy creatures are also well designed on the whole, and the members of the Unseelie Court all possess a suitably ominous appearance.\\n\\n\r\nThe music throughout the series is actually rather well done, and generally matches the time period. However, there are moments when the music definitely spoils the mood of the scene, especially with the more tension filled moments where a more ominous piece of something classical would have served better than the J-rock/pop track from the OP. The VAs are generally very good, however there is sometimes a slightly one dimesnional note to the main characters because of a lack of emotion being projected through the voice.\\n\\n\r\nOn the whole the characters were fairly solid. I found Lydia to be quite likeable, although this may be because she reminded me of Kou Shuurei from Saiunkoku Monogatari. Edgar was also quite likeable, however I found the supposed lack of emotion to be odd, especially given his feelings for Lydia. This is something that, unfortunately, carries over to many of the other characters, especially the males. For some reason they all seem to be protrayed as cool, icy, bishounens, when it would have served the story better if they let loose once in a while. It could be argued that this is in keeping with the Victorian setting, but it's more likely to be because this is most definitely a shoujo anime.\\n\\n\r\nI found this to be surprisingly enjoyable though, especially given it's flaws. I think that my enjoyment though, mainly comes from the fact that folklore is a hobby of mine, and I found that the numerous fey creatures and references were more closely related to what is in folklore than most people would believe (in other words, the old fairy tales where there's lots of blood, as opposed to the more modern version - the bedtime story). It shows that Tani Mizue actually referenced a fair amount of material during the writing of the light novels, and has used the information to good effect.\\n\\n\r\nThis isn't really a series that will appeal to everyone. It's not complete enough to be a true shoujo anime, however it does highlight the fact that fey creatures aren't nice on the whole. It won't appeal to action or sports junkies, and probabaly won't be liked by mecha and combat fans. Horror buffs may like it for it's portrayal of fairies and the like, but the ones who will probably enjoy watching it the most are fans of Angelique, Saiunkoku Monogatari, Gakuen Alice, etc, especially given the romance aspect between Edgar and Lydia.\\n\\n\r\nIf you do happen to like this because of the fairies though, then you may want to check out the following books:\\n\\n\r\n&quot;Faerie Tale&quot; by Raymond E Feist\\n\r\n&quot;Lords &amp; Ladies&quot; and &quot;The Wee Free Men&quot; by Terry Pratchett.",
            "date": "2009-01-06T06:54:00+00:00",
            "helpful_count": 217,
            "mal_id": 11167,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=11167"
        },
        {
            "content": "Hakushaku to Yosei is a delightful romantic shoujo fantasy. However, for one to enjoy it, expectations have to be set. The 12-episode anime is based only on a few volumes of the light novel series. Therefore, do not be surprised that at the end of the anime, there are still a lot of questions left unanswered. It is because the story still continues in the novels. Perhaps the producers are still planning or are leaving the door open for a second season. \r\nThe characters are beautifully drawn and the designs, in fact, are slightly better than in the manga. The music, on the other hand,is average. The opening theme is an upbeat rock song that is tolerable enough to listen to, but not very appropriate to the Victorian theme. The closing soundtrack is a sentimental love song that fits the mawkish ending sequence well. This gratuitous scene that features the male characters lying in bed half-naked is likely conceived in an effort to pander to young female audiences. They even made Edgar’s seiyuu sing it, even though his singing voice isn't as pleasant to hear as his speaking voice. (I may sound so negative, but I'm not exactly complaining).\\n\\n\r\nThe two main characters of this anime are quite endearing. Lydia isn't exactly an extraordinary character but she is enchanting, graceful and kind-hearted, unlike the stereotypical shoujo heroines who are plain looking, dumb, clumsy, shameless, and whose only merit is their genkiness. She is a female protagonist who has self-respect and will not immediately throw herself to the guy she likes.  \\n\\n\r\nEdgar is an intriguing character. While his bearing is not mysterious because of his rather pompous personality, everything about him is a mystery: his past and identity. But despite his shadiness, he is a sympathetic character. The others (including the villains), unfortunately, are somewhat boring and forgettable. They are incredibly generic and we get to know very little about them.\\n\\n\r\nIf the other guys weren’t so flat, the romance would have been a lot more exciting and complex. Unfortunately, it is so obvious who Lydia will end up with even though she is surrounded by hot guys who are all interested in her. Raven is too loyal to Edgar to be his rival. Paul is such a dull character and too passive to challenge Edgar. Kelpie, on the other hand, though handsome, is rather charmless. But it seems the question this story is trying to answer isn’t who Lydia is going to choose, but how Edgar is going to gain her trust and love.\\n\\n\r\nAlthough this is definitely not one of the best anime I’ve seen, I truly enjoyed watching this series. It is a good romance anime: charming and entertaining enough to engage shoujo fans. \\n\\n\r\nIf you are already a fan of the anime, I suggest that you read the light novels (the translations), so you'll know what happens after episode 12. They are also detailed and therefore more satisfying. The supporting characters are also more fleshed out and not dull as in the anime. I also recommend reading the manga since it is a more faithful adaptation (than the anime which is so condensed). It's also darker, whereas the anime is a little too girly.",
            "date": "2009-01-06T00:55:00+00:00",
            "helpful_count": 92,
            "mal_id": 11162,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/113279.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/miskat",
                "username": "miskat"
            },
            "url": "https://myanimelist.net/reviews.php?id=11162"
        },
        {
            "content": "I have to admit that this anime had failed to impress. I was expecting much more from the plot and the characters, but to my misfortune I had only ended up disappointed. Once I finished viewing the entire series, I was not satisfied with the overall outcome of the characters' journey.\r\nStory: [6]\r\nThere is still so many questions the anime has left unanswered. The viewer knows little of the Blue Knight Earl. The plot itself is mainly concentrated on Edgar's need to bear a name with a powerful presence, as well as to fight for his love for Lydia whilst others are after her. There wasstill much to be told of the fairy world, but due to the focused romance between Lydia and Edgar, all other information of the anime becomes lost. Hence the reason why the anime became more choppy rather than bearing the fluent motion that other wonderful animes had.\\n\\n\r\nArt: [7]\\n\r\nThe art could've been done better. A fairy world is meant to be magical and enthralling. Matter of fact, if the creators had done their art in an inconspicuous way as to make the viewer imagine they are in a fairy world indirectly [similar artistic appeal to EF - Tale Of Memories and 5 Centimetres Per Second], then they would've received a higher grade. I do praise the art done in O'Neill's paintings though. It almost suits the time setting of the story.\\n\\n\r\nSound: [7]\\n\r\nI bestow a 7 upon the sound because not only does some music pieces relate to the specific time period of the story, but even the suspense scenes can allow the viewer to understand that there is critical observation involved between characters [e.g. Nico helping Paul search for Banshee, Lydia and Edgar figuring out Ulysses' motive, etc]. Thus, the sound was not too bad. Allow me to point out, if you will, how the theme song sounded like a Japanese version of Yellowcard?\\n\\n\r\nCharacter: [4]\\n\r\nIndeed a 4 does seem pretty low, but I do have my reasons. Firstly, Edgar. The ash mauve eyes gave him a mysterious appeal. Yet his eyes implied nothing extravagant about his persona. Throughout the progression of the series, it felt to me that Edgar was a phony. The sincerity of his character was questionable. Was he a killer? Is he playing Lydia? What's going on? He didn't seem truthful enough. I had assumed he was only playing smooth as to win Lydia's trust in order to help him obtain the marrow sword. But as the plot proceeded, I wasn't too sure. Furthermore, his reactions are downright dull.   When he saw Ermine for the first time, it was as though he either kept on the smooth facade or was expecting her. What? Wasn't she dead? Wasn't he mourning her absence of some sort? It was ridiculous. Not to mention the cheesy romantic remarks made towards Lydia that further aggravated his reputation. \\n\\n\r\nI did take interest in Raven's mysterious, composed aura. Though I was left dissatisfied when he only mentioned his personal character in less than 2 episodes. I was craving for answers to the truth behind his sprite species, like what they were like and how it could be more of a disadvantage aside from the fact that possessing a sprite spirit caused him to kill on impulse. It's too bad though. Especially when he and Lydia shared their similarities, I was expecting the similarities to be elaborated. Oh well.\\n\\n\r\nAs for Lydia, we know more of her profession than we do of her personal character. It's understandable on how she is a fairy doctor, which is good for the series. But how do we know how she was able to become a fairy doctor aside from the fact that she inherited the gift through her mother's genes? What did she have to go through? Was it difficult to be a fairy doctor at first aside from others believing you have crossed the brink of insanity? And what was the mother like in order to win the heart of a human professor? Her emotions are also puzzling. We understand that her heart was meddled with by mischievous boys as a child. Still, is she insecure? Is she afraid? Even Edgar asks those questions and yet she has failed to answer them. But overall, Lydia is rather cute [more in nature than in appearance] and has great knowledge of different worlds. But that is only one slice of the cake. If she were to show her personal side a little more, the viewer would have the whole cake and eat it too.\\n\\n\r\nEnjoyment: [5]\\n\r\nI am not much of a fan of Shoujo animation. Nonetheless, I have encountered with Shoujo material that has caught my interest. Unfortunately for Hakushaku to Yousei, it failed to do justice. The corny romantic remarks made me laugh to a point where I questioned the seriousness. I am still sitting here questioning about over matters the series has not covered. The only thing good about the anime was its comedic nature. Truth be told, there isn't really anything unique about this anime. We've seen young, cute, silly girls attracting the attention of the dashing higherups. We've already seen supernatural matters that have brought two people together in holy matrimony. We've seen talking animals and non-human creatures causing trouble. At first glance, an Earl and a Fairy Doctor does sound different amongst the array of stereotypical Shoujo animes. But once peering through the depths, there isn't as much difference as I had initially perceived.\\n\\n\r\nOverall: [6]\\n\r\nKeep in mind, if you will, how I am not bashing the series at all. I have seen worst. But I can admit that this anime wasn't as good as I had expected. I am giving the series a &quot;fair&quot; 6. It did leave me wondering, as most animes should. If this series could've done better in the growth and development of both the characters and the plot, the anime would have done justice to all. It did not. C'est la vie.",
            "date": "2008-12-26T11:19:00+00:00",
            "helpful_count": 41,
            "mal_id": 10651,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/125181.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SilentMuse",
                "username": "SilentMuse"
            },
            "url": "https://myanimelist.net/reviews.php?id=10651"
        },
        {
            "content": "This show starts out with a decent premise: a Victorian romance with a touch of Celtic Twilight mythology.  The heroine is a \"fairy doctor,\" and throughout the show she demonstrates a touch of folklore, plus the useful ability to see fairies that are invisible to ordinary people.\r\nHowever, the folklore and mythology references, which could have carried the show, are under-used.  They are sprinkled over the top of a story which plainly is trying to drag itself out into the maximum number of episodes.  Unlike better stories (such as, say, Tweeny Witches, or Magical Shopping District Abenobashi) the mythology and folklore doesn't seeminternally consistent.  Thus the setting seems painfully generic.\\n\\n\r\nThe character designs are decent;  the scenery has a lot of eye candy for folks who like the visual trappings of Victorian mansions.\\n\\n\r\nThe animation is painfully sparse;  pan-and-scan tricks are over-used.  I give it a 6/10 for design but a 4/10 for animation, thus a 5/10 for overall art.  I enjoyed the initial three or four episodes, but I started to notice flaws by the middle, and by the last third I was painfully bored and waiting for a plot resolution that failed to arrive.  The ending seems to indicate that the producers would like to make a second season, but I don't know how much of the audience would stick around to watch it, were that second season to appear.",
            "date": "2009-01-28T23:56:00+00:00",
            "helpful_count": 19,
            "mal_id": 11915,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83256.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/formosan",
                "username": "formosan"
            },
            "url": "https://myanimelist.net/reviews.php?id=11915"
        },
        {
            "content": "-INTRODUCTION-\r\nI decided to watch this anime as soon as I saw the news about it. Romance, Victorian-like style, and yes, a cat wearing what looked like butler attire. All those factors and the overall feeling the promotional images and the trailer gave off got me attracted to this charming fairy tale.\r\n-STORY- 8/10\r\nMy only big disappointment was the ending. The story itself was quite exciting and adventurous, and was building up nicely toward its grand conclusion. Except that conclusion never came. The viewers were left with more questions than answers, and the issue that seemed to be the main focus of the plot, was never resolved.The relationship between Edgar and Lydia also stopped progressing in the second half. Nearly every potentially romantic moment was interrupted either by outside influence or by the characters' indecisiveness. Which is fine once or twice, but it is definitely not the method I would recommend overusing in a romantic storyline.\\n\\n\r\n-CHARACTERS- 8/10\\n\\n\r\nThe story managed to introduce a very large range of characters in such a short time, which was both a success and a downfall. If I was judging solely on the characters' diversity, I would have given it full marks. I don't think there was a single character toward whom I was indifferent, nor were they your usual shoujo stereotypes. However, the development of characters is just as important as making them appeal to the public. Due to such a small number of episodes, the same problem as the one discussed in the previous section occurred. Some characters did not move farther than their point of introduction. And the so-called main villain appeared so close to the end that the audience hardly had a chance to find out anything other than his name. \\n\\n\r\n-ART/ANIMATION- 9/10\\n\\n\r\nThe artwork is beautiful and suits the given genre very nicely. Pretty girls and handsome boys, flower gardens, starry skies, everything you would expect in a romantic fairy tale. It's quite colorful, but not overly bright, so it doesn't get in the way of enjoyment. I especially loved how the eyes were drawn. The animation quality could use some improvement though, and the characters on the background are not very detailed in comparison to close-ups.\\n\\n\r\n-SOUND- 10/10\\n\\n\r\nThis is the aspect of Hakushaku to Yosei for which I don't have a single complaint. Both the background music and the sound effects were perfectly tied in with all the other elements. The opening and ending songs were also very nice. The ending song, My Fairy by Midorikawa Hikaru (Edgar's seiyuu), was especially charming and captured the overall feel of the story.\\n\\n\r\n---\\n\\n\r\nSince there was no real ending to the anime and there is no second season in sight, you might have to look for manga and/or light novels to know the complete story.",
            "date": "2010-04-12T13:57:00+00:00",
            "helpful_count": 15,
            "mal_id": 25010,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66216.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Takai",
                "username": "Takai"
            },
            "url": "https://myanimelist.net/reviews.php?id=25010"
        },
        {
            "content": "First of all i must say that i do not like this anime, and i'm making a review because it seems that people only write reviews of the stuff they like so everything tends to be rated with a 10 or a 9 and that is frustrating.\r\n-Short review\r\nStory: 6-7 It's not that it's a bad concept but it's poorly written and developed.\r\nArt: 8 Plain but beautiful, especially the protagonists.\r\nSound: 6 The seiyus exaggerate the emotions, the background music is ridiculous. \r\nCharacter: 6 Extremely poorly written and \"unbelievable\" personas.\r\nEnjoyment: 7 I like the era and it has a pleasant feeling.\r\nOverall:6- 7 You could ignore it, youwon't lose anything by not watching this but it's not hideous. If you are a sucker for romance (like i tend to be) you will most likely watch it 'till the last episode.\\n\\n\r\n-The long one\\n\r\nWill be added after i watch a few more episodes.\\n\\n\\n",
            "date": "2008-11-23T10:59:00+00:00",
            "helpful_count": 10,
            "mal_id": 9784,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/35221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Anelis",
                "username": "Anelis"
            },
            "url": "https://myanimelist.net/reviews.php?id=9784"
        },
        {
            "content": "10/10\r\nSummary of Story:\r\nBased on the light novel series by Mizue Tani.\r\nSet in 19th century England this is the story of the 17-year old \"fairy doctor\" Lydia Carlton. Her life gets thrown into confusion after meeting Edgar, the count of the Blue Knights. She agrees to help him search for the precious sword that is his family heirloom.\r\nAnimation:\r\nThe animation for Earl and Fairy wasn't all that impressive. I mean, the coloring and backgrounds where beautiful, but the rest was just like any other shoujo anime. The movements where clean and the art style was pretty, and the background matched the setting very well. 8/10\r\nSound:\r\nI loved theost of this, even if half the time the music did NOT match the situation. Too much sparkly noise, especially in the scenes where Raven fought and killed people. There was great music to match the comedic scenes though, so it made up for it. Now, the opening was a great song. The vocals of AciD FLavoR where wonderful, but a different song should have been used. Again, it did NOT match the show's theme. The ending song, however, matched great. It was sung by Edgar Ashenbert's seiyuu Hikaru Midorikawa, and it was about Lydia. But... The vocals were awful. I mean. I like Hikaru'svoice an all, but it doesn't sound like he tried to hard in this one. 6/10\\n\\n\r\nStory:\\n\r\nI found the story to be very original, since I had yet to see an anime about fairies and Fae. Though, the story does get thrown off track and instead of finding the sword and all, it gets into the romance bits. Basically, it was more of Edgar trying to figure out a way to show Lydia that he truly loved her and Kelpi advancing more on Lydia trying to get her into the fairy world. I loved the story line, except the part where the anime ended long before it should have, meaning I hope there is a second and third season. 9/10\\n\\n\r\nCharacter:\\n\r\nThe characters are very widely based in this anime. First you have Edgar, a playboy Earl, who is also very arrogant. Lydia, a kind hearted but strong fairy doctor. Nico, Lydia's drunken, speaking, snotty cat partner. Raven, an emotionless servant of Edgar. Ulysses, the antagonist. Kelpie, a fairy with no more motive other than to marry Lydia. And lots of other fun characters. Without them all, the anime would be boring and not as fun as it was. I specifically liked Raven, and hoped for more time for him.   10/10\\n\\n\r\nValue/Enjoyment:\\n\r\nStep into the unknown with Earl and Fairy. With its genre being shoujo and romance, there isnt a thing in it other than that. The action is amazing, the story line keeps you hooked, and Im sure Kelpie will give you a laugh or two. (Especially when he eats a liver. LOL) 10/10",
            "date": "2009-01-08T16:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 11259,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46299.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MoMo-Da-Gr8",
                "username": "MoMo-Da-Gr8"
            },
            "url": "https://myanimelist.net/reviews.php?id=11259"
        },
        {
            "content": "When it comes to soujo anime, I'm always a little wary about watching them. Many rely on the overused character personas, sigh-worthy romance, and drop-dead gorgous men to sell the show. And let me tell you, Hakushaku to Yousei (aka, Earl and Fairy) does have these things. But at the same time, there's something really stand-out about this show that made me watch it in one sitting.\r\nPlot/Story: This is the anime's strongest point. The plot follows a teenage fairy doctor named Lydia, who suddenly finds herself employed by a mysterious earl, who is in search of a mystical sword that is held by the rulerof the merrow.\\n\\n\r\nThe story is left incomplete and mostly unexplained. I mean, with only twelve episodes, it's not possible for them to wrap this plot up. But, what they do cover is done very well; there's a fair balance of romance, and well as action. The \"Victorian Era\" element is nicely handled as well (but then, I am a sucker for Victorian and steampunk anime). Overall, I was pleased!\\n\\n\r\nSound/Music: This varied with me. The voicework was perfect; every characters' voice suited them greatly and the actors did a fabulous job. \\n\\n\r\nThe music, on the other hand, is odd. Sometimes it's worked into the scene wonderfully, but other times it feels out of place (this happens a lot in fight scenes). Same thing goes with the OP and ED; they kinda fit, but it's an odd fit. \\n\\n\r\nBut if you're paying attention to the voicework, the music becomes ignorable.\\n\\n\r\nCharacters: This is another strong-suit of Earl and Fairy. Though somewhat clichéd, its characters are cleverly-written and quite easy to fall in love with.\\n\\n\r\nLydia is by far, my favorite character. Her kind but strong personality shines as you watch her grow over the twelve episodes, and I really came to like her. She's the first \"typical shojo\" girl to win for full approval!\\n\\n\r\nEdgar is so much (almost too much) like Ouran High School Host Club's Tamaki Souh, that it's scary. But I think that's what I liked about him. His quirky playboy additude, mixed with his darker, more criminal acts, serious past, and attempts to redeem himself of this past, make him the show's most interesting character. I just couldn't get enough of him!\\n\\n\r\nThe other main characters (Raven, Kelpie, Paul, etc.) all prove to be wonderfully interesting characters as well! Their roles are not overshadowed by Edgar too seriously, so you are given time to get to know them. No complaints with the characters.\\n\\n\r\nAnimation: This could be considered the show's weak point. The animation in the show isn't very impressive; it lacks a lot of detail and relies a little heavily on pan-shots. The fight scenes are actually quite good though, so that makes up for some things.\\n\\n\r\nOverall:\\n\\n\r\nThough a very typical shojo, the magical elements and fasinating plot make up for any clichés they may play to. Heck, the clichés are enjoyable too! Here's hoping there's a second season on the horizon.\\n\\n\r\nIt's a short, sweet, and worth giving a chance! I'm glad I did!",
            "date": "2009-10-03T02:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 19333,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/208285.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PandoraxChan",
                "username": "PandoraxChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=19333"
        },
        {
            "content": "I watched this whole bloody thing bloody thing because it was only 12 episodes and I was hoping it would get better.\r\nI began watching because literally, I liked the look of the character I was after a nice romantic storyline, which there... sort of... was?\r\nI felt like there was no natural progression and there wasn't a clear difference between when the characters first met and how they felt at the end.\r\nI had to ask google to explain to me the storyline because it was very choppy and seemed to miss out some essential information that probably would have made it flow better. I have afeeling the manga probably tells the story better.\\n\\n\r\nEgar the main characters is using Lydia at first to get this powerful sword to prove his status in the world as since losing his parents, he has lost that. Eventually he falls in love with her. It sounds like a cool transitional romantic story line that many anime use as a base - you know, began with no feelings, progressed into love because one of the characters is just so kind they can't help it? Well! The problem is, Edgar is so flirtatious in the beginning that it isn't easy to see when his feeling become genuine. His flirting is borderline creepy too and slightly abusive. Although he never forces her to do something she doesn't want to, he looks as though it's a huge effort to make that decision.\\n\\n\r\nLydia also only progresses the tiniest bit towards falling for Edgar and it's kind of frustrating.\\n\\n\r\nThere is little character development for the others also. \\n\\n\r\nI really could go on. I kept up with this anime till the end as I was curious about the storyline.\\n\r\nMeh. It wasn't the worst thing I've seen. Ones I REALLY don't like I drop after a few episodes\\n",
            "date": "2017-02-23T09:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 241207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1345827.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JazCo",
                "username": "JazCo"
            },
            "url": "https://myanimelist.net/reviews.php?id=241207"
        },
        {
            "content": "Animation- As though it were a portrait of the countryside(to me), it has such soft nostalgic feeling. Yet, there are times in the episode where Raven's eye/fairies/hounds have an opposite effect with  its glowing effects and vivid colors- bringing out enthusiasm from the viewer. Animation and artwork are beautiful and in detail. It does give the feel of a \"fairy tale\" story.\r\nStoryline- The series was rather quick (but quickly addictive), but it didn't confuse me with the current plot the characters were facing. Although, it did leave a few questions, and the last episode was open-ended. The series has some good humorous scenes -Ilove that part about Edgar teasing Lydia about her wanting a french kiss- they had quite a few moments like that =) The romance in the story keeps you wanting and hoping that by the end it was what you were looking for.\\n\\n\r\nCharacters- Lydia and Edgar were the most developed out the series (but even they weren't completely developed -Lydia's past experience with the fairies, as well as Edgar's relation to the Blue Knight Earl. ). The rest of the characters, unfortunately, were a little two dimensional. You know there is something deeper with Raven and Ermine, but that is yet to be revealed. The main antagonist, Prince, is yet to make his appearance- we don't know anything important about him. I would have liked to know more about Kelpie, and why he is so infatuated with Lydia. The reason I rate this category higher is because even though we may not \"know\" the character's past/experience, by the end of the series, we almost \"know\" them as far as personality. I have an idea of what they could have been like and how their personality could have moved them though life.\\n\\n\r\nMusic - At first I was expecting something soothing to fit the mood but as the same theme came in during a few fight scenes, I thought, this definitely works. I think overall, the music was fine.\\n\\n\r\nOverall- \\n\r\nThroughout the series there were two things that I kept saying to myself- \\n\r\n1. Don't people knock before coming through the doors?! *Slaps Raven* \"Damn his perfect timing.\"\\n\r\n2. \"Someone is going to explain Ermine soon, just calm down.\" \\n\\n\r\nSince it's suggested to try not to write any spoilers, I will write my rant on the blog portion of my profile- if anyone is interested in reading that =)\\n\\n\r\nThis series was very addictive, and it left me in a good mood despite how it ended.\\n\\n\r\n**Seeing as there is a special recap episode that is coming out, there is a possibility we can expect a second season. -This is just speculation of course. \\n\r\nHelp support this show for more episodes in order to answer questions!",
            "date": "2009-09-04T09:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 18380,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/218763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AyaSeiran",
                "username": "AyaSeiran"
            },
            "url": "https://myanimelist.net/reviews.php?id=18380"
        },
        {
            "content": "The story for this anime is simple and easy to understand.\r\n The art is beyond amazing. There was a lot of time and effort being put into the art. All of the characters were absolutely hypnotizing.\r\nEach character did not resemble others, they were their own, that was what made this anime series very unique. \r\nI enjoyed watching this anime series SO much. I didn't want it to end. 12 episodes were pretty short. Time flys by when you're watching a good anime. As you watch this anime, you can tell right off the bat that this isn't an anime like any other. \r\nI give Hakushakuto Yousei a 10 in all areas.\\n\r\nI seriously recommend Hakushaku to Yousei. It's an easy to love series.",
            "date": "2011-01-01T17:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 33308,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/412610.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/StarrySkyline",
                "username": "StarrySkyline"
            },
            "url": "https://myanimelist.net/reviews.php?id=33308"
        },
        {
            "content": "At twelve episodes, it doesn't really advance as much as one hopes it would. It moved very quickly and fluidly, which I liked, but by the end of the series, the relationship between Edgar and Lydia is very much the same. I did enjoy the romance during the series, though, and I think it was quite cute.\r\nI liked how the manipulated all this myths and legends to fit the story. They really made them look quite different from what I imagined. Of course, it has something to do with anime's superficial nature. Some of the creatures they mentioned I never expected to have human form,and if they did most stories always add that they were but deformed representations of what they once were.\\n\\n\r\nThe music was cool. I really liked listening to it, but like any theme music, after watching a show continuously you sort of grow bored of it.\\n\\n\r\nAgain, I must bring up the point of it only had 12 episodes. For this reason I understand that the characters weren't meant to have really changed. It's not a fault, because they really handled it quite nicely. The characters were three dimensional, even though they didn't changed. It's not as if they had some stagnant personality. You see a couple sides of them as the series progresses.\\n\\n\r\nOver all it was short and simple and cute, and I think that made all the difference.",
            "date": "2009-12-29T22:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 21846,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/271113.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/inkmouse",
                "username": "inkmouse"
            },
            "url": "https://myanimelist.net/reviews.php?id=21846"
        },
        {
            "content": "Short review:\r\nHaving read the first volume of the manga, I was very excited to find out there was an anime adaptation of this. However, the story was paced a little too quickly, and often times felt disjointed. I also found it a bit difficult to get attached to the characters. Art and animation are kept to a minimum, like with most shojo anime. The voice acting was okay, and the music didn't really stand out to me. Overall, I don't think this anime can stand alone, meaning you wold have to get the original source material to fully enjoy this anime. \r\nLoooooooong review:\r\nStory and Characters:\r\nNow,I've read the manga, but not the light novels. And I will be making comparisons between the manga and anime. So, let me try to put the story into a satirical form (minor spoilers):\\n\r\nEdgar: Help me become the Blue Knight Earl. Lydia: Why do I have to?\\n\r\nEdgar. I can kill you. But I also think I love you. Lydia: Uhhh...\\n\r\nRaven: I am Edgar's loyal servant. Nico: MORE SHRIMP!!!\\n\r\nEdgar: Mr. Carlton, please let me marry your daughter. Lydia and her father: ?!?!?!?!\\n\r\nEdgar: You know, I was once in love with someone named Ermine. Kelpie: I want to mate with you, Lydia.\\n\r\nAnd then there's Huxley, who I really don't remember much about him.\\n\r\nI give the story creativity points. But looking at the story as a whole, it only vaguely made sense to me. The transition from different plot points is sometimes sudden and/or doesn't make sense. This is the kind of story that needs to marathoned in order to remember everything and to remember all the mysteries and \"clues\" in the anime. It's also not very enjoyable, either. But that may just be me, because I was waiting for some real chemistry between Lydia and Edgar.\\n\\n\r\nI am not afraid to say I was struck with bishi fever when watching this anime. Obviously, there's Edgar, but then there's Kelpie, the water spirit in love Lydia and kind of looks like Kaname from Vampire Knight (CURSE YOU). And there's (another) character every other fangirl seems to love but I didn't, Raven. All these bishis did have some sort of a (back)story, but was either applied too lightly (Paul, Kelpie), or too heavily (Raven, Edgar). The character relationships, especially the ones involving Ermine, seemed a bit confusing, and would be more confusing had I not read the manga. Okay, let's talk about Lydia. I have mixed feeling about her. I appreciate that she's not entirely helpless and she isn't stupid, either. But she's stubborn, although with good reason. She doesn't develop much, except for her (reluctant) feelings towards Edgar. And like Lydia, I also had mixed feelings about Edgar. He's manipulative, a charmer, and not afraid to get what he wants by any means necessary. But at least he didn't treat Lydia like trash. I think this \"split\" was a good idea, though, because it offers a bit of darkness and \"reality\" to a main male character in a fantasy anime. It's even better if that kind of guy is your thing, if you get what I'm saying. He isn't clueless, like Tamaki Suoh, or very abrasive, like Kyo Sohma. But I think Edgar is fine as he is, because he's a different type of male love interest in shojo anime.\\n\\n\\n\r\nArt and Animation:\\n\r\nThe Earl and The Fairy was produced by studio Artland, who also made the anime Mushi-shi. The art style isn't that different between the two, but it didn't suit The Earl and The Fairy very well. I thought the art was too flat and the colors were a little too pale. But I also thought they put more work into drawing Edgar than anyone else in the anime. Because this is a 2008 anime, I expected this to be a very beautiful looking shojo anime. Honestly, I expect shojo/romance anime to look nice (Ouran, Clannad). Cardcaptor Sakura, an anime that's 10 years older than The Earl and The Fairy looks better, in my opinion. Which is a shame, because the artwork in the light novels and the manga is VERY beautiful. And is it just me, or were all of Lydia's formal dresses really ugly? However, I can understand why they didn't want to put a lot of effort into drawing or the art.\\n\\n\r\nThe animation is about average as well. What comes to mind when thinking about the animation is whenever Raven fights. I just thought the flash of green and then seeing all the enemies go down was kind of cheap and cheesy. The opening animation also looks kind of cheap. But this is a shojo anime, and I think animation isn't supposed to be one of it's focuses.\\n\\n\r\nMusic:\\n\r\nBefore I talk about the music, I would just like to say there is no voice category for this review because this anime has never been dubbed. Yeah, after my Attack on Titan review, I realized I can't judge the original voices in an anime very well.\\n\r\nI don't think there was at least one memorable OST track. I think it \"set the mood\" of the anime, but just wasn't exceptional in any way. The opening theme was okay, but it wasn't that great. It really didn't fit a historical, shojo anime, either. And I'm pretty sure the ending (well, this is mostly the animation we're talking about here) caused almost as many ovaries to explode as did the trailer for the Free! anime.\\n\\n\r\nExecution and My Enjoyment:\\n\r\nKind of how I said a high school slice-of-life comedy should not be super-long, a shojo anime should not be only 12-13 episodes. I don't think that's enough time for true, satisfying romantic development. The story was just too much to be compressed into 12 episodes. Normally, one volume of manga = 4-5 anime episodes. The first volume of the manga became the first 2 episodes of the anime. Yeah, I think you get the idea what the pacing of this show is like. This anime had far too much (somewhat disjointed) story elements crammed into 12 episodes. I don't mind when an anime tries to do a lot of things, like in Angel Beats, but that balanced many different genres, while The Earl and The Fairy had too many plot points condensed and overlapping.\\n\\n\r\nOverall, this anime had nothing really special about it, and had a story that was too complicated (for me) in 12 episodes. The production quality is a bit low, in my opinion, and from episode 3 onward, I kept trying to remember what had happened and who was doing what. Along with the changes made from the manga, things got confusing fast, and watching this anime almost felt like a chore towards the end. But, like I've said many times before, I partially watched this to catch bishi fever. Enjoyment may vary between person to person depending if they prefer a complete retell of the original story or a different one.\\n\\n\r\nIf you liked this review, please check out my anime review blog! Link is on my profile.",
            "date": "2014-10-19T14:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 165299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3425659.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/SugoiChappy",
                "username": "SugoiChappy"
            },
            "url": "https://myanimelist.net/reviews.php?id=165299"
        },
        {
            "content": "So, Earl and fairy's plot was pretty creative and unique. I really like how you can tell the characters apart from their personalities.\r\nSometimes, I feel confused by male lead's feelings towards the female lead's feelings, and wonder - How did it even end up like this? XD. Sure, i like a lot of chemistry and romance but I feel like it was slowly progressing but then it was just rushed at the end. I like to see the progression but not that slow and I get confused when things get rushed.\r\nThe story plot, art, voice characters and characters were great. I just wish that therewas more progression and no rush when they made the anime, because I really don't know how they ended up like that.",
            "date": "2015-11-04T01:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 202635,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4928065.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ushi_Chan",
                "username": "Ushi_Chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=202635"
        },
        {
            "content": "Like:\r\n1. character background story,\r\n2. action scenes choreography,\r\n3. concept of mystical world.\r\nNo like:\r\n1. Character design. Faces are too deformed even for anime, bodies look as if everyone in this country suffers from severe anorexia,\r\n2. plain 100% predictable plot. At the same time it lacks logic a bit. Should circumstances of this anime be real, people wouldn't act this way,\r\n3. mixed style and mismatched clothes, furniture and other objects. Series' designer didn't put effort into actually representing XIX century Great Brittain,\r\n4. Ending. It leaves impression that authors were creating slow-paced narration for 10 series and then rushed to the end like \"there's no tomorrow\". Ending episodes lookcramped and lacking sense.\\n\r\nNo complaints:\\n\r\nVoice actors, mosuc, coloring.\\n\r\nGeneral impression:\\n\r\nit seems that series are imitating \"Howl's Moving Castle\". Both setting and main male character are extremely close. Other characters resemble those from Ghibli's movie too. Even their number and approximate age matches. Despite similarities \"Howl's Moving Castle\" stands on completely different level. \\n\r\nShould you watch it? \\n\r\nYes, if you like fairitales and romance. If you're a lady who likes Twilight, you'll love these series. If you're bored by both action and philosophy but still like art style of anime.\\n\r\nNo, if you prefer action, sci-fi or deep thoughts. If you hate cheesy romance or unexplained details.",
            "date": "2012-10-14T02:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 74917,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1532059.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/NeoYojik",
                "username": "NeoYojik"
            },
            "url": "https://myanimelist.net/reviews.php?id=74917"
        },
        {
            "content": "I enjoyed this anime alot. I actually gotten into it because I had read a little bit of the manga in this magezine I looked at. I don't remember which magezine it was nor do I know where it has disappeared to XD But it had been quite a while since I last saw this title. It was by chance that I found it again. \r\nI had only thought it was a manga but it turned out to be an anime as well, so that was a delight. And so, I have watched it and I have finished it, so on to a review ofit. ^^\\n\\n\r\nStory - Well, I've always loved fairies and I even am a firm believer that they truely exist, so this anime and story is quite in my area of interest. The story is indept and always keeps you wanting to know more. I've finished it and I still want to watch more XD But the story is a little difficult to comprehend at times and at times seems to be seen at a broader mindset. But it is rather easy to keep up and understand what is going on at the present moment. \\n\\n\r\nArt - I thorughly like the style of the art, it has a uniuqe yet familiar look to it. It's not overly detailed but also detailed enough that it keeps your eyes trained on it. The backgrounds are lush and always a beauty to look at. I love seeing paintings in this cause it just takes my breath away to see the lushness of the art within the art. Though, this is just a little thing that bugs me, don't know if it will anyone else, but I hate being able to see the eyes through the hair, it just drives me insane. But that's just me I think.\\n\\n\r\nSound - The sound is very simple yet exotic at the same time, it has a gentle sound to it at times and at others a lovely mood and feel. The music goes very well with the anime and it builds up, always letting know when something interesting or important is about to happen. I love that. The voice actors also have a certian quality to them, if you imagine that voice to go with that person, it is bound to be close to what you expect. I also loved hearing familiar voices and coming back here to look them up, realizing that they are in many other animes I have watched subbed. I have to say that the choice of actors for this was very well thought out.\\n\\n\r\nCharacter - I adore all the characters, they each have a certain role and none are unimportant, even if you think they mind. I thought Paul was just a random extra, but turned out he appeared in later episodes after his debut appearence. There are no random extras in this and that makes it rather interesting, that everyone has a part to play this grand story. And the good characters (even though some of them MIGHT seem bad) have a certain quality to them that makes you find them interesting and enjoy watching them. All in all, the characters ar well thought out and put together in this tale splendidly.\\n\\n\r\nEnjoyment - As I stated before, I may be a little biased with my enjoyment, since I have an interest in the fairy world and like. But keeping it unbiased, it was enjoyable. There are moments where you just can't help but laugh but others that keep you on the edge of your seat. The anime pulls you in and keeps you watching even if you have to stop to do something. I was reluctent to stop when it was time for bed. But right when I got up the next morning, I continued it. It calls up a thrill when watching and keeps you intriged with every little event that happens. But granted, it is a little fast-paced and confusing at the beginning. But as it continues on, it makes sense.\\n\\n\r\nOverall - So overall, I give it a 10 out of 10, it was just so enjoyable and a thrill to watch at even now that it's over, I'm rather disappointed that it is. But it leaves room for more enjoyment with reading the manga ^^ For that has a lot more story, background and little bits that didn't appear in the manga. I will be going to go read that soon. \\n\\n\r\nThat is my review of this grand anime that has caught my attention for quite some time. I should also mention that it only took me two days to watch it, for it was THAT addicting. Though, that might just be me ^^ For I love watching anime that much. Anyway, I hope you enjoy this anime as much as I have. I highly reccomend it to any fantasy/romance lovers who like a little silly but also slightly corny side to it.",
            "date": "2013-02-22T10:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 87569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/597359.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/moonlitneko",
                "username": "moonlitneko"
            },
            "url": "https://myanimelist.net/reviews.php?id=87569"
        },
        {
            "content": "I came in with expectations before watching this because I had finished reading the two-volume manga a week before. Both the anime and manga are based on the light novel, but it seems the anime took things a little further and didn’t include what was in the second volume of the manga.\r\nAnyway, I know this anime was probably quite popular back in the day with young girls. There’s a beautiful young lady who’s misunderstood and finds comfort in a mysterious and devilishly handsome man who is in need of her fairy services. She can see fairies! He sparkles so much when he saves her life!I think if I were years younger this show would have been the ultimate source of my fangirling.\\n\\n\r\nThe setting for this anime is charming and quaint. Historical anime, especially set in the Victorian era, is always quite interesting due to how well the writers pay attention to clothing, speech, and other little details that make the time period credible. If you like seeing people in dashing coats and open collars, long dresses with petticoats and ruffled sleeves, top hats and canes, then this will definitely be appealing to you.\\n\\n\r\nThere’s that fairy lore aspect as well. Even though I’m a grown adult, I’m still quite fascinated by magical fairy tales, having grown up in a time where Disney made my childhood. This show doesn’t shove information down your throat, either. Lydia doesn’t act like some kind of dictionary when she helps the earl with his fairy business. She feeds him tidbits of information when he asks or when it’s necessary. There’s no time to talk all about the fairy world. All there is to know is that it’s there and there are some rules to follow, which aids in keeping one’s imagination vibrant.\\n\\n\r\nAdventure-wise, though it keeps moving and engages the viewer, I think a little bit of it was muddled and confusing. While having legends to follow and read about is interesting, when they became more convoluted it was harder to follow what the characters had to do in order to accomplish their goals.\\n\\n\r\nThe earl’s true origins also brought the show to a new level. All I can say is that he’s not the perfect prince that he initially appears to be; he’s got a lot of dirt and it complicates the entire plot, especially the romance.\\n\\n\r\nEven though MAL doesn’t give this anime a romance tag, I think it definitely should have one. Anyone looking at the cover of the anime, manga, or light novel would know that there is a gigantic shipping between the fairy doctor Lydia and the earl Edgar. It would be a little too perfect if their feelings for each other were clear from the beginning, so there’s the problem of Edgar’s womanizing personality and Lydia’s difficulty in believing his declarations of love. It can get pretty frustrating, though it was much more annoying in the manga. The anime does better by giving an additional reason for Lydia spurning his advances, making the question of their relationship credible.\\n\\n\r\nThere’s something a little different about the way this romance is portrayed, though. I’m not sure if it’s customary in the Victorian era, but both characters are very earnest about their feelings. Though Edgar’s personality is a little bit murky, he’s still dead set on making Lydia his and showers her with compliments of love, especially those three little words. Lydia tells him honestly that she doesn’t believe him and even gives him the reasons why she doesn’t think so. It’s a constant battle of wills and reminds me a lot of Asian dramas.\\n\\n\r\nWhile one would expect Lydia to be quite a headstrong protagonist, a lot of the times she’s put in the position as a damsel in distress because she can’t fight against strong men with guns and knives. Her strengths as a character, therefore, are in her knowledge of fairy lore and her belief in herself. She’s a strong-willed person due to how long she’s had to endure people’s ridicule towards her profession. She trusts her instincts above all else, and she’s hardly wrong because of her fairy instincts.\\n\\n\r\nThough I wish she were nicer to Edward, she’s very much a friendly girl and is the kind of person I’d want to know. She’s smart and her desire to do a good job as a fairy doctor drives the show successfully. A lot of this show has to do with her becoming a new person because of Edgar and because of the trials she goes through which put her experience to the test. I think it’s wonderful to see a heroine bloom like this.\\n\\n\r\nEdgar is a whole different story. While I’m a sucker for attractive gentlemen, I’m annoyed when they almost never change their cool expression. It also may be the strange color of his eyes which makes it seem that way. His emotions are hard to read and at times I felt that Lydia may have been right to say he was bluffing. Additionally, his uncovered dark past is pretty bad and contrasts greatly with his current status, so it feels unreal and a bit over dramatic.\\n\\n\r\nYou have to like his suaveness, though. If you can sympathize with his history, his transformation into the earl he is now reflects the great strength he has inside of him. He’s a courageous person and stops at nothing to obtain what he desires. Of course, his aims change the longer he spends time with Lydia. He never fails to be the prince-like character that every girl dreams of.\\n\\n\r\nAs much as I hated how perfect Edgar seemed sometimes, he looked gorgeous, as did Lydia. The character designs imitated the delightful light and lovely look from the manga and light novel. While they do have the same large-eyed girls and smaller-eyed men that are frequent in shoujo, they’re still lovely. They even carry the important colors over: the long and springy hair of Lydia’s that people often call “rust-colored”, Edgar’s unique ash mauve eyes, Lydia’s peridot green ones that see everything of the world, and Edgar’s noticeable blond hair.\\n\\n\r\nThe fight scenes in here were hard to understand. The people moved too fast and it was difficult to comprehend who did what. I suppose part of that is due to the incredible speed of fairy world creatures, but it’s really quite a shame. I think otherwise the animation for this show was fine, though, given it was aired in 2008.\\n\\n\r\nI can’t say that the soundtrack was that spectacular. There were the light and quirky tracks for mischievous moments in which brownies stole cookies, little classical string pieces when the earl and his fairy doctor went out on walks, and so on. The soundtrack worked for most of the show.\\n\\n\r\nWhat I had an issue with was the OP. I didn’t think that poppy piece with electric guitars and violins suited the anime setting. I would have preferred a quieter piece to go with the seriousness of the story and ancient fairy lore. I suppose this type of OP would be appealing to the young folk it was geared toward, though.\\n\\n\r\nThe first episode left me quite skeptical, but I do have to say I enjoyed watching this anime. Though I’m irritated by how love in Asian dramas can turn out, I still like watching it, so the similar romance in The Earl and the Fairy gave me the same experience. It was also quite nice to see two lovely people in love. The touches of magical history and encounters with mythical creatures were interesting and kept the story going. If you’d really like to enjoy this story to the fullest, though, I’d encourage you to read the light novel.",
            "date": "2016-09-08T22:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 228616,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4817481.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Chinomi-san",
                "username": "Chinomi-san"
            },
            "url": "https://myanimelist.net/reviews.php?id=228616"
        },
        {
            "content": "Anime: Hakushaku to Yousei, also known as Earl and Fairy.\r\n- I would strongly recommend reading the manga before watching this anime. You would be confused otherwise.-\r\nThrough my understandings of this anime, Earl and Fairy is about a girl, named Lydia Carlton, who is a Fairy Doctor. Like her mother, Fairy Doctors can see what others can't. \r\nOne day Lydia received an invite to go to London to visit her father, then her whole world changed.\r\nPros- \r\n- It has mythical creatures in it, like fairies, selkies, and merrows.\r\n- I believe the anime is longer than the manga, which is always good I guess.\r\nCons-\r\n- It didn't explainthe things that you wanted to be explained. Like, for example, what selkies and merrows are. You either have to look it up or read the manga to understand.\\n\r\n- It doesn't really tell about the people's past. It tells you just a little bit about the past but not a lot.\\n\r\n- The ending wasn't what I had in mind; I was expecting something with more action.\\n\\n\r\nOverall-\\n\r\nThis was a good anime but has some flaws here and there. I personally liked the manga more.\\n\\n\r\nI would recommend this anime to people who like European myths. And also to people who have read the manga.",
            "date": "2014-08-04T14:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 155241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3495079.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HeyHarp",
                "username": "HeyHarp"
            },
            "url": "https://myanimelist.net/reviews.php?id=155241"
        },
        {
            "content": "Hakushaku to Yousei is an anime I have now watched twice, and thoroughly enjoyed both times. The story is set in Victorian Britain, and includes action/adventure, romance and fantasy-a strong starting point. \r\nThe main reason I enjoyed this anime was due to the fact it was relatively original, fast-paced, and has an interesting story-line. One of my favorite elements of this anime is the fairy doctor the story follows: Lydia. In most animes I watch the female protagonist is either sweet, week and does not do much or on the other hand, arrogant, loud and annoying. Thankfully Lydia is neither. Though she is feminine andhas a kind heart, she stands up for herself and is rather amusing doing so. \\n\\n\r\nHer relationship with Edgar is an engaging one, though if you are hoping for lots of hot romance you will not find it, the story focuses on the two coming to trust one another etc. Her fairy 'cat' Nico is also an invaluable addition to the cast, along with Cain, a Kelpie who is fighting for Lydias hand. \\n\\n\r\nOverall this anime is an interesting one, with good visuals, an engaging plot and characters who truly come to life.",
            "date": "2014-03-12T09:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 135502,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3623933.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rayandjim",
                "username": "rayandjim"
            },
            "url": "https://myanimelist.net/reviews.php?id=135502"
        },
        {
            "content": "Hakushaku to Yousei (Earl and Fairy) was a surprisingly fun and addictive watch. It takes awhile to get into the series, but after several episodes I was hooked. It wasn't the story that got me. To be honest, the plot wasn't what made the show for me. My enjoyment was much more character driven. The art was pretty good, I thought the style fit the characters and the story well. Lydia's hair was a bit out of hand, though. I'm not sure she brushed it very much :)  The characters were fun. Edgar was undoubtedly my favorite, but Kelpie and Raven were fun, too.Overall, I think this show is definitely worth watching. For fans of Victorian era stories and romance, especially.",
            "date": "2012-09-06T20:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 71733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/725957.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MayTail",
                "username": "MayTail"
            },
            "url": "https://myanimelist.net/reviews.php?id=71733"
        }
    ],
    [
        {
            "content": "I decided to watch this anime after seeing that it has similarities to the movie Howl's Moving Castle. I'm a HUGE fan of British drama and Victorian Era stories, so I had high hopes for this anime. \r\nI have to admit after the first episode I wasn't very impressed. The art wasn't fantastic and it was kind of sloppy. However I decided to give it another chance, and fell in love with Lydia and the story line. The character development through this series is excellent, especially with Edgar, and I was really impressed by episode 12. I also loved the music, it was similar tothe soundtrack of a movie.\\n\\n\r\nI think this would probably be one of my favorites if it weren't for the romantically odd ending. The plot was somewhat resolved, but I felt like the relationship between Edgar and Lydia wasn't completed. It really ruined how I felt about the anime overall. I'm a big romantic, so others might not mind so much. \\n\\n\r\nThe show could easily have gotten another season with it's excellent story, but due to the artwork those possibilities were snuffed pretty quickly.",
            "date": "2014-04-30T06:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 141837,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3726205.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kotoni-Sukina",
                "username": "Kotoni-Sukina"
            },
            "url": "https://myanimelist.net/reviews.php?id=141837"
        },
        {
            "content": "Well, This anime series was amazing so i will start with what i dident like first.\r\nI enjoy more of heavy romance anime's and this anime had romance but not heavy enough but thats my only complaint. The characters were all different and all amazing. The adventure parts were cute and intresting and the outfits that each character wore were for the best of words outstanding! The dresses had alot of detail and made since for the time period and the place they were. The whole series was very well thought out and very accurate for what that time period would have looked like and howpeople may have talked and dressed. Though the series is manely romance,adventure and fantasy there are afew action scenes in the series and though they arent amazing action scenes they were not bad for a romance/adventure anime so i would reccomend this anime for romance fans 8/10\\n\r\n Thanks and i hope you enjoy Hakushaku to Yousei!!!!",
            "date": "2010-04-05T23:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 24723,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/307438.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lamyisme",
                "username": "Lamyisme"
            },
            "url": "https://myanimelist.net/reviews.php?id=24723"
        },
        {
            "content": "Hakushaku to Yousei is unlike any other anime that has been aired, despite some of the cliche romance scenes involved between Edgar and Lydia, plus the unwantef rivalry of a fairy called Kelpie, who is after Lydia ever since they met. The humor and the flow of the story is what makes this series amusing, to say in the least.\r\nThe personality of the characters is quite pleasing, if not tolerable. Edgar may remind the fan's of Ouran's Tamaki, due to being a narcissist at some point, not to mention how Edgar suavely handles women with his smooth talks --- which drives Lydia up the wall,causing her to not trust his his advances on her. On the other hand, Lydia is your typical shoujo, who has caring side, and puts up quite a fight to the unwanted affection shown to her by Edgar. Over-all, Hakushaku to Yousei is a definite must-watch to every Otaku out there!",
            "date": "2010-07-16T07:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 28444,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/266603.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/byeonghuns",
                "username": "byeonghuns"
            },
            "url": "https://myanimelist.net/reviews.php?id=28444"
        },
        {
            "content": "Hakushaku to Yousei...or as they call earl and fairy. the story revolves around Lydia Carlton, a fairy doctor who can see, hear and talk to fairies. while going to a ship towards london she meets the handsome, smooth-talker Edgar J.C Ashenbert. Edgar asks for Lydia's help to search for the sword of merrow to gain the title of earl of the blue knights. with Lydia's fairy abilities they can easily track the sword but its not as easy as it looks like. encountering different characters which will make their journey long. plus, edgar's romance advances to lydia making their journey enjoyable.\r\nthis anime maybe a typicalshoujo anime but it has some great story plot which makes you want to watch it even more. this is a definite anime for a true-blue otaku. :D",
            "date": "2009-07-13T05:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 16722,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/176394.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jellabee",
                "username": "jellabee"
            },
            "url": "https://myanimelist.net/reviews.php?id=16722"
        },
        {
            "content": "My enjoyment is an 8. I love this type of romance but I don't like adventure type mixing in it at the same time.\r\nStory: 7\r\nSometimes the storyline confuses me about the fairy world.\r\nCharacter development was nice, although it felt unfinished in the ending episode.\r\nArt: 8\r\nI like the art, Edgar and Lydia were good-looking enough to keep me sitting through this anime.\r\nI love those little fairies, although they don't appear frequently, I still remember their cuteness.\r\nThe whole concept was kind of similar to Vampire Knight but at least this is lighter than VN's art. And it's dark enough for a mystery anime.\r\nHow is my art reviewget more lines than Story review though...\\n\r\nSound: 6\\n\r\nI didn't care much about it, maybe it's too fair and not memorable.\\n\r\nCharacter: 7\\n\r\nLydia is not too special, she's a tomboy, more of tsundere to me, but honest, innocent.\\n\r\nEdgar is handsome, cool, playful, mysterious and some. But as you can see if you already watched the whole you can get disappointed because things don't come clear how he called another woman's name while admitting his feelings for the listening woman.\\n\\n\r\nEverything was merely fair and nothing really stands out to me. So I just give it a 6.\\n\r\nI don't think this anime is underrated, people.",
            "date": "2015-03-29T01:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 183885,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4301859.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vuivui169",
                "username": "vuivui169"
            },
            "url": "https://myanimelist.net/reviews.php?id=183885"
        },
        {
            "content": "Well first off,this anime is shoujo-fantasy-like,so if you don't like it you shouldn't watch it.\r\nI really really liked the story as this plot had a clear goal from the start,to become the Earl-King.I also liked how this story was during the Queen Victoria's era,1880s.\r\nI like that the main male lead is a dangerous person,like,no is a killer.Then he meets a fairy doctor who is ever so kind and he falls in love with her.\r\nI also like that the art is beautiful and delicate,as expected for a fairy show.I really thoroughly enjoyed myself while watching this show and i really really recommend you to watch thisshow.",
            "date": "2011-10-23T05:34:00+00:00",
            "helpful_count": 0,
            "mal_id": 46075,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/786879.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mizu_chi",
                "username": "Mizu_chi"
            },
            "url": "https://myanimelist.net/reviews.php?id=46075"
        },
        {
            "content": "First of all, the story is great.It has elements of fantasy and romance. I think they should do a season 2. I want more! After watching the ending, \"Is that it?\", I thought. The art is unquestionably outstanding. The sound is also great. I love the opening song! I gave the character segment an 8. I didn't really get some of the characters in the story, especially Edgar. Does he really love Lydia? Then why is she thinking of Ermine? My favorite character is Lydia. She's kind and the fairy doctor stuff is really cool! Enjoyment, I gave it a 9. It's really worth watching.But again, I want more! SEASON 2!!!",
            "date": "2009-03-30T06:04:00+00:00",
            "helpful_count": 0,
            "mal_id": 13610,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/119008.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/smnt_cdg",
                "username": "smnt_cdg"
            },
            "url": "https://myanimelist.net/reviews.php?id=13610"
        },
        {
            "content": "First of all, the guy character is so so so cute....the girl is pretty....their love story is really romantic...but i wished they could make more episode for this story...the story line is great! but i hope they make more episode for this story....i really really love story...is really a classic love story...and i just love how the guy character can't just live without the girl...i just love how the girl don't just give herself to the guy because there are some anime where the girl character give herself to the guys which is so cliche.....then, i just love how they make all the magical creatures...thecreator of this story is creative...i think that's all from me...hope you enjoy this story!!",
            "date": "2012-02-23T06:14:00+00:00",
            "helpful_count": 0,
            "mal_id": 54573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1143237.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zen169",
                "username": "zen169"
            },
            "url": "https://myanimelist.net/reviews.php?id=54573"
        },
        {
            "content": "This is very cute anime.  I am usually not into relationship based shows but I really liked this one.  Although, there was not much to the plot but enough to make the show interesting enough.\r\nThe romance in the show is very sweet.  \r\nThe main female character in this story is named, Lydia who is a fairy doctor.  At the beginning of the show she is living in Ireland when she gets a letter in the mail from her father asking her to come to London to see him.  As being Daddy's little girl, she accepts and boards a boat toLondon.  \\n\r\nHowever, when she gets to her room on the boat a man comes out of her closet claiming that people were torturing him and asks if she could help him escape.  She agrees.\\n\r\nAs they are running away from the men, the jump off the boat and into another ocean liner where they are being whisked away to London.\\n\\n\r\nIf you enjoy mythical creatures and romance then I suggest you see this show.  If not, I don't think you will find this show very entertaining.\\n",
            "date": "2011-01-02T22:12:00+00:00",
            "helpful_count": 0,
            "mal_id": 33373,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheUltimateKalie",
                "username": "TheUltimateKalie"
            },
            "url": "https://myanimelist.net/reviews.php?id=33373"
        }
    ]
]