[
    [
        {
            "content": "This show really balances on mediocrity. I know people who enjoy this but I'm just not feeling it, let me explain. Or try.\r\nMeet male character. Male is easily flustered. Male accidentally gropes woman. Male has tons of women who find interest in him. Male wakes up with VIOLENT MAGIC FEMALE #7281 in bed. Male freaks out. VIOLENT MAGIC FEMALE #7281 attacks male. I'd call her a tsundere but she hasn't said the standard legal amount of \"baka\" for her to count so I guess she's a revolution in character design. She doesn't wear panties. There's a plot by the way. Blah, blah blah. Ghosts. Done.This show is also revolutionary in the sense that there's a female character who gets just as flustered and overreacts in just about the same way as main male character. She hits people constantly with a paper fan because slapstick is funny. That was the best part of the show I think. It was all a blur.\\n\\n\r\nThe animation quality is pretty good with plenty of movement and expression. It's the best part. The music can also stand out at times, which is nice. But the characters are so cliché and empty that it's hard to care about any of this. Sure there's action, sure there's all the girls you could ever want. All sorts of flavors of woman show up. Bazinga. \\n\\n\r\nDid I mention the main character is edging on shota territory?\\n\\n\r\nThis show is nothing. It's average. You've seen everything in this before and probably better too. It's not that bad, but it's not good either. MAL says 5 is average so that's what it gets. The animation is the best part so if you just want to see some flashy poofs and bangs then here you go. There's also the bog standard shoddy CG though so you'll have to ignore that but honestly if you watch enough seasonal anime you've probably gotten well used to seeing all sorts of meh and garbage CG. At least it's not Berserk (2016/2017). Am I really in the universe where a 5 out of 10 show is better than a Berserk adaption? Help me.\\n\\n\r\nDid I feel anything watching this show? Any human emotion? Maybe. I don't remember. I just watched this show and I've already forgotten all sorts of details. What were the character's names again? I think the main character made a ghost go away by telling her that she should come over some time. She got horny and the ghost disappeared. Where am I? Did I mention there's some crow lady with big ol' baps? That'll go over good on Danbooru. Boing. Honestly take away the sex \"appeal\" and this feels like a show for little kids. Did I mention the part in the OP where female rasengan gropes the male in the gonads? Is immaturity a genre?\\n\\n\r\nDo I sound bored? Am I rambling? That's what happens when you try to put effort into reviewing something that is decidedly average at best. You might like it. Give me some alcohol and I think I'd like it too. And it wouldn't be that much alcohol too. There's much worse than this show. There really is. But it's so nothing. Come to look at the animation and then stay for some reason I don't know. There were jokes. Maybe you'll laugh, I didn't. I love comedy anime too. Give it a shot, or not. I recommend it maybe. Maybe I'm biased against this show I never heard about until this morning. Everyone seems to enjoy it more than me except for the few that didn't. 5/10",
            "date": "2017-04-17T23:23:00+00:00",
            "helpful_count": 61,
            "mal_id": 245752,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4445996.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/UtterSpartan",
                "username": "UtterSpartan"
            },
            "url": "https://myanimelist.net/reviews.php?id=245752"
        },
        {
            "content": "I don't usually make reviews for generic anime... like yeah, usually generic anime are quite bad, but this is quite different for some reason. there are generic anime that for some reason ends being quite better than your average generic anime. but why Tsugumomo? what does tsugumomo do better than others? at least SLIGHTLY better?\r\nStory 6/10: \r\nAside from the generic setting of school and your typical beta male of harems, I dare to say that the \"power source\" of this anime is quite unique, or at least I haven't seen overpowered blankets of cleansing as something you could fight with. I don't know how torefer to the \"evil\" source of weird things happening around Kazuya. so I'll refer them as some sort of evil \"youkai\" or just evil spirits, poltergeist whatever. evil spirits that takes possession over objects, dark feelings, etc etc etc. and it manifests into whatever it possessed and takes control of it. there is an order of \"Tsugumomo\" users (or cleansers) they fight against evil spirits to cleanse them, also they can fight against other users, using... crystal dicks? \\n\\n\r\nso you will see a 50/50 of Kazuya and her Obi cleansing evil spirits and having ecchi scenes, some of them are EXPLICIT as fuck, and yeah, for a show like this to be even MORE explicit than animes like Highschool DxD or Testament of Devil Sister, at least for me, this is a good thing to do rather than making sex jokes that ends on extreme blushing, but Tsugumomo does it on another level, it might not be shown visually (otherwise this would be a Hentai) yet I'm 100% sure of what I saw on a certain episode\\n\\n\r\nArt 7/10:\\n\\n\r\nNothing really special, the Art is okay, there are some good looking action scenes (like the final fight) gladly you will spot some derpy faces in order to make some memes as reactions (I.E Kiriha Bursting of laughter face)\\n\\n\r\nSound 6/10:\\n\\n\r\nBlue Satanya singing the \"Flan Song\", Kazuya being a crybaby, Kazuya having boners, these are some \"features\" of the sound department (all hail blue Satanya Flan Song)\\n\\n\r\nThat aside the Soundtrack is OK, nothing really outstanding, but good enough to sound on fights or comedic scenes\\n\\n\r\nCharacter 6/10:\\n\\n\r\nGeneric Cast... yes but what does make Kazuya better than your average generic males on this kind of anime? take an example of the asshole Masamune of Eromanga-sensei, they aren't ashamed of how ero their light novels are, but he can't fucking decide which girl to choose, and we have Kazuya, who got laid by his entire harem on a explicit way. also he BREAKS the \"I won't use you because I'll hurt you\" or \"I'm unable to do something if it ends hurting someone\" cliché events that ends on the MC losing a fight. \\n\\n\r\nI also like how this anime goes wild when it comes to ecchi/romance/explicit scenes, like, you won't get a cliché interruption on something like a kiss (in this case, something more explicit) if you see that \"something\" happened, it actually happened\\n\\n\r\nEnjoyment 9/10:\\n\\n\r\nI don't usually enjoy generic anime, but Tsugumomo does something about it, its funny, and when it goes wild, it manages to take me by surprise, specially when it comes to those explicit things I've been talking about. also all these stuff of Obi vs evil spirits is quite interesting overall, I'm not saying that this anime innovates something, but it does stuff that others generic anime don't (like for example why Rakudai Kishi no Cavalry succeeded more than Asterisk)\\n\\n\r\nOverall 7/10:\\n\\n\r\na good catch if you want some comedy and \"dirty time\" ( ͡° ͜ʖ ͡°) a wrong catch if you are looking for something different",
            "date": "2017-06-18T10:56:00+00:00",
            "helpful_count": 35,
            "mal_id": 250254,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5202766.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HereticHunter",
                "username": "HereticHunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=250254"
        },
        {
            "content": "Tsugumomo which is adapted from the manga of the same name is an interesting anime that has a rather unique premise and story behind it. Very few anime these days actually have names that relate to the subject matter of the anime itself and in this case Tsugumomo is probably the first example I actually seen. Tsugumomo which is something that actually exists within Japanese traditional legend are essentially objects that after long years of use and cherishment by its owners have gained sentience and their own bodies and through the use of magic spiritual abilities. Tsugumomo combines this premise with a traditional exorcist storylinethat works similarly to the likes of Twin stars exorcist which pairs the Tsugumomo with someone that has with a bond with the Tsugumomo thus creating a team that can be used to deal with hostile enemies that have been possessed by evil miasma. \\n\\n\r\nStory and setting \\n\\n\r\nThe main story for Tsugumomo largely takes place within the town of Kamioka and the surrounding areas and takes place in the modern time period. The story follows the life of Kazuya Kagami a normal high school student that one day is confronted with the fact that the obi that he had inherited from his mother had somehow become sentient and thus introducing him to the world of Tsugumomo’s and malison cleansing. The story behind Tsugumomo is essentially a fusion of comedy and action that is derived from both the everyday lives of Kazuya and his duties as a malison cleanser.  \\n\\n\r\nThe unique nature and setting for this series story means that apart from having a rather unique story and setting it also has many interesting enemy types that are tied with the theme itself. With the enemy’s in this series I liked the fact that in going with the theme they tend to revolve around the target’s inner desires which also affect how powerful they can be. One of the things that are present in each episode that I particularly like is a short introduction of the enemy type that is to be featured in each episode. I thought that these were informative and useful to the viewer. \\n\\n\r\nKazuya\\n\\n\r\nKazuya voiced by veteran seiyuu Yuuko Sanpei of Boruto Naruto Next Generations and 3 Gatsu no lion fame is one of the main characters of the series and is the main protagonist of the series. In the beginning of the series Kazuya was an average teenage boy that attends the local high school. In the beginning Kazuya as a person did not have much personality traits that made him really stand out. In the beginning of the series Kazuya’s chief personality traits was that he was honest, understanding and kind hearted but tended to get scared easily. These starting traits of his though weren’t completely removed as the series went on but stayed and were improved upon as the series went on. As the series progresses Kazuya as a person also starts to improve thanks to the challenges that he and Kiriha overcome as well as the results of the bonds that he forms with people that he helped. Because of these improvements Kazuya becomes more dependable as he comes to understand the role that was given to him and more determined to help those that need his help. More importantly because of his new-found determination Kazuya also become much more brave and willing to take a stand against a terrifying opponent and end it there before it can hurt anyone else. \\n\\n\r\nKazuya’s defining trait is without a doubt his kindness as though his role as a malison cleanser means that he will have to deal with hostile creatures that are born from evil malison such as the various types of Amasogi Kazuya always tries to understand the reason that they were formed from and understand what led to them being formed. This trait of trying to understand the reason behind how they were formed puts him in good stead as though he must deal with them eventually Kazuya at least tries to understand them and determine what the reason behind them was before exorcising them. This trait of trying to understand your foes I felt was nice to see. \\n\\n\r\nThe bond that Kazuya shares with his partner Kiriha is without a doubt one of the center pieces of the series. In the beginning of the series we can see that though Kazuya was grateful to Kiriha for saving his life that he didn’t fully trust her and indeed did not really know who she was other than the fact that she had materialized from his mother’s obi. At this point Kazuya often finds himself being abused and taking advantage of by Kiriha who takes advantage of his kind and honest personality. Often Kazuya is forced by Kiriha to serve her by getting things for her. Though their bond started off on a wrong foot as the series progresses however the trust that Kazuya and Kiriha develop with each other starts to manifest more with Kiriha more willing to listen to him. Though still lording over him a result of the trust that the two have built up means that both Kiriha and Kazuya have developed a partnership between the two that shows how much they care for each other. Notably in later parts of the series Kazuya tries to ensure that he doesn’t use Kiriha’s true self in his attacks as this will affect her life. \\n\\n\r\n In overall, I felt that the character of Kazuya was a well-rounded character that was well designed. Though at first, he was a rather average character with few distinguishing characteristics I felt that the character development for him was well done and seeing the character gradually transform from an average Joe to someone that has both conviction in his duties and compassion and understanding that enables him to understand the events that led to a amasogi’s formation. I felt that his seiyuu Yuuko Sanpei really did a great job portraying the character of Kazuya. \\n\\n\r\nKiriha \\n\\n\r\nKiriha voiced by veteran seiyuu Naomi Oozora is one of the main characters of the series and is the series main heroine. A veteran Tsugumomo that has lived for a long time Kiriha is the manifestation of Kazuya’s mother’s obi and had previously served her. A feisty and mischievous young woman that’s boastful and has a lot of self-confidence Kiriha has a personality that can be said to be a direct contrast to the one that Kazuya has. In addition to being feisty and mischievous in the beginning of the series Kiriha also had a rather self-centered personality that when combined with her feisty nature really made her hard to deal with for Kazuya as he often become victims of her impulsive nature. However though lazy and slothful when she’s at home when dealing with hostile forces Kiriha adapts a more serious nature that’s more serious, cautious and focused on dealing with the enemy using the best way possible. Similar to Kazuya Kiriha is one that doesn’t like to destroy Amasogi entirely proving that she too detests mindless destruction if it can be avoided. \\n\\n\r\nKiriha has a number of running gags within the series that help define her character. Firstly, is Kiriha’s love of fooling around with others that comes from her teasing nature. Although not harmful these episodes of fooling around which most often targets Kukuri is a sign of the trust that she has in the people that she teases though this is something that she wouldn’t like to be found out. The other running gag of the series regarding Kiriha is her love of pudding and her desire to have one every day. When she doesn’t for some reason get what she wants Kiriha tends to be more impulsive than usual with a notable exception when she created a song for not getting one. \\n\\n\r\nKiriha’s bond with her master is one of the main aspects of this series and also serves as a means for her development as a character. In the beginning Kiriha did not really have a high opinion of Kazuya both as a person and as a fighter. As a result, she often treated him harshly and in turn created a sort of master slave relationship that only she believed in. As the series progresses however and as Kiriha sees how determined Kazuya has become in becoming a malison cleanser her attitude towards him changes and she begins not just advising him on the various Amasogi that he must face but also in training him as well. By the end of the series Kiriha’s trust in Kazuya has become strong and that she really respects the strength that he has developed over the series. I felt that Kiriha as a character was a pretty well-designed and that her seiyuu Naomi Oozora really did a great job portraying her. \\n\\n\r\nKukuri \\n\\n\r\nKukuri voiced by veteran seiyuu Yurika Kubo of Urara and High school fleet fame is one of the main characters of the series and one of Kazuya and Kiriha’s allies. The goddess that is charged with watching over the area that Kazuya and Kiriha and their allies live in Kukuri is a contrast to Kiriha’s feisty personality in that she is a friendly young woman that however has a tendency of being overly proud of her status as a god. At the same time, she is also rather dutiful and serious about her duties as well. Kukuri’s most prominent trait is no doubt her humble nature as despite her status as a god she never looks down on people and always treat people with respect whether they are fellow gods, humans or Tsugumomo like Kiriha. Kukuri is also very diligent and willing to help in performing small tasks which is also another contrast with Kiriha’s lazy nature. Like Kiriha Kukuri also has a running gag within the series with her being not being taken seriously by others despite her status as a god. This little byplay is most often seen when she’s with Kiriha and is always a funny thing to see. \\n\\n\r\nThe character of Kukuri i felt was an interesting character and was perhaps the last image that I had when picturing a god. The byplay between her and Kiriha was funny every time I see it and her humble and diligent nature actually made her pretty cute. I felt that her seiyuu Yurika Kubo really did a great job voicing her. a notable trait of Kukuri is the fact that she speaks in an accent that’s very peculiar and uses words not often seen in conventional Japanese. This serves to make her even more charming though.  \\n\\n\r\nChisato \\n\\n\r\nChisato voiced by new seiyuu Noriko Shibasaki is one of the main support characters of the show and one of Kazuya’s allies within the series. A childhood friend of Kazuya’s Chisato is also the class rep for the class that Kazuya is in and as such is often the one that chides him when he’s distracted by something. A cheerful, upbeat and positive person that’s also kind and caring it can be seen quite easily that Chisato cares a great deal about Kazuya. As a result, her first meeting with Kiriha was a nasty shock to her as she now must contend with her for Kazuya’s attention. Despite that as the series progresses their relationship soon turned to respect instead. Though a mere human being when compared to the likes of Kukuri and Kiriha Chisato like her fellow human ally Osamu can assist Kazuya by using their intelligence and reasoning to help determine things that he might have missed. Though only a support character I felt that for her first role Noriko Shibasaki actually did a pretty good job of portraying the character of Chisato and I hope that she will continue to improve her skills and get more roles and establish her career. \\n\\n\r\nSunao\\n\\n\r\nSunao voiced by veteran seiyuu You Taichi is one of the main support characters of the series and is a plot central character for the latter part of the series. A fellow malison cleanser like Kazuya Sunao is a confident, determined and passionate person who unlike Kazuya wanted to become a malison cleanser by choice. Apart from her desire to become a malison cleanser what really sets Sunao apart from Kazuya is how she perceives the Tsugumomo. Unlike Kazuya who sees tsugumomo’s as partners and treats them as such Sunao however sees them as nothing but tools that should only act when she commands them to and not be treated as anything else. In a way, the contest that erupts between the two is as much as a contest of strength and techniques and one that pits their perception and views of Tsugumomo. In a way Sunao really isn’t really a bad guy in truth but they were forced to be on opposing sides because of their vastly different views regarding Tsugumomo and how they should be treated and used. Unlike Kazuya whose role as a malison cleanser was forced on to him Sunao willingly accepted her role as one and as such her abilities as one far outstrips Kazuya’s skills.\\n\\n\r\n Never less seeing Sunao go up against Kazuya and seeing them go straight out against each other was interesting as was seeing the techniques that she used which is very different to how Kazuya usually fights.  I felt that Sunao as a character was a well-designed one and introducing a character that was like Kazuya but views Tsugumomo differently was a good move. The clash of both ideology and might between the two I felt was nicely done as it highlighted the strong bond that Kiriha and Kazuya have forged over the battles that they have been through and proves that friendship and trust can beat even people that are more powerful that you are. \\n\\n\r\nArts and animation \\n\\n\r\nArts and animation for the series I felt was pretty good. The character designs for the characters I felt were done pretty well and was largely faithful to their counterparts in the manga. The various environments that the cast fight in was also well detailed. The animation for the series I felt was pretty good with the fight scenes between the various types of Amasogi being of high quality. However, I felt that the final dual that took place in the anime had the best animation in its fight scenes though compared to earlier battles. \\n\\n\r\nMusic \\n\\n\r\nThe music for the series I felt was reasonably good in regard to both the scene music and the opening and ending themes. The combat scenes in particular had some pretty good scene music that changed depending on the battle is going and I felt that this was well designed. The opening theme for the series which in this case was METAMORISER by Band Ja Naimon I felt was pretty catchy and helped convey the comedic side of this series which is helped by the visuals that is shown during the opening song. This is contrasted by the ending theme which is I4U which is sung by veteran singer Michi that seems to convey the bonds and friendships that Kazuya has formed with his friends and allies. Of the two I would say that the ending theme was actually one of my favorites because of the message that it conveyed and the visuals that were used there.  \\n\\n\r\nVoice acting \\n\\n\r\nThe Voice acting for the series I felt was pretty good with particular praise going to Naomi Oozora and Yurika Kubo who voiced the characters of Kiriha and Kukuri who I felt did a great job portraying their characters and making them stand out. Other seiyuu that I felt also did a great job was Noriko Shibasaki who despite her thin role managed to portray the character of Chisato reasonably well. One seiyuu that really surprised me in this series was You Taichi who voiced the character of Sunao. Though I have heard her voice before most notably in Owari no seraph in which she had a minor support role her performance here I felt was excellent as she managed to portray the character that she had been assigned to here pretty well. Indeed, after Kazuya and Kukuri Sunao is my third favourite character which is largely due to her hard work. \\n\\n\r\nOverall conclusion \\n\\n\r\nIn overall, I felt that Tsugumomo was an interesting anime that’s main advantage was the fact that it had an interesting theme, story, characters, fight scenes and capable voice acting from a young voice cast. The theme of the series which is actually derived from a commonly held belief that states that if you treat an object with care over a period of years that it will eventually gain sentience. This theme itself I felt was pretty interesting and served to only enhance this series and make it more interesting. The overall story of Tsugumomo can be said to be a fusion of a comedy and an action anime and in this I felt that it succeeded as the series itself had plenty of good comedic moments as it has in good fights. The overall story I felt was reasonably interesting and seeing how Kazuya and Kiriha grow in power as they forge a bond that is formed from executing their duties of clearing malison from their area of operations and confront increasingly powerful enemies was really enjoyable. Though the series itself did make use of a villain of the week troupe that is most often seen in tv shows each of the enemy types that was featured in the series apart from having great fight scenes where they were exorcised also features a period where the cast investigates the nature of the enemy which in this case is often a Amasogi and from there determine what was the true reason that caused it to form. This aspect of finding an aberration and then trying to determine the reasons that caused them to form before ultimately fighting them after understanding the reasons for their formation I though was well done and gave the impression that malison cleansers are not just heartless exorcists that only live to exorcise Amasogi without trying to understand the circumstances of their formation. \\n\\n\r\nOf course, without a good cast of characters in the series this anime wouldn’t go far even with a great story but in this I felt that the series also did well in. The main character of Kazuya though a rather average person at the start of the series was developed pretty well as the series went on and seeing him forge a strong bond with the main heroine Kiriha and seeing them both increase in power was something that I liked seeing. Seeing and understanding the motivation for Kazuya’s actions and seeing how determined he is with is line of thinking was also something that I appreciated. Though he obviously didn’t want to take up the mantle of becoming a cleanser at first it was nice to see him eventually grow to like the role and also develop the understanding that Tsugumomo are not merely tools to be used in battle like weapons but are living things that have their own personalities like that of a human and should be treated with the same amount of respect. The character of Sunao though a support character also had a large role within the series and was a pretty interesting character that I felt was well developed and acted. In terms of both personality and skill Sunao served as a contrast to Kazuya in that she treated her Tsugumomo very differently to Kazuya while at the same time both her skills and motivations that she has is vastly different to Kazuya’s. As a result, the struggle between the two was as much as a contest of strength as it was a contest against conflicting beliefs and ideologies which made the struggle between them even more interesting to watch as I was curious to see how it would play out. \\n\\n\r\nThough the main cast I felt was developed and used pretty well in the series I felt that some of the support cast could have been used more. The character of Chisato I felt didn’t really have much of a role in the story and could have been used a bit more. The same could be said of Kazuya’s older sister Kasumi who was played by veteran seiyuu singer Ayana Taketatsu. As a result, I felt that their roles were a waste of their talents and I wished that their characters were more fleshed out. As a fight anime, it was important that the series have excellent fight scenes that make good use of the setting and theme and in this I felt that it succeeded. Each of the fight scenes in the series I felt was well designed and thought out that though of a layout that we have seen in other series before was also unique in just enemy types but also determining what their weaknesses were and how their true desire could be factored into the fight as an advantage. The struggle between Sunao and Kazuya that took place near the end of the series notably had some excellent fight scenes that I particularly enjoyed watching.  \\n\\n\\n\\n",
            "date": "2017-06-20T04:07:00+00:00",
            "helpful_count": 16,
            "mal_id": 250420,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=250420"
        },
        {
            "content": "As I was watching this anime something was really bugging me about the tone and vibe of the show. Then about 4 episodes in it hit me. The show is not bad, but the show is not great either, in fact, what was bugging me was the peculiar sensation that the show was so run-of-the-mill, so median, so perfectly average that I couldn't honestly bring myself to complain without feeling a sense of guilt about the fact I was ragging on a show that really hasn't done anything wrong.\r\nThe \"story\" actually begins to become somewhat interesting 4-5 episodes in, which is a good thing forwhat is otherwise an entirely fan service based show. I'd have given up on the show in fact if it wasn't for the fact the jokes were so unabashed. Evolving from the boring and tired meta of \"tease\", \"euphemism\" and \"sexual connotation\" to outright, adult horseplay. At the very least i found this refreshing despite being blatantly perverted. Would you watch this show for its story? Probably not. It's just a nice thing to have supporting the juicy antics.\\n\\n\r\nThe animation is awkwardly all over the place. Going from \"basic as fuck\" to enticingly graphic (when it knows it needs to pull out some aesthetic stops during its service scenes). The thing that really lets the show down though is its background art. This is also in reference to my initial paragraph, everything feels so geometric and clean and it took me a while to figure out why that was so weird and it's because such an empty environment is obviously sterile. It doesn't feel like anyone lives there, it quite literally looks like a \"set\" for a play.\\n\\n\r\nIt's too early to really discuss the characters on account of the fact they haven't been properly developed. We're learning about the MC's heritage and the role he will play in the narrative, the justification for his importance, but in general the MC is about has hollow and husk like as you'd expect in order to get as many people projecting onto him as easily as possible. The word we're looking for here is \"generic\". This is not a sign of a quality narrative, but a reinforcement of the service gimmick that ultimately sells the show.\\n\\n\r\nSo is the show worth watching? Well the humour isn't bad, if not somewhat thin and expectedly cliché in places. But other than that, if you're a novice anime watcher you'll find this show will leave a hell of a lot to be desired. A newbie will get a lot more enjoyment from the show, but then at the same time there are so many better shows waiting to be watched for a newbie. So I struggle to find a justification to recommend this besides the fact the sexual humour refreshingly doesn't beat around the bush.\\n\\n\r\nWatch if you'red bored or desperate and you wont be too disappointed. It's not bad. But it also isn't good.",
            "date": "2017-05-10T17:54:00+00:00",
            "helpful_count": 10,
            "mal_id": 247411,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5840782.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/grazr",
                "username": "grazr"
            },
            "url": "https://myanimelist.net/reviews.php?id=247411"
        },
        {
            "content": "So far into the show, I'm getting vibes similar to that of Omamori Himari and other animes that reference mystical/domestic being living together, the show dance on cliches and takes the dialogue a bit further.\r\nSome scenes where you expect a cliche to happen, the show will disarm you by self deprecating and rewarding you with a little bit of fanservice, it looks interesting and it's pretty funny so far, the main character is a bit of a dense one but the scenes between the main duo are hilarious, give this show a try.\r\nIt's not over the top, it's funny and down to earth and it'sstarting to pick up, don't let the art style and the cover fool you, it's definitely a comedy and it's definitely ecchi\\n",
            "date": "2017-04-21T10:49:00+00:00",
            "helpful_count": 8,
            "mal_id": 245959,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1584923.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Isle352",
                "username": "Isle352"
            },
            "url": "https://myanimelist.net/reviews.php?id=245959"
        },
        {
            "content": "Koko ni itai\r\nDoko ni itai\r\nkotae wa kikanakute mo shitteta \r\ndoko ni itai\r\n koko ni itai! \r\nminna ga omotteru kara  seeno de \r\nkotae wa onaji  kotae wa onaji \r\ntsunagari wa keshitakunainda \r\nuketotte?  uketotta! \r\nMan, that opening them alone was funny, never mind if it's in Nippongo, as long as I like it, ok, so going back to business, this anime may not be much, but it did fine by my ratings.........:\r\nFair 6, story: \r\nOk, so it was a usual supernatural themed story, with something naughty, where it leaves us audience in such imaginative conclusion of some of the things that were being hinted by writer  Ryōichi Kuraya, but the plot itself rely heavily on the main character getting his ass kicked by a cute yokai where atthe same time , she also does some perverted acts that we guys can only imagine.\\n\\n\r\nFair 6, Art:\\n\\n\r\nIn one point it was decent , but in another it was something where illustrator Tajiri san seemly was just to reluctant to go all the way with the fanservices , Panchira was only limited to Chisato at first and then to Tadata and to kiriha in her chibi form, but the full boob flash with Kyouko and everyone else was a disappointment, nevertheless it was fair enough were we were left with a lot to be left in our imagination.\\n\\n\r\nVery Good 8, Sound:\\n\\n\r\nwell the opening theme \" METAMORISER \" was really good for the anime itself and so as the ending theme \" 14U\" did match well with the anime. Also the voices of the characters really did match well , were it can simply tell the characters themselves, so.....................\\n\\n\r\nKoko ni itai\\n\r\nDoko ni itai\\n\r\nkotae wa kikanakute mo shitteta.\\n\\n\r\nGood 7, Characters:\\n\\n\r\nOk, so we have a yokai, Kiriha, who kinda like this domineering wife material were the guy, Kazuya, like a dog, thought I kinda hate Kiriha for being this perverted/ spouse abuser , she kinda makes things funny for this anime and Kazyua himself being this victim makes the comedy genre of this anime add more to it, now add the others like, Chisato, Kukuri and Kyouko, makes this anime much of a competition for the guy's affection, too bad , Kazuya will never be Chisato's husband and so as Kukuri.\\n\\n\r\nVery Good 8, Enjoyment.\\n\\n\r\nWell the comedy, supernatural and the ecchi may not be much , but it was Kazuya's relationship with his Yokai slave, where she is suppose be was basically something that this anime relys on, and very good that they pick one thing and made it real good.\\n\\n\r\nGood 7, Overall\\n\\n\r\nBut in it's overall, this anime is only as good as it gets and another season would be boring, if this anime/ manga relies a lot on the guy getting his ass kicked.\\n\\n\\n\r\nOUT!   \\n",
            "date": "2017-06-25T11:06:00+00:00",
            "helpful_count": 7,
            "mal_id": 251008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=251008"
        },
        {
            "content": "Real Score:6.5\\10\r\nTsugumomo, an adaptation from the homonymous Manga, which got a discrete amount of success. A simple story seasoned with basic yet entertaining characters, some clever ideas and a fun variety of situations. No Breakout whatsoever, but a fun experience overall\r\nStory 6\\10\r\nThe Story is generic and it doesn't have anything interesting to offer, but it has some really clever ideas and good episodes, especially during the parts of the Malison Cleansiment, with interesting twists and ,just a little bit though, a serious tone and sense of resentment of the main character, who questions if he's really the good guy, but it's not explored enough though,and that's a colossal shame because it could have been an amusing mix of comedy and seriousness, even if the result may have been silly. The comedy is funny at times but the Ecchi kind of ruins everything:Ecchi, if used in a clever way or if dosed correctly is humorous, but here it's just too much, it feels forced, out of place and puts the overall tone of the story into childish territory, becoming almost a teenage guy wet dream(Maybe i exaggerated a bit) and damaging the characters that the show is trying to establish\\n\\n\r\nCharacters 6\\10\\n\r\nThe characters are bland and have little to no development, even though in some episodes are surprisingly well-written and  with amusing lines and, well, character; this hurts the show even more, it could have been so much  better if they stayed on that path, without trying to appeal to the lowest common denominator and if they tried taking some risks. The best part is hands down the banter, the interactions between characters, that on their own would have the same personality as my bedside table.When they're together, they're actually fun, hilarious and entartaining: the relationship between Kazuya and Kiriha, despite being a bit clichè, is fun and has the biggest progress of them all:on their own they're nothing, but together they feel like partners, they feel like friends;same for Kiriha and Kukuri, which are believable rivals\\friends when they're together, but alone they seem like different characters.If only the show focused more on the individual, not even much, just 1 episode, even 2 at maximum\\n\\n\r\nSound 6.75\\n\r\nThe Music is weird: the opening is catchy, fast, energetic and perfect for the Show,the OST are strangely  flooded with a Naruto vibe, they're not bad, but they're repeated too much and they get tiring really fast, they're not the best pieces, but they're somewhat enjoyable nevertheless. The music shines in the action battles, this shows how they were made for action scenes, and those scenes alone. It's a ity they did not want to go any further, the soundtrack had potential\\n\\n\r\nAnimation and Direction 7.25\\n\r\nThe Animation is pretty good, rocksolid for the most part of the anime. Some of the CGI used it's pretty remarkable and pretty, but, like the music, they could have done more with the expression of the characters, the lack of detail of some drawings, and,well, increase the value overall, not just being pretty and flashy in action scenes.The direction is solid, good cuts, good corners, the action is easy to see and recognize and some the frames are pretty amazing, especially during battles.\\n\\n\r\nEnjoyment 7.25\\n\r\nDespite the Overflowing of the Ecchi, the bland characters and the basic story, i'm just a normal guy after all, and i enjoyed almost every episode, i found the comedy pretty good at times and a nice ride overall. For one episode a week, they've always been  20 minutes of mere rest and some laughs. I loved the characters interactions and the action was enjoyable\\n\\n\r\nSo this was Tsugumomo, nothing fancy, nothing too special, just a 12 episodes fun ride, with some sull moments, and other very good ones, some interesting ideas, some forceful comedy and questionable situations. See the recurrence?Tsugumomo is part good, part bad, it has some really clever topics, but they're overshadowed by childish comedy and a really poor character development. Despite all of this, i'm hopeful for a future second season, especially if the staff learns from their mistakes and take that amusing route that they've shown in some episodes. Thanks for reading this review, May Our Sweet and Merciful Madoka be with you and let's hope for improvement, or Kiriha-san will probably punch our balls and eat all of our pudding(#SAVETHEPUDDING)\\n",
            "date": "2017-06-19T08:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 250349,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6308811.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AwesomeAlfie27",
                "username": "AwesomeAlfie27"
            },
            "url": "https://myanimelist.net/reviews.php?id=250349"
        },
        {
            "content": "What would be the reason behind a good anime, is it its uniqueness, the funny moment to enjoy, the wonderful character that makes up the anime or the philosophy behind. Well, those are what Tsugumomo has, or will have in the future. Its story of a guy meets up with a supernatural girl is old and classic, but being classic and also enjoyable is a tough challenge. However, it has fulfilled the role quite good with its own combination of everything, bringing funny moments and the unique set of action to captivate our mind. I would not say the story is good for just 12episodes, but reading the manga will bring you to know its true potential for the second season. For the 11 episodes, I have watched so far, I am completely satisfied with the time I spent.",
            "date": "2017-06-12T09:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 249757,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Takros_Knonnar",
                "username": "Takros_Knonnar"
            },
            "url": "https://myanimelist.net/reviews.php?id=249757"
        },
        {
            "content": "Yeah its your generic anime. But doES YOUR MC TURN INTO A LOLI 4 EPISODES IN? \r\nYou can't one up this.\r\nGranted, many people want to divide themselves of what is supposedly good versus what is relatively good INSIDE the story or anime itself. \r\nThis one takes place in a universe where yokai or 'tsugumomo' come to actual life and the story branches on their objectives and what not. But what really takes the cake is the size of each tsugumomo. Larger significantly means more powerful. Lords at shrines are small because not many worshipers.\r\nYou don't understand that whenever you're watching someone protecc and get smallerinto loli size, it just makes my heart warm and that is the reason why I gave this anime a DESERVING score.\\n\\n\r\nThank you.",
            "date": "2017-12-26T13:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 266472,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5144349.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SLZR",
                "username": "SLZR"
            },
            "url": "https://myanimelist.net/reviews.php?id=266472"
        },
        {
            "content": "Tsugumomo is a funny, entertaining anime with a unique premise and pleasant characters that will keep you watching all the way to the end. Overall, there isn't too much to say about it. If you are looking for something that isn't too heavy of a watch with a bit of a lewd chuckle here and there, look no further. \r\nThis series took me by surprise. While not the greatest anime ever made, Tsugumomo has its own special charm that will keep you watching until the final episode. It isn't for everyone but fans of light hearted comedies will be pleasantly surprised. Watching the characters growand bond together kept a smile on my face that lingered even after I'd finished.  \\n\\n\r\nThe animation and sound are superb. Nothing jumps out as being amazing but there aren't any glaring issues, either. The character designs are a bit on the generic side but by no means bad. \\n\\n\r\nThe anime does end with plenty of story left to tell and you will be left itching for the second season coming out next year. \\n\r\nI highly recommend this anime.",
            "date": "2019-04-21T18:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 306862,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6198742.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ArcFloof",
                "username": "ArcFloof"
            },
            "url": "https://myanimelist.net/reviews.php?id=306862"
        },
        {
            "content": "One of the major reasons LA even looked into Tsugumomo is because Naomi Oozora was voicing a character with a Satanichia Kurumizawa McDowell cadence.......no seriously.\r\nTsugumomo is if anything a fanserviced-up harem anime with a dense main male protagonist with some sprinklings of Shinto and Japanese folklore to go along with, however it's VERY scattershot.\r\nTsugumomo's characters are stock at best from our bland main male protagonist Kazuya Kagami voiced by Yuuko Sanpei being the owner of the obi tsukumogami Kiriha voiced by Naomi Ozoora, where she's the extremely abrasive type and that's saying it lightly. Kazuya also has an older sister who's has a crush onhim and is brazen about it, Chisato Chikaishi voiced by Noriko Shibasaki the tsundere childhood friend love interest who's extremely strict at anything pervy (so discount Yui Kotegawa from To Love Ru) as well as the local god of Kazuya's region Kukkuri voiced by Yurika Kubo being the butt monkey of the series along with her stacked disciple Kokuyou voiced by Eriko Matsui. Kazuya's friends also gets some screentime like the perverted womanizer best friend Shiro Shiramine voiced by Sachi Kokuryu and the always reliable otaku Osamu Osanai voiced by Shiho Sasaki. LA's favourite character easily goes to Kiriha however because Naomi Oozora ok. Tsugumomo's progressions mainly character development is largely stunted however due to it's plot format.\\n\\n\r\nTsugumomo's plot format mainly consists of episodic nature for the majority having Kazuya face off against the tsukumogami of the week kind of deal, but it's also spliced in with gratuitous out of nowhere fanservice as well as some slice of life moments that doesn't amount to much. Tsugumomo's plot is a mess is a compliment if anything but for LA, there are a rare few times when the plot was indeed interesting, mainly the Nanako mini arc as well as the rival Sunao Sumeragi finale. The very few characters that seemed to develop a bit of character development are Kazuya and Kiriha but KIRIHA the most mainly due to her backstory. Kazuya yes, does develop but ONLY properly for himself during the Sunao's final episodes. Kazuya does develop in terms of how he uses his powers (a la Kiriha) and he gains the typical \"nice guy, protect everyone\" kind of belief but in all honesty his development was rushed and rather typical of the main male protagonist position mainly due to what little screentime he gets (seriously we get more screentime of minor characters dilemma of the day and development than Kazuya's) that and LA liked Kiriha's backstory more. Some minor character do develop as well due to their focus of the some episodes like Tadataka Tadata voiced by Mikako Komatsu, Shiro and Chisato with Osamu being the helper to the situation at hand but they are left in default mode anyways by the end of it which was a shame as OSAMU was more of a competent character than the entire cast sometimes. \\n\\n\r\nOne of the other interesting things about Tsugumomo at the very least that grabbed LA's attention was with it's interesting actual lore on Shinto and Japanese folklore, mainly the tsukumogami/tsugumomo, objects that gains sentience, that along with the local god Kukkuri wanting Kazuya to be a malison cleanser to get rid of objects gone rogue and we pretty much got interesting folklore mixed into the plot itself that anybody would be interested in however... \\n\\n\r\nOk now to get the elephant out of the room. Tsugumomo has a tendency to cross the line at times, as in sexual harassment and incest as \"comedy\" and even for LA, LA had to squick at the prospects of what Tsugumomo is even doing. LA can understand the gratuitous fanservice, the material adapted from is a borderline-hentai manga but still when it crosses the line...it crosses the line.\\n\\n\r\nIn terms of animation by Zero-G, the animation was decent enough with the over exaggerated expressions being chibified to some decent character designs and the few times they go into fight scenes was \"ok\" at best. Backgrounding was decent though forgettable. Zero-G's best in animation for LA at least went to it's character designs though some are stock generic at times. \\n\\n\r\nNow voice acting, if Tsugumomo has anything it's a melting pot of idol seiyuu's and great voice actors. Naomi Oozora voicing Chieri Ogata from the iDOLM@STER Cinderella Girls series to Yurika Kubo voicing Hanayo from Love Live and Ayana Taketatsu voicing Sachiko Koshimizu from the iDOLM@STER Cinderella Girls as well. *ahem* anyways LA did have ALOT of fun hearing these voice actors in Tsugumomo, the best and obvious being Naomi Oozora but some special mention also to Yurika Kubo, Rumi Ookubo, You Taichi, Yuuko Sanpei AND Mikako Komatsu crossdressing voices as Kazuya and Tadataka respectively and Noriko Shibasaki who only has two roles to her name (including this anime).\\n\\n\r\nTsugumomo is scattershot due to it's plot format and wanting to try EVERYTHING it can to see what sticks but the obvious consistency it has is it's fanservice harem elements, bland characters, episodic nature and it's modern folklore setting. The only two plot points LA will give praise to is the Nanako mini arc for giving us a rather heartwarming minor character development with CONSEQUENCES THAT STICKS and Sunao's finale arc where we see Kazuya develop, yes rushed to all hell but compensated with a rather awesome final bout. \\n\\n\r\nBut as much as Tsugumomo has it's tendencies to ALSO cross the line with it's comedy and fanservice, LA can't exactly hate on Tsugumomo all that much, it's not perfect and LA doesn't expect it too be neither does LA think this is the best fanservice battle supernatural harem. It's in the middle for LA...it's fine and as a bonus, LA got to hear a completely unchecked Naomi Oozora go all out in this anime and that's kinda what LA got from this anime so LA was satisfied with Tsugumomo, scattershot fanservice baggage and all.",
            "date": "2018-03-06T00:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 273162,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=273162"
        },
        {
            "content": "If you find grossly under aged girls in sexual situations objectionable you're gonna have a bad time.\r\nI had a great time.\r\nFor a veteran anime watcher there will be almost nothing in the entire season that hasn't been seen in other animes: a typical weak teen guy protagonist that mostly coincidentally ends up surrounded by females and the accidental nudity scenes just keep raining all over, there is also of course a great threat that forces the weak teen guy to step up and try to become less weak. This is such a stereotypical ecchi harem setup that it's practically a classic.\r\nWhile the charactes are ahuge parade of stereotypes they still manage to feel very true to their natures and their interactions very often end up being absolutely hilarious. Perhaps an intentional side effect of using large volumes of extremely stereotypical content is that when something completely unexpected happens it has far more impact, often resulting in ridiculously potent comedy.\\n\\n\r\nAs for the art and sound it's just quite good and leaning more towards a robust experience than something noteworthy, except just how crazy far some ecchi scenes go. While I'm not giving the show full marks I can't really think of much that could have been done to make it even better, rare situation for someone who loves pointing out flaws!",
            "date": "2017-10-18T13:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 261129,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6311485.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BriefEd",
                "username": "BriefEd"
            },
            "url": "https://myanimelist.net/reviews.php?id=261129"
        },
        {
            "content": "What can I say beyond it is kind of perverted if your into that thing,  I probably would have given this a 7, but I liked dubbed anime's so I can listen in the background in some parts when I am working on something else.  Needless to say starts off pretty shit if you ask me but then gets better and better.  At first I was like what are these fight scenes, plot and all the rest.  Eventually it kind of grew on me and I could see the humor in it.  I would probably never watch this again butit was not the worst for something to chuckle at in the background as I focus on other things.",
            "date": "2017-08-30T10:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 256547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Harizak",
                "username": "Harizak"
            },
            "url": "https://myanimelist.net/reviews.php?id=256547"
        },
        {
            "content": "Quite a surprise here. I didn't have high hopes for this anime, but Tsugumomo actually turned out quite well.\r\nLet's start with genres. There are 3 things worth pointing out: it's seinen, there is no harem tag and there is no drama tag. \r\nWhile Tsugumomo not being harem didn't really save this anime from feeling like one, it gives protagonist a bit more freedom and doesn't need to show us how dense he is every episode.\r\nThis anime being seinen is a wonderful thing for any ecchi fan. No, we don't get anything special. It just means that instead of boobfest and nosebleeds without doing anything wehave more or less reasonable use of nudity and reactions to it, although protagonists is too meek to make satisfying use of it.\\n\r\nFinally, the lack of drama tag makes this kind of stories much more enjoyable. Yes, there are serious moments and there is a story. But the amount of cringe caused by useless tryhard protagonist is limited.\\n\r\nOverall story in Tsugumomo is really basic and not that interesting. It has funny moments, mostly based on characters interactions. Thing worth mentioning is that we get plenty of fanservice that somehow doesn't feel forced.\\n\\n\r\nCharacters in Tsugumomo are a mixed bag. Protagonist is another boring, useless, nice guy that you saw hundreds of times already. Kiriha on the other hand is very solid. She might not be really deep or well written, but she gives this feeling of being a complete character with her own personality.\\n\r\nMost of side characters are forgettable. Some of them fit their role and were fun to watch whenever they appeared, while others were next to useless. On the bright side I don't think any of them felt like a waste of time. They had their roles, played them and didn't stay longer than needed.\\n\\n\r\nArt style is simple and rather bland. Characters look good, but again, nothing special. Animation is where stuff gets better, especially in some action scenes it was considerable above level I expected.\\n\r\nFanservice also deserves mention here. With right angles and covering it manages to be satisfyingly erotic while not going into borderline hentai territory. \\n\\n\r\nGenerally speaking, Tsugumomo is enjoyable anime. It had some annoying moments, all caused by protagonist's weak character, but lack of problematic drama, good ecchi and Kiriha made up for it.",
            "date": "2017-08-29T10:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 256474,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4251395.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yukikaze_sama",
                "username": "Yukikaze_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=256474"
        },
        {
            "content": "Warning possible Spoilers\r\nGoing into Tsugumomo I was just expecting another two misfit characters doing random stuff like fighting monsters or other stuff which is what I got yet it somehow surprised in more ways than I was expecting.\r\nThe story begins with Kazuya Kagami who doesn't go anywhere without his Sakura Obi that his mother gave him until one day a Tsugumomo spirit called Kiriha saved him from an evil spirit and that point on Kazuya's days would never be normal again.\r\nNow the story isn't really spectacular, but it is enjoyable because at least the characters do go around trying to stop evil spirits attacking peopleor being used by people who have been persuaded by the spirits to do evil or weird things unlike Love Tyrant which just gives up it's directive 3 episodes in whereas Tsugumomo actually puts in some effort and it can be quite knowledgeable too which did surprise me a little since I was expecting the characters to mess around which they do, but they do get serious when the situation gets a little hectic and it was interesting how Kazuya and Kiriha were able to beat the enemy and how they got stronger overtime as their partnership became more trustful.\\n\r\nDespite not having a good story it did pick up thanks to the characters and the situations they got into because there were a few moments that completely caught me off guard which I'll explain later, but it showed that it wasn't using the usual cliche's I have seen before which is why I was pretty impressed by this show and the characters were a big help too since they were a bunch of fun and none seemed dislikeable yes even the girl that shows up at the end didn't annoy me surprisingly.\\n\r\nBut it does fall short a little how it the series ends with the usual two people with similar or the same powers going at it to see who is better, luckily the fight was actually pretty cool to see.\\n\\n\r\nNow the characters were a pretty random bunch and were pretty likeable since they offered me a good amount of laughs and surprises.\\n\r\nKazuya Kagami is the male MC and is Kirihas partner in battle, Kazuya is kinda like the usual MC you see in harems yet not as dumb and is more controlled of his perverted desires which is a good start, he is a pretty friendly guy and doesn't hesitate to help people as long as he doesn't find them annoying, at first he wasn't really good at fighting the other spirits, but thanks to working with Kiriha he did get stronger the only downside to his life is that he is constantly getting beaten up by Kiriha if he does something she doesn't like.\\n\r\nKiriha is the female MC and is a Tsugumomo which is a spirit created from sentimental attachment to certain objects, she is a Tsundere and a good one at that as she is a very random character as she'll be kicking Kazuya in the nuts for annoying her to being flirtatious with him to being obsessive over pudding, she likes to be boastful so she can remind Kazuya who's boss, but can be really lazy sometimes as she doesn't like doing things that aren't really to do with her making her have a selfish nature plus she can also be pretty open to anything sexual as she doesn't mind being nude around Kazuya and even flirts with him many times though when the going gets tough she is a loyal and reliable friend to Kazuya.\\n\r\nChisato Chikaishi is Kazuya's best friend and has been his friend since they were little, she is a kind girl though does get frustrated if the boys in her class do stuff that isn't normal or perverted and tends to beat them, but she is a smart person and helps Kazuya with his spirit situations along with his schoolwork, she cares about Kazuya very much often making sure he's alright.\\n\r\nKukuri and Kokuyou are both God's at the local shrine near where Kazuya lives, Kukuri is the one who wanted Kazuya to become an Exorcist so he can destroy the evil spirits, she may be powerful though her form looks like a little girl which doesn't make the others seem intimidated by her and she is often being used as a punching bag for Kiriha since they don't get on very well however when she had to live in Kazuya's house she was a helpful often doing chores with his sister while Kokuyou on the other hand is a much more mature woman often noted by her huge oppai and she is very seclusive with her emotions often having a very mild tone, but she is protective of Kukuri's well being though whenever someone asks to fondle her breasts she doesn't actually mind them doing it.\\n\r\nSunao Sumeragi is another exorcist like Kazuya and is his rival, she is a very direct and hot-blooded person as when she has a goal in mind she is very determined to see it through without giving much thought on the consequences, at first she only saw Tsugumomo's as a weapon or tool, but after her fight with Kazuya she does see her Tsugumomo differently and tries to improve their partnership afterwards.\\n\\n\r\nNow the artstyle wasn't impressive, but I did like some of the forms that the evil spirits took like the giant book monster or the hair monster that looked pretty intimidating, but mostly it wasn't much different from most anime's that I've seen before, although it was pretty funny how the characters design's went from normal to chibi form from time to time which were used to depict comedic moments that were done pretty well.\\n\\n\r\nThe action wasn't amazing, but it had something because there was some strategy involved and usually anime's like this don't put that effort in for their battles so it entertaining seeing Kazuya, Kiriha and anyone else involved in the battles trying to figure out the enemies weakness and then trying to beat it also the final battle wasn't too bad either and I did like some of the moves that were created.\\n\\n\r\nNow the comedy is definitely what makes this an enjoyable show because it was hilarious to watch Kazuya and Kiriha always having arguments with each other that always end up with Kazuya getting a hit in the nuts and the other characters proved to be very funny too as Kukuri and Kiriha also had their moments of fighting each other that was just really funny to watch and probably the best part of the comedy is the amount of sexual innuendos that are thrown at use and it made me laugh my ass off because it worked so well and it mainly came from Kiriha which just made her character even more likeable. \\n\\n\r\nThe ecchi/fanservice was also something that completely threw me off because Kazuya and Kiriha are probably the most chill characters I have every seen nude together because usually one of the characters would blush or just run away of embarrassment, but these two are literally having bath's together and talking in the bed nude like their private parts are just hanging out and their just having a friendly conversation it surprised the hell out of me and that's not all there was one scene with Kazuya and Chisato in the nurses room that surprised the hell out of me along with Kazuya, Kirirha and Kukuri's trip to another God's shrine who had a lolicon fetish and that was really awkward to watch, a lot of the fanservice in this show really caught me off guard.\\n\\n\r\nOverall this show was actually very funny as where it lacks in story definitely makes up for with really surprising comedy and fanservice so if you're looking for a show to give you a good laugh then this'll be a great time.\\n",
            "date": "2017-08-22T07:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 256018,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=256018"
        },
        {
            "content": "Tsugumomo looks like a typical generic shounen action harem show, at least at first sight.\r\nYou've got Kazuya, our weak and average male MC who has to get stronger to fight some supernatural creatures, Kiriha, the supernatural and strong female lead who helps him, some more harem cast, and some ecchi of course.\r\nBut right after the first episode, I knew this would be different, and I would like it.\r\nAnd after finishing, I knew that I was right.\r\nYes it uses generic elements, but many of them in a rather unusual way.\r\nBut there is more to it than just generics.\r\nTsugumomo has plenty of ecchi scenes, but more ina funny way.\\n\r\nNot like for example Shinmai Maou no Testament which is sometimes borderline Hentai, and you see lots of detailed boobs, butts, and lewd SM stuff going on, to make you pitch a tent between the fights.\\n\r\nInstead, you don't get to see any details, but plenty of lewd comments from the acting persons what's going on, or unambiguous visual substitutes of what happens.\\n\r\nAnd there is definitely a lot going on, in fact his whole harem (including his childhood friend and even his big sister) at once gets him off multiple times, and there are quite obvious hints that even more has happend with some harem members, something quite rarely seen, although not really voluntarily from his side...\\n\r\nYou don't get to see many panty shots except those for some comedy, I think mostly because Kiriha does't wear any anyway, which is another comedic element here.\\n\r\nReally, I laughed my ass off during these scenes, I liked very much how explicit Tsugumomo was without being visual explicit.\\n\\n\r\nComedy has a big role in the show, be it stereotypical, lewd, or unconventional.\\n\r\nHave you ever thought of a local goddess getting so weak due to lacking belief and overuse of her powers, that her body transforms to a very young girl?\\n\r\nAnd of that literally poor goddess begging for money of another goddess, and a very lewd one on top of that?\\n\\n\r\nAnd Tsugumomo actually has a plot, though not the most innovative kind, but with quite interesting reference to Japanese popular beliefs.\\n\r\nI mean, seriously, who ever thought of fighting with an obi (a kimono belt) as a weapon, but it works and you get some decent fights.\\n\r\nIt's just a little disappointing that not everything is explained, for example what exactly had happend to Kazuya in his past and why.\\n\r\nThat calls for a second season, but I think one has to read the manga...\\n\\n\r\nCharacter drawing is sometimes quite simple, but without looking lazy, and sometimes more detailed, mostly during any kind of action.\\n\r\nThe only thing I didn't quite like was Chisato's hair style, the high forehead without hair looks a bit awkward.\\n\r\nAnimation is fluent and nice to watch.\\n\r\nI also liked the visual substitutes, like a bunch of hearts popping up, a massive telescopic crane, or the Rin (a cup gong), these always made me grin lewdly.\\n\r\nYou won't see any full front nudity, the most important parts are always covered with towels, arms, soap, blur or stuff like that.\\n\r\nI'm fully ok with that, it fits the show very well, you don't always have to have massive boobs swinging right before your eyes (although that can be quite nice from time to time, too).\\n\\n\r\nSound is nice and decent, all seiyuu voice their character very well, I especially liked Kiriha's voice with that lewd tone, and Kokuyou's deep voice and formal mode of expression.\\n\\n\r\nCharacter design is quite ok, the more important characters all get some sort of development, although that is not the most important part for that kind of show.\\n\r\nI wished that Kokuyou had some more screen time, I really liked her dry comments...\\n\\n\r\nAs Tsugumomo is a comedy show, character design can not work without using stereotypes, because it would be a waste of comedic resources.\\n\r\nYou just have to use the tropes in a clever way instead of showing the exact same template like the cheap generic shows.\\n\r\nI'm sure we all have seen many different male-wants-to-take-a-bath-but-nude-female-is-already-there-scenes, and the female char screams, beats up the male char, or both.\\n\r\nBut when Kazuya rushes in, Kiriha just tells him to wash her back, because he as her servant surely  is here to do that anyway.\\n\\n\r\nI liked Tsugumomo a lot, and even rewatched the most hilarious scenes, still laughing like the first time.\\n\r\nIf you are here just for some boobs, you will be disappointed.\\n\r\nBut if you like lewd humour, I think this is for you!",
            "date": "2018-08-17T18:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 286752,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6796811.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/HajimeAmamori",
                "username": "HajimeAmamori"
            },
            "url": "https://myanimelist.net/reviews.php?id=286752"
        },
        {
            "content": "This is an unusual one.\r\nFirst, it can be quite perverted. Characters end up in very weird/awkward situations. It is something half-way between comedy jokes of To Love Ru, and blunt humor of something like prison school... actually it is quite hard to describe it properly. It is as if it tried to use bluntest lewd jokes without making situation look \"sexy\". I'd say it is quite clsoe to the kind of humor used in \"Kyou no 5 no 2\".\r\nSecond, for some strange reason it has very high quality animation in fight scenes and fairly amazing music. The fights-  and there are fights - canput some of shounen titles to shame. Animation in fights is extremely fluid and well done, and music complements the fights really  well. \\n\\n\r\nSo, there you have it.\\n\\n\r\nStory: 6/10:\\n\\n\r\nAcutlaly a somewhat interesting premise and an unusual one. There's continuous character development through it, so it isn't some sort of silly \"collect all romantic partners\" anime. Character goes through period of growth, gradually improves, new characters are introduced... it is interesting.\\n\\n\r\nArt: 6/10:\\n\r\nThe art is close to the standard modern art (triangular faces and stuff), but the animation is really well done. Basically, it looks somewhat simple, but does not look low budget, and it is surprisingly well animated.\\n\\n\r\nSound: 7/10:\\n\r\nThe battle theme is really well done and very pwoerful. It is something that is worth of being in a very well done fighting game, like blazblue. Heavy and powerful. Perhaps not as powerful as the main t heme of first ajin, or as cheerful tracks of \"monster musume to iru nichijou\"... but it is definitely about average as far as anime tracks go.\\n\\n\r\nCharacter: 5/10:\\n\r\nThey're amusing, have some sort of personality and aren't carton cutouts, but it is hard to say much about them. They're story devices first and character seconds. So they behave according to their role, and pick behaviors that would be most comedic.... so you'd end up seeing them less as characters and more like comedy elements.\\n\\n\r\nEnjoyment: 6/10:\\n\r\nIt is oddly perverted, but once you get over it, it has interesting moments, and surprisingly good fighting scenes and music. Long story short, there's much worse anime out of there.\\n\\n\r\nOverall: 6/10:\\n\r\nOverall, it is worth a watch, but you need to have a very high tolerance to lewd and ecchi jokes. Basically, if you laughed at \"Kyou no 5 no 2\" and saw \"To Love Ru\" and liked it, you'll probably like this title. It isn't really ecchi, but the jokes can be quite perverted.\\n\\n\r\nSo... interesting work, but definitely not for everybody.",
            "date": "2018-03-11T17:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 273606,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=273606"
        },
        {
            "content": "Story: so Kazuya is basically having a normal school day until a evil spirit comes after him and well wanting him until his Sakura Obi appears before him a girl and she defends him from the spirit not long after that battle she tells him she is the master and hes the servant which he agrees too so now Kazuya and Kiriha have to battle these spirit's that manifest from the people of the school awhile also dealing with the girls (ill get to that in the character part) Kazuya life just got a lot crazier.\r\nArt: art is very good nothing wrong with the artat all.\\n\\n\r\nSound: The Op and Ed are decent at best also i watched the dub but all the people or actress were very good.\\n\\n\r\nCharacter: Kazuya is the male lead and well hes the nice and also shy type of guy in this anime honestly though i loved the guy just kind and nice also the shy guy i love that but a good and nice character. Kiriha well she is a bit perverted but also has that mean streak with Kazuya (in a nice way though) others a pretty nice a good character again. Kukuri is a water goddess and is a pretty nice but can be stern at times but again a pretty good character (ill will be adding 1 or 2 supporting characters here). Chisato is a supporting character and is a childhood friend too Kazuya she is a pretty nice character all i can really say honestly. Kokuyou honestly i felt like she was here just for the fan service nothing really more doesnt really show emoticon really but again decent character.\\n\\n\r\nEnjoyment: Things that i liked: the comedy was really good also the action moments in this were really well done as well also the ecchi moments weren't that bad either and were enjoyable. Thing that i didn't like: honestly i cant think of anything i personally enjoyed this anime i guess i could say that the first 3 weren't the greatest but the anime easily got better from there i guess for the people this anime is generic but i again i loved this anime for sure.\\n\\n\r\nOverall: it gets a 8 out of me the comedy was really well done the action that was in it was well done and also the ecchi is not a bad touch either overall a anime easily worth the watch.\\n\\n",
            "date": "2017-07-29T22:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 254198,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=254198"
        },
        {
            "content": "Tsugumomo is one of those anime I feel is underlooked in this season of anime.\r\nI first got interested in this anime personally because of its Japanese culture. Kiriha in particular really interested me with her bossy but confident personality and her unique fighting abilities as a tsugumomo. This anime surprisingly has a pretty interesting story as well as an intriguing cast of cast of characters. \r\nI really liked how the anime shamelessly uses lewd elements to conduct its story, it did not feel really alienating and each lewd element felt purposeful. It crosses a line of storytelling I thought wasn't possible. There's also a goodamount of fights that happen in this story that really hooked me in with these characters. All of this leads to a good balance of comedy, lewdness, storytelling that makes Tsugumomo stand out to me personally.\\n\\n\r\nMy only problem with the anime is that the main character is somewhat boring. He certainly shows his potential growth as a character by the end of the series, but he really never gets to express how he feels about the sexual events that happen to him nor does he show any relatable elements that would make him likable. The other characters can be a bit cliche at times as well, but it never bothered me too much as the story really hooked me in anyway.\\n\\n\r\nI would love to see another season of this anime happen as I hear the manga gets much better later on. This set of 12 episodes I hear is only the beginning of a great story unfolding. If you can personally handle the lewd elements of the show and the bit cliche characters, you're in for a pretty good ride. I highly recommend it!\\n",
            "date": "2017-06-18T13:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 250265,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4889808.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BluePikmin11",
                "username": "BluePikmin11"
            },
            "url": "https://myanimelist.net/reviews.php?id=250265"
        },
        {
            "content": "Cliche, cliche, comedy, ecchi, shounen, fights. Tsugumomo tells the story about a boy he inherited from his mother, a type of \"weapon\" that personifies in a charismatic character, Kiriha, seriously, by far is the most interesting character, our protagonist, Kazuya, is the typical character of ecchi innocent and naive, but with a great heart, super kind and clumsy, with obviously a harem of women behind him, and this is even worse in the manga. What is interesting here, perhaps, is the Kiriha, because she is an extroverted and \"naughty\" type, we see the same sexually attacking the young Kazuya causing in several comic scenes, takingthis is just another generic anime with a protagonist boring. (I apologize for my spelling mistakes)\\n\\n\r\n(PT-Br) Clichê, clichê, comédia, ecchi, shounen, lutas. Tsugumomo conta a história sobre um garoto que herdou de sua mãe, um tipo de \"arma\" que se personifica em uma carismática personagem, Kiriha, sério, de longe é a personagem mais interessante, a nossa protagonista, Kazuya, é o tipico personagem de ecchi inocente e ingênuo, mas com um ótimo coração, super gentil e atrapalhado, com obviamente um harém de mulheres atrás dele, e isso é ainda pior no mangá. O que chama atenção aqui, talvez, seja de fato a Kiriha, por ela ser do tipo extrovertida e \"safadinha\", vemos a mesma atacar sexualmente o jovem Kazuya ocasionando em várias cenas cômicas, tirando isso ele é só outro anime genérico com uma protagonista chata.",
            "date": "2019-04-30T19:35:00+00:00",
            "helpful_count": 0,
            "mal_id": 307510,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7279162.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xRhune",
                "username": "xRhune"
            },
            "url": "https://myanimelist.net/reviews.php?id=307510"
        }
    ],
    [
        {
            "content": "This show really balances on mediocrity. I know people who enjoy this but I'm just not feeling it, let me explain. Or try.\r\nMeet male character. Male is easily flustered. Male accidentally gropes woman. Male has tons of women who find interest in him. Male wakes up with VIOLENT MAGIC FEMALE #7281 in bed. Male freaks out. VIOLENT MAGIC FEMALE #7281 attacks male. I'd call her a tsundere but she hasn't said the standard legal amount of \"baka\" for her to count so I guess she's a revolution in character design. She doesn't wear panties. There's a plot by the way. Blah, blah blah. Ghosts. Done.This show is also revolutionary in the sense that there's a female character who gets just as flustered and overreacts in just about the same way as main male character. She hits people constantly with a paper fan because slapstick is funny. That was the best part of the show I think. It was all a blur.\\n\\n\r\nThe animation quality is pretty good with plenty of movement and expression. It's the best part. The music can also stand out at times, which is nice. But the characters are so cliché and empty that it's hard to care about any of this. Sure there's action, sure there's all the girls you could ever want. All sorts of flavors of woman show up. Bazinga. \\n\\n\r\nDid I mention the main character is edging on shota territory?\\n\\n\r\nThis show is nothing. It's average. You've seen everything in this before and probably better too. It's not that bad, but it's not good either. MAL says 5 is average so that's what it gets. The animation is the best part so if you just want to see some flashy poofs and bangs then here you go. There's also the bog standard shoddy CG though so you'll have to ignore that but honestly if you watch enough seasonal anime you've probably gotten well used to seeing all sorts of meh and garbage CG. At least it's not Berserk (2016/2017). Am I really in the universe where a 5 out of 10 show is better than a Berserk adaption? Help me.\\n\\n\r\nDid I feel anything watching this show? Any human emotion? Maybe. I don't remember. I just watched this show and I've already forgotten all sorts of details. What were the character's names again? I think the main character made a ghost go away by telling her that she should come over some time. She got horny and the ghost disappeared. Where am I? Did I mention there's some crow lady with big ol' baps? That'll go over good on Danbooru. Boing. Honestly take away the sex \"appeal\" and this feels like a show for little kids. Did I mention the part in the OP where female rasengan gropes the male in the gonads? Is immaturity a genre?\\n\\n\r\nDo I sound bored? Am I rambling? That's what happens when you try to put effort into reviewing something that is decidedly average at best. You might like it. Give me some alcohol and I think I'd like it too. And it wouldn't be that much alcohol too. There's much worse than this show. There really is. But it's so nothing. Come to look at the animation and then stay for some reason I don't know. There were jokes. Maybe you'll laugh, I didn't. I love comedy anime too. Give it a shot, or not. I recommend it maybe. Maybe I'm biased against this show I never heard about until this morning. Everyone seems to enjoy it more than me except for the few that didn't. 5/10",
            "date": "2017-04-17T23:23:00+00:00",
            "helpful_count": 61,
            "mal_id": 245752,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4445996.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/UtterSpartan",
                "username": "UtterSpartan"
            },
            "url": "https://myanimelist.net/reviews.php?id=245752"
        },
        {
            "content": "I don't usually make reviews for generic anime... like yeah, usually generic anime are quite bad, but this is quite different for some reason. there are generic anime that for some reason ends being quite better than your average generic anime. but why Tsugumomo? what does tsugumomo do better than others? at least SLIGHTLY better?\r\nStory 6/10: \r\nAside from the generic setting of school and your typical beta male of harems, I dare to say that the \"power source\" of this anime is quite unique, or at least I haven't seen overpowered blankets of cleansing as something you could fight with. I don't know how torefer to the \"evil\" source of weird things happening around Kazuya. so I'll refer them as some sort of evil \"youkai\" or just evil spirits, poltergeist whatever. evil spirits that takes possession over objects, dark feelings, etc etc etc. and it manifests into whatever it possessed and takes control of it. there is an order of \"Tsugumomo\" users (or cleansers) they fight against evil spirits to cleanse them, also they can fight against other users, using... crystal dicks? \\n\\n\r\nso you will see a 50/50 of Kazuya and her Obi cleansing evil spirits and having ecchi scenes, some of them are EXPLICIT as fuck, and yeah, for a show like this to be even MORE explicit than animes like Highschool DxD or Testament of Devil Sister, at least for me, this is a good thing to do rather than making sex jokes that ends on extreme blushing, but Tsugumomo does it on another level, it might not be shown visually (otherwise this would be a Hentai) yet I'm 100% sure of what I saw on a certain episode\\n\\n\r\nArt 7/10:\\n\\n\r\nNothing really special, the Art is okay, there are some good looking action scenes (like the final fight) gladly you will spot some derpy faces in order to make some memes as reactions (I.E Kiriha Bursting of laughter face)\\n\\n\r\nSound 6/10:\\n\\n\r\nBlue Satanya singing the \"Flan Song\", Kazuya being a crybaby, Kazuya having boners, these are some \"features\" of the sound department (all hail blue Satanya Flan Song)\\n\\n\r\nThat aside the Soundtrack is OK, nothing really outstanding, but good enough to sound on fights or comedic scenes\\n\\n\r\nCharacter 6/10:\\n\\n\r\nGeneric Cast... yes but what does make Kazuya better than your average generic males on this kind of anime? take an example of the asshole Masamune of Eromanga-sensei, they aren't ashamed of how ero their light novels are, but he can't fucking decide which girl to choose, and we have Kazuya, who got laid by his entire harem on a explicit way. also he BREAKS the \"I won't use you because I'll hurt you\" or \"I'm unable to do something if it ends hurting someone\" cliché events that ends on the MC losing a fight. \\n\\n\r\nI also like how this anime goes wild when it comes to ecchi/romance/explicit scenes, like, you won't get a cliché interruption on something like a kiss (in this case, something more explicit) if you see that \"something\" happened, it actually happened\\n\\n\r\nEnjoyment 9/10:\\n\\n\r\nI don't usually enjoy generic anime, but Tsugumomo does something about it, its funny, and when it goes wild, it manages to take me by surprise, specially when it comes to those explicit things I've been talking about. also all these stuff of Obi vs evil spirits is quite interesting overall, I'm not saying that this anime innovates something, but it does stuff that others generic anime don't (like for example why Rakudai Kishi no Cavalry succeeded more than Asterisk)\\n\\n\r\nOverall 7/10:\\n\\n\r\na good catch if you want some comedy and \"dirty time\" ( ͡° ͜ʖ ͡°) a wrong catch if you are looking for something different",
            "date": "2017-06-18T10:56:00+00:00",
            "helpful_count": 35,
            "mal_id": 250254,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5202766.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HereticHunter",
                "username": "HereticHunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=250254"
        },
        {
            "content": "Tsugumomo which is adapted from the manga of the same name is an interesting anime that has a rather unique premise and story behind it. Very few anime these days actually have names that relate to the subject matter of the anime itself and in this case Tsugumomo is probably the first example I actually seen. Tsugumomo which is something that actually exists within Japanese traditional legend are essentially objects that after long years of use and cherishment by its owners have gained sentience and their own bodies and through the use of magic spiritual abilities. Tsugumomo combines this premise with a traditional exorcist storylinethat works similarly to the likes of Twin stars exorcist which pairs the Tsugumomo with someone that has with a bond with the Tsugumomo thus creating a team that can be used to deal with hostile enemies that have been possessed by evil miasma. \\n\\n\r\nStory and setting \\n\\n\r\nThe main story for Tsugumomo largely takes place within the town of Kamioka and the surrounding areas and takes place in the modern time period. The story follows the life of Kazuya Kagami a normal high school student that one day is confronted with the fact that the obi that he had inherited from his mother had somehow become sentient and thus introducing him to the world of Tsugumomo’s and malison cleansing. The story behind Tsugumomo is essentially a fusion of comedy and action that is derived from both the everyday lives of Kazuya and his duties as a malison cleanser.  \\n\\n\r\nThe unique nature and setting for this series story means that apart from having a rather unique story and setting it also has many interesting enemy types that are tied with the theme itself. With the enemy’s in this series I liked the fact that in going with the theme they tend to revolve around the target’s inner desires which also affect how powerful they can be. One of the things that are present in each episode that I particularly like is a short introduction of the enemy type that is to be featured in each episode. I thought that these were informative and useful to the viewer. \\n\\n\r\nKazuya\\n\\n\r\nKazuya voiced by veteran seiyuu Yuuko Sanpei of Boruto Naruto Next Generations and 3 Gatsu no lion fame is one of the main characters of the series and is the main protagonist of the series. In the beginning of the series Kazuya was an average teenage boy that attends the local high school. In the beginning Kazuya as a person did not have much personality traits that made him really stand out. In the beginning of the series Kazuya’s chief personality traits was that he was honest, understanding and kind hearted but tended to get scared easily. These starting traits of his though weren’t completely removed as the series went on but stayed and were improved upon as the series went on. As the series progresses Kazuya as a person also starts to improve thanks to the challenges that he and Kiriha overcome as well as the results of the bonds that he forms with people that he helped. Because of these improvements Kazuya becomes more dependable as he comes to understand the role that was given to him and more determined to help those that need his help. More importantly because of his new-found determination Kazuya also become much more brave and willing to take a stand against a terrifying opponent and end it there before it can hurt anyone else. \\n\\n\r\nKazuya’s defining trait is without a doubt his kindness as though his role as a malison cleanser means that he will have to deal with hostile creatures that are born from evil malison such as the various types of Amasogi Kazuya always tries to understand the reason that they were formed from and understand what led to them being formed. This trait of trying to understand the reason behind how they were formed puts him in good stead as though he must deal with them eventually Kazuya at least tries to understand them and determine what the reason behind them was before exorcising them. This trait of trying to understand your foes I felt was nice to see. \\n\\n\r\nThe bond that Kazuya shares with his partner Kiriha is without a doubt one of the center pieces of the series. In the beginning of the series we can see that though Kazuya was grateful to Kiriha for saving his life that he didn’t fully trust her and indeed did not really know who she was other than the fact that she had materialized from his mother’s obi. At this point Kazuya often finds himself being abused and taking advantage of by Kiriha who takes advantage of his kind and honest personality. Often Kazuya is forced by Kiriha to serve her by getting things for her. Though their bond started off on a wrong foot as the series progresses however the trust that Kazuya and Kiriha develop with each other starts to manifest more with Kiriha more willing to listen to him. Though still lording over him a result of the trust that the two have built up means that both Kiriha and Kazuya have developed a partnership between the two that shows how much they care for each other. Notably in later parts of the series Kazuya tries to ensure that he doesn’t use Kiriha’s true self in his attacks as this will affect her life. \\n\\n\r\n In overall, I felt that the character of Kazuya was a well-rounded character that was well designed. Though at first, he was a rather average character with few distinguishing characteristics I felt that the character development for him was well done and seeing the character gradually transform from an average Joe to someone that has both conviction in his duties and compassion and understanding that enables him to understand the events that led to a amasogi’s formation. I felt that his seiyuu Yuuko Sanpei really did a great job portraying the character of Kazuya. \\n\\n\r\nKiriha \\n\\n\r\nKiriha voiced by veteran seiyuu Naomi Oozora is one of the main characters of the series and is the series main heroine. A veteran Tsugumomo that has lived for a long time Kiriha is the manifestation of Kazuya’s mother’s obi and had previously served her. A feisty and mischievous young woman that’s boastful and has a lot of self-confidence Kiriha has a personality that can be said to be a direct contrast to the one that Kazuya has. In addition to being feisty and mischievous in the beginning of the series Kiriha also had a rather self-centered personality that when combined with her feisty nature really made her hard to deal with for Kazuya as he often become victims of her impulsive nature. However though lazy and slothful when she’s at home when dealing with hostile forces Kiriha adapts a more serious nature that’s more serious, cautious and focused on dealing with the enemy using the best way possible. Similar to Kazuya Kiriha is one that doesn’t like to destroy Amasogi entirely proving that she too detests mindless destruction if it can be avoided. \\n\\n\r\nKiriha has a number of running gags within the series that help define her character. Firstly, is Kiriha’s love of fooling around with others that comes from her teasing nature. Although not harmful these episodes of fooling around which most often targets Kukuri is a sign of the trust that she has in the people that she teases though this is something that she wouldn’t like to be found out. The other running gag of the series regarding Kiriha is her love of pudding and her desire to have one every day. When she doesn’t for some reason get what she wants Kiriha tends to be more impulsive than usual with a notable exception when she created a song for not getting one. \\n\\n\r\nKiriha’s bond with her master is one of the main aspects of this series and also serves as a means for her development as a character. In the beginning Kiriha did not really have a high opinion of Kazuya both as a person and as a fighter. As a result, she often treated him harshly and in turn created a sort of master slave relationship that only she believed in. As the series progresses however and as Kiriha sees how determined Kazuya has become in becoming a malison cleanser her attitude towards him changes and she begins not just advising him on the various Amasogi that he must face but also in training him as well. By the end of the series Kiriha’s trust in Kazuya has become strong and that she really respects the strength that he has developed over the series. I felt that Kiriha as a character was a pretty well-designed and that her seiyuu Naomi Oozora really did a great job portraying her. \\n\\n\r\nKukuri \\n\\n\r\nKukuri voiced by veteran seiyuu Yurika Kubo of Urara and High school fleet fame is one of the main characters of the series and one of Kazuya and Kiriha’s allies. The goddess that is charged with watching over the area that Kazuya and Kiriha and their allies live in Kukuri is a contrast to Kiriha’s feisty personality in that she is a friendly young woman that however has a tendency of being overly proud of her status as a god. At the same time, she is also rather dutiful and serious about her duties as well. Kukuri’s most prominent trait is no doubt her humble nature as despite her status as a god she never looks down on people and always treat people with respect whether they are fellow gods, humans or Tsugumomo like Kiriha. Kukuri is also very diligent and willing to help in performing small tasks which is also another contrast with Kiriha’s lazy nature. Like Kiriha Kukuri also has a running gag within the series with her being not being taken seriously by others despite her status as a god. This little byplay is most often seen when she’s with Kiriha and is always a funny thing to see. \\n\\n\r\nThe character of Kukuri i felt was an interesting character and was perhaps the last image that I had when picturing a god. The byplay between her and Kiriha was funny every time I see it and her humble and diligent nature actually made her pretty cute. I felt that her seiyuu Yurika Kubo really did a great job voicing her. a notable trait of Kukuri is the fact that she speaks in an accent that’s very peculiar and uses words not often seen in conventional Japanese. This serves to make her even more charming though.  \\n\\n\r\nChisato \\n\\n\r\nChisato voiced by new seiyuu Noriko Shibasaki is one of the main support characters of the show and one of Kazuya’s allies within the series. A childhood friend of Kazuya’s Chisato is also the class rep for the class that Kazuya is in and as such is often the one that chides him when he’s distracted by something. A cheerful, upbeat and positive person that’s also kind and caring it can be seen quite easily that Chisato cares a great deal about Kazuya. As a result, her first meeting with Kiriha was a nasty shock to her as she now must contend with her for Kazuya’s attention. Despite that as the series progresses their relationship soon turned to respect instead. Though a mere human being when compared to the likes of Kukuri and Kiriha Chisato like her fellow human ally Osamu can assist Kazuya by using their intelligence and reasoning to help determine things that he might have missed. Though only a support character I felt that for her first role Noriko Shibasaki actually did a pretty good job of portraying the character of Chisato and I hope that she will continue to improve her skills and get more roles and establish her career. \\n\\n\r\nSunao\\n\\n\r\nSunao voiced by veteran seiyuu You Taichi is one of the main support characters of the series and is a plot central character for the latter part of the series. A fellow malison cleanser like Kazuya Sunao is a confident, determined and passionate person who unlike Kazuya wanted to become a malison cleanser by choice. Apart from her desire to become a malison cleanser what really sets Sunao apart from Kazuya is how she perceives the Tsugumomo. Unlike Kazuya who sees tsugumomo’s as partners and treats them as such Sunao however sees them as nothing but tools that should only act when she commands them to and not be treated as anything else. In a way, the contest that erupts between the two is as much as a contest of strength and techniques and one that pits their perception and views of Tsugumomo. In a way Sunao really isn’t really a bad guy in truth but they were forced to be on opposing sides because of their vastly different views regarding Tsugumomo and how they should be treated and used. Unlike Kazuya whose role as a malison cleanser was forced on to him Sunao willingly accepted her role as one and as such her abilities as one far outstrips Kazuya’s skills.\\n\\n\r\n Never less seeing Sunao go up against Kazuya and seeing them go straight out against each other was interesting as was seeing the techniques that she used which is very different to how Kazuya usually fights.  I felt that Sunao as a character was a well-designed one and introducing a character that was like Kazuya but views Tsugumomo differently was a good move. The clash of both ideology and might between the two I felt was nicely done as it highlighted the strong bond that Kiriha and Kazuya have forged over the battles that they have been through and proves that friendship and trust can beat even people that are more powerful that you are. \\n\\n\r\nArts and animation \\n\\n\r\nArts and animation for the series I felt was pretty good. The character designs for the characters I felt were done pretty well and was largely faithful to their counterparts in the manga. The various environments that the cast fight in was also well detailed. The animation for the series I felt was pretty good with the fight scenes between the various types of Amasogi being of high quality. However, I felt that the final dual that took place in the anime had the best animation in its fight scenes though compared to earlier battles. \\n\\n\r\nMusic \\n\\n\r\nThe music for the series I felt was reasonably good in regard to both the scene music and the opening and ending themes. The combat scenes in particular had some pretty good scene music that changed depending on the battle is going and I felt that this was well designed. The opening theme for the series which in this case was METAMORISER by Band Ja Naimon I felt was pretty catchy and helped convey the comedic side of this series which is helped by the visuals that is shown during the opening song. This is contrasted by the ending theme which is I4U which is sung by veteran singer Michi that seems to convey the bonds and friendships that Kazuya has formed with his friends and allies. Of the two I would say that the ending theme was actually one of my favorites because of the message that it conveyed and the visuals that were used there.  \\n\\n\r\nVoice acting \\n\\n\r\nThe Voice acting for the series I felt was pretty good with particular praise going to Naomi Oozora and Yurika Kubo who voiced the characters of Kiriha and Kukuri who I felt did a great job portraying their characters and making them stand out. Other seiyuu that I felt also did a great job was Noriko Shibasaki who despite her thin role managed to portray the character of Chisato reasonably well. One seiyuu that really surprised me in this series was You Taichi who voiced the character of Sunao. Though I have heard her voice before most notably in Owari no seraph in which she had a minor support role her performance here I felt was excellent as she managed to portray the character that she had been assigned to here pretty well. Indeed, after Kazuya and Kukuri Sunao is my third favourite character which is largely due to her hard work. \\n\\n\r\nOverall conclusion \\n\\n\r\nIn overall, I felt that Tsugumomo was an interesting anime that’s main advantage was the fact that it had an interesting theme, story, characters, fight scenes and capable voice acting from a young voice cast. The theme of the series which is actually derived from a commonly held belief that states that if you treat an object with care over a period of years that it will eventually gain sentience. This theme itself I felt was pretty interesting and served to only enhance this series and make it more interesting. The overall story of Tsugumomo can be said to be a fusion of a comedy and an action anime and in this I felt that it succeeded as the series itself had plenty of good comedic moments as it has in good fights. The overall story I felt was reasonably interesting and seeing how Kazuya and Kiriha grow in power as they forge a bond that is formed from executing their duties of clearing malison from their area of operations and confront increasingly powerful enemies was really enjoyable. Though the series itself did make use of a villain of the week troupe that is most often seen in tv shows each of the enemy types that was featured in the series apart from having great fight scenes where they were exorcised also features a period where the cast investigates the nature of the enemy which in this case is often a Amasogi and from there determine what was the true reason that caused it to form. This aspect of finding an aberration and then trying to determine the reasons that caused them to form before ultimately fighting them after understanding the reasons for their formation I though was well done and gave the impression that malison cleansers are not just heartless exorcists that only live to exorcise Amasogi without trying to understand the circumstances of their formation. \\n\\n\r\nOf course, without a good cast of characters in the series this anime wouldn’t go far even with a great story but in this I felt that the series also did well in. The main character of Kazuya though a rather average person at the start of the series was developed pretty well as the series went on and seeing him forge a strong bond with the main heroine Kiriha and seeing them both increase in power was something that I liked seeing. Seeing and understanding the motivation for Kazuya’s actions and seeing how determined he is with is line of thinking was also something that I appreciated. Though he obviously didn’t want to take up the mantle of becoming a cleanser at first it was nice to see him eventually grow to like the role and also develop the understanding that Tsugumomo are not merely tools to be used in battle like weapons but are living things that have their own personalities like that of a human and should be treated with the same amount of respect. The character of Sunao though a support character also had a large role within the series and was a pretty interesting character that I felt was well developed and acted. In terms of both personality and skill Sunao served as a contrast to Kazuya in that she treated her Tsugumomo very differently to Kazuya while at the same time both her skills and motivations that she has is vastly different to Kazuya’s. As a result, the struggle between the two was as much as a contest of strength as it was a contest against conflicting beliefs and ideologies which made the struggle between them even more interesting to watch as I was curious to see how it would play out. \\n\\n\r\nThough the main cast I felt was developed and used pretty well in the series I felt that some of the support cast could have been used more. The character of Chisato I felt didn’t really have much of a role in the story and could have been used a bit more. The same could be said of Kazuya’s older sister Kasumi who was played by veteran seiyuu singer Ayana Taketatsu. As a result, I felt that their roles were a waste of their talents and I wished that their characters were more fleshed out. As a fight anime, it was important that the series have excellent fight scenes that make good use of the setting and theme and in this I felt that it succeeded. Each of the fight scenes in the series I felt was well designed and thought out that though of a layout that we have seen in other series before was also unique in just enemy types but also determining what their weaknesses were and how their true desire could be factored into the fight as an advantage. The struggle between Sunao and Kazuya that took place near the end of the series notably had some excellent fight scenes that I particularly enjoyed watching.  \\n\\n\\n\\n",
            "date": "2017-06-20T04:07:00+00:00",
            "helpful_count": 16,
            "mal_id": 250420,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=250420"
        },
        {
            "content": "As I was watching this anime something was really bugging me about the tone and vibe of the show. Then about 4 episodes in it hit me. The show is not bad, but the show is not great either, in fact, what was bugging me was the peculiar sensation that the show was so run-of-the-mill, so median, so perfectly average that I couldn't honestly bring myself to complain without feeling a sense of guilt about the fact I was ragging on a show that really hasn't done anything wrong.\r\nThe \"story\" actually begins to become somewhat interesting 4-5 episodes in, which is a good thing forwhat is otherwise an entirely fan service based show. I'd have given up on the show in fact if it wasn't for the fact the jokes were so unabashed. Evolving from the boring and tired meta of \"tease\", \"euphemism\" and \"sexual connotation\" to outright, adult horseplay. At the very least i found this refreshing despite being blatantly perverted. Would you watch this show for its story? Probably not. It's just a nice thing to have supporting the juicy antics.\\n\\n\r\nThe animation is awkwardly all over the place. Going from \"basic as fuck\" to enticingly graphic (when it knows it needs to pull out some aesthetic stops during its service scenes). The thing that really lets the show down though is its background art. This is also in reference to my initial paragraph, everything feels so geometric and clean and it took me a while to figure out why that was so weird and it's because such an empty environment is obviously sterile. It doesn't feel like anyone lives there, it quite literally looks like a \"set\" for a play.\\n\\n\r\nIt's too early to really discuss the characters on account of the fact they haven't been properly developed. We're learning about the MC's heritage and the role he will play in the narrative, the justification for his importance, but in general the MC is about has hollow and husk like as you'd expect in order to get as many people projecting onto him as easily as possible. The word we're looking for here is \"generic\". This is not a sign of a quality narrative, but a reinforcement of the service gimmick that ultimately sells the show.\\n\\n\r\nSo is the show worth watching? Well the humour isn't bad, if not somewhat thin and expectedly cliché in places. But other than that, if you're a novice anime watcher you'll find this show will leave a hell of a lot to be desired. A newbie will get a lot more enjoyment from the show, but then at the same time there are so many better shows waiting to be watched for a newbie. So I struggle to find a justification to recommend this besides the fact the sexual humour refreshingly doesn't beat around the bush.\\n\\n\r\nWatch if you'red bored or desperate and you wont be too disappointed. It's not bad. But it also isn't good.",
            "date": "2017-05-10T17:54:00+00:00",
            "helpful_count": 10,
            "mal_id": 247411,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5840782.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/grazr",
                "username": "grazr"
            },
            "url": "https://myanimelist.net/reviews.php?id=247411"
        },
        {
            "content": "So far into the show, I'm getting vibes similar to that of Omamori Himari and other animes that reference mystical/domestic being living together, the show dance on cliches and takes the dialogue a bit further.\r\nSome scenes where you expect a cliche to happen, the show will disarm you by self deprecating and rewarding you with a little bit of fanservice, it looks interesting and it's pretty funny so far, the main character is a bit of a dense one but the scenes between the main duo are hilarious, give this show a try.\r\nIt's not over the top, it's funny and down to earth and it'sstarting to pick up, don't let the art style and the cover fool you, it's definitely a comedy and it's definitely ecchi\\n",
            "date": "2017-04-21T10:49:00+00:00",
            "helpful_count": 8,
            "mal_id": 245959,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1584923.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Isle352",
                "username": "Isle352"
            },
            "url": "https://myanimelist.net/reviews.php?id=245959"
        },
        {
            "content": "Koko ni itai\r\nDoko ni itai\r\nkotae wa kikanakute mo shitteta \r\ndoko ni itai\r\n koko ni itai! \r\nminna ga omotteru kara  seeno de \r\nkotae wa onaji  kotae wa onaji \r\ntsunagari wa keshitakunainda \r\nuketotte?  uketotta! \r\nMan, that opening them alone was funny, never mind if it's in Nippongo, as long as I like it, ok, so going back to business, this anime may not be much, but it did fine by my ratings.........:\r\nFair 6, story: \r\nOk, so it was a usual supernatural themed story, with something naughty, where it leaves us audience in such imaginative conclusion of some of the things that were being hinted by writer  Ryōichi Kuraya, but the plot itself rely heavily on the main character getting his ass kicked by a cute yokai where atthe same time , she also does some perverted acts that we guys can only imagine.\\n\\n\r\nFair 6, Art:\\n\\n\r\nIn one point it was decent , but in another it was something where illustrator Tajiri san seemly was just to reluctant to go all the way with the fanservices , Panchira was only limited to Chisato at first and then to Tadata and to kiriha in her chibi form, but the full boob flash with Kyouko and everyone else was a disappointment, nevertheless it was fair enough were we were left with a lot to be left in our imagination.\\n\\n\r\nVery Good 8, Sound:\\n\\n\r\nwell the opening theme \" METAMORISER \" was really good for the anime itself and so as the ending theme \" 14U\" did match well with the anime. Also the voices of the characters really did match well , were it can simply tell the characters themselves, so.....................\\n\\n\r\nKoko ni itai\\n\r\nDoko ni itai\\n\r\nkotae wa kikanakute mo shitteta.\\n\\n\r\nGood 7, Characters:\\n\\n\r\nOk, so we have a yokai, Kiriha, who kinda like this domineering wife material were the guy, Kazuya, like a dog, thought I kinda hate Kiriha for being this perverted/ spouse abuser , she kinda makes things funny for this anime and Kazyua himself being this victim makes the comedy genre of this anime add more to it, now add the others like, Chisato, Kukuri and Kyouko, makes this anime much of a competition for the guy's affection, too bad , Kazuya will never be Chisato's husband and so as Kukuri.\\n\\n\r\nVery Good 8, Enjoyment.\\n\\n\r\nWell the comedy, supernatural and the ecchi may not be much , but it was Kazuya's relationship with his Yokai slave, where she is suppose be was basically something that this anime relys on, and very good that they pick one thing and made it real good.\\n\\n\r\nGood 7, Overall\\n\\n\r\nBut in it's overall, this anime is only as good as it gets and another season would be boring, if this anime/ manga relies a lot on the guy getting his ass kicked.\\n\\n\\n\r\nOUT!   \\n",
            "date": "2017-06-25T11:06:00+00:00",
            "helpful_count": 7,
            "mal_id": 251008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=251008"
        },
        {
            "content": "Real Score:6.5\\10\r\nTsugumomo, an adaptation from the homonymous Manga, which got a discrete amount of success. A simple story seasoned with basic yet entertaining characters, some clever ideas and a fun variety of situations. No Breakout whatsoever, but a fun experience overall\r\nStory 6\\10\r\nThe Story is generic and it doesn't have anything interesting to offer, but it has some really clever ideas and good episodes, especially during the parts of the Malison Cleansiment, with interesting twists and ,just a little bit though, a serious tone and sense of resentment of the main character, who questions if he's really the good guy, but it's not explored enough though,and that's a colossal shame because it could have been an amusing mix of comedy and seriousness, even if the result may have been silly. The comedy is funny at times but the Ecchi kind of ruins everything:Ecchi, if used in a clever way or if dosed correctly is humorous, but here it's just too much, it feels forced, out of place and puts the overall tone of the story into childish territory, becoming almost a teenage guy wet dream(Maybe i exaggerated a bit) and damaging the characters that the show is trying to establish\\n\\n\r\nCharacters 6\\10\\n\r\nThe characters are bland and have little to no development, even though in some episodes are surprisingly well-written and  with amusing lines and, well, character; this hurts the show even more, it could have been so much  better if they stayed on that path, without trying to appeal to the lowest common denominator and if they tried taking some risks. The best part is hands down the banter, the interactions between characters, that on their own would have the same personality as my bedside table.When they're together, they're actually fun, hilarious and entartaining: the relationship between Kazuya and Kiriha, despite being a bit clichè, is fun and has the biggest progress of them all:on their own they're nothing, but together they feel like partners, they feel like friends;same for Kiriha and Kukuri, which are believable rivals\\friends when they're together, but alone they seem like different characters.If only the show focused more on the individual, not even much, just 1 episode, even 2 at maximum\\n\\n\r\nSound 6.75\\n\r\nThe Music is weird: the opening is catchy, fast, energetic and perfect for the Show,the OST are strangely  flooded with a Naruto vibe, they're not bad, but they're repeated too much and they get tiring really fast, they're not the best pieces, but they're somewhat enjoyable nevertheless. The music shines in the action battles, this shows how they were made for action scenes, and those scenes alone. It's a ity they did not want to go any further, the soundtrack had potential\\n\\n\r\nAnimation and Direction 7.25\\n\r\nThe Animation is pretty good, rocksolid for the most part of the anime. Some of the CGI used it's pretty remarkable and pretty, but, like the music, they could have done more with the expression of the characters, the lack of detail of some drawings, and,well, increase the value overall, not just being pretty and flashy in action scenes.The direction is solid, good cuts, good corners, the action is easy to see and recognize and some the frames are pretty amazing, especially during battles.\\n\\n\r\nEnjoyment 7.25\\n\r\nDespite the Overflowing of the Ecchi, the bland characters and the basic story, i'm just a normal guy after all, and i enjoyed almost every episode, i found the comedy pretty good at times and a nice ride overall. For one episode a week, they've always been  20 minutes of mere rest and some laughs. I loved the characters interactions and the action was enjoyable\\n\\n\r\nSo this was Tsugumomo, nothing fancy, nothing too special, just a 12 episodes fun ride, with some sull moments, and other very good ones, some interesting ideas, some forceful comedy and questionable situations. See the recurrence?Tsugumomo is part good, part bad, it has some really clever topics, but they're overshadowed by childish comedy and a really poor character development. Despite all of this, i'm hopeful for a future second season, especially if the staff learns from their mistakes and take that amusing route that they've shown in some episodes. Thanks for reading this review, May Our Sweet and Merciful Madoka be with you and let's hope for improvement, or Kiriha-san will probably punch our balls and eat all of our pudding(#SAVETHEPUDDING)\\n",
            "date": "2017-06-19T08:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 250349,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6308811.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AwesomeAlfie27",
                "username": "AwesomeAlfie27"
            },
            "url": "https://myanimelist.net/reviews.php?id=250349"
        },
        {
            "content": "What would be the reason behind a good anime, is it its uniqueness, the funny moment to enjoy, the wonderful character that makes up the anime or the philosophy behind. Well, those are what Tsugumomo has, or will have in the future. Its story of a guy meets up with a supernatural girl is old and classic, but being classic and also enjoyable is a tough challenge. However, it has fulfilled the role quite good with its own combination of everything, bringing funny moments and the unique set of action to captivate our mind. I would not say the story is good for just 12episodes, but reading the manga will bring you to know its true potential for the second season. For the 11 episodes, I have watched so far, I am completely satisfied with the time I spent.",
            "date": "2017-06-12T09:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 249757,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Takros_Knonnar",
                "username": "Takros_Knonnar"
            },
            "url": "https://myanimelist.net/reviews.php?id=249757"
        },
        {
            "content": "Yeah its your generic anime. But doES YOUR MC TURN INTO A LOLI 4 EPISODES IN? \r\nYou can't one up this.\r\nGranted, many people want to divide themselves of what is supposedly good versus what is relatively good INSIDE the story or anime itself. \r\nThis one takes place in a universe where yokai or 'tsugumomo' come to actual life and the story branches on their objectives and what not. But what really takes the cake is the size of each tsugumomo. Larger significantly means more powerful. Lords at shrines are small because not many worshipers.\r\nYou don't understand that whenever you're watching someone protecc and get smallerinto loli size, it just makes my heart warm and that is the reason why I gave this anime a DESERVING score.\\n\\n\r\nThank you.",
            "date": "2017-12-26T13:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 266472,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5144349.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SLZR",
                "username": "SLZR"
            },
            "url": "https://myanimelist.net/reviews.php?id=266472"
        },
        {
            "content": "Tsugumomo is a funny, entertaining anime with a unique premise and pleasant characters that will keep you watching all the way to the end. Overall, there isn't too much to say about it. If you are looking for something that isn't too heavy of a watch with a bit of a lewd chuckle here and there, look no further. \r\nThis series took me by surprise. While not the greatest anime ever made, Tsugumomo has its own special charm that will keep you watching until the final episode. It isn't for everyone but fans of light hearted comedies will be pleasantly surprised. Watching the characters growand bond together kept a smile on my face that lingered even after I'd finished.  \\n\\n\r\nThe animation and sound are superb. Nothing jumps out as being amazing but there aren't any glaring issues, either. The character designs are a bit on the generic side but by no means bad. \\n\\n\r\nThe anime does end with plenty of story left to tell and you will be left itching for the second season coming out next year. \\n\r\nI highly recommend this anime.",
            "date": "2019-04-21T18:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 306862,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6198742.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ArcFloof",
                "username": "ArcFloof"
            },
            "url": "https://myanimelist.net/reviews.php?id=306862"
        },
        {
            "content": "One of the major reasons LA even looked into Tsugumomo is because Naomi Oozora was voicing a character with a Satanichia Kurumizawa McDowell cadence.......no seriously.\r\nTsugumomo is if anything a fanserviced-up harem anime with a dense main male protagonist with some sprinklings of Shinto and Japanese folklore to go along with, however it's VERY scattershot.\r\nTsugumomo's characters are stock at best from our bland main male protagonist Kazuya Kagami voiced by Yuuko Sanpei being the owner of the obi tsukumogami Kiriha voiced by Naomi Ozoora, where she's the extremely abrasive type and that's saying it lightly. Kazuya also has an older sister who's has a crush onhim and is brazen about it, Chisato Chikaishi voiced by Noriko Shibasaki the tsundere childhood friend love interest who's extremely strict at anything pervy (so discount Yui Kotegawa from To Love Ru) as well as the local god of Kazuya's region Kukkuri voiced by Yurika Kubo being the butt monkey of the series along with her stacked disciple Kokuyou voiced by Eriko Matsui. Kazuya's friends also gets some screentime like the perverted womanizer best friend Shiro Shiramine voiced by Sachi Kokuryu and the always reliable otaku Osamu Osanai voiced by Shiho Sasaki. LA's favourite character easily goes to Kiriha however because Naomi Oozora ok. Tsugumomo's progressions mainly character development is largely stunted however due to it's plot format.\\n\\n\r\nTsugumomo's plot format mainly consists of episodic nature for the majority having Kazuya face off against the tsukumogami of the week kind of deal, but it's also spliced in with gratuitous out of nowhere fanservice as well as some slice of life moments that doesn't amount to much. Tsugumomo's plot is a mess is a compliment if anything but for LA, there are a rare few times when the plot was indeed interesting, mainly the Nanako mini arc as well as the rival Sunao Sumeragi finale. The very few characters that seemed to develop a bit of character development are Kazuya and Kiriha but KIRIHA the most mainly due to her backstory. Kazuya yes, does develop but ONLY properly for himself during the Sunao's final episodes. Kazuya does develop in terms of how he uses his powers (a la Kiriha) and he gains the typical \"nice guy, protect everyone\" kind of belief but in all honesty his development was rushed and rather typical of the main male protagonist position mainly due to what little screentime he gets (seriously we get more screentime of minor characters dilemma of the day and development than Kazuya's) that and LA liked Kiriha's backstory more. Some minor character do develop as well due to their focus of the some episodes like Tadataka Tadata voiced by Mikako Komatsu, Shiro and Chisato with Osamu being the helper to the situation at hand but they are left in default mode anyways by the end of it which was a shame as OSAMU was more of a competent character than the entire cast sometimes. \\n\\n\r\nOne of the other interesting things about Tsugumomo at the very least that grabbed LA's attention was with it's interesting actual lore on Shinto and Japanese folklore, mainly the tsukumogami/tsugumomo, objects that gains sentience, that along with the local god Kukkuri wanting Kazuya to be a malison cleanser to get rid of objects gone rogue and we pretty much got interesting folklore mixed into the plot itself that anybody would be interested in however... \\n\\n\r\nOk now to get the elephant out of the room. Tsugumomo has a tendency to cross the line at times, as in sexual harassment and incest as \"comedy\" and even for LA, LA had to squick at the prospects of what Tsugumomo is even doing. LA can understand the gratuitous fanservice, the material adapted from is a borderline-hentai manga but still when it crosses the line...it crosses the line.\\n\\n\r\nIn terms of animation by Zero-G, the animation was decent enough with the over exaggerated expressions being chibified to some decent character designs and the few times they go into fight scenes was \"ok\" at best. Backgrounding was decent though forgettable. Zero-G's best in animation for LA at least went to it's character designs though some are stock generic at times. \\n\\n\r\nNow voice acting, if Tsugumomo has anything it's a melting pot of idol seiyuu's and great voice actors. Naomi Oozora voicing Chieri Ogata from the iDOLM@STER Cinderella Girls series to Yurika Kubo voicing Hanayo from Love Live and Ayana Taketatsu voicing Sachiko Koshimizu from the iDOLM@STER Cinderella Girls as well. *ahem* anyways LA did have ALOT of fun hearing these voice actors in Tsugumomo, the best and obvious being Naomi Oozora but some special mention also to Yurika Kubo, Rumi Ookubo, You Taichi, Yuuko Sanpei AND Mikako Komatsu crossdressing voices as Kazuya and Tadataka respectively and Noriko Shibasaki who only has two roles to her name (including this anime).\\n\\n\r\nTsugumomo is scattershot due to it's plot format and wanting to try EVERYTHING it can to see what sticks but the obvious consistency it has is it's fanservice harem elements, bland characters, episodic nature and it's modern folklore setting. The only two plot points LA will give praise to is the Nanako mini arc for giving us a rather heartwarming minor character development with CONSEQUENCES THAT STICKS and Sunao's finale arc where we see Kazuya develop, yes rushed to all hell but compensated with a rather awesome final bout. \\n\\n\r\nBut as much as Tsugumomo has it's tendencies to ALSO cross the line with it's comedy and fanservice, LA can't exactly hate on Tsugumomo all that much, it's not perfect and LA doesn't expect it too be neither does LA think this is the best fanservice battle supernatural harem. It's in the middle for LA...it's fine and as a bonus, LA got to hear a completely unchecked Naomi Oozora go all out in this anime and that's kinda what LA got from this anime so LA was satisfied with Tsugumomo, scattershot fanservice baggage and all.",
            "date": "2018-03-06T00:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 273162,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=273162"
        },
        {
            "content": "If you find grossly under aged girls in sexual situations objectionable you're gonna have a bad time.\r\nI had a great time.\r\nFor a veteran anime watcher there will be almost nothing in the entire season that hasn't been seen in other animes: a typical weak teen guy protagonist that mostly coincidentally ends up surrounded by females and the accidental nudity scenes just keep raining all over, there is also of course a great threat that forces the weak teen guy to step up and try to become less weak. This is such a stereotypical ecchi harem setup that it's practically a classic.\r\nWhile the charactes are ahuge parade of stereotypes they still manage to feel very true to their natures and their interactions very often end up being absolutely hilarious. Perhaps an intentional side effect of using large volumes of extremely stereotypical content is that when something completely unexpected happens it has far more impact, often resulting in ridiculously potent comedy.\\n\\n\r\nAs for the art and sound it's just quite good and leaning more towards a robust experience than something noteworthy, except just how crazy far some ecchi scenes go. While I'm not giving the show full marks I can't really think of much that could have been done to make it even better, rare situation for someone who loves pointing out flaws!",
            "date": "2017-10-18T13:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 261129,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6311485.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BriefEd",
                "username": "BriefEd"
            },
            "url": "https://myanimelist.net/reviews.php?id=261129"
        },
        {
            "content": "What can I say beyond it is kind of perverted if your into that thing,  I probably would have given this a 7, but I liked dubbed anime's so I can listen in the background in some parts when I am working on something else.  Needless to say starts off pretty shit if you ask me but then gets better and better.  At first I was like what are these fight scenes, plot and all the rest.  Eventually it kind of grew on me and I could see the humor in it.  I would probably never watch this again butit was not the worst for something to chuckle at in the background as I focus on other things.",
            "date": "2017-08-30T10:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 256547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Harizak",
                "username": "Harizak"
            },
            "url": "https://myanimelist.net/reviews.php?id=256547"
        },
        {
            "content": "Quite a surprise here. I didn't have high hopes for this anime, but Tsugumomo actually turned out quite well.\r\nLet's start with genres. There are 3 things worth pointing out: it's seinen, there is no harem tag and there is no drama tag. \r\nWhile Tsugumomo not being harem didn't really save this anime from feeling like one, it gives protagonist a bit more freedom and doesn't need to show us how dense he is every episode.\r\nThis anime being seinen is a wonderful thing for any ecchi fan. No, we don't get anything special. It just means that instead of boobfest and nosebleeds without doing anything wehave more or less reasonable use of nudity and reactions to it, although protagonists is too meek to make satisfying use of it.\\n\r\nFinally, the lack of drama tag makes this kind of stories much more enjoyable. Yes, there are serious moments and there is a story. But the amount of cringe caused by useless tryhard protagonist is limited.\\n\r\nOverall story in Tsugumomo is really basic and not that interesting. It has funny moments, mostly based on characters interactions. Thing worth mentioning is that we get plenty of fanservice that somehow doesn't feel forced.\\n\\n\r\nCharacters in Tsugumomo are a mixed bag. Protagonist is another boring, useless, nice guy that you saw hundreds of times already. Kiriha on the other hand is very solid. She might not be really deep or well written, but she gives this feeling of being a complete character with her own personality.\\n\r\nMost of side characters are forgettable. Some of them fit their role and were fun to watch whenever they appeared, while others were next to useless. On the bright side I don't think any of them felt like a waste of time. They had their roles, played them and didn't stay longer than needed.\\n\\n\r\nArt style is simple and rather bland. Characters look good, but again, nothing special. Animation is where stuff gets better, especially in some action scenes it was considerable above level I expected.\\n\r\nFanservice also deserves mention here. With right angles and covering it manages to be satisfyingly erotic while not going into borderline hentai territory. \\n\\n\r\nGenerally speaking, Tsugumomo is enjoyable anime. It had some annoying moments, all caused by protagonist's weak character, but lack of problematic drama, good ecchi and Kiriha made up for it.",
            "date": "2017-08-29T10:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 256474,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4251395.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yukikaze_sama",
                "username": "Yukikaze_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=256474"
        },
        {
            "content": "Warning possible Spoilers\r\nGoing into Tsugumomo I was just expecting another two misfit characters doing random stuff like fighting monsters or other stuff which is what I got yet it somehow surprised in more ways than I was expecting.\r\nThe story begins with Kazuya Kagami who doesn't go anywhere without his Sakura Obi that his mother gave him until one day a Tsugumomo spirit called Kiriha saved him from an evil spirit and that point on Kazuya's days would never be normal again.\r\nNow the story isn't really spectacular, but it is enjoyable because at least the characters do go around trying to stop evil spirits attacking peopleor being used by people who have been persuaded by the spirits to do evil or weird things unlike Love Tyrant which just gives up it's directive 3 episodes in whereas Tsugumomo actually puts in some effort and it can be quite knowledgeable too which did surprise me a little since I was expecting the characters to mess around which they do, but they do get serious when the situation gets a little hectic and it was interesting how Kazuya and Kiriha were able to beat the enemy and how they got stronger overtime as their partnership became more trustful.\\n\r\nDespite not having a good story it did pick up thanks to the characters and the situations they got into because there were a few moments that completely caught me off guard which I'll explain later, but it showed that it wasn't using the usual cliche's I have seen before which is why I was pretty impressed by this show and the characters were a big help too since they were a bunch of fun and none seemed dislikeable yes even the girl that shows up at the end didn't annoy me surprisingly.\\n\r\nBut it does fall short a little how it the series ends with the usual two people with similar or the same powers going at it to see who is better, luckily the fight was actually pretty cool to see.\\n\\n\r\nNow the characters were a pretty random bunch and were pretty likeable since they offered me a good amount of laughs and surprises.\\n\r\nKazuya Kagami is the male MC and is Kirihas partner in battle, Kazuya is kinda like the usual MC you see in harems yet not as dumb and is more controlled of his perverted desires which is a good start, he is a pretty friendly guy and doesn't hesitate to help people as long as he doesn't find them annoying, at first he wasn't really good at fighting the other spirits, but thanks to working with Kiriha he did get stronger the only downside to his life is that he is constantly getting beaten up by Kiriha if he does something she doesn't like.\\n\r\nKiriha is the female MC and is a Tsugumomo which is a spirit created from sentimental attachment to certain objects, she is a Tsundere and a good one at that as she is a very random character as she'll be kicking Kazuya in the nuts for annoying her to being flirtatious with him to being obsessive over pudding, she likes to be boastful so she can remind Kazuya who's boss, but can be really lazy sometimes as she doesn't like doing things that aren't really to do with her making her have a selfish nature plus she can also be pretty open to anything sexual as she doesn't mind being nude around Kazuya and even flirts with him many times though when the going gets tough she is a loyal and reliable friend to Kazuya.\\n\r\nChisato Chikaishi is Kazuya's best friend and has been his friend since they were little, she is a kind girl though does get frustrated if the boys in her class do stuff that isn't normal or perverted and tends to beat them, but she is a smart person and helps Kazuya with his spirit situations along with his schoolwork, she cares about Kazuya very much often making sure he's alright.\\n\r\nKukuri and Kokuyou are both God's at the local shrine near where Kazuya lives, Kukuri is the one who wanted Kazuya to become an Exorcist so he can destroy the evil spirits, she may be powerful though her form looks like a little girl which doesn't make the others seem intimidated by her and she is often being used as a punching bag for Kiriha since they don't get on very well however when she had to live in Kazuya's house she was a helpful often doing chores with his sister while Kokuyou on the other hand is a much more mature woman often noted by her huge oppai and she is very seclusive with her emotions often having a very mild tone, but she is protective of Kukuri's well being though whenever someone asks to fondle her breasts she doesn't actually mind them doing it.\\n\r\nSunao Sumeragi is another exorcist like Kazuya and is his rival, she is a very direct and hot-blooded person as when she has a goal in mind she is very determined to see it through without giving much thought on the consequences, at first she only saw Tsugumomo's as a weapon or tool, but after her fight with Kazuya she does see her Tsugumomo differently and tries to improve their partnership afterwards.\\n\\n\r\nNow the artstyle wasn't impressive, but I did like some of the forms that the evil spirits took like the giant book monster or the hair monster that looked pretty intimidating, but mostly it wasn't much different from most anime's that I've seen before, although it was pretty funny how the characters design's went from normal to chibi form from time to time which were used to depict comedic moments that were done pretty well.\\n\\n\r\nThe action wasn't amazing, but it had something because there was some strategy involved and usually anime's like this don't put that effort in for their battles so it entertaining seeing Kazuya, Kiriha and anyone else involved in the battles trying to figure out the enemies weakness and then trying to beat it also the final battle wasn't too bad either and I did like some of the moves that were created.\\n\\n\r\nNow the comedy is definitely what makes this an enjoyable show because it was hilarious to watch Kazuya and Kiriha always having arguments with each other that always end up with Kazuya getting a hit in the nuts and the other characters proved to be very funny too as Kukuri and Kiriha also had their moments of fighting each other that was just really funny to watch and probably the best part of the comedy is the amount of sexual innuendos that are thrown at use and it made me laugh my ass off because it worked so well and it mainly came from Kiriha which just made her character even more likeable. \\n\\n\r\nThe ecchi/fanservice was also something that completely threw me off because Kazuya and Kiriha are probably the most chill characters I have every seen nude together because usually one of the characters would blush or just run away of embarrassment, but these two are literally having bath's together and talking in the bed nude like their private parts are just hanging out and their just having a friendly conversation it surprised the hell out of me and that's not all there was one scene with Kazuya and Chisato in the nurses room that surprised the hell out of me along with Kazuya, Kirirha and Kukuri's trip to another God's shrine who had a lolicon fetish and that was really awkward to watch, a lot of the fanservice in this show really caught me off guard.\\n\\n\r\nOverall this show was actually very funny as where it lacks in story definitely makes up for with really surprising comedy and fanservice so if you're looking for a show to give you a good laugh then this'll be a great time.\\n",
            "date": "2017-08-22T07:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 256018,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=256018"
        },
        {
            "content": "Tsugumomo looks like a typical generic shounen action harem show, at least at first sight.\r\nYou've got Kazuya, our weak and average male MC who has to get stronger to fight some supernatural creatures, Kiriha, the supernatural and strong female lead who helps him, some more harem cast, and some ecchi of course.\r\nBut right after the first episode, I knew this would be different, and I would like it.\r\nAnd after finishing, I knew that I was right.\r\nYes it uses generic elements, but many of them in a rather unusual way.\r\nBut there is more to it than just generics.\r\nTsugumomo has plenty of ecchi scenes, but more ina funny way.\\n\r\nNot like for example Shinmai Maou no Testament which is sometimes borderline Hentai, and you see lots of detailed boobs, butts, and lewd SM stuff going on, to make you pitch a tent between the fights.\\n\r\nInstead, you don't get to see any details, but plenty of lewd comments from the acting persons what's going on, or unambiguous visual substitutes of what happens.\\n\r\nAnd there is definitely a lot going on, in fact his whole harem (including his childhood friend and even his big sister) at once gets him off multiple times, and there are quite obvious hints that even more has happend with some harem members, something quite rarely seen, although not really voluntarily from his side...\\n\r\nYou don't get to see many panty shots except those for some comedy, I think mostly because Kiriha does't wear any anyway, which is another comedic element here.\\n\r\nReally, I laughed my ass off during these scenes, I liked very much how explicit Tsugumomo was without being visual explicit.\\n\\n\r\nComedy has a big role in the show, be it stereotypical, lewd, or unconventional.\\n\r\nHave you ever thought of a local goddess getting so weak due to lacking belief and overuse of her powers, that her body transforms to a very young girl?\\n\r\nAnd of that literally poor goddess begging for money of another goddess, and a very lewd one on top of that?\\n\\n\r\nAnd Tsugumomo actually has a plot, though not the most innovative kind, but with quite interesting reference to Japanese popular beliefs.\\n\r\nI mean, seriously, who ever thought of fighting with an obi (a kimono belt) as a weapon, but it works and you get some decent fights.\\n\r\nIt's just a little disappointing that not everything is explained, for example what exactly had happend to Kazuya in his past and why.\\n\r\nThat calls for a second season, but I think one has to read the manga...\\n\\n\r\nCharacter drawing is sometimes quite simple, but without looking lazy, and sometimes more detailed, mostly during any kind of action.\\n\r\nThe only thing I didn't quite like was Chisato's hair style, the high forehead without hair looks a bit awkward.\\n\r\nAnimation is fluent and nice to watch.\\n\r\nI also liked the visual substitutes, like a bunch of hearts popping up, a massive telescopic crane, or the Rin (a cup gong), these always made me grin lewdly.\\n\r\nYou won't see any full front nudity, the most important parts are always covered with towels, arms, soap, blur or stuff like that.\\n\r\nI'm fully ok with that, it fits the show very well, you don't always have to have massive boobs swinging right before your eyes (although that can be quite nice from time to time, too).\\n\\n\r\nSound is nice and decent, all seiyuu voice their character very well, I especially liked Kiriha's voice with that lewd tone, and Kokuyou's deep voice and formal mode of expression.\\n\\n\r\nCharacter design is quite ok, the more important characters all get some sort of development, although that is not the most important part for that kind of show.\\n\r\nI wished that Kokuyou had some more screen time, I really liked her dry comments...\\n\\n\r\nAs Tsugumomo is a comedy show, character design can not work without using stereotypes, because it would be a waste of comedic resources.\\n\r\nYou just have to use the tropes in a clever way instead of showing the exact same template like the cheap generic shows.\\n\r\nI'm sure we all have seen many different male-wants-to-take-a-bath-but-nude-female-is-already-there-scenes, and the female char screams, beats up the male char, or both.\\n\r\nBut when Kazuya rushes in, Kiriha just tells him to wash her back, because he as her servant surely  is here to do that anyway.\\n\\n\r\nI liked Tsugumomo a lot, and even rewatched the most hilarious scenes, still laughing like the first time.\\n\r\nIf you are here just for some boobs, you will be disappointed.\\n\r\nBut if you like lewd humour, I think this is for you!",
            "date": "2018-08-17T18:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 286752,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6796811.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/HajimeAmamori",
                "username": "HajimeAmamori"
            },
            "url": "https://myanimelist.net/reviews.php?id=286752"
        },
        {
            "content": "This is an unusual one.\r\nFirst, it can be quite perverted. Characters end up in very weird/awkward situations. It is something half-way between comedy jokes of To Love Ru, and blunt humor of something like prison school... actually it is quite hard to describe it properly. It is as if it tried to use bluntest lewd jokes without making situation look \"sexy\". I'd say it is quite clsoe to the kind of humor used in \"Kyou no 5 no 2\".\r\nSecond, for some strange reason it has very high quality animation in fight scenes and fairly amazing music. The fights-  and there are fights - canput some of shounen titles to shame. Animation in fights is extremely fluid and well done, and music complements the fights really  well. \\n\\n\r\nSo, there you have it.\\n\\n\r\nStory: 6/10:\\n\\n\r\nAcutlaly a somewhat interesting premise and an unusual one. There's continuous character development through it, so it isn't some sort of silly \"collect all romantic partners\" anime. Character goes through period of growth, gradually improves, new characters are introduced... it is interesting.\\n\\n\r\nArt: 6/10:\\n\r\nThe art is close to the standard modern art (triangular faces and stuff), but the animation is really well done. Basically, it looks somewhat simple, but does not look low budget, and it is surprisingly well animated.\\n\\n\r\nSound: 7/10:\\n\r\nThe battle theme is really well done and very pwoerful. It is something that is worth of being in a very well done fighting game, like blazblue. Heavy and powerful. Perhaps not as powerful as the main t heme of first ajin, or as cheerful tracks of \"monster musume to iru nichijou\"... but it is definitely about average as far as anime tracks go.\\n\\n\r\nCharacter: 5/10:\\n\r\nThey're amusing, have some sort of personality and aren't carton cutouts, but it is hard to say much about them. They're story devices first and character seconds. So they behave according to their role, and pick behaviors that would be most comedic.... so you'd end up seeing them less as characters and more like comedy elements.\\n\\n\r\nEnjoyment: 6/10:\\n\r\nIt is oddly perverted, but once you get over it, it has interesting moments, and surprisingly good fighting scenes and music. Long story short, there's much worse anime out of there.\\n\\n\r\nOverall: 6/10:\\n\r\nOverall, it is worth a watch, but you need to have a very high tolerance to lewd and ecchi jokes. Basically, if you laughed at \"Kyou no 5 no 2\" and saw \"To Love Ru\" and liked it, you'll probably like this title. It isn't really ecchi, but the jokes can be quite perverted.\\n\\n\r\nSo... interesting work, but definitely not for everybody.",
            "date": "2018-03-11T17:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 273606,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=273606"
        },
        {
            "content": "Story: so Kazuya is basically having a normal school day until a evil spirit comes after him and well wanting him until his Sakura Obi appears before him a girl and she defends him from the spirit not long after that battle she tells him she is the master and hes the servant which he agrees too so now Kazuya and Kiriha have to battle these spirit's that manifest from the people of the school awhile also dealing with the girls (ill get to that in the character part) Kazuya life just got a lot crazier.\r\nArt: art is very good nothing wrong with the artat all.\\n\\n\r\nSound: The Op and Ed are decent at best also i watched the dub but all the people or actress were very good.\\n\\n\r\nCharacter: Kazuya is the male lead and well hes the nice and also shy type of guy in this anime honestly though i loved the guy just kind and nice also the shy guy i love that but a good and nice character. Kiriha well she is a bit perverted but also has that mean streak with Kazuya (in a nice way though) others a pretty nice a good character again. Kukuri is a water goddess and is a pretty nice but can be stern at times but again a pretty good character (ill will be adding 1 or 2 supporting characters here). Chisato is a supporting character and is a childhood friend too Kazuya she is a pretty nice character all i can really say honestly. Kokuyou honestly i felt like she was here just for the fan service nothing really more doesnt really show emoticon really but again decent character.\\n\\n\r\nEnjoyment: Things that i liked: the comedy was really good also the action moments in this were really well done as well also the ecchi moments weren't that bad either and were enjoyable. Thing that i didn't like: honestly i cant think of anything i personally enjoyed this anime i guess i could say that the first 3 weren't the greatest but the anime easily got better from there i guess for the people this anime is generic but i again i loved this anime for sure.\\n\\n\r\nOverall: it gets a 8 out of me the comedy was really well done the action that was in it was well done and also the ecchi is not a bad touch either overall a anime easily worth the watch.\\n\\n",
            "date": "2017-07-29T22:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 254198,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=254198"
        },
        {
            "content": "Tsugumomo is one of those anime I feel is underlooked in this season of anime.\r\nI first got interested in this anime personally because of its Japanese culture. Kiriha in particular really interested me with her bossy but confident personality and her unique fighting abilities as a tsugumomo. This anime surprisingly has a pretty interesting story as well as an intriguing cast of cast of characters. \r\nI really liked how the anime shamelessly uses lewd elements to conduct its story, it did not feel really alienating and each lewd element felt purposeful. It crosses a line of storytelling I thought wasn't possible. There's also a goodamount of fights that happen in this story that really hooked me in with these characters. All of this leads to a good balance of comedy, lewdness, storytelling that makes Tsugumomo stand out to me personally.\\n\\n\r\nMy only problem with the anime is that the main character is somewhat boring. He certainly shows his potential growth as a character by the end of the series, but he really never gets to express how he feels about the sexual events that happen to him nor does he show any relatable elements that would make him likable. The other characters can be a bit cliche at times as well, but it never bothered me too much as the story really hooked me in anyway.\\n\\n\r\nI would love to see another season of this anime happen as I hear the manga gets much better later on. This set of 12 episodes I hear is only the beginning of a great story unfolding. If you can personally handle the lewd elements of the show and the bit cliche characters, you're in for a pretty good ride. I highly recommend it!\\n",
            "date": "2017-06-18T13:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 250265,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4889808.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BluePikmin11",
                "username": "BluePikmin11"
            },
            "url": "https://myanimelist.net/reviews.php?id=250265"
        },
        {
            "content": "Cliche, cliche, comedy, ecchi, shounen, fights. Tsugumomo tells the story about a boy he inherited from his mother, a type of \"weapon\" that personifies in a charismatic character, Kiriha, seriously, by far is the most interesting character, our protagonist, Kazuya, is the typical character of ecchi innocent and naive, but with a great heart, super kind and clumsy, with obviously a harem of women behind him, and this is even worse in the manga. What is interesting here, perhaps, is the Kiriha, because she is an extroverted and \"naughty\" type, we see the same sexually attacking the young Kazuya causing in several comic scenes, takingthis is just another generic anime with a protagonist boring. (I apologize for my spelling mistakes)\\n\\n\r\n(PT-Br) Clichê, clichê, comédia, ecchi, shounen, lutas. Tsugumomo conta a história sobre um garoto que herdou de sua mãe, um tipo de \"arma\" que se personifica em uma carismática personagem, Kiriha, sério, de longe é a personagem mais interessante, a nossa protagonista, Kazuya, é o tipico personagem de ecchi inocente e ingênuo, mas com um ótimo coração, super gentil e atrapalhado, com obviamente um harém de mulheres atrás dele, e isso é ainda pior no mangá. O que chama atenção aqui, talvez, seja de fato a Kiriha, por ela ser do tipo extrovertida e \"safadinha\", vemos a mesma atacar sexualmente o jovem Kazuya ocasionando em várias cenas cômicas, tirando isso ele é só outro anime genérico com uma protagonista chata.",
            "date": "2019-04-30T19:35:00+00:00",
            "helpful_count": 0,
            "mal_id": 307510,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7279162.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xRhune",
                "username": "xRhune"
            },
            "url": "https://myanimelist.net/reviews.php?id=307510"
        }
    ],
    [
        {
            "content": "A decent anime, I enjoyed it, but probably not the most perfect series.  The characters are strange in their own ways, and definetly a lot of fan service in it.   But i did enjoy the combat sequences, and found the method facinating, the day to day stuff with friends and classmates had some issues, but nothing that I feel brought down the series.   \r\nJust can't help but feel that it didn't really quiet go far enough into creativity.  Though if you like yokai and dealing with Japanese myths and such you might enjoy it.\r\nThis is a series that Ican't help but feel if it gets a second season I hope they do more do develope what is here now, as for now it's just okay.   I did enjoy it, but realize not everyone may.",
            "date": "2017-06-18T23:47:00+00:00",
            "helpful_count": 0,
            "mal_id": 250320,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/wolfwing",
                "username": "wolfwing"
            },
            "url": "https://myanimelist.net/reviews.php?id=250320"
        }
    ]
]