[
    [
        {
            "content": "A total score of 5 may seem hard on Nanatsu no Taizai: Imashime no Fukkatsu (The Seven Deadly Sins: Revival of the 10 commandments or simply The Sins S2). Especially according to its high score. But I´m disappointed. I really enjoyed the first season and was glad when I read that a season 2 were coming, and with 24-episodes at that. But my excitement was steadily replaced with disappointment and uninterest. My review will contain minor spoilers to specify why I had problems with this sequel, but they will be heads ups for those (₴).\r\nThe biggest let down with The Sins S2 for me wasthe story and character developments. With that I mean a very uninspired story direction and an almost non-existing character development. What I truly loved about the prequel was the goofy but adventures story, filled with small surprises of meaningful meetings and overdramatic but interesting character interactions. I even didn´t care about Meliodas repetitively grouping of Elizabeth. Some shounen tropes were of course present, but it had its own style, feeling and inventiveness. The battles and fights made sense, they had drive and feeling in them, and some were really nice to look at. The mystic and allure of the sins and their past was thick, and some strong friendships and relationships were formed. \\n\\n\r\nAnd then S2 happened. The far from straight but entertaining story path took a straight battle shounen path, becoming randomly magic/power level face offs, and character interaction became either repetitive, cliché shounen troopy or melodramatic. Let me give you an example, spoiler alert is on ₴. The battles changes from being about enemies facing off each other in creative ways with emotional investment, to be about magic and power levels, tournaments and powerups. Spoiler alert off. Why taking that direction? If this is a faithful adaptation, I think Nakaba Suzuki (the author and artist behind the manga), abandoned the good adventures concept he had established in the first half, for washed out Dragon Ball power level bs. I´m sorry but it is really how I feel. \\n\\n\r\nLet me elaborate. You know the classic battle scene with the top bad asses, where you have proper build ups to get really emotionally invested in it? Well, don´t expect them here. The new threat appears, and in the beginning the whole thing had much potential. A demon clan has been freed (by Hendrickson in the end of the last season), and Meliodas seems to be connected to them. Many potential interesting meetings between the Sins and the Demon clan members, or plot/character developments/interaction as well as background stories. But most of it turned out to be pretty basic shounen trope encounters, with cliché battle speeches and brawly screams of their attacks with cool names such as “Death Breath” and wired mid fight power ups.  \\n\\n\r\nI really wanted to like this sequel. I was absolutely a bit enchanted by the prequel - the magical world with all its different inhabitants and magical functions was very enjoyable. I lost that feeling in S2. A few things are easy to pin point out, as the depletion of the story as well as the amount of new characters. In S2 the numbers of characters keep bashing in, diffusing the time and space from a lot of key characters. Some characters like Jericho got some nice development and time even if her Ban fixation could become a bit embarrassing. Ban gets more time as well (his background mini arc was one of the best parts of the show for me), Diane gets a solid number of episodes focused on her, and Meliodas is Meliodas so time has been spared for him as well. The rest? Is mostly neglected for new characters. Elizabeth? Gets less development than both Sakura and Orihime put together.\\n\\n\r\nIt felt like the narrative both speed up and slowed down at the same time. The scenes took 1s or 10 episodes. Most things happened to fast or to slow. A crashing battle there, and suddenly is guy 1, 2, 3, 4 and girl 1, 2 in a completely different geographical location, training and unlocking powers to left and right for episodes, for them to next split up and be in like 6 different places, to end up little randomly together at a third place later on. The reasons behind it? Weak at best, and mostly poorly explained. I lost interest in who the demon clan members were and ₴ how in hell they can remember things from 3000 years ago so clearly. I lost interest in the powerups, I lost interest in Ban´s and Elaine’s relationship, and I lost interest in Meliodas grouping of Elizabeth. \\n\\n\r\nAnd here I think we are reaching the shows main problem. I just lost interest, in my eyes it didn´t carry this “new” direction well. It crumbled away along known and common battle shounen paths and ruining the atmosphere it built up to that point. The new stereotypical shounen approach just didn´t work well for me. \\n\\n\r\nThe Sins S2 is as its prequel an A-1 Picture production. If your familiar with the studio, think A-1 on a good day there they are putting some in some effort and money in their creation. The style is simplistic but characteristic, and as most A-1 productions, with some nice colourful backgrounds and with curvy ladies and muscly men. And since A-1 actually put in some effort in it, the animation is more than decent, with some intense battle scenes as the one between Meliodas and Ten Commandments or Escanors swift encounter with the demon Galand. \\n\\n\r\nOne of the highlights of the prequel was the solid rock-fantasy inspired soundtrack, which was affect full and well composed. Which they luckily stuck to this time around as well. No complains there. \\n\\n\r\nSo, to summon things up, The Sins S2 didn´t get the job done in my eyes and ears, even if I have no complaints against A-1´s accomplishment. I can see why many still love the show, but the magical spell that The Sins S1 had put on me was utterly crushed. Generic battle shounen can absolutely work, but this direction felt cheap, especially since Nakaba Suzuki had established a very magical world which could been focused on instead of long ego speeches on who´s the toughest, strongest, and most powerful fighter. #disappointedatthemediocracy  \\n",
            "date": "2018-06-30T02:22:00+00:00",
            "helpful_count": 195,
            "mal_id": 282584,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=282584"
        },
        {
            "content": "Stop me if you’ve heard this one before but it seems that battle shounen anime in recent years have been on the decline. Boku Hero no Academia became a big name that is able to carry itself but beyond that, there’s hardly any other that made a name for itself. Well, there’s Black Clover but that abomination is an example of giving battle shounen a bad name in recent years. Boruto has been an underwhelming sequel that looked more like a cheap cash grab for the franchise. Where does a show like Nanatsu no Taizai still stand?\r\nTo be fair, the series already established itself fromsome of its other projects like the first season, OVAs, and movie. It isn’t as long as some other shounen like Naruto, Bleach, or One Piece. In fact, it’s not even part of the “Big 3” as Westerners would call it. However, Nanatsu no Taizai does make a name for itself by developing its own ideas. The first season established the principle cast and felt more like a way to get viewers familiar with the story. In this sequel, the business really picks up as new dangers are unleashed into the world.\\n\\n\r\nFor those who don’t remember, the story picks up right after the first season as Hendrickson breaks the seal on the Coffin of Eternal Darkness. By doing so, he unleashes a group of powerful demons known as the “Ten Commandments”. Essentially, they are the central antagonists of this season. While we don’t know too much about them, it’s known that they hold a deep grudge against Meliodas for betraying them in the past. The first few episodes establishes their testament in power as one of their members is able to make Meliodas look like a jobber in a one-sided fight. This implies that the Ten Commandments are more powerful than anything Meliodas and his friends ever dealt with. In terms of characteristics, the Ten Commandments are known for their unique “Commandment” power and various personalities. For new viewers, you may be surprised at how much personality these beings show for their characters. It’s actually somewhat human for characters like Galand’s arrogance, Fraudrin’s manipulative nature, or Monspeet’s politeness. Unfortunately, there’s not much concrete characterization for the Commandments. I blame this mostly on the pacing because the manga explores much more about their past and roles.  \\n\\n\r\nThere’s actually two sides of the coin regarding the pacing of the show. On the surface, it is indeed slow and some elements of the plot can really be condensed. I actually felt impatient after seeing the season focus so much on characters like Diane and Ban. The latter is actually more important but really should of been shorter than shown on TV. In addition, Meliodas’ past is explored only enough to give viewers an impression of who he is. In essence, it isn’t enough to show the more important side of his role as a “betrayer” to the Commandments. In addition, anime only viewers will probably question what it really means when certain characters call him a “demon” and “former leader”. The other side to look at is how faithful the anime adaptation is. Most chapters cover literally everything from the book with many chapters on a panel-by-panel basis. It’s loyal to the manga readers that really bought the show into what it is. Nothing is changed for fans of the manga especially those who are looking forward to certain scenes to be adapted.\\n\\n\r\nDespite the season focusing on the conflict with the Commandments, new characters are also introduced from the good guy’s side. The most noticeable character is Escanor, the seventh and final member of the Seven Deadly Sins. He makes a hell of an impression that will make viewers hunger for more of his role this season. Other important support characters also make returns that may surprise you. \\n\\n\r\nA-1 Pictures once again uses their resources to adapt this sequel although it actually impressed me for their work. There are certain episodes that really stood out that includes Escanor’s character debut, Meliodas’ confrontation with the Ten Commandments, and Galand’s rampage. Animation quality remains similar to the previous season although A-1 Pictures still falls into the occasional trap of awkward character models. There are also some scenes that didn’t feel as impactful as those in the manga especially in terms of character expressions. However, the battle scenes lived up to its expectations. This especially applies to climatic battles in the latter half of the show that also brings credibility of character power levels. \\n\\n\r\nThe music and OST is still composed by Hiroyuki Sawano although I’m a bit disappointed that most of it is just a rehash of the previous season’s. The new theme songs also sounds less impactful. Despite that, I think character voice mannerism should be given praise especially for the Ten Commandments. Yuki Kaji is able to voice two characters with very contrasting personalities. Others such as Escanor makes their personality stand out much more thanks to the modern talent of Tomokazu Sugita. \\n\\n\r\nNanatsu no Taizai: Revival of the Commandments is a battle shounen that is faithful but perhaps a bit too much for its own good. This series suffered from some pacing issues that I feel like some viewers will not easily forgive. Plus, some of the new characters didn’t really get the amount of charaterization it deserves. However, I would like to say to give this sequel a chance. It’s still part of the franchise that is committed to its ideas and continues to develop the main story as it’s intended. I just hope that when the next inevitable season comes, we get a real showstopper.",
            "date": "2018-06-29T15:12:00+00:00",
            "helpful_count": 64,
            "mal_id": 282556,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=282556"
        },
        {
            "content": "In my opinion, this anime series is particularly overrated by the anime community. \r\nWhat appears to be an anime with decent visuals, sound and budget simply disappoints in the story and character segment. \r\nThe art, animation and sounds are no doubt well made, and this has blinded us to the fact that following the story is simply frustrating. \r\nFirst of all, there is no real price to pay for our heroes, no such thing as punishment for when the main cast loses. \r\nIn one of the early episodes of this season, we are shown that most of the main characters get brutally (and fatally) injured,but actually we have seen that happen multiple times in season 1 already. Lo and behold, the characters aren't even hurt, just got off with a scratch. Viewers have already been conditioned to not feel shock or suspense when something terrible happens to the cast: Meliodas has regrown lost limbs, dear Elizabeth has revived everyone in the final episode of season 1 before, surely it can happen again when the MCs are all dead. \\n\\n\r\nAlso, the story is riddled with annoying subplots that diverge from the main plotline: the revival of the demon clan.\\n\\n\r\nGowther decides to screw with the crew's memory, and they have a pointless internal fight (they still let gowther travel with them, and gowther still doesnt know what he did wrong).\\n\\n\r\nThe fcking giant loses her memory for the second time, disrupts the crew from focusing on the demon clan.\\n\\n\r\nBan leaves the 7 sins so he can continue to mire himself in his dead lover (yes this subplot is still ongoing from the last season). \\n\\n\r\nAnd Merlin has stolen Meliodas' power so now they have to first embark on a side quest to get it back. \\n\\n\r\nWhile subplots are necessary to pave the way for the final fight, the above plotlines seem to have little to nothing to do with the revival of the demon clan. The demon clan don't play a role in these subplots at all, and somehow steers clear of them so that our little heroes can level up peacefully. \\n\\n\r\nAlso, the fucking pig is annoying, especially with its deal with the power level. The storytelling is crap when they have to rely on numbers to help us rank who is stronger than who.\\n\\n\r\nAll in all, this is an anime that disappoints and that betrays our expectation of what is termed a 'well-made' series. There have been many 'well-funded' shounen series like this one (such as Magi and BnHA), but we should not simply believe that it is a good anime just because it has made itself to appear to have more potential than it credits itself with.",
            "date": "2018-03-11T08:01:00+00:00",
            "helpful_count": 63,
            "mal_id": 273565,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/_hazy_",
                "username": "_hazy_"
            },
            "url": "https://myanimelist.net/reviews.php?id=273565"
        },
        {
            "content": "When i was att the 11 episode and i already knew that this was my another mistake, waste of time, now i can confirm that my concerns that this could be \"right click copy Fairy tail, change texture pack, paste without fixing shit that made fairy tail suck\" were true. I was still having hope after first season but now i am just disappointed.\r\nWhy i think it sucks:\r\n1. Childish at the level that it becomes cringey to watch for anyone older than 10 years\r\n2. Same thing like in firy tail but on steriods, writer brings his characters at the position where they must die andthen he is afraid to kill them and he justifies their survival by some weak ass cheesy explanation, also bringing too meny characters that were dead from the beginning of the story to life again by some stupid explanation\\n\r\n3. It literally is fairy tail with different names and skins, completely unoriginal they are not even trying to hide it, that talking pig same as Happy, they are going to train on some island for big fight like characters from fairy tail, Lucy is really similar to Elizabeth joining the guild in first few episodes and falling in love with main character...\\n\r\n4. Cringe degenerate shit with boobs and asses, it was funny first few times when Meliodas is milking Elizabeth but after spamming that same stuf hundred of times it gets embarrassing to watch, and all this shit with naked characters this trans looking Gowther is naked 40% of the time in anime, Merlin with her coat covering her nipples by some wierd laws of physics all the time, and woman in general it is degenerate, i am not the guy thay will complain about \"objectifying women\" like libtard sjw clown but it is too much. I dont know if japanese public is so fucked up that they like this high concentration of shit like this but it is just too much for me, it is distasteful if i wanted to jerk off i would go on pornhub.\\n\\n\r\nI ti is really bad, it is even worse when you know that writers that were clearly coping the fairy tail could easily check for criticism of the work that they are coping and make copy of it while fixing the stuff that was bad, this is the reason why i will say that for me it is even worst than fairy tail.",
            "date": "2018-10-09T16:27:00+00:00",
            "helpful_count": 42,
            "mal_id": 291350,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Neverm0r",
                "username": "Neverm0r"
            },
            "url": "https://myanimelist.net/reviews.php?id=291350"
        },
        {
            "content": "The bad part about expecting a show to be good, is that you end up hating it even if it was ok-ish. That's what happened to me after watching Nanatsu no Taizai: Imashime no Fukkatsu, because I thought it was gonna be great.\r\nWhat I care about the most in Animé, Movies and tv series, is the dramatic structure, the characters and the dialogues. \r\nThe dramatic structure sucks, a lot of back stories, and cheesy drama.\r\nI couldn't stand the dialogues. They were so dry, and predictable.\r\nNanatsu no Taizai's characters have never been good in my opinion, Ban is always mad and angry, Diane is a crybaby,cute wannabe, Eli is so annoying. This show has one of the worst cast ever.\\n\\n\r\nThe Art style and the fights kinda saved the Animé from being a disaster.",
            "date": "2018-10-14T17:55:00+00:00",
            "helpful_count": 40,
            "mal_id": 291769,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6188903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/iiAlieZii",
                "username": "iiAlieZii"
            },
            "url": "https://myanimelist.net/reviews.php?id=291769"
        },
        {
            "content": "The sequel I desired, but not the sequel I expected it to be.\r\nPretty much the show starts off with a big thump, direct continuation from the first season. As strongly and unexpectable it could be, the rest of the show didn't follow the tempo.\r\nAt the start we are getting familar with an old-new, even greater threat than before. To be honest I felt like it was the most generic way the show could possibly go and further on I realized I was right.\r\nPost-intro part gets only slower and slower while implementing stuff which doesn't feel that important for the main plot.\r\nA LOT clichés for fantasy-supernaturalanime world has been used, not many explanations that I wanted and some that looked like a filler... Well I feel like vast part of this season was one big filler.\\n\r\nGetting to the point, I didn't notice much of the story development (possible spoiler here: show ends in like half of what it wanted to tell!), not much of the character development (well, it tries to tell us about one thing, it tells but then it repeats it over and over in next episodes).\\n\r\nAs long as the story is not doing its best, it can be still quite enjoyable.\\n\\n\r\nGetting to the art, I don't know if the previous season was similar, but I noticed quite a few scenes here and there that were literally boring which lead my attention to focus on the art and what I noticed was poverty... It's understandable to make some cuts on the less important moments or backgrounds, while focusing on the first plan, but... Literally when making some 'fill in' dialogue, scene is one and long frame, with almost none movement, probably they expected to cover it with some nudity.\\n\r\nI would say that it's fair most of the time with some really awful moments.\\n\\n\r\nI'm not really good with rating sounds, so I'm gonna say that it's avarage with some good tracks and openings.\\n\\n\r\nCharacter development feels poor, focusing on few and neglecting all the rest, not much to say without a spoilers, but I didn't learn many new things about most of the cast.  Good example of decent character introduction, but poor development (that was present all the time) is Escanor - such potential, mysterious and undiscovered character has been revealed with flat backstory, well, atleast his behaviour was interesting, but not much time was invested in that.\\n\\n\r\nComing to the end, show is fine, enjoyable but it got noticable flaws, that make it taste like an undercooked pork.",
            "date": "2018-06-30T18:47:00+00:00",
            "helpful_count": 36,
            "mal_id": 282653,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488037.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yellow_INC",
                "username": "Yellow_INC"
            },
            "url": "https://myanimelist.net/reviews.php?id=282653"
        },
        {
            "content": "First impressions of Nanatsu no Taizai: Imashime no Fukkatsu\r\nWith much delay, I finally conclude the first impressions of Nanatsu no Taizai: Imashime no Fukkatsu, a series that I am following this winter season, which is already quite advanced.\r\nNanatsu no Taizai: Imashime no Fukkatsu or \"The Resurrection of the Commandments\" is the sequel to the anime based on the original Nakaba Suzuki manga set in medieval Britain and partly inspired by the Legend of King Arthur. And I say partially, because although Arthur Pendragon is part of the story, those who have read the manga or watched the anime, know that he is not the protagonist... despite the recent events of the manga.\\n\\n\r\nUnfortunately I did not do a review of Nanatsu no Taizai at the time, but it is worth saying that despite its fanservice and its apparent superficiality, I consider it a good Shonen of Battles. Its protagonist Meliodas is of the type of characters that from the beginning is too powerful, but what makes him interesting is his personality. Although he appears to be a relaxed and somewhat perverted guy, in fact he is much deeper. His past is a great mystery in the first season, as well as the origin of his power and everything is to be revealed in this new series.\\n\\n\r\nThat said, although the anime was entertaining, its production values ​​were not really high. The animation was not particularly bright and the adaptation is correct, without even matching the overall quality of the manga. However, just like the manga, in its second half, this first series improved a lot in its rhythm and ended quite epically. At the time of closing that season we already knew 6 of the 7 Capital Sins. Meliodas the Sin of Anger, Diane the Sin of Envy, Ban the Sin of Greed, King the Sin of Sloth, Gowther the Sin of Lust and finally Merlin, the Sin of Gluttony.\\n\\n\r\nWe have one to know, and boy do I want to see that. But let's move on to the important thing.\\n\\n\r\nHow is Nanatsu no Taizai: Imashime no Fukkatsu?\\n\\n\\n\r\nIf you are a lover of the Shonen of Battles, this series is a mandatory stop. Having seen the first episodes, I must say that the series continues to be quite common in terms of its technical quality. It is not a series that surprised by its animation. However, its quality remains fairly consistent with respect to last season.\\n\\n\r\nTakeshi Furuta replaces Tensai Okumura and Tomokazu Tokoro as director for A-1 Pictures. Takao Yoshioka takes on the job of adapting the original Suzuki script. Keigo Sasaki continues on board in the character design, and fortunately, Hiroyuki Sawano is still involved with the soundtrack, along with Takafumi Wada. Kohta Yamamoto also joins them.\\n\\n\r\nThe first episode picks up where it left us, Signs of a Holy War, the four-episode special that followed the original television anime. Princess Elizabeth of Liones has a dream in which she sees Meliodas face some shadows, but everything seems to go in peace. There is a ceremony where the Seven Sins are decorated, or at least the 4 that are present (Ban and King left before the ceremony). It is there where we get introduced to a new element in the anime that will be very familiar to fans of Dragon Ball: the power levels.\\n\\n\r\nYes, Nanatsu no Taizai has power measurements. The system is simple, each character has a number of power that is extracted from the sum of the magical power, physical power and spirit or will power. Hawk will be in charge of giving us those numbers so that we have clear who is who in this world.\\n\\n\r\nThe purpose of this is simple from the plot point of view: it is to put fear in the body. Basically, this was the simplest way Nakaba Suzuki found to help us establish a hierarchy, now that the Ten Commandments are the new threat.\\n\\n\r\nIn any case, both in the manga and in the anime there is a certain coherence with this theme and the inevitable powerups of the protagonists are justified. In some cases because in fact his real power was greater than that known until now and in others with training, as usual.\\n\\n\r\nFinally, a detail. The opening, a collaboration between FLOW and GRANRODEO titled Howling, is in fact quite disappointing. Considering the previous work of both groups, the only thing that could be expected was a historical opening and in fact it left me quite cold. It's not a bad song, do not get me wrong, but it could have been better. In addition, the video does not favor it, too mediocre and unimaginative. It is a pity.",
            "date": "2018-03-08T14:33:00+00:00",
            "helpful_count": 35,
            "mal_id": 273359,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6887246.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/CanAKATheIndigo",
                "username": "CanAKATheIndigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=273359"
        },
        {
            "content": "There aren't great many things that make Nanatsu no Taizai a good anime or even worth of watching. There still are some, and I have personally been able to enjoy this season --or at least most of it-- better than I ever thought was possible.\r\nThe main characters are not among these reasons. Our mc is pretty much the most boring and uninteresting shonen lead there has ever been. On the other hand, he is also so bland and empty character that he isn't very annoying either. Outside the fact that he is voiced by the same guy who did the main lead in Guilty Crownwhich is always a minus. Elizabeth brings exactly as much to this series as Orihime did to Bleach. Pretty much all the rest are so forgettable that I had to spend 30 minutes reading FAQ's before even starting this season just to get some sort of recollection of who is who... only to see that it literally does not matter if you don't know who anyone is. Practically anyone can be criticized with more words than they can be praised with. The series is amazing like that. \\n\\n\r\nThe story certainly does not make this series worth of a watch for anyone. Or if it does, then I surely am not among these fellas who watch this series for its story. One could say the story makes it hard to enjoy even (especially during the 2nd half of this season), but it doesn't require all that much effort to look past most of its problems. If you have the tendency to pinpoint flaws and count how many times a series aimed for 13 years-old youngsters chooses the most obvious outcome, then this show most likely is not for you no matter what I will say few paragraphs after this one. Smart choices have still been made here in terms of writing. For one, the series doesn't constantly rely on powerups, asspulls nor friends who come to save the day on the very last second. Even \"the best anime ever\", Fullmetal Alchemist Brotherhood, did this constantly. In fact, being a cliche shonen story, Nanatsu no Tanzai has abandon surprisingly many of the common cliches and tropes. Few of the romantic subplots and the heart-warming conclusions to drama are actually pretty well-written, and the show can be praised for how well it succeeds in terms of the given drama and past stories.\\n\\n\r\nThe art, sounds and overall production of this series are not the reason -- or even close to the reason -- why I considered this to be entertaining. In fact, the art is often eye-catchingly bad. Especially the character design on most of our main dudeouses seem to be the visual representations of their uninteresting personalities. The animated mouth movements seem the worse the more you pay attention to it. It's hard to unsee once you do. The OST is nonexistent, but during some of the drama moments, makes the series seem better than it is. Powerful, good songs right there. Otherwise the OST rarely serves the series, but on the other hand, it is fairly original and has practically no similarities with tracks commonly heard in FTS series. This is, at the very least, worth of noting. Now that all the reasons on why this show is not the best thing ever are over with, let's talk about why I was able to enjoy it: Let's talk about two amazing characters.\\n\\n\r\n\"Apologize to me that you were born into this world.\"\\n\\n\r\nThe not-even-a-bit-arrogant Escanor is the epitome of 3 things: badass, manly and bro. This fella is the manliest character I have seen in anime since the muscular, mute and shirtless Freddie Mercury seen in the anime 'Cromartie'. Escanor speaks, has manlier mustache and occasionally even wears a shirt. Are you part of the Armstrong cult from Full Metal Alchemist? I have good news for you: You are now part of the Escanor cult. Remember that guy from Saint Seiya who only ever trained his grip power? Running around in the forest, strangling bears to death. Frankly, that fella couldn't even shake Escanor's hand. Overall, Escanor is the most interesting character I have seen in shonen anime since Hisoka (Hunter x Hunter). Man so manly, he is able to carry pretty much any content with his personality. \\n\\n\r\n\"This must be the nest of humans.\"\\n\\n\r\nGalland is the other great character and also a real bro. Only cares about destruction, sees humans as parasites or insects. I admire this character. He does great job on creating the illusion that our main characters are in real danger and might as well die at any point. Without spoiling if this happens by his hands or not, he really does manage to convince me upon his introduction that this might as well be the faith of any character who is not protected by plot armor. The way he manages to corner our main characters is just really badass. It's surprising even to see how the author challenges his own writing skills by creating such hard-to-overcome situations around Galland. To put is simply: Galland is so merciless that if he had a role in Fairy Tail, I would still be convinced that he can actually kill someone of importance in it.\\n\\n\r\nAs a conclusion, these 2 characters make this season highly enjoyable. The former season + OVA are air to me, I never cared about this franchise until now. The 2nd season of Taizai does one thing right, it is this thing, and it does in a manner which I can give it credit for. Despite all the problems the show has, this season was still of high caliber for approximately 70% of the time.",
            "date": "2018-06-29T15:01:00+00:00",
            "helpful_count": 29,
            "mal_id": 282555,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=282555"
        },
        {
            "content": "This is a short and on point review about the second season of Nanatsu no Taizai.  A-1 Pictures adapted the source material as it did with the previous season but this time it did a good job regarding the characters. After finishing the first season nothing left a good impression, the story and characters become forgettable after some time .\r\nSeason 2 solves all the previous problems from the first season and focuses on the bonds between our characters, their past and how they eneded up as the 7 deadly sins making them memorable for our viewers. We also have a new sin Escanor whois probably imo the main reason to watch this season.\\n\\n\r\nAs you watched the ova series you know how Ban ended up being immortal , in addition to that season 2 shows his past as a child and the one who teached him how to be a thief and many more surprises who will bring  a litlle warmth to your hearth....We found out more about Melioda's lover more about his connection with the 10 Commandments and his bond with Elizabeth. Even the bad guys from season 1 get their reasons explained so they won't end up just as a tool for the 7 deadly sins to look cool after beating them. Long story short, less fights more worldbuilding and characterization which for I praise A-1 Pictures for sticking to the source material.\\n\\n\r\nThe story overall is not something outstanding it follows the usual shounen formula but what gives some substance and depth to this season are the characters ! Music is good as always the animation top notch(A-1 Pictures always invest tons of cash regarding that..) and enjoyment guaranted nothing more or nothing less from this genre.\\n\\n\r\nEnjoyment has always been a + factor for this anime and season 2 doesn't forget to entertain its audience with the character's humour side and fights. The skills are mostly explained and also in each fight their is a stake involved.. What brought new season 2 in comparasion to season 1 are the Ten Commandments who among them are some interesting characters who you cannot hate them despite being evil. \\n\\n\r\n In conclusion this season managed to make me experience a variety of emotions, managed to amaze me and entertain me to a certain point in each episode and finally it left a overall good impression after I finished it. I recommend it to those who are interested in this genre or for the usual Nanatsu no Tazai manga and anime fans.\\n\\n\\n\\n\\n\\n",
            "date": "2018-06-30T04:36:00+00:00",
            "helpful_count": 20,
            "mal_id": 282588,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=282588"
        },
        {
            "content": "Well, in my review of the first season I said that 4 was a lot for Nanatsu in Taizai, so I want to explain why 2 for this season.\r\nWell, I'll be more direct, the only good thing anime nese are the character traits and designs, that's it, nothing else.\r\nHistory: unlike the first that tries to develop something, here there is nothing to be developed, basically the villains appear at the beginning, and stay like this until the last episode, nothing walks, no character is deepened, some even have their moments, and no, the Meliodas does not have a significant deepening, it is simply a flashbackplayed and only. The story is VERY badly adapted from the manga, with a HORRIBLE, confusing ending, and that explains nothing, apart from a cut from one scene to another without any explanation, the lack of cohesion here is absurd.\\n\r\nCharacters: Ruins, but very bad, basically the minor characters are not important, and the curious, they go to a place to train, and guess what? No use, power goes from 1000 to 1050, something ridiculous, basically their existence has no meaning and value in the work, and worst, the work tries to force the contrary.\\n\r\nThe characters are hardly in depth, they are useless, they only serve to give spotlight to the principals. And one of the worst things, is to force a character to lose to generate hype on the villain, something disgusting and poor. The villains? Terrible, none of them has been deepened in AN ENTIRE SEASON, they are completely shallow and empty.\\n\r\nThe soundtrack here is disappointing, compared to the first one, it's bad.\\n\r\nEnvironmentalism remains childish and silly.\\n\r\nBad and predictable script, no passing excitement, the protagonist remains almost the same throughout the season.\\n\r\nNeither the fights lend, are cut and fast, without any emotion. Not to mention the animation that fell a lot!\\n\r\nNanatsu is an anime that would not recommend to anyone with critical sense, an anime with Netflix syndrome, that only makes success because of this, an annoying and annoying base fan, composed mostly by adolescents and children.\\n\r\nA horrible anime!",
            "date": "2019-03-04T20:37:00+00:00",
            "helpful_count": 13,
            "mal_id": 302923,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7434388.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 7,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/KevynCosta",
                "username": "KevynCosta"
            },
            "url": "https://myanimelist.net/reviews.php?id=302923"
        },
        {
            "content": "Very slight spoilers, Not really revealing anything.\r\nThe first couple episodes of season two just pulled me right in.\r\nThis is the best seven deadly sins to date. Everything which is happening are thing I never saw coming.\r\nI like that, I really like that. Thats the one thing which probably keeps me super interested, is the fact that I really don't know whats going to happen next.\r\nSome animes you just know. The MC's too strong he just destroys all without hitch (irregular at magic high)\r\nIn this one, the mc's been out matched, out matched in the previous sin as well.\r\nHes strong, but he's not strong enough tobeat everyone by himself. \\n\\n\r\nThe other characters aren't slacking either. King, Diane, Ban, Gowther, Hawk-chan, Elizabeth, merlin, and others they all build their characters through the episodes. It's awesome progression\\n\\n\r\nEspecially hawk chan after the training. That was funny as hell. I almost couldn't stop laughing.\\n\\n\r\nThis is my favorite anime atm. I think others should watch Seven deadly sins from the start if they haven't already.\\n\\n\r\nReally epic series. I'm far more impressed with season two tho.\\n\\n\\n\\n",
            "date": "2018-04-29T15:22:00+00:00",
            "helpful_count": 12,
            "mal_id": 279351,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6350392.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Swaheelee",
                "username": "Swaheelee"
            },
            "url": "https://myanimelist.net/reviews.php?id=279351"
        },
        {
            "content": "The devolution of Seven Deadly Sins into a garb-trash shounen anime.\r\nStory: The story is stupid. Main sexual assault victim Elizabeth dreams that something is going to happen as well as her father, and neither of them speak up, and the world goes down the shitter with the plot because two idiots who clearly knew something was up said \"oh it's nothing\". Jeez where have I seen that one before.\r\nArt:The art is the same as S1 as far as i'm concerned. Nothing special.\r\nSound: The sound is also pretty much the same. I still want to drag my balls across a sea of broken glass whenever Elizabethspeaks. Intro is- ha, you know you're gonna skip it anyways.\\n\\n\r\nCharacter: More of people who clearly dig each other not telling one another because (no reason).\\n\\n\r\nEnjoyment: I only enjoy this because the last season was serviceable and I'm eventually gonna see Meliodas at his supposed full-power (which is now numerical because this show is going down the shounen-shitter).\\n\\n\r\nFrowny face to studio A-1 for ruining another potentially good thing :(",
            "date": "2018-03-18T18:54:00+00:00",
            "helpful_count": 10,
            "mal_id": 274240,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6343223.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/NaMYAYA",
                "username": "NaMYAYA"
            },
            "url": "https://myanimelist.net/reviews.php?id=274240"
        },
        {
            "content": "Edit: I changed my scoring system around a lot and the scores in this review were not really up to date, so I tried adapt them (indicated with *new*) and changed my 'overall' part.\r\nNote: This is my first review on here and I basically just wrote it because I was bored and thought I might just give it a go (I'm kind of venting here so be ready for that).\r\nWell then, Nanatsu no Taizai 2nd Season (I'll just call it that). Tbh I don't really remember 100% how I felt during the first season of this show but this second season seems to be waymore of a letdown to me. But let's go through the points:\\n\\n\r\nStory: 5 (*new*: 3) - The whole medieval-magical setting with a group of special, strong warriors (The seven deadly sins) fighting evil threats (demons) sounds rather interesting to me, and having those warriors fight a group of special, strong demons (the ten commandments) in an ultimate fight of good vs evil is a pretty cool base concept for a battle shounen.\\n\r\nThe problem, however, lies not in the premise but the execution: The clash of those two groups is the main focus of the show and of course you can not just have them start fighting from the very beginning, but the way their fight is delayed seems extremely tedious: annoying sub-plots (one character loses her memory for the 50th time, the characters have to train in a cave for like a day or so, another character runs off to visit his dead girlfriend etc.) are thrown in to keep the main characters from actually figthing the big bad evil guys while said evil guys sit around and do nothing (because they conveniently have to replenish their energy). Together with some uninteresting characters that get introduced (the kings brother or whoever that guy was and his whole squad, Dianes 'senpai' etc) this seems to ruin the whole flow and pacing of the show. The build-up of for the final clash does not feel like a  build-up, just one little sup plot happens after another, and then, boom, now we fight the bad guys because we just ran into them.\\n\r\nSpeaking of that fight, pretty much the whole cast except maybe two people are utterly useless in that figth: Very early on it gets clear (thanks to some super lame power scale mechanic) that the commandments are way stronger than every character on the good side with the exception of Meliodas who just gets stronger and stronger leaving all his buddys behind as some useless exposition dummys.\\n\r\nThe show also has some pretty lame twists in it that were only shocking because of how dumb they seemed (Not trying to spoil anything but keyword Hendrickson for example).\\n\r\nThe writing in general seems actually quite horrible in some parts... I mean I don't expect a battle shounen to have a super complex, deeply thought out plot structure and what not but this show has some moments where I was actually getting furious as to how badly they were written (the mentioned stupid twists, characters coming back when they should be dead, the power levels escalating way too quick, stupid new abilities getting introduced out of nowhere etc...).\\n\\n\r\nArt: 4 - Just not a big fan of the artstyle (especially the faces and clothing) but it's not necessarily ugly I guess. Animation is nothing special and seems lacking in some parts but more or less watchable.\\n\\n\r\nSound: 6 - Does not really stand out to me which does not mean it's bad, it's just nothing special either. \\n\\n\r\nChracters: 4 (*new*: 2) - Together with the writing probably the worst part of this show (also the part where my opinions influences my enjoyment of the show the most): I just don't like the characters. Like allready mentioned pretty much everyone aside from Meliodas is super weak compared to the commandments which does not help make these one dimensional, bland characters interesting in any way. A couple of examples: Elizabeth is just there to be sexually assaulted and whine all the time, King's dialogue seems to have \"Diane\" in every line, Diane herself does nothing except for... no actually nothing. Arthur, Gilthunder and the other Knights pretty much do the same as Diane and seem to only serve the purpose of showing us how strong the demons (and Meliodas) are. And the worst is probably Meliodas himself, getting stronger everytime the plot needs him to and being a goofy molester all the time (well mostly) when he is not in battle. On the other hand, the commandments do not seem to have any real depth or motivation to them other than \"we are evil because we are the evil ones\" but since that might get covered in the future I'll let that slide for now. (EDIT: being on episode 23 now, I'm not really optimistic about that)\\n\r\nEscanor and Ban are two characters I actually like but they are also not really well written in my opinion. \\n\r\nAnd also what's with all the backstorys (Diane, King, Ban, Meliodas, Escanor, Elizabeth...)? I mean backstorys are fine and all but that many? For pretty much every important character? Is ist not possible to characterize them without the need of a backstory?\\n\\n\r\nEnjoyment: 4 (*new*: 3) - In conclusion I don't find this show very entertaining, there were episodes where I was seriously questioning the authors writing abilities and I thought about dropping it multiple times. While the premise is interesting the characters and the writing are terrible and the animation is mostly mediocre. I don't want to be your typical Hero Academia d*ck rider but seeing the two shows airing together, thus comparing them, makes Nanatsu no Taizai look even worse.\\n\\n\r\nOverall: 3 - Because of the reasons listed above I scored this show a 3 out of 10 which indicates a 'very bad' or 'poor' show. \\n\\n\\n\r\nLike I said this review was created on a whim and out of boredom, I pretty much just wrote this down for me but if anyone finds this angry wall of text helpfull that'd be cool too I guess.",
            "date": "2018-06-20T08:07:00+00:00",
            "helpful_count": 7,
            "mal_id": 281654,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5617750.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GreeenSponge",
                "username": "GreeenSponge"
            },
            "url": "https://myanimelist.net/reviews.php?id=281654"
        },
        {
            "content": "This review contains what some would consider to be spoilers.\r\nNothing listed here will 'ruin' the show for you.\r\nOpening thoughts. \r\nThe second season of The Seven Deadly Sins Revival of the 10 Commandments was not only hard to watch but felt like a literal job to finish. The show itself is extremely lackluster in comparison to it’s predecessor and expands little to no character development regarding known characters. When it does it feels misplaced and is used to expand a segment of the show for Deus ex machina moment(s) that don’t effect the plot but rather finish a segment that needed more development in the firstplace.\\n\\n\r\nThe sequel itself suffers from two key elements: bad writing, and bad villains. The title ‘Revival Of The 10 Commandments’ (and the opening) suggest a full out war between the two parties. This notion had me hooked, as I thought personally that the original was well done but didn’t finish correctly. I’m already digressing, however it must be said, the original did not include all seven of the cast members. When your title hosts such a statement you should uphold it, season two shares this flaw. \\n\\n\\n\\n\r\nThe writing is atrocious, the story-line is obscenely passive and the plot moves at a snail-speed. (On your drive to work tomorrow insult the car in front of you which hosts the old lady doing 20 in a 60 zone the 10 Commandments.) These villains sit around for 10 plus episodes doing gobshite. ‘Collecting their power, powering up’, right. I came here for an all out war between some heroes and some anti-heroes and what did I get? Drivel. Absolute unadulterated drivel. The first 10 episodes or so had full advantage to take us away into the minds of these bad-guys. Instead we got childish banter between them, they’ve been sealed away for how long…? Why don’t they just go rip **** up? Oh right, bad writing. This need to stick to source material has killed these characters as anti-heroes. They're buffoons. \\n\r\nSpeaking of bad writing when the 10 Commandments finally decide to take action they don’t act as a unit. Galand takes off in pursuit of our heroes without a second thought, and later with with Melascula. The others just sit around presumably smoking weed, because goddamn, are they lazy. What are they waiting for? It’s almost like they themselves know they’re in a badly written anime. The villains are stupid and carry no real motive for their actions. It is always, always, either a two-on-one or a one-on-one fight, (with the exception of Meliodas being bamboozled by the all the surviving Commandments at once, [however you can’t really call that a fight]). These villains had time to develop, but in the end they were just throw away disposable garbage for our shounen hero to destroy. What a waste of effort.\\n\\n\\n\r\nAnother issue I had was the introduction to ‘power scaling’. It did not need to be introduced. It is about as useless as Diane losing her memory. Plot devices that serve no purpose are not welcome to any viewer. The apologist may cackle: “They had to introduce power scaling because of Escanor and his 500,000 power-level, noon, etc\". Rubbing salt in the wound here, Escanor is an amazing character and shows 10-fold (pun intended) the character development in his short time on screen. I would rather have a standalone show about him than this little smug asshole who fondles breasts and meets every shounen main character stereotype.\\n\\n\\n\r\nThe problem with Meliodas and Elisabeth’s relationship is that it’s creepy. I shouldn’t have the explain this. It’s shown later in the show that Elisabeth was ‘uncled’ by Meliodas as a young toddler after he had saved her from disaster. In this episode we get a flashback of Meliodas being very big-brother-like to Elisabeth. Just before Monspeet and Derieri’s attack he wakes from his slumber, which is explained “he can’t die” after he died… and saw his father the Demon King… and they were going to fight… Yea what the *** happened there…\\n\r\nCalling it a memory just makes it worse.\\n\r\nAnyway this a shounen so stop asking questions that need actual logical answers.  \\n\\n\\n\r\nBefore Monspeet and Derieri’s attack he fondles the living **** out of Elisabeth. Now I’m wondering, did he do this to her when she was young too? That’s sort of distressing and puts me off his character more than before. I cannot take his character seriously now, not like I could before.\\n\r\nExpanding on the fight with Monspeet and Derieri, these characters were wasted. I’m seeing this happen a lot in season two. These terribly written villains get two fights and they’re killed. No expansion, no motive, no purpose. It is a justified time for our hero to just ‘full counter’ their attack back at them killing them instantly.\\n\r\nThese two had chemistry and it was never shown beyond the surface, it really pissed me off. It really pissed me off that shorty-sex-offender just came back from the ‘dead’ and made mincemeat out of some villains that deserved so much more attention.\\n\\n\r\n I’m giving Nanatsu no Taizai: Imashime no Fukkatsu a 6.2/10 for:\\n\\n\r\nBad writing.\\n\r\nHorrible plot devices that leave more questions than answers.\\n\r\nA terrible anti-hero cast of villains who should’ve been schooled by the Phantom Troupe.\\n\r\nMerlin and her standalone Dues ex Machina reveal near the end of the season.\\n\r\nSome sequels just shouldn’t exist, this is one of them.",
            "date": "2018-12-29T02:14:00+00:00",
            "helpful_count": 6,
            "mal_id": 297292,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5283499.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Meew2",
                "username": "Meew2"
            },
            "url": "https://myanimelist.net/reviews.php?id=297292"
        },
        {
            "content": "This is the best anime I watched so far, and probably that I'm going to.\r\nNot that I'm going to die anytime soon or something, but the past is obliterating. Especially the past and the characters, though I think it's not presented in the way it deserves.\r\nLet me clear some points:\r\nThe story is not SHALLOW: Not at all, not even 1%. You might think so if you watching the anime on a hurry just to put a check mark, but if you pay the slightest attention, you'd fall deep into the story. A little bit is presented about the characters, or even 3000 years ago andthe anime provided no hints about it. Personally I think the anime tells just a brief bit of the story and is going terribly fast without explaining the motives sometimes, this makes me think hard about the story and what might the characters be experiencing, especially those who lived 3000+ years, and it's frustrating, but deeeeeeep.\\n\\n\r\nEach character has a really meaningful story behind them, that is almost entirely shadowed, and they don't seem to tell the story from their expression, which is kinda absurd but deeep, what makes them do that ?\\n\\n\r\nPowers are O.K., I actually like the system, but they don't serve a major part of the story. I like the fact that each clan has something special, and how humans attainted significant powers, like godess clan level by making weapons. It's not free, Arthur sword took thousands of years to forge and is actually unique to humans. If you come from a hardcore fighting anime background like DBZ or only watch naruto fights, you might not like the anime right away.\\n\\n\r\nTHERE IS NO FAN-SERVICE, the only instance of this is Meliodas, which is the protagonist, X Elizabeth. And this itself has a story behind it in the manga, as Elizabeth is the .... doing let me spoil. We've actually seen him reject doing that to other ladies. Actually the whole sexuality shit is absent in the anime which is kinda cool. But, we've seen many characters yearning for their deceased loved ones.\\n\\n\r\nThis is the anime to watch.",
            "date": "2018-03-26T00:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 275115,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Bittercities",
                "username": "Bittercities"
            },
            "url": "https://myanimelist.net/reviews.php?id=275115"
        },
        {
            "content": "Nanatsu No Taizai S2 is a direct sequel to S1 so please watch S1 first.\r\nIn season 2, following the celebration of peace in Britiana, the member of the Seven Deadly Sins are awarded medals for protecting the country.\r\nIn this season, it shows Ban the Sin of greed 'betraying' his team to revive a girl whom he loves. He left the team following which King the Sin of sloth followed him to visit the place where Ban's love's body is. Ironically, the girl is King's sister (revealed in S1).\r\nWith their leave, Meliodas senses a great danger approaching and that is the revival/ release of the TenCommandments, said to be the strongest of the Demon Realm, each wielding as much power as Meliodas.\\n\\n\r\nThe story continues as Meliodas's team has to fight the Ten Commandments while Ban tries to revive his beloved.\\n\\n\r\nIt is also said that the final missing member of the team, Eskanor the sin of pride will be coming into this season and I look forward to that.\\n\\n\r\nSo far, up till episode 5, the anime is developing without a hitch and I hope this can continue.\\n\\n\r\nNanatsu No Taizai is probably one of the funniest, most entertaining Shonen anime so far. I'm open to hearing suggestions for other anime.\\n\\n\r\nSound 10/10\\n\\n\r\nI very much enjoy the new OP and the soundtracks used are not repeated from the previous season so that's good.\\n\\n\r\nArt 10/10\\n\\n\r\nFollowing my review in season 1, the art is made by A-1 Pictures. It's only normal that it gets a 10/10\\n\\n\r\nOverall \\n\\n\r\nStill watching, I just have to say something about the bad reviews which I feel are abit too harsh",
            "date": "2018-03-15T22:46:00+00:00",
            "helpful_count": 7,
            "mal_id": 273936,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6221320.jpg",
                "scores": {
                    "animation": 10,
                    "character": 0,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DoomRanger",
                "username": "DoomRanger"
            },
            "url": "https://myanimelist.net/reviews.php?id=273936"
        },
        {
            "content": "Great show, sure it may have flaws if you look at it critically but i just binge watched it and couldn't stop for a break. In short, it was really enjoyable, and isn't that the most important part of watching a show? This is my first review so sorry if i suck at this but i'll try my best. I will try to keep my first review as short as possible.\r\nStory - 8/10\r\nThe story is not perfect, but good enough to where you can enjoy it and follow along. The different clans, and how they had a war 3000 years ago is pretty interesting. Itsa pretty simple story in this season where the 10 Commandments are free from their seal as it was broken and now the seven deadly sins have to stop them from starting another war. All while having different small sub-plots in between. The story was executed pretty smoothly although it was a bit slow at the start of the season and fairly rushed with a lot of pacing issues near the end. Thankfully the middle of the episodes made up for it with how great they were.\\n\\n\r\nArt - 8/10\\n\\n\r\nThe art was great with a lot of cool fight scenes that had good movements and great animation. The animation was solid up until the 21st episode, i feel like they spent their whole budget on this one particular fight that looked amazing. After this episode things got really bad to be honest, quite poor animation and most of the fights looked average at best.\\n\\n\r\nSound - 10/10\\n\\n\r\nI've listened to the original soundtrack a billion times, its great. Not only that, but the soundtrack for certain characters is really good too. Oh, and during the fight scenes, the soundtracks played were perfect and went so well with the fights.\\n\\n\r\nCharacter - 9/10\\n\\n\r\n I enjoyed almost all of the characters they all have interesting backstories and different personalities. We all know how annoying and useless Elizabeth is, but that doesn't mean that all the characters are bad. All of the seven deadly sins have their own backstory with some of them being really deep and sad, like the main character, Meliodis. \\n\\n\r\nEnjoyment - 10/10\\n\\n\r\nI haven't enjoyed a show this much in a while. When i started watching the first season was already complete and the second season had 3 more episodes left so i didn't have to go through the trouble of waiting once a week for an episode. I caught up to the anime in about 3 days which means i watched 45 episodes in that time frame. That should show you how much I enjoyed this show.\\n\\n\r\nOverall - 9/10\\n\\n\r\nSeason 2 of this show is really good, and although i personally think season 1 was better overall in terms of pacing and story, this season was much better if we are looking at epic moments/character introductions and higher stakes on the line. And of course if you take your time and look at this show critically you will find some flaws, which is why some people might rate it lower. I believe the pros out way the cons in this show, but that's just my opinion. I like to just go by how much i personally enjoyed it and if you can see how fast i watched it, then you should be able to tell that i enjoyed the hell out of it.\\n",
            "date": "2018-07-10T05:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 283614,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Furqan",
                "username": "Furqan"
            },
            "url": "https://myanimelist.net/reviews.php?id=283614"
        },
        {
            "content": "I really loved the story and also everything was really new for me because I didn't read the manga so I gave it a 10/10. The Artwork was also amazing and was also anticipated because they spent a lot of money for the visuals so I decided to give it a 9/10. The sound was really amazing and always switched up my moods. The sad melodies especially the one during the conversation between Fraudrin and Griamore before he tried to commit suicide by making an explosion made me really feel the sadness and nostalgia so I gave it a 10/10. The character developments and thenew secrets that the anime shared with us was outstanding also a 10/10. I really enjoyed watching every single second of all 24 episodes of the second season of this anime and I'd also say it was better than the first season so I gave it a 10/10. Overall a perfect shonen anime that's the reason why I rated it with a 10.",
            "date": "2018-07-08T16:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 283445,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5154703.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ichigo-light",
                "username": "ichigo-light"
            },
            "url": "https://myanimelist.net/reviews.php?id=283445"
        },
        {
            "content": "This review might contain some spoilers, but I’ll try to keep it down.\r\nFirst of all, I can’t say I disliked this show. To be very honest: I bingewatched it and I enjoyed every single second of it (or almost every second). But, sometimes you shouldn’t judge a show by how much you enjoyed it. Sometimes, you have to have a critic view. And in my critic view, this show kinda really sucks.\r\nIn the second season of Nanatsu no Taizai, we meet some new villains for or hero's to defeat: The Ten Commandments from the demon clan. This is exactly where I stumble upon the firstmajor problem with this second season. The villains are absolutely shallow. There are bad because… well, they’re demon’s, I guess all demons are just evil. They have no motivation whatsoever and their personalities are just… evil. The only villain that manages to go trough a little character development in the season finale, is Fraudrin. (spoiler) He was prepared to wipe away his evil intentions, because he actually loved Griamore, the son of Dreyfus, whom Fraudrin possess for quite some years. For the rest, the villains just get revived and start killing people to be able to reign over the land again – because reigning over a land full of dead bodies is totally fun.\\n\\n\r\nThe second thing that really ruins this show (and this actually annoyed me a bit) is very lazy storytelling. If you need to give a character the power to see the ‘power level’ of others… then you’re just being a lazy ass storyteller. You don’t need to show us a number, show us exactly how dangerous these people are BY MAKING THEM FIGHT. The mangaka also made The Ten Commandments fight, so I don’t actually see the point in giving Hawk the gift to see power levels? Well, maybe that’s just me. That’s not the only part where the mangaka falls back into lazy storytelling. Having the character’s explain things, just weakens the plot. (spoiler) Like, for example, when Fraudrin literally says that he is a replacement, or when The Ten Commandments explain their powers… I mean, you don’t need to let the characters tell us that. We have eyes, we can see it.\\n\\n\r\nAnother thing about power: why are The Ten Commandments so crazy strong? I know that the MC’s need a challenge and all… But really, the difference in power is a little overboard. The only sins that could do something, were Meliodas (cause, duh, he’s the main character), Merlin (because (spoiler) she could totally not take on Galand, but Greyroad, who is supposed to be stronger, is no problem at all) and Escanor (but only when he’s not useless, like, every night, and (spoiler) off course The Ten Commandments attack at day, because why the hell would they wait ‘till night?). For the rest, all other characters were totally useless and I didn’t really get why they were even there.\\n\\n\r\nNow, let’s go on to the characters. The mangaka probably noticed that Meliodas was not quite a deep character, so (spoiler) he gets some dark power and a shady history as former leader of The Ten Commandments. Elizabeth still has no character at all. I mean, c’mon, we all know the only personality she has, is being nice, helping other people and being high over heels for Meliodas. She has no flaws at all, ‘cause why would a princes need any flaws? The mangaka then decided to (spoiler) make her the reincarnation of a person from Meliodas’ past, while the only thing they have in common, is their hairstyle. (spoiler) Gowther did get some depth, looking for emotion (like that has not been done a thousand times before). And poor Diane (also not the most complex character) (spoiler) lost her memories again. I’m not a fan of memory loss, so when it is done twice, it just breaks my heart. I do think Ban is a nicely developed character though. For the rest, King also only has one characteristic, that being his love for Diane. (spoiler) He maybe did get some development when he saved the fairies, even when they hated them, risking his own life in the process. And Escanor… well, he loves Merlin (because yeah, you can’t have a male and a female character that are not in love with each other).\\n\\n\r\nAnother thing with this shounen, just like any other popular shounen, is that the mangaka is just too afraid to let people die. I mean, the moment you become even a little important, there is absolutely zero chance that your life is in danger. You either find a way to win even against an opponent who is ten times stronger, or you come back to life, or you suddenly get some massive power (#Escanor, #Merlin). Or, not to forget, Elizabeth suddenly develops a healing gift. So, basically; no worries, MC’s aren’t going to die here. And even when they do, they just come back like in any other shounen. I don’t even feel sad when a MC ‘dies’ and I sure as hell don’t feel any danger when he/she has ‘a hard time’.\\n\\n\r\nBesides all of that, I can’t say one bad word about the music, sound or the art style of this show. The voice acting of Elizath and Diane annoyed me a bit, but maybe that’s just my opinion. \\n\\n\r\nConclusion: this anime is perfect if you just wanna sit down and just watch the nicely animated action without thinking too much. If you are looking for something different, of something new, something… let’s say… refreshing… this show isn’t really worth your time.",
            "date": "2018-07-06T03:34:00+00:00",
            "helpful_count": 6,
            "mal_id": 283109,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5030891.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/MayLynn",
                "username": "MayLynn"
            },
            "url": "https://myanimelist.net/reviews.php?id=283109"
        },
        {
            "content": "This season of Seven Deadly Sins was really a rollercoaster ride. The first half made me want to drop it but by the end I eneded up loving it almost as much as the first season.\r\nStory: Just like the previous season, its all over the place. The power rankings are just whatever is convenient for the show at the time. Nothing really means anything. Its even more messy than last time. Its supposed to be like this as this show isn't meant to be taken seriously and its a lot of fun. Just be prepared to scratch your head at least twice every episode.\r\nArt: Animationis very nice just like before. They work with a lot of cool darker tones and colours. Designs are all great, especially the new characters. No complaints at all.\\n\\n\r\nSound: I had watched it dubbed becasue idk I just prefered it. Sometimes the voice acting was cringey and off. Merlin's speech as quiet awkward at times. Sound affects were all very nice. Music was great, it fit the time and place and was still epic. The first theme song will probably be in my playlist!\\n\\n\r\nCharacters: They're all brilliant. I love most of them, especially Meliodas and Ban. This is what really kept me going and made me pick this anime back up.\\n\\n\r\nEnjoyment: At times you will ask yourself \"wtf am I watching\" but at others you'll be laughing and enjoying it loads! If you're ok with things not always making sense and not reading into greater meaning, you may wanna give this show a go. \\n\\n",
            "date": "2018-11-28T00:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 294853,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5104482.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Moyosore",
                "username": "Moyosore"
            },
            "url": "https://myanimelist.net/reviews.php?id=294853"
        }
    ],
    [
        {
            "content": "A total score of 5 may seem hard on Nanatsu no Taizai: Imashime no Fukkatsu (The Seven Deadly Sins: Revival of the 10 commandments or simply The Sins S2). Especially according to its high score. But I´m disappointed. I really enjoyed the first season and was glad when I read that a season 2 were coming, and with 24-episodes at that. But my excitement was steadily replaced with disappointment and uninterest. My review will contain minor spoilers to specify why I had problems with this sequel, but they will be heads ups for those (₴).\r\nThe biggest let down with The Sins S2 for me wasthe story and character developments. With that I mean a very uninspired story direction and an almost non-existing character development. What I truly loved about the prequel was the goofy but adventures story, filled with small surprises of meaningful meetings and overdramatic but interesting character interactions. I even didn´t care about Meliodas repetitively grouping of Elizabeth. Some shounen tropes were of course present, but it had its own style, feeling and inventiveness. The battles and fights made sense, they had drive and feeling in them, and some were really nice to look at. The mystic and allure of the sins and their past was thick, and some strong friendships and relationships were formed. \\n\\n\r\nAnd then S2 happened. The far from straight but entertaining story path took a straight battle shounen path, becoming randomly magic/power level face offs, and character interaction became either repetitive, cliché shounen troopy or melodramatic. Let me give you an example, spoiler alert is on ₴. The battles changes from being about enemies facing off each other in creative ways with emotional investment, to be about magic and power levels, tournaments and powerups. Spoiler alert off. Why taking that direction? If this is a faithful adaptation, I think Nakaba Suzuki (the author and artist behind the manga), abandoned the good adventures concept he had established in the first half, for washed out Dragon Ball power level bs. I´m sorry but it is really how I feel. \\n\\n\r\nLet me elaborate. You know the classic battle scene with the top bad asses, where you have proper build ups to get really emotionally invested in it? Well, don´t expect them here. The new threat appears, and in the beginning the whole thing had much potential. A demon clan has been freed (by Hendrickson in the end of the last season), and Meliodas seems to be connected to them. Many potential interesting meetings between the Sins and the Demon clan members, or plot/character developments/interaction as well as background stories. But most of it turned out to be pretty basic shounen trope encounters, with cliché battle speeches and brawly screams of their attacks with cool names such as “Death Breath” and wired mid fight power ups.  \\n\\n\r\nI really wanted to like this sequel. I was absolutely a bit enchanted by the prequel - the magical world with all its different inhabitants and magical functions was very enjoyable. I lost that feeling in S2. A few things are easy to pin point out, as the depletion of the story as well as the amount of new characters. In S2 the numbers of characters keep bashing in, diffusing the time and space from a lot of key characters. Some characters like Jericho got some nice development and time even if her Ban fixation could become a bit embarrassing. Ban gets more time as well (his background mini arc was one of the best parts of the show for me), Diane gets a solid number of episodes focused on her, and Meliodas is Meliodas so time has been spared for him as well. The rest? Is mostly neglected for new characters. Elizabeth? Gets less development than both Sakura and Orihime put together.\\n\\n\r\nIt felt like the narrative both speed up and slowed down at the same time. The scenes took 1s or 10 episodes. Most things happened to fast or to slow. A crashing battle there, and suddenly is guy 1, 2, 3, 4 and girl 1, 2 in a completely different geographical location, training and unlocking powers to left and right for episodes, for them to next split up and be in like 6 different places, to end up little randomly together at a third place later on. The reasons behind it? Weak at best, and mostly poorly explained. I lost interest in who the demon clan members were and ₴ how in hell they can remember things from 3000 years ago so clearly. I lost interest in the powerups, I lost interest in Ban´s and Elaine’s relationship, and I lost interest in Meliodas grouping of Elizabeth. \\n\\n\r\nAnd here I think we are reaching the shows main problem. I just lost interest, in my eyes it didn´t carry this “new” direction well. It crumbled away along known and common battle shounen paths and ruining the atmosphere it built up to that point. The new stereotypical shounen approach just didn´t work well for me. \\n\\n\r\nThe Sins S2 is as its prequel an A-1 Picture production. If your familiar with the studio, think A-1 on a good day there they are putting some in some effort and money in their creation. The style is simplistic but characteristic, and as most A-1 productions, with some nice colourful backgrounds and with curvy ladies and muscly men. And since A-1 actually put in some effort in it, the animation is more than decent, with some intense battle scenes as the one between Meliodas and Ten Commandments or Escanors swift encounter with the demon Galand. \\n\\n\r\nOne of the highlights of the prequel was the solid rock-fantasy inspired soundtrack, which was affect full and well composed. Which they luckily stuck to this time around as well. No complains there. \\n\\n\r\nSo, to summon things up, The Sins S2 didn´t get the job done in my eyes and ears, even if I have no complaints against A-1´s accomplishment. I can see why many still love the show, but the magical spell that The Sins S1 had put on me was utterly crushed. Generic battle shounen can absolutely work, but this direction felt cheap, especially since Nakaba Suzuki had established a very magical world which could been focused on instead of long ego speeches on who´s the toughest, strongest, and most powerful fighter. #disappointedatthemediocracy  \\n",
            "date": "2018-06-30T02:22:00+00:00",
            "helpful_count": 195,
            "mal_id": 282584,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=282584"
        },
        {
            "content": "Stop me if you’ve heard this one before but it seems that battle shounen anime in recent years have been on the decline. Boku Hero no Academia became a big name that is able to carry itself but beyond that, there’s hardly any other that made a name for itself. Well, there’s Black Clover but that abomination is an example of giving battle shounen a bad name in recent years. Boruto has been an underwhelming sequel that looked more like a cheap cash grab for the franchise. Where does a show like Nanatsu no Taizai still stand?\r\nTo be fair, the series already established itself fromsome of its other projects like the first season, OVAs, and movie. It isn’t as long as some other shounen like Naruto, Bleach, or One Piece. In fact, it’s not even part of the “Big 3” as Westerners would call it. However, Nanatsu no Taizai does make a name for itself by developing its own ideas. The first season established the principle cast and felt more like a way to get viewers familiar with the story. In this sequel, the business really picks up as new dangers are unleashed into the world.\\n\\n\r\nFor those who don’t remember, the story picks up right after the first season as Hendrickson breaks the seal on the Coffin of Eternal Darkness. By doing so, he unleashes a group of powerful demons known as the “Ten Commandments”. Essentially, they are the central antagonists of this season. While we don’t know too much about them, it’s known that they hold a deep grudge against Meliodas for betraying them in the past. The first few episodes establishes their testament in power as one of their members is able to make Meliodas look like a jobber in a one-sided fight. This implies that the Ten Commandments are more powerful than anything Meliodas and his friends ever dealt with. In terms of characteristics, the Ten Commandments are known for their unique “Commandment” power and various personalities. For new viewers, you may be surprised at how much personality these beings show for their characters. It’s actually somewhat human for characters like Galand’s arrogance, Fraudrin’s manipulative nature, or Monspeet’s politeness. Unfortunately, there’s not much concrete characterization for the Commandments. I blame this mostly on the pacing because the manga explores much more about their past and roles.  \\n\\n\r\nThere’s actually two sides of the coin regarding the pacing of the show. On the surface, it is indeed slow and some elements of the plot can really be condensed. I actually felt impatient after seeing the season focus so much on characters like Diane and Ban. The latter is actually more important but really should of been shorter than shown on TV. In addition, Meliodas’ past is explored only enough to give viewers an impression of who he is. In essence, it isn’t enough to show the more important side of his role as a “betrayer” to the Commandments. In addition, anime only viewers will probably question what it really means when certain characters call him a “demon” and “former leader”. The other side to look at is how faithful the anime adaptation is. Most chapters cover literally everything from the book with many chapters on a panel-by-panel basis. It’s loyal to the manga readers that really bought the show into what it is. Nothing is changed for fans of the manga especially those who are looking forward to certain scenes to be adapted.\\n\\n\r\nDespite the season focusing on the conflict with the Commandments, new characters are also introduced from the good guy’s side. The most noticeable character is Escanor, the seventh and final member of the Seven Deadly Sins. He makes a hell of an impression that will make viewers hunger for more of his role this season. Other important support characters also make returns that may surprise you. \\n\\n\r\nA-1 Pictures once again uses their resources to adapt this sequel although it actually impressed me for their work. There are certain episodes that really stood out that includes Escanor’s character debut, Meliodas’ confrontation with the Ten Commandments, and Galand’s rampage. Animation quality remains similar to the previous season although A-1 Pictures still falls into the occasional trap of awkward character models. There are also some scenes that didn’t feel as impactful as those in the manga especially in terms of character expressions. However, the battle scenes lived up to its expectations. This especially applies to climatic battles in the latter half of the show that also brings credibility of character power levels. \\n\\n\r\nThe music and OST is still composed by Hiroyuki Sawano although I’m a bit disappointed that most of it is just a rehash of the previous season’s. The new theme songs also sounds less impactful. Despite that, I think character voice mannerism should be given praise especially for the Ten Commandments. Yuki Kaji is able to voice two characters with very contrasting personalities. Others such as Escanor makes their personality stand out much more thanks to the modern talent of Tomokazu Sugita. \\n\\n\r\nNanatsu no Taizai: Revival of the Commandments is a battle shounen that is faithful but perhaps a bit too much for its own good. This series suffered from some pacing issues that I feel like some viewers will not easily forgive. Plus, some of the new characters didn’t really get the amount of charaterization it deserves. However, I would like to say to give this sequel a chance. It’s still part of the franchise that is committed to its ideas and continues to develop the main story as it’s intended. I just hope that when the next inevitable season comes, we get a real showstopper.",
            "date": "2018-06-29T15:12:00+00:00",
            "helpful_count": 64,
            "mal_id": 282556,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=282556"
        },
        {
            "content": "In my opinion, this anime series is particularly overrated by the anime community. \r\nWhat appears to be an anime with decent visuals, sound and budget simply disappoints in the story and character segment. \r\nThe art, animation and sounds are no doubt well made, and this has blinded us to the fact that following the story is simply frustrating. \r\nFirst of all, there is no real price to pay for our heroes, no such thing as punishment for when the main cast loses. \r\nIn one of the early episodes of this season, we are shown that most of the main characters get brutally (and fatally) injured,but actually we have seen that happen multiple times in season 1 already. Lo and behold, the characters aren't even hurt, just got off with a scratch. Viewers have already been conditioned to not feel shock or suspense when something terrible happens to the cast: Meliodas has regrown lost limbs, dear Elizabeth has revived everyone in the final episode of season 1 before, surely it can happen again when the MCs are all dead. \\n\\n\r\nAlso, the story is riddled with annoying subplots that diverge from the main plotline: the revival of the demon clan.\\n\\n\r\nGowther decides to screw with the crew's memory, and they have a pointless internal fight (they still let gowther travel with them, and gowther still doesnt know what he did wrong).\\n\\n\r\nThe fcking giant loses her memory for the second time, disrupts the crew from focusing on the demon clan.\\n\\n\r\nBan leaves the 7 sins so he can continue to mire himself in his dead lover (yes this subplot is still ongoing from the last season). \\n\\n\r\nAnd Merlin has stolen Meliodas' power so now they have to first embark on a side quest to get it back. \\n\\n\r\nWhile subplots are necessary to pave the way for the final fight, the above plotlines seem to have little to nothing to do with the revival of the demon clan. The demon clan don't play a role in these subplots at all, and somehow steers clear of them so that our little heroes can level up peacefully. \\n\\n\r\nAlso, the fucking pig is annoying, especially with its deal with the power level. The storytelling is crap when they have to rely on numbers to help us rank who is stronger than who.\\n\\n\r\nAll in all, this is an anime that disappoints and that betrays our expectation of what is termed a 'well-made' series. There have been many 'well-funded' shounen series like this one (such as Magi and BnHA), but we should not simply believe that it is a good anime just because it has made itself to appear to have more potential than it credits itself with.",
            "date": "2018-03-11T08:01:00+00:00",
            "helpful_count": 63,
            "mal_id": 273565,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/_hazy_",
                "username": "_hazy_"
            },
            "url": "https://myanimelist.net/reviews.php?id=273565"
        },
        {
            "content": "When i was att the 11 episode and i already knew that this was my another mistake, waste of time, now i can confirm that my concerns that this could be \"right click copy Fairy tail, change texture pack, paste without fixing shit that made fairy tail suck\" were true. I was still having hope after first season but now i am just disappointed.\r\nWhy i think it sucks:\r\n1. Childish at the level that it becomes cringey to watch for anyone older than 10 years\r\n2. Same thing like in firy tail but on steriods, writer brings his characters at the position where they must die andthen he is afraid to kill them and he justifies their survival by some weak ass cheesy explanation, also bringing too meny characters that were dead from the beginning of the story to life again by some stupid explanation\\n\r\n3. It literally is fairy tail with different names and skins, completely unoriginal they are not even trying to hide it, that talking pig same as Happy, they are going to train on some island for big fight like characters from fairy tail, Lucy is really similar to Elizabeth joining the guild in first few episodes and falling in love with main character...\\n\r\n4. Cringe degenerate shit with boobs and asses, it was funny first few times when Meliodas is milking Elizabeth but after spamming that same stuf hundred of times it gets embarrassing to watch, and all this shit with naked characters this trans looking Gowther is naked 40% of the time in anime, Merlin with her coat covering her nipples by some wierd laws of physics all the time, and woman in general it is degenerate, i am not the guy thay will complain about \"objectifying women\" like libtard sjw clown but it is too much. I dont know if japanese public is so fucked up that they like this high concentration of shit like this but it is just too much for me, it is distasteful if i wanted to jerk off i would go on pornhub.\\n\\n\r\nI ti is really bad, it is even worse when you know that writers that were clearly coping the fairy tail could easily check for criticism of the work that they are coping and make copy of it while fixing the stuff that was bad, this is the reason why i will say that for me it is even worst than fairy tail.",
            "date": "2018-10-09T16:27:00+00:00",
            "helpful_count": 42,
            "mal_id": 291350,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Neverm0r",
                "username": "Neverm0r"
            },
            "url": "https://myanimelist.net/reviews.php?id=291350"
        },
        {
            "content": "The bad part about expecting a show to be good, is that you end up hating it even if it was ok-ish. That's what happened to me after watching Nanatsu no Taizai: Imashime no Fukkatsu, because I thought it was gonna be great.\r\nWhat I care about the most in Animé, Movies and tv series, is the dramatic structure, the characters and the dialogues. \r\nThe dramatic structure sucks, a lot of back stories, and cheesy drama.\r\nI couldn't stand the dialogues. They were so dry, and predictable.\r\nNanatsu no Taizai's characters have never been good in my opinion, Ban is always mad and angry, Diane is a crybaby,cute wannabe, Eli is so annoying. This show has one of the worst cast ever.\\n\\n\r\nThe Art style and the fights kinda saved the Animé from being a disaster.",
            "date": "2018-10-14T17:55:00+00:00",
            "helpful_count": 40,
            "mal_id": 291769,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6188903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/iiAlieZii",
                "username": "iiAlieZii"
            },
            "url": "https://myanimelist.net/reviews.php?id=291769"
        },
        {
            "content": "The sequel I desired, but not the sequel I expected it to be.\r\nPretty much the show starts off with a big thump, direct continuation from the first season. As strongly and unexpectable it could be, the rest of the show didn't follow the tempo.\r\nAt the start we are getting familar with an old-new, even greater threat than before. To be honest I felt like it was the most generic way the show could possibly go and further on I realized I was right.\r\nPost-intro part gets only slower and slower while implementing stuff which doesn't feel that important for the main plot.\r\nA LOT clichés for fantasy-supernaturalanime world has been used, not many explanations that I wanted and some that looked like a filler... Well I feel like vast part of this season was one big filler.\\n\r\nGetting to the point, I didn't notice much of the story development (possible spoiler here: show ends in like half of what it wanted to tell!), not much of the character development (well, it tries to tell us about one thing, it tells but then it repeats it over and over in next episodes).\\n\r\nAs long as the story is not doing its best, it can be still quite enjoyable.\\n\\n\r\nGetting to the art, I don't know if the previous season was similar, but I noticed quite a few scenes here and there that were literally boring which lead my attention to focus on the art and what I noticed was poverty... It's understandable to make some cuts on the less important moments or backgrounds, while focusing on the first plan, but... Literally when making some 'fill in' dialogue, scene is one and long frame, with almost none movement, probably they expected to cover it with some nudity.\\n\r\nI would say that it's fair most of the time with some really awful moments.\\n\\n\r\nI'm not really good with rating sounds, so I'm gonna say that it's avarage with some good tracks and openings.\\n\\n\r\nCharacter development feels poor, focusing on few and neglecting all the rest, not much to say without a spoilers, but I didn't learn many new things about most of the cast.  Good example of decent character introduction, but poor development (that was present all the time) is Escanor - such potential, mysterious and undiscovered character has been revealed with flat backstory, well, atleast his behaviour was interesting, but not much time was invested in that.\\n\\n\r\nComing to the end, show is fine, enjoyable but it got noticable flaws, that make it taste like an undercooked pork.",
            "date": "2018-06-30T18:47:00+00:00",
            "helpful_count": 36,
            "mal_id": 282653,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488037.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Yellow_INC",
                "username": "Yellow_INC"
            },
            "url": "https://myanimelist.net/reviews.php?id=282653"
        },
        {
            "content": "First impressions of Nanatsu no Taizai: Imashime no Fukkatsu\r\nWith much delay, I finally conclude the first impressions of Nanatsu no Taizai: Imashime no Fukkatsu, a series that I am following this winter season, which is already quite advanced.\r\nNanatsu no Taizai: Imashime no Fukkatsu or \"The Resurrection of the Commandments\" is the sequel to the anime based on the original Nakaba Suzuki manga set in medieval Britain and partly inspired by the Legend of King Arthur. And I say partially, because although Arthur Pendragon is part of the story, those who have read the manga or watched the anime, know that he is not the protagonist... despite the recent events of the manga.\\n\\n\r\nUnfortunately I did not do a review of Nanatsu no Taizai at the time, but it is worth saying that despite its fanservice and its apparent superficiality, I consider it a good Shonen of Battles. Its protagonist Meliodas is of the type of characters that from the beginning is too powerful, but what makes him interesting is his personality. Although he appears to be a relaxed and somewhat perverted guy, in fact he is much deeper. His past is a great mystery in the first season, as well as the origin of his power and everything is to be revealed in this new series.\\n\\n\r\nThat said, although the anime was entertaining, its production values ​​were not really high. The animation was not particularly bright and the adaptation is correct, without even matching the overall quality of the manga. However, just like the manga, in its second half, this first series improved a lot in its rhythm and ended quite epically. At the time of closing that season we already knew 6 of the 7 Capital Sins. Meliodas the Sin of Anger, Diane the Sin of Envy, Ban the Sin of Greed, King the Sin of Sloth, Gowther the Sin of Lust and finally Merlin, the Sin of Gluttony.\\n\\n\r\nWe have one to know, and boy do I want to see that. But let's move on to the important thing.\\n\\n\r\nHow is Nanatsu no Taizai: Imashime no Fukkatsu?\\n\\n\\n\r\nIf you are a lover of the Shonen of Battles, this series is a mandatory stop. Having seen the first episodes, I must say that the series continues to be quite common in terms of its technical quality. It is not a series that surprised by its animation. However, its quality remains fairly consistent with respect to last season.\\n\\n\r\nTakeshi Furuta replaces Tensai Okumura and Tomokazu Tokoro as director for A-1 Pictures. Takao Yoshioka takes on the job of adapting the original Suzuki script. Keigo Sasaki continues on board in the character design, and fortunately, Hiroyuki Sawano is still involved with the soundtrack, along with Takafumi Wada. Kohta Yamamoto also joins them.\\n\\n\r\nThe first episode picks up where it left us, Signs of a Holy War, the four-episode special that followed the original television anime. Princess Elizabeth of Liones has a dream in which she sees Meliodas face some shadows, but everything seems to go in peace. There is a ceremony where the Seven Sins are decorated, or at least the 4 that are present (Ban and King left before the ceremony). It is there where we get introduced to a new element in the anime that will be very familiar to fans of Dragon Ball: the power levels.\\n\\n\r\nYes, Nanatsu no Taizai has power measurements. The system is simple, each character has a number of power that is extracted from the sum of the magical power, physical power and spirit or will power. Hawk will be in charge of giving us those numbers so that we have clear who is who in this world.\\n\\n\r\nThe purpose of this is simple from the plot point of view: it is to put fear in the body. Basically, this was the simplest way Nakaba Suzuki found to help us establish a hierarchy, now that the Ten Commandments are the new threat.\\n\\n\r\nIn any case, both in the manga and in the anime there is a certain coherence with this theme and the inevitable powerups of the protagonists are justified. In some cases because in fact his real power was greater than that known until now and in others with training, as usual.\\n\\n\r\nFinally, a detail. The opening, a collaboration between FLOW and GRANRODEO titled Howling, is in fact quite disappointing. Considering the previous work of both groups, the only thing that could be expected was a historical opening and in fact it left me quite cold. It's not a bad song, do not get me wrong, but it could have been better. In addition, the video does not favor it, too mediocre and unimaginative. It is a pity.",
            "date": "2018-03-08T14:33:00+00:00",
            "helpful_count": 35,
            "mal_id": 273359,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6887246.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/CanAKATheIndigo",
                "username": "CanAKATheIndigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=273359"
        },
        {
            "content": "There aren't great many things that make Nanatsu no Taizai a good anime or even worth of watching. There still are some, and I have personally been able to enjoy this season --or at least most of it-- better than I ever thought was possible.\r\nThe main characters are not among these reasons. Our mc is pretty much the most boring and uninteresting shonen lead there has ever been. On the other hand, he is also so bland and empty character that he isn't very annoying either. Outside the fact that he is voiced by the same guy who did the main lead in Guilty Crownwhich is always a minus. Elizabeth brings exactly as much to this series as Orihime did to Bleach. Pretty much all the rest are so forgettable that I had to spend 30 minutes reading FAQ's before even starting this season just to get some sort of recollection of who is who... only to see that it literally does not matter if you don't know who anyone is. Practically anyone can be criticized with more words than they can be praised with. The series is amazing like that. \\n\\n\r\nThe story certainly does not make this series worth of a watch for anyone. Or if it does, then I surely am not among these fellas who watch this series for its story. One could say the story makes it hard to enjoy even (especially during the 2nd half of this season), but it doesn't require all that much effort to look past most of its problems. If you have the tendency to pinpoint flaws and count how many times a series aimed for 13 years-old youngsters chooses the most obvious outcome, then this show most likely is not for you no matter what I will say few paragraphs after this one. Smart choices have still been made here in terms of writing. For one, the series doesn't constantly rely on powerups, asspulls nor friends who come to save the day on the very last second. Even \"the best anime ever\", Fullmetal Alchemist Brotherhood, did this constantly. In fact, being a cliche shonen story, Nanatsu no Tanzai has abandon surprisingly many of the common cliches and tropes. Few of the romantic subplots and the heart-warming conclusions to drama are actually pretty well-written, and the show can be praised for how well it succeeds in terms of the given drama and past stories.\\n\\n\r\nThe art, sounds and overall production of this series are not the reason -- or even close to the reason -- why I considered this to be entertaining. In fact, the art is often eye-catchingly bad. Especially the character design on most of our main dudeouses seem to be the visual representations of their uninteresting personalities. The animated mouth movements seem the worse the more you pay attention to it. It's hard to unsee once you do. The OST is nonexistent, but during some of the drama moments, makes the series seem better than it is. Powerful, good songs right there. Otherwise the OST rarely serves the series, but on the other hand, it is fairly original and has practically no similarities with tracks commonly heard in FTS series. This is, at the very least, worth of noting. Now that all the reasons on why this show is not the best thing ever are over with, let's talk about why I was able to enjoy it: Let's talk about two amazing characters.\\n\\n\r\n\"Apologize to me that you were born into this world.\"\\n\\n\r\nThe not-even-a-bit-arrogant Escanor is the epitome of 3 things: badass, manly and bro. This fella is the manliest character I have seen in anime since the muscular, mute and shirtless Freddie Mercury seen in the anime 'Cromartie'. Escanor speaks, has manlier mustache and occasionally even wears a shirt. Are you part of the Armstrong cult from Full Metal Alchemist? I have good news for you: You are now part of the Escanor cult. Remember that guy from Saint Seiya who only ever trained his grip power? Running around in the forest, strangling bears to death. Frankly, that fella couldn't even shake Escanor's hand. Overall, Escanor is the most interesting character I have seen in shonen anime since Hisoka (Hunter x Hunter). Man so manly, he is able to carry pretty much any content with his personality. \\n\\n\r\n\"This must be the nest of humans.\"\\n\\n\r\nGalland is the other great character and also a real bro. Only cares about destruction, sees humans as parasites or insects. I admire this character. He does great job on creating the illusion that our main characters are in real danger and might as well die at any point. Without spoiling if this happens by his hands or not, he really does manage to convince me upon his introduction that this might as well be the faith of any character who is not protected by plot armor. The way he manages to corner our main characters is just really badass. It's surprising even to see how the author challenges his own writing skills by creating such hard-to-overcome situations around Galland. To put is simply: Galland is so merciless that if he had a role in Fairy Tail, I would still be convinced that he can actually kill someone of importance in it.\\n\\n\r\nAs a conclusion, these 2 characters make this season highly enjoyable. The former season + OVA are air to me, I never cared about this franchise until now. The 2nd season of Taizai does one thing right, it is this thing, and it does in a manner which I can give it credit for. Despite all the problems the show has, this season was still of high caliber for approximately 70% of the time.",
            "date": "2018-06-29T15:01:00+00:00",
            "helpful_count": 29,
            "mal_id": 282555,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=282555"
        },
        {
            "content": "This is a short and on point review about the second season of Nanatsu no Taizai.  A-1 Pictures adapted the source material as it did with the previous season but this time it did a good job regarding the characters. After finishing the first season nothing left a good impression, the story and characters become forgettable after some time .\r\nSeason 2 solves all the previous problems from the first season and focuses on the bonds between our characters, their past and how they eneded up as the 7 deadly sins making them memorable for our viewers. We also have a new sin Escanor whois probably imo the main reason to watch this season.\\n\\n\r\nAs you watched the ova series you know how Ban ended up being immortal , in addition to that season 2 shows his past as a child and the one who teached him how to be a thief and many more surprises who will bring  a litlle warmth to your hearth....We found out more about Melioda's lover more about his connection with the 10 Commandments and his bond with Elizabeth. Even the bad guys from season 1 get their reasons explained so they won't end up just as a tool for the 7 deadly sins to look cool after beating them. Long story short, less fights more worldbuilding and characterization which for I praise A-1 Pictures for sticking to the source material.\\n\\n\r\nThe story overall is not something outstanding it follows the usual shounen formula but what gives some substance and depth to this season are the characters ! Music is good as always the animation top notch(A-1 Pictures always invest tons of cash regarding that..) and enjoyment guaranted nothing more or nothing less from this genre.\\n\\n\r\nEnjoyment has always been a + factor for this anime and season 2 doesn't forget to entertain its audience with the character's humour side and fights. The skills are mostly explained and also in each fight their is a stake involved.. What brought new season 2 in comparasion to season 1 are the Ten Commandments who among them are some interesting characters who you cannot hate them despite being evil. \\n\\n\r\n In conclusion this season managed to make me experience a variety of emotions, managed to amaze me and entertain me to a certain point in each episode and finally it left a overall good impression after I finished it. I recommend it to those who are interested in this genre or for the usual Nanatsu no Tazai manga and anime fans.\\n\\n\\n\\n\\n\\n",
            "date": "2018-06-30T04:36:00+00:00",
            "helpful_count": 20,
            "mal_id": 282588,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=282588"
        },
        {
            "content": "Well, in my review of the first season I said that 4 was a lot for Nanatsu in Taizai, so I want to explain why 2 for this season.\r\nWell, I'll be more direct, the only good thing anime nese are the character traits and designs, that's it, nothing else.\r\nHistory: unlike the first that tries to develop something, here there is nothing to be developed, basically the villains appear at the beginning, and stay like this until the last episode, nothing walks, no character is deepened, some even have their moments, and no, the Meliodas does not have a significant deepening, it is simply a flashbackplayed and only. The story is VERY badly adapted from the manga, with a HORRIBLE, confusing ending, and that explains nothing, apart from a cut from one scene to another without any explanation, the lack of cohesion here is absurd.\\n\r\nCharacters: Ruins, but very bad, basically the minor characters are not important, and the curious, they go to a place to train, and guess what? No use, power goes from 1000 to 1050, something ridiculous, basically their existence has no meaning and value in the work, and worst, the work tries to force the contrary.\\n\r\nThe characters are hardly in depth, they are useless, they only serve to give spotlight to the principals. And one of the worst things, is to force a character to lose to generate hype on the villain, something disgusting and poor. The villains? Terrible, none of them has been deepened in AN ENTIRE SEASON, they are completely shallow and empty.\\n\r\nThe soundtrack here is disappointing, compared to the first one, it's bad.\\n\r\nEnvironmentalism remains childish and silly.\\n\r\nBad and predictable script, no passing excitement, the protagonist remains almost the same throughout the season.\\n\r\nNeither the fights lend, are cut and fast, without any emotion. Not to mention the animation that fell a lot!\\n\r\nNanatsu is an anime that would not recommend to anyone with critical sense, an anime with Netflix syndrome, that only makes success because of this, an annoying and annoying base fan, composed mostly by adolescents and children.\\n\r\nA horrible anime!",
            "date": "2019-03-04T20:37:00+00:00",
            "helpful_count": 13,
            "mal_id": 302923,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7434388.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 7,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/KevynCosta",
                "username": "KevynCosta"
            },
            "url": "https://myanimelist.net/reviews.php?id=302923"
        },
        {
            "content": "Very slight spoilers, Not really revealing anything.\r\nThe first couple episodes of season two just pulled me right in.\r\nThis is the best seven deadly sins to date. Everything which is happening are thing I never saw coming.\r\nI like that, I really like that. Thats the one thing which probably keeps me super interested, is the fact that I really don't know whats going to happen next.\r\nSome animes you just know. The MC's too strong he just destroys all without hitch (irregular at magic high)\r\nIn this one, the mc's been out matched, out matched in the previous sin as well.\r\nHes strong, but he's not strong enough tobeat everyone by himself. \\n\\n\r\nThe other characters aren't slacking either. King, Diane, Ban, Gowther, Hawk-chan, Elizabeth, merlin, and others they all build their characters through the episodes. It's awesome progression\\n\\n\r\nEspecially hawk chan after the training. That was funny as hell. I almost couldn't stop laughing.\\n\\n\r\nThis is my favorite anime atm. I think others should watch Seven deadly sins from the start if they haven't already.\\n\\n\r\nReally epic series. I'm far more impressed with season two tho.\\n\\n\\n\\n",
            "date": "2018-04-29T15:22:00+00:00",
            "helpful_count": 12,
            "mal_id": 279351,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6350392.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Swaheelee",
                "username": "Swaheelee"
            },
            "url": "https://myanimelist.net/reviews.php?id=279351"
        },
        {
            "content": "The devolution of Seven Deadly Sins into a garb-trash shounen anime.\r\nStory: The story is stupid. Main sexual assault victim Elizabeth dreams that something is going to happen as well as her father, and neither of them speak up, and the world goes down the shitter with the plot because two idiots who clearly knew something was up said \"oh it's nothing\". Jeez where have I seen that one before.\r\nArt:The art is the same as S1 as far as i'm concerned. Nothing special.\r\nSound: The sound is also pretty much the same. I still want to drag my balls across a sea of broken glass whenever Elizabethspeaks. Intro is- ha, you know you're gonna skip it anyways.\\n\\n\r\nCharacter: More of people who clearly dig each other not telling one another because (no reason).\\n\\n\r\nEnjoyment: I only enjoy this because the last season was serviceable and I'm eventually gonna see Meliodas at his supposed full-power (which is now numerical because this show is going down the shounen-shitter).\\n\\n\r\nFrowny face to studio A-1 for ruining another potentially good thing :(",
            "date": "2018-03-18T18:54:00+00:00",
            "helpful_count": 10,
            "mal_id": 274240,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6343223.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/NaMYAYA",
                "username": "NaMYAYA"
            },
            "url": "https://myanimelist.net/reviews.php?id=274240"
        },
        {
            "content": "Edit: I changed my scoring system around a lot and the scores in this review were not really up to date, so I tried adapt them (indicated with *new*) and changed my 'overall' part.\r\nNote: This is my first review on here and I basically just wrote it because I was bored and thought I might just give it a go (I'm kind of venting here so be ready for that).\r\nWell then, Nanatsu no Taizai 2nd Season (I'll just call it that). Tbh I don't really remember 100% how I felt during the first season of this show but this second season seems to be waymore of a letdown to me. But let's go through the points:\\n\\n\r\nStory: 5 (*new*: 3) - The whole medieval-magical setting with a group of special, strong warriors (The seven deadly sins) fighting evil threats (demons) sounds rather interesting to me, and having those warriors fight a group of special, strong demons (the ten commandments) in an ultimate fight of good vs evil is a pretty cool base concept for a battle shounen.\\n\r\nThe problem, however, lies not in the premise but the execution: The clash of those two groups is the main focus of the show and of course you can not just have them start fighting from the very beginning, but the way their fight is delayed seems extremely tedious: annoying sub-plots (one character loses her memory for the 50th time, the characters have to train in a cave for like a day or so, another character runs off to visit his dead girlfriend etc.) are thrown in to keep the main characters from actually figthing the big bad evil guys while said evil guys sit around and do nothing (because they conveniently have to replenish their energy). Together with some uninteresting characters that get introduced (the kings brother or whoever that guy was and his whole squad, Dianes 'senpai' etc) this seems to ruin the whole flow and pacing of the show. The build-up of for the final clash does not feel like a  build-up, just one little sup plot happens after another, and then, boom, now we fight the bad guys because we just ran into them.\\n\r\nSpeaking of that fight, pretty much the whole cast except maybe two people are utterly useless in that figth: Very early on it gets clear (thanks to some super lame power scale mechanic) that the commandments are way stronger than every character on the good side with the exception of Meliodas who just gets stronger and stronger leaving all his buddys behind as some useless exposition dummys.\\n\r\nThe show also has some pretty lame twists in it that were only shocking because of how dumb they seemed (Not trying to spoil anything but keyword Hendrickson for example).\\n\r\nThe writing in general seems actually quite horrible in some parts... I mean I don't expect a battle shounen to have a super complex, deeply thought out plot structure and what not but this show has some moments where I was actually getting furious as to how badly they were written (the mentioned stupid twists, characters coming back when they should be dead, the power levels escalating way too quick, stupid new abilities getting introduced out of nowhere etc...).\\n\\n\r\nArt: 4 - Just not a big fan of the artstyle (especially the faces and clothing) but it's not necessarily ugly I guess. Animation is nothing special and seems lacking in some parts but more or less watchable.\\n\\n\r\nSound: 6 - Does not really stand out to me which does not mean it's bad, it's just nothing special either. \\n\\n\r\nChracters: 4 (*new*: 2) - Together with the writing probably the worst part of this show (also the part where my opinions influences my enjoyment of the show the most): I just don't like the characters. Like allready mentioned pretty much everyone aside from Meliodas is super weak compared to the commandments which does not help make these one dimensional, bland characters interesting in any way. A couple of examples: Elizabeth is just there to be sexually assaulted and whine all the time, King's dialogue seems to have \"Diane\" in every line, Diane herself does nothing except for... no actually nothing. Arthur, Gilthunder and the other Knights pretty much do the same as Diane and seem to only serve the purpose of showing us how strong the demons (and Meliodas) are. And the worst is probably Meliodas himself, getting stronger everytime the plot needs him to and being a goofy molester all the time (well mostly) when he is not in battle. On the other hand, the commandments do not seem to have any real depth or motivation to them other than \"we are evil because we are the evil ones\" but since that might get covered in the future I'll let that slide for now. (EDIT: being on episode 23 now, I'm not really optimistic about that)\\n\r\nEscanor and Ban are two characters I actually like but they are also not really well written in my opinion. \\n\r\nAnd also what's with all the backstorys (Diane, King, Ban, Meliodas, Escanor, Elizabeth...)? I mean backstorys are fine and all but that many? For pretty much every important character? Is ist not possible to characterize them without the need of a backstory?\\n\\n\r\nEnjoyment: 4 (*new*: 3) - In conclusion I don't find this show very entertaining, there were episodes where I was seriously questioning the authors writing abilities and I thought about dropping it multiple times. While the premise is interesting the characters and the writing are terrible and the animation is mostly mediocre. I don't want to be your typical Hero Academia d*ck rider but seeing the two shows airing together, thus comparing them, makes Nanatsu no Taizai look even worse.\\n\\n\r\nOverall: 3 - Because of the reasons listed above I scored this show a 3 out of 10 which indicates a 'very bad' or 'poor' show. \\n\\n\\n\r\nLike I said this review was created on a whim and out of boredom, I pretty much just wrote this down for me but if anyone finds this angry wall of text helpfull that'd be cool too I guess.",
            "date": "2018-06-20T08:07:00+00:00",
            "helpful_count": 7,
            "mal_id": 281654,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5617750.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GreeenSponge",
                "username": "GreeenSponge"
            },
            "url": "https://myanimelist.net/reviews.php?id=281654"
        },
        {
            "content": "This review contains what some would consider to be spoilers.\r\nNothing listed here will 'ruin' the show for you.\r\nOpening thoughts. \r\nThe second season of The Seven Deadly Sins Revival of the 10 Commandments was not only hard to watch but felt like a literal job to finish. The show itself is extremely lackluster in comparison to it’s predecessor and expands little to no character development regarding known characters. When it does it feels misplaced and is used to expand a segment of the show for Deus ex machina moment(s) that don’t effect the plot but rather finish a segment that needed more development in the firstplace.\\n\\n\r\nThe sequel itself suffers from two key elements: bad writing, and bad villains. The title ‘Revival Of The 10 Commandments’ (and the opening) suggest a full out war between the two parties. This notion had me hooked, as I thought personally that the original was well done but didn’t finish correctly. I’m already digressing, however it must be said, the original did not include all seven of the cast members. When your title hosts such a statement you should uphold it, season two shares this flaw. \\n\\n\\n\\n\r\nThe writing is atrocious, the story-line is obscenely passive and the plot moves at a snail-speed. (On your drive to work tomorrow insult the car in front of you which hosts the old lady doing 20 in a 60 zone the 10 Commandments.) These villains sit around for 10 plus episodes doing gobshite. ‘Collecting their power, powering up’, right. I came here for an all out war between some heroes and some anti-heroes and what did I get? Drivel. Absolute unadulterated drivel. The first 10 episodes or so had full advantage to take us away into the minds of these bad-guys. Instead we got childish banter between them, they’ve been sealed away for how long…? Why don’t they just go rip **** up? Oh right, bad writing. This need to stick to source material has killed these characters as anti-heroes. They're buffoons. \\n\r\nSpeaking of bad writing when the 10 Commandments finally decide to take action they don’t act as a unit. Galand takes off in pursuit of our heroes without a second thought, and later with with Melascula. The others just sit around presumably smoking weed, because goddamn, are they lazy. What are they waiting for? It’s almost like they themselves know they’re in a badly written anime. The villains are stupid and carry no real motive for their actions. It is always, always, either a two-on-one or a one-on-one fight, (with the exception of Meliodas being bamboozled by the all the surviving Commandments at once, [however you can’t really call that a fight]). These villains had time to develop, but in the end they were just throw away disposable garbage for our shounen hero to destroy. What a waste of effort.\\n\\n\\n\r\nAnother issue I had was the introduction to ‘power scaling’. It did not need to be introduced. It is about as useless as Diane losing her memory. Plot devices that serve no purpose are not welcome to any viewer. The apologist may cackle: “They had to introduce power scaling because of Escanor and his 500,000 power-level, noon, etc\". Rubbing salt in the wound here, Escanor is an amazing character and shows 10-fold (pun intended) the character development in his short time on screen. I would rather have a standalone show about him than this little smug asshole who fondles breasts and meets every shounen main character stereotype.\\n\\n\\n\r\nThe problem with Meliodas and Elisabeth’s relationship is that it’s creepy. I shouldn’t have the explain this. It’s shown later in the show that Elisabeth was ‘uncled’ by Meliodas as a young toddler after he had saved her from disaster. In this episode we get a flashback of Meliodas being very big-brother-like to Elisabeth. Just before Monspeet and Derieri’s attack he wakes from his slumber, which is explained “he can’t die” after he died… and saw his father the Demon King… and they were going to fight… Yea what the *** happened there…\\n\r\nCalling it a memory just makes it worse.\\n\r\nAnyway this a shounen so stop asking questions that need actual logical answers.  \\n\\n\\n\r\nBefore Monspeet and Derieri’s attack he fondles the living **** out of Elisabeth. Now I’m wondering, did he do this to her when she was young too? That’s sort of distressing and puts me off his character more than before. I cannot take his character seriously now, not like I could before.\\n\r\nExpanding on the fight with Monspeet and Derieri, these characters were wasted. I’m seeing this happen a lot in season two. These terribly written villains get two fights and they’re killed. No expansion, no motive, no purpose. It is a justified time for our hero to just ‘full counter’ their attack back at them killing them instantly.\\n\r\nThese two had chemistry and it was never shown beyond the surface, it really pissed me off. It really pissed me off that shorty-sex-offender just came back from the ‘dead’ and made mincemeat out of some villains that deserved so much more attention.\\n\\n\r\n I’m giving Nanatsu no Taizai: Imashime no Fukkatsu a 6.2/10 for:\\n\\n\r\nBad writing.\\n\r\nHorrible plot devices that leave more questions than answers.\\n\r\nA terrible anti-hero cast of villains who should’ve been schooled by the Phantom Troupe.\\n\r\nMerlin and her standalone Dues ex Machina reveal near the end of the season.\\n\r\nSome sequels just shouldn’t exist, this is one of them.",
            "date": "2018-12-29T02:14:00+00:00",
            "helpful_count": 6,
            "mal_id": 297292,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5283499.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Meew2",
                "username": "Meew2"
            },
            "url": "https://myanimelist.net/reviews.php?id=297292"
        },
        {
            "content": "This is the best anime I watched so far, and probably that I'm going to.\r\nNot that I'm going to die anytime soon or something, but the past is obliterating. Especially the past and the characters, though I think it's not presented in the way it deserves.\r\nLet me clear some points:\r\nThe story is not SHALLOW: Not at all, not even 1%. You might think so if you watching the anime on a hurry just to put a check mark, but if you pay the slightest attention, you'd fall deep into the story. A little bit is presented about the characters, or even 3000 years ago andthe anime provided no hints about it. Personally I think the anime tells just a brief bit of the story and is going terribly fast without explaining the motives sometimes, this makes me think hard about the story and what might the characters be experiencing, especially those who lived 3000+ years, and it's frustrating, but deeeeeeep.\\n\\n\r\nEach character has a really meaningful story behind them, that is almost entirely shadowed, and they don't seem to tell the story from their expression, which is kinda absurd but deeep, what makes them do that ?\\n\\n\r\nPowers are O.K., I actually like the system, but they don't serve a major part of the story. I like the fact that each clan has something special, and how humans attainted significant powers, like godess clan level by making weapons. It's not free, Arthur sword took thousands of years to forge and is actually unique to humans. If you come from a hardcore fighting anime background like DBZ or only watch naruto fights, you might not like the anime right away.\\n\\n\r\nTHERE IS NO FAN-SERVICE, the only instance of this is Meliodas, which is the protagonist, X Elizabeth. And this itself has a story behind it in the manga, as Elizabeth is the .... doing let me spoil. We've actually seen him reject doing that to other ladies. Actually the whole sexuality shit is absent in the anime which is kinda cool. But, we've seen many characters yearning for their deceased loved ones.\\n\\n\r\nThis is the anime to watch.",
            "date": "2018-03-26T00:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 275115,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Bittercities",
                "username": "Bittercities"
            },
            "url": "https://myanimelist.net/reviews.php?id=275115"
        },
        {
            "content": "Nanatsu No Taizai S2 is a direct sequel to S1 so please watch S1 first.\r\nIn season 2, following the celebration of peace in Britiana, the member of the Seven Deadly Sins are awarded medals for protecting the country.\r\nIn this season, it shows Ban the Sin of greed 'betraying' his team to revive a girl whom he loves. He left the team following which King the Sin of sloth followed him to visit the place where Ban's love's body is. Ironically, the girl is King's sister (revealed in S1).\r\nWith their leave, Meliodas senses a great danger approaching and that is the revival/ release of the TenCommandments, said to be the strongest of the Demon Realm, each wielding as much power as Meliodas.\\n\\n\r\nThe story continues as Meliodas's team has to fight the Ten Commandments while Ban tries to revive his beloved.\\n\\n\r\nIt is also said that the final missing member of the team, Eskanor the sin of pride will be coming into this season and I look forward to that.\\n\\n\r\nSo far, up till episode 5, the anime is developing without a hitch and I hope this can continue.\\n\\n\r\nNanatsu No Taizai is probably one of the funniest, most entertaining Shonen anime so far. I'm open to hearing suggestions for other anime.\\n\\n\r\nSound 10/10\\n\\n\r\nI very much enjoy the new OP and the soundtracks used are not repeated from the previous season so that's good.\\n\\n\r\nArt 10/10\\n\\n\r\nFollowing my review in season 1, the art is made by A-1 Pictures. It's only normal that it gets a 10/10\\n\\n\r\nOverall \\n\\n\r\nStill watching, I just have to say something about the bad reviews which I feel are abit too harsh",
            "date": "2018-03-15T22:46:00+00:00",
            "helpful_count": 7,
            "mal_id": 273936,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6221320.jpg",
                "scores": {
                    "animation": 10,
                    "character": 0,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DoomRanger",
                "username": "DoomRanger"
            },
            "url": "https://myanimelist.net/reviews.php?id=273936"
        },
        {
            "content": "Great show, sure it may have flaws if you look at it critically but i just binge watched it and couldn't stop for a break. In short, it was really enjoyable, and isn't that the most important part of watching a show? This is my first review so sorry if i suck at this but i'll try my best. I will try to keep my first review as short as possible.\r\nStory - 8/10\r\nThe story is not perfect, but good enough to where you can enjoy it and follow along. The different clans, and how they had a war 3000 years ago is pretty interesting. Itsa pretty simple story in this season where the 10 Commandments are free from their seal as it was broken and now the seven deadly sins have to stop them from starting another war. All while having different small sub-plots in between. The story was executed pretty smoothly although it was a bit slow at the start of the season and fairly rushed with a lot of pacing issues near the end. Thankfully the middle of the episodes made up for it with how great they were.\\n\\n\r\nArt - 8/10\\n\\n\r\nThe art was great with a lot of cool fight scenes that had good movements and great animation. The animation was solid up until the 21st episode, i feel like they spent their whole budget on this one particular fight that looked amazing. After this episode things got really bad to be honest, quite poor animation and most of the fights looked average at best.\\n\\n\r\nSound - 10/10\\n\\n\r\nI've listened to the original soundtrack a billion times, its great. Not only that, but the soundtrack for certain characters is really good too. Oh, and during the fight scenes, the soundtracks played were perfect and went so well with the fights.\\n\\n\r\nCharacter - 9/10\\n\\n\r\n I enjoyed almost all of the characters they all have interesting backstories and different personalities. We all know how annoying and useless Elizabeth is, but that doesn't mean that all the characters are bad. All of the seven deadly sins have their own backstory with some of them being really deep and sad, like the main character, Meliodis. \\n\\n\r\nEnjoyment - 10/10\\n\\n\r\nI haven't enjoyed a show this much in a while. When i started watching the first season was already complete and the second season had 3 more episodes left so i didn't have to go through the trouble of waiting once a week for an episode. I caught up to the anime in about 3 days which means i watched 45 episodes in that time frame. That should show you how much I enjoyed this show.\\n\\n\r\nOverall - 9/10\\n\\n\r\nSeason 2 of this show is really good, and although i personally think season 1 was better overall in terms of pacing and story, this season was much better if we are looking at epic moments/character introductions and higher stakes on the line. And of course if you take your time and look at this show critically you will find some flaws, which is why some people might rate it lower. I believe the pros out way the cons in this show, but that's just my opinion. I like to just go by how much i personally enjoyed it and if you can see how fast i watched it, then you should be able to tell that i enjoyed the hell out of it.\\n",
            "date": "2018-07-10T05:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 283614,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Furqan",
                "username": "Furqan"
            },
            "url": "https://myanimelist.net/reviews.php?id=283614"
        },
        {
            "content": "I really loved the story and also everything was really new for me because I didn't read the manga so I gave it a 10/10. The Artwork was also amazing and was also anticipated because they spent a lot of money for the visuals so I decided to give it a 9/10. The sound was really amazing and always switched up my moods. The sad melodies especially the one during the conversation between Fraudrin and Griamore before he tried to commit suicide by making an explosion made me really feel the sadness and nostalgia so I gave it a 10/10. The character developments and thenew secrets that the anime shared with us was outstanding also a 10/10. I really enjoyed watching every single second of all 24 episodes of the second season of this anime and I'd also say it was better than the first season so I gave it a 10/10. Overall a perfect shonen anime that's the reason why I rated it with a 10.",
            "date": "2018-07-08T16:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 283445,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5154703.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ichigo-light",
                "username": "ichigo-light"
            },
            "url": "https://myanimelist.net/reviews.php?id=283445"
        },
        {
            "content": "This review might contain some spoilers, but I’ll try to keep it down.\r\nFirst of all, I can’t say I disliked this show. To be very honest: I bingewatched it and I enjoyed every single second of it (or almost every second). But, sometimes you shouldn’t judge a show by how much you enjoyed it. Sometimes, you have to have a critic view. And in my critic view, this show kinda really sucks.\r\nIn the second season of Nanatsu no Taizai, we meet some new villains for or hero's to defeat: The Ten Commandments from the demon clan. This is exactly where I stumble upon the firstmajor problem with this second season. The villains are absolutely shallow. There are bad because… well, they’re demon’s, I guess all demons are just evil. They have no motivation whatsoever and their personalities are just… evil. The only villain that manages to go trough a little character development in the season finale, is Fraudrin. (spoiler) He was prepared to wipe away his evil intentions, because he actually loved Griamore, the son of Dreyfus, whom Fraudrin possess for quite some years. For the rest, the villains just get revived and start killing people to be able to reign over the land again – because reigning over a land full of dead bodies is totally fun.\\n\\n\r\nThe second thing that really ruins this show (and this actually annoyed me a bit) is very lazy storytelling. If you need to give a character the power to see the ‘power level’ of others… then you’re just being a lazy ass storyteller. You don’t need to show us a number, show us exactly how dangerous these people are BY MAKING THEM FIGHT. The mangaka also made The Ten Commandments fight, so I don’t actually see the point in giving Hawk the gift to see power levels? Well, maybe that’s just me. That’s not the only part where the mangaka falls back into lazy storytelling. Having the character’s explain things, just weakens the plot. (spoiler) Like, for example, when Fraudrin literally says that he is a replacement, or when The Ten Commandments explain their powers… I mean, you don’t need to let the characters tell us that. We have eyes, we can see it.\\n\\n\r\nAnother thing about power: why are The Ten Commandments so crazy strong? I know that the MC’s need a challenge and all… But really, the difference in power is a little overboard. The only sins that could do something, were Meliodas (cause, duh, he’s the main character), Merlin (because (spoiler) she could totally not take on Galand, but Greyroad, who is supposed to be stronger, is no problem at all) and Escanor (but only when he’s not useless, like, every night, and (spoiler) off course The Ten Commandments attack at day, because why the hell would they wait ‘till night?). For the rest, all other characters were totally useless and I didn’t really get why they were even there.\\n\\n\r\nNow, let’s go on to the characters. The mangaka probably noticed that Meliodas was not quite a deep character, so (spoiler) he gets some dark power and a shady history as former leader of The Ten Commandments. Elizabeth still has no character at all. I mean, c’mon, we all know the only personality she has, is being nice, helping other people and being high over heels for Meliodas. She has no flaws at all, ‘cause why would a princes need any flaws? The mangaka then decided to (spoiler) make her the reincarnation of a person from Meliodas’ past, while the only thing they have in common, is their hairstyle. (spoiler) Gowther did get some depth, looking for emotion (like that has not been done a thousand times before). And poor Diane (also not the most complex character) (spoiler) lost her memories again. I’m not a fan of memory loss, so when it is done twice, it just breaks my heart. I do think Ban is a nicely developed character though. For the rest, King also only has one characteristic, that being his love for Diane. (spoiler) He maybe did get some development when he saved the fairies, even when they hated them, risking his own life in the process. And Escanor… well, he loves Merlin (because yeah, you can’t have a male and a female character that are not in love with each other).\\n\\n\r\nAnother thing with this shounen, just like any other popular shounen, is that the mangaka is just too afraid to let people die. I mean, the moment you become even a little important, there is absolutely zero chance that your life is in danger. You either find a way to win even against an opponent who is ten times stronger, or you come back to life, or you suddenly get some massive power (#Escanor, #Merlin). Or, not to forget, Elizabeth suddenly develops a healing gift. So, basically; no worries, MC’s aren’t going to die here. And even when they do, they just come back like in any other shounen. I don’t even feel sad when a MC ‘dies’ and I sure as hell don’t feel any danger when he/she has ‘a hard time’.\\n\\n\r\nBesides all of that, I can’t say one bad word about the music, sound or the art style of this show. The voice acting of Elizath and Diane annoyed me a bit, but maybe that’s just my opinion. \\n\\n\r\nConclusion: this anime is perfect if you just wanna sit down and just watch the nicely animated action without thinking too much. If you are looking for something different, of something new, something… let’s say… refreshing… this show isn’t really worth your time.",
            "date": "2018-07-06T03:34:00+00:00",
            "helpful_count": 6,
            "mal_id": 283109,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5030891.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/MayLynn",
                "username": "MayLynn"
            },
            "url": "https://myanimelist.net/reviews.php?id=283109"
        },
        {
            "content": "This season of Seven Deadly Sins was really a rollercoaster ride. The first half made me want to drop it but by the end I eneded up loving it almost as much as the first season.\r\nStory: Just like the previous season, its all over the place. The power rankings are just whatever is convenient for the show at the time. Nothing really means anything. Its even more messy than last time. Its supposed to be like this as this show isn't meant to be taken seriously and its a lot of fun. Just be prepared to scratch your head at least twice every episode.\r\nArt: Animationis very nice just like before. They work with a lot of cool darker tones and colours. Designs are all great, especially the new characters. No complaints at all.\\n\\n\r\nSound: I had watched it dubbed becasue idk I just prefered it. Sometimes the voice acting was cringey and off. Merlin's speech as quiet awkward at times. Sound affects were all very nice. Music was great, it fit the time and place and was still epic. The first theme song will probably be in my playlist!\\n\\n\r\nCharacters: They're all brilliant. I love most of them, especially Meliodas and Ban. This is what really kept me going and made me pick this anime back up.\\n\\n\r\nEnjoyment: At times you will ask yourself \"wtf am I watching\" but at others you'll be laughing and enjoying it loads! If you're ok with things not always making sense and not reading into greater meaning, you may wanna give this show a go. \\n\\n",
            "date": "2018-11-28T00:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 294853,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5104482.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Moyosore",
                "username": "Moyosore"
            },
            "url": "https://myanimelist.net/reviews.php?id=294853"
        }
    ],
    [
        {
            "content": "This is a spoiler free review for those contemplating whether or not to watch this series.\r\nNanatsu no Taizai: Imashime no Fukkatsu is the sequel season to Nanatsu no Taizai, so be sure to watch season one first.\r\nI quite enjoyed the first season, and the first half of this season started out strong.\r\nThe first half of the series had me feeling a score of 9 was coming on, mainly for two reasons - The character and plot development. It wasn't a rehash of season one, it was something unique. The first season was a good fantasy anime, but didn't quite have the depth to be outstanding.In this second season, we now see significant development and the inner struggles of our characters. There were a lot of flashback scenes, and we learn much more about the inner workings of our characters, which for me as a viewer causes me to enjoy and connect with them much more than S1.\\n\\n\r\nIn terms of plot, it started off a lot more epic than S1. The bad guys more powerful, our heroes on the back foot, the world in turmoil - it is just far more tense and interesting. The first season felt like they were always going to easily win - not so for this season.\\n\\n\r\nThe main issue with this series in the second half is the pulling in of convenient, unexplained abilities at just the right times out of plot convenience. Dues ex Machina galore. It got to a point where it was really quite frustrating, to the point where I have now scored it a 7. I don't trust that the writers won't throw in some absurd ability the hero just conveniently had hidden the whole time, ruining the sense of character development, consistency and world building. \\n\\n\r\nThe art again is the weakest part of the show and is on par with season one. It isn't bad, but it isn't great either. just average. The music is quite good, matches the show well without being outstanding - and it sports a great voice cast.\\n\\n\r\nThe most frequent criticism of this series is that it lacks some originality, and that this season goes further into cliche territory. I understand why some would say this, but I disagree. The main issue with the series is the plot conveniences I mentioned above. I agree that this show follows some typical conventions we have seen many times over (a magic world, a band of heroes, bad guys to battle, a small child-like hero etc).  However, I think the unique character relationships make this anime feel fresh. Almost every characters is bizarre, interesting with a unique back-story, most of which we haven't seen any parallels (King, Dianne and Ban for example all are unique and well developed - not rip offs from any other anime series). The only character I think is weak and cliche is Elizabeth, but they seem to be setting up some reveals for S3, so I'm lenient on that. \\n\\n\r\nSo you have watched season one, should you bother watching season two? \\n\\n\r\nWell, one thing to be aware of is this season goes further into Shounen territory, so your enjoyment of it may depend on how you like Shounen/battle/fantasy anime. It in some way takes on more of a Dragon Ball Z feel mixed with a show like Magi. Dragon Ball Z, because it introduces things like power levels, entire arcs revolving around training and powering up to defeat opponents; and Magi because of the band of thieves, magic and fantasy elements. Also as stated in the negative reviews, there is nothing groundbreaking or earth-shatteringly new about the path the show follows on a meta level, rather it is how the story progresses and the unique character relationships that set this anime apart. Again, if plot conveniences and inconsistent dues ex machina bother you, this series will really frustrate you. \\n\\n\r\nStarts very strong, ending is a bit meh - some great moments and some frustrating ones. Still enough for a 7, but certainly far from perfect. Should you watch it? Only if you are happy with overlooking a few things.\\n\\n\\n",
            "date": "2018-04-14T06:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 278036,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6648594.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeCAC",
                "username": "AnimeCAC"
            },
            "url": "https://myanimelist.net/reviews.php?id=278036"
        },
        {
            "content": "I was one of the folks who first got introduced to this show by bingeing the first season on netflix. And personally, I think this is a show that works far better in a binge setting than a traditional viewing experience. Mostly because I find myself slogging just to watch each week's new episode. I find myself often dreading it. Mostly because what usually keeps me going back to a series are things like intriguing plotlines, interesting villains, or good characters. \r\nSeven Deadly Sins, as a series, has nothing extraordinary about it. At all. Which is why digesting it all in one or two sittingsover the course of a bored weekend on netflix fits the show so perfectly. Its an empty, hollow experience that will leave you with some decent action setpieces, some fanservice (Okay, A LOT of fanservice), and little else. Personally I was very excited for the prospect of this season due to my personal obsession with arthurian lore. But instead of any intrigue about the political system and/or reinterpretation of this universe's camelot, we get what mostly boils down to what most non-erotic fanfiction is in terms of writing. With some of the worst parts of Dragonball Z thrown in for good measure. This includes, but is not limited to; Bullshit Power levels, Big bads becoming good guys and vice versa for (in the anime's logic) little reason other than they didnt think theyd get another season out of this last time around so they cut out A LOT of the story from the manga that would've made stuff make sense (or so i've been told), watching the side characters struggle like incompetents with the villain(s) until the main character shows up to beat some serious ass, and absurd amounts of exposition dumping. \\n\\n\r\nThis show is probably the best example of what not to do in regards to show dont tell that i've seen in quite a while, certainly this season at least (Winter 2018). I would only recommend this series if you have a case of alochols (or your preferred mind altering substance of choice), the entire series on netflix, and a three-day weekend with nothing and I mean NOTHING better to do on your hands. Otherwise  I'd suggest going to rewatch FMA: Brotherhood again. Its a far better execution of the european aesthetic in anime with a far more engaging story. \\n\\n\r\nAlso: Gowther is made into a huge prick this season for seemingly no other reason than to be a huge prick that doesnt know what it means to be human (i.e: Data from Star Trek, but a huge asshole) and everyone else is WAY too cool about it. Thats just weird.  \\n\\n\r\nTL;DR: This show is painful, either rip it off quickly like a band-aid or just skip it and save yourself the aneurysm. Art style is cool though. And Dat muzak. 6/10",
            "date": "2018-03-24T10:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 274811,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Alamojak",
                "username": "Alamojak"
            },
            "url": "https://myanimelist.net/reviews.php?id=274811"
        },
        {
            "content": "Update: I finally dropped it because I would rip my eyeballs out if I continued.\r\nSexual harassment is still not supposed to be okay, but this anime has it all. \r\nThe anime has a good plot, that's why I keep watching it. But really hate the fact that the long running forced gag of sexual harassment is still on display. Anime is a mistake, yet here I am, wanting to watch it til the end because there is actually a base plot, the usual good vs evil and all that jazz. \r\nI heave a really long sigh in disappointment with myself and the anime. The tropesare the same, but it makes you want to see it to its end because you need that validation when the \"good\" side wins, am I right? \\n\\n\\n",
            "date": "2018-03-14T01:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 273770,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4725326.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/elloelloangie",
                "username": "elloelloangie"
            },
            "url": "https://myanimelist.net/reviews.php?id=273770"
        },
        {
            "content": "Revival of the commandments was amazing in so many ways. World Building and Character developpment as well as some of the most epic fight scenes in recent anime really set this show for me as one of the best out of the series. One of my favorite things was that they introduced Power levels lime in Dragon ball z, except they were much more reasonable and they did the system way better then dragon ball z did. It wa salmost as if they turned RPGs into anime. And on top of all that, an amazing storyline and plenty of backstory, as well as a reallysad event that was enough to make me cry (no spoilers that would just be cruel). I'm super excited for season 3 and for the OVA that was released yesterday to get dubbed so that i may continue what Revival of the commandments didn't finish.",
            "date": "2018-11-15T14:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 294128,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7466789.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Chaosprince829",
                "username": "Chaosprince829"
            },
            "url": "https://myanimelist.net/reviews.php?id=294128"
        },
        {
            "content": "As a second season and direct continuation from the first season. Nanatsu no Taizai: Imashime no Fukkatsu brings one more time the great adventure in Medieval age about the knights and holy powers. The fights are great, we can see some good interventions from new characters, and the story start to get interesting about the great enemies that appeared. There are some other resemblance from other animes, and in most of fights I remembered some good old stuff from Bleach, the idea you get from the group Nanatsu no Taizai are the same as the Gotei13 and the 10 Commandments are the Hollows/Espadas (se samego for some charecters: for example, The Commandment of Truth, Galand, looks like the Espada number 5, Nnoitra).\\n\r\nThe story of the respective sin is well made, and got some good details. Anybody can fall in love with them if they want.\\n\\n\r\nOk, you have some cliché parts, but all animes have similarities from others. In the shounen universe, you will have same stories and the good guys will always win and the bad guys will lose with some moral lesson in the end. So what? The viewer needs to watch the serie and do some appreciation before they start criticizing.\\n\\n\r\nI would rewatch again in some time for sure.",
            "date": "2018-07-18T13:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 284271,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3996569.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/STEREOo",
                "username": "STEREOo"
            },
            "url": "https://myanimelist.net/reviews.php?id=284271"
        },
        {
            "content": "Now honestl, this will be the first time i'll ever write a review, but to me this anime was amazing i loved everything about it from characters to story it was hard to describe the experience it had given me, this season i think is a lot more story driven a bit more in depth into the story, the quality like most animes would get better, but this is exponential, okay sorry for getting too off topic. Story wise it was very deep as i said and gives you that sense of Excitement, in terms of Characters the way The Seventh Deadly sin was presentedwas just very unexpected honestly, and you know it might just be me cause i am just a big anime junkie i love all anime , you can take my words from this review or share your own opinion on this!",
            "date": "2018-07-09T09:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 283529,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5797057.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Draconic_Helper",
                "username": "Draconic_Helper"
            },
            "url": "https://myanimelist.net/reviews.php?id=283529"
        },
        {
            "content": "This season was fantastic! Now, I am a fan of the first season as well and this gives me more of the same goodness but at a much higher level than was presented before.\r\nI can talk about the art, sound and animation quality but this is not the strengths of the show. Yes, these aspects are solid and I never had a complaint about them, but they aren't the star of the show. \r\nWhere the show really shows it's strengths is with it's action scenes and story. Many character stories continue from the first season and very well presented. There are a few characters andtheir stories that I feel took a back seat this season, but they weren't my favorites in the first place so I don't care that much. In terms of the action scenes I won't talk much about them except say that they are amazing and they are one of the major reasons I give this season such a high ranking. \\n\\n\r\nI highly recommend this show to anyone who likes adventuring style shows with over the top action scenes. If you enjoyed the first season you will most likely really like this one too.",
            "date": "2018-07-01T03:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 282679,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7200397.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MichaelK1",
                "username": "MichaelK1"
            },
            "url": "https://myanimelist.net/reviews.php?id=282679"
        },
        {
            "content": "Rushed feeling.\r\nI'm massively disappointed in the anime adaptation of this story... which is weird for me to say because I don't normally read manga, nor am I any kind of source material elitist.\r\nThe story as it was presented in the majority of the first season was good enough for me to jump ship to the manga and follow from there. \r\nThe first season made some decisions about the plot to consolidate the story in a way to better translate it to the seasonal/episodic nature of a anime, which worked greatly in it's favor for adapting the first major arc of the story, but ends updamaging the impacts of the rest of the story in order to maintain that same momentum. \\n\\n\r\nAlot of the heavy impact scenes were brushed over and large chunks of peripheral dialogue, context, and characterization was just cut out. Especially towards the last 4 episodes.\\n\\n\r\nWhile hitting on a totally different feel, set of emotions, and ideology, the over arching story has the potential to match something as great as Boku no Hero Academia if not exceed it in some aspects in the shonen genre, but it's anime adaptation dropped the ball in several key points.\\n\\n\r\nOverall, this adaptation didn't add much to the source material, in fact it several ways it took away from it.",
            "date": "2018-08-20T10:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 286969,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4163027.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jyiber",
                "username": "Jyiber"
            },
            "url": "https://myanimelist.net/reviews.php?id=286969"
        },
        {
            "content": "Say you enjoyed the first season of 7 Deadly Sins and thought, well it's pretty good but there's not enough fighting, and the characters just aren't strong enough\r\nWell have no fear because season 2 is here, and they have basically gone lets just make everything even more ridiculous\r\nThe grey demons which we all thought were a big deal not too long ago, are just wimpy little pawns to our new bad guys\r\nAnd as a result, of course Meliodas and the sins power up in kind\r\nLeading to some outrageous fight scenes, which I have to say left me pretty stunned\r\nSome-what sadly the story has followed thistrend of ridiculousness. Don't get me wrong i absolutely loved it, but even I laughed a couple times especially at the beginning when they were introducing the characters and villians of the season (you will see when you start watching)\\n\r\nOh and Diane's dance lessons........ I'm not even going to try and understand why they thought that while every one else is training to fight the super powerful demon gods we will have Diane take dance class........\\n\r\nBy around Episode 12 the story does start to come together a little and from then on it is just a roller coaster ride of excitement, with a mix of edge of your seat battles where your genuinely not sure who could win and fights that are over in a single mind shattering slice of a blade\\n\\n\r\nDespite a few disagreements I have with how they approached the story I think the positives of the season in general greatly outweigh the negatives\\n\r\nAnd I think the main point should be, so what if the story is a little crazy, I never watched the 1st season of 7DS for complex end well thought out story line. No, I watched it so some slick fight scenes whilst getting all emotional as Hiroyuki Sawano (the composer for 7DS, AOT, Guilty Crown Kill La Kill) serenades me with his classical music\\n\\n\r\nOverall I would highly recommend watching this, as although it may no be a beautifully written masterpiece i haven't enjoyed an anime as much as this in a while, but if you weren't sure about the 1st season because you already thought it was a bit silly, then might not enjoy this one\\n",
            "date": "2018-07-01T01:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 282673,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6040736.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ArmouredGorilla",
                "username": "ArmouredGorilla"
            },
            "url": "https://myanimelist.net/reviews.php?id=282673"
        },
        {
            "content": "INTRODUCTION:\r\nThe Seven Deadly Sins: Revival of the Commandments (a.k.a. Season 2) continues the story of Meliodas and his crew, set in an alternate, fantastic version of Britain. Full of magic users and different races, the show follows the typical medieval-inspired setting after a major clash at the end of the previous season.\r\nPLOT:\r\nAfter dealing with a major threat, another one emerges in the island of Britannia. As the subtitle suggests, The Ten Commandments, absurdly powerful demons with special curses, emerge after three thousand years of confinement and are set to conquer the entirety of the island. The plot follows the struggles of mankind against these terrifying,beastly and unholy beings, and all hope rests on The Seven Deadly Sins and their equally abusive powers. The plot itself is promising, creates expectations upon the viewer and makes us want to know more about the demons, how our protagonists will handle them and what is the scope of their destructive powers. The major plot is not something new, though it does feel interesting - some parts are really good and well-done, and deserve praise.\\n\\n\r\nWith that said, it can be added that this season had major problems.\\n\\n\r\nFirst of all, the new villains are introduced rather early, which is a good thing - unfortunately, it takes a long time for them to actually *do* anything. Rather, the first half of the season is focused on uninteresting subplots which unnecessarely take way too much screen time. I was actually considering dropping the show a third into it, though I decided to continue watching due to the major plot being attracting and for respect of the first season. That leads us to pacing problems - it starts way too slow, nothing major happens for a long time and then the climax suddenly happens, two thirds into it, only to cool down at the final episodes.\\n\\n\r\nAnother flaw is the ammount of characters that I simply couldn't care about. That is a recurrent problem from season 1 - I have never found Gilthunder, Griamore and their kind amusing; King, Diane and Gowther continued being annoying despite some minor development here and there; most of the Commandments felt pretty bland, without much screen time. Despite that, Meliodas had some fine, although small development, as well as Elizabeth and Ban. Hawk remained exactly what he was - which is a good thing, as I enjoy his nonsense humor from time to time.\\n\\n\r\nAn annoying \"feature\" I simply despised was the addition of \"numeric power\", similar to what the Sayans have in the Dragon Ball universe. \"Look, Meliodas has a power of 32xx, Merlin has a power of 34xx, Ban has 31xx\" (or whatever their powers actually are) is just a terrible way to measure and compare different character's strength and powers. It also shows the insane power creep that happens in just 24 episodes, which makes most of the characters irrelevant in a fight. There are some terrible Deus Ex Machina moments throughout the season as well.\\n\\n\r\nRegarding the art and the sound department, they are simply \"ok\" for me - nothing special about them, though nothing blatantly flawed as well. Fan service keeps being thrown at us at each second episode, similar to the first season. Some of the soundtrack does invoke the feeling of medieval fantasy, which is a plus for a show like this.\\n\\n\\n\r\nCONCLUSION:\\n\\n\r\nOverall, The Seven Deadly Sins: Revival of the Commandments is a bad sequel to the original season. It feels like the whole 24 episodes could be summarized to 15, perhaps even to 12 episodes. When I finished the last episode I was left with a feeling that almost nothing had happened throughout the entire season. There's a huge number of subplots that need to be finished - some important, some not as much. If a third season is approved, I'll be watching it, though I won't be expecting much of it.",
            "date": "2019-05-04T18:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 307805,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7985241.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Pike27",
                "username": "Pike27"
            },
            "url": "https://myanimelist.net/reviews.php?id=307805"
        },
        {
            "content": "Dear A-1 Pictures, please FIRE THOSE CRACK SMOKING WRITERS WHO DON'T KNOW HOW TO WRITE \r\nHire me instead, because even I could do a better job than those stupid morons.\r\nIt is very hard for me to admit that this season was crappy. Doesn't mean I'm gonna stop watching it, because I love Jerico and Ban together, but A-1 really screwed this season up. \r\nThere were parts completely unnecessary that took place from the actually important stuff. For me, it is not clear how this season ended so being so bad. It literally had everything to be good, but then you went and decided to takea fat shite on top of it, didn't you? \\n\\n\\n\r\nSpoilers:\\n\\n\r\nSTORY: 3\\n\\n\r\nMy problem was that it felt like they tried to compress fifty episodes worth of anime into 24, which I really really really really hate.\\n\\n\r\n1- They left out a LOT of relevant information and included a LOT of useless crap, like the first 5 episodes that were yes, very good and developed the characters, but felt useless compared to the whole season.  They did not develop the whole Diane goes missing, Gowther is a demon (sorta) and Merlin just disappear for like the whole middle part. Where was she when Meliodas was getting massacred? She could've teleported him out of there. \\n\\n\r\n2- The villains seem great at first, but then they are like so delicate. I think it would have been fine if like they didn't kill off 10000 villains with potential. \\n\\n\r\n3- like this is more of an okay, good job. Even though they took a big dump on this season, it wasn't a total screw up. You can still recover from that AFTER YOU FIRE THOSE INCOMPETENT SONS OF MULES WHO DON'T K-\\n\r\nanyway, please get in contact I will be sending my resume. \\n\\n\r\nART: 10 ( as always nothing to complain about it)\\n\\n\r\nSOUND: 6 (I still hate Elizabeth's voice and all, but the low score is more for the intro songs that got worse)\\n\\n\r\nCHARACTER: 7\\n\\n\r\nFor the character, maybe I gave a high score, but this is taking into account the last sin development, the Ban story and the Meliodas events that happened (he's like a demon lord or something like that). \\n\\n\r\nI did expect much more of the villains, but I feel like they completely squandered demons and made them seem stronger at first then weaker for no reason. \\n\\n\r\nThey majorly missed out explaining what the hell happened to Merlin in the middle, where she felt completely useless for some reason\\n\\n\r\nThey made Jerico my favorite character, and then screwed her up ( like not the character but she was so friendzoned it gives me cancer)\\n\\n\\n\r\nENJOYMENT: 8 (even though it was a TERRIBLE SEASON, I still enjoyed. If your purpose is to continue the anime, please do so. I will watch it, but please improve the story and hire like 1/2 of your staff for this garbo writing. \\n\\n\r\nYOU KNOW WHAT I DON'T HATE ELAINE, BUT SHE NEEDS TO GO. ADIOS. GOODBYE BIATCH. \\n\\n\r\nJERICO + BAN FOREVERRRRR\\n\\n\r\nI think the whole Diane and Gowther part wasn't very well explored and missed out on a lot of explanation.\\n\\n\\n",
            "date": "2019-01-17T12:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 299301,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/lulunacif",
                "username": "lulunacif"
            },
            "url": "https://myanimelist.net/reviews.php?id=299301"
        },
        {
            "content": "The explicit understanding of the seven deadly sins is that as a coherent whole they work like a charm but individually most lack the characterization to stand out. If you’re going to watch something like the seven deadly sins, you need to go in with the mindset of being action-oriented or else you will be disappointed by the shallow substance of the show. The first season had some good things going for it (interesting subplots, mysteries, and coherent story development) and that's why I had high hopes for the series but the current season fails to elaborate onany of the strengths of the previous season. Instead, it seemed to be confused about where it wanted to go and ended up floundering with pointless direction. Still, it's fun to see some action once in a while, so you won't be disappointed if that is what you are looking for here. \\n\\n\r\nAnimation: Being A-1 pictures producing this you can expect some high-level fluidity, not that A-1 pictures is particularly talented just that they have the manpower and money to make it happen. The show is almost at sakuga level the entire duration of the show and it really blends well with the fight choreography(which is also pretty incredible). There's really not much to be said about the animation other than the sometimes interesting use of CG at times. It also fits well like the darkness so it wasn't that big of a problem. \\n\\n\r\nStory: This is where the show lacked the most of, which is a shame given that the rest of the show had was rock solid. I’m going to chalk up the story direction and pacing problems to be the switch in directors. There seems to be a lack of understand where its concerned with how to make the show more interesting to the viewers. The story speeds past major parts and exposition to get to the fights of the show which seemed to be a mistake as none of the characters got any kind of proper time except a few(meliodas and Ban). The show actually managed to increase the cast size when it already an insane size to begin with. This gave most the characters very little importance and while some did die it felt pointless and not a very effective use of time. The story adds more information and backstory without solving the current list of mysteries and confused the hell out of me where the show was going. There's no clear reason why the seven deadly sins have to fight the ten commandments outside that they are “bad”. It added to the confusion with the messy structuring of events as well, which could have easily been rearranged to fit the premise of the story better rather than jumping around everywhere. All and all I found the story to lose a lot of its initial promise and instead just focus on the season-long fighting tournament. \\n\\n\r\nMusic: Sawano, Hiroyuki is back at it again with his grandeur and uplifting music. He really gave a lot of the scenes a big boost in enjoyment and excitement. Without him, I could not see myself enjoying the show anywhere near the same level. The music in total has little diversity, not in the sense of the type of music but rather in the abstract sense. It mostly consists of music that you could come to expect but is nonetheless is very good. Besides that, the OP’s and ED’s are alright and are produced by popular rock and Hip Hop bands. Overall a solid OST.\\n\\n\r\nVoice acting: Keeping with tradition I would like to present another fabulous English dub to watch. Some returning talent and some new talent as well, the voices had lots of enthusiasm and power behind them. I really enjoyed the performance done by Benjamin Diskin in voicing Ban and Diana by Erica Mendez. Really had a grasp on their characters and I really recommend the dub if you are looking for an interesting experience \\n",
            "date": "2018-11-20T09:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 294419,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3494561.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/subzerobelow",
                "username": "subzerobelow"
            },
            "url": "https://myanimelist.net/reviews.php?id=294419"
        },
        {
            "content": "Nanatsu no Taizai: Imashime no Fukkatsu is the third season of the seven deadly sins anime and, it is a mixed bag in my opinion.\r\nlets start off with the positive the characters, particularly the sins. All seven of them receive development, depth and, are relatable in their own way. I have to especially praise Ban as his backstory as well as what he went through this season cemented him as one of my favorite anime characters, hi relationship with Elaine, swagger and, overall coolness just make him a joy to watch, Also, the introduction of Escanor the lion sin of pride is probably the bestway I've seen a character enter a show since maybe ever. I loved the development they gave Meliodas, King and, Gowther. Dianes extended past was also really cool to see. I loved that we got to see more of the supporting characters like the knights of Liones. \\n\\n\r\nThe story is well paced for the most part, action sequences were seamlessly fluid and, were of cinematic quality. The first opening to the show titled Howling by FLOW and, GRANRODEO is one of the best anime opening I have ever heard, I've listened to the full version at least an hundred times (no joke), its second best opening I've heard this year behind Bye Bye Yesterday. The themes and, most were pretty good and, matches the show. animation design was sleek, crisp and, clean.\\n\\n\r\nI liked how they dealt with the themes of coming from a broken home, making sacrifices and, dealing with difficult decisions. The comedy was elevated from the previous season and, I liked how they handled the arc of villain turned ally.\\n\\n\r\nWhich brings me to one of the thing I did not like about the season the villains. The main antagonists of the season are called the ten commandments, demons based on the commandments. They started off with all the potential in the world but, were completely and, utterly wasted. We don't learn much about them and, only one of them Galand of truth has substantial screen time. To add insult to injury half of them are killed off by the end of the season so what was the point of hyping them up ??\\n\\n\r\nAlso, the final 4 or 5 episodes of the show were an absolute wtf. By that I mean that after a great and, epic cliffhanger they show literally takes a halt and, has two filler episodes. The final battle was good but, was just a redo of the final battle of the first season. \\n\\n\r\nDuring the season they introduced this power level thing where they listed down the stats of some of the characters and, I didn't hate it but, it did get irritating at a certain point.\\n\\n\r\nFor the most part I very much enjoyed Nanatsu no Taizai: Imashime no Fukkatsu, it had great action, comedy and, drama. I loved watching the adventures and, backstories of our seven main characters as well as some of their supporting characters. The show does have its boring and, dull moments but, thats to be expected with every shonen. I like this season more than the first and, I can't wait to see what comes next for the sins.",
            "date": "2018-11-16T23:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 294194,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6666889.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/saeid_2k",
                "username": "saeid_2k"
            },
            "url": "https://myanimelist.net/reviews.php?id=294194"
        },
        {
            "content": "Contains spoilers, you've been warned.\r\nLet me preface this by saying that I do not dislike this series. I LOVED the first season, the filler was kinda eh, and this falls somewhere close to the filler. From a pure enjoyment perspective, I really enjoyed this season. I kept watching and binged half of the season in a day. However, from an analytical perspective, this season is kinda disappointing.\r\nThe art and sound remain pretty much the same. There are practically no complaints here. The animation looks awesome and the background music is reminiscent of Fairy Tail, but still retains its unique personality. \r\nThe story and the characterdevelopment kinda fall flat though. The plot is pretty interesting, having the Ten Commandments rise from their imprisonment, and their attempt to take over Britannia, and the attempts of the Seven Deadly Sins to stop them. It's pretty generic, but it gets the job done. The story kinda progresses slowly, but it wasn't too big of a deal. Although I did roll my eyes at the training arc that made no sense and the tournament arc, which again, also did not have any impact in the long run of the story.\\n\\n\r\nMy biggest issue with this season were the characters. Let me go through a couple and explain my reasoning. Firstly, Gowther was an absolute ass out of nowhere. Not only did he erase Guila and Zeal's memories of each other, but he erases Diane's memories for no apparent reason. Like, literally, there's no rationale behind it other than proving that he has the ability to do so. The Seven Deadly Sins ABRIDGED Version of Gowther was damn hilarious. However, with the one from THIS season, I just wanted to reach through the screen and bitch-slap him into next week. He was such a condescending douche for literally no reason, causing a whole bunch of problems just for the hell of it.\\n\\n\r\nDiane was supremely useless for the majority of the season's run. I mean this is mostly thanks to Gowther wiping her memories, but she transforms from this badass boss to a sniveling damsel in distress. Elizabeth wasn't that useful either. I mean you could argue she did save Meliodas, but he wasn't in any real sort of danger, so her role was pretty trivial. \\n\\n\r\nI don't know what the writers were thinking of with regards to Hawk's character. In the first season, he was pretty hilarious and charming, but he was more annoying and gimmicky in this one. I didn't mention this earlier, but I HATED the whole \"power level\" spiel. It felt like lazy writing just to establish how truly powerful different characters were. Like we get it, we know how powerful they are, no need to insult our intelligence by dumbing down the mechanics of the show. Anyways, back to Hawk. His whole \"swallowing a magical creature\" really didn't make any sense, and seemed to come off as more arrogant and less cute. I honestly believe that we entered a different World Line in which Hawk didn't actually save Meliodas and Elizabeth, and instead had a complete character rework to become what he was in this season. \\n\\n\r\nNone of the Holy Knights made an impact on me like they did in the original series. Whereas they were brooding and powerful knights in the first season, they were more or less bumbling dolts who sometimes fought well and shouted out the names of their moves in this one. \\n\\n\r\nMerlin, like Meliodas, absolutely refused to die. I mean don't get me wrong, I love both of these characters, but like Ban, it's impossible for them to die. She's a really interesting character and apparently very intelligent, so why she felt the need to give Hawk his power-level thingy was so strange. Also the idea that she wasn't able to stand a chance against Galand but was totally able to take down Grayroad, who was apparently a lot more powerful, without any problem made no sense either. \\n\\n\r\nKing and Ban were okay. I thought Ban's connection with Elaine was sweet, but his treatment of Jericho was ridiculous. This chick puts her life on the line for a man that she knows full well can't die, and the dude just brushes her aside. Like wtf man? I still like Ban, but I could not for the life of me understand how he ignored Jericho when she risked life and limb to save both him AND Elaine. King was still cool, but his blubbering about Diane got old after a while. \\n\\n\r\nMy biggest confusion came from Hendrickson's character. Like I get that he was manipulated by Fraudrin and everything, but his complete character 180 from the original series made ZERO sense. Like he released the Ten Commandments, then not even two minutes after that, realizes he has royally screwed up and decides to fight against them? Like what? Him hanging out in the Boar's Hat like nothing had happened felt so out of place, and the whole Druid aspect felt thrown in at the last second just to give him this OP power, which was really only there to establish that Elizabeth had the same power too. \\n\\n\r\nThe Ten Commandments were such an interesting group of characters, but as far as motives go, they were really just \"We're evil because we're the villains of this show.\" Like all they wanted to do was take over Britannia. That was it. Derieri and Monspeet had so much room for character development, but instead got shoved to the sidelines. We almost never get to know anything about them, other than the fact that they're demons and they love each other. It's never established why Drole and Gloxinia joined the Ten Commandments in the first place. Like we know that they fought against the Demon King, but it is never touched upon why they switched sides. I never liked Zeldris from the get-go, he more or less just felt like the typical \"edgy for the sake of edginess\" villain. Grayroad was extremely creepy and interesting, but how easily she fell to Merlin made me lose any respect for her as a character. I never liked Fraudrin, especially considering how little we saw of his character in the first season. Similar to Hendrickson, the whole 180 seemed to come out of nowhere. I thought Melascula had some pretty damn good character development, and I thought that her drunk interactions with Escanor and Galand were hilarious, but I kinda got sick after she miraculously survives the sins not once, but TWICE. Estarossa was pretty interesting, and his whole interaction with Meliodas was compelling and his fight with Escanor was damn awesome. The only Commandment I can say I genuinely enjoyed was Galand, but then again he fell pretty pathetically to Escanor.\\n\\n\r\nEscanor is the only reason that my character score isn't any lower. The series instantly shot up in enjoyment the episode his character was introduced. He's just so stupidly overpowered, that you can't help but grin at his sheer amount of pride. This is a manly man enough to give Alex Armstrong and Kamina a run for their money. The way he pummeled each of the Commandments without batting an eye was such a cool thing to behold. His love of Merlin was also pretty sweet too. \\n\\n\r\nAlmost all of the other characters I couldn't care less about it. Characters like Dolores and Zhivago felt like they were introduced for the sole purpose of another person's character development. Matrona really didn't make much of an impact. I thought she was stupid to block the arrow for Diane, and the idea that a tiny human could saw through that much muscle and bone in time to save a giant just felt unrealistic. I know this show is unrealistic to begin with, but you really have to stretch your imagination to understand how she was still able to survive all of that. \\n\\n\r\nAs a last minor note, that goddess towards the end was a total bitch. Sorry lady, but you are a goddess, a race that is apparently superior to all other races. Why the hell are you running away from a fight? Derieri should NOT be able to go Super Saiyan and bisect you with one swipe. Doesn't work like that honey.\\n\\n\r\nMight I add that death is meaningless in this show. Spoilers, but no character that has any meaningful presence dies. Galand slaughters more than half of the sins towards the beginning of the series, but surprise, an illusion was created and they weren't really in any danger and Elizabeth healed their scratches. Meliodas dies, but again, surprise he's back from the dead for whatever reason. And sorry, but giving Melascula the power the ability to bring things back from the dead was such a lazy method of tying up loose ends. Like, I'm convinced the only purpose for that power was to bring Zaratras back (who also contributed practically nothing in the grand scheme of things). While I enjoy Merlin, as I previously mentioned, she is saved from death twice in the run of this show. Escanor is stabbed by Gloxinia, only to be brought back by Gloxinia's magic life-giving spear. It took away any emotion that I had for a reaction to a character death, since I knew that they were going to magically come back somehow. \\n\\n\r\nAlso, all the little backstories took away from the main plot too. While they gave context to the character or situation, they just felt distracting.\\n\\n\r\nAs I previously mentioned, I still enjoyed the series, I just can't bring myself to hate it. But if I analyze it, then I find myself finding flaws with just about every single character. It's by no means a bad show, but it was definitely not as good as it's predecessor.",
            "date": "2018-11-01T22:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 293150,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7209707.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DoubleJEspejwan6",
                "username": "DoubleJEspejwan6"
            },
            "url": "https://myanimelist.net/reviews.php?id=293150"
        },
        {
            "content": "A IMP Review of: The Seven Deadly Sins: Revival of the Commandments (Dubbed edition)\r\n(IMP stands for “In My Prospective”, meaning if someone attempts to correct the way I see the show I have no intention of reading any “corrections”)\r\nP.S the names may be misspelled but i did that for comedic effect so ignore it.\r\nLet me start off by saying this first and foremost, DEATH IS MEANINGLESS in this season. The first season of this show was charming with a bit of cheesiness but not to much, however this season taught me how i shouldn't give a shit if a character dies because SOMEHOW they canbe brought back, and it wouldn't be a big deal if the first season just revived people over and over but there's a important plot point with Bond and his gal pal which basically became meaningless and in this season the character that contributes to making death meaningless (i'm sorry for spoilers) dies not only once, but twice and STILL ISN'T DEAD! With that said lets begin with...\\n\\n\r\nStory: 3/10. a big reason for this is how death seems to have no meaning in this season but had a big impact in the first season, another reason is how they Commandments escaped in the first place which happens in episode 1 so not really spoilers, People who were dead and we killed off on screen were alive basically just to make sure there were enemies for this season, and lastly the events from the endpoint of the last season were just \"all a dream\" and for some reason Melodious goes from being adamant about Liz not coming to just plain forgetting about the subject entirely... The facepalming and painstaking shit in the first at least 7 episode was just ridiculous. You have to really stick out the show to find any good parts in it so my rating stands at 3 because it does get a bit better kinda but it gets extremely tropey and and has plot armour shit as well as no idea what a level cap is, unless you mean to say the level cap is Melodious because he's even more bullshit than season one but at least in season one i could expect it.\\n\\n\r\nCharacters: The characters are thankfully not terrible in this, even the Dragon sin of overpowered bullshit himself wasn't terrible. However things changed extremely for some characters and others stayed side kicks or got my attention this season. Lets start with whos not right,\\n\\n\r\nBond: After the half assed (signs of a holy war) thing you'd think bond would be pissed off at Melodious or he'd be more hostile like in Season one but bond becomes extremely passive, unless it has something to do with his loli of course.\\n\\n\r\nGoathar: ... What the fuck happened to this guy? He starts out terrible in this season, fucking with people's memories to the point where we get a cop out amnesia thing happening which puts the group in the line of fire, he constantly fucks shit up throughout the season and the only explanation is a spoiler thing that doesn't really come to mean anything at the end except like one line he says i guess...\\n\\n\r\nMerlin: She goes from being a worthless character who showed up at the last minute to being an important character throughout the story but still being pushed to the sidelines only to be useful again at the end, i can't figure out what the fuck they wanted to do with her honestly LOL? I can only assume she was \"to powerful\" so they put her to the side until she was needed? Fuck if i know, it just feels like shes being shoehorned in to be more important then she should be, even her power level and interaction with the leader is making her back story seem more important, kinda dumb honestly.\\n\\n\r\nDiana: She didn't exactly change her per say, but she was given a stupid cop out thing and was basically reduced to the \"damsel in distress\" for the season.\\n\\n\r\nThe king of Camelot is reduced to a side character, Guild Thunder and a few other knights are reduced to side characters, Jericho was ok for a bit but ALSO reduced to a side character/damsel in distress, and a few others that could be spoiler potential.\\n\\n\r\nNow onto the good character stuff\\n\\n\r\nThe Seventh Sin, Estabone: HOLY SHIT, it only took 2 seasons to get the seventh sin and my god hes is the best part of this godforsaken season. Hes \"sort of\" stronger then Meliodas, his overall a good character, and he is badass as all hell, what he does is worth watching, he's kinda like thor in a way but honestly fuck thor in comparison.\\n\\n\r\nMelodious: I know i give his overpowered shit crap, but he was a good character throughout the season still and you get to know more about him.\\n\\n\r\nKing: I kinda though king was one of the weaker sins unless he was fighting for something he cared about but he's probably the 4 or 5 strongest hitter in the sins and he stays true to his character. \\n\\n\r\nThe Princess: She stays true to her character as well and overall i think gets a bit better than expected i guess. \\n\\n\r\nBesides that only a few characters were ok at best i'd say so (mainly because of Estabon) i'll score them 7/10.\\n\\n\r\nArt: It's done by A-1 sauce pictures and was done the same way the last one was basically so what do you expect? It looked good and had some great battle scenes so 8/10.\\n\\n\r\nSound: Overall the music wasn't terrible or anything but i noticed they used the same tracks a few times in the show so i have to dock point for that, 5/10.\\n\\n\r\nEnjoyment: The beginning was terrible, and the end was kinda dumb, but the middle made be somewhat forget the beginning portion and let me enjoy for a good bit so i'll give a 6/10.\\n\\n\r\nOverall: 5/10 (mostly because of Estabon) I was hard to sit through a lot of the stupid shoehorned plot but there were times i was entertained so though i might not watch it fully again, i would possibly watch the parts with Eslabon again because they were great. \\n",
            "date": "2018-10-17T02:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 291933,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5049125.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SniperKnighter",
                "username": "SniperKnighter"
            },
            "url": "https://myanimelist.net/reviews.php?id=291933"
        },
        {
            "content": "Watch the second season to keep up with the story, but don't expect it to be on the same level as the first season. \r\nThe story begins quite strongly this season, with our crew beginning the reconstruction of Liones after the battle with Dreyfus and Hendrickson. Each character is developed more along the way, as we begin to glimpse into the pasts of Meliodas, Ban, King etc. As the title suggests, the Ten Commandments are the main villains this time around, and their arrival forebodes a great war. The show does a good job hyping up these fearsome villains, but somewhere along the way theshow becomes distracted by too many side plots. Diane's and King's arc this season are downright frustrating to watch, and while there is a beautifully animated \"big fight\" towards the end of the show, the last 4 or 5 episodes were pretty awful. You can literally feel the studio running out of money at this point. The pacing starts to lack direction, the art quality drops a bit, and none of the \"hype\" action scenes seem to carry that impact. \\n\\n\r\nMINOR SPOILERS: As a side note, the introduction of power levels was unnecessary and detrimental to the show. The point of shounen is to SHOW people's power through their interactions with other characters or the environment. The fact that several characters were able to just see another person's power as a number completely takes away the magic of this genre.\\n\\n\r\nObjectively I don't think this season was bad, but the final episodes of this season were disappointing.",
            "date": "2018-07-07T12:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 283265,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3397505.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kevstuf",
                "username": "Kevstuf"
            },
            "url": "https://myanimelist.net/reviews.php?id=283265"
        }
    ]
]