[
    [
        {
            "content": "I am the bone of my spin offs.\r\nYuri is my body, moe is my blood.\r\nI have resulted in over a thousand boners.\r\nKnown to lolicons.\r\nBut not to you filthy casuals.\r\nHave withstood magical girls and their self aware banter.\r\nYet, those viewers only care about the yuri scenes.\r\nSo as I pray... UNLIMITED LOLI TWERKS!\r\nFate/kaleid, the somewhat self aware, somewhat deconstructing, and fully bonerific and moeblob magical girl show, also known as Carnival Phantasm with only Fate characters and with... magical girls. I found this show to actually be more entertaining than Fate/Stay Night UBW, for even though it is as stupid and over the top as UBW, ifnot more so, at least it's painfully aware. It's also... not for kids... that's for sure. Just like how Madoka Magica isn't for kids due to the darkness and dankness, Fate/kaleid isn't for kids because... there are jokes that you wouldn't associate with a kids show.\\n\\n\r\nOh, you thought that scene was just gonna be cute girls doing cute things, with their cute voices and their cute interactions? Too bad, here's a boner joke. You thought one of the cute lolis visiting their sick loli friend was heartwarming? Too bad, let's have one of the lolis try to sexually assault the other. \\n\\n\r\nFate/kaleid is bad, but it's so funny that it's good. The story itself is basically like every magical girl ever made, trying to capture the cards! If only Sakura Matou was a magical girl. CLAMP would probably sue Type Moon...\\n\\n\r\nFate/kaleid does, to some degree, deconstruct the magical girl genre. While it is nowhere near the depressing realization in YuYuYu, or the dark twist in Madoka Magica, it still deconstructs the expectations of what a magical girl is supposed to be. Whether it be through self aware magical girl jokes, or through character expectations of what being a magical girl is like, let's just say that this show isn't entirely rainbows and unicorns and yuri lolis. \\n\\n\r\nFate/kaleid is one of those shows where you should probably watch the rest of the Fate franchise to get the full experience. While this show does take place in a completely different setting, there are a lot of references to the Fate universe we all know and love. The concepts of classes and Noble Phantasms are still a thing, and to fully get the grasp of the situation, go watch the other shows first! You don't have to, but I recommend it.\\n\\n\r\nAnd of course, there is the budget, the most famous aspect of the Fate series. Fate/kaleid is a spin off, and it isn't even by Ufotable, so how are the action scenes? Surprisingly, the action scenes are still incredibly high quality. Great choreography and special effects that can hold its own against Ufotable, Fate/kaleid has quite the thrilling battles. Fate/kaleid also has a very good soundtrack, as well as a catchy Fate-esque OP. The voice actresses for the lolis are just HHNNNGGGGGGG and yeah. Long story short, Fate/kaleid still boasts some surprisingly high production values. \\n\\n\r\nAnd of course, the characters! The Fate characters are back, albeit with somewhat different personalities. Illya is a deredere moeblob loli who is actually an incredible comedic character, and she's got a maid fetish! What a gal. Miyu is a Fate/kaleid exclusive kuudere anti-social character who is... pretty generic, but hey, she's also a loli! And of course, you will find many of your favorite Fate characters back in action. TsundeRin is back in business, this time stealing the Cardcaptor Sakura position from her sister to become Illya's mentor, and you got Luvia, who you thought was going to be a Fate/kaleid exclusive, but spoiler alert, she isn't!! You will also see other familiar faces in the supporting cast, such as SHIROU THE HERO, back at being the good oni chan that he is. He doesn't say any stupid quotes in this season, but I heard he does later on, so looking forward to that. You got Iris, who is now a total milf, and her personality hasn't changed at all since Zero. There is even a personal favorite of mine, Fuji-nee, the best sensei ever! Also, the two magical sticks, Ruby and Sapphire, have A LOT of character! Don't take their stick appearance for granted! They have way more character than most modern anime characters these days.\\n\\n\r\nFate/kaleid is just even more fanservice for Fate fans. As someone who isn't a big Type Moon fan, I still found this spin off highly enjoyable. The fact that I enjoyed a magical girl spin off more than half the canon story line is... impressive, to say the least.\\n\\n\r\nTL;DR: I hope there is more yuri in season 2.",
            "date": "2016-05-09T08:10:00+00:00",
            "helpful_count": 200,
            "mal_id": 218215,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5146740.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Yuni",
                "username": "Yuni"
            },
            "url": "https://myanimelist.net/reviews.php?id=218215"
        },
        {
            "content": "Fate/kaleid liner Prisma☆Illya is one of those anime series where people may tends to look away just because for what it is. You know that saying that goes “don't judge a book by its cover?” Well, I guess some anime fans seems to do just the opposite of that and take the cover for granted. This is one of those anime series that might bring some disappointment at first especially to those loyal fans of the Type-Moon franchise. Series like Fate/Stay Night, Garden of Sinners, and a more recent example of Fate/Zero has a stance of that serious atmosphere going on. What does Fate/kaleid linerPrisma☆Illya have? More than what you hoped for.\\n\\n\r\nAt any rate, this series is adapted from the manga of the same name written by Hiroshi Hinoyama. An important note is that the series takes place in an alternate set universe that serves as a spinoff of Fate/Stay Night. Therefore, do not be surprised if there are some familiar characters making their spotlights in this series. \\n\\n\r\nAs far as this series goes, the premise is pretty straight forward. Illyasviel von Einzbern is indeed the main protagonist of the story. (for the sake of my laziness and ease, she will be referred to as 'Illya') For those who are unfamiliar with her from the Type-Moon franchise, she is foster sister of Shiro. However, there is a difference between her character and Fate/Stay Night. In this series, she is shown as a cheerful young girl who grows up in a seemingly normal childhood with friends and joy. Oh but that all changes one day when she makes a contract and becomes a magical girl. Welcome to your new life, Illya. \\n\\n\r\nEven before becoming a magical girl, we can see that Illya is already fascinated with the idea because of a popular anime she watches. In that anime, there are magical girls. But never did she ever thought the day she would actually become one herself. For fans of Illya from the original series, this would be a delight because we get to see her in a much different way. But for fans of the Type-Moon franchise itself, you might also get a surprise with the addition of some new characters. Oh and Rin makes her return too of course in this series with her tomboyish self.\\n\\n\r\nAs some fans might guess, this series does have a lot of fan service and some tasteless moments. These usually involves awkward moments mostly from Illya because of her naive personality. Furthermore, her character is designed with extra doses of moe. Illya's battle design stands out that also gives her a touch of magical girl atmosphere. In fact, she herself admits the outfit to be embarrassing. On the other hand, we have Miyu Edelfelt, a new character that also serves the serious role of a magical girl. Unlike Illya though, she seems to be much more serious and quite mature for someone her age. With both magical and academic talent, Miyu serves as a character that seemingly exists the opposite of Illya. She is like the perfect candidate for a magical girl while Illya lags behind as the second rate. Or does she....?\\n\\n\r\nWith the help of a talking magical kaleidostick (Magical Ruby), maybe Illya can overcome her lack of self-confidence. After the contract is being made though, the magical stick plays the role of more of a mentor. Of course, themes such as becoming a magical girl, training to gain experience, and fighting/capturing cards isn't new to the anime industry. About a decade ago, a popular classic known as Cardcaptor Sakura also adapts the theme of a normal girl whose one day's life changes forever after becoming a magical girl. Other series with similar themes such as Shugo Chara, Magical Girl Lyrical Nanoha, PMMM, and the more recent Gen'ei o Kakeru Taiyō  also shares similarities. The noticeable phase here is that Fate kaleid liner Prisma Illya plays around the idea constantly in both a cute and dangerous fashion.\\n\\n\r\nIf I had to use the word 'cute', this series would earn a 10/10 on that scale. But more than that though, the concept of collecting cards as a magical girl is indeed a serious role. There's no joking around because the enemies Illya and her friends face are dangerous. In fact, even around half way into the series, the girls' lives are put into danger when they face adversaries like they've never encountered before. Classic enemies from the Type-Moon franchise makes their appearances in alternate versions to present a challenge that really does put their lives in danger. In a series such as this, you might not take it serious at first. However, it is clear that the idea of collecting cards is a grim task at hand. On the comedy side, there's the love/hate rivalry between Rin and Luvia. Illya's behavior also might spawn a few face palm worthy moments because of her age and inexperience. \\n\\n\r\n10 episodes. That's less than the average amount of a typical one core series. What that means is that the series may have to cut down some material or it won't have time to fit everything in. Luckily, the series is faithful with its adaptation. The only slight problem might be that the series doesn't have enough time to cover all the captures' every detail. This serves a double edge sword in a way. On one stance, 10 episodes could be rushed and leave out material fans want to see. But then again, the more detailed quality can bring out a more pleasurable experience. Oh and let's not forget there's still an OVA as well as specials. \\n\\n\r\nThe action is surprisingly fluid and presented quite well. I was surprised after seeing how this was adapted because of the amount of detail put into the actual fighting. The enemies are designed with a typical Type-Moon fashion but given a more dangerous look than fans might originally anticipate. In fact, a particular enemy that shows itself might bring out some shock to see how the character is presented differently in this series. The more important part though is that the action isn't parodied but rather as being serious. Illya's struggle at first shows her inexperience but there's development with her skills that is clearly evidenced later on. As for Miya, she shows her experience already as a magical girl but more importantly becomes both a friend and rival for Illya. As a foil to her character, the duo makes a formidable team along with those magical sticks.\\n\\n\r\nAs far as jokes goes though, I have to admit that some of it is a bit stale. Oh and the series doesn't try to avoid its fan service. There's the suggestive camera angles and skin being shown along with the loli expressions here and there. Some of the conversations between the girls and their peers also seems to be a bit forced in the comedy department. Even the first episode shows a bit of this along with cheesy dialogues. Among other factors, Shiro also doesn't seem to be an impressive character as his role is more of in the backgrounds. His denseness regarding his female friends and her own foster sister is also a bit frustrating to watch. By the way, he isn't even a main character. There's also some lewd jokes and misunderstandings here and there as well which should be expected.\\n\\n\r\nThe artwork isn't as impressive as I had hoped. Most of the coloring has a light tone but is covered with generic design. As mentioned before, Illya and Miyu are designed as magical girls and they really look like them. Their enemies are designed to give off a dangerous vibe although sometimes, I wonder what their real purpose is. The backgrounds are typical with a less-so realistic feeling to it. In fact, there's hardly any realism in this show. On the other hand, I do find that everything does fits within the concept of the series quite well, at least that much.\\n\\n\r\nColor me surprised here but the OST is brilliant. Sound production met beyond my expectations especially in the action scenes. A particular battle in the later episodes gives off its intensity with the way it is presented. It has a balance of rock and techno that is pleasurable to hear. The OP song \"starlog\" by ChouCho also shows its strength with its choreography and some foreshadowing. Among the cast though, Mai Kadowaki gets a standing ovation for her performance. Returning as her role from Fate/Stay Night, the way her character stands out requires a more high pitch tone. I am quite grateful that she was able to pull the task off with brilliance.\\n\\n\r\nOverall, don't entirely judge this series by its cover. Sure, it looks like just a typical magical girls series with cute girls doing cute things. But then when you look deeper into it, you might get a surprise. That surprise comes from the way it is both adapted and presented. I feel sorry for those who dropped this series from the first episode without giving it another shot. If you're a fan of Type-Moon's franchise, this should definitely be something to invest time into. Even if you're not fan of Illya, Rin, Shiro, or the others, it should be at least given a try for the first 3 episodes. Oh and there's nothing wrong with watching cute girly cartoons with magical girls.",
            "date": "2013-09-07T17:12:00+00:00",
            "helpful_count": 144,
            "mal_id": 112253,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=112253"
        },
        {
            "content": "Fate/Kaleid is something that happens when you take a seemingly stupid idea and turn it into something that's close to spectacular. \r\nNow, before I get started, I just want to point something out; A lot of people disliked this series, or dropped it in the first few episodes because it's a Fate/ series... turned Magical Girl. I did the same. When it was first airing, I dropped it, not because I didn't think it was interesting, I just didn't feel like watching it at the time. I, too, think that turning the Fate/ series into a Magical Girl series is a, well, stupid idea. Iwas wrong. \\n\r\nAlso, this series is a lot darker than it seems, so do not judge a book by it's cover, including a fair amount of blood and suggestive themes. It's like Madoka Magica's rating, though I find that this series is more mature in terms of content than that series is.  \\n\r\nI love the Fate/ series, I love Fate/Zero and I love Fate/Stay Night. Now note that I have JUST finished this series, as in, I watched it after the announcements for a Fate/Stay Night remake by ufotable and a season 2 for Fate/Kaleid were made. Due to the Fate/Stay Night remake being announced, I saw this series more as an awesome bonus. It takes the Fate/ story line and looks at it through a different light; although a fairly obnoxious and/or ridiculous one, it has a lot more to offer than it seems. Also note that this series has NOTHING to do with the main Fate/ storyline, character relationships are different, the Holy Grail War doesn't exist as far as we know, and characters who are supposed to be dead, are now alive. \\n\r\nNow I'll start my actual review, and it may seem like I'm over-praising the series... if it does, I apologize because that was not my intention. This is my actual opinion. I watched this series with a perspective as it being a bonus series to add onto the already-amazing Fate/ universe, thus I won't judge it just because it's a \"dumb\" magical girl adaption of the Fate/ series like most people have. \\n\r\nStory: 8\\n\r\nThe story is simple. Illyasviel Einsbern lives a normal Elementary-School life with her friends, and her \"older brother\" Shirou Emiya. Rin Tohsaka and a woman named Luvia were given the job of finding the remaining Class Cards, as they already own the Lancer and the Archer. The class cards reflect the 7 servant classes in the Fate/ series; Archer, Lancer, Saber, Rider, Assassin, Caster and Berserker. These cards are obtainable by entering a mirrored version of certain areas, (As in, another dimension) and fighting the \"Alter\", or the Dark versions of each servant. They use weapons that look like Magical Girl wands, each with a name, Ruby and Sapphire. They both talk and have personalities, too. These two wands believe they're abused by Rin and Luvia, so they decide to find new masters. Ruby flies off while Illya is taking a bath and happens to meet her. She then tricks Illya into a \"contract\" with her to become her new master. (Note: This is NOT a contract similar to Madoka Magica whereas she's forced to fight or else she'll die or something horrible will happen. It's just a contract to give her the title of master and to be able to use the wand's powers, that's all. She doesn't HAVE to fight and Ruby fully understands that.) Rin finds Illya, and tells her that since she stole her wand, she'll have to help her collect the class cards. Luvia does the same with a girl named Miyu. Thus begins their story. \\n\r\nSince the story is simple, it's  portrayed/paced perfectly fine. There isn't much to explain, so it doesn't waste any time. Although, there are some fanservice-ish moments included, but that's to be expected of Silver Link's animations. They don't last long enough to really be a bother. The story becomes dark around episode 6 of the series, as Illya and Miyu go to collect the Caster card, an unexpected servant arrives causing trouble. The series delves into the horror and grief involved with being an elementary school girl and having to fight dark, demonic entities with a magic wand dressed as a magical girl. Illya shows true signs of terror, she realizes that, after she's cut and begins to bleed, that all of this is real, that she can actually be killed within these dimensions. Thus, she's psychologically unstable for certain amounts of time, and even refuses to talk to her friends when the time comes. The impact of her fighting really shows in her character development. Guilt from accidental attacks that could have injured her own friends is also an element, that you'd have to see to know what I mean. It does an alright job emotionally, and the dimensions are portrayed spectacularly. \\n\r\nTo be honest, one of my favorite aspects of the story was the Dark versions of the servants. I have to say, Dark/Alter Saber is one of the most badass characters I have ever seen. She is brutal. \\n\r\nThere is one thing that isn't really explained, unless you're a fan of the Fate/ series and you know the background behind Illya, and that's the source of her powers. That may or may not be explained in season 2, which I heard from someone that the story will only get darker. \\n\r\nArt: 10\\n\r\nWhat can I say? This is Silver Link, their animations have always been fantastic. Look at shows like Dusk Maiden, who's visuals are gorgeous. Also, compared to other anime these days, the fight scenes were top-grade. Actually, one of my new favorite anime fights of all time come directly from this series, and that's the fight with Alter Saber. You'll see what I mean. It's a stunning sight to see, and certainly came as a surprise. The art keeps the show suspenseful and intense. I'm hoping season 2 will be even better, I expect no less from Silver Link. \\n\r\nSound: 10\\n\r\nThe music is phenomenal. It keeps fight scenes and other emotional scenes intense or it causes them to leave more of an impact. The soundtrack actually sounds like Fate/ music as well, which is a huge plus. I believe it even kept close to the original main theme of Fate/... but it's been so long since I've seen Fate/Stay Night I can't say for sure. The opening, too, is amazing. Great song, and great visuals to go along with it. The ending I didn't really care for because it was somewhat light-hearted and I wanted to see more, so I skipped the credits. \\n\r\nCharacter: 8\\n\r\nThe characters are... they're alright. Nothing really worth mentioning. Ruby and Sapphire, the wands, have their own personalities which keep the show a little more lively considering their attitudes. Illya is, well, different. Nothing really worth describing. One of her friends at school, though, was entertaining even though she didn't have a lot of screentime. She was obnoxious and clueless but in a good, funny way. Other than that, the characters are fairly average but you can get attached if you weren't already from the previous Fate/ series. \\n\r\nEnjoyment: 10\\n\r\nThis series was interesting. An extension to the Fate/ universe, and a very satisfying one at that. Especially considering there's going to be more, I'm even more pumped and happy that I saw this. It's underrated and misunderstood. Don't take it as an extension to the Fate/ story directly but an additional bonus to the universe. That way, it'll be more enjoyable. Watch it for what it is, don't watch it as a Fate/ series, in terms of the Holy Grail War.\\n\\n\r\nOverall: 9 \\n\r\nI can't wait for the second season. Give the show a try, I promise it'll be a lot better than what it seems to be, especially if you don't compare it to anything and just watch it as it is.",
            "date": "2014-05-17T17:57:00+00:00",
            "helpful_count": 102,
            "mal_id": 143609,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3671701.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hime-In-A-Box",
                "username": "Hime-In-A-Box"
            },
            "url": "https://myanimelist.net/reviews.php?id=143609"
        },
        {
            "content": "STORY\r\n   On the outside, Fate/kaleid liner Prisma Illya just seems to be a magical girl parody of the Fate series, and in many ways it is. Though, it manages to stand on its own with a story I can take seriously. The story starts off as a monster of the week show, but like any good magical girl show, it deviates from the formula. With focus on the internal conflict with Illya and external conflict with a new character Miyu. Though, I found the two conflicts to be cliche and predictable (Rehash of MGLN). The whole conflicts between rival magical girls and personalmotivation, has been done else where and done better. Although, thanks to the direction of Shin Oonuma, the drama and conflicts were actually enjoyable. With Oonuma directing many drama series before, he knows how to make the viewer care for what's actually happening on screen. I felt emotion for what was happening, whenever the show was being heartwarming, chilling, etc. And I have to give credit for that. Also, the throw backs to Fate lore was very much enjoyed and appreciated. Overall, while nothing new, the story was highly enjoyable.\\n\\n\r\nCHARACTERS *This section contains spoilers*\\n\r\n   The cast consists of mostly alternative versions of their Fate/ counterparts, with there only being two new characters. The magical stick sapphire, and its master Miyu. With Miyu being the only new character worth talking about. Miyu is that typical cold isolated girl you see in a lot of magical girl shows. And, she also goes through the typical development that comes with the cliche. Not saying that's a bad thing, it's just predictable. She grows from a cold person to our main character, then to a nice one. It's that simple. Speaking of our main character, we have Illya. Illya is a character from the original series, and is the only one that has a dramatic personality change. In Fate/Stay Night, she's a cold killer, but is somewhat mischievous to the people she trusts. In this show however, she's a normal girl. Illya a normal magical girl protagonist, but what also comes with this is the typical development. Like Miyu, Illya also goes through a typical magical girl character's development. She's been given a duty she knows nothing of, then she begins to doubt her position in that duty, but in the end she grows to be stronger to protect what she loves. Although, unlike Miyu, Illya's development was refreshing. Illya's internal conflict takes up a lot more time than the average magical girl protagonist. The show made an effort to give her internal conflict real meaning. Illya actually gets inner monologues on her how she really feels about the duty she has been given. And, while I've seen better magical girl protagonists, seeing things done this way was refreshing.\\n\r\n*End of spoilers*\\n\r\n   As for the rest of the cast, none of them really get any development, but are just throw backs at the Type-Moon universe. They're most there for comedy relief, and they do their job. While the comedy isn't Carnival Phantasm funny, it got a few laughs out of me. All in all, with there only being 2 stand out characters, and both only having slightly above average development, the overall characters are passable.\\n\\n\r\nANIMATION\\n\r\n   Animated by Silver Link, the animation is pretty good. With decent use of lighting, the tone the art gives off is a fun lighthearted feeling, with dark undertones. The character designs of the original characters, stay faithful, but they have a bit more cartoon style than their original's. I also like Miyu's out of costume design, for some reason. Though, I notice the character designs aren't always consistent. There's a few times a character would go off model, although that can be forgiven. As for the actually animation, the  regular scenes are standard fare. Though, the action scenes are particularly impressive. The movements are fluid, and combined with the really good directing, makes the action look even more impressive than Fate/Zero's. (Fate/Zero had crappy fight direction, in the first season at least.) Overall, while there were some small dips, the animation is well above average. \\n\\n\r\nSOUND\\n\r\n   Composed by Tatsuya Katou, the music isn't standard magical girl music. The style is more of a mix between F/SN's and magical girl OSTs. This results in some calm slice of life music, and epic battle music. While the slice of life ones aren't anything special, the epic battle ones, are pretty good. I particularly like the Illya version of the EMIYA theme. It's probably my favorite version of it. (Maybe) As, for the OP and ED, I liked them, but I admit they weren't that special. Catchy and that's it.\\n\r\n   As for the dub.... It was a a big meh. It's one of sentai's better dubs, but it's not that hard to be one of the \"better\" sentai dubs. While the acting is okay, the a few of the voices don't match the characters. Illya sounds too old in my opinion and Rin doesn't really have that charm to her voice. I kind of wish they went to bang zoom for this dub, but I understand that they wouldn't make as much of a profit on this show, compared to the F/SN UBW movie. \\n\\n\r\nOVERALL\\n\r\n   I've always liked Type-moon, particularly the Fate/ series. With Fate/Zero being my favorite anime. So, when Fate/kaleid liner Prisma☆Illya got announced, I was a bit \"ehh\" about it. I mean, Fate and magical girls? One part of me was expecting for it to be bad, and another was being optimistic. So, when it actually turned out to not half bad, I was honestly pleased. I seriously enjoyed Fate/kaleid liner Prisma Illya, and I'm looking forward to where ever this sub-series will go in the future",
            "date": "2014-11-08T22:34:00+00:00",
            "helpful_count": 29,
            "mal_id": 167937,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4149187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MeowPower",
                "username": "MeowPower"
            },
            "url": "https://myanimelist.net/reviews.php?id=167937"
        },
        {
            "content": "Do you like loli?\r\nDo you like spin-off anime of excellent series that have nothing to do with said excellent series?\r\nDo you like a show that can’t decide what the hell it wants to be?\r\nThen sit down and watch Fate/Kaleid, a ten episode anime that is full of everything you love about Fate/Zero and Fate/Stay Night, such as hilarious comedy, underaged lesbians, and magical girls. You know, the kind of things fans asked for after watching the main series.\r\nIf you are a fan of the series, I’m sure you’re going to pass Kaleid up based upon the fact it is a cutesy magical girl anime. Iwent into it thinking such, which is why I was so scared after the first episode. I was already debating how a show based on a series that’s pretty adult in tone could appeal to little girls. I went into the series assuming I was going to see a little girl anime. Twenty-seven minutes later, I walked away wondering just who the hell Kaleid was made for. And after ten episodes and the five DVD specials, I’m still scratching my head.\\n\\n\r\nKaleid is about Illyasviel, a young girl who lives in Japan with some adopted family while her mother and father are out doing…whatever. She watches magical girl anime and dreams of becoming one. Luckily, a magical wand/stick/what-have-you hears her and takes her as its master, making her dream come true. But the wand used to belong to Rin Tohsaka, a tsundere who, along with her partner, lost their wands because all they did was fight with each other. The teenaged girls were tasked with collecting seven cards by the Mage’s Guild if they wanted to be taken under the wing of a master magus. So, through the series, the duo of teenagers use a duo of ten year olds to attain their goals.\\n\\n\r\nSounds like it could a kids show, right? Nope! One episode and there’s a gag about penis’s! A few episodes in and the violence is a little more intense than a kids show usually is.\\n\\n\r\nAnd then the realization:\\n\\n\r\nOh God…this show is supposed to appeal to people my age.\\n\\n\r\nOkay, loli porn aside, I can’t fault the series for having Rin Tohsaka. Because seriously, I watched this for Rin. She’s one of the best damn tsundere’s in anime. Her companion, Luvia, whom she always fights with, is less exciting. Exceptionally less exciting. She’s the rich bitch stereotype. She has that “OH HO HO HO HO” laugh and makes fun of Rin for being poor.\\n\\n\r\nIllya is a decent character but her development can be filed under “Basic Hero”. Wishful thinking to “No, I don’t want this” to acceptance to throwing aside her weapons after something bad happens to taking them back when she realizes she’s the hero the city deserves.\\n\\n\r\nMiyu is another stereotype. Quiet and badass entrance to nothing-to-do-with-hero attitude to learning friendship and working together is a good thing to hurting the hero to finally realizing friendship is magic.\\n\\n\r\nAnother gripe, the biggest gripe. What the hell is it? Magical girl, fan service, comedy? It does all three pretty decently, but the problem with the series becomes tonal shifts so fast you’ll get whiplash. One episode will spend half the time making tit jokes and focusing on side characters that have absolutely nothing to do with anything, while the other half will be an intense fight. It has Sword Art Online syndrome. It’s juggling way too many genres and tropes at once and because of that, it’s failing to carve itself a distinctive identity. What we get is a muddled mess.\\n\\n\r\nOne overarching theme seems to be exploiting the female characters. This is an anime for lolicons a la Kodomo no Jikan. It’s pretty shameless in how over-sexualized the characters are. The worst offenses come with the DVD extras that includes a whole portion where Illya is dressed up like a cat and being forced into poses that are…not appropriate for a girl her age. And the magic wand (these things talk by the way) tells us that she’s responding to the desires of the audience.\\n\\n\r\nOh come on! The writer, director, and animators want to blame the viewers for this? We all know it’s a joint venture!  The studio’s getting off just as much.\\n\\n\r\nAnd the DVD extras are bad. Except for Rin in a maid outfit. But otherwise, they’re all useless and more excuses for nudity and sexuality. There’s one where they play strip-Life. The board game. Turned into a stripping game. Eh?\\n\\n\r\nAnd also, there’s a pervasive sense of lesbianism between Illya and Miyu, just to help that image of underaged fap-bait.\\n\\n\r\nI’m bitching a lot about this show, but I did find some decent aspects to it. It’s watchable and less painful than a lot of shows I’ve seen, but that doesn’t change the fact it’s got so many faults. There are a couple awesome fights within, good animation, and great music. It’s begging for fans of the Fate series to watch it but it’s begging for a lot more besides. It’s…to put it bluntly, fap-bait. If you’re into loli, here you go. If you’re not, well, I wouldn’t even touch this series with a stick.  Even if you’re a hardcore fan of the franchise, just don’t. You’ll be a lot happier that way.",
            "date": "2015-05-22T10:54:00+00:00",
            "helpful_count": 21,
            "mal_id": 188454,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188454"
        },
        {
            "content": "Few animes had the impact, drama and downright manliness of Fate/Zero, a Type-Moon production that blew away all my expectations for an anime. With this entry in the Fate series, I went in expecting something big. The bar set by the previous series was huge and I'm not surprised that this fell short (in fact, why even compare the two?) . However, what's here is a solid MG anime with a dash of Fate thrown in. \r\nThe story is told is a very straight forward fashion. Through the perspective of Illyasviel von Eizenbern, the viewer gets a blend of mediocre middle school drama, heart-pounding battlesand a colorful main cast. The plot as a whole is solid, yet a tad predictable and the comedy, especially in the beginning, hits all the right notes. Despite the good foundation and nice twists in the combat, the series suffers from a glaring plot hole three-fourths through the series, when Illya suddenly gets a burst of extreme strength. It's origins do not seemed to be explained especially well in the series. An implied fact perhaps for longtime fans? I'm not sure. Also, I don't entirely understand where the class cards came from, which is another blow to the plot. \\n\\n\r\nThe art of the series is a nice fit, with a clean presentation and colorful special effects. Every magic attack looks both powerful and visually appealing and melee combat has weight behind it. The character designs of Illya, Miyu, Luvia and Rin each fit as well. \\n\\n\r\nThe sound of the series doesn't stick out particularly, but the voice acting is good. The opening is sufficient and the first ending is good. The second ending is better, but not by a lot. \\n\\n\r\nThe characters of this series are mixed in terms of quality. Illaya is, from what I've seen, a 'self-aware MG', as early in the series she questions the very foundation of MG girls. It was entertaining to see her ponder these different elements and these quips kept me smiling and more importantly, interested. Miyu seems like a typical silent girl, but she complements Illya's bubbly personality  well. The pair of Rin and Luvia are good as well, but Luvia doesn't get very much character development. The magical rod twins Sapphire and Ruby are more comic relief than anything, since their attempts to move the plot are usually clouded in with their own humor which gets old very quickly. All the other characters, however, fall by the way side. I don't remember any of the classmates and the other residents of the house seem quite one dimensional. \\n\\n\r\nEpisodes seemed to be dragged out, which made this 10-ep series seem much longer. However, the quality was consistent and the series had great action scenes. The fan-service was a bit awkward, since the the two main girls are 12(?) year olds,  but luckily it wasn't too frequent. This is anime comfort food. Those who hate MGs need not apply, but if you like Fate or just want an anime that doesn't require you to think too hard, this is a series to watch. \\n\\n\r\nOverall, this is a good anime. The plot suffers from holes but keeps you interesed, the sound doesn't do anything special but gets the job done and most of the characters are shallow but the ones that matter are good. The art is truly exceptional. This series showed that even MGs can be pretty cool when you slap the Fate label on them.",
            "date": "2013-12-15T15:42:00+00:00",
            "helpful_count": 21,
            "mal_id": 123979,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3406621.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LilGreasyKid",
                "username": "LilGreasyKid"
            },
            "url": "https://myanimelist.net/reviews.php?id=123979"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nWhen people think of magic in relation to the fantastical, people think of wizards, spells, and all-powerful incantations. It's something that doesn't exist in the real world, as much as we would like it to be. \"Magical girls\" take it one step forward. On top of the magic, they also include transformations, cute girls, and life lessons. In Fate/kaleid liner Prisma☆Illya (what a name!), these common tropes are found once more.\r\nSTORY\r\nF/k (I need to shorten the name at this point!) starts by having our main character, Illya, one day encountering Ruby, a magical stick that gives Illya thepower to transform into a mighty magical girl.\\n\\n\r\nRight off the bat, it's important to understand that the world behind F/k is not original. That is, F/k is a spin-off of the ever popular Fate/Stay Night and Fate/Zero setting. F/k can essentially be viewed as this alternate timeline in which F/SN and F/Z's characters never participated in the Holy Grail War. Already this alienates people from the series. If you don't know the characters, the original world, or the lore behind everything, it makes the show harder to watch. This isn't to say that someone should refrain from watching F/k if they have yet to see the other two, but you are not getting the full experience otherwise.\\n\\n\r\nF/k mainly explores two separate themes: facing your fears and \"the power of friendship.\" Talking about the first one, both Illya and Miyu face these issues but for different reasons. Illya is a girl who is thrust into these scenarios despite not fully investing herself into what is happening. She's more outgoing and emotion-driven. Contrarily, Miyu joins the fights not because she wants to but because she has to. She's reserved and quiet. F/k did a nice job of creating this dichotomy between the two to represent where they were coming from and what makes them face these incredibly dangerous situations.\\n\\n\r\nThe second part, \"the power of friendship,\" is quite common in anime. It's prevalent here as well. While the story itself contains many battles, its real focus is on the development of the relationship that Illya and Miyu have. Again, this goes back to their backgrounds and motivations, and through these they learn to accept one another for the different people that they are. This idea isn't the most perfectly executed version of this trope, but for the most part, the show does an okay job of having the girls go through the ups and downs of a budding relationship.\\n\\n\r\nANIMATION\\n\\n\r\nFate/Zero is highly lauded due in part to its animation and art quality. F/k, surprisingly, is of no exception. While watching the show, I could have sworn that ufotable (the team behind F/Z) had also worked on F/k.\\n\\n\r\nBeginning with the art style, the show does a great job of varying up the locations. They stick to the more famous ones, and as someone who knows about the world, it was nice seeing the same landmarks again. The lighting in the show is also very well done. The nighttime scenes and general lighting on the characters always seemed rather high in quality.\\n\\n\r\nF/k's greatest feature is definitely its animation. It is rather spectacular at times. One of the things that surprised me while watching was the heavy amount of detail that went into the fight scenes. They were very, very good right up until the end. The sparkling shots, the dense mana shields, and the amount of movement and choreography included in the show was quite pleasing to watch. I did not expect such detail when watching a \"Fate-universe spin-off,\" so what I got to see was rather amazing.\\n\\n\r\nThe character designs are \"original\" yet true to those of the characters from the Fate universe. Everyone's most striking characteristic were their eyes. They have these nice mix of colors and \"punch\" to them that makes them stand out. This is especially true for Illya and Miyu. When they are looking at you on-screen, you can't help but fixate your eyes on their's.\\n\\n\r\nCHARACTERS\\n\\n\r\nF/k has roughly four main characters that are looked at: Illya, Miyu, Rin, and Luvia.\\n\\n\r\nI'll start with the weakest. Rin and Luvia are introduced quite early and display their personality and rather violent relationship with one another from the get-go. Afterwards, they become more like guides than actual characters. You don't learn much about them other than what purpose their mission serves. I would have liked to have seen more background on them, and more specifically Luvia, but since they weren't the main focus, I was left with what I got.\\n\\n\r\nIllya is the star of the show. She's optimistic, cute, funny, and caring. She dreams of being a magical girl and this wish gets granted. However, she learns that there is more to it than just having fun and using magic. It's something that helps to test her ability to move forward despite the hardships that she encounters. She takes for granted the abilities she earns but eventually understands and accepts that her position is special, that it is not something that should be taken lightly.\\n\\n\r\nThis revelation is thanks to Miyu. Miyu is stalwart, smart, and athletic. She's very determined and focused on her objectives. So much so that her behavior often causes others to misjudge her as being standoffish when she is actually quite lonely. It's this loneliness that has compelled her to always try and do things her own way. But much like she did for Illya, Illya allows Miyu to see that being together is going to be much more powerful than being alone any day of the week.\\n\\n\r\nThe characterization here for both of the magical girls is somewhat plain. It's nothing out of the ordinary. Instead, it is probably quite cliche. But as I mentioned previously, the show does a good job of creating this dynamic between the two that allows them to go from simple partners to extremely close friends.\\n\\n\r\nBeyond Illya and Miyu, the rest of the cast is rather weak. We get to see some cameos from big names, but they don't do much other than provide comedic relief or proper advice.\\n\\n\r\nSOUND\\n\\n\r\nThe OP, like the girls, is quite magical in the way it sounds. Unfortunately, it isn't that good. It's too generic in its rhythm to be anything worth really listening to. The ED is rather upbeat and mirrors the happy nature that is Illya's and Miyu's relationship. However, again thanks to a rather generic beat, it's not that good. In fact, after listening to the two, it sounds as if both use the same percussion piece.\\n\\n\r\nThe soundtrack is harder to talk about. It contains pieces that are both quite fitting for the situations at hand and somewhat absurd/silly in the way they sound. Meaning, it's a mixed bag of both good and bad.\\n\\n\r\nVoice acting is average in the show. However, they do use the same actors/actresses from the Fate anime universes in here as well. This was a nice touch, and I thank the creators behind F/k for doing this.\\n\\n\r\nAs a final note, one of my favorite sounds in the show was Miyu's \"flying.\" I found her technique not only cool but with the added sound effect it made it pretty awesome.\\n\\n\r\nENJOYMENT\\n\\n\r\nMagical girl shows almost always end up the same way. The girls become magical, they have fun, they experience hardship, then they unite to conquer evil. F/k pretty much follows this same pattern. It's never really funny or dramatic, so I never found myself laughing or being invested in the characters.\\n\\n\r\nAbove all, what F/k does best is its battles. They are quite a feast for the eyes with their multitude of colors, the actual movements involved, and the interesting abilities used throughout. But when the show is not having the girls battle, it's rather boring. The story itself isn't captivating and the characters are not good enough to make me care for them. Plus, I found Ruby and Sapphire to be kind of annoying during the show.\\n\\n\r\nFate/kaleid liner Prisma☆Illya is a common magical girl show that has great battles hidden beneath its surface. I think that without the Fate universe backing F/k, it would not be as well-known as it is today. This may be an obvious statement, but if that is its main draw, that is an unfortunate and sad fact.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, magical girls with the \"Fate\" world as its setting\\n\\n\r\nAnimation: Great, great art with stunning animation\\n\\n\r\nCharacters: Fine, Illya and Miyu fit their magical girl roles\\n\\n\r\nSound: Bad, nothing notable except for returning VAs and sound effects\\n\\n\r\nEnjoyment: Fine, good battles but not much else\\n\\n\r\nFinal Score: 5/10",
            "date": "2014-10-03T05:24:00+00:00",
            "helpful_count": 17,
            "mal_id": 163387,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=163387"
        },
        {
            "content": "I hated, and didn't watch, Fate Stay Night because of how much Shirou sucked; being the usual self-insert male lead who doesn't have much skill and is at the mercy of the lot of females herein.\r\nI wanted to beat the crap out of the douche bags responsible for Carnival Phantasia because it made Shirou (and whoever else is a male) even more pathetic.\r\nThen comes a \"magical girl spin-off.\" Rather than climb up the steep hill of \"making [Shirou] likeable for the audience outside of Wapan,\" Type Moon pulls this stunt and takes the easy way out by catering to the pedophiles. I mean... DAMN.\r\nLyrical NanohaStrikers atleast had the bravery to flip the skirts of, and gave nekkid transformations to, the older Nanoha and her associates. You'd think it wouldn't kill Type Moon to do the same to Rin, Luvia, et al and prove that they're not just for the sake of the slobbering otaku-base.",
            "date": "2013-11-29T12:42:00+00:00",
            "helpful_count": 11,
            "mal_id": 121755,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=121755"
        },
        {
            "content": "As you might have seen in the summary for this anime is that it is a spin off set in an alternate reality which illya and her parents are a family and Shiro is her cousin who frequently visits to check up on her as well as cook and do some house work.  the series also has other characters from the fate series such as Tohsaka Rin and the epic heroes from both fate/stay night and fate/zero. \r\nNow on with the review.\r\nStory\r\nWhat makes this different from other magical girl series is that there is no mascot animal that goes around and recruits female heroes.Instead, the magical wand who has a mind of its own with human personality and everything goes around to find the most suitable candidate to become a magical girl. After the girl is chosen, they are given the task of capturing the seven epic hero class cards that reside throughout the city in a mirror dimension. After capturing these cards the girls will be able to use their power as equips to transform their wand into a weapon similar to weapon the epic hero was carrying. For example if they use the lancer card the wand will turn into a lance and it will have the same abilities that lance has.\\n\\n\r\nAfter watching a few episodes, one might feel that this is just an attempt to milk the popular fate series for a quick buck but the story does get better and more serious as it goes on and becomes more like the fate series we know and love. It also has some epic battles in there that you might want to see more than once. I can understand if someone only watches a few episodes and drop it then say bad things about it but if you continue to watch, you will be rewarded. After seeing the complete series myself all i can say is that I recommend any fate series fan to watch it and I'm looking forward to season 2. Please bare in mind that this season does not end like fate/zero did with a cliff hanger ending at the first season but instead it ends after they have defeated the last boss.\\n\\n\r\nSound\\n\\n\r\nThe sound was great and I enjoyed the new version of the famous Emiya theme from the fate series. Though I wish i heard it more during the series and at the final battle as well. \\n\\n\r\nCharacters\\n\\n\r\nThe characters personalities were the same for Tohsaka Rin and Illya's mother in this series but it is different for Illya. The Illya in this series is a very nice little girl like you would normally see in other magical girl anime but the saddist side of her is in their somewhere deep inside. The magical wands especially the one illya uses is very annoying but you will get used to it if you keep on watching.\\n\\n\r\nEnjoyment and conclusion\\n\\n\r\nAt first i did not enjoy this series because of the idea that this is just a cash grab and the annoying wand that illya uses but as i continued to watch the series, it began to turn into a typical fate series with epic and serious battles. I really enjoyed this series and I recommend all fate fans to give it a chance because the normal fate series is finished and a spin off is all they can do to keep fate alive.",
            "date": "2013-09-21T11:33:00+00:00",
            "helpful_count": 11,
            "mal_id": 113673,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1314295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/divinehand125",
                "username": "divinehand125"
            },
            "url": "https://myanimelist.net/reviews.php?id=113673"
        },
        {
            "content": "when I first saw Fate/kaleid liner Prisma Illya as being a newcomer to the Fate/ universe I wasn't expecting much but oh boy my expectations were blown away the minute I hit play.\r\nThe story has a magical girl vibe where you make a contract to fight evil and become magical girls but keeping true to the Fate/ universe and its lore with most of the enemies Illya, Miyu, Rin and Luvia fight make up the 7 classes of servants from the Holy Grail War. all in told the story is great and the pacing is spot on as everything flows really well.\r\nThe art is beautifulto look at as the background looks pretty and the fight scenes in the parallel world are fluid and amazing to watch even the character designs are beautiful.\\n\\n\r\nThe sound design is amazing from the music to the minor sounds even the voice acting in both the dub and sub is good to an extent.\\n\\n\r\nCharacter development in the show has it's ups and downs but the one character I liked throughout the show was Illya as she had a lot of character development over the course of the anime where she was tricked to becoming a magical girl to realizing that she can die and stepping away from fighting at one point to realising that she can help everyone especially Miyu.\\n\\n\r\nOverall Fate/kaleid liner Prisma Illya is a great anime to watch especially if you are new to the Fate/ universe like me cause you can just appreciate it for what it really is :)",
            "date": "2015-02-23T17:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 181089,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4016289.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MRN3",
                "username": "MRN3"
            },
            "url": "https://myanimelist.net/reviews.php?id=181089"
        },
        {
            "content": "Fuck me, I’m two years late to this review. Oh well, it’s not like anyone will read my review anyway.\r\nFate/Kaleid liner Prisma Illya is a spinoff series of the popular “Fate” visual novel series. This show adopts a satirical take on the popular “Magical Girl” genre of shows with the well known Fate characters thrown into the mix. It aired in the Summer of 2013, adapted from the manga series of the same way.\r\nMy first experience with this particular series was a popular clip of two young girls clad in typical magical girl outfits making out, complete with close-ups of spit-swapping as another girl watchesalong clearly in a daze. Such a titillating scene, contrasted with such young age of the protagonists had me raising my eyebrows for a while. Subsequently, I caught whiffs of controversy surrounding this series, some claiming it to be “lolicon” pandering, specifically trying to attract individuals using subjects who are underaged and may or may not be portrayed in a provocative manner. This controversy surely cannot be left untouched, said, knowingly two years late to this anime, and off into this show I went. I must disclose that I am not a lolicon as previously stated.\\n\\n\r\nWhat greeted me first was the overly-experienced, overly large and detailed eyes of the main characters. Illya’s eyes were bright pink, common to anime, and drew my attention right away. Yes, one might be quick to point out that eyes have and have been always drawn in ridiculous proportions. Yet, I must emphasize that eyes drawn in such a manner, pupils more than whites, deeply engrossing, was a rather enjoyable aspect of Fate/Kaleid’s visual design, indeed reflective of the saying that one’s eyes are the windows to the soul. Still, it is such a pity that such well designed eyes act as the windows to such a poor and uninspired character, our main protagonist, Illya. But we shall get to the characters later.\\n\\n\r\nTo begin with, the story and setting takes place in normal. modern setting (I assume Japanese), and spirals into a cliche magical girl plot. Experienced watchers know, a girl makes a wish for the unexpected, for the excitement in her life, and suddenly a magical stick shows up and forces the girl to become her master without her consent, very much with Illya in disagreement. Here, I must the show pulls a twist that has become rather mainstream to the post-Madoka era of magical girl genre, which has become rather moot by now, I feel. But, for this small twist to an overused trope, I shall give some merit to the show. Then, the girl, imbued with whatever great magical powers goes off to collect cards, fight and make friends along the way. Cue the boss fights, magic visual effects, the power of friendship and so on. Typically, I would have little qualm about these tropes writers adopt for their stories, but for Fate/Kaleid, the distinct lack of polish or refinement to the settings, tropes it borrowed, makes it mediocre, run-of-the mill, filler with Fate glued on. Another show I would like to compare it to would be Yuuki Yuuna is a hero, which implements very much identical tropes of friendship, struggles, but does so more elegantly, more enjoyably. Thus, the story and setting could use a bit more creativity or refining.\\n\\n\r\nOn the visual side of things, Fate/Kaleid liner Prisma Illya does have plenty to offer. Studio Link may not be the most popular or well known anime producers, yet, they have experienced staff who are very much capable of providing punchy visuals when it wishes to. Characters are designed with strong presence, very much maintaining the  attention of the viewer on whoever is in the scene. One stand out was a particular fight scene I would not name, for fear of spoilers, but this one fight had em sold on the capability of Studio Link. The movement was fluid, every action had substantial impact and gave a very solid feel to the whole sequence. It was as though Link tried to imitate Ufotable’s style, Ufotable being the studio being closely associated with the Fate series. In anycase, it was rather well-done, and future shows could benefit from such effort put into its action scenes here, this sequence exceeding far beyond my expectations. Throw in some light visual humor, regarding Rin parading about in a Magical Girl outfit she’s too old for, and the show comes out with above average for its visual style, with the aforementioned fight scene and the design of the character’s eyes being a standout for me.\\n\\n\r\nThe characters, they are another issue for me. I feel they really drag the show down. GOing into the first season the show provides characters with paper thin motivations and generally made the narrative less compelling, to the detriment of the show, to say the least. Each character has the personality of their canonical counterparts with a few quirks thrown in, Luvia’s arrogance to Rin’s inferiority complex, yet lacking anything else. This leaves the show feel hollow. Any form of driving force is hid behind the mysterious “Mage's Association”, a mysterious cabal seemingly directing most of the actions taken in the series. I could go on, but I want to focus on Illya now. She flip-flops around, very truly lacks motives behind her actions apart from the superficial ones that she casually states at a convenient timings, and suffers from doing things “just because”. She could have been more well written to reflect emotional depth, anything to show temperance within the shallow pool of her personality. Apart from that, an airheaded demeanour really does not sell her character for me. Such a shame, she had such pretty eyes.\\n\\n\r\nIt might strange to hear this, but this is actually my first experience with the Fate series, spin-off be it may, and yet I still found the portrayals of servants, masters, mages engaging, and found myself recognising the well known characters of the canonical series. Some may scream heresy at my statements, but I feel that for a spin-off, this series still pays homage to the original series, where even an outsider can recognise the parodied portrayals of its characters. That is to be respected, for a series to remain faithful to its source.\\n\\n\r\nIn all, this show merely rehashes the same tropes and points from the “Magical Girl” genre, while using Fate characters to carry out the same plot we have seen too many times. Perhaps it is the lack of runtime in its 10 episode length, or it could be a cash-in to milk fans for their money, we will never know, but what we were presented with was far and away the best that such a combination could offer. Turn to this show if you have spare time, or wish to see get more Fate, albeit in a parodied sense. Magical girl fans will not be too satisfied with this show. I know I wasn’t.\\n\\n\r\nLastly, the “lolicon” accusations. Overall, I found this show to be rather light on the fanservice. Sure there was some provocative scenes, but it was not to the point of being highly contentious or objectionable. These scenes helped to interject some life into the series and made it somewhat engagin even as side gags. \\n\\n\r\nOverall: Not Lolicon/10\\n",
            "date": "2015-09-25T09:09:00+00:00",
            "helpful_count": 9,
            "mal_id": 199540,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3871129.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Alden_Tarkus",
                "username": "Alden_Tarkus"
            },
            "url": "https://myanimelist.net/reviews.php?id=199540"
        },
        {
            "content": "For someone who watched other Fate series, Fate/loli might seem like a joke. While it's partially true, there is much more to this anime that makes it stand on its own.\r\nBeing a mostly comedic spin-off, Kaleid doesn't go to deep with a story. Synopsis is pretty much all that happens in this anime plot-wise. \r\nBut being simple doesn't mean being bad. Prisma☆Illya manages to keep perfect balance between comedy and serious moments. You won't experience out of place comedy nor forced drama. Both comedy and drama are of high quality: jokes are funny and feel good. Drama doesn't annoy viewer, is easy to understand andfeels natural.\\n\r\nAction scenes are also really good. They give you the right feeling of urgency and uncertainty with their speed, angles, music and flashiness.\\n\r\nWhile story has serious moments, some blood and fight for life, I'd still say it's generally light anime. Don't expect tragic developments from other Fate titles.\\n\r\nAnother small detail worth mentioning is magical girl genre deconstruction. No, not Madoka-style one. Just some small remarks that add to comedy but also point at some self-awareness of characters and story.\\n\\n\r\nThe strongest part of Fate/kaleid are characters. First thing you will notice is that they are surprisingly (for anime) intelligent and not naive. Their actions are mostly logical and emotions are natural. Outside of some comedic moments, they behave normally, without making you irritated with some weird fails just for plot progression. \\n\r\nAnother thing about characters is that they are deeper than having just one defining trait. You can see other sides of their personalities. They develop.\\n\r\nThing that really plays nicely with characters is art. Their design, animations, voice acting and especially facial emotions are all great and give them yet another dimension.\\n\\n\r\nI think I could recommend this anime to majority of anime fans. It's nowhere as niche as I expected.\\n\r\nI came here for loli fanservice and stayed for... other loli stuff. While fanservice part wasn't as good as I hoped (I heard it gets there in later seasons), I absolutely fell in love with characters and don't regret watching Fate/kaleid.",
            "date": "2017-09-10T01:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 257226,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4251395.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yukikaze_sama",
                "username": "Yukikaze_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=257226"
        },
        {
            "content": "Aight so Fate/kaleid liner Prisma☆Illya is the most dope anime I have seen so far in my life. This is the best out of all the Fate/ series. If you are thinking hey isn't this just a fan service show just like Carnival Phantasm? If you think that way I am sorry but you should get checked for brain damage because this show has everything you could ever want and more. The show contains the best girl from the Fate/ series Illya in a main character role and also she is a magical girl. Other Fate/ characters make appearances but they don't really matter atall. If you like action this show has it for you. If you like moe moe goodness this has it. If you like drama this show has it. There is nothing this show can't deliver. It is a perfect masterpiece 10/10 no other anime can compare. \\n\r\nTL;DR Best anime in existence watch it.",
            "date": "2015-01-08T23:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 176955,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1188757.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jmzmeaney",
                "username": "jmzmeaney"
            },
            "url": "https://myanimelist.net/reviews.php?id=176955"
        },
        {
            "content": "[This review will not contain spoilers]\r\nWell, for starters I must say I did not enjoy this anime but I will give credit where credit is due.\r\nI don’t the the whole idea of sexualizing some little girls into this extend (so many lower angle shots and other stuff that made me cringe) or the whole magic girl idea that Japan seems to like for whatever reason. I must say that I watched this because some Fate/ fans friends told me that 3Rei was good and was worth watching the previous seasons first (I’m still to check that for myself).\r\n[ Story | 6 ]\r\nThe story, for me,is boring. Plain and simple. I don’t find joy in watching some “magical girls” over moe-fied to funny stuff while fighting the evils of the world. Leaving that aside, the plot is WELL CONSTRUCTED. Why do I say with this? The mechanics are based of facts already used in the main Fate/ franchise, like the origin of the Kaleido sticks, servants, dimensions od, mana, prana, and some other things. Those resources were used to create this universe and this story that while I find boring and not in my taste at all, I won’t deny the author did a good research and documented well before writing, and that’s always a good thing. You know, to keep consistency even if we are talking about an Alternate Universe (AU).\\n\\n\r\n[ Art | 7 ]\\n\r\nThe Animation is good. It has some flaws in some frames that do not move smoothly but overall is a good animation. I do not like the art-style tho, at all.\\n\r\nThe use of FX is great, you know there’s a lot of lights and explosions going around.\\n\\n\r\n[ Music | 7 ]\\n\r\nThe best part of it, the music. Good OST, the music used for fights was really good. And inclusion of classic tracks like EMIYA make the music get a better rating, even when they are from FSN originally. I don’t say the same for the OP and ED that I didn’t like at all. (Would give it a 6)\\n\\n\r\n[ Character | 3 ]\\n\r\nYeah… this is weird… I like Illya, Rin and who else but in the real Fate/ franchise. This “Illya” tho… I don’t consider her Illya, but a character that looks like her in this AU. She doesn't have the qualities that made me like Illya in the first place, in fact, I highly dislike this Illya and almost all the characters. Same goes with Rin, just a shell of what she really is, I only see a over acted tsundere shell.\\n\\n\r\n[ Enjoyment | 4-5 ]\\n\r\nToo much stuff that I didn't like, while the animations are pretty is not enough for me to enjoy an anime. I can understand and accept that people may like anime like this but, this doesn’t seem to be something of my taste. Random power ups, sometimes ignoring principles already stated, lack of real character development.. fanservice on little girls…\\n\\n\r\n[ Overall | 4 ]\\n\r\nFor me, my rating is 4 (Bad) to 3 (Very bad). While I said that the plot has bases and the author documented to write its story, I still didn’t enjoy those 10 episodes. There were episodes better than others but for the most part I watched each episode with cringe or a serious expression. It was not something I would rate with 5 (average) or more since I didn’t enjoy the anime.",
            "date": "2016-07-26T12:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 225066,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4983061.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HumbertoZero",
                "username": "HumbertoZero"
            },
            "url": "https://myanimelist.net/reviews.php?id=225066"
        },
        {
            "content": "Quick Review.\r\nStory:\r\nDecent story derived from Fate/ series. Collection of cards by magical girls.\r\nNot deep by any means but works for the series and the fact that they keep it at 10 episodes actually helps. The pace was quick which worked for it.\r\nArt:\r\nGrade A++. Phenomenal artwork, animation work. Gorgeous lighting.\r\nSmall things such as the refracted lighting, glow of the outlines, beautiful backdrops; just really, really skilled execution in the art section. Principles of animation used often and successfully gives personality to the characters (squash stretch, pose-to-pose, etc). Effects are corful and fun.\r\nThe quality of art made this series fun to watch.\r\nSound:\r\nGood music. Loved the opening andEDs. Mood music set the mood right.\\n\r\nLove the piano work. It's subtle but fits in well with the slower sections of each episode.\\n\\n\r\nCharacter:\\n\r\nDecent character development. Not fully developed as there are more seasons to come. But, good start. Typical magical girl anime character development. Drama ensues. Lots of crying. Lots of good feels too. Also some etchy but not too much.\\n\\n\r\nEnjoyment:\\n\r\nFun to watch. Fate/ references and cameos welcomed. \\n\r\nAnimation and effects top notch.\\n\\n\r\nOverall:\\n\r\n9. Fun to watch. \\n\r\nDon't expect a deep series. But expect to enjoy it since it is short and fun.\\n\r\nAlso if you watched the Fate/ series, you'll enjoy the twist on each character.\\n",
            "date": "2016-09-02T18:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 228141,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56564.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xdzzz",
                "username": "xdzzz"
            },
            "url": "https://myanimelist.net/reviews.php?id=228141"
        },
        {
            "content": "Where Fate/stay night meets Cardcaptor Sakura in a more kickass fashion.\r\nFate/kaleid liner Prisma Illya is a spin-off of Fate/stay night set in an alternate universe where Illyasviel von Einzbern is a magical girl. While it is directed by the same director as C³ - which was never really sure of what it wanted to be - Fate/kaleid knew exactly what it was and never tried to do anything else. It is a magical girl anime through and through and I wouldn't go into this expecting anything more.\r\nThe story is told in a simple, straight-forward fashion. It doesn’t take itself too seriously. It doesn’t try toohard to be deep and meaningful. Some may argue that this makes the story is predictable. Yes, we all know how it's going to end - with good guys triumphing over the bad guys - but the part we're all really interested in is the filling of the sandwich, and that’s where the length of the series comes in. 10 episodes has its advantages and disadvantages. On one hand, it is fast paced and there are no fillers. However, on the other hand, it lacks detail in the story. In the case of Fate/kaleid, I think it could’ve done a lot more with just 2-3 more episodes but it finished well and doesn’t leave you expecting more or questioning anything.\\n\\n\r\nWhile the series doesn’t have the same darker, more serious atmosphere that Fate/stay night and Fate/Zero do, the episodes were a good mix of action and comedic moments. The action scenes were well played out and not always entirely predictable.  I found the comedy enjoyable for the most part, but at times the dialogue felt forced. I did enjoy the comedic elements surround the Illya x Yuri ship. There was ample fanservice present for those who are interested but at times it felt extremely tacky and awkward, especially considering the age of the main characters, but if you’re into lolis… well… \\n\\n\r\nThe first thing I noted about the main characters is that they are all female. Shiro is very much a background character in this. Illya’s cheerful personality made her an enjoyable lead for the series and her naivety added to the comedy. Miyu was a good compliment for Illya; initially a cold and distant high achiever but gradually warms up to Illya. Rin returns as her beloved tsundere self, although her rivalry and constant bickering with Luvia became rather tiresome at times. The Kaleido Sticks are more for comedic relief than anything else. All your favourite Heroic Spirits also feature in the series. The story isn’t made for character development but the set of characters works well for the purpose. \\n\\n\r\nVisually, this is no ufotable adaptation. However, that’s not to say it didn’t look good. The colours and backgrounds were gorgeous. The character design wasn’t particularly detailed but the outfits fit the magical girl vibe. I thought the action scenes were particularly well done and on par with something out of Fate/Zero. The motions were fluid and the special effects were appealing. The scenes were really brought to life. A quick search of the animators revealed some of them worked on series such as FMA:B, Shakugan no Shana and Star Driver. \\n\\n\r\nI didn’t always notice the background music but I found it perfectly complimented the action scenes and amplified the intensity. The OP and ED themes were enjoyable and suitable for the genre. The voice actors portrayed the characters really well. It was nice to see the VAs for Rin and Illya return. Kaori Nazuka did an immensely better job as Miyu than the last role I heard her portray, as the Heroine in Amnesia. \\n\\n\r\nOverall, Fate/kaleid is by no means radical or ground-breaking but it is a cute, fun and exciting magical girl series. I am a fan of magical girl anime and would definitely recommend this to anyone who is also a fan of the genre. It will really appeal to the niche audience but if you're not a fan of the genre, this will do little to change your mind. For fans of the Fate/stay-night franchise, it is entertaining to see some of your favourite characters in an alternate universe and it is a good quality production but don’t expect a similar serious, dark atmosphere.\\n",
            "date": "2014-04-11T08:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 139549,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/388883.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendaryGirl-A",
                "username": "LegendaryGirl-A"
            },
            "url": "https://myanimelist.net/reviews.php?id=139549"
        },
        {
            "content": "I originally rolled my eyes when I heard about this. Fate/kaleid. A magical girl spinoff to one of my favorite anime franchises, the Fate franchise. While Fate/kaleid is not the first magical girl spinoff (that award goes to Nanoha, I believe), the Fate franchise is really really popular, and TYPE-MOON seems to have all intention of milking it out for as long as they can. So I came into this show expecting a happy-go-lucky magical girl show that would be little more than fanservice.\r\nBoy was I wrong.\r\nFate/kaleid tells the tale of Ilya. Unlike in the original Fate, Ilya has lived a perfectly normal life sofar and is just your typical girl. One day however, a magical girl staff comes crashing through her window when she's taking a bath and forces Ilya to become a magical girl. You see,Cards are messing up the lay lines or something like that, and originally the magic association sent two girls, Rin and Luvia, to capture these cards. However, Rin and Luvia hate each other and argued all the time, so the staffs ran away and picked new partners. And so, Ilya must fight the Heroic Spirits defending these cards alongside fellow magical girl Miyu, with Rin and Luvia helping the both of them out a bit.\\n\\n\r\nListen. Just because Fate/kaleid stars a bunch of fluffy magical girls does not mean it's all light and fun here. Fate/kaleid is more of a drama than a comedy. I'll even call it a deconstruction of the genre. Ilya and friends get hurt often and nearly die more than once. Ilya is forced to face exactly why she wants to become a magical girl and she realizes that's it's not all fluffy like shows on TV. And it deconstructs it perfectly, compared to another magical girl deconstruction (cough) Puella. The drama Ilya goes through feels real, expect one plot point I'll discuss later. \\n\\n\r\nAnd listen. Just because Fate/kaleid stars a bunch of magical girls does not mean that it can be freakin' badass when it wants to be. These battles are just a joy to watch, I'll even put them alongside Fate/Zero's battles, and those are amazing. The animation during these scenes get way better, they play a little epic track that's more or less a wannabe Yuki Kaijura that actually works, and the choreography is amazing. Due to the fact the danger is real this show, there's also a sense of suspension. Sure you know no one's going to die (dark one or not, this is still a magical girl spinoff), but it is still awesome.\\n\\n\r\nHowever, there's the category of the characters. My Rin's still Rin (I always forget how much I love her until I see her in action), and the two new characters, Luvia and Miyu, far nicely. Sure Luvia can be a little annoying at times and Miyu your typical mysterious emotionless transfer student who's perfect at everything but yet has problems making friends, but they're still fine. But Ilya? … Now, when creating spinoffs, an important factor is to keep your characters the same as they were before. Sure they're obviously going to be slightly different, but they still need to have a resemblance of the original in them. This Ilya is no way like the original Ilya however. While it does make sense as without her dark past, Ilya has no reason to become the half-insane “Bah-sah-kah, kill them!” girl we all know and love, I still want a little of that girl in there. However, this Ilya is just your typical magical girl heroine. Nice, a little shy, everyone loves her despite her mistakes... Aka, dull. \\n\\n\r\nAnd then comes the second problem with Fate/kaleid. It can get too dark. Now, I love darkness with a burning passion, but there is a difference between drama and forced drama. You all know the type of episode where the team splits up due to some trivial argument and gets back together at the end? Yeah. Well, Fate/kaleid has a whole arc of that. And it is so badly written. To put it simply, everything just goes bad for Ilya and she more or less loses her confidence she's gained as a magical girl due to the fact one of the characters decides to says she hates her, for a reason that does make sense but is originally done in such a terrible way. She then spends the episodes until the arc is over moping around and being so sad, I almost felt like crying. I mean, if you're going to make Ilya your typical girl, then give her a happy life. Let us see the normal Ilya. However, with the whole darkness of the show, I began to wonder, isn't there just one timeline where Ilya can be happy? This whole arc is horribly done and is pulled out in a way that makes no sense and is ended so easily (hey, at least we get to see a cameo from a Zero character), it almost made me want the happy-go-lucky magical girl spinoff I was expecting over some dark Puella ripoff (okay, the manga did come before Puella, but still). \\n\\n\r\nNow, the animation... I hate it. The animation is fine, but these have to be some of the ugliest character designs I have ever seen. It looks terrible. They were obviously trying to go for the overly cute and moe look, but I just cannot look at it. The lips are animated weirdly, all of the colors are so light, the hair and skin seems to glow, the eyes are weird, it just looks terrible. Some of the characters barely look like their original role. While things do look a little better in the gloriously animated action scenes, in the non-action scenes, it's just not pretty. The music, like I mentioned above, is rather awesome, with really epic tunes playing during the battle scenes and more relaxing, happy tunes playing during the non-battle scenes. The voice acting is also nice too. Expected though, considering most of these seiyuu have previous experience in their characters.\\n\\n\r\nDespite its flaws however, I just couldn't help but really enjoy Fate/kaleid. It was neat to see all of the characters I love in a new setting. And you don't even have to have any previous experience in the Fate franchise to enjoy this. You'll just miss some of the in-jokes. Fate/kaleid is a fun show, and I give it 8 out of 10 stars, though if it wasn't for the Fate name on it it would probably be 7. TYPE-MOON's plan worked apparently. I recommend this to any TYPE-MOON and magical girl fan. There's also going to be a season 2 coming out this winter, and I am looking forward to it.",
            "date": "2013-10-03T18:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 115291,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1523035.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Fujaku",
                "username": "Fujaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=115291"
        },
        {
            "content": "Whenever we're talking about Type-Moon's FATE SERIES, it's like we're talking about Mercedes-Benz. It's always about the quality, the execution of elegance, the prowess of what they're doing, and the legacy. In a one-word layman's term, it's the awesomeness.\r\nCompared to my previous reviews where I was talking about Lexus, Hyundai and BMW as metaphors and analogies for the anime that has nothing to do with cars, in Fate/Kalied Liner Prisma Illya (or Prisma Illya for short), I've got a definite reason of talking about Mercedes Benz--it's because Irisviel's sports coupe that Kiritsugu bought for her is the Mercedes-Benz 300SL!\r\nAnd the 300SL is the pioneering-gullwing Mercthat is as legendary as the Excalibur. It's like Saber with gullwing doors and headlights: agile, powerful, and considered as one of the most outstanding timeless cars with excellent ratings in all categories.\\n\\n\\n\r\nSTORY: 7\\n\r\nIn FATE series, you could say that if Fate/Stay Night is the Mercedes-Benz 300SL, then Fate/Zero has got to be the Mercedes-Benz SLS-AMG. Fate/Zero is just pure and ravishingly wicked and it's Urobuchi outdoing himself the same way that Mercedes-AMG has outdone themselves with creating the SLS-AMG. It's how Fate/Zero is the sacred predecessor of Fate/Stay Night in the same way as the SMS-AMG is the spiritual successor of the 300SL.\\n\r\nAs the SLS-AMG is the Holy Grail of the Mercedes-AMG, the Fate/Kaleid Liner Prisma Illya is, however, the Mercedes AMG-GT. Yes, it's Merc and yes it's AMG, and it's fast, but it's like a Mercedes-AMG but isn't. Prisma Illya is pretty much taken as that. You expect the FATE trademark and quality, and somehow you get a spin-off of a main-antagonist-turned-protagonist-turned-magical-girl. Yet, like the AMG GT, it's Mercedes-Benz and AMG under the bonnet and quality after all, in the very same way that Prisma-Illya still is part of the FATE series.\\n\\n\r\nThe story centers on Mai Kadowaki's ever-renowned character, Illyasviel Von Einzbern, the Teuton violet-clad Japanese-German loli-hybrid bent on winning the Holy Grail war in F/SN, gets a spin-off of becoming the MC magical girl collecting cards called \"Class Cards\" referenced from F/SN's seven Heroic Spirits or servants.\\n\\n\\n\r\nCHARACTER: 7\\n\r\nLet me put it this way. It's quite difficult to assess characters with spin-off roles, because they have a different role than the original, but still retains the same appearance, same personality, and even the same seiyuu. It's a make-or-break, really, to see if the spin-off version can handle or fill up the shoes that the original version initially has established.\\n\r\nIn the original Visual Novel (yes, I've finished the VN's three arcs: original, UBW, and Heaven's Feel; and watched F/SN animation, the Fate/Zero s1 and 2, Prisma Illya's season 2, and even Carnival Phantasm), even Illya has gone from the initial smirking antagonist to someone who's clingy and moe. Then there's Rin Tohsaka, who, even in the original Fate/Stay Night, serves as the walking-dictionary-slash-instruction-manual for the MC and yes, we saw her reprise that role.\\n\r\nThere are also two new characters for the Fate/Kaleid Liner installment: Miyu, who's a kuudere and the yuri partner of Illya; and Luvia-sama, who's very good trait that I like about her is she's voiced by Shizuka Itou.\\n\\n\\n\r\nART: 10\\n\r\nThis is art from Type-Moon we're talking about. Saying some nonsense about the way the artwork is made is like saying Mercedes-Benz cars are unattractive. Art concern alone, FATE has nailed that since 2004.\\n\\n\\n\r\nSOUND: 6\\n\r\nThe opening/ending songs are great and Illya-sounding, really. However, we're missing something: we're missing Yuki Kajiura here. And that's very much exactly like missing the SLS-AMG's 6,208cc 6.2liter M159 V8 engine, when you'd know that the AMG-GT now only has the 3,982cc 4.0liter M178 twin-turbo V8.\\n\r\nYet, there's a promise, seiyuu-wise, where seiyuus retained their original and renowned roles from the original Fate: Mai Kadowaki voicing Illya, Kana Ueda voicing Rin, even Ayako Kawasumi has her cameo as Saber; then new roles for the chosen awesome seiyuus: Kaori Nazuka for Miyu, and Shizuka Itou for Luvia-sama.\\n\r\nBut then again, there are no Yuki Kajiura compositions here.\\n\\n\\n\r\nENJOYMENT: 7\\n\r\nDespite all its spin-off elements and a story where it has exactly nothing to do with the Holy Grail war, because that's what the Fate-series is all about, Prisma-Illya is still enjoyable and worth watching if you treat it as a magical-girl anime. Like I said earlier in Mercedes-Benz analogy, the AMG-GT is a Merc, but somehow it isn't. If you treat that as an SLS-AMG, then you'd rather be better off buying the Porsche 911. Or the Jaguar F-Type. Everybody loves Jag.\\n\\n\\n\r\nOVERALL: 7\\n\r\nI have no qualms about this, even if it causes real FATE-oriented fans/otakus to bat their eyebrows, and gives moe pigs a reason to smile like Chesire Cat (especially if they've or you've watched the specials).\\n\r\nAll in all, it's to be expected when you've seen it yourself that Illya has become a magical girl, because as sentient as a human being you are, you'd immediately get the logic. You won't be scratching your head in comprehending it like how German Engineers solving and understanding calculations for their Merc's performance, you'd just automatically get it--as completely as understanding where this is going.\\n\r\nStill, Fate/Kaleid Liner Prisma Illya is a fun thing to watch even if it has nothing to do with the Holy Grail War. It makes a nice tally of all your magical-girl watch-list.\\n\\n\r\nVerdict: Fate/Kaleid Liner Prisma Illya is just like how you'd expect the Mercedes AMG-GT to be: it's Mercedes and it's AMG alright, but don't treat it as the SLS-AMG.",
            "date": "2015-05-03T00:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 187018,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3729929.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GiancarloLS",
                "username": "GiancarloLS"
            },
            "url": "https://myanimelist.net/reviews.php?id=187018"
        },
        {
            "content": "Since I can't be bothered to write a review for all three seasons that currently exist of Fate/Kaleid liner Prisma Illya, which will be shortened to Fate/Kaleid or variations of that for the rest of this review, this will apply to all of them. \r\nDon't let the apathetic attitude from the first paragraph mislead you, I love Fate/Kaleid, to the point where I was unable to watch any other anime until halfway through my 3rd back-to-back rewatch of the show because I just wanted to be watching Fate/Kaleid. \r\nFate/Kaleid does something that I see so many animes, including the original Fate/Stay Night 2006 adaptation, forgetabout. They actually show the normal lives of the characters beyond episode 1. I've seen so many TV shows arbitrarily decide that the magical adventure the characters are on is more important and interesting than their normal lives, and while this may be true in some cases, it also undermines the characters' motivations. Who cares if you're fighting to save the world from being destroyed if all we see of the world is the main characters fighting the bad guys? Fate/Kaleid will dedicate episodes to the characters just having a normal day, with a healthy amount of comedy thrown in. \\n\\n\r\nThis is something else Fate/Kaleid does well. It's one of the few animes that has legitimately made me laugh. Comedy in anime so often will either fall flat immediately or become overused to the point where it falls flat. Fate/Kaleid does neither, interspersing it where it needs to be and allowing the serious elements their time. It helps that the characters are often so adorable that I want to punch a steak to feel like a man again before I remember that my fists have all the power of a reasonably enthusiastic puppy and I give up entirely. \\n\\n\r\nThe show is not without its flaws. Tatsuko is obnoxious more often than funny (though thankfully she's only a recurring character rather than a main character), some of the rules of magic get wonky or nonsensical at times, and season 2 and beyond include some uncomfortable \"mana siphoning\" instances that make me start to wonder who exactly those scenes were made for. \\n\\n\r\nI still have more to say but I fear this review has gotten too long and is almost entirely just me gushing about how much I like this show. It's probably not for everybody, but I know I sure loved it, which is especially impressive because I thought Fate/Stay Night was rotting trash. In the interest of ending on a light note, Fate/Kaleid is like watching a puppy and a kitten snuggle up together in the fur of a large bunny. It's probably not high art, but it sure does make you happy to watch.",
            "date": "2016-02-08T22:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 210475,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4699058.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NotAnElk",
                "username": "NotAnElk"
            },
            "url": "https://myanimelist.net/reviews.php?id=210475"
        },
        {
            "content": "To be honest I don't like the Fate series in general. And yet somehow the spin-off of the series turned out BRILLIANT. Also keep in mind that normally I don't like the whole magical girls idea thing at all.\r\nRin (from Fate stay) and Levi (original I guess?), along with their 2 magical wands (...damn you Seitokai...) are on a mission to collect all the heroic spirit cards for the archmage in Germany. The wands, (Ruby & Sapphire) have a will of their own and eventually get tired of their masters' constant fights, so they go ahead and choose new masters, 2 girls seemingly chosen atrandom (in Ruby's case perhaps with a bit more illegal purposes in mind). Illya, daughter of Irisviel and Kiritsugu, is chosen by Ruby and Sapphire chooses Miyu, a homeless girl of unknown background. The former masters find the respective girls and decide to take them under protection/training in order to complete their mission.\\n\\n\r\nTo be clear about the genre, the show has some very dark moments, but is still overflowed with fanservice by the 9 year olds (yes you heard right, no I don't care if you have ethical issues with that, get over it.). The second season, heavily influenced by 2014's homo aura introduces waaaaaayyyyyy too much yuri to the list (not that the first season was yuri-free). Something I really like about the show is that it doesn't let us forget that both Illya and Miyu are still children, they have many preteen problems to overcome + things they don't understand, which would actually make the series a bit too heavy on drama if it wasn't for the fanservice \"goofiness\". \\n\\n\r\nFor the action part the anime does astoundingly well. The animations are great and there is no more talking than needed. The heroic spirits are all tough to beat, but more than physically they press the girls psychologically (the part I mentioned about them still being kids). Neither of them are actually prepared to \"fight to the death\" like Luvia and Rin are, and especially Illya will go through panic stages quite a few times. While we're at it, the anime does a FANTASTIC job with character developement. Both Illya and Miyu go through a looot of tough decisions regarding what they should do, what is right and how they feel about situations. Some could argue that Illya is way too whiny and a scaredy-cat but again people, it's f£%^ing 9year old.\\n\\n\r\nThings that I really loved about this anime:\\n\r\n1)The ages of the characters fit their behaviour.\\n\\n\r\n2)Oooooh the wonderful fanservice...\\n\\n\r\n3)Good sense of humor.\\n\\n\r\n4)Fast-paced, very well animated battles. + the opponents take way more than \"a few good hits\" to be beaten.\\n\\n\r\n5)Ruby's character, just priceless.\\n\\n\r\n6)VERY dark and depressing moments at times.\\n\\n\r\n7) Saber going terminator even down to her walking style, wearing 50 KG plate armor while shooting off Getsuga Tenshous as predator music plays on the background while the girls have nearly pissed themselves. (The testosterone levels are rediculously high on this one.)\\n\\n\r\nIt doesn't matter if you're a fan of the fate series or not. I 100% suggest this anime to almost everyone, so long as you don't have moral issues about 9 year olds giving fanservice.",
            "date": "2014-09-19T14:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 161035,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=161035"
        }
    ],
    [
        {
            "content": "I am the bone of my spin offs.\r\nYuri is my body, moe is my blood.\r\nI have resulted in over a thousand boners.\r\nKnown to lolicons.\r\nBut not to you filthy casuals.\r\nHave withstood magical girls and their self aware banter.\r\nYet, those viewers only care about the yuri scenes.\r\nSo as I pray... UNLIMITED LOLI TWERKS!\r\nFate/kaleid, the somewhat self aware, somewhat deconstructing, and fully bonerific and moeblob magical girl show, also known as Carnival Phantasm with only Fate characters and with... magical girls. I found this show to actually be more entertaining than Fate/Stay Night UBW, for even though it is as stupid and over the top as UBW, ifnot more so, at least it's painfully aware. It's also... not for kids... that's for sure. Just like how Madoka Magica isn't for kids due to the darkness and dankness, Fate/kaleid isn't for kids because... there are jokes that you wouldn't associate with a kids show.\\n\\n\r\nOh, you thought that scene was just gonna be cute girls doing cute things, with their cute voices and their cute interactions? Too bad, here's a boner joke. You thought one of the cute lolis visiting their sick loli friend was heartwarming? Too bad, let's have one of the lolis try to sexually assault the other. \\n\\n\r\nFate/kaleid is bad, but it's so funny that it's good. The story itself is basically like every magical girl ever made, trying to capture the cards! If only Sakura Matou was a magical girl. CLAMP would probably sue Type Moon...\\n\\n\r\nFate/kaleid does, to some degree, deconstruct the magical girl genre. While it is nowhere near the depressing realization in YuYuYu, or the dark twist in Madoka Magica, it still deconstructs the expectations of what a magical girl is supposed to be. Whether it be through self aware magical girl jokes, or through character expectations of what being a magical girl is like, let's just say that this show isn't entirely rainbows and unicorns and yuri lolis. \\n\\n\r\nFate/kaleid is one of those shows where you should probably watch the rest of the Fate franchise to get the full experience. While this show does take place in a completely different setting, there are a lot of references to the Fate universe we all know and love. The concepts of classes and Noble Phantasms are still a thing, and to fully get the grasp of the situation, go watch the other shows first! You don't have to, but I recommend it.\\n\\n\r\nAnd of course, there is the budget, the most famous aspect of the Fate series. Fate/kaleid is a spin off, and it isn't even by Ufotable, so how are the action scenes? Surprisingly, the action scenes are still incredibly high quality. Great choreography and special effects that can hold its own against Ufotable, Fate/kaleid has quite the thrilling battles. Fate/kaleid also has a very good soundtrack, as well as a catchy Fate-esque OP. The voice actresses for the lolis are just HHNNNGGGGGGG and yeah. Long story short, Fate/kaleid still boasts some surprisingly high production values. \\n\\n\r\nAnd of course, the characters! The Fate characters are back, albeit with somewhat different personalities. Illya is a deredere moeblob loli who is actually an incredible comedic character, and she's got a maid fetish! What a gal. Miyu is a Fate/kaleid exclusive kuudere anti-social character who is... pretty generic, but hey, she's also a loli! And of course, you will find many of your favorite Fate characters back in action. TsundeRin is back in business, this time stealing the Cardcaptor Sakura position from her sister to become Illya's mentor, and you got Luvia, who you thought was going to be a Fate/kaleid exclusive, but spoiler alert, she isn't!! You will also see other familiar faces in the supporting cast, such as SHIROU THE HERO, back at being the good oni chan that he is. He doesn't say any stupid quotes in this season, but I heard he does later on, so looking forward to that. You got Iris, who is now a total milf, and her personality hasn't changed at all since Zero. There is even a personal favorite of mine, Fuji-nee, the best sensei ever! Also, the two magical sticks, Ruby and Sapphire, have A LOT of character! Don't take their stick appearance for granted! They have way more character than most modern anime characters these days.\\n\\n\r\nFate/kaleid is just even more fanservice for Fate fans. As someone who isn't a big Type Moon fan, I still found this spin off highly enjoyable. The fact that I enjoyed a magical girl spin off more than half the canon story line is... impressive, to say the least.\\n\\n\r\nTL;DR: I hope there is more yuri in season 2.",
            "date": "2016-05-09T08:10:00+00:00",
            "helpful_count": 200,
            "mal_id": 218215,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5146740.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Yuni",
                "username": "Yuni"
            },
            "url": "https://myanimelist.net/reviews.php?id=218215"
        },
        {
            "content": "Fate/kaleid liner Prisma☆Illya is one of those anime series where people may tends to look away just because for what it is. You know that saying that goes “don't judge a book by its cover?” Well, I guess some anime fans seems to do just the opposite of that and take the cover for granted. This is one of those anime series that might bring some disappointment at first especially to those loyal fans of the Type-Moon franchise. Series like Fate/Stay Night, Garden of Sinners, and a more recent example of Fate/Zero has a stance of that serious atmosphere going on. What does Fate/kaleid linerPrisma☆Illya have? More than what you hoped for.\\n\\n\r\nAt any rate, this series is adapted from the manga of the same name written by Hiroshi Hinoyama. An important note is that the series takes place in an alternate set universe that serves as a spinoff of Fate/Stay Night. Therefore, do not be surprised if there are some familiar characters making their spotlights in this series. \\n\\n\r\nAs far as this series goes, the premise is pretty straight forward. Illyasviel von Einzbern is indeed the main protagonist of the story. (for the sake of my laziness and ease, she will be referred to as 'Illya') For those who are unfamiliar with her from the Type-Moon franchise, she is foster sister of Shiro. However, there is a difference between her character and Fate/Stay Night. In this series, she is shown as a cheerful young girl who grows up in a seemingly normal childhood with friends and joy. Oh but that all changes one day when she makes a contract and becomes a magical girl. Welcome to your new life, Illya. \\n\\n\r\nEven before becoming a magical girl, we can see that Illya is already fascinated with the idea because of a popular anime she watches. In that anime, there are magical girls. But never did she ever thought the day she would actually become one herself. For fans of Illya from the original series, this would be a delight because we get to see her in a much different way. But for fans of the Type-Moon franchise itself, you might also get a surprise with the addition of some new characters. Oh and Rin makes her return too of course in this series with her tomboyish self.\\n\\n\r\nAs some fans might guess, this series does have a lot of fan service and some tasteless moments. These usually involves awkward moments mostly from Illya because of her naive personality. Furthermore, her character is designed with extra doses of moe. Illya's battle design stands out that also gives her a touch of magical girl atmosphere. In fact, she herself admits the outfit to be embarrassing. On the other hand, we have Miyu Edelfelt, a new character that also serves the serious role of a magical girl. Unlike Illya though, she seems to be much more serious and quite mature for someone her age. With both magical and academic talent, Miyu serves as a character that seemingly exists the opposite of Illya. She is like the perfect candidate for a magical girl while Illya lags behind as the second rate. Or does she....?\\n\\n\r\nWith the help of a talking magical kaleidostick (Magical Ruby), maybe Illya can overcome her lack of self-confidence. After the contract is being made though, the magical stick plays the role of more of a mentor. Of course, themes such as becoming a magical girl, training to gain experience, and fighting/capturing cards isn't new to the anime industry. About a decade ago, a popular classic known as Cardcaptor Sakura also adapts the theme of a normal girl whose one day's life changes forever after becoming a magical girl. Other series with similar themes such as Shugo Chara, Magical Girl Lyrical Nanoha, PMMM, and the more recent Gen'ei o Kakeru Taiyō  also shares similarities. The noticeable phase here is that Fate kaleid liner Prisma Illya plays around the idea constantly in both a cute and dangerous fashion.\\n\\n\r\nIf I had to use the word 'cute', this series would earn a 10/10 on that scale. But more than that though, the concept of collecting cards as a magical girl is indeed a serious role. There's no joking around because the enemies Illya and her friends face are dangerous. In fact, even around half way into the series, the girls' lives are put into danger when they face adversaries like they've never encountered before. Classic enemies from the Type-Moon franchise makes their appearances in alternate versions to present a challenge that really does put their lives in danger. In a series such as this, you might not take it serious at first. However, it is clear that the idea of collecting cards is a grim task at hand. On the comedy side, there's the love/hate rivalry between Rin and Luvia. Illya's behavior also might spawn a few face palm worthy moments because of her age and inexperience. \\n\\n\r\n10 episodes. That's less than the average amount of a typical one core series. What that means is that the series may have to cut down some material or it won't have time to fit everything in. Luckily, the series is faithful with its adaptation. The only slight problem might be that the series doesn't have enough time to cover all the captures' every detail. This serves a double edge sword in a way. On one stance, 10 episodes could be rushed and leave out material fans want to see. But then again, the more detailed quality can bring out a more pleasurable experience. Oh and let's not forget there's still an OVA as well as specials. \\n\\n\r\nThe action is surprisingly fluid and presented quite well. I was surprised after seeing how this was adapted because of the amount of detail put into the actual fighting. The enemies are designed with a typical Type-Moon fashion but given a more dangerous look than fans might originally anticipate. In fact, a particular enemy that shows itself might bring out some shock to see how the character is presented differently in this series. The more important part though is that the action isn't parodied but rather as being serious. Illya's struggle at first shows her inexperience but there's development with her skills that is clearly evidenced later on. As for Miya, she shows her experience already as a magical girl but more importantly becomes both a friend and rival for Illya. As a foil to her character, the duo makes a formidable team along with those magical sticks.\\n\\n\r\nAs far as jokes goes though, I have to admit that some of it is a bit stale. Oh and the series doesn't try to avoid its fan service. There's the suggestive camera angles and skin being shown along with the loli expressions here and there. Some of the conversations between the girls and their peers also seems to be a bit forced in the comedy department. Even the first episode shows a bit of this along with cheesy dialogues. Among other factors, Shiro also doesn't seem to be an impressive character as his role is more of in the backgrounds. His denseness regarding his female friends and her own foster sister is also a bit frustrating to watch. By the way, he isn't even a main character. There's also some lewd jokes and misunderstandings here and there as well which should be expected.\\n\\n\r\nThe artwork isn't as impressive as I had hoped. Most of the coloring has a light tone but is covered with generic design. As mentioned before, Illya and Miyu are designed as magical girls and they really look like them. Their enemies are designed to give off a dangerous vibe although sometimes, I wonder what their real purpose is. The backgrounds are typical with a less-so realistic feeling to it. In fact, there's hardly any realism in this show. On the other hand, I do find that everything does fits within the concept of the series quite well, at least that much.\\n\\n\r\nColor me surprised here but the OST is brilliant. Sound production met beyond my expectations especially in the action scenes. A particular battle in the later episodes gives off its intensity with the way it is presented. It has a balance of rock and techno that is pleasurable to hear. The OP song \"starlog\" by ChouCho also shows its strength with its choreography and some foreshadowing. Among the cast though, Mai Kadowaki gets a standing ovation for her performance. Returning as her role from Fate/Stay Night, the way her character stands out requires a more high pitch tone. I am quite grateful that she was able to pull the task off with brilliance.\\n\\n\r\nOverall, don't entirely judge this series by its cover. Sure, it looks like just a typical magical girls series with cute girls doing cute things. But then when you look deeper into it, you might get a surprise. That surprise comes from the way it is both adapted and presented. I feel sorry for those who dropped this series from the first episode without giving it another shot. If you're a fan of Type-Moon's franchise, this should definitely be something to invest time into. Even if you're not fan of Illya, Rin, Shiro, or the others, it should be at least given a try for the first 3 episodes. Oh and there's nothing wrong with watching cute girly cartoons with magical girls.",
            "date": "2013-09-07T17:12:00+00:00",
            "helpful_count": 144,
            "mal_id": 112253,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=112253"
        },
        {
            "content": "Fate/Kaleid is something that happens when you take a seemingly stupid idea and turn it into something that's close to spectacular. \r\nNow, before I get started, I just want to point something out; A lot of people disliked this series, or dropped it in the first few episodes because it's a Fate/ series... turned Magical Girl. I did the same. When it was first airing, I dropped it, not because I didn't think it was interesting, I just didn't feel like watching it at the time. I, too, think that turning the Fate/ series into a Magical Girl series is a, well, stupid idea. Iwas wrong. \\n\r\nAlso, this series is a lot darker than it seems, so do not judge a book by it's cover, including a fair amount of blood and suggestive themes. It's like Madoka Magica's rating, though I find that this series is more mature in terms of content than that series is.  \\n\r\nI love the Fate/ series, I love Fate/Zero and I love Fate/Stay Night. Now note that I have JUST finished this series, as in, I watched it after the announcements for a Fate/Stay Night remake by ufotable and a season 2 for Fate/Kaleid were made. Due to the Fate/Stay Night remake being announced, I saw this series more as an awesome bonus. It takes the Fate/ story line and looks at it through a different light; although a fairly obnoxious and/or ridiculous one, it has a lot more to offer than it seems. Also note that this series has NOTHING to do with the main Fate/ storyline, character relationships are different, the Holy Grail War doesn't exist as far as we know, and characters who are supposed to be dead, are now alive. \\n\r\nNow I'll start my actual review, and it may seem like I'm over-praising the series... if it does, I apologize because that was not my intention. This is my actual opinion. I watched this series with a perspective as it being a bonus series to add onto the already-amazing Fate/ universe, thus I won't judge it just because it's a \"dumb\" magical girl adaption of the Fate/ series like most people have. \\n\r\nStory: 8\\n\r\nThe story is simple. Illyasviel Einsbern lives a normal Elementary-School life with her friends, and her \"older brother\" Shirou Emiya. Rin Tohsaka and a woman named Luvia were given the job of finding the remaining Class Cards, as they already own the Lancer and the Archer. The class cards reflect the 7 servant classes in the Fate/ series; Archer, Lancer, Saber, Rider, Assassin, Caster and Berserker. These cards are obtainable by entering a mirrored version of certain areas, (As in, another dimension) and fighting the \"Alter\", or the Dark versions of each servant. They use weapons that look like Magical Girl wands, each with a name, Ruby and Sapphire. They both talk and have personalities, too. These two wands believe they're abused by Rin and Luvia, so they decide to find new masters. Ruby flies off while Illya is taking a bath and happens to meet her. She then tricks Illya into a \"contract\" with her to become her new master. (Note: This is NOT a contract similar to Madoka Magica whereas she's forced to fight or else she'll die or something horrible will happen. It's just a contract to give her the title of master and to be able to use the wand's powers, that's all. She doesn't HAVE to fight and Ruby fully understands that.) Rin finds Illya, and tells her that since she stole her wand, she'll have to help her collect the class cards. Luvia does the same with a girl named Miyu. Thus begins their story. \\n\r\nSince the story is simple, it's  portrayed/paced perfectly fine. There isn't much to explain, so it doesn't waste any time. Although, there are some fanservice-ish moments included, but that's to be expected of Silver Link's animations. They don't last long enough to really be a bother. The story becomes dark around episode 6 of the series, as Illya and Miyu go to collect the Caster card, an unexpected servant arrives causing trouble. The series delves into the horror and grief involved with being an elementary school girl and having to fight dark, demonic entities with a magic wand dressed as a magical girl. Illya shows true signs of terror, she realizes that, after she's cut and begins to bleed, that all of this is real, that she can actually be killed within these dimensions. Thus, she's psychologically unstable for certain amounts of time, and even refuses to talk to her friends when the time comes. The impact of her fighting really shows in her character development. Guilt from accidental attacks that could have injured her own friends is also an element, that you'd have to see to know what I mean. It does an alright job emotionally, and the dimensions are portrayed spectacularly. \\n\r\nTo be honest, one of my favorite aspects of the story was the Dark versions of the servants. I have to say, Dark/Alter Saber is one of the most badass characters I have ever seen. She is brutal. \\n\r\nThere is one thing that isn't really explained, unless you're a fan of the Fate/ series and you know the background behind Illya, and that's the source of her powers. That may or may not be explained in season 2, which I heard from someone that the story will only get darker. \\n\r\nArt: 10\\n\r\nWhat can I say? This is Silver Link, their animations have always been fantastic. Look at shows like Dusk Maiden, who's visuals are gorgeous. Also, compared to other anime these days, the fight scenes were top-grade. Actually, one of my new favorite anime fights of all time come directly from this series, and that's the fight with Alter Saber. You'll see what I mean. It's a stunning sight to see, and certainly came as a surprise. The art keeps the show suspenseful and intense. I'm hoping season 2 will be even better, I expect no less from Silver Link. \\n\r\nSound: 10\\n\r\nThe music is phenomenal. It keeps fight scenes and other emotional scenes intense or it causes them to leave more of an impact. The soundtrack actually sounds like Fate/ music as well, which is a huge plus. I believe it even kept close to the original main theme of Fate/... but it's been so long since I've seen Fate/Stay Night I can't say for sure. The opening, too, is amazing. Great song, and great visuals to go along with it. The ending I didn't really care for because it was somewhat light-hearted and I wanted to see more, so I skipped the credits. \\n\r\nCharacter: 8\\n\r\nThe characters are... they're alright. Nothing really worth mentioning. Ruby and Sapphire, the wands, have their own personalities which keep the show a little more lively considering their attitudes. Illya is, well, different. Nothing really worth describing. One of her friends at school, though, was entertaining even though she didn't have a lot of screentime. She was obnoxious and clueless but in a good, funny way. Other than that, the characters are fairly average but you can get attached if you weren't already from the previous Fate/ series. \\n\r\nEnjoyment: 10\\n\r\nThis series was interesting. An extension to the Fate/ universe, and a very satisfying one at that. Especially considering there's going to be more, I'm even more pumped and happy that I saw this. It's underrated and misunderstood. Don't take it as an extension to the Fate/ story directly but an additional bonus to the universe. That way, it'll be more enjoyable. Watch it for what it is, don't watch it as a Fate/ series, in terms of the Holy Grail War.\\n\\n\r\nOverall: 9 \\n\r\nI can't wait for the second season. Give the show a try, I promise it'll be a lot better than what it seems to be, especially if you don't compare it to anything and just watch it as it is.",
            "date": "2014-05-17T17:57:00+00:00",
            "helpful_count": 102,
            "mal_id": 143609,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3671701.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hime-In-A-Box",
                "username": "Hime-In-A-Box"
            },
            "url": "https://myanimelist.net/reviews.php?id=143609"
        },
        {
            "content": "STORY\r\n   On the outside, Fate/kaleid liner Prisma Illya just seems to be a magical girl parody of the Fate series, and in many ways it is. Though, it manages to stand on its own with a story I can take seriously. The story starts off as a monster of the week show, but like any good magical girl show, it deviates from the formula. With focus on the internal conflict with Illya and external conflict with a new character Miyu. Though, I found the two conflicts to be cliche and predictable (Rehash of MGLN). The whole conflicts between rival magical girls and personalmotivation, has been done else where and done better. Although, thanks to the direction of Shin Oonuma, the drama and conflicts were actually enjoyable. With Oonuma directing many drama series before, he knows how to make the viewer care for what's actually happening on screen. I felt emotion for what was happening, whenever the show was being heartwarming, chilling, etc. And I have to give credit for that. Also, the throw backs to Fate lore was very much enjoyed and appreciated. Overall, while nothing new, the story was highly enjoyable.\\n\\n\r\nCHARACTERS *This section contains spoilers*\\n\r\n   The cast consists of mostly alternative versions of their Fate/ counterparts, with there only being two new characters. The magical stick sapphire, and its master Miyu. With Miyu being the only new character worth talking about. Miyu is that typical cold isolated girl you see in a lot of magical girl shows. And, she also goes through the typical development that comes with the cliche. Not saying that's a bad thing, it's just predictable. She grows from a cold person to our main character, then to a nice one. It's that simple. Speaking of our main character, we have Illya. Illya is a character from the original series, and is the only one that has a dramatic personality change. In Fate/Stay Night, she's a cold killer, but is somewhat mischievous to the people she trusts. In this show however, she's a normal girl. Illya a normal magical girl protagonist, but what also comes with this is the typical development. Like Miyu, Illya also goes through a typical magical girl character's development. She's been given a duty she knows nothing of, then she begins to doubt her position in that duty, but in the end she grows to be stronger to protect what she loves. Although, unlike Miyu, Illya's development was refreshing. Illya's internal conflict takes up a lot more time than the average magical girl protagonist. The show made an effort to give her internal conflict real meaning. Illya actually gets inner monologues on her how she really feels about the duty she has been given. And, while I've seen better magical girl protagonists, seeing things done this way was refreshing.\\n\r\n*End of spoilers*\\n\r\n   As for the rest of the cast, none of them really get any development, but are just throw backs at the Type-Moon universe. They're most there for comedy relief, and they do their job. While the comedy isn't Carnival Phantasm funny, it got a few laughs out of me. All in all, with there only being 2 stand out characters, and both only having slightly above average development, the overall characters are passable.\\n\\n\r\nANIMATION\\n\r\n   Animated by Silver Link, the animation is pretty good. With decent use of lighting, the tone the art gives off is a fun lighthearted feeling, with dark undertones. The character designs of the original characters, stay faithful, but they have a bit more cartoon style than their original's. I also like Miyu's out of costume design, for some reason. Though, I notice the character designs aren't always consistent. There's a few times a character would go off model, although that can be forgiven. As for the actually animation, the  regular scenes are standard fare. Though, the action scenes are particularly impressive. The movements are fluid, and combined with the really good directing, makes the action look even more impressive than Fate/Zero's. (Fate/Zero had crappy fight direction, in the first season at least.) Overall, while there were some small dips, the animation is well above average. \\n\\n\r\nSOUND\\n\r\n   Composed by Tatsuya Katou, the music isn't standard magical girl music. The style is more of a mix between F/SN's and magical girl OSTs. This results in some calm slice of life music, and epic battle music. While the slice of life ones aren't anything special, the epic battle ones, are pretty good. I particularly like the Illya version of the EMIYA theme. It's probably my favorite version of it. (Maybe) As, for the OP and ED, I liked them, but I admit they weren't that special. Catchy and that's it.\\n\r\n   As for the dub.... It was a a big meh. It's one of sentai's better dubs, but it's not that hard to be one of the \"better\" sentai dubs. While the acting is okay, the a few of the voices don't match the characters. Illya sounds too old in my opinion and Rin doesn't really have that charm to her voice. I kind of wish they went to bang zoom for this dub, but I understand that they wouldn't make as much of a profit on this show, compared to the F/SN UBW movie. \\n\\n\r\nOVERALL\\n\r\n   I've always liked Type-moon, particularly the Fate/ series. With Fate/Zero being my favorite anime. So, when Fate/kaleid liner Prisma☆Illya got announced, I was a bit \"ehh\" about it. I mean, Fate and magical girls? One part of me was expecting for it to be bad, and another was being optimistic. So, when it actually turned out to not half bad, I was honestly pleased. I seriously enjoyed Fate/kaleid liner Prisma Illya, and I'm looking forward to where ever this sub-series will go in the future",
            "date": "2014-11-08T22:34:00+00:00",
            "helpful_count": 29,
            "mal_id": 167937,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4149187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MeowPower",
                "username": "MeowPower"
            },
            "url": "https://myanimelist.net/reviews.php?id=167937"
        },
        {
            "content": "Do you like loli?\r\nDo you like spin-off anime of excellent series that have nothing to do with said excellent series?\r\nDo you like a show that can’t decide what the hell it wants to be?\r\nThen sit down and watch Fate/Kaleid, a ten episode anime that is full of everything you love about Fate/Zero and Fate/Stay Night, such as hilarious comedy, underaged lesbians, and magical girls. You know, the kind of things fans asked for after watching the main series.\r\nIf you are a fan of the series, I’m sure you’re going to pass Kaleid up based upon the fact it is a cutesy magical girl anime. Iwent into it thinking such, which is why I was so scared after the first episode. I was already debating how a show based on a series that’s pretty adult in tone could appeal to little girls. I went into the series assuming I was going to see a little girl anime. Twenty-seven minutes later, I walked away wondering just who the hell Kaleid was made for. And after ten episodes and the five DVD specials, I’m still scratching my head.\\n\\n\r\nKaleid is about Illyasviel, a young girl who lives in Japan with some adopted family while her mother and father are out doing…whatever. She watches magical girl anime and dreams of becoming one. Luckily, a magical wand/stick/what-have-you hears her and takes her as its master, making her dream come true. But the wand used to belong to Rin Tohsaka, a tsundere who, along with her partner, lost their wands because all they did was fight with each other. The teenaged girls were tasked with collecting seven cards by the Mage’s Guild if they wanted to be taken under the wing of a master magus. So, through the series, the duo of teenagers use a duo of ten year olds to attain their goals.\\n\\n\r\nSounds like it could a kids show, right? Nope! One episode and there’s a gag about penis’s! A few episodes in and the violence is a little more intense than a kids show usually is.\\n\\n\r\nAnd then the realization:\\n\\n\r\nOh God…this show is supposed to appeal to people my age.\\n\\n\r\nOkay, loli porn aside, I can’t fault the series for having Rin Tohsaka. Because seriously, I watched this for Rin. She’s one of the best damn tsundere’s in anime. Her companion, Luvia, whom she always fights with, is less exciting. Exceptionally less exciting. She’s the rich bitch stereotype. She has that “OH HO HO HO HO” laugh and makes fun of Rin for being poor.\\n\\n\r\nIllya is a decent character but her development can be filed under “Basic Hero”. Wishful thinking to “No, I don’t want this” to acceptance to throwing aside her weapons after something bad happens to taking them back when she realizes she’s the hero the city deserves.\\n\\n\r\nMiyu is another stereotype. Quiet and badass entrance to nothing-to-do-with-hero attitude to learning friendship and working together is a good thing to hurting the hero to finally realizing friendship is magic.\\n\\n\r\nAnother gripe, the biggest gripe. What the hell is it? Magical girl, fan service, comedy? It does all three pretty decently, but the problem with the series becomes tonal shifts so fast you’ll get whiplash. One episode will spend half the time making tit jokes and focusing on side characters that have absolutely nothing to do with anything, while the other half will be an intense fight. It has Sword Art Online syndrome. It’s juggling way too many genres and tropes at once and because of that, it’s failing to carve itself a distinctive identity. What we get is a muddled mess.\\n\\n\r\nOne overarching theme seems to be exploiting the female characters. This is an anime for lolicons a la Kodomo no Jikan. It’s pretty shameless in how over-sexualized the characters are. The worst offenses come with the DVD extras that includes a whole portion where Illya is dressed up like a cat and being forced into poses that are…not appropriate for a girl her age. And the magic wand (these things talk by the way) tells us that she’s responding to the desires of the audience.\\n\\n\r\nOh come on! The writer, director, and animators want to blame the viewers for this? We all know it’s a joint venture!  The studio’s getting off just as much.\\n\\n\r\nAnd the DVD extras are bad. Except for Rin in a maid outfit. But otherwise, they’re all useless and more excuses for nudity and sexuality. There’s one where they play strip-Life. The board game. Turned into a stripping game. Eh?\\n\\n\r\nAnd also, there’s a pervasive sense of lesbianism between Illya and Miyu, just to help that image of underaged fap-bait.\\n\\n\r\nI’m bitching a lot about this show, but I did find some decent aspects to it. It’s watchable and less painful than a lot of shows I’ve seen, but that doesn’t change the fact it’s got so many faults. There are a couple awesome fights within, good animation, and great music. It’s begging for fans of the Fate series to watch it but it’s begging for a lot more besides. It’s…to put it bluntly, fap-bait. If you’re into loli, here you go. If you’re not, well, I wouldn’t even touch this series with a stick.  Even if you’re a hardcore fan of the franchise, just don’t. You’ll be a lot happier that way.",
            "date": "2015-05-22T10:54:00+00:00",
            "helpful_count": 21,
            "mal_id": 188454,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188454"
        },
        {
            "content": "Few animes had the impact, drama and downright manliness of Fate/Zero, a Type-Moon production that blew away all my expectations for an anime. With this entry in the Fate series, I went in expecting something big. The bar set by the previous series was huge and I'm not surprised that this fell short (in fact, why even compare the two?) . However, what's here is a solid MG anime with a dash of Fate thrown in. \r\nThe story is told is a very straight forward fashion. Through the perspective of Illyasviel von Eizenbern, the viewer gets a blend of mediocre middle school drama, heart-pounding battlesand a colorful main cast. The plot as a whole is solid, yet a tad predictable and the comedy, especially in the beginning, hits all the right notes. Despite the good foundation and nice twists in the combat, the series suffers from a glaring plot hole three-fourths through the series, when Illya suddenly gets a burst of extreme strength. It's origins do not seemed to be explained especially well in the series. An implied fact perhaps for longtime fans? I'm not sure. Also, I don't entirely understand where the class cards came from, which is another blow to the plot. \\n\\n\r\nThe art of the series is a nice fit, with a clean presentation and colorful special effects. Every magic attack looks both powerful and visually appealing and melee combat has weight behind it. The character designs of Illya, Miyu, Luvia and Rin each fit as well. \\n\\n\r\nThe sound of the series doesn't stick out particularly, but the voice acting is good. The opening is sufficient and the first ending is good. The second ending is better, but not by a lot. \\n\\n\r\nThe characters of this series are mixed in terms of quality. Illaya is, from what I've seen, a 'self-aware MG', as early in the series she questions the very foundation of MG girls. It was entertaining to see her ponder these different elements and these quips kept me smiling and more importantly, interested. Miyu seems like a typical silent girl, but she complements Illya's bubbly personality  well. The pair of Rin and Luvia are good as well, but Luvia doesn't get very much character development. The magical rod twins Sapphire and Ruby are more comic relief than anything, since their attempts to move the plot are usually clouded in with their own humor which gets old very quickly. All the other characters, however, fall by the way side. I don't remember any of the classmates and the other residents of the house seem quite one dimensional. \\n\\n\r\nEpisodes seemed to be dragged out, which made this 10-ep series seem much longer. However, the quality was consistent and the series had great action scenes. The fan-service was a bit awkward, since the the two main girls are 12(?) year olds,  but luckily it wasn't too frequent. This is anime comfort food. Those who hate MGs need not apply, but if you like Fate or just want an anime that doesn't require you to think too hard, this is a series to watch. \\n\\n\r\nOverall, this is a good anime. The plot suffers from holes but keeps you interesed, the sound doesn't do anything special but gets the job done and most of the characters are shallow but the ones that matter are good. The art is truly exceptional. This series showed that even MGs can be pretty cool when you slap the Fate label on them.",
            "date": "2013-12-15T15:42:00+00:00",
            "helpful_count": 21,
            "mal_id": 123979,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3406621.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LilGreasyKid",
                "username": "LilGreasyKid"
            },
            "url": "https://myanimelist.net/reviews.php?id=123979"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nWhen people think of magic in relation to the fantastical, people think of wizards, spells, and all-powerful incantations. It's something that doesn't exist in the real world, as much as we would like it to be. \"Magical girls\" take it one step forward. On top of the magic, they also include transformations, cute girls, and life lessons. In Fate/kaleid liner Prisma☆Illya (what a name!), these common tropes are found once more.\r\nSTORY\r\nF/k (I need to shorten the name at this point!) starts by having our main character, Illya, one day encountering Ruby, a magical stick that gives Illya thepower to transform into a mighty magical girl.\\n\\n\r\nRight off the bat, it's important to understand that the world behind F/k is not original. That is, F/k is a spin-off of the ever popular Fate/Stay Night and Fate/Zero setting. F/k can essentially be viewed as this alternate timeline in which F/SN and F/Z's characters never participated in the Holy Grail War. Already this alienates people from the series. If you don't know the characters, the original world, or the lore behind everything, it makes the show harder to watch. This isn't to say that someone should refrain from watching F/k if they have yet to see the other two, but you are not getting the full experience otherwise.\\n\\n\r\nF/k mainly explores two separate themes: facing your fears and \"the power of friendship.\" Talking about the first one, both Illya and Miyu face these issues but for different reasons. Illya is a girl who is thrust into these scenarios despite not fully investing herself into what is happening. She's more outgoing and emotion-driven. Contrarily, Miyu joins the fights not because she wants to but because she has to. She's reserved and quiet. F/k did a nice job of creating this dichotomy between the two to represent where they were coming from and what makes them face these incredibly dangerous situations.\\n\\n\r\nThe second part, \"the power of friendship,\" is quite common in anime. It's prevalent here as well. While the story itself contains many battles, its real focus is on the development of the relationship that Illya and Miyu have. Again, this goes back to their backgrounds and motivations, and through these they learn to accept one another for the different people that they are. This idea isn't the most perfectly executed version of this trope, but for the most part, the show does an okay job of having the girls go through the ups and downs of a budding relationship.\\n\\n\r\nANIMATION\\n\\n\r\nFate/Zero is highly lauded due in part to its animation and art quality. F/k, surprisingly, is of no exception. While watching the show, I could have sworn that ufotable (the team behind F/Z) had also worked on F/k.\\n\\n\r\nBeginning with the art style, the show does a great job of varying up the locations. They stick to the more famous ones, and as someone who knows about the world, it was nice seeing the same landmarks again. The lighting in the show is also very well done. The nighttime scenes and general lighting on the characters always seemed rather high in quality.\\n\\n\r\nF/k's greatest feature is definitely its animation. It is rather spectacular at times. One of the things that surprised me while watching was the heavy amount of detail that went into the fight scenes. They were very, very good right up until the end. The sparkling shots, the dense mana shields, and the amount of movement and choreography included in the show was quite pleasing to watch. I did not expect such detail when watching a \"Fate-universe spin-off,\" so what I got to see was rather amazing.\\n\\n\r\nThe character designs are \"original\" yet true to those of the characters from the Fate universe. Everyone's most striking characteristic were their eyes. They have these nice mix of colors and \"punch\" to them that makes them stand out. This is especially true for Illya and Miyu. When they are looking at you on-screen, you can't help but fixate your eyes on their's.\\n\\n\r\nCHARACTERS\\n\\n\r\nF/k has roughly four main characters that are looked at: Illya, Miyu, Rin, and Luvia.\\n\\n\r\nI'll start with the weakest. Rin and Luvia are introduced quite early and display their personality and rather violent relationship with one another from the get-go. Afterwards, they become more like guides than actual characters. You don't learn much about them other than what purpose their mission serves. I would have liked to have seen more background on them, and more specifically Luvia, but since they weren't the main focus, I was left with what I got.\\n\\n\r\nIllya is the star of the show. She's optimistic, cute, funny, and caring. She dreams of being a magical girl and this wish gets granted. However, she learns that there is more to it than just having fun and using magic. It's something that helps to test her ability to move forward despite the hardships that she encounters. She takes for granted the abilities she earns but eventually understands and accepts that her position is special, that it is not something that should be taken lightly.\\n\\n\r\nThis revelation is thanks to Miyu. Miyu is stalwart, smart, and athletic. She's very determined and focused on her objectives. So much so that her behavior often causes others to misjudge her as being standoffish when she is actually quite lonely. It's this loneliness that has compelled her to always try and do things her own way. But much like she did for Illya, Illya allows Miyu to see that being together is going to be much more powerful than being alone any day of the week.\\n\\n\r\nThe characterization here for both of the magical girls is somewhat plain. It's nothing out of the ordinary. Instead, it is probably quite cliche. But as I mentioned previously, the show does a good job of creating this dynamic between the two that allows them to go from simple partners to extremely close friends.\\n\\n\r\nBeyond Illya and Miyu, the rest of the cast is rather weak. We get to see some cameos from big names, but they don't do much other than provide comedic relief or proper advice.\\n\\n\r\nSOUND\\n\\n\r\nThe OP, like the girls, is quite magical in the way it sounds. Unfortunately, it isn't that good. It's too generic in its rhythm to be anything worth really listening to. The ED is rather upbeat and mirrors the happy nature that is Illya's and Miyu's relationship. However, again thanks to a rather generic beat, it's not that good. In fact, after listening to the two, it sounds as if both use the same percussion piece.\\n\\n\r\nThe soundtrack is harder to talk about. It contains pieces that are both quite fitting for the situations at hand and somewhat absurd/silly in the way they sound. Meaning, it's a mixed bag of both good and bad.\\n\\n\r\nVoice acting is average in the show. However, they do use the same actors/actresses from the Fate anime universes in here as well. This was a nice touch, and I thank the creators behind F/k for doing this.\\n\\n\r\nAs a final note, one of my favorite sounds in the show was Miyu's \"flying.\" I found her technique not only cool but with the added sound effect it made it pretty awesome.\\n\\n\r\nENJOYMENT\\n\\n\r\nMagical girl shows almost always end up the same way. The girls become magical, they have fun, they experience hardship, then they unite to conquer evil. F/k pretty much follows this same pattern. It's never really funny or dramatic, so I never found myself laughing or being invested in the characters.\\n\\n\r\nAbove all, what F/k does best is its battles. They are quite a feast for the eyes with their multitude of colors, the actual movements involved, and the interesting abilities used throughout. But when the show is not having the girls battle, it's rather boring. The story itself isn't captivating and the characters are not good enough to make me care for them. Plus, I found Ruby and Sapphire to be kind of annoying during the show.\\n\\n\r\nFate/kaleid liner Prisma☆Illya is a common magical girl show that has great battles hidden beneath its surface. I think that without the Fate universe backing F/k, it would not be as well-known as it is today. This may be an obvious statement, but if that is its main draw, that is an unfortunate and sad fact.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, magical girls with the \"Fate\" world as its setting\\n\\n\r\nAnimation: Great, great art with stunning animation\\n\\n\r\nCharacters: Fine, Illya and Miyu fit their magical girl roles\\n\\n\r\nSound: Bad, nothing notable except for returning VAs and sound effects\\n\\n\r\nEnjoyment: Fine, good battles but not much else\\n\\n\r\nFinal Score: 5/10",
            "date": "2014-10-03T05:24:00+00:00",
            "helpful_count": 17,
            "mal_id": 163387,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=163387"
        },
        {
            "content": "I hated, and didn't watch, Fate Stay Night because of how much Shirou sucked; being the usual self-insert male lead who doesn't have much skill and is at the mercy of the lot of females herein.\r\nI wanted to beat the crap out of the douche bags responsible for Carnival Phantasia because it made Shirou (and whoever else is a male) even more pathetic.\r\nThen comes a \"magical girl spin-off.\" Rather than climb up the steep hill of \"making [Shirou] likeable for the audience outside of Wapan,\" Type Moon pulls this stunt and takes the easy way out by catering to the pedophiles. I mean... DAMN.\r\nLyrical NanohaStrikers atleast had the bravery to flip the skirts of, and gave nekkid transformations to, the older Nanoha and her associates. You'd think it wouldn't kill Type Moon to do the same to Rin, Luvia, et al and prove that they're not just for the sake of the slobbering otaku-base.",
            "date": "2013-11-29T12:42:00+00:00",
            "helpful_count": 11,
            "mal_id": 121755,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=121755"
        },
        {
            "content": "As you might have seen in the summary for this anime is that it is a spin off set in an alternate reality which illya and her parents are a family and Shiro is her cousin who frequently visits to check up on her as well as cook and do some house work.  the series also has other characters from the fate series such as Tohsaka Rin and the epic heroes from both fate/stay night and fate/zero. \r\nNow on with the review.\r\nStory\r\nWhat makes this different from other magical girl series is that there is no mascot animal that goes around and recruits female heroes.Instead, the magical wand who has a mind of its own with human personality and everything goes around to find the most suitable candidate to become a magical girl. After the girl is chosen, they are given the task of capturing the seven epic hero class cards that reside throughout the city in a mirror dimension. After capturing these cards the girls will be able to use their power as equips to transform their wand into a weapon similar to weapon the epic hero was carrying. For example if they use the lancer card the wand will turn into a lance and it will have the same abilities that lance has.\\n\\n\r\nAfter watching a few episodes, one might feel that this is just an attempt to milk the popular fate series for a quick buck but the story does get better and more serious as it goes on and becomes more like the fate series we know and love. It also has some epic battles in there that you might want to see more than once. I can understand if someone only watches a few episodes and drop it then say bad things about it but if you continue to watch, you will be rewarded. After seeing the complete series myself all i can say is that I recommend any fate series fan to watch it and I'm looking forward to season 2. Please bare in mind that this season does not end like fate/zero did with a cliff hanger ending at the first season but instead it ends after they have defeated the last boss.\\n\\n\r\nSound\\n\\n\r\nThe sound was great and I enjoyed the new version of the famous Emiya theme from the fate series. Though I wish i heard it more during the series and at the final battle as well. \\n\\n\r\nCharacters\\n\\n\r\nThe characters personalities were the same for Tohsaka Rin and Illya's mother in this series but it is different for Illya. The Illya in this series is a very nice little girl like you would normally see in other magical girl anime but the saddist side of her is in their somewhere deep inside. The magical wands especially the one illya uses is very annoying but you will get used to it if you keep on watching.\\n\\n\r\nEnjoyment and conclusion\\n\\n\r\nAt first i did not enjoy this series because of the idea that this is just a cash grab and the annoying wand that illya uses but as i continued to watch the series, it began to turn into a typical fate series with epic and serious battles. I really enjoyed this series and I recommend all fate fans to give it a chance because the normal fate series is finished and a spin off is all they can do to keep fate alive.",
            "date": "2013-09-21T11:33:00+00:00",
            "helpful_count": 11,
            "mal_id": 113673,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1314295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/divinehand125",
                "username": "divinehand125"
            },
            "url": "https://myanimelist.net/reviews.php?id=113673"
        },
        {
            "content": "when I first saw Fate/kaleid liner Prisma Illya as being a newcomer to the Fate/ universe I wasn't expecting much but oh boy my expectations were blown away the minute I hit play.\r\nThe story has a magical girl vibe where you make a contract to fight evil and become magical girls but keeping true to the Fate/ universe and its lore with most of the enemies Illya, Miyu, Rin and Luvia fight make up the 7 classes of servants from the Holy Grail War. all in told the story is great and the pacing is spot on as everything flows really well.\r\nThe art is beautifulto look at as the background looks pretty and the fight scenes in the parallel world are fluid and amazing to watch even the character designs are beautiful.\\n\\n\r\nThe sound design is amazing from the music to the minor sounds even the voice acting in both the dub and sub is good to an extent.\\n\\n\r\nCharacter development in the show has it's ups and downs but the one character I liked throughout the show was Illya as she had a lot of character development over the course of the anime where she was tricked to becoming a magical girl to realizing that she can die and stepping away from fighting at one point to realising that she can help everyone especially Miyu.\\n\\n\r\nOverall Fate/kaleid liner Prisma Illya is a great anime to watch especially if you are new to the Fate/ universe like me cause you can just appreciate it for what it really is :)",
            "date": "2015-02-23T17:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 181089,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4016289.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MRN3",
                "username": "MRN3"
            },
            "url": "https://myanimelist.net/reviews.php?id=181089"
        },
        {
            "content": "Fuck me, I’m two years late to this review. Oh well, it’s not like anyone will read my review anyway.\r\nFate/Kaleid liner Prisma Illya is a spinoff series of the popular “Fate” visual novel series. This show adopts a satirical take on the popular “Magical Girl” genre of shows with the well known Fate characters thrown into the mix. It aired in the Summer of 2013, adapted from the manga series of the same way.\r\nMy first experience with this particular series was a popular clip of two young girls clad in typical magical girl outfits making out, complete with close-ups of spit-swapping as another girl watchesalong clearly in a daze. Such a titillating scene, contrasted with such young age of the protagonists had me raising my eyebrows for a while. Subsequently, I caught whiffs of controversy surrounding this series, some claiming it to be “lolicon” pandering, specifically trying to attract individuals using subjects who are underaged and may or may not be portrayed in a provocative manner. This controversy surely cannot be left untouched, said, knowingly two years late to this anime, and off into this show I went. I must disclose that I am not a lolicon as previously stated.\\n\\n\r\nWhat greeted me first was the overly-experienced, overly large and detailed eyes of the main characters. Illya’s eyes were bright pink, common to anime, and drew my attention right away. Yes, one might be quick to point out that eyes have and have been always drawn in ridiculous proportions. Yet, I must emphasize that eyes drawn in such a manner, pupils more than whites, deeply engrossing, was a rather enjoyable aspect of Fate/Kaleid’s visual design, indeed reflective of the saying that one’s eyes are the windows to the soul. Still, it is such a pity that such well designed eyes act as the windows to such a poor and uninspired character, our main protagonist, Illya. But we shall get to the characters later.\\n\\n\r\nTo begin with, the story and setting takes place in normal. modern setting (I assume Japanese), and spirals into a cliche magical girl plot. Experienced watchers know, a girl makes a wish for the unexpected, for the excitement in her life, and suddenly a magical stick shows up and forces the girl to become her master without her consent, very much with Illya in disagreement. Here, I must the show pulls a twist that has become rather mainstream to the post-Madoka era of magical girl genre, which has become rather moot by now, I feel. But, for this small twist to an overused trope, I shall give some merit to the show. Then, the girl, imbued with whatever great magical powers goes off to collect cards, fight and make friends along the way. Cue the boss fights, magic visual effects, the power of friendship and so on. Typically, I would have little qualm about these tropes writers adopt for their stories, but for Fate/Kaleid, the distinct lack of polish or refinement to the settings, tropes it borrowed, makes it mediocre, run-of-the mill, filler with Fate glued on. Another show I would like to compare it to would be Yuuki Yuuna is a hero, which implements very much identical tropes of friendship, struggles, but does so more elegantly, more enjoyably. Thus, the story and setting could use a bit more creativity or refining.\\n\\n\r\nOn the visual side of things, Fate/Kaleid liner Prisma Illya does have plenty to offer. Studio Link may not be the most popular or well known anime producers, yet, they have experienced staff who are very much capable of providing punchy visuals when it wishes to. Characters are designed with strong presence, very much maintaining the  attention of the viewer on whoever is in the scene. One stand out was a particular fight scene I would not name, for fear of spoilers, but this one fight had em sold on the capability of Studio Link. The movement was fluid, every action had substantial impact and gave a very solid feel to the whole sequence. It was as though Link tried to imitate Ufotable’s style, Ufotable being the studio being closely associated with the Fate series. In anycase, it was rather well-done, and future shows could benefit from such effort put into its action scenes here, this sequence exceeding far beyond my expectations. Throw in some light visual humor, regarding Rin parading about in a Magical Girl outfit she’s too old for, and the show comes out with above average for its visual style, with the aforementioned fight scene and the design of the character’s eyes being a standout for me.\\n\\n\r\nThe characters, they are another issue for me. I feel they really drag the show down. GOing into the first season the show provides characters with paper thin motivations and generally made the narrative less compelling, to the detriment of the show, to say the least. Each character has the personality of their canonical counterparts with a few quirks thrown in, Luvia’s arrogance to Rin’s inferiority complex, yet lacking anything else. This leaves the show feel hollow. Any form of driving force is hid behind the mysterious “Mage's Association”, a mysterious cabal seemingly directing most of the actions taken in the series. I could go on, but I want to focus on Illya now. She flip-flops around, very truly lacks motives behind her actions apart from the superficial ones that she casually states at a convenient timings, and suffers from doing things “just because”. She could have been more well written to reflect emotional depth, anything to show temperance within the shallow pool of her personality. Apart from that, an airheaded demeanour really does not sell her character for me. Such a shame, she had such pretty eyes.\\n\\n\r\nIt might strange to hear this, but this is actually my first experience with the Fate series, spin-off be it may, and yet I still found the portrayals of servants, masters, mages engaging, and found myself recognising the well known characters of the canonical series. Some may scream heresy at my statements, but I feel that for a spin-off, this series still pays homage to the original series, where even an outsider can recognise the parodied portrayals of its characters. That is to be respected, for a series to remain faithful to its source.\\n\\n\r\nIn all, this show merely rehashes the same tropes and points from the “Magical Girl” genre, while using Fate characters to carry out the same plot we have seen too many times. Perhaps it is the lack of runtime in its 10 episode length, or it could be a cash-in to milk fans for their money, we will never know, but what we were presented with was far and away the best that such a combination could offer. Turn to this show if you have spare time, or wish to see get more Fate, albeit in a parodied sense. Magical girl fans will not be too satisfied with this show. I know I wasn’t.\\n\\n\r\nLastly, the “lolicon” accusations. Overall, I found this show to be rather light on the fanservice. Sure there was some provocative scenes, but it was not to the point of being highly contentious or objectionable. These scenes helped to interject some life into the series and made it somewhat engagin even as side gags. \\n\\n\r\nOverall: Not Lolicon/10\\n",
            "date": "2015-09-25T09:09:00+00:00",
            "helpful_count": 9,
            "mal_id": 199540,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3871129.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Alden_Tarkus",
                "username": "Alden_Tarkus"
            },
            "url": "https://myanimelist.net/reviews.php?id=199540"
        },
        {
            "content": "For someone who watched other Fate series, Fate/loli might seem like a joke. While it's partially true, there is much more to this anime that makes it stand on its own.\r\nBeing a mostly comedic spin-off, Kaleid doesn't go to deep with a story. Synopsis is pretty much all that happens in this anime plot-wise. \r\nBut being simple doesn't mean being bad. Prisma☆Illya manages to keep perfect balance between comedy and serious moments. You won't experience out of place comedy nor forced drama. Both comedy and drama are of high quality: jokes are funny and feel good. Drama doesn't annoy viewer, is easy to understand andfeels natural.\\n\r\nAction scenes are also really good. They give you the right feeling of urgency and uncertainty with their speed, angles, music and flashiness.\\n\r\nWhile story has serious moments, some blood and fight for life, I'd still say it's generally light anime. Don't expect tragic developments from other Fate titles.\\n\r\nAnother small detail worth mentioning is magical girl genre deconstruction. No, not Madoka-style one. Just some small remarks that add to comedy but also point at some self-awareness of characters and story.\\n\\n\r\nThe strongest part of Fate/kaleid are characters. First thing you will notice is that they are surprisingly (for anime) intelligent and not naive. Their actions are mostly logical and emotions are natural. Outside of some comedic moments, they behave normally, without making you irritated with some weird fails just for plot progression. \\n\r\nAnother thing about characters is that they are deeper than having just one defining trait. You can see other sides of their personalities. They develop.\\n\r\nThing that really plays nicely with characters is art. Their design, animations, voice acting and especially facial emotions are all great and give them yet another dimension.\\n\\n\r\nI think I could recommend this anime to majority of anime fans. It's nowhere as niche as I expected.\\n\r\nI came here for loli fanservice and stayed for... other loli stuff. While fanservice part wasn't as good as I hoped (I heard it gets there in later seasons), I absolutely fell in love with characters and don't regret watching Fate/kaleid.",
            "date": "2017-09-10T01:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 257226,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4251395.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yukikaze_sama",
                "username": "Yukikaze_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=257226"
        },
        {
            "content": "Aight so Fate/kaleid liner Prisma☆Illya is the most dope anime I have seen so far in my life. This is the best out of all the Fate/ series. If you are thinking hey isn't this just a fan service show just like Carnival Phantasm? If you think that way I am sorry but you should get checked for brain damage because this show has everything you could ever want and more. The show contains the best girl from the Fate/ series Illya in a main character role and also she is a magical girl. Other Fate/ characters make appearances but they don't really matter atall. If you like action this show has it for you. If you like moe moe goodness this has it. If you like drama this show has it. There is nothing this show can't deliver. It is a perfect masterpiece 10/10 no other anime can compare. \\n\r\nTL;DR Best anime in existence watch it.",
            "date": "2015-01-08T23:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 176955,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1188757.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jmzmeaney",
                "username": "jmzmeaney"
            },
            "url": "https://myanimelist.net/reviews.php?id=176955"
        },
        {
            "content": "[This review will not contain spoilers]\r\nWell, for starters I must say I did not enjoy this anime but I will give credit where credit is due.\r\nI don’t the the whole idea of sexualizing some little girls into this extend (so many lower angle shots and other stuff that made me cringe) or the whole magic girl idea that Japan seems to like for whatever reason. I must say that I watched this because some Fate/ fans friends told me that 3Rei was good and was worth watching the previous seasons first (I’m still to check that for myself).\r\n[ Story | 6 ]\r\nThe story, for me,is boring. Plain and simple. I don’t find joy in watching some “magical girls” over moe-fied to funny stuff while fighting the evils of the world. Leaving that aside, the plot is WELL CONSTRUCTED. Why do I say with this? The mechanics are based of facts already used in the main Fate/ franchise, like the origin of the Kaleido sticks, servants, dimensions od, mana, prana, and some other things. Those resources were used to create this universe and this story that while I find boring and not in my taste at all, I won’t deny the author did a good research and documented well before writing, and that’s always a good thing. You know, to keep consistency even if we are talking about an Alternate Universe (AU).\\n\\n\r\n[ Art | 7 ]\\n\r\nThe Animation is good. It has some flaws in some frames that do not move smoothly but overall is a good animation. I do not like the art-style tho, at all.\\n\r\nThe use of FX is great, you know there’s a lot of lights and explosions going around.\\n\\n\r\n[ Music | 7 ]\\n\r\nThe best part of it, the music. Good OST, the music used for fights was really good. And inclusion of classic tracks like EMIYA make the music get a better rating, even when they are from FSN originally. I don’t say the same for the OP and ED that I didn’t like at all. (Would give it a 6)\\n\\n\r\n[ Character | 3 ]\\n\r\nYeah… this is weird… I like Illya, Rin and who else but in the real Fate/ franchise. This “Illya” tho… I don’t consider her Illya, but a character that looks like her in this AU. She doesn't have the qualities that made me like Illya in the first place, in fact, I highly dislike this Illya and almost all the characters. Same goes with Rin, just a shell of what she really is, I only see a over acted tsundere shell.\\n\\n\r\n[ Enjoyment | 4-5 ]\\n\r\nToo much stuff that I didn't like, while the animations are pretty is not enough for me to enjoy an anime. I can understand and accept that people may like anime like this but, this doesn’t seem to be something of my taste. Random power ups, sometimes ignoring principles already stated, lack of real character development.. fanservice on little girls…\\n\\n\r\n[ Overall | 4 ]\\n\r\nFor me, my rating is 4 (Bad) to 3 (Very bad). While I said that the plot has bases and the author documented to write its story, I still didn’t enjoy those 10 episodes. There were episodes better than others but for the most part I watched each episode with cringe or a serious expression. It was not something I would rate with 5 (average) or more since I didn’t enjoy the anime.",
            "date": "2016-07-26T12:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 225066,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4983061.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HumbertoZero",
                "username": "HumbertoZero"
            },
            "url": "https://myanimelist.net/reviews.php?id=225066"
        },
        {
            "content": "Quick Review.\r\nStory:\r\nDecent story derived from Fate/ series. Collection of cards by magical girls.\r\nNot deep by any means but works for the series and the fact that they keep it at 10 episodes actually helps. The pace was quick which worked for it.\r\nArt:\r\nGrade A++. Phenomenal artwork, animation work. Gorgeous lighting.\r\nSmall things such as the refracted lighting, glow of the outlines, beautiful backdrops; just really, really skilled execution in the art section. Principles of animation used often and successfully gives personality to the characters (squash stretch, pose-to-pose, etc). Effects are corful and fun.\r\nThe quality of art made this series fun to watch.\r\nSound:\r\nGood music. Loved the opening andEDs. Mood music set the mood right.\\n\r\nLove the piano work. It's subtle but fits in well with the slower sections of each episode.\\n\\n\r\nCharacter:\\n\r\nDecent character development. Not fully developed as there are more seasons to come. But, good start. Typical magical girl anime character development. Drama ensues. Lots of crying. Lots of good feels too. Also some etchy but not too much.\\n\\n\r\nEnjoyment:\\n\r\nFun to watch. Fate/ references and cameos welcomed. \\n\r\nAnimation and effects top notch.\\n\\n\r\nOverall:\\n\r\n9. Fun to watch. \\n\r\nDon't expect a deep series. But expect to enjoy it since it is short and fun.\\n\r\nAlso if you watched the Fate/ series, you'll enjoy the twist on each character.\\n",
            "date": "2016-09-02T18:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 228141,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56564.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xdzzz",
                "username": "xdzzz"
            },
            "url": "https://myanimelist.net/reviews.php?id=228141"
        },
        {
            "content": "Where Fate/stay night meets Cardcaptor Sakura in a more kickass fashion.\r\nFate/kaleid liner Prisma Illya is a spin-off of Fate/stay night set in an alternate universe where Illyasviel von Einzbern is a magical girl. While it is directed by the same director as C³ - which was never really sure of what it wanted to be - Fate/kaleid knew exactly what it was and never tried to do anything else. It is a magical girl anime through and through and I wouldn't go into this expecting anything more.\r\nThe story is told in a simple, straight-forward fashion. It doesn’t take itself too seriously. It doesn’t try toohard to be deep and meaningful. Some may argue that this makes the story is predictable. Yes, we all know how it's going to end - with good guys triumphing over the bad guys - but the part we're all really interested in is the filling of the sandwich, and that’s where the length of the series comes in. 10 episodes has its advantages and disadvantages. On one hand, it is fast paced and there are no fillers. However, on the other hand, it lacks detail in the story. In the case of Fate/kaleid, I think it could’ve done a lot more with just 2-3 more episodes but it finished well and doesn’t leave you expecting more or questioning anything.\\n\\n\r\nWhile the series doesn’t have the same darker, more serious atmosphere that Fate/stay night and Fate/Zero do, the episodes were a good mix of action and comedic moments. The action scenes were well played out and not always entirely predictable.  I found the comedy enjoyable for the most part, but at times the dialogue felt forced. I did enjoy the comedic elements surround the Illya x Yuri ship. There was ample fanservice present for those who are interested but at times it felt extremely tacky and awkward, especially considering the age of the main characters, but if you’re into lolis… well… \\n\\n\r\nThe first thing I noted about the main characters is that they are all female. Shiro is very much a background character in this. Illya’s cheerful personality made her an enjoyable lead for the series and her naivety added to the comedy. Miyu was a good compliment for Illya; initially a cold and distant high achiever but gradually warms up to Illya. Rin returns as her beloved tsundere self, although her rivalry and constant bickering with Luvia became rather tiresome at times. The Kaleido Sticks are more for comedic relief than anything else. All your favourite Heroic Spirits also feature in the series. The story isn’t made for character development but the set of characters works well for the purpose. \\n\\n\r\nVisually, this is no ufotable adaptation. However, that’s not to say it didn’t look good. The colours and backgrounds were gorgeous. The character design wasn’t particularly detailed but the outfits fit the magical girl vibe. I thought the action scenes were particularly well done and on par with something out of Fate/Zero. The motions were fluid and the special effects were appealing. The scenes were really brought to life. A quick search of the animators revealed some of them worked on series such as FMA:B, Shakugan no Shana and Star Driver. \\n\\n\r\nI didn’t always notice the background music but I found it perfectly complimented the action scenes and amplified the intensity. The OP and ED themes were enjoyable and suitable for the genre. The voice actors portrayed the characters really well. It was nice to see the VAs for Rin and Illya return. Kaori Nazuka did an immensely better job as Miyu than the last role I heard her portray, as the Heroine in Amnesia. \\n\\n\r\nOverall, Fate/kaleid is by no means radical or ground-breaking but it is a cute, fun and exciting magical girl series. I am a fan of magical girl anime and would definitely recommend this to anyone who is also a fan of the genre. It will really appeal to the niche audience but if you're not a fan of the genre, this will do little to change your mind. For fans of the Fate/stay-night franchise, it is entertaining to see some of your favourite characters in an alternate universe and it is a good quality production but don’t expect a similar serious, dark atmosphere.\\n",
            "date": "2014-04-11T08:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 139549,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/388883.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendaryGirl-A",
                "username": "LegendaryGirl-A"
            },
            "url": "https://myanimelist.net/reviews.php?id=139549"
        },
        {
            "content": "I originally rolled my eyes when I heard about this. Fate/kaleid. A magical girl spinoff to one of my favorite anime franchises, the Fate franchise. While Fate/kaleid is not the first magical girl spinoff (that award goes to Nanoha, I believe), the Fate franchise is really really popular, and TYPE-MOON seems to have all intention of milking it out for as long as they can. So I came into this show expecting a happy-go-lucky magical girl show that would be little more than fanservice.\r\nBoy was I wrong.\r\nFate/kaleid tells the tale of Ilya. Unlike in the original Fate, Ilya has lived a perfectly normal life sofar and is just your typical girl. One day however, a magical girl staff comes crashing through her window when she's taking a bath and forces Ilya to become a magical girl. You see,Cards are messing up the lay lines or something like that, and originally the magic association sent two girls, Rin and Luvia, to capture these cards. However, Rin and Luvia hate each other and argued all the time, so the staffs ran away and picked new partners. And so, Ilya must fight the Heroic Spirits defending these cards alongside fellow magical girl Miyu, with Rin and Luvia helping the both of them out a bit.\\n\\n\r\nListen. Just because Fate/kaleid stars a bunch of fluffy magical girls does not mean it's all light and fun here. Fate/kaleid is more of a drama than a comedy. I'll even call it a deconstruction of the genre. Ilya and friends get hurt often and nearly die more than once. Ilya is forced to face exactly why she wants to become a magical girl and she realizes that's it's not all fluffy like shows on TV. And it deconstructs it perfectly, compared to another magical girl deconstruction (cough) Puella. The drama Ilya goes through feels real, expect one plot point I'll discuss later. \\n\\n\r\nAnd listen. Just because Fate/kaleid stars a bunch of magical girls does not mean that it can be freakin' badass when it wants to be. These battles are just a joy to watch, I'll even put them alongside Fate/Zero's battles, and those are amazing. The animation during these scenes get way better, they play a little epic track that's more or less a wannabe Yuki Kaijura that actually works, and the choreography is amazing. Due to the fact the danger is real this show, there's also a sense of suspension. Sure you know no one's going to die (dark one or not, this is still a magical girl spinoff), but it is still awesome.\\n\\n\r\nHowever, there's the category of the characters. My Rin's still Rin (I always forget how much I love her until I see her in action), and the two new characters, Luvia and Miyu, far nicely. Sure Luvia can be a little annoying at times and Miyu your typical mysterious emotionless transfer student who's perfect at everything but yet has problems making friends, but they're still fine. But Ilya? … Now, when creating spinoffs, an important factor is to keep your characters the same as they were before. Sure they're obviously going to be slightly different, but they still need to have a resemblance of the original in them. This Ilya is no way like the original Ilya however. While it does make sense as without her dark past, Ilya has no reason to become the half-insane “Bah-sah-kah, kill them!” girl we all know and love, I still want a little of that girl in there. However, this Ilya is just your typical magical girl heroine. Nice, a little shy, everyone loves her despite her mistakes... Aka, dull. \\n\\n\r\nAnd then comes the second problem with Fate/kaleid. It can get too dark. Now, I love darkness with a burning passion, but there is a difference between drama and forced drama. You all know the type of episode where the team splits up due to some trivial argument and gets back together at the end? Yeah. Well, Fate/kaleid has a whole arc of that. And it is so badly written. To put it simply, everything just goes bad for Ilya and she more or less loses her confidence she's gained as a magical girl due to the fact one of the characters decides to says she hates her, for a reason that does make sense but is originally done in such a terrible way. She then spends the episodes until the arc is over moping around and being so sad, I almost felt like crying. I mean, if you're going to make Ilya your typical girl, then give her a happy life. Let us see the normal Ilya. However, with the whole darkness of the show, I began to wonder, isn't there just one timeline where Ilya can be happy? This whole arc is horribly done and is pulled out in a way that makes no sense and is ended so easily (hey, at least we get to see a cameo from a Zero character), it almost made me want the happy-go-lucky magical girl spinoff I was expecting over some dark Puella ripoff (okay, the manga did come before Puella, but still). \\n\\n\r\nNow, the animation... I hate it. The animation is fine, but these have to be some of the ugliest character designs I have ever seen. It looks terrible. They were obviously trying to go for the overly cute and moe look, but I just cannot look at it. The lips are animated weirdly, all of the colors are so light, the hair and skin seems to glow, the eyes are weird, it just looks terrible. Some of the characters barely look like their original role. While things do look a little better in the gloriously animated action scenes, in the non-action scenes, it's just not pretty. The music, like I mentioned above, is rather awesome, with really epic tunes playing during the battle scenes and more relaxing, happy tunes playing during the non-battle scenes. The voice acting is also nice too. Expected though, considering most of these seiyuu have previous experience in their characters.\\n\\n\r\nDespite its flaws however, I just couldn't help but really enjoy Fate/kaleid. It was neat to see all of the characters I love in a new setting. And you don't even have to have any previous experience in the Fate franchise to enjoy this. You'll just miss some of the in-jokes. Fate/kaleid is a fun show, and I give it 8 out of 10 stars, though if it wasn't for the Fate name on it it would probably be 7. TYPE-MOON's plan worked apparently. I recommend this to any TYPE-MOON and magical girl fan. There's also going to be a season 2 coming out this winter, and I am looking forward to it.",
            "date": "2013-10-03T18:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 115291,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1523035.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Fujaku",
                "username": "Fujaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=115291"
        },
        {
            "content": "Whenever we're talking about Type-Moon's FATE SERIES, it's like we're talking about Mercedes-Benz. It's always about the quality, the execution of elegance, the prowess of what they're doing, and the legacy. In a one-word layman's term, it's the awesomeness.\r\nCompared to my previous reviews where I was talking about Lexus, Hyundai and BMW as metaphors and analogies for the anime that has nothing to do with cars, in Fate/Kalied Liner Prisma Illya (or Prisma Illya for short), I've got a definite reason of talking about Mercedes Benz--it's because Irisviel's sports coupe that Kiritsugu bought for her is the Mercedes-Benz 300SL!\r\nAnd the 300SL is the pioneering-gullwing Mercthat is as legendary as the Excalibur. It's like Saber with gullwing doors and headlights: agile, powerful, and considered as one of the most outstanding timeless cars with excellent ratings in all categories.\\n\\n\\n\r\nSTORY: 7\\n\r\nIn FATE series, you could say that if Fate/Stay Night is the Mercedes-Benz 300SL, then Fate/Zero has got to be the Mercedes-Benz SLS-AMG. Fate/Zero is just pure and ravishingly wicked and it's Urobuchi outdoing himself the same way that Mercedes-AMG has outdone themselves with creating the SLS-AMG. It's how Fate/Zero is the sacred predecessor of Fate/Stay Night in the same way as the SMS-AMG is the spiritual successor of the 300SL.\\n\r\nAs the SLS-AMG is the Holy Grail of the Mercedes-AMG, the Fate/Kaleid Liner Prisma Illya is, however, the Mercedes AMG-GT. Yes, it's Merc and yes it's AMG, and it's fast, but it's like a Mercedes-AMG but isn't. Prisma Illya is pretty much taken as that. You expect the FATE trademark and quality, and somehow you get a spin-off of a main-antagonist-turned-protagonist-turned-magical-girl. Yet, like the AMG GT, it's Mercedes-Benz and AMG under the bonnet and quality after all, in the very same way that Prisma-Illya still is part of the FATE series.\\n\\n\r\nThe story centers on Mai Kadowaki's ever-renowned character, Illyasviel Von Einzbern, the Teuton violet-clad Japanese-German loli-hybrid bent on winning the Holy Grail war in F/SN, gets a spin-off of becoming the MC magical girl collecting cards called \"Class Cards\" referenced from F/SN's seven Heroic Spirits or servants.\\n\\n\\n\r\nCHARACTER: 7\\n\r\nLet me put it this way. It's quite difficult to assess characters with spin-off roles, because they have a different role than the original, but still retains the same appearance, same personality, and even the same seiyuu. It's a make-or-break, really, to see if the spin-off version can handle or fill up the shoes that the original version initially has established.\\n\r\nIn the original Visual Novel (yes, I've finished the VN's three arcs: original, UBW, and Heaven's Feel; and watched F/SN animation, the Fate/Zero s1 and 2, Prisma Illya's season 2, and even Carnival Phantasm), even Illya has gone from the initial smirking antagonist to someone who's clingy and moe. Then there's Rin Tohsaka, who, even in the original Fate/Stay Night, serves as the walking-dictionary-slash-instruction-manual for the MC and yes, we saw her reprise that role.\\n\r\nThere are also two new characters for the Fate/Kaleid Liner installment: Miyu, who's a kuudere and the yuri partner of Illya; and Luvia-sama, who's very good trait that I like about her is she's voiced by Shizuka Itou.\\n\\n\\n\r\nART: 10\\n\r\nThis is art from Type-Moon we're talking about. Saying some nonsense about the way the artwork is made is like saying Mercedes-Benz cars are unattractive. Art concern alone, FATE has nailed that since 2004.\\n\\n\\n\r\nSOUND: 6\\n\r\nThe opening/ending songs are great and Illya-sounding, really. However, we're missing something: we're missing Yuki Kajiura here. And that's very much exactly like missing the SLS-AMG's 6,208cc 6.2liter M159 V8 engine, when you'd know that the AMG-GT now only has the 3,982cc 4.0liter M178 twin-turbo V8.\\n\r\nYet, there's a promise, seiyuu-wise, where seiyuus retained their original and renowned roles from the original Fate: Mai Kadowaki voicing Illya, Kana Ueda voicing Rin, even Ayako Kawasumi has her cameo as Saber; then new roles for the chosen awesome seiyuus: Kaori Nazuka for Miyu, and Shizuka Itou for Luvia-sama.\\n\r\nBut then again, there are no Yuki Kajiura compositions here.\\n\\n\\n\r\nENJOYMENT: 7\\n\r\nDespite all its spin-off elements and a story where it has exactly nothing to do with the Holy Grail war, because that's what the Fate-series is all about, Prisma-Illya is still enjoyable and worth watching if you treat it as a magical-girl anime. Like I said earlier in Mercedes-Benz analogy, the AMG-GT is a Merc, but somehow it isn't. If you treat that as an SLS-AMG, then you'd rather be better off buying the Porsche 911. Or the Jaguar F-Type. Everybody loves Jag.\\n\\n\\n\r\nOVERALL: 7\\n\r\nI have no qualms about this, even if it causes real FATE-oriented fans/otakus to bat their eyebrows, and gives moe pigs a reason to smile like Chesire Cat (especially if they've or you've watched the specials).\\n\r\nAll in all, it's to be expected when you've seen it yourself that Illya has become a magical girl, because as sentient as a human being you are, you'd immediately get the logic. You won't be scratching your head in comprehending it like how German Engineers solving and understanding calculations for their Merc's performance, you'd just automatically get it--as completely as understanding where this is going.\\n\r\nStill, Fate/Kaleid Liner Prisma Illya is a fun thing to watch even if it has nothing to do with the Holy Grail War. It makes a nice tally of all your magical-girl watch-list.\\n\\n\r\nVerdict: Fate/Kaleid Liner Prisma Illya is just like how you'd expect the Mercedes AMG-GT to be: it's Mercedes and it's AMG alright, but don't treat it as the SLS-AMG.",
            "date": "2015-05-03T00:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 187018,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3729929.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GiancarloLS",
                "username": "GiancarloLS"
            },
            "url": "https://myanimelist.net/reviews.php?id=187018"
        },
        {
            "content": "Since I can't be bothered to write a review for all three seasons that currently exist of Fate/Kaleid liner Prisma Illya, which will be shortened to Fate/Kaleid or variations of that for the rest of this review, this will apply to all of them. \r\nDon't let the apathetic attitude from the first paragraph mislead you, I love Fate/Kaleid, to the point where I was unable to watch any other anime until halfway through my 3rd back-to-back rewatch of the show because I just wanted to be watching Fate/Kaleid. \r\nFate/Kaleid does something that I see so many animes, including the original Fate/Stay Night 2006 adaptation, forgetabout. They actually show the normal lives of the characters beyond episode 1. I've seen so many TV shows arbitrarily decide that the magical adventure the characters are on is more important and interesting than their normal lives, and while this may be true in some cases, it also undermines the characters' motivations. Who cares if you're fighting to save the world from being destroyed if all we see of the world is the main characters fighting the bad guys? Fate/Kaleid will dedicate episodes to the characters just having a normal day, with a healthy amount of comedy thrown in. \\n\\n\r\nThis is something else Fate/Kaleid does well. It's one of the few animes that has legitimately made me laugh. Comedy in anime so often will either fall flat immediately or become overused to the point where it falls flat. Fate/Kaleid does neither, interspersing it where it needs to be and allowing the serious elements their time. It helps that the characters are often so adorable that I want to punch a steak to feel like a man again before I remember that my fists have all the power of a reasonably enthusiastic puppy and I give up entirely. \\n\\n\r\nThe show is not without its flaws. Tatsuko is obnoxious more often than funny (though thankfully she's only a recurring character rather than a main character), some of the rules of magic get wonky or nonsensical at times, and season 2 and beyond include some uncomfortable \"mana siphoning\" instances that make me start to wonder who exactly those scenes were made for. \\n\\n\r\nI still have more to say but I fear this review has gotten too long and is almost entirely just me gushing about how much I like this show. It's probably not for everybody, but I know I sure loved it, which is especially impressive because I thought Fate/Stay Night was rotting trash. In the interest of ending on a light note, Fate/Kaleid is like watching a puppy and a kitten snuggle up together in the fur of a large bunny. It's probably not high art, but it sure does make you happy to watch.",
            "date": "2016-02-08T22:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 210475,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4699058.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NotAnElk",
                "username": "NotAnElk"
            },
            "url": "https://myanimelist.net/reviews.php?id=210475"
        },
        {
            "content": "To be honest I don't like the Fate series in general. And yet somehow the spin-off of the series turned out BRILLIANT. Also keep in mind that normally I don't like the whole magical girls idea thing at all.\r\nRin (from Fate stay) and Levi (original I guess?), along with their 2 magical wands (...damn you Seitokai...) are on a mission to collect all the heroic spirit cards for the archmage in Germany. The wands, (Ruby & Sapphire) have a will of their own and eventually get tired of their masters' constant fights, so they go ahead and choose new masters, 2 girls seemingly chosen atrandom (in Ruby's case perhaps with a bit more illegal purposes in mind). Illya, daughter of Irisviel and Kiritsugu, is chosen by Ruby and Sapphire chooses Miyu, a homeless girl of unknown background. The former masters find the respective girls and decide to take them under protection/training in order to complete their mission.\\n\\n\r\nTo be clear about the genre, the show has some very dark moments, but is still overflowed with fanservice by the 9 year olds (yes you heard right, no I don't care if you have ethical issues with that, get over it.). The second season, heavily influenced by 2014's homo aura introduces waaaaaayyyyyy too much yuri to the list (not that the first season was yuri-free). Something I really like about the show is that it doesn't let us forget that both Illya and Miyu are still children, they have many preteen problems to overcome + things they don't understand, which would actually make the series a bit too heavy on drama if it wasn't for the fanservice \"goofiness\". \\n\\n\r\nFor the action part the anime does astoundingly well. The animations are great and there is no more talking than needed. The heroic spirits are all tough to beat, but more than physically they press the girls psychologically (the part I mentioned about them still being kids). Neither of them are actually prepared to \"fight to the death\" like Luvia and Rin are, and especially Illya will go through panic stages quite a few times. While we're at it, the anime does a FANTASTIC job with character developement. Both Illya and Miyu go through a looot of tough decisions regarding what they should do, what is right and how they feel about situations. Some could argue that Illya is way too whiny and a scaredy-cat but again people, it's f£%^ing 9year old.\\n\\n\r\nThings that I really loved about this anime:\\n\r\n1)The ages of the characters fit their behaviour.\\n\\n\r\n2)Oooooh the wonderful fanservice...\\n\\n\r\n3)Good sense of humor.\\n\\n\r\n4)Fast-paced, very well animated battles. + the opponents take way more than \"a few good hits\" to be beaten.\\n\\n\r\n5)Ruby's character, just priceless.\\n\\n\r\n6)VERY dark and depressing moments at times.\\n\\n\r\n7) Saber going terminator even down to her walking style, wearing 50 KG plate armor while shooting off Getsuga Tenshous as predator music plays on the background while the girls have nearly pissed themselves. (The testosterone levels are rediculously high on this one.)\\n\\n\r\nIt doesn't matter if you're a fan of the fate series or not. I 100% suggest this anime to almost everyone, so long as you don't have moral issues about 9 year olds giving fanservice.",
            "date": "2014-09-19T14:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 161035,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=161035"
        }
    ],
    [
        {
            "content": "The Fate universe has, in the works I’ve reviewed thus far, has generally formed a cohesive narrative whole – with the exception of clear comedic side-stories that are deliberately intended to be outside continuity like Carnival Phantasm. Others have adapted alternate routes of the visual novels that are part of Type-Moon’s Nasuverse (like Fate/Stay Night mostly adapting the Fate route and Unlimited Blade Works adapting that route). Fate/Prisma Illya is a true alternate take on the Fate Universe.\r\nIf I was to draw a comparison to another work of anime or manga, I’d compare this to the Shinji Ikari Raising Project manga. Like Shinji Ikari RaisingProject, it’s set in an alternate universe where the parents (or foster parents in the case of Shirou) of the protagonist of the original work are still alive. The protagonist(s) have to contend with a challenge which is similar to but not exactly identical to the challenge of the original work, with a mostly similar cast and a similar themes, but with less severe stakes, and a less dire tone, and shifted to a different genre\\n\\n\r\nThere are a few differences here from that formula – Kiritsugu and Irisviel are still alive, but are generally absent, with Kiritsugu and Iris traveling on work, with instead the two Einzbern maids – Sella and Leysritt, acting en loco parentis while Kiritsugu and Iris are absent. Also, the series shifts the protagonist status to Illyasviel (Illya), which fits with the genre shift – to a Magical Girl show.\\n\\n\r\nThe show follows Illya and a new character, Miyu. They are each recruited into being Magical Girls by two sentient Magical Girl Wands – Ruby and Sapphire (respectively) – both with the voices and personalities of Kohaku and Hisui of Tsukihime (respectively). Ruby and Sapphire were originally assigned to Rin Tohsaka (from Fate) and Luviagelita (Luvia) Edelfelt (who first appeared in the epilogue of UBW), who were in turn sent from the Magic Academy in London to retrieve a selection of “Class Cards” which has made an appearance in Fuyuki City. However, as we saw in the epilogue of UBW, Rin and Luvia get along like the components of a binary explosive. So, once Ruby and Sapphire have enough of Rin and Luvia’s bickering – they quit and find new masters.\\n\\n\r\nRin and Luvia end up serving as mentors for Illya and Miyu (respectively), as they fight to acquire the class cards, which means in turn defeating dark versions of the various Heroic Spirits from Fate/Stay Night (except for Assassin – that version is True Assassin, instead of Koujiro). This gives series a structure like a more serious version of Cardcaptor Sakura, with Illya and Miyu having to take on the Servant of the Episode, with two servants already captured by the start of the series – Lancer and Archer.\\n\\n\r\nIllya and Miyu have an interesting character dichotomy. Illya is a more conventional magical girl – not only in costume design, but in terms of worldview. She’s a fan of magical girl anime, and when Ruby tricks her into being a Magical Girl, she rolls with it pretty quickly, and completely gets the genre conventions. However, this means that when things get too dangerous and very serious, she falls into a real depression, due to the rather scary situation she finds herself in.\\n\\n\r\nBy comparison, Miyu falls into the archetype of the Dark Magical Girl. Like most versions of the archetype, the costume is more risque than the main magical girl. Miyu also has a more cynical outlook on life – and also a comedically serious worldview. Finally, she has a mysterious backstory that isn’t exactly explained in this season.\\n\\n\r\nThe show has a few significant minuses. For starters, this show has a little too much fanservice. Because the show is a magical girl show, instead of Illya being the age she is in Fate/Stay Night (16-18 – but with her growth magically stunted as a tactical decision for the next Grail War), she’s clearly middle-school aged. Putting aside where it puts things in terms of the timeline (Shirou, Rin, and Luvia are the same age they are in Fate/Stay Night), this brings up the issue of, well, middle school characters in skimpy outfits.\\n\\n\r\nSpecifically the “Install” costumes that Illya and Miyu have when they Install the various class cards are the worst offender of this. It’s like the various alternate “Equips” that Erza Scarlett has in Fairy Tail, except Erza is an adult, and these characters clearly aren’t. There’s some additional fanservice elsewhere that is unnecessary and off-putting, particularly in the episode where Illya learns Miyu is working as a maid for Luvia.\\n\\n\r\nAdditionally, to shove some additional moe tropes into the show, Illya is a bro-con. Illya having something of a twisted romantic attraction to Shirou worked in the main timeline, as while they are semi-related, they have also been raised completely apart. Here, they’ve been raised together, so there’s no excuse. As Genshiken said about these sort of tropes: \"I can vouch that they are the result of fantasies by people who don't actually have a younger sister.\"\\n\\n\r\nThe pacing of the show is also rather rushed. Most TV anime, minimum, have a 12-episode cour. This show has a 10-episode cour. The series had already been approved for a second season by the end of the first season – but a little research has shown that season (and the two following seasons) have all run 10 episodes as well. Missing those two episodes actually hurts the pace of the series considerably. I can’t speak for how well the material in the show covers the same amount of the material in the manga, but from where I sit as a viewer, the show just felt rushed. That said, having three seasons coming after makes this more forgivable, as we can get more character development and world building in later episodes of the series.",
            "date": "2017-05-01T14:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 246754,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1407177.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CountZeroOr",
                "username": "CountZeroOr"
            },
            "url": "https://myanimelist.net/reviews.php?id=246754"
        },
        {
            "content": "Before I start my review I would just like to say that I have never watched any other adaptations that involve the franchise of Fate other than this one so I do not know anything about these characters, the setting that they were originally in, and so on so forth, this is a review of this specific anime and not about how it is related to or how it has \"pulled down\" the Fate franchise and disappointed the fans, so if you're like me and decided you should start at a random place before getting into a show that has multiple adaptations, then this mayhelp. \\n\\n\r\nAlso, I would like to claim that this is my very first review so I do not expect to be the best at this type of thing, I only chose to review this based on its score coming from the audience, it really surprised me when I first saw it.\\n\\n\r\nWithout further ado...\\n\\n\r\nThis anime is definitely the kind of anime that people will judge just by looking at what is seen in its title picture. Sure, it looks very childish and the theme \"Mahou Shoujo\" does not seem very fitting for a franchise like Fate, but I feel as though we judge too quickly to understand how unexpectedly violent and horrific things can become by becoming a magical girl.\\n\\n\r\nStory - 7/10\\n\\n\r\nThe story itself was nothing grand, there were no plot twists, no huge backstories and no skipped topics, the story was played out like how a story should be done. The concept reminded me of another anime which involved collecting cards too.\\n\\n\r\nArt - 10/10\\n\\n\r\nThe art is something I would really like to point out because one of the factors that got me interested in the Fate series in general was the visuals that were presented. They were absolutely stunning and extremely colorful when it came to the action scenes, which is something I enjoy looking at. The animation was also very well put into this, which had really grabbed my attention after watching a couple episodes. I haven't enjoyed such great action scenes in a long time. They were fast paced, enjoyable and entertaining because it wasn't a repeated animation of them trading blows and swings which makes animation look cheap, but you could see the outline of where they swung and hit, which was amazing.\\n\\n\r\nSound - 7/10\\n\\n\r\nThe sound was perfectly fine, nothing spectacular stood out and nothing sounded out of place. The voice actors and actresses were well chosen for the personality and look for each character. The opening became a catchy tune to me overtime, and the ending was nice to listen to, no complaints.\\n\\n\r\nCharacter - 8/10 \\n\\n\r\nWhen creating a show, you definitely need characters that can entertain the viewer in some way, these characters do just that. The protagonist goes through the struggle of fighting these disasters, but also witnessing how life threatening the task that she was given can be. Her emotions which are usually cheerful and bright during her daily life change her into someone who is afraid and terrified of what her job is to do once she realizes the reality of her dreams.\\n\\n\r\nPersonal Enjoyment - 9/10\\n\\n\r\nThis was an amazing experience for me to watch, considering how I have never watched a realistic take on the \"mahou shoujo\" genre. It was fun to watch, but the first minutes and episodes did make me fall asleep a little. Other than that, this anime is definitely a thrill and very entertaining.\\n\\n\r\nOverall - 8.2/10\\n\\n\r\nSince this anime is where I started in the Fate franchise, I am extremely excited to see what the other adaptations are like. Overall, this anime is absolutely worth watching and I hope that people will stop bashing this anime just because it involves characters from the original adaptation and how this anime does not suit the original series. It is perfectly fine on it's own and I can't wait to see more of this show.\\n",
            "date": "2015-09-06T16:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 197973,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2035647.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ChillPhil",
                "username": "ChillPhil"
            },
            "url": "https://myanimelist.net/reviews.php?id=197973"
        },
        {
            "content": "Was expecting another grand Fate series, so definitely wasn't  going into this with the right mindset. I'll be blunt it is not like previous series and that is fine! Animation, is top notch as usual, didn't find any of the ost to particularly stand out, the new mains were alright, I do enjoy seeing some of our old favorites again :) even if some of them don't actually talk... ha  but all else aside was pleased with this first season. My biggest disappointment here is character development; I know there is still 3 seasons I have left to watch so my opinion onthe matter may very well change, also this season only had 12 episodes to do what it did. That being said, I still like my shows to have a little more depth to them (and this may just be me getting to old lol) and this one seemed a little superficial in nature. I did enjoy it though! Many laughs, much wow, such funny haha.  I do plan on finishing the series, but nothing from this 1st season makes me want to rush into it to finish without delay like other shows do at 3 am lol",
            "date": "2016-11-20T13:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 234079,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jbwrestler0218",
                "username": "jbwrestler0218"
            },
            "url": "https://myanimelist.net/reviews.php?id=234079"
        },
        {
            "content": "(This is more of a reflection on the entire series as a whole)\r\nHonestly I didn't think I would be writing a review on a magical girl spin-off of the Fate universe, but Fate/Kaleid left such an impression on me that I felt like putting my thoughts down at least. Fate/Kaleid is a great addition to the already expansive Fate universe acting as a pseudo Illya route for the people who wanted one. However, it's strong enough to stand alone as it's own separate show without the need of Fate universe knowledge. The show is just serious enough for the viewer to believe in theperil that the characters get in as well as have several dark tones and themes through the series three seasons. Fate/Kaleid masterfully melds enough slice of life to build up the characters in order to make the drama have impact. \\n\\n\r\nStory:\\n\r\nFate/Kaleid liner Prisma☆Illya follows Illyasviel Einsbern, a fifth grader, who unwillingly becomes a magical girl in order to collect class cards; a relic from the previous Holy Grail War. Although initially the anime adopts a \"monster of the week\" formula it slowly unveils it's overarching mystery about the reason for the cards existence, Illya and her friend Miyu backstory. \\n\\n\r\nArt:\\n\r\nThe bright colors used throughout the show is perfect for a show about magical girls, I mean they somehow made a fifth grader wearing pink apparel to look cool and badass and that's quite a feat. The animation is solid throughout the show with the fight scenes being a high point although it's no ufotable.\\n\\n\r\nSound:\\n\r\nAlright I'm slightly bias because the series composer is Tatsuya Kato, and he's just the best goddamn composer in the anime industry. Not only does his tracks fit well with the show itself but there's a few notable tracks that are just fantastic by themselves as well as his take on the famous EMIYA track. The sound effects in Fate/Kaleid work for most of the parts, but some of the attacks lack a bit of \"umphf\" and sound a tad lackluster especially compared to some of the other anime out there like YZQ or ufotable UBW.\\n\\n\r\nI know I completely ignored the biggest complaint about the show, the yuri and fanservice, but Fate/Kaleid really is much more then that.",
            "date": "2016-03-12T15:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 212794,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TurnipGod",
                "username": "TurnipGod"
            },
            "url": "https://myanimelist.net/reviews.php?id=212794"
        },
        {
            "content": "Fate-kaleid liner Prisma☆Illya\r\n YESSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS S, IT’S SOOOOO GOOOOOOOD ~~~~ Not even yuri, not even mana sharing and it ended up being the best Fate related material in existence. Seriously, super seriously serious, mahou shoujo like this is amazing, so freaking wonderful, so absolutely fantastic, so incredibly awesome. I don’t care what you like, what you dislike, I don’t care what you think about mahou shoujo’s, watch this anime, do it for your anime filled heart, do it for your soul, do it to experience ultimate badass awesomeness that is escalated a thousand fold and doesn’t stop, you won’t regret it, it’s impossible to regret; JUSTDO IT!\\n\\n\r\n Following 4 girls, Illya, Miyu, Rin and Luvia, we witness some of the most amazing things ever. Don’t worry about the lewd, aside from well-drawn lines nothing bad happens (I’m lying, there are fan-servicy aspects involved, it’s just not a lot….). Illya is the star of the show and holy crap does she deliver. The cutest girl, the most adorable eyes/eye color, insanely cute seiyuu, her personality, it’s freaking perfect, 100000% perfect, Illya is amazing,",
            "date": "2015-09-09T18:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 198239,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4568362.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/_Arcadia0",
                "username": "_Arcadia0"
            },
            "url": "https://myanimelist.net/reviews.php?id=198239"
        },
        {
            "content": "What may initially be cast as a throwaway, Fate-based interpretation of the mahou shoujo theme turns out to be a pretty decent show. Fate Ilya (as I will call it) is about an almost normal elementary girl, Ilya, who is suddenly burdened with having to collect magical cards representing each of the seven Fate warrior types. She is joined by her mentor, a hot-headed Tousaka, and another pair of mahou shoujo and mentor. This part-comedy part-action thriller is overall a fun watch with a lot of parodies of other Fate works. I highly recommend watching shows that this references first (Fate/Stay Night, Fate Zero, andUnlimited Blade Works) or your enjoyment will probably be cut by at least half (and you'll miss out on a lot of important, unexplained context). While the first few episodes may come a cross as light and childish in the mahou shoujo sense, the later episodes more than makes up for it with true Fate quality plot progression and storytelling. While not a perfect work, this is a fun and welcome addition to the Fate lineup.\\n\\n\r\nAnimation:\\n\r\nFirst off, let's calibrate expectations. Fate Zero and Unlimited Blade Works were tremendous feats of animation that were like piñatas full of eye candy. Fate Ilya is not in that tier but probably more in line with what we saw in Carnival Phantasm. Mind you, this series is actually animated by Silver Link, which has an overall mixed record with me. The overall series is well colored with good shading and appropriately light mahou moments and darker palettes fitting well with other Fate works. You can tell that the overall animation isn't as detailed as Ufotable works, but overall its decent by today's standards. Though some characters look slightly different (Tousaka and Shirou both looks younger), everyone is recognizable from previous Fate works. Seeing Tousaka in mahou shoujo garb is a humorous and worthy addition in and of itself. I won't give away specific characters, but do expect cameo appearances by various Fate warriors. My annoyances with this show include the (in my opinion) pointless transformation scenes and occasional abuse of CGI to pull of effects.\\n\\n\r\nThere is significant action in this show. Though not at the Fate Zero level, you do get some pretty significant battles with a lot of effects and pretty clever tactics. A lot of trademark Fate attacks are showcased in the show in addition to the generic mahou shoujo energy blast attacks, an interesting and well thought out addition. Surprisingly, certain parts of the show are pretty dark. Expect blood and light amounts of gore. Fan service wise, there isn't much for the child-molesting crowd here.\\n\\n\r\nSound:\\n\r\nThe show starts off with a very fitting OP with a nice melody. It ends with a playful tune fitting for the mahou shoujo theme. While the BGM is fair, you can easily tell that Yuki Kajiura wasn't involved with this series.\\n\\n\r\nThe VA cast is full of Fate veterans including the always welcome Kana Ueda and Mai Kadowaki. As a bonus, we even get a pompous performance from Shizuja Itou. Given the strong cast, you can expect a very good performance overall.\\n\\n\r\nStory:\\n\r\nRin Tousaka and Edelfelt, magical students and rivals, are given two magic wands as support in a mission to retrieve magical cards in our favorite Fate city. The two are in a pointless feud that irks their sentient wands into abandoning them and finding new masters. Thus, Ilya and a mysterious, quiet girl named Miyu become involved in the quest to retrieve the cards. Ilya gets more than she hoped for out of her \"fun\" experience as she's forced to fight for her life in order to help a virtual stranger retrieve these cards that have nothing to do with her. What challenges will the group face when they travel to the mirror world to retrieve the cards?\\n\\n\r\nThe show starts off a bit slow as it introduces the mahou theme and presents a few comic moments. However, it quickly turns to the serious business of collecting the dangerous magical cards. Expect multiple episodes to end on fairly significant cliffhangers. The show builds to a final climax where Ilya and Miyu's friendship and trust are tested. While the show does not have anywhere near the depth and continuity of Fate Zero, it is still above average in both execution and overall entertainment value. Expect some surprise moments late in the show that Fate veterans will appreciate.\\n\\n\r\nCharacter:\\n\r\nIlya's predicament here feels very similar to that faced by Valvrave and Gundam Seed's protagonists, she's forced into a hostile and unexpected situation where she must either adapt or face death. I personally like these situations as it allows for a very natural, dynamic character progression. The series does a fairly good job of following that path, as well as exploring some issues revolving around Ilya's friendship with Miyu. Oh yes, you get a lot of screen time with Tousaka, although she and Edelfelt feel more static as they're locked in a seemingly endless feud.\\n\\n\r\nValue:\\n\r\nDead serious in certain moments and comically childish at others, Fate Ilya is, overall, a much lighter addition to the Fate universe. While not as deep and involved as other Fate works, it still came across as a enjoyable watch with lots of fun references to other Fate works. For those who have watched Phantasmoon from Carnival Phantasm, know that this is a much more focused work with an actual plot. Fate Ilya is a pretty good show that manages to unify the mahou shoujo and Fate themes without distorting the selling points of either category. As it's such a short show, I recommend giving it a go if you've got nothing better to do.",
            "date": "2015-11-07T23:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 202934,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202934"
        },
        {
            "content": "FATE/KALEID LINER PRISMA ILLYA: It’s fun to see the Fate characters in an entirely different story\r\nI really appreciate how this anime has reconstructed the Fate universe in a way that would make it suitable for a Mahou Shoujo story, and how it utilized younger versions of characters from Fate/Stay Night to strengthen the magical impression. But looking at the story at a technical perspective, there’s not much to it. It’s just about Illya going around hunting for the Class cards. There are no subtle, interweaving plot points. It is very direct -- well, at least in the first four or five episodes. The story doeshave its turns, and this is obvious in the second half of the series. I like how the second half has given room to add emotion to the plot. At this point, it is not just about Illya defeating one Class card to the next monotonously. The characters have also opened for character development.\\n\\n\r\nSpeaking of the characters, Fate/Kaleid Liner Prisma Illya has interesting ones. They’re not complicated enough to deserve complex psychological analyses and such, but they are very fun characters with little conflicts in their heads to keep things interesting enough. A good example of this is Miyu, and how she cannot fly because she is too theoretical and lacking in imagination. This has been contradicted to Illya’s imaginative personality, which makes it quite easy for her to use magic. Rin, Luvia, and the talking Kaleidosticks are also very interesting. Their interactions and conflicts are nothing complicated and deep, but they sure are entertaining to see.\\n\\n\r\nThe music is nothing special, but it does deliver in communicating the emotions that the scenes require. As for the animation, there are certain sequences that look marvellous, particularly in the fighting sequences, but nothing too fancy that you could call groundbreaking -- just enough to deliver.\\n\\n\r\nThis anime is very entertaining, even though the plotline doesn’t have that much threads to weave. The genuinely comedic dialogue and actions help to counterbalance this flaw. However, I admit that there are more other flaws in the plot. There are instances that seem to be too random that they felt like a cop-out, like how Illya suddenly transforms into Archer and uses Excalibur. But that’s alright, I wasn’t expecting a complicated story anyway. The fact that I see the Fate characters once again, even though not in the way they were in the original series, is a joy in itself.\\n\\n\r\nBut there are subtle hints in the ending that the Fate/Stay Night characters are not just the only characters that I’ll see in the next season. It appears that characters from Fate/Zero will be featured as well. I could be wrong, but I hope I’m not. Overall, I really enjoyed Fate/Kaleid Liner Prisma Illya. Seeing the characters from the Fate franchise interacting in an entirely different story is really entertaining, and sometimes even comedic. I’ll definitely watch the next seasons of this anime.\\n",
            "date": "2013-11-14T18:32:00+00:00",
            "helpful_count": 0,
            "mal_id": 120277,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3337251.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pageprophet",
                "username": "pageprophet"
            },
            "url": "https://myanimelist.net/reviews.php?id=120277"
        }
    ]
]