[
    [
        {
            "content": "\"To be the man, you gotta beat the man\". \r\n- Ric Flair\r\nBeing a superhero is never easy, especially when you try to live a double life. Superheroes like Batman, Superman, and Spiderman deals with the dangers they get exposed to on a daily basis. They feel like it's their responsibility to protect the innocent and deliver that strong sense of justice. After all, justice is the judgement of truth and to uphold such a sense comes at a great responsibility, sacrifice, and lives. \r\nThen there comes a hero at the darkest hour. He is ZET. Enter Zetman.\r\nThe story is set in the modern times withtechnology that passes our own in the real world. Such technology of course brings forth wealth, prosperity, hope, but also crime and monstrosity. Luckily for the good folks, we have heroes. \\n\\n\r\nNow, to call Jin a superhero would be an overstatement. He is in fact some of us see as a dark hero of vengeance. Or maybe, we should call him a dark angel. Because of his efforts, lives are saved but not without a cost. That's the price of being a hero. Sometimes, you just can't save everyone. Yet Jin is an interesting character if we look at him carefully. He is quite the mysterious figure and for most of us, difficult to read. After witnessing the tragedies of his past, Jin swears vengeance and to never let anyone else close to him die again. Now that my friends makes him the dark hero, the dark angel, and the holder of justice in a different light.\\n\\n\r\nThen, we have somewhat of the antithesis of the story, Kouge Amagi. Both academically and sports-inclined, he is also popular and has nearly everything he's ever wanted...wealth, admirers, and a family. Yet, there's one thing he seems to be missing and always wanted. That would be his dream of becoming a hero of justice, one that people admire, one that people respect, and one that helps the helpless. Unlike Jin however, Amagi's desire to become such a hero is quite on the opposite globe. (rather than for vengeance to say the least) In his mind, justice should be delivered and enemies of justice will be terminated. Bu it's a lot said easier than done. \\n\\n\r\nWe also have some of the other characters that lighten up the gloom and doom story a bit. The all innocent Konoha Amagi, and sister of Kouga, who has known Jin since their childhood times. The tomboy Hanako who has a curiosity in our dark hero (who also holds a dark secret) and among others. They tend to balance out the dark atmosphere and brings a little light as well as entertainment into the story.\\n\\n\r\nNow for the story. I'll best honest here, it's not really well performed. There's always a risk of making an anime adaptation off of a manga but even more so in this case because the amount of material it covers. There's a lot of potential and believe me, I want to see it at its finest form. Yet what I see so far is a rushed story based off a manga of over 150 chapters. It doesn't also help with the fact that the series only runs for 13 episodes. Thirteen episodes I'd repeat again! With that unlucky number, my hopes for the overall story is a little bit down with its rushed sequences. All in honesty, it kinda feels like reading a story with chapters missing. Oh yes, there are some awesome fights and blood gore if you can take it in the stomach. However, it feels that a piece of excitement is missing. This series could become a real blockbuster made for mature audiences with its old school action and violence. Yet with only 13 episodes, I just don't see how it could out perform some of the other longer series of this Spring. Maybe our heroes can save this series from being sent into turmoil.\\n\\n\r\nAs for the art, the series seems to adapt a bit of old school. With the old school-like art, it certainly spawns some nostalgia in some of us who have been anime fans. But this is a R+ rated story and a reason for that. There's bodies being torn opened, blood spilled, and showing what our heroes do best: delivering justice (even if it comes at a cost). \\n\\n\r\nThe sound is just \"meh\" in my opinion. It does contain drama and conveys the dark mood of the story but not something too noticeable. I do admit that the OP song, \"dots and lines\" by You Hitoto feat. Mummy-D, is performed well and give us a more suburban type of feeling. With the word \"Zet\" being mentioned several times, the songs brings out the dark hero out of the characters.\\n\\n\r\nWell, it is also not surprising that Masakazu Katsura was involved with the work of this series. He is Batman's biggest fan and we all know who he is. (at least I hope you do). As such, it is one of the possible main influences of his work. In fact, his influences can be even traced to another superheroes series that debuted last year. Maybe, Tiger & Bunny ring a bell? \\n\\n\r\nOverall, I'd say that this series just fits into the \"so-so\" for the Spring Season. It has entertainment value especially if you're into some fan-service and hardcore action. But if you can't take the violence and sexual content, then just hit that drop button and try something else. This series blends in the idea of a hero at the darkest hour and shows the cruelty of the world. Its approach of the dark hero genre will give you a strange feeling of both justice and also cruelty once you start watching. Yet, the story is blend and too rushed so for those looking for a complex storyline, then that little glimmer of hope may be crushed faster than a Player. However, if those aren't your criteria, then this series might be worth a shot. Try coming home from school or work, and watch this on your computer or TV with a nice cup of coffee (or w/e it is that you drink) and get into the OP song (while keeping up with the rhythm) after a tiring Monday. You might smile wishing that there are more heroes like Jin and Kouga to save you from all the tiredness of work/school. Or you might feel sad that there are such enemies of justice in the Zetman world. Yet, we all know one thing. \\n\\n\r\nThere is a hero, a hero living in all of us.",
            "date": "2012-06-18T22:57:00+00:00",
            "helpful_count": 123,
            "mal_id": 63781,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=63781"
        },
        {
            "content": "Heads up, this is not a faithful adaption to the manga.  I'm not saying it's going to suck but I was really looking forward to a anime adaption of the manga.  I was disappointed but you might not be.  \r\nPS.  I wish they used another voice actor for young Jin, it's just the voice is so unique that I can't get into Zetman mood when I keep thinking of FMA or Deadman Wonderland.",
            "date": "2012-04-06T13:50:00+00:00",
            "helpful_count": 64,
            "mal_id": 58075,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/224971.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ahuman",
                "username": "ahuman"
            },
            "url": "https://myanimelist.net/reviews.php?id=58075"
        },
        {
            "content": "Tales of Zetman\r\nThis will be a review from an anime-only viewer. Non-biased in any way whatsoever. (Also my first.)\r\nStory: \r\nThe Tales of Vesperia reference wasn't for nothing. Two youths that fight in the name of justice but with different ideals. In time their ideals mold who they are and how they serve the community. But that is just a small tidbit of the bigger plot. (Which really isn't that big.) An underground faction of corporate heads and scientists alike manifested these \"monsters\" called Players, or EVOL, for the mass entertainment of the wealthy class. These specimen broke free of their cage and now run free.The faction are trying to clean up a mess that they started and seek out someone to do it for them.\\n\\n\r\nThe EVOL, however, have developed minds of their own and wish to live in peace. But of course, not all have that intent.\\n\\n\r\nArt:\\n\r\nThe artwork is undeniably great. If you are not an accomplished artist yourself, you have no right so say this isn't good artwork. There's plenty of detail from the characters faces to the automobiles they ride in. Very satisfied in that department. The animation gets pretty sketchy when fight scenes roll around but you could say it is meant to be that way to express the speed of the battle. The action isn't very exciting if you've watched shows like Nisemonogatari and Senki Zesshou Symphogear. But it gets by with a Deadman Wonderland type of feel.\\n\\n\r\nSound:\\n\r\nThe music isn't anything noticeable as I've never really paid it much mind up to this point. That could be a good an bad thing whereas it is so subtle it can ease you in the mood of a setting without you knowing or simply make something boring. It's either, or. But that's the soundtrack. That OP Theme is on some next sh*t. 8D\\n\\n\r\nCharacter:\\n\r\nTo anyone who's played Tales of Vesperia, this story is all to familiar. You have your Yuri Lowell, Jin, a man of the people who does for not himself but those around him that need it. Not a penny to his name, Jin spends a lot of his time aiding the community in various ways. On the other hand, we have out Flynn Scifo, Amagi Kouga, who fights in the name of justice in his own way, albeit more flashy. Unlike Jin, Kouga is bound by his father's reign, and his lack of strength. Thus his fight to prove himself to Jin.\\n\\n\r\nEnjoyment:\\n\r\nI almost cried on the first episode. \\n\r\n..and on the second. And on the third. ;_;\\n\\n\r\nOverall:\\n\r\nZetman is a disappointment to its manga followers. But to those who are fresh to the series and enjoy a good strong gripping story with interesting characters reminiscent of Tiger and Bunny, it's worth the time. If your a manga reader and ready to moan n' groan, then steer clear of this adaptation. Otherwise, I'd recommend it to anyone who likes a good story of romance, justice, tears and corruption.",
            "date": "2012-05-04T21:09:00+00:00",
            "helpful_count": 39,
            "mal_id": 60543,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/104790.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shirt",
                "username": "Shirt"
            },
            "url": "https://myanimelist.net/reviews.php?id=60543"
        },
        {
            "content": "I was suprised by this Anime, Didn't think I'd like it that much.\r\nZetman is a Seinen. If you like violent stories, full of psychological warfare, Full of Blood, Monsters. You will surely and truly Like Zetman.\r\nThe Story was a bit confusing at first, Getting clearer and clearer throughout the Anime. Monsters created by Humans break the law and start killing they're creators. I liked the story.It's a dark anime. Violence everywhere, Blood everywhere, And bunch of psychological mind games happening to the characters. I gave it a 8.\r\nThe Art was good. Unique Art which differs from other Animes, Although I did not find it wasthe best, But yet good enought. I gave it a 7.\\n\\n\r\nSound. Some Good OST's, Okay Sound Effects, Good Voice Actors. I gave it a 7.\\n\\n\r\nThe Characters, I fell in they're story, Very Psychological for some of them. The Main Characters, are very Likable, I fell in they're world. I really liked the Psychological Warfare of the characters, They're reaction, They're thoughts.\\n\r\nIt made me worry about them, Worry about what Will happen to them and such. I gave it a 8.\\n\\n\r\nEnjoyment. Zetman was very enjoyable. Although being very crude and violent, I liked every bit of it. 8, Enought Said.\\n\\n\\n\r\nSo the Overall Note is 8. If you Like Seinen's, Violent, Bloody, Psychological Animes. Zetman is clearly for you, You should even give it a shot if you want to try, You won't regret it. A great Anime. I recommend it to anyone. (Mostly 18+ haha.) \\n\\n\r\nThanks for reading. :)\\n\\n\\n",
            "date": "2013-04-03T00:26:00+00:00",
            "helpful_count": 19,
            "mal_id": 92173,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1932138.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kruh",
                "username": "Kruh"
            },
            "url": "https://myanimelist.net/reviews.php?id=92173"
        },
        {
            "content": "What is the true meaning of justice? Is it doing the right thing no matter the situation, or achieving the right result no matter the cost? This is the question that ZETMAN centers around. What may seem like the right thing to do can actually end up not being the case and vice-versa, as shown many times throughout the series. The decisions that one comes to based on their kind of justice will undoubtedly vary from person to person. Thus, ZETMAN attempts to illustrate the effects of various viewpoints on justice within a city that is riddled with evil and crippled by the conflicting mindsetsthat its inhabitants carry. \\n\\n\r\nArt 7/10\\n\r\nPersonally, I found the art to resemble the quality of rough sketches that have been coloured in. The sharp strokes and uneven outlines of the artwork, although I haven't seen it too often in the anime I have watched, didn't really impress me all that much and took a while to get used to, especially when it came to the characters themselves; I still wasn't able to fully appreciate it in the end. But in terms of fitting the anime's atmosphere, I thought this art style was a great choice. I found the roughness of the art actually enhanced my overall experience, even though I didn't really like it. \\n\\n\r\nCharacters 6/10\\n\r\nOn one hand, the character development was definitely there. Both the two main protagonists, Jin and Kōga, were easy to understand and empathize with by the series' end. However, a lot of their development had a tendency to feel rushed and/or forced, hurting the solidity of their characters. Although the change in their characters could be explained by the circumstances that they went through, I still felt it wasn't enough to fully justify their development. On the other hand, some of the minor characters lacked development and seemed, at most times, to just be an unimportant part of the story, like an extra in a movie. And when they did play a role, it wasn't easy to connect or relate to them, given the limited amount of information about their character as a whole. The vast amount of characters for a short series also made it hard to keep up with and/or recognize each one. In a nutshell, the presence of a few great characters was offset by a bunch of not-so-great ones. \\n\\n\r\nSound 7/10\\n\r\nThe highlight of this category is definitely the OP. While it took a while for me to get used to, I thought it was an excellent choice for an anime like ZETMAN. It's extremely catchy and does a good job in pumping the viewer up for the episode. The ED provides something different-a soft and slow song that follows a cliffhanger especially nicely. Aside from that the OST was unmemorable and the voice acting was average. \\n\\n\r\nStory 7/10\\n\r\nIn a way, the story of ZETMAN depicts the possible outcome of when humans abuse their scientific knowledge for their own pleasure and entertainment. Adding in the conflict between the two protagonists' different views on justice when it comes to dealing with the consequences of the aforementioned outcome and you have an interesting plot. Unfortunately, ZETMAN was unable to fully flesh out the potential of this basis and a lot of the story felt rushed. Accounting for the flow of the story in the manga, the anime, as agreed upon by many, paled in comparison. But that may have been due to the lack of time that the show was given (13 Episodes); maybe a 26-episode run would have greatly improved the overall entertainment value of the story. But as it stands, ZETMAN (the adaptation) ended up failing to build upon the solid foundation built by its predecessor. \\n\\n\r\nOverall 7/10\\n\r\nWhen you look at it in a general sense, ZETMAN was a decent anime. It had its good points (lots of action, an interesting premise, and two decent protagonists) but also had its flaws (rushed story and character development). Those who have read the manga will mostly say this adaptation was a complete flop, but by itself, there's no real glaring fault that makes it a complete failure. I'd recommend ZETMAN to anyone who enjoys a good mix of action (violence) and a decent story (nothing too special).",
            "date": "2012-07-19T17:29:00+00:00",
            "helpful_count": 15,
            "mal_id": 67087,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/382843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jeffrey-sama",
                "username": "Jeffrey-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=67087"
        },
        {
            "content": "Zetman - Just Wooow!\r\nFirst of all, Zetman is an adaptation of a manga with the same name. This \"Zetman\" is different from the manga because it follows its own way, however, the manga is canon, as you may know. With that, the artwork for the anime was magnificent. If you aren't following drawing artists or even amateur drawing artists, you don't have the right to tell me that this is not true art. As you know, there's plenty of detail in the characters and in the settings and that's obviously a good thing. When there's a fight sequence, you can even see the speed ofthe battle itself. So yeah, looks like there's a \"Hunter x Hunter\" done by Madhouse Studios vibe here, just saying.\\n\\n\r\nComparatively to the music, that's probably the lowest part has I can remember. I didn't like the Opening or Ending song but I recognize the artists work on the pieces of music.\\n\\n\r\nThe development of the characters is present in the series and is something positive. Both protagonists, Jin and Koga are characters easy to understand and sympathize until the last episode. The problem is that the scenes are forced or, in a way, they do not exist, so the viewer does not know (unless if you go read the original source). Another problem is that the smaller characters are not very fun and don't have an original personality as if they were extras in a movie. And this makes the main characters \"compensate\" screen time for not-so-important characters.\\n\\n\r\nAs for the enjoyment, yeah, the first episode was so epic yet unpredictable and I loved the series until the end. Overall, it was great.\\n\\n\r\nPeople like to compare the anime adaptation to the original manga but that's kinda wrong because, for these people, there are no expectations. If people create expectations with all kinds of adapted works, then they will always have their expectations shattered. If you are a manga reader just don't compare it because the anime adaptation goes its own way (again said).\\n\\n\r\nZetman was such a good and promising series and to be fair, I really can't remember the last time I watched such an exceptional series with great fight scenes, promising plot and also, dramatic moments.\\n\\n\r\nStory: 8 | Art: 9 | Sound: 7 | Character: 8 | Enjoyment: 9 |\\n\r\nScore: 8/10\\n\\n\r\nPersonal Note: I'm really glad that I watched this show. I would recommend it for people who liked Parasyte, for example.",
            "date": "2017-08-14T14:04:00+00:00",
            "helpful_count": 6,
            "mal_id": 255451,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4285163.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Chinaz",
                "username": "Chinaz"
            },
            "url": "https://myanimelist.net/reviews.php?id=255451"
        },
        {
            "content": "if you haven't read the manga you will probably enjoy this but if you have the way they completely demolish the story line will nearly bring a tear to your eye I am very unhappy with this anime they could have atleast kept the characters backstories the same but kouga doesn't even know about players when he shows up as alphas for the first time plus he should only have 1 arm the other should be a robotic prosthetic i really hope that this piece of shite will not hurt thechances of a proper zetman anime cause this was really bad atleast with stuff likegantz or berzerk animes they stick to the story just cutting it short with an alternate ending but this is like rewriting the whole story if they released it as a zetman ova series i might beable to enjoy it but this is a horrible anime to anyone who has read the manga. one good thing i will say the animation and drawing is very good",
            "date": "2012-06-11T10:07:00+00:00",
            "helpful_count": 10,
            "mal_id": 63177,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/cerbamofo",
                "username": "cerbamofo"
            },
            "url": "https://myanimelist.net/reviews.php?id=63177"
        },
        {
            "content": "Zetman was certainly one of those animes that had me a bit torn on whether or not I liked it. It certainly was different from a lot of the animes I do watch.\r\nI felt Zetman's strongest aspects were its artwork and story. The artwork for this anime was just gorgeous. This didn't have your typical shonen cartoony animaton feel. It had a dark, gritty story and had the animation to go with it. The story itself I felt was very solid as well. I was hooked as soon as I saw this was about a boy with supernatural powers born from the very monsters hewas hunting. What made this story's dynamics even more interesting is when Jin befriends Kouga and Konoha Amagi, two aristocratic children who also share the same goals as Jin, even though Jin knows about the darker, deeper evils that lurk within the shadows. While Jin is mostly sent on saving anyone and everyone, Kouga mostly wants to become an admirable superhero while Konoha just wants to help the less fortunate. It makes for a very interesting dynamic between the three characters later on in the series. I did also think this anime added some elements that are a bit edgy for your typical anime. I won't tell you what they are for spoilers sake, but let's just say this anime felt as though it wasn't afraid to add more adult elements to this story.\\n\\n\r\nWhile Zetman's story and art were great, it had a few things that I felt were major weaknesses in the story. First would be the Jin/Hanako relationship. This felt EXTREMELY forced. Yes, I understand the implications it had later on in the series (and for those of you that haven't seen the series, something happens that ultimately leads Jin to make a vital choice). However, this relationship seemed to take off before it could get a proper introduction. It felt as though Jin and Hanako run into each other, Jin saves Hanako, Hanako and Jin are bam, IMMEDIATELY in love. It just didn't feel right to me. Granted, I am a little biased because I didn't like Hanako's character from the start...but still, there didn't seem to be any buildup to their relationship. \\n\\n\r\nI can't feel like I can give this a proper review because this anime did set itself up for a sequel. For a first season (assuming there will be a second season), it built up an interesting story that I can't wait to see continue. This anime certainly had its ups-and-downs but I'll admit, I enjoyed it even though I did find it kinda flawed in some aspects.",
            "date": "2012-06-27T05:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 64533,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=64533"
        },
        {
            "content": "\"Zetman\", the story of genetically engineered \"creatures\" who fight for the amusement of powerful men. The story is simple, clean, and to the point. There is nothing overly deep here, but there doesn't need to be. For a 13 episode series \"Zetman\" was loads of fun and not as predictable as one may think. Sure the characters were cliche but the direction in which the story takes us was fresh and fulfilling. Most questions were answered by the last episode and the ones that weren't didn't really important. \r\nThe character models were really well done. Facial expressions were well defined, noses were realistically shaped and,lips were plump and rounded. However, color could have been used more rigorously while structural art was utterly forgettable with the exception of one or two scenes.\\n\\n\r\nThe opening theme is hit or miss. I enjoyed its simplicity and like Little John had little substance but nevertheless was fun to listen to. Ending theme was in my opinion very dull. BGM was okay and got a little better towards the end of the series as tensions rose.\\n\\n\r\nIt's important to take into account the brevity of the series as character development was hard pressed in a 13 episode action oriented anime. With that being said we see a very plot driven series whose character faults are forgivable. \\n\\n\r\nOverall I would definitely recommend \"Zetman\" for someone who doesn't want to invest too much time but still wants to be entertained.",
            "date": "2012-07-15T20:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 66637,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/snivek101",
                "username": "snivek101"
            },
            "url": "https://myanimelist.net/reviews.php?id=66637"
        },
        {
            "content": "so far i have seen six episodes and i  now look at what people have to say about this anime. It may not have some of the expressiveness of the manga but however i think once you get to episode six you will see it getting actually somewhat good...in the beginning it was ok not so exciting but however i pressed on and found out that once you keep watching i bet you might actually stick to it...maybe not your choice in the end..but however i think it is pretty good...in the end you know the anime never really goes for line for lineand illustration to illustration for each page of the manga itself now...just try it out and press on ...it is only 13 episodes not much really...so just try it out ...it is now starting to get quiet interesting now...",
            "date": "2012-05-07T19:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 60771,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/294124.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xXxLilithxXx",
                "username": "xXxLilithxXx"
            },
            "url": "https://myanimelist.net/reviews.php?id=60771"
        },
        {
            "content": "What can I said about it? It was an anime with enormous potential and up until episode 12 that potential existed. The last two episodes though basically screwed everything up. The anime starts kinda all over the place, but until the last two episodes is nothing that cannot easily be fixed. I will not give spoilers to the ones that still want to see it but you will be disapointed by the resolution of he show. Also Kouga is just a puppet from beginning to end even though he could have grown into a great character. The Jin character also develops quite nice until thelast episode when I guess the readers decided to do some marijuana or something because this seems to be the only explanation for what happens.",
            "date": "2015-12-30T13:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 207327,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481013.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/nightcrawlercyp",
                "username": "nightcrawlercyp"
            },
            "url": "https://myanimelist.net/reviews.php?id=207327"
        },
        {
            "content": "It's a bird, it's a plane' it's ZETMAN!!! This is my very first review and I'm glad I started it like that. Since this is my first review I will try my best not to write a bunch if garbage. Zetman is an anime I have been looking forward to ever since I saw the 2012 anime lineup online. The superhero genre does not really exist in anime since the only real superhero anime out there is Astro Boy, which is considered a classic and one of the first shonen anime/manga. The superhero genre I personally think has the potential to be a great additionto so many things that already make anime great. It can make you forget about slice of life and psychological thrillers if it is done properly. Zetman could have put this genre on the anime map. But like this review's introduction, this anime is anything but super. Zetman's premise sounds like the perfect set up for a crimefighting show. Monsters created by humans for humans' entertainment escape from their captivity into this world and our hero has to stop them. It is a fairly simple premise with which a lot can be done with but alas the creators miss the mark with failed execution. My main beef with this series is that it should have lasted longer. 13 Episodes is enough to tell a decent story, but the producers needed more time for what they were going for. I feel that not a lot of time was spent on character development with the exception of the two main characters. Every one else is just there to fill up space or to move the story along. I wish that viewers could see Jin(our protaganist) find out about his powers and how to control them,and it is never actually stated what ZET is specifically capable of doing, that you have to figure out for yourself as the series goes on.Everyone else's motives are never really explained. Why do they do what they do?They just do do what they do. What I really liked about the series was the way Kouga (the other hero) is tested to see what his idea of justice is.This was a character that I really liked . But that was really the only REAL exciting bit I thought there was. There is a real twist at the end which I didn't see coming so props to the writers for that.The sound of the anime was alright,with the voice acting quality about the same as your average anime. The OP was alright but I got sick of it 4 epsiodes in. The ending theme was a lot better but I think it could be because of my love for slow songs.Visually the the show is not bad, I just wish that more detail was put into the blood, which reminds me that the fight scenes were enjoyable as well as it supposed to be since this is a superhero show. In a nutshell here is the pros and cons of Zetman.\\n\\n\r\nPros:\\n\r\n-Kouga and Jin are good lead characters\\n\r\n-Nice ending theme\\n\r\n-Enjoyable fight scenes\\n\r\n-Twist near the end of the show\\n\r\n-Visuals are not that bad\\n\\n\r\nCons\\n\r\n-Average voice acting\\n\r\n-Very little character development\\n\r\n-Not a very good OP\\n\r\n-Invisible support characters\\n\r\n-Boring story\\n\r\n-Too short to cram everything in\\n\\n\r\nZetman is  something I would watch again but not for a while,it really is not that bad,but with my high anticipations for it it felt like a let down.I recommend it as a something you can watch to pass the time if you have nothing to do for the weekend.\\n\\n\r\n6/10",
            "date": "2012-07-09T14:11:00+00:00",
            "helpful_count": 5,
            "mal_id": 65853,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1386665.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cornercircle",
                "username": "Cornercircle"
            },
            "url": "https://myanimelist.net/reviews.php?id=65853"
        },
        {
            "content": "Animation: quite standard but the artists dare to give a lot of details for the facial expression\r\nCharacter Design: could have been better actually\r\nStory: quite so-so. Just another \"choosen one\" type of story which in the end ended up like the Dark Knight (Batman) i.e. trying to protect the city from within the darkness.\r\nGood Points: harsh reality tested on one of the characters, i.e. that the idealistic justice is unrealistic.",
            "date": "2012-06-30T19:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 64919,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/95361.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/siaokia1989",
                "username": "siaokia1989"
            },
            "url": "https://myanimelist.net/reviews.php?id=64919"
        },
        {
            "content": "I will assume you have read the Synopsis and you can assume this has nothing to do with the manga. \r\n===\r\nStory development: One of those that make you say 'wtf happened to...' a LOT. It tries to develop certain angles and, failing successfully, tries to  explain it in a one-liner or cut-through scene somewhere.\r\nArt: Decent. No missing body parts or outlines when necessary.\r\nSound: Imagine flicking thumb and middle finger to a beat. Quite like it.\r\nCharacter development: The main characters have depth to them that isn't a product of being loved too much or too little.\r\nAction: Really good when it happens. \r\nEnjoyment: Good to whileaway the hours.\\n\\n\r\n===\\n\r\nOverall: Im more than halfway done and I'm hoping I can say something better when I'm done.\\n\\n\\n\\n\\n\\n",
            "date": "2012-09-12T07:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 72183,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1503925.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Anyanka",
                "username": "Anyanka"
            },
            "url": "https://myanimelist.net/reviews.php?id=72183"
        },
        {
            "content": "Zetman was interesting to say the least. It was very action packed, and had some good suspense mixed in. I personally loved every minute. The character development was bold, but very relatable, the sound fit, the story fit. I found this anime quite outstanding.\r\nStory - 9. Great. The animation was emotionally investing. I've always stuck firmly with the idea that if a writer can hook the target audience emotionally, then the writer will have an easier time getting compliments on his work. It was certainly suspense worthy in that the threat was introduced in the beginning, and what the threat would do was left toour imagination until the very end. The reason I gave a nine rather than a ten is because I felt it was too short, this story had potential to grow for a very long time; sadly, it was left short. That's not to say the ending wasn't satisfying, I just felt as if there COULD be more.\\n\\n\r\nArt - 10. The artwork and animation was smooth. In fact, quite fluent, facial expressions did great, body motions showed strain, it was as real as real could get for anime.\\n\\n\r\nSound - 9. Very well placed. Starts off with an eerie tone, which is to be expected considering the threat is being introduced right off the bat, has slow instrumentals for the sad parts, and intense instrumentals for the fights. The sounds also match and are well timed. I took a point off here though because I really did NOT like the opening or ending credit selections. I felt as if they had nothing to do with the anime.\\n\\n\r\nCharacter - 10. The first episode hints towards some drastic character development from our main character and those around him. I was very right to assume that, as the some characters DID change drastically. To my surprise, the main character actually STAYED the same as he started though, in terms of psyche that is. Which actually strengthened the impact of the ending, because it was his immovable will and mind that really brought home the end. The character who was meant to change though did so very drastically, it was actually really cool to see, because his goals did not change, but they way he perceived and pursued took a huge turn, some would even say for the worse.\\n\\n\r\nEnjoyment - 9. I very much enjoyed this series, the sequence of actions were very easy to follow, with no fluff or filler, as every part had its place and reason for being there. It kept me wanting to watch to see what would happen and when. I took a point off here again, because of the short story though, I really believe this type of story has potential.\\n\\n\r\nOverall - 9. Overall, I am satisfied. Sadly, the average was a 9.4 rounded down to 9.0, but I feel with good reason. I personally believed that the writer was a master at manipulating emotion. He could make make sad when he wanted, making me mad when he wanted, and make me continue watching everytime. I just wish he would continue it, develop more, and pursue this series.",
            "date": "2015-03-29T18:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 184011,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1311859.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/weiluntong",
                "username": "weiluntong"
            },
            "url": "https://myanimelist.net/reviews.php?id=184011"
        },
        {
            "content": "What would you do to bring justice to people? How far will you go? What sacrifices will you make?\r\nThese ideas and more are explored throughout this show. Both in show and tell. It was another one of those days where i chose a random anime to watch and see how it goes. As always, my rule when doing this is that the show has 3 episodes to hook me or i just drop it and move on to another. There was no need for this one though. So let's explain why.\r\nStory: 9\r\nA show about two friends out to fight crime. One a rich kid witha sense of justice straight out of a Saturday morning superhero show. The other a slum kid who does it because the people need saved......and maybe to make some money along the way. A common goal forged by two different views. Can you see the picture I'm painting here? I'm actually reminded a lot about Gungrave when I watch this. They follow similar formulas and share a similar outcome. The point is, this is a story woven in with three other stories. All of which will have your full attention. The only downside I see with the story is that it feels rushed. A good example would be the the first two episodes. The first episodes starts off when they are kids, the second is when they are teens, and it gets a bit worse from there. All in all, its a good story and one I hear has it even better in the manga.\\n\\n\r\nArt: 8\\n\r\nBringing it back to the art style of older animes. Hard lines and grey gradient color scheme. I always enjoyed watching shows with this style because the action feels more gritty. Aside from that I didn't notice anything wrong with it.\\n\\n\r\nSound: 7\\n\r\nThe sound did it's job........... What? You want more? Fine. The Opening song is very different to the rest of the tone of the show but after a few episodes you will start to really enjoy it. Ending is pretty forgettable, consisting of a low, sad beat and it really only fit the mood of 1 episode. Voice acting is hit or miss. Sometimes the characters sound normal, others they sound like they are A. trying to hard and B. Actually reading from a script. The second one might have you going \"Well duh, they are.\", but you aren't suppose to feel that when listening to it.\\n\\n\r\nCharacter: 10\\n\r\nThis is where I feel the show really shines. Each main character has a very distinct personality. You know how you feel about each one. Not a theoretical feeling, a solid feeling about them. Whether it's a solid like or dislike. And that's what's great about them. They are so flushed out. Take our lead character Gin. He grew up as a slum kid with only his \"grandfather\" there to teach him the ways of the world. He never went to school, he only learned what was absolutely needed. You watch him grow and his ideals being forged, even after everything that he went through. I know I felt bad for him because I could relate with him a lot. I even had myself saying I'm sorry every time something bad happens. ACTUALLY SAYING I'M SORRY TO A 2-D CHARACTER. That is great character building right there.\\n\\n\r\nEnjoyment: 8\\n\r\nI enjoyed this show, if you couldn't tell already. Sure there are flaws and they are very noticeable but honestly I enjoyed every second of it. Especially when it can hit you in the feels. I would give this show a try. Who knows......\\n\\n\r\nMaybe you will question what justice means to you.\\n\\n\r\nOverall: 9",
            "date": "2017-03-07T09:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 242059,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6061538.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DarkScribe492",
                "username": "DarkScribe492"
            },
            "url": "https://myanimelist.net/reviews.php?id=242059"
        },
        {
            "content": "This is my short and hopefully sweet review of Zetman, which is an action anime that revolves around human engineered monsters called players, the rebellion of these \"players\" and the growth of the player hunter Zet.\r\nThe show in it's self isn't a bad watch. The art work, action scenes, voice acting, and characters, are all very good in my opinion. You can also tell there is a story good here. But without ever reading the manga, you can also tell that everything is rushed plot wise because of the series only being 13 episodes long.\r\nEverything appears to be disjointed or very hard to believe becausethe show expects you to have knowledge of the manga as well. Also to keep up with the time constraints, key plot points in the anime differ from the manga. Which isn't bad when done right \"see full metal alchemist\". But often you will not understand the history,bonds and breakdowns that some of characters have built up or gone threw because there is alot that went on in the manga that the anime does not relay at all.\\n\\n\r\nOverall this show is a classic example of why I believe most short anime series based on long running manga should stay true to the cannon and have \"no ending\", \"see Shigurui\". A show that lays the ground work for the series in great detail, but ends after the first arch is vastly better than a show that try's to jam 100 plus manga releases into a 300 minute anime Imo. \\n\\n\r\nAlso making an original story and sticking to it makes for a better short series than jumping between the cannon of a manga and what ever liberties the anime decided to come up with. \\n\\n\r\nIt's still a good watch for 13 eps, but don't expect to come away with anything more then alittle intro into the Zetman universe and some gory fight scenes.",
            "date": "2012-07-25T03:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 67669,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1045965.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xxAnjixx",
                "username": "xxAnjixx"
            },
            "url": "https://myanimelist.net/reviews.php?id=67669"
        },
        {
            "content": "[Portuguese-BR] \r\n\"Justiça\", é uma palavra um tanto curiosa, me pergunto até agora \"o que é a justiça?\". Bom Justiça de acordo com o google, seria um equilibrio, uma igualdade que deve ser razoável e imparcial entre os interesses, riquezas e oportunidades...\r\nNão está só resumido em \"fazer o bem\", pois assim como o \"bom\" pode ser interpretado de um jeito, o \"mau\" também pode, e assim a \"justiça\" é, cada um tem seu tipo de justiça, claro que a justiça que o google fala é muito boa, mas não esta certa, porém também não esta errada. \r\nO curioso do anime, é que a \"justiça\" ali tevedois lados, uma pessoa que só fazia a \"justiça\" como resultado de suas ações, e outra que a \"justiça\" era mais uma desculpa para receber elogios. Salvar pessoas, é justiça? Ao meu ver \"salvar pessoas\" não é justiça e sim uma \"boa ação\". \\n\\n\r\nJin, o protagonista, também conhecido como Zet, seu objetivo juntamente com o presidente da corporação Amagi, era exterminar todos os Players ou Evols (como preferir) como meio de sua vingaça, pois mataram seu \"avô\" Gorou Kanzaki que era seu criador.\\n\r\nEm certo episódio, Zet se encontra com Alphas, o Kouga Amagi em um incêndio provocado por um Player e após derrotar o player, Jin salva uma familia inteira, sendo que Kouga era contra salvar a mãe por estar machucada. \\n\r\nLogo após isso, Zet sai do local, deixando todo o crédito para o Alphas que não tinha feito nada de útil.\\n\\n\r\nKouga Amagi, bom ele que se diz ser um Herói, possui um certo sendo de \"justiça\" meio distorcido, porém não errado. Amagi é uma corporação, então Kouga futuramente seria o presidente dela, que até então essa posição era exercida por seu Avô. Obviamente uma familia muito rica, Kouga tendo tudo o que sempre quis, ganha sua armadura, a Alphas. Uma armadura que possibilitava a Kouga ser um \"Herói\". \\n\\n\r\nAmbos são muito diferentes como o preto e o branco, porém o menino rico que sonhava em ser um herói, mas nunca conseguiu fazer isso realmente. E o \"menino pobre\" era realmente um herói, porém era somente um resultado de suas ações. \\n\\n\r\nBom se eu for falar do anime inteiro aqui vou ficar muito tempo escrevendo, então é isso. \\n\r\nO anime é muito bom eu recomendo!\\n\\n\r\n[English-EUA] \\n\r\n\"Justice\" is a rather curious word, I ask myself until now \"what is justice?\". Good Justice according to google, would be a balance, an equality that should be reasonable and impartial between interests, riches and opportunities ...\\n\r\nIt is not only summarized in \"doing good,\" for just as \"good\" can be interpreted in a way, the \"bad\" can also, and so \"justice\" is, each has its kind of justice, of course the justice that google speaks is very good, but it is not right, but also not wrong.\\n\\n\r\nThe curious thing about the anime is that the \"justice\" there had two sides, a person who only did \"justice\" as a result of their actions, and another that \"justice\" was more an excuse to receive praise. Save people, is it justice? In my view \"saving people\" is not justice but a \"good deed\".\\n\\n\r\nJin, the protagonist, also known as Zet, his goal along with the president of the Amagi corporation, was to exterminate all Players or Evols (as he prefers) as a means of his revenge, as they killed his \"grandfather\" Gorou Kanzaki who was its creator.\\n\r\nIn a certain episode, Zet meets with Alphas, Kouga Amagi in a fire caused by a Player and after defeating the player, Jin saves an entire family, being that Kouga was against to save the mother by being injured.\\n\r\nSoon after that, Zet leaves the place, leaving all the credit for Alphas who had done nothing useful.\\n\\n\r\nKouga Amagi, well he is said to be a Hero, has a certain being of \"justice\" half distorted, but not wrong. Amagi is a corporation, so Kouga would later be her chairman, who until then had this position held by his Grandfather. Obviously a very rich family, Kouga having everything he ever wanted, gains his armor, Alphas. An armor that enabled Kouga to be a \"Hero\".\\n\\n\r\nBoth are very different like black and white, but the rich boy who dreamed of being a hero, but never really managed to do that. And the \"poor boy\" was really a hero, but it was only a result of his actions.\\n\\n\r\nWell if I'm going to talk about the whole anime here, I'll spend a lot of time writing, so that's it.\\n\r\nThe anime is very good I recommend!",
            "date": "2017-12-08T19:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 264807,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6735960.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Neurose",
                "username": "Neurose"
            },
            "url": "https://myanimelist.net/reviews.php?id=264807"
        },
        {
            "content": "This anime doesn't stand too far out from other anime and manga like Guyver and Devilman. But that is fine and not where the problem lays.\r\nStarting off there are a few things that start off rather ludicrous and out of touch with reality. I give those a pass and then the anime begins to pick up and I enjoy the pacing.\r\nbut then things are thrown in that aren't properly explained and are just completely ignored. One thing is something you'll come to see called \"The Ring of Exposure\" which is all I'll say without spoiling the story.\r\nThe character Alphas feels interesting and unique. You goon an emotional trip with him but that emotional trip is rushed and his character arc falls flat on it's face towards the ending.\\n\\n\r\nSome things regarding Zetman's powers are never explained and the anime ends on a note that gave me a quizzical look regarding the unsolved problem with his now double edged sword of a power.\\n\\n\r\nThe anime is good, the story was good but everything was rushed towards the ending. Now this makes sense since I found out that the manga was actually 20 volumes in comparison with this 13 episode anime adaption.\\n\\n\r\nI have know idea what the difference is with how situations are resolved so I can't entirely recommend it but if I was to guess, I'd read that.\\n\\n\r\nOver all this feels a little misdelivered but definitely a whole lot better then Casshern sins. If anyone wants to see something else like this or something with a superhero fighting monsters. I recommend the 2006 Guyver and the Baoh OVA.",
            "date": "2017-09-20T02:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 258106,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6522715.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/thatsuperheroguy",
                "username": "thatsuperheroguy"
            },
            "url": "https://myanimelist.net/reviews.php?id=258106"
        },
        {
            "content": "well definitely a great first episode. was hoping he would stay as a kid he looks cooler. though the anime would be a disappointment but i woundt say is that bad its just like any other super hero story. besides that aplhaidiot. dude really pisses me off. but what i thought really made this anime at least good is that first episode then everything goes downhill from there. lol",
            "date": "2013-02-03T02:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 85681,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1326165.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/johnL21",
                "username": "johnL21"
            },
            "url": "https://myanimelist.net/reviews.php?id=85681"
        }
    ],
    [
        {
            "content": "\"To be the man, you gotta beat the man\". \r\n- Ric Flair\r\nBeing a superhero is never easy, especially when you try to live a double life. Superheroes like Batman, Superman, and Spiderman deals with the dangers they get exposed to on a daily basis. They feel like it's their responsibility to protect the innocent and deliver that strong sense of justice. After all, justice is the judgement of truth and to uphold such a sense comes at a great responsibility, sacrifice, and lives. \r\nThen there comes a hero at the darkest hour. He is ZET. Enter Zetman.\r\nThe story is set in the modern times withtechnology that passes our own in the real world. Such technology of course brings forth wealth, prosperity, hope, but also crime and monstrosity. Luckily for the good folks, we have heroes. \\n\\n\r\nNow, to call Jin a superhero would be an overstatement. He is in fact some of us see as a dark hero of vengeance. Or maybe, we should call him a dark angel. Because of his efforts, lives are saved but not without a cost. That's the price of being a hero. Sometimes, you just can't save everyone. Yet Jin is an interesting character if we look at him carefully. He is quite the mysterious figure and for most of us, difficult to read. After witnessing the tragedies of his past, Jin swears vengeance and to never let anyone else close to him die again. Now that my friends makes him the dark hero, the dark angel, and the holder of justice in a different light.\\n\\n\r\nThen, we have somewhat of the antithesis of the story, Kouge Amagi. Both academically and sports-inclined, he is also popular and has nearly everything he's ever wanted...wealth, admirers, and a family. Yet, there's one thing he seems to be missing and always wanted. That would be his dream of becoming a hero of justice, one that people admire, one that people respect, and one that helps the helpless. Unlike Jin however, Amagi's desire to become such a hero is quite on the opposite globe. (rather than for vengeance to say the least) In his mind, justice should be delivered and enemies of justice will be terminated. Bu it's a lot said easier than done. \\n\\n\r\nWe also have some of the other characters that lighten up the gloom and doom story a bit. The all innocent Konoha Amagi, and sister of Kouga, who has known Jin since their childhood times. The tomboy Hanako who has a curiosity in our dark hero (who also holds a dark secret) and among others. They tend to balance out the dark atmosphere and brings a little light as well as entertainment into the story.\\n\\n\r\nNow for the story. I'll best honest here, it's not really well performed. There's always a risk of making an anime adaptation off of a manga but even more so in this case because the amount of material it covers. There's a lot of potential and believe me, I want to see it at its finest form. Yet what I see so far is a rushed story based off a manga of over 150 chapters. It doesn't also help with the fact that the series only runs for 13 episodes. Thirteen episodes I'd repeat again! With that unlucky number, my hopes for the overall story is a little bit down with its rushed sequences. All in honesty, it kinda feels like reading a story with chapters missing. Oh yes, there are some awesome fights and blood gore if you can take it in the stomach. However, it feels that a piece of excitement is missing. This series could become a real blockbuster made for mature audiences with its old school action and violence. Yet with only 13 episodes, I just don't see how it could out perform some of the other longer series of this Spring. Maybe our heroes can save this series from being sent into turmoil.\\n\\n\r\nAs for the art, the series seems to adapt a bit of old school. With the old school-like art, it certainly spawns some nostalgia in some of us who have been anime fans. But this is a R+ rated story and a reason for that. There's bodies being torn opened, blood spilled, and showing what our heroes do best: delivering justice (even if it comes at a cost). \\n\\n\r\nThe sound is just \"meh\" in my opinion. It does contain drama and conveys the dark mood of the story but not something too noticeable. I do admit that the OP song, \"dots and lines\" by You Hitoto feat. Mummy-D, is performed well and give us a more suburban type of feeling. With the word \"Zet\" being mentioned several times, the songs brings out the dark hero out of the characters.\\n\\n\r\nWell, it is also not surprising that Masakazu Katsura was involved with the work of this series. He is Batman's biggest fan and we all know who he is. (at least I hope you do). As such, it is one of the possible main influences of his work. In fact, his influences can be even traced to another superheroes series that debuted last year. Maybe, Tiger & Bunny ring a bell? \\n\\n\r\nOverall, I'd say that this series just fits into the \"so-so\" for the Spring Season. It has entertainment value especially if you're into some fan-service and hardcore action. But if you can't take the violence and sexual content, then just hit that drop button and try something else. This series blends in the idea of a hero at the darkest hour and shows the cruelty of the world. Its approach of the dark hero genre will give you a strange feeling of both justice and also cruelty once you start watching. Yet, the story is blend and too rushed so for those looking for a complex storyline, then that little glimmer of hope may be crushed faster than a Player. However, if those aren't your criteria, then this series might be worth a shot. Try coming home from school or work, and watch this on your computer or TV with a nice cup of coffee (or w/e it is that you drink) and get into the OP song (while keeping up with the rhythm) after a tiring Monday. You might smile wishing that there are more heroes like Jin and Kouga to save you from all the tiredness of work/school. Or you might feel sad that there are such enemies of justice in the Zetman world. Yet, we all know one thing. \\n\\n\r\nThere is a hero, a hero living in all of us.",
            "date": "2012-06-18T22:57:00+00:00",
            "helpful_count": 123,
            "mal_id": 63781,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=63781"
        },
        {
            "content": "Heads up, this is not a faithful adaption to the manga.  I'm not saying it's going to suck but I was really looking forward to a anime adaption of the manga.  I was disappointed but you might not be.  \r\nPS.  I wish they used another voice actor for young Jin, it's just the voice is so unique that I can't get into Zetman mood when I keep thinking of FMA or Deadman Wonderland.",
            "date": "2012-04-06T13:50:00+00:00",
            "helpful_count": 64,
            "mal_id": 58075,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/224971.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ahuman",
                "username": "ahuman"
            },
            "url": "https://myanimelist.net/reviews.php?id=58075"
        },
        {
            "content": "Tales of Zetman\r\nThis will be a review from an anime-only viewer. Non-biased in any way whatsoever. (Also my first.)\r\nStory: \r\nThe Tales of Vesperia reference wasn't for nothing. Two youths that fight in the name of justice but with different ideals. In time their ideals mold who they are and how they serve the community. But that is just a small tidbit of the bigger plot. (Which really isn't that big.) An underground faction of corporate heads and scientists alike manifested these \"monsters\" called Players, or EVOL, for the mass entertainment of the wealthy class. These specimen broke free of their cage and now run free.The faction are trying to clean up a mess that they started and seek out someone to do it for them.\\n\\n\r\nThe EVOL, however, have developed minds of their own and wish to live in peace. But of course, not all have that intent.\\n\\n\r\nArt:\\n\r\nThe artwork is undeniably great. If you are not an accomplished artist yourself, you have no right so say this isn't good artwork. There's plenty of detail from the characters faces to the automobiles they ride in. Very satisfied in that department. The animation gets pretty sketchy when fight scenes roll around but you could say it is meant to be that way to express the speed of the battle. The action isn't very exciting if you've watched shows like Nisemonogatari and Senki Zesshou Symphogear. But it gets by with a Deadman Wonderland type of feel.\\n\\n\r\nSound:\\n\r\nThe music isn't anything noticeable as I've never really paid it much mind up to this point. That could be a good an bad thing whereas it is so subtle it can ease you in the mood of a setting without you knowing or simply make something boring. It's either, or. But that's the soundtrack. That OP Theme is on some next sh*t. 8D\\n\\n\r\nCharacter:\\n\r\nTo anyone who's played Tales of Vesperia, this story is all to familiar. You have your Yuri Lowell, Jin, a man of the people who does for not himself but those around him that need it. Not a penny to his name, Jin spends a lot of his time aiding the community in various ways. On the other hand, we have out Flynn Scifo, Amagi Kouga, who fights in the name of justice in his own way, albeit more flashy. Unlike Jin, Kouga is bound by his father's reign, and his lack of strength. Thus his fight to prove himself to Jin.\\n\\n\r\nEnjoyment:\\n\r\nI almost cried on the first episode. \\n\r\n..and on the second. And on the third. ;_;\\n\\n\r\nOverall:\\n\r\nZetman is a disappointment to its manga followers. But to those who are fresh to the series and enjoy a good strong gripping story with interesting characters reminiscent of Tiger and Bunny, it's worth the time. If your a manga reader and ready to moan n' groan, then steer clear of this adaptation. Otherwise, I'd recommend it to anyone who likes a good story of romance, justice, tears and corruption.",
            "date": "2012-05-04T21:09:00+00:00",
            "helpful_count": 39,
            "mal_id": 60543,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/104790.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shirt",
                "username": "Shirt"
            },
            "url": "https://myanimelist.net/reviews.php?id=60543"
        },
        {
            "content": "I was suprised by this Anime, Didn't think I'd like it that much.\r\nZetman is a Seinen. If you like violent stories, full of psychological warfare, Full of Blood, Monsters. You will surely and truly Like Zetman.\r\nThe Story was a bit confusing at first, Getting clearer and clearer throughout the Anime. Monsters created by Humans break the law and start killing they're creators. I liked the story.It's a dark anime. Violence everywhere, Blood everywhere, And bunch of psychological mind games happening to the characters. I gave it a 8.\r\nThe Art was good. Unique Art which differs from other Animes, Although I did not find it wasthe best, But yet good enought. I gave it a 7.\\n\\n\r\nSound. Some Good OST's, Okay Sound Effects, Good Voice Actors. I gave it a 7.\\n\\n\r\nThe Characters, I fell in they're story, Very Psychological for some of them. The Main Characters, are very Likable, I fell in they're world. I really liked the Psychological Warfare of the characters, They're reaction, They're thoughts.\\n\r\nIt made me worry about them, Worry about what Will happen to them and such. I gave it a 8.\\n\\n\r\nEnjoyment. Zetman was very enjoyable. Although being very crude and violent, I liked every bit of it. 8, Enought Said.\\n\\n\\n\r\nSo the Overall Note is 8. If you Like Seinen's, Violent, Bloody, Psychological Animes. Zetman is clearly for you, You should even give it a shot if you want to try, You won't regret it. A great Anime. I recommend it to anyone. (Mostly 18+ haha.) \\n\\n\r\nThanks for reading. :)\\n\\n\\n",
            "date": "2013-04-03T00:26:00+00:00",
            "helpful_count": 19,
            "mal_id": 92173,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1932138.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kruh",
                "username": "Kruh"
            },
            "url": "https://myanimelist.net/reviews.php?id=92173"
        },
        {
            "content": "What is the true meaning of justice? Is it doing the right thing no matter the situation, or achieving the right result no matter the cost? This is the question that ZETMAN centers around. What may seem like the right thing to do can actually end up not being the case and vice-versa, as shown many times throughout the series. The decisions that one comes to based on their kind of justice will undoubtedly vary from person to person. Thus, ZETMAN attempts to illustrate the effects of various viewpoints on justice within a city that is riddled with evil and crippled by the conflicting mindsetsthat its inhabitants carry. \\n\\n\r\nArt 7/10\\n\r\nPersonally, I found the art to resemble the quality of rough sketches that have been coloured in. The sharp strokes and uneven outlines of the artwork, although I haven't seen it too often in the anime I have watched, didn't really impress me all that much and took a while to get used to, especially when it came to the characters themselves; I still wasn't able to fully appreciate it in the end. But in terms of fitting the anime's atmosphere, I thought this art style was a great choice. I found the roughness of the art actually enhanced my overall experience, even though I didn't really like it. \\n\\n\r\nCharacters 6/10\\n\r\nOn one hand, the character development was definitely there. Both the two main protagonists, Jin and Kōga, were easy to understand and empathize with by the series' end. However, a lot of their development had a tendency to feel rushed and/or forced, hurting the solidity of their characters. Although the change in their characters could be explained by the circumstances that they went through, I still felt it wasn't enough to fully justify their development. On the other hand, some of the minor characters lacked development and seemed, at most times, to just be an unimportant part of the story, like an extra in a movie. And when they did play a role, it wasn't easy to connect or relate to them, given the limited amount of information about their character as a whole. The vast amount of characters for a short series also made it hard to keep up with and/or recognize each one. In a nutshell, the presence of a few great characters was offset by a bunch of not-so-great ones. \\n\\n\r\nSound 7/10\\n\r\nThe highlight of this category is definitely the OP. While it took a while for me to get used to, I thought it was an excellent choice for an anime like ZETMAN. It's extremely catchy and does a good job in pumping the viewer up for the episode. The ED provides something different-a soft and slow song that follows a cliffhanger especially nicely. Aside from that the OST was unmemorable and the voice acting was average. \\n\\n\r\nStory 7/10\\n\r\nIn a way, the story of ZETMAN depicts the possible outcome of when humans abuse their scientific knowledge for their own pleasure and entertainment. Adding in the conflict between the two protagonists' different views on justice when it comes to dealing with the consequences of the aforementioned outcome and you have an interesting plot. Unfortunately, ZETMAN was unable to fully flesh out the potential of this basis and a lot of the story felt rushed. Accounting for the flow of the story in the manga, the anime, as agreed upon by many, paled in comparison. But that may have been due to the lack of time that the show was given (13 Episodes); maybe a 26-episode run would have greatly improved the overall entertainment value of the story. But as it stands, ZETMAN (the adaptation) ended up failing to build upon the solid foundation built by its predecessor. \\n\\n\r\nOverall 7/10\\n\r\nWhen you look at it in a general sense, ZETMAN was a decent anime. It had its good points (lots of action, an interesting premise, and two decent protagonists) but also had its flaws (rushed story and character development). Those who have read the manga will mostly say this adaptation was a complete flop, but by itself, there's no real glaring fault that makes it a complete failure. I'd recommend ZETMAN to anyone who enjoys a good mix of action (violence) and a decent story (nothing too special).",
            "date": "2012-07-19T17:29:00+00:00",
            "helpful_count": 15,
            "mal_id": 67087,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/382843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jeffrey-sama",
                "username": "Jeffrey-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=67087"
        },
        {
            "content": "Zetman - Just Wooow!\r\nFirst of all, Zetman is an adaptation of a manga with the same name. This \"Zetman\" is different from the manga because it follows its own way, however, the manga is canon, as you may know. With that, the artwork for the anime was magnificent. If you aren't following drawing artists or even amateur drawing artists, you don't have the right to tell me that this is not true art. As you know, there's plenty of detail in the characters and in the settings and that's obviously a good thing. When there's a fight sequence, you can even see the speed ofthe battle itself. So yeah, looks like there's a \"Hunter x Hunter\" done by Madhouse Studios vibe here, just saying.\\n\\n\r\nComparatively to the music, that's probably the lowest part has I can remember. I didn't like the Opening or Ending song but I recognize the artists work on the pieces of music.\\n\\n\r\nThe development of the characters is present in the series and is something positive. Both protagonists, Jin and Koga are characters easy to understand and sympathize until the last episode. The problem is that the scenes are forced or, in a way, they do not exist, so the viewer does not know (unless if you go read the original source). Another problem is that the smaller characters are not very fun and don't have an original personality as if they were extras in a movie. And this makes the main characters \"compensate\" screen time for not-so-important characters.\\n\\n\r\nAs for the enjoyment, yeah, the first episode was so epic yet unpredictable and I loved the series until the end. Overall, it was great.\\n\\n\r\nPeople like to compare the anime adaptation to the original manga but that's kinda wrong because, for these people, there are no expectations. If people create expectations with all kinds of adapted works, then they will always have their expectations shattered. If you are a manga reader just don't compare it because the anime adaptation goes its own way (again said).\\n\\n\r\nZetman was such a good and promising series and to be fair, I really can't remember the last time I watched such an exceptional series with great fight scenes, promising plot and also, dramatic moments.\\n\\n\r\nStory: 8 | Art: 9 | Sound: 7 | Character: 8 | Enjoyment: 9 |\\n\r\nScore: 8/10\\n\\n\r\nPersonal Note: I'm really glad that I watched this show. I would recommend it for people who liked Parasyte, for example.",
            "date": "2017-08-14T14:04:00+00:00",
            "helpful_count": 6,
            "mal_id": 255451,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4285163.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Chinaz",
                "username": "Chinaz"
            },
            "url": "https://myanimelist.net/reviews.php?id=255451"
        },
        {
            "content": "if you haven't read the manga you will probably enjoy this but if you have the way they completely demolish the story line will nearly bring a tear to your eye I am very unhappy with this anime they could have atleast kept the characters backstories the same but kouga doesn't even know about players when he shows up as alphas for the first time plus he should only have 1 arm the other should be a robotic prosthetic i really hope that this piece of shite will not hurt thechances of a proper zetman anime cause this was really bad atleast with stuff likegantz or berzerk animes they stick to the story just cutting it short with an alternate ending but this is like rewriting the whole story if they released it as a zetman ova series i might beable to enjoy it but this is a horrible anime to anyone who has read the manga. one good thing i will say the animation and drawing is very good",
            "date": "2012-06-11T10:07:00+00:00",
            "helpful_count": 10,
            "mal_id": 63177,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/cerbamofo",
                "username": "cerbamofo"
            },
            "url": "https://myanimelist.net/reviews.php?id=63177"
        },
        {
            "content": "Zetman was certainly one of those animes that had me a bit torn on whether or not I liked it. It certainly was different from a lot of the animes I do watch.\r\nI felt Zetman's strongest aspects were its artwork and story. The artwork for this anime was just gorgeous. This didn't have your typical shonen cartoony animaton feel. It had a dark, gritty story and had the animation to go with it. The story itself I felt was very solid as well. I was hooked as soon as I saw this was about a boy with supernatural powers born from the very monsters hewas hunting. What made this story's dynamics even more interesting is when Jin befriends Kouga and Konoha Amagi, two aristocratic children who also share the same goals as Jin, even though Jin knows about the darker, deeper evils that lurk within the shadows. While Jin is mostly sent on saving anyone and everyone, Kouga mostly wants to become an admirable superhero while Konoha just wants to help the less fortunate. It makes for a very interesting dynamic between the three characters later on in the series. I did also think this anime added some elements that are a bit edgy for your typical anime. I won't tell you what they are for spoilers sake, but let's just say this anime felt as though it wasn't afraid to add more adult elements to this story.\\n\\n\r\nWhile Zetman's story and art were great, it had a few things that I felt were major weaknesses in the story. First would be the Jin/Hanako relationship. This felt EXTREMELY forced. Yes, I understand the implications it had later on in the series (and for those of you that haven't seen the series, something happens that ultimately leads Jin to make a vital choice). However, this relationship seemed to take off before it could get a proper introduction. It felt as though Jin and Hanako run into each other, Jin saves Hanako, Hanako and Jin are bam, IMMEDIATELY in love. It just didn't feel right to me. Granted, I am a little biased because I didn't like Hanako's character from the start...but still, there didn't seem to be any buildup to their relationship. \\n\\n\r\nI can't feel like I can give this a proper review because this anime did set itself up for a sequel. For a first season (assuming there will be a second season), it built up an interesting story that I can't wait to see continue. This anime certainly had its ups-and-downs but I'll admit, I enjoyed it even though I did find it kinda flawed in some aspects.",
            "date": "2012-06-27T05:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 64533,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=64533"
        },
        {
            "content": "\"Zetman\", the story of genetically engineered \"creatures\" who fight for the amusement of powerful men. The story is simple, clean, and to the point. There is nothing overly deep here, but there doesn't need to be. For a 13 episode series \"Zetman\" was loads of fun and not as predictable as one may think. Sure the characters were cliche but the direction in which the story takes us was fresh and fulfilling. Most questions were answered by the last episode and the ones that weren't didn't really important. \r\nThe character models were really well done. Facial expressions were well defined, noses were realistically shaped and,lips were plump and rounded. However, color could have been used more rigorously while structural art was utterly forgettable with the exception of one or two scenes.\\n\\n\r\nThe opening theme is hit or miss. I enjoyed its simplicity and like Little John had little substance but nevertheless was fun to listen to. Ending theme was in my opinion very dull. BGM was okay and got a little better towards the end of the series as tensions rose.\\n\\n\r\nIt's important to take into account the brevity of the series as character development was hard pressed in a 13 episode action oriented anime. With that being said we see a very plot driven series whose character faults are forgivable. \\n\\n\r\nOverall I would definitely recommend \"Zetman\" for someone who doesn't want to invest too much time but still wants to be entertained.",
            "date": "2012-07-15T20:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 66637,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/snivek101",
                "username": "snivek101"
            },
            "url": "https://myanimelist.net/reviews.php?id=66637"
        },
        {
            "content": "so far i have seen six episodes and i  now look at what people have to say about this anime. It may not have some of the expressiveness of the manga but however i think once you get to episode six you will see it getting actually somewhat good...in the beginning it was ok not so exciting but however i pressed on and found out that once you keep watching i bet you might actually stick to it...maybe not your choice in the end..but however i think it is pretty good...in the end you know the anime never really goes for line for lineand illustration to illustration for each page of the manga itself now...just try it out and press on ...it is only 13 episodes not much really...so just try it out ...it is now starting to get quiet interesting now...",
            "date": "2012-05-07T19:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 60771,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/294124.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xXxLilithxXx",
                "username": "xXxLilithxXx"
            },
            "url": "https://myanimelist.net/reviews.php?id=60771"
        },
        {
            "content": "What can I said about it? It was an anime with enormous potential and up until episode 12 that potential existed. The last two episodes though basically screwed everything up. The anime starts kinda all over the place, but until the last two episodes is nothing that cannot easily be fixed. I will not give spoilers to the ones that still want to see it but you will be disapointed by the resolution of he show. Also Kouga is just a puppet from beginning to end even though he could have grown into a great character. The Jin character also develops quite nice until thelast episode when I guess the readers decided to do some marijuana or something because this seems to be the only explanation for what happens.",
            "date": "2015-12-30T13:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 207327,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481013.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/nightcrawlercyp",
                "username": "nightcrawlercyp"
            },
            "url": "https://myanimelist.net/reviews.php?id=207327"
        },
        {
            "content": "It's a bird, it's a plane' it's ZETMAN!!! This is my very first review and I'm glad I started it like that. Since this is my first review I will try my best not to write a bunch if garbage. Zetman is an anime I have been looking forward to ever since I saw the 2012 anime lineup online. The superhero genre does not really exist in anime since the only real superhero anime out there is Astro Boy, which is considered a classic and one of the first shonen anime/manga. The superhero genre I personally think has the potential to be a great additionto so many things that already make anime great. It can make you forget about slice of life and psychological thrillers if it is done properly. Zetman could have put this genre on the anime map. But like this review's introduction, this anime is anything but super. Zetman's premise sounds like the perfect set up for a crimefighting show. Monsters created by humans for humans' entertainment escape from their captivity into this world and our hero has to stop them. It is a fairly simple premise with which a lot can be done with but alas the creators miss the mark with failed execution. My main beef with this series is that it should have lasted longer. 13 Episodes is enough to tell a decent story, but the producers needed more time for what they were going for. I feel that not a lot of time was spent on character development with the exception of the two main characters. Every one else is just there to fill up space or to move the story along. I wish that viewers could see Jin(our protaganist) find out about his powers and how to control them,and it is never actually stated what ZET is specifically capable of doing, that you have to figure out for yourself as the series goes on.Everyone else's motives are never really explained. Why do they do what they do?They just do do what they do. What I really liked about the series was the way Kouga (the other hero) is tested to see what his idea of justice is.This was a character that I really liked . But that was really the only REAL exciting bit I thought there was. There is a real twist at the end which I didn't see coming so props to the writers for that.The sound of the anime was alright,with the voice acting quality about the same as your average anime. The OP was alright but I got sick of it 4 epsiodes in. The ending theme was a lot better but I think it could be because of my love for slow songs.Visually the the show is not bad, I just wish that more detail was put into the blood, which reminds me that the fight scenes were enjoyable as well as it supposed to be since this is a superhero show. In a nutshell here is the pros and cons of Zetman.\\n\\n\r\nPros:\\n\r\n-Kouga and Jin are good lead characters\\n\r\n-Nice ending theme\\n\r\n-Enjoyable fight scenes\\n\r\n-Twist near the end of the show\\n\r\n-Visuals are not that bad\\n\\n\r\nCons\\n\r\n-Average voice acting\\n\r\n-Very little character development\\n\r\n-Not a very good OP\\n\r\n-Invisible support characters\\n\r\n-Boring story\\n\r\n-Too short to cram everything in\\n\\n\r\nZetman is  something I would watch again but not for a while,it really is not that bad,but with my high anticipations for it it felt like a let down.I recommend it as a something you can watch to pass the time if you have nothing to do for the weekend.\\n\\n\r\n6/10",
            "date": "2012-07-09T14:11:00+00:00",
            "helpful_count": 5,
            "mal_id": 65853,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1386665.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cornercircle",
                "username": "Cornercircle"
            },
            "url": "https://myanimelist.net/reviews.php?id=65853"
        },
        {
            "content": "Animation: quite standard but the artists dare to give a lot of details for the facial expression\r\nCharacter Design: could have been better actually\r\nStory: quite so-so. Just another \"choosen one\" type of story which in the end ended up like the Dark Knight (Batman) i.e. trying to protect the city from within the darkness.\r\nGood Points: harsh reality tested on one of the characters, i.e. that the idealistic justice is unrealistic.",
            "date": "2012-06-30T19:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 64919,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/95361.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/siaokia1989",
                "username": "siaokia1989"
            },
            "url": "https://myanimelist.net/reviews.php?id=64919"
        },
        {
            "content": "I will assume you have read the Synopsis and you can assume this has nothing to do with the manga. \r\n===\r\nStory development: One of those that make you say 'wtf happened to...' a LOT. It tries to develop certain angles and, failing successfully, tries to  explain it in a one-liner or cut-through scene somewhere.\r\nArt: Decent. No missing body parts or outlines when necessary.\r\nSound: Imagine flicking thumb and middle finger to a beat. Quite like it.\r\nCharacter development: The main characters have depth to them that isn't a product of being loved too much or too little.\r\nAction: Really good when it happens. \r\nEnjoyment: Good to whileaway the hours.\\n\\n\r\n===\\n\r\nOverall: Im more than halfway done and I'm hoping I can say something better when I'm done.\\n\\n\\n\\n\\n\\n",
            "date": "2012-09-12T07:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 72183,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1503925.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Anyanka",
                "username": "Anyanka"
            },
            "url": "https://myanimelist.net/reviews.php?id=72183"
        },
        {
            "content": "Zetman was interesting to say the least. It was very action packed, and had some good suspense mixed in. I personally loved every minute. The character development was bold, but very relatable, the sound fit, the story fit. I found this anime quite outstanding.\r\nStory - 9. Great. The animation was emotionally investing. I've always stuck firmly with the idea that if a writer can hook the target audience emotionally, then the writer will have an easier time getting compliments on his work. It was certainly suspense worthy in that the threat was introduced in the beginning, and what the threat would do was left toour imagination until the very end. The reason I gave a nine rather than a ten is because I felt it was too short, this story had potential to grow for a very long time; sadly, it was left short. That's not to say the ending wasn't satisfying, I just felt as if there COULD be more.\\n\\n\r\nArt - 10. The artwork and animation was smooth. In fact, quite fluent, facial expressions did great, body motions showed strain, it was as real as real could get for anime.\\n\\n\r\nSound - 9. Very well placed. Starts off with an eerie tone, which is to be expected considering the threat is being introduced right off the bat, has slow instrumentals for the sad parts, and intense instrumentals for the fights. The sounds also match and are well timed. I took a point off here though because I really did NOT like the opening or ending credit selections. I felt as if they had nothing to do with the anime.\\n\\n\r\nCharacter - 10. The first episode hints towards some drastic character development from our main character and those around him. I was very right to assume that, as the some characters DID change drastically. To my surprise, the main character actually STAYED the same as he started though, in terms of psyche that is. Which actually strengthened the impact of the ending, because it was his immovable will and mind that really brought home the end. The character who was meant to change though did so very drastically, it was actually really cool to see, because his goals did not change, but they way he perceived and pursued took a huge turn, some would even say for the worse.\\n\\n\r\nEnjoyment - 9. I very much enjoyed this series, the sequence of actions were very easy to follow, with no fluff or filler, as every part had its place and reason for being there. It kept me wanting to watch to see what would happen and when. I took a point off here again, because of the short story though, I really believe this type of story has potential.\\n\\n\r\nOverall - 9. Overall, I am satisfied. Sadly, the average was a 9.4 rounded down to 9.0, but I feel with good reason. I personally believed that the writer was a master at manipulating emotion. He could make make sad when he wanted, making me mad when he wanted, and make me continue watching everytime. I just wish he would continue it, develop more, and pursue this series.",
            "date": "2015-03-29T18:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 184011,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1311859.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/weiluntong",
                "username": "weiluntong"
            },
            "url": "https://myanimelist.net/reviews.php?id=184011"
        },
        {
            "content": "What would you do to bring justice to people? How far will you go? What sacrifices will you make?\r\nThese ideas and more are explored throughout this show. Both in show and tell. It was another one of those days where i chose a random anime to watch and see how it goes. As always, my rule when doing this is that the show has 3 episodes to hook me or i just drop it and move on to another. There was no need for this one though. So let's explain why.\r\nStory: 9\r\nA show about two friends out to fight crime. One a rich kid witha sense of justice straight out of a Saturday morning superhero show. The other a slum kid who does it because the people need saved......and maybe to make some money along the way. A common goal forged by two different views. Can you see the picture I'm painting here? I'm actually reminded a lot about Gungrave when I watch this. They follow similar formulas and share a similar outcome. The point is, this is a story woven in with three other stories. All of which will have your full attention. The only downside I see with the story is that it feels rushed. A good example would be the the first two episodes. The first episodes starts off when they are kids, the second is when they are teens, and it gets a bit worse from there. All in all, its a good story and one I hear has it even better in the manga.\\n\\n\r\nArt: 8\\n\r\nBringing it back to the art style of older animes. Hard lines and grey gradient color scheme. I always enjoyed watching shows with this style because the action feels more gritty. Aside from that I didn't notice anything wrong with it.\\n\\n\r\nSound: 7\\n\r\nThe sound did it's job........... What? You want more? Fine. The Opening song is very different to the rest of the tone of the show but after a few episodes you will start to really enjoy it. Ending is pretty forgettable, consisting of a low, sad beat and it really only fit the mood of 1 episode. Voice acting is hit or miss. Sometimes the characters sound normal, others they sound like they are A. trying to hard and B. Actually reading from a script. The second one might have you going \"Well duh, they are.\", but you aren't suppose to feel that when listening to it.\\n\\n\r\nCharacter: 10\\n\r\nThis is where I feel the show really shines. Each main character has a very distinct personality. You know how you feel about each one. Not a theoretical feeling, a solid feeling about them. Whether it's a solid like or dislike. And that's what's great about them. They are so flushed out. Take our lead character Gin. He grew up as a slum kid with only his \"grandfather\" there to teach him the ways of the world. He never went to school, he only learned what was absolutely needed. You watch him grow and his ideals being forged, even after everything that he went through. I know I felt bad for him because I could relate with him a lot. I even had myself saying I'm sorry every time something bad happens. ACTUALLY SAYING I'M SORRY TO A 2-D CHARACTER. That is great character building right there.\\n\\n\r\nEnjoyment: 8\\n\r\nI enjoyed this show, if you couldn't tell already. Sure there are flaws and they are very noticeable but honestly I enjoyed every second of it. Especially when it can hit you in the feels. I would give this show a try. Who knows......\\n\\n\r\nMaybe you will question what justice means to you.\\n\\n\r\nOverall: 9",
            "date": "2017-03-07T09:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 242059,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6061538.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DarkScribe492",
                "username": "DarkScribe492"
            },
            "url": "https://myanimelist.net/reviews.php?id=242059"
        },
        {
            "content": "This is my short and hopefully sweet review of Zetman, which is an action anime that revolves around human engineered monsters called players, the rebellion of these \"players\" and the growth of the player hunter Zet.\r\nThe show in it's self isn't a bad watch. The art work, action scenes, voice acting, and characters, are all very good in my opinion. You can also tell there is a story good here. But without ever reading the manga, you can also tell that everything is rushed plot wise because of the series only being 13 episodes long.\r\nEverything appears to be disjointed or very hard to believe becausethe show expects you to have knowledge of the manga as well. Also to keep up with the time constraints, key plot points in the anime differ from the manga. Which isn't bad when done right \"see full metal alchemist\". But often you will not understand the history,bonds and breakdowns that some of characters have built up or gone threw because there is alot that went on in the manga that the anime does not relay at all.\\n\\n\r\nOverall this show is a classic example of why I believe most short anime series based on long running manga should stay true to the cannon and have \"no ending\", \"see Shigurui\". A show that lays the ground work for the series in great detail, but ends after the first arch is vastly better than a show that try's to jam 100 plus manga releases into a 300 minute anime Imo. \\n\\n\r\nAlso making an original story and sticking to it makes for a better short series than jumping between the cannon of a manga and what ever liberties the anime decided to come up with. \\n\\n\r\nIt's still a good watch for 13 eps, but don't expect to come away with anything more then alittle intro into the Zetman universe and some gory fight scenes.",
            "date": "2012-07-25T03:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 67669,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1045965.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xxAnjixx",
                "username": "xxAnjixx"
            },
            "url": "https://myanimelist.net/reviews.php?id=67669"
        },
        {
            "content": "[Portuguese-BR] \r\n\"Justiça\", é uma palavra um tanto curiosa, me pergunto até agora \"o que é a justiça?\". Bom Justiça de acordo com o google, seria um equilibrio, uma igualdade que deve ser razoável e imparcial entre os interesses, riquezas e oportunidades...\r\nNão está só resumido em \"fazer o bem\", pois assim como o \"bom\" pode ser interpretado de um jeito, o \"mau\" também pode, e assim a \"justiça\" é, cada um tem seu tipo de justiça, claro que a justiça que o google fala é muito boa, mas não esta certa, porém também não esta errada. \r\nO curioso do anime, é que a \"justiça\" ali tevedois lados, uma pessoa que só fazia a \"justiça\" como resultado de suas ações, e outra que a \"justiça\" era mais uma desculpa para receber elogios. Salvar pessoas, é justiça? Ao meu ver \"salvar pessoas\" não é justiça e sim uma \"boa ação\". \\n\\n\r\nJin, o protagonista, também conhecido como Zet, seu objetivo juntamente com o presidente da corporação Amagi, era exterminar todos os Players ou Evols (como preferir) como meio de sua vingaça, pois mataram seu \"avô\" Gorou Kanzaki que era seu criador.\\n\r\nEm certo episódio, Zet se encontra com Alphas, o Kouga Amagi em um incêndio provocado por um Player e após derrotar o player, Jin salva uma familia inteira, sendo que Kouga era contra salvar a mãe por estar machucada. \\n\r\nLogo após isso, Zet sai do local, deixando todo o crédito para o Alphas que não tinha feito nada de útil.\\n\\n\r\nKouga Amagi, bom ele que se diz ser um Herói, possui um certo sendo de \"justiça\" meio distorcido, porém não errado. Amagi é uma corporação, então Kouga futuramente seria o presidente dela, que até então essa posição era exercida por seu Avô. Obviamente uma familia muito rica, Kouga tendo tudo o que sempre quis, ganha sua armadura, a Alphas. Uma armadura que possibilitava a Kouga ser um \"Herói\". \\n\\n\r\nAmbos são muito diferentes como o preto e o branco, porém o menino rico que sonhava em ser um herói, mas nunca conseguiu fazer isso realmente. E o \"menino pobre\" era realmente um herói, porém era somente um resultado de suas ações. \\n\\n\r\nBom se eu for falar do anime inteiro aqui vou ficar muito tempo escrevendo, então é isso. \\n\r\nO anime é muito bom eu recomendo!\\n\\n\r\n[English-EUA] \\n\r\n\"Justice\" is a rather curious word, I ask myself until now \"what is justice?\". Good Justice according to google, would be a balance, an equality that should be reasonable and impartial between interests, riches and opportunities ...\\n\r\nIt is not only summarized in \"doing good,\" for just as \"good\" can be interpreted in a way, the \"bad\" can also, and so \"justice\" is, each has its kind of justice, of course the justice that google speaks is very good, but it is not right, but also not wrong.\\n\\n\r\nThe curious thing about the anime is that the \"justice\" there had two sides, a person who only did \"justice\" as a result of their actions, and another that \"justice\" was more an excuse to receive praise. Save people, is it justice? In my view \"saving people\" is not justice but a \"good deed\".\\n\\n\r\nJin, the protagonist, also known as Zet, his goal along with the president of the Amagi corporation, was to exterminate all Players or Evols (as he prefers) as a means of his revenge, as they killed his \"grandfather\" Gorou Kanzaki who was its creator.\\n\r\nIn a certain episode, Zet meets with Alphas, Kouga Amagi in a fire caused by a Player and after defeating the player, Jin saves an entire family, being that Kouga was against to save the mother by being injured.\\n\r\nSoon after that, Zet leaves the place, leaving all the credit for Alphas who had done nothing useful.\\n\\n\r\nKouga Amagi, well he is said to be a Hero, has a certain being of \"justice\" half distorted, but not wrong. Amagi is a corporation, so Kouga would later be her chairman, who until then had this position held by his Grandfather. Obviously a very rich family, Kouga having everything he ever wanted, gains his armor, Alphas. An armor that enabled Kouga to be a \"Hero\".\\n\\n\r\nBoth are very different like black and white, but the rich boy who dreamed of being a hero, but never really managed to do that. And the \"poor boy\" was really a hero, but it was only a result of his actions.\\n\\n\r\nWell if I'm going to talk about the whole anime here, I'll spend a lot of time writing, so that's it.\\n\r\nThe anime is very good I recommend!",
            "date": "2017-12-08T19:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 264807,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6735960.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Neurose",
                "username": "Neurose"
            },
            "url": "https://myanimelist.net/reviews.php?id=264807"
        },
        {
            "content": "This anime doesn't stand too far out from other anime and manga like Guyver and Devilman. But that is fine and not where the problem lays.\r\nStarting off there are a few things that start off rather ludicrous and out of touch with reality. I give those a pass and then the anime begins to pick up and I enjoy the pacing.\r\nbut then things are thrown in that aren't properly explained and are just completely ignored. One thing is something you'll come to see called \"The Ring of Exposure\" which is all I'll say without spoiling the story.\r\nThe character Alphas feels interesting and unique. You goon an emotional trip with him but that emotional trip is rushed and his character arc falls flat on it's face towards the ending.\\n\\n\r\nSome things regarding Zetman's powers are never explained and the anime ends on a note that gave me a quizzical look regarding the unsolved problem with his now double edged sword of a power.\\n\\n\r\nThe anime is good, the story was good but everything was rushed towards the ending. Now this makes sense since I found out that the manga was actually 20 volumes in comparison with this 13 episode anime adaption.\\n\\n\r\nI have know idea what the difference is with how situations are resolved so I can't entirely recommend it but if I was to guess, I'd read that.\\n\\n\r\nOver all this feels a little misdelivered but definitely a whole lot better then Casshern sins. If anyone wants to see something else like this or something with a superhero fighting monsters. I recommend the 2006 Guyver and the Baoh OVA.",
            "date": "2017-09-20T02:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 258106,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6522715.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/thatsuperheroguy",
                "username": "thatsuperheroguy"
            },
            "url": "https://myanimelist.net/reviews.php?id=258106"
        },
        {
            "content": "well definitely a great first episode. was hoping he would stay as a kid he looks cooler. though the anime would be a disappointment but i woundt say is that bad its just like any other super hero story. besides that aplhaidiot. dude really pisses me off. but what i thought really made this anime at least good is that first episode then everything goes downhill from there. lol",
            "date": "2013-02-03T02:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 85681,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1326165.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/johnL21",
                "username": "johnL21"
            },
            "url": "https://myanimelist.net/reviews.php?id=85681"
        }
    ],
    [
        {
            "content": "TLDR; Instantly forgettable, with some redeeming points.\r\nZetman has a few redeeming features in it. I found the premise interesting, but I could never connect very well with any of the characters and felt them all to be a bit standoffish, with one or two exceptions. Because I hadn't connected with them, the ending (which I assume would be more shocking and more eliciting of emotion if you read the manga) felt like another drab turn.\r\nThat having said, I did enjoy watching it, and have no regrets having done so. I do think that if it had had more than 13 episodes it might have beenable to invest the audience more deeply in the characters and story rather than dash through it at lightning pace.",
            "date": "2018-11-25T04:36:00+00:00",
            "helpful_count": 0,
            "mal_id": 294688,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Althamus",
                "username": "Althamus"
            },
            "url": "https://myanimelist.net/reviews.php?id=294688"
        }
    ]
]