[
    [
        {
            "content": "What else could go wrong???....Oh yeah....that\r\nThis anime was fairly entertaining but it was a huge cluster F*ck.\r\nat times you laugh and at others you want to reach through the screen and pimp slap the crap out of the MC",
            "date": "2015-08-13T13:48:00+00:00",
            "helpful_count": 665,
            "mal_id": 196057,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3968923.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GreeseMonkie",
                "username": "GreeseMonkie"
            },
            "url": "https://myanimelist.net/reviews.php?id=196057"
        },
        {
            "content": "*An underrated series with plenty of potential for its second season.*\r\n“The beginning has ended.” - White Album\r\n1986\r\nA year where internet does not exist.\r\nA year where cassette tapes still dominates in the media industry.\r\nA year where cell phone, the size of a brick, has just emerged in the market.\r\nA year where the story of White Album takes place.\r\nWhite Album often presents viewers with these muddy views of reality. There is often no clear distinction from right or wrong, good or evil. There is, however, often grief and suffering caused by various circumstances and misunderstandings. More often than not, people simply turn their head and walk awayfrom the show because people just do not get it. White Album is the type of show that likes to tell the story as indirectly as possible to the viewers. Little things that may seem trivial at first can come back to haunt the viewers, so make sure to pay 110% attention!\\n\\n\r\nWhile White Album is technically a harem anime, viewers will be disappointed if they are looking for immature ecchi scenes, for instance boobie grabbing. White Album is not ecchi and/or sexually oriented, period. However, there is one well made French kissing scene in a car. The story revolves around our protagonist whose life got turned upside down when his girlfriend became a famous national idol. He was forced to distance himself from her by the music company and that is when his nightmare begins. Girls from various age groups, some he knew from the past, others he met along the way all started to barge into his life. Some wanted him to forget his girlfriend by allowing themselves as replacement. Others want to make sure the protagonist remain faithful and loyal to his girlfriend, thus they began to have plans of their own. All the while the protagonist is trying to fight temptation, worrying about his father, completing his university degree, and keeping himself sane amidst these chaos. \\n\\n\r\nFor a studio that is not particularly well known for high quality animation, Seven Arcs did a wonderful job in producing this series. In addition to the regular animation, often times the viewers will see characters in their caricatures (distorted or exaggerated), other times a scene may be presented with pastel-like animation. Simply put, the production crew of White Album did their job skillfully and flawlessly. \\n\\n\r\nThe producers also have a knack in bringing out the characters’ subtle emotions: they don’t have to say anything about their feelings, their facial expressions speak for themselves, and this series has been really good at throwing these feelings all over the place. Perhaps the most outstanding feature of the show is viewers get to “read” the inner thoughts of the protagonist, rather than the traditional way of making the character goes into a long and boring monologue. These inner thoughts often reflect the ambiguity the protagonist has with his feelings and situation.\\n\\n\r\nWith award winning seiyu performing the OP and various insert songs in between, White Album has at least one exceptional selling point it can brag about. After all, the story does heavily center on songs, thus it is only appropriate to get the most talented seiyu to do the job. Otaku should instantly recognize names such as Nana Mizuki or Aya Hirano, both have singing capabilities rivaling the top notch professionals. But perhaps due to over emphasizing on the songs, the BGM turned out to be rather lackluster (budget problem?). \\n\\n\r\nI had to do a quick re-watch of the series before mustering enough courage to write this review. In part due to its unclear way of portraying its characters and where they are heading. Please be mindful that season two, covering episode 14 to 26 will be airing in fall 2009, so don’t expect any form of closure to the story just yet. In fact, the ending was rather calm and did not do much to make viewers lust for season two until the final few scenes where things just seem to happen all at once around the protagonist. In a sense, this suit White Album just fine as most realistic/slice of life drama would have approached it in a similar fashion.",
            "date": "2009-03-31T08:22:00+00:00",
            "helpful_count": 241,
            "mal_id": 13646,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=13646"
        },
        {
            "content": "Cheaters never win. They just end up banging a lot of chicks. \r\nWhite Album is a true life story about what it means to be a guy in the real world. In fact, a lot of people will say that this anime is fake and that there is no way that, how many were there, three, no, SIX girls would want to jump the bones of Joe Average, but you know what?? It's real, kids! In fact, it helps a lot when said loser in question is a big tool. Girls like that stuff. What success that the main character of this anime is abig douchebag. \\n\\n\r\nSo the story is about a guy (I don't remember his name, whatever, that wasn't important) who has a pretty girlfriend and just because he doesn't get to see her everyday, he decides to make use of all the other girls who are crushing on him. Instead of rubbing one out every night or just breaking up with the vapid, ignorant foolish girlfriend (who is a singer), he decides to scam on her body guard, on her co-worker, on their mutual school friends, and on a girl he is tutoring. \\n\\n\r\nThis is probably the most realistic drama/romance storyline I've ever seen because you know what, kiddies? People love to cheat. What's even better about this story is that everyone knows that Touya (right, that's his name!) has no backbone and they KNOW he has a girlfriend, and yet they all lure him into sticky situations. Damn, poor Yuki! People who she trusted go on to stab her so hard in the back. It is so fabulous to see these girls watch Yuki in the face and feel vague amounts of guilt about it. Hardcore. And Touya, the lucky bastard, knows she is that much of a insecure loser to stick with him even if he does decide to cheat on her or not.\\n\\n\r\nArt is pretty good, though they kept sticking in these stupid watercolour bullshit in the middle of thing. It was pretty distracting and I don't know why they even bothered to do it. And the music was all right EXCEPT when anyone sang. Good God, no wonder Yuki and what's-her-face are mediocre celebrities--their music sucks. \\n\\n\r\nWhat brought this whole anime down was TOUYA. Oh unfabulous heavens, was he such a pitiful snivelling LOSER. I swear, he cried more than the girls did!! Instead of just growing some balls and dumping his girlfriend who he doesn't even see and just settling on one of the girls he sees all the time and clearly wants, he keeps on dating Yuki and doing awful crap to her. Hell, he took time out of his day to go give a present to a chick who secretly hates his girlfriend and doesn't take the SAME TIME to see his actual girlfriend? Can you be more of a wang, Touya?? \\n\\n\r\nYuki is a moron. Leave it at that. Any other girl would know that when you catch your man giving other girls presents, when he doesn't pick up his phone, when you're calling him in the middle of night and he's not answering (most likely because he's sucking the face of one of your \"friends\"), then he probably isn't that into you. But no. Idiot. \\n\\n\r\nThen all the other girls are whores. No kidding. They disregard Yuki, they ignore the fact that weak willed Touya has a limp dick and would hump them like a dog in heat, and they come up with all sorts of schemes to break the two of them up. But what makes them interesting characters is that they pretend so well to be innocent. In fact, they disguise their cunning bitchery by second-guessing what they're doing, but the fact is they still end up ruining people's lives because each one is a selfish succubus that wants Touya. Why, who knows, because he cries like a bitch over everything.\\n\\n\r\nWhite Album has an amazingly real story about shitty people messing up each others' lives. Man, what a wonderful thing to witness.",
            "date": "2009-05-04T08:56:00+00:00",
            "helpful_count": 113,
            "mal_id": 14779,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105654.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/iamjoe",
                "username": "iamjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=14779"
        },
        {
            "content": "If you're seriously thinking of watching this, I would advice you to think twice. \r\nThe first thing you have to put in mind when watching this series is that the setting is 1986, when handphones were still not that common, and national idols still existed. \r\nStory (5/10)\r\nThe story starts out very nicely, with very well-done introductions of the characters. We have the main guy who is dating the supposedly main girl, who is doing her best to be an artist. That's where everything goes down in an avalanche. It's a very plain romance drama with very little comedy and it drags along like a log.Just watching it makes you become impatient and tick.\\n\\n\r\nArt (8/10)\\n\r\nThe art is quite well done, in the sense that it is very casual, and it uses light colors very well, hence the characters fit into the sceneries brilliantly. the animation is not particularly well done, but there are no mistakes. \\n\\n\r\nSound (7/10) \\n\r\nI expected better tunes, and more songs since it's supposed to be about music too. The OP ED is just alright.. and the bgms are fine, but they hardly compliment the anime much. it leaves a lot of room for improvement.\\n\\n\r\nCharacter (6/10) \\n\r\nAs the story drags along, the characters drag along as well. The main character is okay at the beginning, but as the episodes past, we see him becoming more and more pitiful and useless. He's indecisive, and very passive(how do you expect to keep an idol as a girlfriend like that??). For the other characters, they hardly ever develop, and all you'll learn about them is their past. Just one thing.. thanks to the main girl's voice, you'll melt like a butter. ^^ \\n\\n\r\nEnjoyment (5/10)\\n\r\nSometimes, you'll find yourself smiling, and very rarely, open your eyes big in surprise at the plot twists.. but that's all. after each episode, you find yourself empty, and the next episode is just not as anticipating as the last. \\n\\n\r\nOverall (6/10)\\n\r\nAs a harem anime, this one has really failed in many aspects. It leaves a lot of expectations in disappointment and is really no more than another plain anime. Don't watch this unless you have a lot of time to waste.",
            "date": "2009-02-21T18:35:00+00:00",
            "helpful_count": 61,
            "mal_id": 12626,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46781.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lonehunter88",
                "username": "lonehunter88"
            },
            "url": "https://myanimelist.net/reviews.php?id=12626"
        },
        {
            "content": "I really feel I need to make a review of this anime. This is purely based on the first season, since I haven't watched the second season yet.  I've watched and read a lot of harem anime/manga, some are good, but most are just shallow, comedy-filled, mindless ecchi fanservices anime that I can't stand watching and decided to drop. But this one is clearly different, I'd say that this is the best harem story I've ever watched/read to date.\r\nWhilte Album's story is very good, it's more deep than most harem anime. This story is very realistic for a harem anime (then again, harem itselfisn't very likely to happen in real life, but still much more realistic than most others). It's much more deep and portrays how complicated a human can be. The story is played very well, the events that happened can really affect the audience emotionally. Mostly made you grief, rage, or angry, but that's the point of this series. This was not meant to be those happy-go-lucky anime in the first place. Though this is mostly the reason why this series got less than 7 (by  the time of writing), most people just hate this series because they do not understand it.\\n\\n\r\nArt is pretty nice, I loved the character designs. Backgrounds are well drawn. And there are times when the art changes to beautifully drawn pastel color animation. Character's thoughts are written in texts on the screen so people can see what is actually going on inside the said person's thoughts.\\n\\n\r\nSound is also another plus. Nice VA, there are no annoying voice in this series. Songs are also good, most of the songs has lyrics that actually connects with the story itself. I find that these songs are also affecting me emotionally while listening (reading the karaokes' actually). I wasn't really a fan of Nana Mizuki or Hirano Aya but overall I really liked the songs here.\\n\\n\r\nCharacters are where many people find this show to be terrible. I disagree, characters are the strong point of this series. Most characters are flawed, either they do things irrationally or some other flaws. Which is what makes many people hate this. Though I say, that makes them more \"human\". We see characters who do things that we wholly disagree. People bash on the characters. But really, are you sure you won't do the same when presented with the same situations? White Album is a series that really shows how complicated, weak, foolish, and irrational human beings and human relationships can be. Humans are not perfect beings who always manages to do the right thing 99% of the time. When being pressured, burdened, presented with many problems, most human will do foolish things even if they know themselves that it is wrong. And this aspect is really portrayed very well here.\\n\\n\r\nI really enjoyed the series, even if at times I feel angry or mad at some characters, I can't never bring myself to hate them, since I know that I myself might do the same when given the same situation.\\n\\n\r\nI've said that I dropped many harem anime, the main reason is because most of those are filled with stupid, mindless fanservices that really bores me to death. Fortunately, that kind of thing doesn't exist here. There is a few hot kissing scenes, but they are not mindless or played only for comedic effect, they actually contribute to the story and character developments.\\n\\n\r\nOverall, this is really underrated series. An deep, complicated, relatively realistic romance harem story that really brings out the human flaws in characters to the best. Though for some people, this is not their cup of tea, which is why it's rated low.\\n\\n\r\nFlaws are inevitable in human, that's precisely why we have the backspace key on our keyboard.",
            "date": "2010-09-09T12:29:00+00:00",
            "helpful_count": 48,
            "mal_id": 30379,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362970.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RedSuisei",
                "username": "RedSuisei"
            },
            "url": "https://myanimelist.net/reviews.php?id=30379"
        },
        {
            "content": "White Album was just one of the more awesome shows this past season (Winter 2009), just because of what they've done with their take on the whole \"harem\" anime genre. \r\nNow I haven't played the game or anything on which I can base a claim on it being a good adaptation, but from an uninformed view on it, they handled the whole story in a pretty good way. \r\nElements from harem anime are still present, but they added a whole lot of realism to the whole thing as well in their situations and how they lived and reacted through it.\r\nThe whole season was just chockfull of raw emotion from the first episode onwards, and seriously answers most of those \"what if\" questions about situations one would usually imagine about. I guess a good way to summarize the whole thing is \"It's so messed up, it's awesome!\", but that wouldn't really seem right I guess. That said, the last sequences and then words left at the end of the final episode really emphasized on that whole idea though. \\n\\n\r\nThe story's not over yet, as the second half of the show gets aired on October this year (2009). I'm looking forward to it already, as I'm hopelessly reeled in with this mess they're in right now. Hopefully things get better later on, but I'm liking the story as it is right now.\\n\\n\r\nI highly recommend this anime to anyone else who likes a more realistic/slice of life approach on the harem romance genre.\\n\\n\r\nSome intangibles:\\n\\n\r\nArt:\\n\r\n- The artwork was very nice for the most part of the series, as it usually changes from time to time according to the situation, switching from pastel drawing animation to sometimes childlike caricatures of the characters, then switching back to the normal animation style.\\n\r\n You do notice sometimes that in the normal animation scenes, the characters' appearances tend to vary from their other appearances on some episodes, but this can be attributed I guess to how constantly shifting their artwork is. \\n\\n\r\nSound:\\n\r\n- All the musical pieces sung in the series by Nana Mizuki and Aya Hirano were masterfully presented and performed, from the opening song (\"Shinai\" by Nana Mizuki) to the various insert songs they had throughout the series.\\n\r\nThe background music they used for most of the show were very apt for whatever situation was being presented, and the ending song (\"Maiochiru Yuki no Youni\" by Suara) kept the whole feel of the show going even though it already ended. \\n\\n\r\nCharacters:\\n\r\n- Surprisingly, even for a 13-episode series, most of the characters, including most of the minor ones, were very well rounded and had very defined roles. This is even more surprising considering how the story isn't done yet, so they still more room to make these characters grow even more.\\n\\n\r\nEnjoyment:\\n\r\n- Unlike most harem romance anime, White Album is very sparse and reserved on the humor front, as mostly the story is focused on conflicts with handling different types of relationships with people, especially when there is romance involved, and also on the typical weakness or strength of what one's will can be. \\n\\n\r\nBecause of this, there are considered by some as some \"dead\" scenes in the show where there are mostly serious conversations going on. This in turn, may make this show not that enjoyable for anyone looking for a lighthearted romance show.\\n\\n\\n",
            "date": "2009-03-30T23:35:00+00:00",
            "helpful_count": 20,
            "mal_id": 13640,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/161674.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Rankblotch",
                "username": "Rankblotch"
            },
            "url": "https://myanimelist.net/reviews.php?id=13640"
        },
        {
            "content": "When we think of the word harem, we think of a oblivious male character along with slapstick humor and filled with perverted scenes that don't really fit in with the story..  White Album takes the harem genre and applies it to a very serious tone.  This is a more realistic version of how a harem situation would be.\r\nStory: 6\r\nTouya Fuiji is a college student whose girlfriend has started her path on becoming an idol.  The series follows his interactions with his friends as well as the people who work in the same agency as his girlfriend.  Keep in mind that communicationwas strictly at home, as cell phones are not in use and using a home phone was the only way to contact people outside of meeting them in real life.  The ending is a great follow through into the second season of this anime.  \\n\\n\r\nThough this anime is realistic in a way, the lack of suspense and dramatic scenes created a very slow paced story.  People will argue that the pacing is slow because it is not an action anime... but the anime could use more dramatic parts to make things more exciting.  A lot of this story felt like back story or a big flashback to give information on something that will be coming up. \\n\\n\r\nArt: 8 \\n\r\nA very simple art style, it fit really well with the timeline that the students are in.  The animation as well was nice.  I loved the scenes where they switch to a pastel version.  This transition is very smooth and the pastel drawings were just beautiful.  \\n\\n\r\nWith this anime attempting to be realistic, the character designs are very simple and don't really stand out much.  I will agree that these character designs help send this message of realism.  The idol dresses were pretty as well.\\n\\n\r\nSound: 8\\n\r\nThe sound was a great part of this series.  With an amazing OP, Shin Ai, this song has a very nice beat as well as an amazing first verse.  This song helps give a feeling of nostalgia as it is reminiscent of songs from the early 2000s (Doesn't this song remind you a bit of Shaman King's second OP, Northern Lights by Megumi Hayashibara?)  This nostalgic feeling comes from the use of actual instruments and NO use electronic beats or sounds.  The ED, Maiochiru Yuki no Youni, a super calm and quite piano song that follows with a drum beat.  This song is similar to the OP as it creates a sense of nostalgia.  The insert song was nice, not very idol-like, even though they used it as an idol song.  It was very good and catchy, a great addition to any iTunes.  \\n\\n\r\nThe background music was fine, enjoyed the violin one a lot.  The only problem was the song that sounded like it fit with a depressed circus.  Whenever that songs was used, it never really fit the scene and just felt out of place.\\n\\n\r\nCharacter: 8\\n\r\nAs I have said before, this anime seems very realistic, and from the art and story, what completes it are the characters.  The characters all felt like they were making decisions that a normal person would make under the same circumstances.  These decisions and realism felt from these characters gave them depth and did not need a back story to separate them and make them memorable.  \\n\\n\r\nThe only problem I had regarding characters was character development.  I am aware that there is a season two and the characters may develop there, but I only saw one character develop and that was Misaki.  Even though Yuki from the very beginning wanted to change, I didn't see any development on her character as well the main character.  \\n\\n\r\nEnjoyment: 8\\n\r\nWith such a serious harem, I was scared of how long it would take for me to get adjusted to his.  In turn though, it was very easy to watch and adjust.  One of the best things about this series is the college setting, a setting quite rare in anime, since most anime series are high school setting or a fantasy world setting.  I just wished they had more dramatic scenes, as the pacing was getting very slow and annoying.\\n\\n\r\nOne thing I enjoyed a lot was the ability to see Touya's thought process and thinking.  When I mean by see, they actually put on screen what Touya is thinking in his brain.  I enjoyed to see him quite even though his brain was screaming out loud!  This also helped this anime gain it's feel of realism, as there are always times where you do something even though your brain tells you not to.  \\n\\n\r\nOverall: 8\\n\r\nA GREAT harem anime with a good set up into a season two.\\n\\n\\n",
            "date": "2014-01-14T22:08:00+00:00",
            "helpful_count": 18,
            "mal_id": 128843,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2686267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zelot",
                "username": "Zelot"
            },
            "url": "https://myanimelist.net/reviews.php?id=128843"
        },
        {
            "content": "If you enjoy pure Romantic-Dramas then this is for you, plain and simple. White Album has next to no comedic elements and focuses primaraly the main characters' relationship with his Girlfriend, which has reasently become strained as she has become an Idol and is growing in popularity.\r\nThe story itself seems rather dull at first thought but you quickly learn there is much more then meets the eye. The animation is out of this world in that at times your consufed as to if your watching a TV show or a Movie in how seemless and beautiful the charachers move about their enviroment and how detailedand realistic the backgrounds are. The Music is very nice and helps develope the mood insted of ruin it and fits wonderfully.\\n\r\nOverall its a beautiful peice of art and will be enjoyable to a more mature and patent audience. This show has some wonderful potential and I hope you enjoy it for what it is.",
            "date": "2009-01-13T08:28:00+00:00",
            "helpful_count": 17,
            "mal_id": 11426,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/61047.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeFarmer25",
                "username": "AnimeFarmer25"
            },
            "url": "https://myanimelist.net/reviews.php?id=11426"
        },
        {
            "content": "What is this story's all about?\r\nThe story is all about the life of the two main characters whom separated from each other on the cause of the one of them has become the idol.\r\nWhat is the conflict of the story?\r\nThe protagonist was difficult to contact his girlfriend whom has became the idol. Many circumstances among the other characters who has became his ideal person or what he called \"goddess\" or \"every day(the person who has been worth for him)\" person.\r\nWhat is the point of the story?\r\nThe protagonist has been told that he's a hindrance for his girlfriend's future, that she has been more popular. Oneof the characters had to plan that the protagonist to be pulled off not to contact the heroine. So much circumstances that lead them to sadness and pain.\\n\\n\r\nMy Review:\\n\r\nSo I say that, White Album has a relation to our real world on what is all about when the person you know has become popular. The story begins on childhood and discussing their dreams of what to be. There others that happens like this then ended happily, but this is different of what I thought or you thought that it might this happen really to us. Leaving us unknown to others when they obtain power to do everything, but not everyone is cold-hearted. They were unknown truth that doesn't imagine to us that the person we entrusted had doing far; like cheating, making affairs. And there's much circumstances that make people misunderstood and making excuses. The episodes were like it written on the diary, making qoutes on what is in our minds that we want to write in daily life. But it's a good anime, that has a good lesson for us who has or who hasn't related on this life before. For it has contain dramatic scenes and real-life like story. And it's worth that it's shown in anime.",
            "date": "2009-07-04T04:29:00+00:00",
            "helpful_count": 15,
            "mal_id": 16433,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/42712.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/dante_90",
                "username": "dante_90"
            },
            "url": "https://myanimelist.net/reviews.php?id=16433"
        },
        {
            "content": "I had to let my thoughts sit for a few days before I could write a review on this anime called \"White Album\". This is season 1 of what I would like to describe as  a very strong and very realistic  anime. I have not seen one  like this since Maison Ikkoku. (Refer to that review to get more of my mind frame for this anime or if u need more of a reference.)\r\nI will not go into detail of this anime but I will go into the mindset of why I think this anime is so damned good. The story takesplace in 1986. Ironic enough, Maison Ikkoku also took place in the 80's. In additon, both protagonists are looking for part-time jobs and are both going to college. There are similarities but also big differences.\\n\\n\r\nIn \"White Album\", the protagonist, Fujii Touya already has a girlfriend and she wants to be an idol. He supports her and in the first episode it shows how MUCH he does love her and care for her and how much he wants to spend time with her. They have little texts while they talk (as if so you would know what they are thinking) which gave me a great reminder of Kare Kano (His and her circumstances) which was added in incredibly well. \\n\\n\r\nThe last thing I will mention is Ogata, Rina. She reminded me of Sheryl Nome from Macross Fronter and had the same strength and comfort as her and at the same time was as \"interesting\" as the 'galactic nymph'. \\n\\n\r\nI gave this anime a 9 because the story kept me into it and once I got done with the first episode I wanted to know how they went along with their daily lives. I usually try to anticipate what is going to happen in most anime that I watch, and thankfully, I was unable to. \\n\\n\r\nI give this anime an overall 9.",
            "date": "2009-08-02T09:27:00+00:00",
            "helpful_count": 11,
            "mal_id": 17347,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/185335.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tanta",
                "username": "Tanta"
            },
            "url": "https://myanimelist.net/reviews.php?id=17347"
        },
        {
            "content": "*Review based on only the first season*\r\nSTORY\r\n   Drama is something that can be beautiful and heart breaking, if done right. White Album is one anime that had the potential to be both of these things, but unfortunately it doesn't live up to that potential. (In my opinion, of course) Well,  I have to admit. The idea of the show is pretty good. I mean the premise showed a lot of potential to show the effects and results in a relationship where work might get in the way. Though, that's where the good things end. First problem that plagued the show from thefirst episode, is that there's too many sub plots. This would be somewhat fine, if the sub plots are tied to the main plot. While some of them are, a there's ones that are not needed. This results in scenes that are poorly transitioned into, that don't feel connected. Though, that's the least of White Album's problems. In my opinion, the drama wasn't written well. To make me feel and care for the drama on screen, White Album has to make me care for its characters. Frankly, I didn't care about most of them. This make certain emotional high points to make my eyes roll, and check how many minutes I'm in the episode. Combine with the snail pace, makes the whole story of White Album a drag.\\n\\n\r\nCHARACTERS\\n\r\n   As said before, I didn't care for most of the characters. When I said most, I  mean the whole cast, except for one. Well, staring our show, is Touya Fuji. I found him to be a big reason to why this show fails. Touya is a nice guy. Which results in stupid girls falling in love with him, but that's the thing. Touya is too nice, and most people would know what he does. Anyway, while I understand why he does these things. I felt like his problems could have been resolved pretty quickly, but the show just drags it on and on. Which makes the show drag on and on. Besides Touya, we have his whores. Most of the girls are unlikable in a way or another, just boring, and I couldn't care less about them. Except for one character. Rina Ogata is the only character that I can call well written. She has her flaws as a person, and reasons for what she does. She's the type of character that has ulterior motives for what she's doing, that you really have to dig deep for. Which is a thing I like, though she gets sidelined for most of the show. In favor of other character sub plots. So her little bits of character development is what make the show tolerable, but doesn't save White Album's by a long shot.\\n\\n\r\nANIMATION\\n\r\n   Animated by Seven Arcs, the animation is really stiff, all over the place, and just looks flat and grey most of the time. Seven Arcs haven't done anything too visually stunning, besides the latest Nanoha movies. Though, I don't remember them being this bad. The actually animation (how little there is), runs at a very low frame rate. Which makes certain scenes a dread to look at. They also use a lot of still frames, which aren't even pretty! The only note worthy thing, are the almost painted like animation. Which was used to either save money, or for creative reasons. (I'm betting on the former) While the animation for these small scenes weren't good, they were nicer to look at than the ugly regular art. Speaking of the art, the character designs are shallow, and while the girls are suppose to look \"pretty\". I just didn't see them as \"pretty\", and they don't look good to me. So, yeah, the art and animation is just bad and not pretty at all. \\n\\n\r\nSOUND\\n\r\n   The soundtrack consists of a lot of violin pieces, and a lot of dramatic songs to support the scenes, they were used in. Though, while I was watching the show, I can't say I remembered the score. (Most likely because I was too busy thinking \"when is the episode going to end?) Anyway, all that's left are the insert pop songs. Which by the way, are barely in the show. I liked the songs, and enjoyed listening to them. Sound of Destiny by Nana Mizuki, was a super catchy song, and I liked this version of the song the best. Though, I'm liked White Album sung by a White Album 2 character much better. So, yeah, the songs are good, but it doesn't show up in the show as much as I would liked it to be. Which means, sound won't be getting a better grade. \\n\\n\r\nOVERALL \\n\r\n   White Album was a real drag to watch. It's bogged down by a poor story, unlikable characters, and bad animation. It's a real shame too, since White Album had a lot of potential. In the end it fails at what it wanted to do, and it just becomes barely tolerable. With White Album only having one good character to help me drag through the anime, it was still a dreadful experience for me. \\n",
            "date": "2014-10-30T21:27:00+00:00",
            "helpful_count": 11,
            "mal_id": 166849,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4149187.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MeowPower",
                "username": "MeowPower"
            },
            "url": "https://myanimelist.net/reviews.php?id=166849"
        },
        {
            "content": "Acctually I wanted to write a review because I found this anime amazing but after seeing it's overall score it was somewhat disapointing...\r\nBefore I start writting about story or about another think I'd like to say this isn't an anime which would make you happy.I think it's the same reason why people's score this low.An anime can't be decided about if it's make you feel relieve or happy.An anime made for emotion not just the good ones even feeling for bad ones.So what about if it's make you feel bad?isn't this anime make you feel bad in a great and amazing way...\r\nStory:\r\nThe story is aboutthe relationships of Fujii Touya and the Morikawa Yuki and her surroundings.I can't say this is much of a love story but I can say it would be carved into your heart's deepest part with a pain(which I seek in a anime if I watch a love story I'd like to feel a little sorrowful(a little maso don't you think ^^;))).\\n\\n\r\nArt:\\n\r\nI'm the type who doesn't want to talk about something which has a diffrent opinion on every people.It's the same in the art part in my opinion I loved the art but I won't say anything u would love cuz everyone has own tastes.\\n\\n\r\nSound:\\n\r\nThis part is a little dissapointing but I could say they play the right song in right place it isn't something like Clannad A.S.(where the people want to kill who made the songs :D)\\n\\n\r\nCharacter:\\n\r\nI can't say I didn't impressed about how the character's personallity was designed but I can say It is a little bit difficult to met alike persons in the reality(not all of characters just 1 or 2)\\n\\n\r\nEnjoyment:\\n\r\nIf u would mean if a drama anime's enjoyment it was much more than enjoyment but if u look it emotionally this anime is a DRAMA anime so I'm begging to people who is not like drama anime to NOT watch it.because when they watch it they won't like it then anime's reputation would be even worser.\\n\\n\r\nOverall:\\n\r\nIt's a great drama anime and even if I didn't cried that much it carved in my deep thoughts",
            "date": "2009-08-11T22:39:00+00:00",
            "helpful_count": 7,
            "mal_id": 17688,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/123612.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gosp07",
                "username": "gosp07"
            },
            "url": "https://myanimelist.net/reviews.php?id=17688"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nLet me get first things straight, I came to watch this anime after \"White Album 2\". White album 2 was really personal, beautiful yet at the same time really depressing. I loved WA2, pretty much everything a bout it. Have even re-watched twice and even then managed to make me depressed and tear up, but in the end I enjoyed it.  It's romance/love moral compass was a tad damaged but in a right direction, thus it ended up well.. thus why loved it.\r\nNow, about this thing...White Album 1. Oh my god.. how awkward and uneasy it made for me. On top of that characters and the previously mentioned romance moral compass.. is utterly off the rails here.\\n\\n\r\nFirst things first story. Yes, serious drama about a guy and Idol relationship, but it was somewhat presented in a really awkward way. All 4 episodes I managed to somewhat  watch through by clenching my teeth together were atrocious. The whole feel and as well the relationship between the characters felt so awkward, uneasy and absolutely annoying. It reminded me of modern day disgusting relationships where people are in casual relationships, one night stands and one with heavy cheating need modifier. And this anime was definitely moving more and more in this revolting direction I hate regarding love/relationships (this type).  Anyhow, story was moronic, disgusting and awkward. Something full of lies, hiding and cheating (most likely).\\n\\n\r\nArt/sound was okay for most part, but last of OST presence felt watching this show really odd and dull.\\n\\n\r\nCharacters, they were weird in manner I did not enjoy. And somehow almost every character just pissed me off or annoyed the hell out.\\n\\n\r\nTo sum it up, it's this type of drama/romance I detest everywhere. Some people claimed it's \"realistic love/sex/relationships\" ,  and I won't disagree, most people are in that type of cheap relationships that really revolts me. As vanilla lover with strong sense of emotion  (or moral compass overall) towards love/sex/relationships, this felt as pushing me away from watching this Anime. Maybe this anime wouldn't gone in that direction, maybe would. Who knows, all I know for sure, is that I don't plan to find out. This anime was plainly annoying, uneasy and just generally not an interesting nor enjoyable experience.\\n\\n\r\nProbably the review where I talked the least about content and the most about how I felt about it, but hopefully people with similar mindset will understand this, whilst so called \"normies\" who think this concept is realistic and normal, won't understand this.\\n\\n\r\nPoint being regarding this \"review\". Story was built, but really annoying. Presentation of characters and overall feel was very awkward. OST had little presence, and I absolutely did not enjoy this.",
            "date": "2017-08-21T05:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 255940,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=255940"
        },
        {
            "content": "Imagine being so close to someone you could feel the heat of their breath yet, at the same so distant. Relationships have a way deteriorating like a rose over time. The beginning is sweet and fragrant, yet the decay is gradual as the petals fall one by one. Now the rose is limped over; the aroma is gone, and there is only death where life used to take root. This is the essence of the white album.\r\n\tWhite album is an anime adaptation of a visual novel released in the late 90s. It was relatively unknown then, and its anime adaptation a decade later still didn’tmanage to shine the light of popularity on the shadow of its obscurity. Its premise is an interesting one; a college student named Touya Fuji is in a relationship with an aspiring idol, Yuki Morikawa.  Yuki’s dedication to her career has begun to put stress on their relationship, creating a rift between them. Touya struggles with his feelings of loneliness and attempts to navigate through the temptations before him.  White Album has the elements of what could’ve been a successful anime: good score, melancholic tone, and some big name voice actors. However, due to some poor story navigation, lack of characterization for supporting characters and a lack of romantic flare, White Album fails to become a successful romance drama.\\n\\n\r\n\tThe show starts off introducing us to the main couple, Touya and Yuki. They have been high school sweethearts for some time and have continued their relationship early into college. But, to Touya’s misfortune, Yuki has wanted to become an idol all her life and decides to take initiative to look for a talent agency. She is quickly swooped up and begins her training to become an idol. All the while, Touya is left behind. The beginning was pretty standard fare and did a relatively nice job setting  the stage for the drama. But the show has a tendency to circumvent any scene by focusing on mundane subplots revolving the other female members of the cast. They all have a thing for Touya in one way or another. These subplots detract from the core of what the show is, dealing with distance in a relationship. The problems of these heroines are usually petty and insignificant. The show gives you no reason why you should care about them. \\n\\n\r\n\tI don’t mind multiple female love interests in a romance drama; that typically makes an adventure more exciting. However, one of the biggest problems of White Album is, the show lacks passion. None of the characters have any emotional depth to them, aside from former Idol, Rina Ogata. They are so dull, so boring, so banal, that I could feel the life draining out of me. They didn’t serve a purpose in the overall narrative aside from helping to establish that Touya is the most milquetoast person imaginable. He will do anything anyone asks him to, to his detriment. He doesn’t believe in saying no, and this causes problems for him and other members of the cast.\\n\\n\r\nAnother issue I have is that lack of focus on Yuki’s side of the story. It would’ve been interesting seeing how arduous it is, becoming an idol. We could have also got a deeper look into Yuki’s feelings and thoughts, but the show seldom focuses on her directly. Other characters will talk about Yuki, but we rarely get to hear it from the horse’s mouth.\\n\\n\r\nLet me dive into Touya’s character for a second. He is probably one of the blandest protagonists out there. He lacks any defining characteristics other than ‘he is nice.’ The show has moments where you can see his real feelings written on the screen. This is a very nice effect and adds some emotional depth to his relatively shallow character. What the show truly needs, is moments of introspection where Touya is allowed to think in-depth about his relationship and his actions. It becomes irksome seeing some airheaded guy repeat the same destructive behaviors ad infinitum without some self-awareness. Don’t get me wrong; I don’t mind a protagonist who has self-destructive behaviors, but there has to be some progression. Touya also has issues with his dad that I felt should’ve been explored more as it would’ve added an interesting layer to the show. But we learn nothing about Touya and his dad’s relationship, leaving a gaping hole only to be filled with boredom.\\n\\n\r\n\tThere are some moments where the brilliance of White Album shines through. There are subtle moments of emotional confessions that are masterfully understated. What I mean is, feelings are being indirectly conveyed through accidental slips of the tongue. I relished those moments. Alas, they are too far in between the utterly dreadful side arcs with the other girls. If you are going to have multiple love interests, only have at least one or two in addition to the main girl. Having too many love interests causes all relationships to suffer because there won't be enough time to develop all of them in a substantial way. \\n\\n\r\n\tWhite Album is a show I wish I would’ve liked. Sadly, it is another missed opportunity. Aside from the glum and oppressive atmosphere, it lacks heart and a soul. It lacks the high drama that makes romantic dramas great. Hopefully, the second half of the series will address some of these issues so the show can, at least, be salvaged. But until then, this love song stays silent. \\n",
            "date": "2016-04-01T21:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 215121,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1325759.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PoeticJustice",
                "username": "PoeticJustice"
            },
            "url": "https://myanimelist.net/reviews.php?id=215121"
        },
        {
            "content": "A 2018 review of White Album, a Romantic Drama Harem show, it also involves idol and psychological themes.\r\nThe story follows a 20 year old named Touya Fuji, and his relationship with his high-school sweetheart, Yuki Morikawa.\r\nTouya is a hardworking university student that has a strained relationship with his father, while Yuki worked hard to become an idol after high school.\r\nVery little is shown of their relationship and past, but one thing is clear they are deeply in love. \r\nHowever when Touya's financial and school situation along with Yuki's increasingly busier idol career start getting in the way how will they handle the strain on theirrelationship?\\n\\n\r\nWhy you SHOULD watch it:\\n\r\nIf you like drama, and watching people be people. Good and bad behaviours are on display here.\\n\r\nThe animation. Its pretty good, when you notice its from 2009 you appreciate it even more. It is consistent aside from some visual cues to give insight into what characters are thinking or key moments.\\n\r\nThe characters. They did a good job at establishing each character just enough so the viewer can catch a glimpse of their reasons and motives during the show. The characters, interestingly, are all contained and closer to one another than you think.\\n\r\nThe story. Despite being adapted from an adult visual novel game, the show does a good job of providing a straightforward plot with a clear end in sight. Yet, there are enough surprises to keep the simple story interesting. The story showcases each character's struggles with their work and romantic feelings really well. The story sets a sombre tone and carries it well, this adds to the drama and psychological element.\\n\\n\r\nWhy you SHOULDN'T:\\n\r\nThe characters though well defined, do not change or get expanded over the season. The only exception being the MC, Touya. In about 2 months, he devolves from a confident, smart, helpful student, to a flaky, whiny, spoiler, spoiler.\\n\r\nDespite the story being well planned out, there are slow spots with an occasional bizarre turn of events that doesn't seem to make any sense. I personally feel like this is heading to a deus ex machina ending in season 2.\\n\r\nThe general feel of the show is sadness, there are few uplifting moments.\\n\\n\r\nOther thoughts:\\n\r\nThis is a good show about what being isolated can do to a relationship, along with how other factors can lead to unintended consequences.\\n\r\nWhile the story somewhat involves what it takes to be an idol, very little is put into showing this. There are no eye popping animated performances or standout songs. The music is not bad, but it rarely helps set the mood.\\n\r\nIts a harem, this could be positive or negative. Take your pick.\\n\r\nEven though it's a harem show, it's not ecchi. In fact its on the complete other end of the spectrum, 100% cheesy drama.\\n\r\nI know what influenced Hachikuji.\\n\r\nI do not particularly enjoy drama shows, but this one keeps me interested. I was rooting for Touya and Yuki but then spoiler spoiler.\\n\r\nIts worth a watch, then decide if you want to see the ending in season 2.",
            "date": "2018-08-21T21:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 287095,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5842135.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dyson14444",
                "username": "dyson14444"
            },
            "url": "https://myanimelist.net/reviews.php?id=287095"
        },
        {
            "content": "This is not your typical harem. There is no kawaii girls, ecchi moments, none. There is, however, a ton of drama that will either make you want to cry or punch the MC in the gut really, really hard. \r\nIn the center of it all we have Touya, a college student juggling work and relationships. He has been dating this girl named Yuki, who by the way is the best girlfriend you could possibly ask for. Then, Yuki becomes an idol and gets famous, and it all goes downhill from there. \r\nI hate Touya so much. He's weak, cowardly, unloyal, and makes some terrible decisionsthat will leave you screaming \"baka!\" However, this is where I think White Album excels at: showing how people are flawed. You may look fine from the outside, but inside you're just a messed up clusterfuck, and I think this was clearly shown through Touya, Yuki, and all the other characters. Everything was just so.. realistic. White Album is a refreshing break from all the other fun and dandy animes out there full of sweets and rainbows and positivity. It shows you the dark side of human nature that we need to be reminded of. \\n\\n\r\nStorywise White Album is pretty difficult to follow. The creators of the show tell the story in some pretty subtle ways, and occasionally left me very confused as to what is going on. Once you piece everything together, though, it becomes very depressing. Being an anime about idols, the music was great: solemn in places, eerie in others, but never cheerful, reflecting the general tone fo the anime. \\n\\n\r\nTL;DR if you're ready for something deep and depressing, this just might be the anime for you. \\n\\n\r\n(First review. Hope that wasn't too painful to read.)",
            "date": "2018-05-04T02:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 279742,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7152169.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LM-Minalinsky",
                "username": "LM-Minalinsky"
            },
            "url": "https://myanimelist.net/reviews.php?id=279742"
        },
        {
            "content": "WHITE ALBUM (2009) SEASON 1 REVIEW : \r\nDirection : The directing is great, the people knew exactly when to blend boredom with music and drama, the love drama is nicely done the characters know how to properly hold a conversation between each other and provide maximum boredom for you plebs who don't get the visual aesthetic over dialogue.\r\nPresentation & Storytelling : Life has never been portrayed as dry as this. When you start to watch a show, you want to escape reality, not be thrown back in it damn it!\r\nWhy are the better shows so boring?\r\nBecause they are a representative of human consciousness, something thisshow presents very well. The watercolor blend between actual animation to change the sense of feeling and atmosphere before/mid episode or the actual characters feeling like ACTUAL non-otaku perfect characters, whether it'd be Rina's smooth talking twoards her brother and MC, or Haruka's tomboyish attitude and cry for help because the sense of loneliness hits her hard. After all, she's just a girl that doesn't get any attention.\\n\\n\r\n- EVEN EMOTIONS/CHARACTERISTICS REPRESENT SOMETHING MEANINGFUL THAN -\\n\r\nEver wondered what if being too kind be presented in a harem make more than just baits? Just were you ever curious how boring reality is? Well.. _This is for you_.\\n\r\nMost anime portray 'realism\" simple and straight forward happiness, families cheering each other or Depressed over the fact someone close to them died, in the most cartoony and unbearable way. When in actuality, reality is much MUCH harsher then what most think. Kindness here is presented as, suffering because it is just that. It is not suppose to be funny, entertaining or happy. Hence the dry presentation in thematics and characters compared to most works, using style and silence over dialogue and narrative. Everything is methodical, thus being slow.\\n\r\nThere are no inner monologues, just text to present feelings. Characters suffer from identifing themselves as anything else but \"Goddesses\" of the day for the MC, because they'd help him in some way or form. However, there are certain characters which take advantage, I'll explain later. The story telling, as mentioned before is extremely dry. In a sense of characters make the progression, while it is adapted from a Visual Novel, the obvious taking ALL character routes is there, turn off for some. But in retrospec it's handled properly, fitting in all character reactions and outcomes to the fullest. They have their fair share of problems, but overall show progression and not cut out with time resets, it's not perfect. But it's solidly done.\\n\\n\r\nCharacters & Thematics : The thematics aren't special, but they're hidden. Through obscure reactions. \\n\r\nexample : Yuki singing the song \"White Album\" while the text portrays words of sadness and emptiness, she shows her true emotion. And as an added bonus snow falls down on the stage, giving more sadness and emptiness to the scenary. Or when the MC gets fired he runs in despair crying, throwing his angst on a black and white rough sketchy background with 0 to no animation. The watercolor opening/endings present also some spoilers for the series, but they present at the same time alot of character understanding. And their character reaction, emotion. \\n\\n\r\nAnd now for the characters, they're pretty simple. But have a weird mindset they're never straight with each others, they lie deliberatly to hide themselves from the audience. The characters may suffer at times from an identity crisis. You'll just be like GET MARRIED ALREADY JEEZ! When, it's not that simple. The characters are in a state of depression and resent themselves and others, so they need something to \"bring\" them together. And that is, those who completely understand each other something that may seem typical. But it's hard to execute, because no one have eyes for each other until they realise their mistakes.\\n\\n\r\nOur harem Protagonist may seem like a typical VN character, but unlike most of them. He is the polar oppisate, in otherwords he doesn't understand at first but gradually gets what the characters mean, what he has to. What he can't do, as I stated above, not everyone is kind hearted. There are some characters that want to take advantage of him, they do so. He gets confused, but in the end, he can't do anything about it because of his kind personality, the rest of the cast question his sanity and reactions hence he get gets angrier and angrier, even after being told the truth by his boss before getting himself fired, he realizes how bad he messed up. He slowly grows throughout the first season and gets developed.\\n\\n\r\nYuki, the cheerful moeblob tries her best to be with her boyfriend Touya, (The MC) but sadly is forced to become a cold and forget about him so she can succeed, but her innerself wants to be with him. So they are constantly mislead in a game of cards, you never know for what they're aiming. \\n\\n\r\nMisaki and Akira, they have oppisate way of percieving and doing things. In other words they are the main couple but their personalities are the other way, Akira isn't cheerful as Touya, while Misaki is cheerful as Touya and does not do anything outside of being the character to mentally connect Akira and Touya's friendship from turning into nothing.\\n\\n\r\nYayoi, oh my this character is the equivalent of oberstein, you can't get her motives until the very end, she shows no emotion in her words and actions, and tries to be something more than your typical female, she succeeds. But is on a level of annoying. In the good way of course. \\n\\n\r\nEiji and Rina, Brother and Sister, they have a playful and arrogant way of doing their things, but they are for the most part. A duet, they are the balance between Yuki's inner sadness and Touya's depression from not knowing how to handle stuff. They affiliate themselves with the MC's even if they're not directly connected. They strive for being themselves, don't try to go beyond that. So far, they are the most playful out of the cast.\\n\\n\r\nSound & Animation/Art : The sound track in WA is beautiful, the piano pieces properly synced with the setting provide maximum level chill and sadness when the time is right, something alot of shows nowadays seem to lack. They're used properly, and play little, but when the time is right.\\n\r\nAnimation is pretty slide show-ish there is little to no animation when characters do something and the scene in EP 13 oh my, the budget completely died there.\\n\r\nMost of the time it's standstill and basic movements such as talking or sewing nothing substancial and hard to understand.\\n\r\nArt design is okay, the designs are basic but do the job, the backgrounds are nice to look at and its over all well polished.\\n\\n\r\nProduction Values : Very solid. No issues there, hard on the eye sometimes with lacking animation or influence. Overall good, dry, and hard to swallow but its great.",
            "date": "2016-02-27T06:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 211778,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4053205.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Seppiroth32",
                "username": "Seppiroth32"
            },
            "url": "https://myanimelist.net/reviews.php?id=211778"
        },
        {
            "content": "This is an anime just about anyone can relate to for we as people often face times where the situation rejects your desires and you realize that even though you wish for your happiness, you would be rejected from it and at times you could fall into a confused or desperate state of mind trying to grasp on to someone or something for comfort. Regardless of what genre you are into, if you begin to watch more then just the first or second episode, you will be reeled into an anime in which the theme is common everyday whereas the setting is however a bitmore rare. What may seem like a harem at first glance is nothing at all as you explore and discover the past and relationship of each and every character.\\n\\n\r\nThis story is about the trials of a couple deeply involved where the heroine(Morikawa Yuki) is a rising star and the hero(Fujii Touya) is a college student rejected by his father. As they both are faced with dealing with the change of their relationship they both try and keep contact with each other as she slowly rises to stardom. The story is especially intriguing due to the fact that the story reeled me in from the start with its sombre atmosphere and environment of Touya's life while being separated from Yuki. The story also keeps you interested throughout without the inserts of pointless fillers thus leaves you hooked after every episode.\\n\\n\r\nThe musical score of the opening is absolutely amazing for I personally am a fan for orchestrated music. But regardless the opening and inserts as well as the ending adds emphasis on what the general mood of the story is. With that being said the music sets and maintains a proper mood for each situation in the story which is an absolute must for a drama/romance (cant have the music ruin the mood of the story right?).\\n\\n\r\nThe characters are each very unique and its hard to classify any of the characters as a certain stereotype which brings me to like this anime further. The additional fact that this isnt a harem even though there are a lot of female characters \"attracted to Touya\" makes me like this anime even further and this is because these characters are vital and the relationships between Touya and some of the characters changes other characters who may not be directly related to Touya in any way.\\n\\n\r\nThus with that being said, whatever that may happen in the story, it was breath taking (if i could exaggerate a little here) and was definitely a complete joy to watch, HOWEVER one thing i did wish for when I finished would have to be a better ending to top off an amazing anime, but one minor flaw wont change the overall success of White Album.\\n",
            "date": "2009-07-17T22:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 16888,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/159667.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/setvenx",
                "username": "setvenx"
            },
            "url": "https://myanimelist.net/reviews.php?id=16888"
        },
        {
            "content": "I went into this show knowing how White Album 2 turned out, the anime I hate the most. So, I was expecting a morally degenerate MC and a bunch of confused girls because of some made up circumstances. But I was completely wrong.\r\nWhite Album is much much more realistic. The scenarios that play out are, while not relatable, unless you have any experience of being in the idol industry or something similar, can be empathized with to an extent and understood. And the main character is also definitely not the shameless wimp that White Album 2's MC is. \r\nAnd the women in this show, haveproblems. But they are not made up or trivial or over-dramatized. They all make sense. They were all forcefully tied into the MC, but still that's the way you make an anime - put someone at the center.\\n\\n\r\nI'm sure this anime will be a 10/10 on a number of people's list - people who like tragedies. But it was just plain depressing. And so that completely took out the enjoyment factor for me. \\n\\n\r\nWhile all that is said and done, this anime is definitely a must watch for any non-casual anime fan.\\n\r\nSkip White Album 2. Stick to this much more believable one.\\n\\n\\n",
            "date": "2016-10-09T15:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 231469,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5442584.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ganz7",
                "username": "Ganz7"
            },
            "url": "https://myanimelist.net/reviews.php?id=231469"
        },
        {
            "content": "*Zels short personal Review*\r\n1986; the year this show was set in, and coincidentally also the year I was born in. These are my type of show, senien romances; no ecchi, no fanservice, drama packed and a slow maturing storyline.  The story is about our main protagonist Toya who dates an upcoming idol star, as he has to deal with the obstacles, he has to face while dating a rising pop star; throw in a bunch of girls for distraction and that's our plot. But unlike most harems, this isn't for kids. As mentioned above, this is no panty flashing show. \r\nThe storyline was prettyinteresting. I felt the relationship with our main protagonist believable. Aya Hirano was a great in voicing Yuki, and throughout the show it was interesting to see how Toya had to deal with his relationship with Yuki, as well as the other girls. Despite Toya doing things he shouldn't (wont spoil it). I never hated and felt disgusted for the guy. Sometimes I might have felt frustrated, but his feelings were pretty understandable and in a way, I could relate too, though from my point of view there wasn't a clear distinction between right and wrong in what he did. \\n\\n\r\nSo what did I learn about the year I was born? Well, I appreciate a mobile phone, even more now. The amount of missed calls in this show is slightly frustrating, but understandable. Mobile phones in that year were bricks, and cost quite a lot. Even answering machines were expensive! Though despite the show being set in the mid 80s, it looked anything but. The show looked great, apart from a few scenes where it's obvious they cut corners. The music was great, and overall it was a pretty enjoyable show. I liked all the characters and really don't have a preference, despite all the female characters involved. One thing I do hate about this show though, is the damn Hiatus. Not sure why they they're airing the next half in autumn when they could have show all 26 episodes. No matter, it's something to look forward to. Overall a very good show.",
            "date": "2009-04-06T06:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 13912,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/61600.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Zelnaga",
                "username": "Zelnaga"
            },
            "url": "https://myanimelist.net/reviews.php?id=13912"
        }
    ],
    [
        {
            "content": "What else could go wrong???....Oh yeah....that\r\nThis anime was fairly entertaining but it was a huge cluster F*ck.\r\nat times you laugh and at others you want to reach through the screen and pimp slap the crap out of the MC",
            "date": "2015-08-13T13:48:00+00:00",
            "helpful_count": 665,
            "mal_id": 196057,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3968923.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GreeseMonkie",
                "username": "GreeseMonkie"
            },
            "url": "https://myanimelist.net/reviews.php?id=196057"
        },
        {
            "content": "*An underrated series with plenty of potential for its second season.*\r\n“The beginning has ended.” - White Album\r\n1986\r\nA year where internet does not exist.\r\nA year where cassette tapes still dominates in the media industry.\r\nA year where cell phone, the size of a brick, has just emerged in the market.\r\nA year where the story of White Album takes place.\r\nWhite Album often presents viewers with these muddy views of reality. There is often no clear distinction from right or wrong, good or evil. There is, however, often grief and suffering caused by various circumstances and misunderstandings. More often than not, people simply turn their head and walk awayfrom the show because people just do not get it. White Album is the type of show that likes to tell the story as indirectly as possible to the viewers. Little things that may seem trivial at first can come back to haunt the viewers, so make sure to pay 110% attention!\\n\\n\r\nWhile White Album is technically a harem anime, viewers will be disappointed if they are looking for immature ecchi scenes, for instance boobie grabbing. White Album is not ecchi and/or sexually oriented, period. However, there is one well made French kissing scene in a car. The story revolves around our protagonist whose life got turned upside down when his girlfriend became a famous national idol. He was forced to distance himself from her by the music company and that is when his nightmare begins. Girls from various age groups, some he knew from the past, others he met along the way all started to barge into his life. Some wanted him to forget his girlfriend by allowing themselves as replacement. Others want to make sure the protagonist remain faithful and loyal to his girlfriend, thus they began to have plans of their own. All the while the protagonist is trying to fight temptation, worrying about his father, completing his university degree, and keeping himself sane amidst these chaos. \\n\\n\r\nFor a studio that is not particularly well known for high quality animation, Seven Arcs did a wonderful job in producing this series. In addition to the regular animation, often times the viewers will see characters in their caricatures (distorted or exaggerated), other times a scene may be presented with pastel-like animation. Simply put, the production crew of White Album did their job skillfully and flawlessly. \\n\\n\r\nThe producers also have a knack in bringing out the characters’ subtle emotions: they don’t have to say anything about their feelings, their facial expressions speak for themselves, and this series has been really good at throwing these feelings all over the place. Perhaps the most outstanding feature of the show is viewers get to “read” the inner thoughts of the protagonist, rather than the traditional way of making the character goes into a long and boring monologue. These inner thoughts often reflect the ambiguity the protagonist has with his feelings and situation.\\n\\n\r\nWith award winning seiyu performing the OP and various insert songs in between, White Album has at least one exceptional selling point it can brag about. After all, the story does heavily center on songs, thus it is only appropriate to get the most talented seiyu to do the job. Otaku should instantly recognize names such as Nana Mizuki or Aya Hirano, both have singing capabilities rivaling the top notch professionals. But perhaps due to over emphasizing on the songs, the BGM turned out to be rather lackluster (budget problem?). \\n\\n\r\nI had to do a quick re-watch of the series before mustering enough courage to write this review. In part due to its unclear way of portraying its characters and where they are heading. Please be mindful that season two, covering episode 14 to 26 will be airing in fall 2009, so don’t expect any form of closure to the story just yet. In fact, the ending was rather calm and did not do much to make viewers lust for season two until the final few scenes where things just seem to happen all at once around the protagonist. In a sense, this suit White Album just fine as most realistic/slice of life drama would have approached it in a similar fashion.",
            "date": "2009-03-31T08:22:00+00:00",
            "helpful_count": 241,
            "mal_id": 13646,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=13646"
        },
        {
            "content": "Cheaters never win. They just end up banging a lot of chicks. \r\nWhite Album is a true life story about what it means to be a guy in the real world. In fact, a lot of people will say that this anime is fake and that there is no way that, how many were there, three, no, SIX girls would want to jump the bones of Joe Average, but you know what?? It's real, kids! In fact, it helps a lot when said loser in question is a big tool. Girls like that stuff. What success that the main character of this anime is abig douchebag. \\n\\n\r\nSo the story is about a guy (I don't remember his name, whatever, that wasn't important) who has a pretty girlfriend and just because he doesn't get to see her everyday, he decides to make use of all the other girls who are crushing on him. Instead of rubbing one out every night or just breaking up with the vapid, ignorant foolish girlfriend (who is a singer), he decides to scam on her body guard, on her co-worker, on their mutual school friends, and on a girl he is tutoring. \\n\\n\r\nThis is probably the most realistic drama/romance storyline I've ever seen because you know what, kiddies? People love to cheat. What's even better about this story is that everyone knows that Touya (right, that's his name!) has no backbone and they KNOW he has a girlfriend, and yet they all lure him into sticky situations. Damn, poor Yuki! People who she trusted go on to stab her so hard in the back. It is so fabulous to see these girls watch Yuki in the face and feel vague amounts of guilt about it. Hardcore. And Touya, the lucky bastard, knows she is that much of a insecure loser to stick with him even if he does decide to cheat on her or not.\\n\\n\r\nArt is pretty good, though they kept sticking in these stupid watercolour bullshit in the middle of thing. It was pretty distracting and I don't know why they even bothered to do it. And the music was all right EXCEPT when anyone sang. Good God, no wonder Yuki and what's-her-face are mediocre celebrities--their music sucks. \\n\\n\r\nWhat brought this whole anime down was TOUYA. Oh unfabulous heavens, was he such a pitiful snivelling LOSER. I swear, he cried more than the girls did!! Instead of just growing some balls and dumping his girlfriend who he doesn't even see and just settling on one of the girls he sees all the time and clearly wants, he keeps on dating Yuki and doing awful crap to her. Hell, he took time out of his day to go give a present to a chick who secretly hates his girlfriend and doesn't take the SAME TIME to see his actual girlfriend? Can you be more of a wang, Touya?? \\n\\n\r\nYuki is a moron. Leave it at that. Any other girl would know that when you catch your man giving other girls presents, when he doesn't pick up his phone, when you're calling him in the middle of night and he's not answering (most likely because he's sucking the face of one of your \"friends\"), then he probably isn't that into you. But no. Idiot. \\n\\n\r\nThen all the other girls are whores. No kidding. They disregard Yuki, they ignore the fact that weak willed Touya has a limp dick and would hump them like a dog in heat, and they come up with all sorts of schemes to break the two of them up. But what makes them interesting characters is that they pretend so well to be innocent. In fact, they disguise their cunning bitchery by second-guessing what they're doing, but the fact is they still end up ruining people's lives because each one is a selfish succubus that wants Touya. Why, who knows, because he cries like a bitch over everything.\\n\\n\r\nWhite Album has an amazingly real story about shitty people messing up each others' lives. Man, what a wonderful thing to witness.",
            "date": "2009-05-04T08:56:00+00:00",
            "helpful_count": 113,
            "mal_id": 14779,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105654.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/iamjoe",
                "username": "iamjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=14779"
        },
        {
            "content": "If you're seriously thinking of watching this, I would advice you to think twice. \r\nThe first thing you have to put in mind when watching this series is that the setting is 1986, when handphones were still not that common, and national idols still existed. \r\nStory (5/10)\r\nThe story starts out very nicely, with very well-done introductions of the characters. We have the main guy who is dating the supposedly main girl, who is doing her best to be an artist. That's where everything goes down in an avalanche. It's a very plain romance drama with very little comedy and it drags along like a log.Just watching it makes you become impatient and tick.\\n\\n\r\nArt (8/10)\\n\r\nThe art is quite well done, in the sense that it is very casual, and it uses light colors very well, hence the characters fit into the sceneries brilliantly. the animation is not particularly well done, but there are no mistakes. \\n\\n\r\nSound (7/10) \\n\r\nI expected better tunes, and more songs since it's supposed to be about music too. The OP ED is just alright.. and the bgms are fine, but they hardly compliment the anime much. it leaves a lot of room for improvement.\\n\\n\r\nCharacter (6/10) \\n\r\nAs the story drags along, the characters drag along as well. The main character is okay at the beginning, but as the episodes past, we see him becoming more and more pitiful and useless. He's indecisive, and very passive(how do you expect to keep an idol as a girlfriend like that??). For the other characters, they hardly ever develop, and all you'll learn about them is their past. Just one thing.. thanks to the main girl's voice, you'll melt like a butter. ^^ \\n\\n\r\nEnjoyment (5/10)\\n\r\nSometimes, you'll find yourself smiling, and very rarely, open your eyes big in surprise at the plot twists.. but that's all. after each episode, you find yourself empty, and the next episode is just not as anticipating as the last. \\n\\n\r\nOverall (6/10)\\n\r\nAs a harem anime, this one has really failed in many aspects. It leaves a lot of expectations in disappointment and is really no more than another plain anime. Don't watch this unless you have a lot of time to waste.",
            "date": "2009-02-21T18:35:00+00:00",
            "helpful_count": 61,
            "mal_id": 12626,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46781.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lonehunter88",
                "username": "lonehunter88"
            },
            "url": "https://myanimelist.net/reviews.php?id=12626"
        },
        {
            "content": "I really feel I need to make a review of this anime. This is purely based on the first season, since I haven't watched the second season yet.  I've watched and read a lot of harem anime/manga, some are good, but most are just shallow, comedy-filled, mindless ecchi fanservices anime that I can't stand watching and decided to drop. But this one is clearly different, I'd say that this is the best harem story I've ever watched/read to date.\r\nWhilte Album's story is very good, it's more deep than most harem anime. This story is very realistic for a harem anime (then again, harem itselfisn't very likely to happen in real life, but still much more realistic than most others). It's much more deep and portrays how complicated a human can be. The story is played very well, the events that happened can really affect the audience emotionally. Mostly made you grief, rage, or angry, but that's the point of this series. This was not meant to be those happy-go-lucky anime in the first place. Though this is mostly the reason why this series got less than 7 (by  the time of writing), most people just hate this series because they do not understand it.\\n\\n\r\nArt is pretty nice, I loved the character designs. Backgrounds are well drawn. And there are times when the art changes to beautifully drawn pastel color animation. Character's thoughts are written in texts on the screen so people can see what is actually going on inside the said person's thoughts.\\n\\n\r\nSound is also another plus. Nice VA, there are no annoying voice in this series. Songs are also good, most of the songs has lyrics that actually connects with the story itself. I find that these songs are also affecting me emotionally while listening (reading the karaokes' actually). I wasn't really a fan of Nana Mizuki or Hirano Aya but overall I really liked the songs here.\\n\\n\r\nCharacters are where many people find this show to be terrible. I disagree, characters are the strong point of this series. Most characters are flawed, either they do things irrationally or some other flaws. Which is what makes many people hate this. Though I say, that makes them more \"human\". We see characters who do things that we wholly disagree. People bash on the characters. But really, are you sure you won't do the same when presented with the same situations? White Album is a series that really shows how complicated, weak, foolish, and irrational human beings and human relationships can be. Humans are not perfect beings who always manages to do the right thing 99% of the time. When being pressured, burdened, presented with many problems, most human will do foolish things even if they know themselves that it is wrong. And this aspect is really portrayed very well here.\\n\\n\r\nI really enjoyed the series, even if at times I feel angry or mad at some characters, I can't never bring myself to hate them, since I know that I myself might do the same when given the same situation.\\n\\n\r\nI've said that I dropped many harem anime, the main reason is because most of those are filled with stupid, mindless fanservices that really bores me to death. Fortunately, that kind of thing doesn't exist here. There is a few hot kissing scenes, but they are not mindless or played only for comedic effect, they actually contribute to the story and character developments.\\n\\n\r\nOverall, this is really underrated series. An deep, complicated, relatively realistic romance harem story that really brings out the human flaws in characters to the best. Though for some people, this is not their cup of tea, which is why it's rated low.\\n\\n\r\nFlaws are inevitable in human, that's precisely why we have the backspace key on our keyboard.",
            "date": "2010-09-09T12:29:00+00:00",
            "helpful_count": 48,
            "mal_id": 30379,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362970.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RedSuisei",
                "username": "RedSuisei"
            },
            "url": "https://myanimelist.net/reviews.php?id=30379"
        },
        {
            "content": "White Album was just one of the more awesome shows this past season (Winter 2009), just because of what they've done with their take on the whole \"harem\" anime genre. \r\nNow I haven't played the game or anything on which I can base a claim on it being a good adaptation, but from an uninformed view on it, they handled the whole story in a pretty good way. \r\nElements from harem anime are still present, but they added a whole lot of realism to the whole thing as well in their situations and how they lived and reacted through it.\r\nThe whole season was just chockfull of raw emotion from the first episode onwards, and seriously answers most of those \"what if\" questions about situations one would usually imagine about. I guess a good way to summarize the whole thing is \"It's so messed up, it's awesome!\", but that wouldn't really seem right I guess. That said, the last sequences and then words left at the end of the final episode really emphasized on that whole idea though. \\n\\n\r\nThe story's not over yet, as the second half of the show gets aired on October this year (2009). I'm looking forward to it already, as I'm hopelessly reeled in with this mess they're in right now. Hopefully things get better later on, but I'm liking the story as it is right now.\\n\\n\r\nI highly recommend this anime to anyone else who likes a more realistic/slice of life approach on the harem romance genre.\\n\\n\r\nSome intangibles:\\n\\n\r\nArt:\\n\r\n- The artwork was very nice for the most part of the series, as it usually changes from time to time according to the situation, switching from pastel drawing animation to sometimes childlike caricatures of the characters, then switching back to the normal animation style.\\n\r\n You do notice sometimes that in the normal animation scenes, the characters' appearances tend to vary from their other appearances on some episodes, but this can be attributed I guess to how constantly shifting their artwork is. \\n\\n\r\nSound:\\n\r\n- All the musical pieces sung in the series by Nana Mizuki and Aya Hirano were masterfully presented and performed, from the opening song (\"Shinai\" by Nana Mizuki) to the various insert songs they had throughout the series.\\n\r\nThe background music they used for most of the show were very apt for whatever situation was being presented, and the ending song (\"Maiochiru Yuki no Youni\" by Suara) kept the whole feel of the show going even though it already ended. \\n\\n\r\nCharacters:\\n\r\n- Surprisingly, even for a 13-episode series, most of the characters, including most of the minor ones, were very well rounded and had very defined roles. This is even more surprising considering how the story isn't done yet, so they still more room to make these characters grow even more.\\n\\n\r\nEnjoyment:\\n\r\n- Unlike most harem romance anime, White Album is very sparse and reserved on the humor front, as mostly the story is focused on conflicts with handling different types of relationships with people, especially when there is romance involved, and also on the typical weakness or strength of what one's will can be. \\n\\n\r\nBecause of this, there are considered by some as some \"dead\" scenes in the show where there are mostly serious conversations going on. This in turn, may make this show not that enjoyable for anyone looking for a lighthearted romance show.\\n\\n\\n",
            "date": "2009-03-30T23:35:00+00:00",
            "helpful_count": 20,
            "mal_id": 13640,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/161674.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Rankblotch",
                "username": "Rankblotch"
            },
            "url": "https://myanimelist.net/reviews.php?id=13640"
        },
        {
            "content": "When we think of the word harem, we think of a oblivious male character along with slapstick humor and filled with perverted scenes that don't really fit in with the story..  White Album takes the harem genre and applies it to a very serious tone.  This is a more realistic version of how a harem situation would be.\r\nStory: 6\r\nTouya Fuiji is a college student whose girlfriend has started her path on becoming an idol.  The series follows his interactions with his friends as well as the people who work in the same agency as his girlfriend.  Keep in mind that communicationwas strictly at home, as cell phones are not in use and using a home phone was the only way to contact people outside of meeting them in real life.  The ending is a great follow through into the second season of this anime.  \\n\\n\r\nThough this anime is realistic in a way, the lack of suspense and dramatic scenes created a very slow paced story.  People will argue that the pacing is slow because it is not an action anime... but the anime could use more dramatic parts to make things more exciting.  A lot of this story felt like back story or a big flashback to give information on something that will be coming up. \\n\\n\r\nArt: 8 \\n\r\nA very simple art style, it fit really well with the timeline that the students are in.  The animation as well was nice.  I loved the scenes where they switch to a pastel version.  This transition is very smooth and the pastel drawings were just beautiful.  \\n\\n\r\nWith this anime attempting to be realistic, the character designs are very simple and don't really stand out much.  I will agree that these character designs help send this message of realism.  The idol dresses were pretty as well.\\n\\n\r\nSound: 8\\n\r\nThe sound was a great part of this series.  With an amazing OP, Shin Ai, this song has a very nice beat as well as an amazing first verse.  This song helps give a feeling of nostalgia as it is reminiscent of songs from the early 2000s (Doesn't this song remind you a bit of Shaman King's second OP, Northern Lights by Megumi Hayashibara?)  This nostalgic feeling comes from the use of actual instruments and NO use electronic beats or sounds.  The ED, Maiochiru Yuki no Youni, a super calm and quite piano song that follows with a drum beat.  This song is similar to the OP as it creates a sense of nostalgia.  The insert song was nice, not very idol-like, even though they used it as an idol song.  It was very good and catchy, a great addition to any iTunes.  \\n\\n\r\nThe background music was fine, enjoyed the violin one a lot.  The only problem was the song that sounded like it fit with a depressed circus.  Whenever that songs was used, it never really fit the scene and just felt out of place.\\n\\n\r\nCharacter: 8\\n\r\nAs I have said before, this anime seems very realistic, and from the art and story, what completes it are the characters.  The characters all felt like they were making decisions that a normal person would make under the same circumstances.  These decisions and realism felt from these characters gave them depth and did not need a back story to separate them and make them memorable.  \\n\\n\r\nThe only problem I had regarding characters was character development.  I am aware that there is a season two and the characters may develop there, but I only saw one character develop and that was Misaki.  Even though Yuki from the very beginning wanted to change, I didn't see any development on her character as well the main character.  \\n\\n\r\nEnjoyment: 8\\n\r\nWith such a serious harem, I was scared of how long it would take for me to get adjusted to his.  In turn though, it was very easy to watch and adjust.  One of the best things about this series is the college setting, a setting quite rare in anime, since most anime series are high school setting or a fantasy world setting.  I just wished they had more dramatic scenes, as the pacing was getting very slow and annoying.\\n\\n\r\nOne thing I enjoyed a lot was the ability to see Touya's thought process and thinking.  When I mean by see, they actually put on screen what Touya is thinking in his brain.  I enjoyed to see him quite even though his brain was screaming out loud!  This also helped this anime gain it's feel of realism, as there are always times where you do something even though your brain tells you not to.  \\n\\n\r\nOverall: 8\\n\r\nA GREAT harem anime with a good set up into a season two.\\n\\n\\n",
            "date": "2014-01-14T22:08:00+00:00",
            "helpful_count": 18,
            "mal_id": 128843,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2686267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zelot",
                "username": "Zelot"
            },
            "url": "https://myanimelist.net/reviews.php?id=128843"
        },
        {
            "content": "If you enjoy pure Romantic-Dramas then this is for you, plain and simple. White Album has next to no comedic elements and focuses primaraly the main characters' relationship with his Girlfriend, which has reasently become strained as she has become an Idol and is growing in popularity.\r\nThe story itself seems rather dull at first thought but you quickly learn there is much more then meets the eye. The animation is out of this world in that at times your consufed as to if your watching a TV show or a Movie in how seemless and beautiful the charachers move about their enviroment and how detailedand realistic the backgrounds are. The Music is very nice and helps develope the mood insted of ruin it and fits wonderfully.\\n\r\nOverall its a beautiful peice of art and will be enjoyable to a more mature and patent audience. This show has some wonderful potential and I hope you enjoy it for what it is.",
            "date": "2009-01-13T08:28:00+00:00",
            "helpful_count": 17,
            "mal_id": 11426,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/61047.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeFarmer25",
                "username": "AnimeFarmer25"
            },
            "url": "https://myanimelist.net/reviews.php?id=11426"
        },
        {
            "content": "What is this story's all about?\r\nThe story is all about the life of the two main characters whom separated from each other on the cause of the one of them has become the idol.\r\nWhat is the conflict of the story?\r\nThe protagonist was difficult to contact his girlfriend whom has became the idol. Many circumstances among the other characters who has became his ideal person or what he called \"goddess\" or \"every day(the person who has been worth for him)\" person.\r\nWhat is the point of the story?\r\nThe protagonist has been told that he's a hindrance for his girlfriend's future, that she has been more popular. Oneof the characters had to plan that the protagonist to be pulled off not to contact the heroine. So much circumstances that lead them to sadness and pain.\\n\\n\r\nMy Review:\\n\r\nSo I say that, White Album has a relation to our real world on what is all about when the person you know has become popular. The story begins on childhood and discussing their dreams of what to be. There others that happens like this then ended happily, but this is different of what I thought or you thought that it might this happen really to us. Leaving us unknown to others when they obtain power to do everything, but not everyone is cold-hearted. They were unknown truth that doesn't imagine to us that the person we entrusted had doing far; like cheating, making affairs. And there's much circumstances that make people misunderstood and making excuses. The episodes were like it written on the diary, making qoutes on what is in our minds that we want to write in daily life. But it's a good anime, that has a good lesson for us who has or who hasn't related on this life before. For it has contain dramatic scenes and real-life like story. And it's worth that it's shown in anime.",
            "date": "2009-07-04T04:29:00+00:00",
            "helpful_count": 15,
            "mal_id": 16433,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/42712.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/dante_90",
                "username": "dante_90"
            },
            "url": "https://myanimelist.net/reviews.php?id=16433"
        },
        {
            "content": "I had to let my thoughts sit for a few days before I could write a review on this anime called \"White Album\". This is season 1 of what I would like to describe as  a very strong and very realistic  anime. I have not seen one  like this since Maison Ikkoku. (Refer to that review to get more of my mind frame for this anime or if u need more of a reference.)\r\nI will not go into detail of this anime but I will go into the mindset of why I think this anime is so damned good. The story takesplace in 1986. Ironic enough, Maison Ikkoku also took place in the 80's. In additon, both protagonists are looking for part-time jobs and are both going to college. There are similarities but also big differences.\\n\\n\r\nIn \"White Album\", the protagonist, Fujii Touya already has a girlfriend and she wants to be an idol. He supports her and in the first episode it shows how MUCH he does love her and care for her and how much he wants to spend time with her. They have little texts while they talk (as if so you would know what they are thinking) which gave me a great reminder of Kare Kano (His and her circumstances) which was added in incredibly well. \\n\\n\r\nThe last thing I will mention is Ogata, Rina. She reminded me of Sheryl Nome from Macross Fronter and had the same strength and comfort as her and at the same time was as \"interesting\" as the 'galactic nymph'. \\n\\n\r\nI gave this anime a 9 because the story kept me into it and once I got done with the first episode I wanted to know how they went along with their daily lives. I usually try to anticipate what is going to happen in most anime that I watch, and thankfully, I was unable to. \\n\\n\r\nI give this anime an overall 9.",
            "date": "2009-08-02T09:27:00+00:00",
            "helpful_count": 11,
            "mal_id": 17347,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/185335.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tanta",
                "username": "Tanta"
            },
            "url": "https://myanimelist.net/reviews.php?id=17347"
        },
        {
            "content": "*Review based on only the first season*\r\nSTORY\r\n   Drama is something that can be beautiful and heart breaking, if done right. White Album is one anime that had the potential to be both of these things, but unfortunately it doesn't live up to that potential. (In my opinion, of course) Well,  I have to admit. The idea of the show is pretty good. I mean the premise showed a lot of potential to show the effects and results in a relationship where work might get in the way. Though, that's where the good things end. First problem that plagued the show from thefirst episode, is that there's too many sub plots. This would be somewhat fine, if the sub plots are tied to the main plot. While some of them are, a there's ones that are not needed. This results in scenes that are poorly transitioned into, that don't feel connected. Though, that's the least of White Album's problems. In my opinion, the drama wasn't written well. To make me feel and care for the drama on screen, White Album has to make me care for its characters. Frankly, I didn't care about most of them. This make certain emotional high points to make my eyes roll, and check how many minutes I'm in the episode. Combine with the snail pace, makes the whole story of White Album a drag.\\n\\n\r\nCHARACTERS\\n\r\n   As said before, I didn't care for most of the characters. When I said most, I  mean the whole cast, except for one. Well, staring our show, is Touya Fuji. I found him to be a big reason to why this show fails. Touya is a nice guy. Which results in stupid girls falling in love with him, but that's the thing. Touya is too nice, and most people would know what he does. Anyway, while I understand why he does these things. I felt like his problems could have been resolved pretty quickly, but the show just drags it on and on. Which makes the show drag on and on. Besides Touya, we have his whores. Most of the girls are unlikable in a way or another, just boring, and I couldn't care less about them. Except for one character. Rina Ogata is the only character that I can call well written. She has her flaws as a person, and reasons for what she does. She's the type of character that has ulterior motives for what she's doing, that you really have to dig deep for. Which is a thing I like, though she gets sidelined for most of the show. In favor of other character sub plots. So her little bits of character development is what make the show tolerable, but doesn't save White Album's by a long shot.\\n\\n\r\nANIMATION\\n\r\n   Animated by Seven Arcs, the animation is really stiff, all over the place, and just looks flat and grey most of the time. Seven Arcs haven't done anything too visually stunning, besides the latest Nanoha movies. Though, I don't remember them being this bad. The actually animation (how little there is), runs at a very low frame rate. Which makes certain scenes a dread to look at. They also use a lot of still frames, which aren't even pretty! The only note worthy thing, are the almost painted like animation. Which was used to either save money, or for creative reasons. (I'm betting on the former) While the animation for these small scenes weren't good, they were nicer to look at than the ugly regular art. Speaking of the art, the character designs are shallow, and while the girls are suppose to look \"pretty\". I just didn't see them as \"pretty\", and they don't look good to me. So, yeah, the art and animation is just bad and not pretty at all. \\n\\n\r\nSOUND\\n\r\n   The soundtrack consists of a lot of violin pieces, and a lot of dramatic songs to support the scenes, they were used in. Though, while I was watching the show, I can't say I remembered the score. (Most likely because I was too busy thinking \"when is the episode going to end?) Anyway, all that's left are the insert pop songs. Which by the way, are barely in the show. I liked the songs, and enjoyed listening to them. Sound of Destiny by Nana Mizuki, was a super catchy song, and I liked this version of the song the best. Though, I'm liked White Album sung by a White Album 2 character much better. So, yeah, the songs are good, but it doesn't show up in the show as much as I would liked it to be. Which means, sound won't be getting a better grade. \\n\\n\r\nOVERALL \\n\r\n   White Album was a real drag to watch. It's bogged down by a poor story, unlikable characters, and bad animation. It's a real shame too, since White Album had a lot of potential. In the end it fails at what it wanted to do, and it just becomes barely tolerable. With White Album only having one good character to help me drag through the anime, it was still a dreadful experience for me. \\n",
            "date": "2014-10-30T21:27:00+00:00",
            "helpful_count": 11,
            "mal_id": 166849,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4149187.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MeowPower",
                "username": "MeowPower"
            },
            "url": "https://myanimelist.net/reviews.php?id=166849"
        },
        {
            "content": "Acctually I wanted to write a review because I found this anime amazing but after seeing it's overall score it was somewhat disapointing...\r\nBefore I start writting about story or about another think I'd like to say this isn't an anime which would make you happy.I think it's the same reason why people's score this low.An anime can't be decided about if it's make you feel relieve or happy.An anime made for emotion not just the good ones even feeling for bad ones.So what about if it's make you feel bad?isn't this anime make you feel bad in a great and amazing way...\r\nStory:\r\nThe story is aboutthe relationships of Fujii Touya and the Morikawa Yuki and her surroundings.I can't say this is much of a love story but I can say it would be carved into your heart's deepest part with a pain(which I seek in a anime if I watch a love story I'd like to feel a little sorrowful(a little maso don't you think ^^;))).\\n\\n\r\nArt:\\n\r\nI'm the type who doesn't want to talk about something which has a diffrent opinion on every people.It's the same in the art part in my opinion I loved the art but I won't say anything u would love cuz everyone has own tastes.\\n\\n\r\nSound:\\n\r\nThis part is a little dissapointing but I could say they play the right song in right place it isn't something like Clannad A.S.(where the people want to kill who made the songs :D)\\n\\n\r\nCharacter:\\n\r\nI can't say I didn't impressed about how the character's personallity was designed but I can say It is a little bit difficult to met alike persons in the reality(not all of characters just 1 or 2)\\n\\n\r\nEnjoyment:\\n\r\nIf u would mean if a drama anime's enjoyment it was much more than enjoyment but if u look it emotionally this anime is a DRAMA anime so I'm begging to people who is not like drama anime to NOT watch it.because when they watch it they won't like it then anime's reputation would be even worser.\\n\\n\r\nOverall:\\n\r\nIt's a great drama anime and even if I didn't cried that much it carved in my deep thoughts",
            "date": "2009-08-11T22:39:00+00:00",
            "helpful_count": 7,
            "mal_id": 17688,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/123612.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gosp07",
                "username": "gosp07"
            },
            "url": "https://myanimelist.net/reviews.php?id=17688"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nLet me get first things straight, I came to watch this anime after \"White Album 2\". White album 2 was really personal, beautiful yet at the same time really depressing. I loved WA2, pretty much everything a bout it. Have even re-watched twice and even then managed to make me depressed and tear up, but in the end I enjoyed it.  It's romance/love moral compass was a tad damaged but in a right direction, thus it ended up well.. thus why loved it.\r\nNow, about this thing...White Album 1. Oh my god.. how awkward and uneasy it made for me. On top of that characters and the previously mentioned romance moral compass.. is utterly off the rails here.\\n\\n\r\nFirst things first story. Yes, serious drama about a guy and Idol relationship, but it was somewhat presented in a really awkward way. All 4 episodes I managed to somewhat  watch through by clenching my teeth together were atrocious. The whole feel and as well the relationship between the characters felt so awkward, uneasy and absolutely annoying. It reminded me of modern day disgusting relationships where people are in casual relationships, one night stands and one with heavy cheating need modifier. And this anime was definitely moving more and more in this revolting direction I hate regarding love/relationships (this type).  Anyhow, story was moronic, disgusting and awkward. Something full of lies, hiding and cheating (most likely).\\n\\n\r\nArt/sound was okay for most part, but last of OST presence felt watching this show really odd and dull.\\n\\n\r\nCharacters, they were weird in manner I did not enjoy. And somehow almost every character just pissed me off or annoyed the hell out.\\n\\n\r\nTo sum it up, it's this type of drama/romance I detest everywhere. Some people claimed it's \"realistic love/sex/relationships\" ,  and I won't disagree, most people are in that type of cheap relationships that really revolts me. As vanilla lover with strong sense of emotion  (or moral compass overall) towards love/sex/relationships, this felt as pushing me away from watching this Anime. Maybe this anime wouldn't gone in that direction, maybe would. Who knows, all I know for sure, is that I don't plan to find out. This anime was plainly annoying, uneasy and just generally not an interesting nor enjoyable experience.\\n\\n\r\nProbably the review where I talked the least about content and the most about how I felt about it, but hopefully people with similar mindset will understand this, whilst so called \"normies\" who think this concept is realistic and normal, won't understand this.\\n\\n\r\nPoint being regarding this \"review\". Story was built, but really annoying. Presentation of characters and overall feel was very awkward. OST had little presence, and I absolutely did not enjoy this.",
            "date": "2017-08-21T05:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 255940,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=255940"
        },
        {
            "content": "Imagine being so close to someone you could feel the heat of their breath yet, at the same so distant. Relationships have a way deteriorating like a rose over time. The beginning is sweet and fragrant, yet the decay is gradual as the petals fall one by one. Now the rose is limped over; the aroma is gone, and there is only death where life used to take root. This is the essence of the white album.\r\n\tWhite album is an anime adaptation of a visual novel released in the late 90s. It was relatively unknown then, and its anime adaptation a decade later still didn’tmanage to shine the light of popularity on the shadow of its obscurity. Its premise is an interesting one; a college student named Touya Fuji is in a relationship with an aspiring idol, Yuki Morikawa.  Yuki’s dedication to her career has begun to put stress on their relationship, creating a rift between them. Touya struggles with his feelings of loneliness and attempts to navigate through the temptations before him.  White Album has the elements of what could’ve been a successful anime: good score, melancholic tone, and some big name voice actors. However, due to some poor story navigation, lack of characterization for supporting characters and a lack of romantic flare, White Album fails to become a successful romance drama.\\n\\n\r\n\tThe show starts off introducing us to the main couple, Touya and Yuki. They have been high school sweethearts for some time and have continued their relationship early into college. But, to Touya’s misfortune, Yuki has wanted to become an idol all her life and decides to take initiative to look for a talent agency. She is quickly swooped up and begins her training to become an idol. All the while, Touya is left behind. The beginning was pretty standard fare and did a relatively nice job setting  the stage for the drama. But the show has a tendency to circumvent any scene by focusing on mundane subplots revolving the other female members of the cast. They all have a thing for Touya in one way or another. These subplots detract from the core of what the show is, dealing with distance in a relationship. The problems of these heroines are usually petty and insignificant. The show gives you no reason why you should care about them. \\n\\n\r\n\tI don’t mind multiple female love interests in a romance drama; that typically makes an adventure more exciting. However, one of the biggest problems of White Album is, the show lacks passion. None of the characters have any emotional depth to them, aside from former Idol, Rina Ogata. They are so dull, so boring, so banal, that I could feel the life draining out of me. They didn’t serve a purpose in the overall narrative aside from helping to establish that Touya is the most milquetoast person imaginable. He will do anything anyone asks him to, to his detriment. He doesn’t believe in saying no, and this causes problems for him and other members of the cast.\\n\\n\r\nAnother issue I have is that lack of focus on Yuki’s side of the story. It would’ve been interesting seeing how arduous it is, becoming an idol. We could have also got a deeper look into Yuki’s feelings and thoughts, but the show seldom focuses on her directly. Other characters will talk about Yuki, but we rarely get to hear it from the horse’s mouth.\\n\\n\r\nLet me dive into Touya’s character for a second. He is probably one of the blandest protagonists out there. He lacks any defining characteristics other than ‘he is nice.’ The show has moments where you can see his real feelings written on the screen. This is a very nice effect and adds some emotional depth to his relatively shallow character. What the show truly needs, is moments of introspection where Touya is allowed to think in-depth about his relationship and his actions. It becomes irksome seeing some airheaded guy repeat the same destructive behaviors ad infinitum without some self-awareness. Don’t get me wrong; I don’t mind a protagonist who has self-destructive behaviors, but there has to be some progression. Touya also has issues with his dad that I felt should’ve been explored more as it would’ve added an interesting layer to the show. But we learn nothing about Touya and his dad’s relationship, leaving a gaping hole only to be filled with boredom.\\n\\n\r\n\tThere are some moments where the brilliance of White Album shines through. There are subtle moments of emotional confessions that are masterfully understated. What I mean is, feelings are being indirectly conveyed through accidental slips of the tongue. I relished those moments. Alas, they are too far in between the utterly dreadful side arcs with the other girls. If you are going to have multiple love interests, only have at least one or two in addition to the main girl. Having too many love interests causes all relationships to suffer because there won't be enough time to develop all of them in a substantial way. \\n\\n\r\n\tWhite Album is a show I wish I would’ve liked. Sadly, it is another missed opportunity. Aside from the glum and oppressive atmosphere, it lacks heart and a soul. It lacks the high drama that makes romantic dramas great. Hopefully, the second half of the series will address some of these issues so the show can, at least, be salvaged. But until then, this love song stays silent. \\n",
            "date": "2016-04-01T21:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 215121,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1325759.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PoeticJustice",
                "username": "PoeticJustice"
            },
            "url": "https://myanimelist.net/reviews.php?id=215121"
        },
        {
            "content": "A 2018 review of White Album, a Romantic Drama Harem show, it also involves idol and psychological themes.\r\nThe story follows a 20 year old named Touya Fuji, and his relationship with his high-school sweetheart, Yuki Morikawa.\r\nTouya is a hardworking university student that has a strained relationship with his father, while Yuki worked hard to become an idol after high school.\r\nVery little is shown of their relationship and past, but one thing is clear they are deeply in love. \r\nHowever when Touya's financial and school situation along with Yuki's increasingly busier idol career start getting in the way how will they handle the strain on theirrelationship?\\n\\n\r\nWhy you SHOULD watch it:\\n\r\nIf you like drama, and watching people be people. Good and bad behaviours are on display here.\\n\r\nThe animation. Its pretty good, when you notice its from 2009 you appreciate it even more. It is consistent aside from some visual cues to give insight into what characters are thinking or key moments.\\n\r\nThe characters. They did a good job at establishing each character just enough so the viewer can catch a glimpse of their reasons and motives during the show. The characters, interestingly, are all contained and closer to one another than you think.\\n\r\nThe story. Despite being adapted from an adult visual novel game, the show does a good job of providing a straightforward plot with a clear end in sight. Yet, there are enough surprises to keep the simple story interesting. The story showcases each character's struggles with their work and romantic feelings really well. The story sets a sombre tone and carries it well, this adds to the drama and psychological element.\\n\\n\r\nWhy you SHOULDN'T:\\n\r\nThe characters though well defined, do not change or get expanded over the season. The only exception being the MC, Touya. In about 2 months, he devolves from a confident, smart, helpful student, to a flaky, whiny, spoiler, spoiler.\\n\r\nDespite the story being well planned out, there are slow spots with an occasional bizarre turn of events that doesn't seem to make any sense. I personally feel like this is heading to a deus ex machina ending in season 2.\\n\r\nThe general feel of the show is sadness, there are few uplifting moments.\\n\\n\r\nOther thoughts:\\n\r\nThis is a good show about what being isolated can do to a relationship, along with how other factors can lead to unintended consequences.\\n\r\nWhile the story somewhat involves what it takes to be an idol, very little is put into showing this. There are no eye popping animated performances or standout songs. The music is not bad, but it rarely helps set the mood.\\n\r\nIts a harem, this could be positive or negative. Take your pick.\\n\r\nEven though it's a harem show, it's not ecchi. In fact its on the complete other end of the spectrum, 100% cheesy drama.\\n\r\nI know what influenced Hachikuji.\\n\r\nI do not particularly enjoy drama shows, but this one keeps me interested. I was rooting for Touya and Yuki but then spoiler spoiler.\\n\r\nIts worth a watch, then decide if you want to see the ending in season 2.",
            "date": "2018-08-21T21:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 287095,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5842135.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dyson14444",
                "username": "dyson14444"
            },
            "url": "https://myanimelist.net/reviews.php?id=287095"
        },
        {
            "content": "This is not your typical harem. There is no kawaii girls, ecchi moments, none. There is, however, a ton of drama that will either make you want to cry or punch the MC in the gut really, really hard. \r\nIn the center of it all we have Touya, a college student juggling work and relationships. He has been dating this girl named Yuki, who by the way is the best girlfriend you could possibly ask for. Then, Yuki becomes an idol and gets famous, and it all goes downhill from there. \r\nI hate Touya so much. He's weak, cowardly, unloyal, and makes some terrible decisionsthat will leave you screaming \"baka!\" However, this is where I think White Album excels at: showing how people are flawed. You may look fine from the outside, but inside you're just a messed up clusterfuck, and I think this was clearly shown through Touya, Yuki, and all the other characters. Everything was just so.. realistic. White Album is a refreshing break from all the other fun and dandy animes out there full of sweets and rainbows and positivity. It shows you the dark side of human nature that we need to be reminded of. \\n\\n\r\nStorywise White Album is pretty difficult to follow. The creators of the show tell the story in some pretty subtle ways, and occasionally left me very confused as to what is going on. Once you piece everything together, though, it becomes very depressing. Being an anime about idols, the music was great: solemn in places, eerie in others, but never cheerful, reflecting the general tone fo the anime. \\n\\n\r\nTL;DR if you're ready for something deep and depressing, this just might be the anime for you. \\n\\n\r\n(First review. Hope that wasn't too painful to read.)",
            "date": "2018-05-04T02:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 279742,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7152169.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LM-Minalinsky",
                "username": "LM-Minalinsky"
            },
            "url": "https://myanimelist.net/reviews.php?id=279742"
        },
        {
            "content": "WHITE ALBUM (2009) SEASON 1 REVIEW : \r\nDirection : The directing is great, the people knew exactly when to blend boredom with music and drama, the love drama is nicely done the characters know how to properly hold a conversation between each other and provide maximum boredom for you plebs who don't get the visual aesthetic over dialogue.\r\nPresentation & Storytelling : Life has never been portrayed as dry as this. When you start to watch a show, you want to escape reality, not be thrown back in it damn it!\r\nWhy are the better shows so boring?\r\nBecause they are a representative of human consciousness, something thisshow presents very well. The watercolor blend between actual animation to change the sense of feeling and atmosphere before/mid episode or the actual characters feeling like ACTUAL non-otaku perfect characters, whether it'd be Rina's smooth talking twoards her brother and MC, or Haruka's tomboyish attitude and cry for help because the sense of loneliness hits her hard. After all, she's just a girl that doesn't get any attention.\\n\\n\r\n- EVEN EMOTIONS/CHARACTERISTICS REPRESENT SOMETHING MEANINGFUL THAN -\\n\r\nEver wondered what if being too kind be presented in a harem make more than just baits? Just were you ever curious how boring reality is? Well.. _This is for you_.\\n\r\nMost anime portray 'realism\" simple and straight forward happiness, families cheering each other or Depressed over the fact someone close to them died, in the most cartoony and unbearable way. When in actuality, reality is much MUCH harsher then what most think. Kindness here is presented as, suffering because it is just that. It is not suppose to be funny, entertaining or happy. Hence the dry presentation in thematics and characters compared to most works, using style and silence over dialogue and narrative. Everything is methodical, thus being slow.\\n\r\nThere are no inner monologues, just text to present feelings. Characters suffer from identifing themselves as anything else but \"Goddesses\" of the day for the MC, because they'd help him in some way or form. However, there are certain characters which take advantage, I'll explain later. The story telling, as mentioned before is extremely dry. In a sense of characters make the progression, while it is adapted from a Visual Novel, the obvious taking ALL character routes is there, turn off for some. But in retrospec it's handled properly, fitting in all character reactions and outcomes to the fullest. They have their fair share of problems, but overall show progression and not cut out with time resets, it's not perfect. But it's solidly done.\\n\\n\r\nCharacters & Thematics : The thematics aren't special, but they're hidden. Through obscure reactions. \\n\r\nexample : Yuki singing the song \"White Album\" while the text portrays words of sadness and emptiness, she shows her true emotion. And as an added bonus snow falls down on the stage, giving more sadness and emptiness to the scenary. Or when the MC gets fired he runs in despair crying, throwing his angst on a black and white rough sketchy background with 0 to no animation. The watercolor opening/endings present also some spoilers for the series, but they present at the same time alot of character understanding. And their character reaction, emotion. \\n\\n\r\nAnd now for the characters, they're pretty simple. But have a weird mindset they're never straight with each others, they lie deliberatly to hide themselves from the audience. The characters may suffer at times from an identity crisis. You'll just be like GET MARRIED ALREADY JEEZ! When, it's not that simple. The characters are in a state of depression and resent themselves and others, so they need something to \"bring\" them together. And that is, those who completely understand each other something that may seem typical. But it's hard to execute, because no one have eyes for each other until they realise their mistakes.\\n\\n\r\nOur harem Protagonist may seem like a typical VN character, but unlike most of them. He is the polar oppisate, in otherwords he doesn't understand at first but gradually gets what the characters mean, what he has to. What he can't do, as I stated above, not everyone is kind hearted. There are some characters that want to take advantage of him, they do so. He gets confused, but in the end, he can't do anything about it because of his kind personality, the rest of the cast question his sanity and reactions hence he get gets angrier and angrier, even after being told the truth by his boss before getting himself fired, he realizes how bad he messed up. He slowly grows throughout the first season and gets developed.\\n\\n\r\nYuki, the cheerful moeblob tries her best to be with her boyfriend Touya, (The MC) but sadly is forced to become a cold and forget about him so she can succeed, but her innerself wants to be with him. So they are constantly mislead in a game of cards, you never know for what they're aiming. \\n\\n\r\nMisaki and Akira, they have oppisate way of percieving and doing things. In other words they are the main couple but their personalities are the other way, Akira isn't cheerful as Touya, while Misaki is cheerful as Touya and does not do anything outside of being the character to mentally connect Akira and Touya's friendship from turning into nothing.\\n\\n\r\nYayoi, oh my this character is the equivalent of oberstein, you can't get her motives until the very end, she shows no emotion in her words and actions, and tries to be something more than your typical female, she succeeds. But is on a level of annoying. In the good way of course. \\n\\n\r\nEiji and Rina, Brother and Sister, they have a playful and arrogant way of doing their things, but they are for the most part. A duet, they are the balance between Yuki's inner sadness and Touya's depression from not knowing how to handle stuff. They affiliate themselves with the MC's even if they're not directly connected. They strive for being themselves, don't try to go beyond that. So far, they are the most playful out of the cast.\\n\\n\r\nSound & Animation/Art : The sound track in WA is beautiful, the piano pieces properly synced with the setting provide maximum level chill and sadness when the time is right, something alot of shows nowadays seem to lack. They're used properly, and play little, but when the time is right.\\n\r\nAnimation is pretty slide show-ish there is little to no animation when characters do something and the scene in EP 13 oh my, the budget completely died there.\\n\r\nMost of the time it's standstill and basic movements such as talking or sewing nothing substancial and hard to understand.\\n\r\nArt design is okay, the designs are basic but do the job, the backgrounds are nice to look at and its over all well polished.\\n\\n\r\nProduction Values : Very solid. No issues there, hard on the eye sometimes with lacking animation or influence. Overall good, dry, and hard to swallow but its great.",
            "date": "2016-02-27T06:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 211778,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4053205.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Seppiroth32",
                "username": "Seppiroth32"
            },
            "url": "https://myanimelist.net/reviews.php?id=211778"
        },
        {
            "content": "This is an anime just about anyone can relate to for we as people often face times where the situation rejects your desires and you realize that even though you wish for your happiness, you would be rejected from it and at times you could fall into a confused or desperate state of mind trying to grasp on to someone or something for comfort. Regardless of what genre you are into, if you begin to watch more then just the first or second episode, you will be reeled into an anime in which the theme is common everyday whereas the setting is however a bitmore rare. What may seem like a harem at first glance is nothing at all as you explore and discover the past and relationship of each and every character.\\n\\n\r\nThis story is about the trials of a couple deeply involved where the heroine(Morikawa Yuki) is a rising star and the hero(Fujii Touya) is a college student rejected by his father. As they both are faced with dealing with the change of their relationship they both try and keep contact with each other as she slowly rises to stardom. The story is especially intriguing due to the fact that the story reeled me in from the start with its sombre atmosphere and environment of Touya's life while being separated from Yuki. The story also keeps you interested throughout without the inserts of pointless fillers thus leaves you hooked after every episode.\\n\\n\r\nThe musical score of the opening is absolutely amazing for I personally am a fan for orchestrated music. But regardless the opening and inserts as well as the ending adds emphasis on what the general mood of the story is. With that being said the music sets and maintains a proper mood for each situation in the story which is an absolute must for a drama/romance (cant have the music ruin the mood of the story right?).\\n\\n\r\nThe characters are each very unique and its hard to classify any of the characters as a certain stereotype which brings me to like this anime further. The additional fact that this isnt a harem even though there are a lot of female characters \"attracted to Touya\" makes me like this anime even further and this is because these characters are vital and the relationships between Touya and some of the characters changes other characters who may not be directly related to Touya in any way.\\n\\n\r\nThus with that being said, whatever that may happen in the story, it was breath taking (if i could exaggerate a little here) and was definitely a complete joy to watch, HOWEVER one thing i did wish for when I finished would have to be a better ending to top off an amazing anime, but one minor flaw wont change the overall success of White Album.\\n",
            "date": "2009-07-17T22:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 16888,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/159667.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/setvenx",
                "username": "setvenx"
            },
            "url": "https://myanimelist.net/reviews.php?id=16888"
        },
        {
            "content": "I went into this show knowing how White Album 2 turned out, the anime I hate the most. So, I was expecting a morally degenerate MC and a bunch of confused girls because of some made up circumstances. But I was completely wrong.\r\nWhite Album is much much more realistic. The scenarios that play out are, while not relatable, unless you have any experience of being in the idol industry or something similar, can be empathized with to an extent and understood. And the main character is also definitely not the shameless wimp that White Album 2's MC is. \r\nAnd the women in this show, haveproblems. But they are not made up or trivial or over-dramatized. They all make sense. They were all forcefully tied into the MC, but still that's the way you make an anime - put someone at the center.\\n\\n\r\nI'm sure this anime will be a 10/10 on a number of people's list - people who like tragedies. But it was just plain depressing. And so that completely took out the enjoyment factor for me. \\n\\n\r\nWhile all that is said and done, this anime is definitely a must watch for any non-casual anime fan.\\n\r\nSkip White Album 2. Stick to this much more believable one.\\n\\n\\n",
            "date": "2016-10-09T15:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 231469,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5442584.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ganz7",
                "username": "Ganz7"
            },
            "url": "https://myanimelist.net/reviews.php?id=231469"
        },
        {
            "content": "*Zels short personal Review*\r\n1986; the year this show was set in, and coincidentally also the year I was born in. These are my type of show, senien romances; no ecchi, no fanservice, drama packed and a slow maturing storyline.  The story is about our main protagonist Toya who dates an upcoming idol star, as he has to deal with the obstacles, he has to face while dating a rising pop star; throw in a bunch of girls for distraction and that's our plot. But unlike most harems, this isn't for kids. As mentioned above, this is no panty flashing show. \r\nThe storyline was prettyinteresting. I felt the relationship with our main protagonist believable. Aya Hirano was a great in voicing Yuki, and throughout the show it was interesting to see how Toya had to deal with his relationship with Yuki, as well as the other girls. Despite Toya doing things he shouldn't (wont spoil it). I never hated and felt disgusted for the guy. Sometimes I might have felt frustrated, but his feelings were pretty understandable and in a way, I could relate too, though from my point of view there wasn't a clear distinction between right and wrong in what he did. \\n\\n\r\nSo what did I learn about the year I was born? Well, I appreciate a mobile phone, even more now. The amount of missed calls in this show is slightly frustrating, but understandable. Mobile phones in that year were bricks, and cost quite a lot. Even answering machines were expensive! Though despite the show being set in the mid 80s, it looked anything but. The show looked great, apart from a few scenes where it's obvious they cut corners. The music was great, and overall it was a pretty enjoyable show. I liked all the characters and really don't have a preference, despite all the female characters involved. One thing I do hate about this show though, is the damn Hiatus. Not sure why they they're airing the next half in autumn when they could have show all 26 episodes. No matter, it's something to look forward to. Overall a very good show.",
            "date": "2009-04-06T06:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 13912,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/61600.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Zelnaga",
                "username": "Zelnaga"
            },
            "url": "https://myanimelist.net/reviews.php?id=13912"
        }
    ],
    [
        {
            "content": "Before you go on to read this review, make not that I have not watched the 2nd season and these were my initial impressions. I gave this anime a shot since all of the reviews rated it fairly well. I heard it'd be a harem anime with realistic events and drama, but truly, I wasn't prepared for what I actually experienced.\r\nLet me be frank, I like harem anime: reverse or not, they're all fairly fun and I understand the flaws in harem anime. While this does not have the ridiculous situations of your usual harem anime, I don't exactly agree that all of these eventsand relationships are possible. There are a lot of girls with no real reason as to why they like the main character aside from his own relationship with Yuki. How often does that happen? I get forbidden fruit is full of temptation, but really, this is too instantaneous.\\n\r\nConsidering Touya's personality, I would put him on par with School Day's Makoto or Claymore's Raki. What exactly does that mean? I think he's an annoying, sniveling coward who has no morals and grates on my last nerves, though I suppose the other reviewers deny that. Maybe I'm one of the few who took offense, but I do have to say, it takes a great writer to create a plot in which one can be so angered by a character. Touya is not without his good traits, though since he does help out a lot of the girls, but he's so damned shady all of the time, I wonder why none of them get suspicious. \\n\r\nI didn't really much care for Yuki. She is the central idea in Touya's mind, but really, I feel like she takes a backseat to pretty much everyone else. She's usually in scenes showing her calling fruitlessly for Touya while he lives his life. While I do think she's sweet, she is your generic helpless heroine who cries a lot and really doesn't seem to have anything outside of her idol life and Touya to talk about.\\n\r\nThere are various other females as well who actually do have their own pasts with Touya, but they are explained in the most shallow sense. I felt like there was too much plot dumping in some instances, where the writers were being too coy and when it came time for them to add a large part to the plot, they just kind of revealed it without tact, yet still, there wasn't too much explained about other aspects to the plot that I would have preferred answered, though I suppose the 2nd season will hopefully solve those mysteries for me.\\n\\n\r\nFor an anime about music, there isn't really any good music to boast about. I kind of like the opening, but it doesn't stand out as far as anime openings go. There's a few instances of singing in the anime like other idol anime, but nothing that really catches your attention.\\n\\n\r\nI find that I did have a lot of complaints about the anime, but in truth, I kind of enjoyed watching it. It didn't really seem to get me excited like other dramas might or even make me cry, but the anime did a good job getting my emotions fired up, which is good I suppose. I hope to see more character development in the 2nd season as well as some more depth to the characters. This anime has a lot going for it and I suppose I just need to give it more time to fully blossom because I can see it becoming a great drama, although I would prefer a better protagonist.",
            "date": "2015-09-18T22:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 198855,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4775014.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jenangelx3",
                "username": "Jenangelx3"
            },
            "url": "https://myanimelist.net/reviews.php?id=198855"
        },
        {
            "content": "Season 1 review.\r\nStory 7:   \r\n   It's starts off with Fuji Touya and Yuki Morikawa. A young adult couple that have known each other since high school. Yuki got a shot at being idol. However as time passed it was getting more difficult for Touya to get in touch with Yuki due to her busy schedule. As time passed Touya got wrapped up in helping others and ignoring or forgetting about Yuki even though he worked close to her in the agency she sings at.\r\n   This is what the story is about. You see a man and a woman growingapart. One trying to keep in touch despite her busy schedule while the other is to wrapped up in helping others that he ends up going down the wrong path and neglecting his girl friend. As the story goes on you meet more characters who are mainly good on the surface. But with hidden motives or hidden feelings. The result is a man being confused and sad mentally and emotionally.\\n\r\n   As it goes on. You see him is a good and bad person. Over all flawed and weak at times in face of certain people or situations. There is more relating to other characters but I don't want to spoil too much. \\n\\n\r\nAnimation/Art 7.5:\\n\r\n   The art and animation is great for the time it came out. I didn't notice any serious problems. Still good but some images look off.\\n\\n\r\nSoundtrack 8:\\n\r\n   The soundtrack is good whether it be the opening or ending especially the vocals for Rina and Yuki(Which I love).\\n\\n\r\nCharacters 7:\\n\r\n   The characters were good even with their faults. However since there are multiple characters some of them don't get as much screen time as others. I feel like Yuki should have gotten a little more screen time even though she is mentioned more then enough.\\n\\n\r\nCons: \\n\r\n   Not for me but for some people who aren't use to this kind of structure which is the context or how it's written. The dialogue and context are harder to follow in this season(not sure about season 2). Some of it gives you part of the context and then gives you the rest later on in the episodes. Some of the stuff the characters have said took some time getting use to but I understood it. Just pay attention and realize that what ever questions you have will be answered later on in the episodes when it comes to the story or plot.\\n\r\n   There are a few scenes like that where characters are talking to each other like that. So pay attention and look back if you need to. Like I said earlier some characters have less screen time then others because there are multiple characters. However there is a 2nd season so this isn't a major issue.\\n\\n\r\nOverall: \\n\r\n   It's can be harder to follow but it's good. It's a more down to earth anime that has a serious tone and takes place from the 80's. No comedy, no over the top gags, and no forced humor. Which is a plus in my book since I don't like anime relying too much on humor unless it's a comedy. That might turn people off and who might find this boring but in all honesty it feels more realistic and I take it more seriously that way. \\n\r\n   Despite it being an anime that has multiple girls as love interest(harem maybe?) It does well and it takes it self seriously. This anime is based off a visual novel, has a manga, and a 2nd series. So I haven't checked out any of them. I almost never make written reviews. \\n\r\n   But I made this review for this anime because it's much better then the user score dictates(which was probably made by people who didn't finish the anime.) While it is flawed and is not a gem. It's a good anime that deserves more attention. I rate it 7.5-7.8.",
            "date": "2019-01-30T14:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 300430,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2647225.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MoonpieMary",
                "username": "MoonpieMary"
            },
            "url": "https://myanimelist.net/reviews.php?id=300430"
        },
        {
            "content": "I just felt like writing a review, it is my first one too. \r\nbut i wanted to werite one about an anime where i can put my thoughts in it. \r\nAnd white album really was a special anime.\r\npeople might say that i'm wrong about giving this anime such a low scoe, because i think it deserves to be better, but the one and only problem i just can't let go is the protagonist.\r\nThe anime is basicaly a harem with a lot of drama in it. what this anime does is making the harem a bit more realistic, you might ask yourself now: what is wrongwith that?\\n\\n\r\nwell, nothing is wrong with that, but in my opinion, they wanted to make the protagonist, who is the girls magnet, reallistic as well. in my eyes, he is just a man who he loves everybody while he has a girlfriend. and the worst thing is, is that he just hides hit from yuki, while she is just trying to make her dream come true, being an idol and perform on stage.\\n\\n\r\nok, i might have said too much here, but the point is that the alpha male is a huge douchebag, that it destroys the anime. he just pisses me off of how unloyal he is.\\n\\n\r\nspoiler alert!:\\n\r\nin the second season i hoped he would be a better person, but he is even worse in 3 episodes then whole season 1.",
            "date": "2015-02-15T18:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 180429,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4423905.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Fryz3",
                "username": "Fryz3"
            },
            "url": "https://myanimelist.net/reviews.php?id=180429"
        },
        {
            "content": "Some spoilers throughout. \r\nStory\r\nThis was definitely hard for me to get into my head but do realize the timeline in which this show takes place is 1986. This is the big reason for the show even working in the way it does as lots of unfortunate mishaps can occur without connection all the time. For example, when they tried to meet up the couldn't find each other and landed up searching around at the same time and barely missing each other. The story was most definitely confusing at first for me, but it slowly began to unfold and make more sense. The story of acouple with near no way of communication and the struggle they would endure. A struggle indeed as every single woman has a need to get in the way of their relationship. I will go into more depth under the character section, but will note that the ending episode was a great place to leave of for season 2. \"The beginning is now over.\" I believe season 2 has great potential to exceed this show as I feel like it will go into the real struggle the two will go through.\\n\\n\r\nArt\\n\r\nI truly love the art of this show. Each and every character is beautifully made, scenery is well done as well. I mainly believe that the characters and art are great points in the show as the characters are all beautiful and even match the way that they act.\\n\\n\r\nSound\\n\r\nThe sound was great as the music truly twists my heart when I hear it. In the final episode, with the song from Yuki was stunningly perfect. The lyrics, the sound, perfectly set the mood for the final episode.\\n\\n\r\nCharacter \\n\r\nIn total each of the main characters play a role into developing the story of issues between Touya and Yuki. I'll begin with the supporting characters as by understanding them will lead to understand Touya and Yuki better.\\n\\n\r\nYayoi - The beautifully deceptive Yayoi. I definitely believe she is the most attractive of the bunch though she probably causes the most problems between the two lovers. She is the manager of Yuki and she believes Touya is a distraction to her. Which can be relatively believable, but she the take it to another level. She abuses this and stops him from ever seeing Yuki. In exchange she pays Touya money and even her own body. We see this in the show through kissing scenes and even when Touya falls through and throws her on his bed. She continues by even not giving a letter from Yuki to Touya. This leads to much more confusion as Yuki wonders why there was never a reply. Also, we learn by the end she really doesn't have feelings for anyone but Yuki.\\n\\n\r\nRina - Close friend and even co-worker to Yuki. She caused minor problems, while even helping the two. In the beginning it seemed as she was all for the two together as she helped set up an opportunity for the two to be together while they were at work. Though this occurred she seemed to fall for Touya as she kept trying to hire him into her crew or see him for no reason. In the show she hired him, but his job was literally pointless as he was just there doing absolutely nothing. In the end, she fires him because of  a the letter that Yuki never received, but I believe she did it since he told her that he was going to spend the day with Yayoi.\\n\\n\r\nMisaki - This girl is a mess as she obviously loves Touya and she later felt bad for using him when they helped make costumes for a play. Touya eventually says he loves her but she just tells him otherwise. She helps advance the story because it shows that Touya is becoming truy lonely and potentially may go for the \"easy access.\"\\n\\n\r\nFor Haruka and Mana I won't say much as the seem relatively pointless, especially Mana.\\n\\n\r\nYuki - She seems very confused as she wants to see Touya doesn't? I am unsure why she doesn't but I assume it is that she wants 100% focus on becoming the best idol there is to be. Her letter was confusing as she apologized and pretty much said we won't see each other at all, but hey we love each other right? so make sure to come to my concert!! Honestly very confused with her actions.\\n\\n\r\nTouya - I think he is a good character in the sense he realistically applies human actions. People make mistakes and can fall under pressure. I say this as he doesn't purposefully hit on each and every girl; instead, for example, he helps Misaki out, but it seems as if they are together. As for the pressure it can be seen through the whole relationship between him and Yayoi.\\n\\n\r\nOverall\\n\r\nI really enjoy this show though the problems with this show are that it isn't obvious in what is occurring. Besides that point I think the show is good, as it shows the ways of how people are all different in similar situations. \\n\\n",
            "date": "2018-09-07T15:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 288401,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5971755.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BabyChiem",
                "username": "BabyChiem"
            },
            "url": "https://myanimelist.net/reviews.php?id=288401"
        },
        {
            "content": "Going to use Bullet Points to show to good and bad from this series.\r\nSynopsis:\r\nOur main character (Touya) is in a relationship with an up and coming pop singer Yuki Morikawa, For me the story is showing how tough it can be for a relationship if both are busy, Yuki is always busy being in the \"Media\" as she is now trying to become a famous singer, and Touya is going to college + doing 2 part time jobs.\r\nStory:\r\nSetting of 1986 is fantastic, every little detail is spot on, and this MAKES the series for me, In our times (2012+) we can Phone each other direct,back then they couldn't do that, Only phone their respective homes/houses, you can talk to them over the internet, another thing you cannot do in 1986.\\n\r\nThis creates a problem that today could be less so, How do you build a relationship and maintain it if both people are very busy?\\n\\n\r\nCharacters:\\n\\n\r\nAs this was a \"Harem\" game adaption, we get treated to MANY characters, One by the end of the S1 & 2 you will get attached to the characters, Each one have their own unique traits.\\n\\n\r\nSound:\\n\\n\r\nClassical music and overall the soundtrack for this series is Sublime, Is rather fitting of the whole style of this Anime.\\n\\n\r\nVoices are perfect too, Even down to the sub characters, Suit the style of character they are on the whole, and did enjoy Aya Hirano's Yuki's performance amongst many.\\n\\n\r\nOverall/Enjoyment:\\n\\n\r\nI LOVED the setting/style/characters and even the story, But was not a massive fan of the main character, lost my caring factor for him during this season, Which may of affected parts in this series, But in a nutshell, its one of the most unique Romance/Harem i've seen, its classy too and hard to describe, but when you go into a new anime series, this has a Awe about it, I really enjoyed this season/series, and would say if you like any of the recommended them watch this you WON'T regret it, you will watch them back to back, that's the sign of a good series.\\n",
            "date": "2012-12-01T15:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 78842,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1514017.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lukas10",
                "username": "Lukas10"
            },
            "url": "https://myanimelist.net/reviews.php?id=78842"
        },
        {
            "content": "At first it was very, very confusing. I seriously thought I missed some episodes in between, but no. Thing starts off, things happens and the characters are very hard to grasp. It's like when you walk in the middle of a story.\r\nThen things stats to get better, I actually enjoyed a few episodes and then things get aweful. I mean, it was a pain to watch the characters go down in a pathetic spiral of 'death'. No one dies, but you'll wish they did instead.\r\nThis anime brings down all the aweful things that can go wrong in your life on a character that can obviouslynot take any of this and just \"goes with the flow\", not even fighting it. \\n\\n\r\nPainful to watch and confusing most of the time. Some say it's a masterpiece because it makes you cringe, but countless other anime does that and are better than this.",
            "date": "2015-06-05T12:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 189616,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/dathanime",
                "username": "dathanime"
            },
            "url": "https://myanimelist.net/reviews.php?id=189616"
        },
        {
            "content": "To be honest, the anime was quite painful to watch at first. Disregarding reviews and forums I've read about the anime (before having watched it myself), I found the beginning parts to be a convoluted mess of stories. I felt as if I was being thrown into the middle of what was going on, without any proper contextualization or grounding in order to keep me up to speed. Nevertheless, there were several things that kept me watching (although it took weeks before I watched episode 2, after having watched ep 1) despite all these things.\r\nRatings:\r\nStory - 7\r\nArt - 7\r\nSound - 9\r\nCharacter - 7\r\nEnjoyment - 8\r\nOverall- 7\\n\r\n(I know that the overall isn't mathematically plausible given the rest of the ratings, but then I can't give the first season an 8 since the second season was much better)\\n\\n\r\nStory: White Album's story isn't for everyone. Of course, you should be aware of what you're getting into in the first place (from the genre and stuff), but then the story is just so convoluted. A lot of things don't add up, and realism is basically thrown out of the window, given how implausible some of the relationships and connections are (although Season 2 somehow rectifies this by establishing context). The whole main plot point of the Yuki-Fujii relationship (between a rising idol and a plain guy) isn't implausible at all (and has been done quite a lot before), but the other relationships that arise from this focal point can be quite unrealistic. I leave you to discover those for yourself. Nevertheless, I still found it to be pretty entertaining, because it is a very mature story. While I did say that realism was thrown out of the window, this anime should be given props for refusing to subscribe to an overall happy theme: it takes advantage of the darkness of its plot, and uses it to fuel other elements of the anime (music, etc.).\\n\\n\r\nArt: I'm not so much of a good judge of this category, but my rating is based on other animes I've watched, I guess.\\n\\n\r\nSound: It's pretty expected for this anime to have good music. Hell, I'd be disappointed if it didn't. White Album is centered on the music industry, so at the very least, its music should be above average. Needless to say, both the OP and ED are pretty good, and the flagship songs (the eponymous White Album and Sound of Destiny) are pretty distinctive, so this anime doesn't fall flat in the music department. If anything, its OSTs are one of the saving graces of this anime.\\n\\n\r\nCharacter: The characters are integral to the story, so the failure of the story to deliver also translates to the characters. Fujii-kun is hard to empathize with, and he is not exactly a very lovable character. That, however, is forgivable given his status as the love-interest of the harem. However, his character also lacks a fundamental characteristic (or set of characteristics) that justifies his position as the central character of this harem anime: this failure to establish that makes his other relationships with the other characters improbable (again, this is partially rectified in the Second Season).\\n\\n\r\nEnjoyment: Despite all that has been said, I did nejoy this anime (especially towards the latter half). I began to appreciate the depth of this anime, and I felt that it was somehow able to compensate for the acute lack of characterization and context. Luckily, the second season was able to take advantage of this \"depth\" and extend it further as a strength.\\n\\n\r\nCAVEAT: I've seen a lot of people comparing this anime to \"White Album 2,\" which is considered a sequel (despite the universe and the soundtracks being the only similarities between the two animes). I feel that both animes are fundamentally different in terms of what they intend to deliver: White Album is intended to be more mature, while White Album 2 is much more similar to the usual animes (being set in a high school setting and all). White Album exposes you to the music industry, power plays between top executives, trysts, and other concepts that are absent from White Album 2. This is not to say that White Album 2 does not deliver anything (in fact, I still enjoyed it more than White Album); it's just that I feel that comparing the two animes doesn't do justice to the differences between the two of them",
            "date": "2017-06-09T08:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 249575,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6175100.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/El_Anciano",
                "username": "El_Anciano"
            },
            "url": "https://myanimelist.net/reviews.php?id=249575"
        },
        {
            "content": "Warning this review may contain spoilers.\r\nFirst impressions, way back before I never started reviewing I was chatting to a friend of mine who did a visual novel walkthough  that this anime is based on and recommended me to watch the show.\r\nGoing into it I didn't have that high hopes or expections,\r\nBecause I had herd very mixed opinions about the show from some quick research I did.\r\nI was kind of thinking at the back of mind ok I watching a show about an idol relationship with this one dude and there is a harem involved so how.\r\nThe bar was kind of lowed.\r\nQuick side note,\r\nI willcover both seasons of this anime,\\n\r\nBecause for some reason they decided to spit the story into two seasons,\\n\r\nSo to save me time and you time I am just going to do cover both  seasons at once.\\n\\n\\n\r\nStory,6/10\\n\\n\r\nThe plot of white album starts out with are main character Tōya who is in this relationship with this up and coming idol named yuki.\\n\r\nSo I was thinking while watching this,\\n\r\nThis is ether going to probably be about them growing apart more   as time passes by or this is going to do a little bit of criticism about the Japanese idol industry.\\n\r\nBecause In real life I have herd about some things about the Japanese idol industry and if there true or not it's a little worrisome to say the lest But back on topic.\\n\\n\r\nThe story kinda dose a bit of both but manly focused  on the first thing  I mentioned.\\n\r\nWhich is fine,\\n\r\nBecause it isn't exactly as forced as you think it would be.\\n\r\nBecause are main character Tōya  ends up getting involved in all these other  girls issues and some of them just want to get really close  to are main protagonist  if you catch my drift.\\n\r\nWhile yuki is working quite hard and doesn't have much time to spend with him.\\n\r\nPlus it doesn't help that there setting is in the 1980s when cell phones aren't are main stream as they are now a days or that her not being around and with other chicks kind of sniffing around isn't really the best thing for a relationship.\\n\r\nAnd speaking of girls sniffing around I felt that the harem  aspect was a little forced in some respects.\\n\r\nLike I can understand Some of the characters reasons for why they like him,\\n\r\nFor example yuki or his child hood Friend haruka.\\n\r\nBecause that makes sense in the context of what there are to each over.\\n\r\nBut I what really makes me go through a bit of a loop is why exactly dose the manger chick or that other idol who worked for a different company  kinda show interest in him,\\n\r\nLike the same friend who told me to check out this show pretty much explained it like this.\\n\r\nIt because there using him as kinda a escapeism   from life or something like that.\\n\r\nWhich I can kinda see that.\\n\r\nBut at the same time it's explained in such a vague way which first time around I didn't really pick and second time around I can see that but I feel there more to it than that or maybe I am just over thinking it.\\n\\n\r\nOne thing which I thought was interesting is that we get quite a bit of background plots, \\n\r\nLike we get a side story about the main character and his relationship with his dad which was sort of interesting.\\n\r\nWe also get this one dude trying to back mail people and  shit like that and we also have a few scandals here and there.\\n\r\nSo at lest we have something here that isn't just harem and romance.\\n\r\nWhich over all I was quite happy this was here.\\n\\n\r\nI think my overall pros about the story is that it's handled maturely enough and there some part when there where kinda subtle of what going on,\\n\r\nBut I feel it could just me confusing subtlety for vagueness.\\n\r\nBut when I think about it could easily be a mix of both actually.\\n\\n\\n\r\nBut I guess the quite a few nitpicks That I have is.\\n\\n\r\nFor one this show try's to build up to things like the black mail and scandal things which  I talked about before.\\n\r\nBut the problem is that the fizzles away so quickly and I don't think that was the intention  behind it but I feel they didn't know how to capitalize on it ether.\\n\r\nLike back for the black mail thing for a bit.\\n\r\nOne of the people involved basically sold to the person he was black mailing the negatives for the photos  he was using   to back mail her.\\n\r\nSo basically he sold the only thing he could have used to get more money from her,\\n\r\nEspecially because after that the photos had been destroyed or something along those lines.\\n\\n\r\nAlso same thing with the scandal or the main character sleeping with other chicks,\\n\r\nLike it hints that something going to happen but doesn't or isn't really handed the way  it should have been.\\n\r\nWhile I am on the drama topic it doesn't leave much of an impact.\\n\r\nWhich is kind of sad because it seems like they tried.\\n\\n\r\nSo this story is pretty much we have some ideas but we not going all the way with them.\\n\\n\\n\\n\\n\r\nCharacters, 5/10\\n\\n\r\nMain character toya is kind of bland and basic,\\n\r\nThe only thing I got from him is that him and his dad have some issues and that he seems to sleep around a bit.\\n\r\nWhich was a little stand out.\\n\r\nBut not that interesting or noteworthy.\\n\\n\r\nSide characters are kinda basic as well,\\n\\n\r\nI thought some of the drama was slightly interesting,\\n\r\nLike the girl that the main character is schooling has these issues with her  mother  and the child hood friends who for while couldn't play tennis because she hadn't gotten over her older brother death.\\n\\n\r\nOther than that nothing that really got my interest.\\n\r\nAnd I really hate having to say that.\\n\\n\r\nThe character interactions where fine,\\n\r\nBut nothing really much to write home about.\\n\\n\\n\r\nArt, 6/10\\n\\n\r\nThe animion  is above average at best,\\n\r\nThe backgrounds are kinda mah.\\n\\n\r\nThe art has this very dim and almost depressing look to it.\\n\r\nLike most of the scenes looks really dark even when it day time in the those scenes.\\n\r\nAnd also the art style at times changes into this water paint look.\\n\r\nWhich I quite liked.\\n\\n\r\nCharacter design look pretty average.\\n\\n\\n\r\nSound, 5/10\\n\\n\r\nBoth the op and ending songs really didn't my interest,\\n\r\nLike they sounding quite genetic to me.\\n\r\nI guess they sounded nice but it didn't really click with me personally.\\n\\n\r\nEven some of songs they actually did when the idol characters where doing a song or somethings like that.\\n\r\nIt also really doesn't stand out that much.\\n\\n\r\nThe ost was the better thing out of this,\\n\r\nBecause it had a nice classical piano tracks that sounded quite nice and fitted quite well with the series.\\n\r\nAnd this is coming from a person who isn't really a big fan of classical music.\\n\\n\r\nThe ost was done by Fujima, Hitoshi,\\n\r\nWho has done music and ost  for dog days if any one herd of that show.\\n\\n\\n\r\nEnjoyment, 5/10\\n\\n\r\nAs far as enjoyment goes this was probably one of more average show enjoyment wise.\\n\r\nLike I enjoyed the drama and all that shit.\\n\r\nBut like a seid before it kinda just fizzles away.\\n\r\nWhich really put a damper on my enjoyment.\\n\r\nBut overall it was an ok time passer for me.\\n\r\nBut I do wonder what I could have just as easily skipped this show for something more enjoyable.\\n\\n\r\nOverall, 6/10\\n\\n\r\nIf you like story's about Japanese idols then maybe you will like this.\\n\r\nIt isn't exactly bad but it not really amazing ether.\\n\r\nYou not going to miss much  you skip this show and watch something else.\\n\\n\r\nIf you don't like these kinda by the books romance shows them probably avoid this at all costs.\\n\\n\\n\\n\\n\\n",
            "date": "2017-03-10T10:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 242260,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4681991.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Biogundam",
                "username": "Biogundam"
            },
            "url": "https://myanimelist.net/reviews.php?id=242260"
        },
        {
            "content": "About this series (first and second season) - White Album is a creation of an experiment. White Album is an experiment of two strings; a red string and another thin but ductile red string.  These two strings had always been together until one of the strings got mixed up with other strings. The remaining red string was left in the dark; awaiting for its lost partner. Distant relationships aren’t always satisfactory, since they create tensions between both sides.  Affection and devotion isn’t as turns out to be; for it only stays rigid after witnessing mutual beliefs and characteristics.  However, this isn’t seeminglytrue. Throughout the anime, we learn that one can keep their ideology of devotion whilst their partner might rebel against this axiom. Even if a person knows that the actions of their rebellious partner, they remain strong and would naively wait for their partner’s acceptance in devotion of love.\\n\\n\r\nStory- The overall idea of progression in this anime isn’t the anime’s specialty, for it only confuses the audiences. Every scene seems to head on one direction until it clashes with another contradicting scene. For instance: a case of poisoning, an accident, and a fallacy of a scandal all occur in a single episode. These events have absolutely no relation to each other, thus confusing the audiences by creating unnecessary dreary plot. Instead of concentrating in a precise event and simultaneously giving it more attention, the swirl of different events creates inaccuracy in narration. However, the anime does contain a positive attribute. The overall idea of long relationships can differ in many ways. In this series, we get to witness a heroin that strongly desires passion and fondness from the main protagonist.  The idea of someone to believe that their partner belongs to each other doesn’t always turn out be right. In a few cases, that person would continue to believe a pipe dream as such. Even after being hurt, they would continue to seek affection from the person that didn’t pay attention to their devotion of love. \\n\\n\r\nArt- Even though it clearly fits into the setting of 1986-1987, the anime’s art style isn’t quite attention-grabbing. Another way to describe an art of such is plain or ordinary. As similar to having a meal of plain bread; it doesn’t brighten or give a special excitement to the audiences.  Appearances made in the anime can easily be forgotten due to the lack of creativity in the anime. As I brag about the plain art style in my perspective, it is fair to say that it still fits the overall dramatic environment throughout the series.\\n\\n\r\nSound- The soundtrack is the best attribute in this series. The soundtracks are mainly classical, which fits into the category of drama very well. These soundtracks enhance the implantation of each scene throughout the series. It may make us feel guilty or feel bad for a character; this is the anime’s specialty. White album and the second opening describe the heroin’s feelings and thoughts for the main protagonist. \\n\\n\r\nCharacters- The main protagonist in this series isn’t an ideal protagonist. He often makes clumsy blunders and he is often left with an impression of lacking common sense. His actions are often questionable; he never seems to make the right decision throughout the series. Unfortunately, his actions seem to be affecting the whole anime. Without the main protagonist’s ignorance of comprehending people’s feelings, the whole anime would’ve been affected. The idea of devotion and loyalty would be difficult to prove without his existence. In simple terms, the main protagonist doesn’t quite have a noticeable or appreciative personality or trait but he holds a critical position in the series. The main heroin in this anime is a very dependable person. Despite losing confidence after witnessing the betrayal of the main protagonist, she still continues to adore him. As similar as a goddess, she is forgiving, gentle, and caring. Other characters simply confuse the main character by making him believe that they are the goddess that he seeks.\\n\\n\r\nEnjoyment: This anime was fairly good. It had a few good and cringe moments. \\n\\n\r\nOverall: This anime isn’t what I had expected it to be from the very start. With very few noticeable or decent scenes that carried out throughout the series, I believe the anime isn’t the greatest or the worst in terms of decency. \\n",
            "date": "2016-10-15T06:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 231823,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4158349.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 10,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/T_TK",
                "username": "T_TK"
            },
            "url": "https://myanimelist.net/reviews.php?id=231823"
        },
        {
            "content": "This is one of the most overrated anime I've ever seen.  I picked it up because I'd heard good things about it.  Like most anime, I tried to go in completely blind, so as to avoid any spoilers and get the full \"First Timer\" experience.  I had no idea that this was a show based off of a dating sim, or I probably would have picked up on that it was going to be utterly horrible from the beginning.\r\nBut I didn't, and by the time I realized what kind of story this was going to be, I was a good seven episodesin.  So I figured, may as well finish the story, right?  That was such a torturous idea.  Twenty-six episodes of horrible characters with no redeemable qualities, all constantly falling over one another to get banged by Sir-Cheats-a-Lot.  By the end of the show I was genuinely impressed that he hadn't laid moves on every character in the entire show, with the exception of the completely untouchable incel friend.\\n\\n\r\nNone of the plot made any real sense and the entire thing just seemed to be \"How can a bunch of people be as pretentious as possible, while still allowing MC to bang everything that moves?\"\\n\\n\r\nThis was an entire waste of time, and every human being is better off skipping it.  The fact that people took so much time and effort to beautifully animate such a completely trash plotline and character base is beyond me.",
            "date": "2018-11-26T11:18:00+00:00",
            "helpful_count": 0,
            "mal_id": 294764,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4065865.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Unconfidence",
                "username": "Unconfidence"
            },
            "url": "https://myanimelist.net/reviews.php?id=294764"
        },
        {
            "content": "IMO, this is NOT an ecchi, harem show. This is full on heavy drama with very little hints of ecchiness.\r\nYou should watch this with an open mind and you should have complete control of your rage. If you can watch this, I think you're ready for SCHOOL DAYS.\r\nYou are dropped off in the middle of nowhere, all you know is your name and you are waiting for some hint of back story. You get none. This will continue until the last few episodes of the second season.\r\nPeople who would like to try it, should have patience. The story is great. Just wait and see. Thestory has some School Days elements in it (one of the heroines is like Kotonoha without the violence.) Also, the setting of the story is really something refreshing for me and it adds more to the plot.\\n\\n\r\nPlease do watch it if you have the chance or if you want something different.",
            "date": "2013-08-29T20:43:00+00:00",
            "helpful_count": 0,
            "mal_id": 111587,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3030477.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/An-chuk",
                "username": "An-chuk"
            },
            "url": "https://myanimelist.net/reviews.php?id=111587"
        }
    ]
]