[
    [
        {
            "content": "I just recently finished sola and I wanted to start off by saying that I am very strange in what interests me in an anime and instantly, from the first episode, I knew that I would love sola. The song in the introduction of the first episode caught at my soul and moved my heart and I also have a personal attachment to taking pictures of the sky and my digital camera, which is what the main character in this anime is like, of course he doesn't quite understand why he is obsessed with the sky, but there is a deep and wonderful meaning behindit.\\n\\n\r\nThe anime, as I said, for me, had an awesome introduction, the music, the setting, the mystery of the night, the going to take pictures of the sunset and all that was beautiful, but I also loved how normal and cute the main girl character came off as when the main character first met her. She was not remarkable or amazing (although beautiful, one of the most beautiful I have seen), but she was very cute and charming and he instantly adored her as so many people would have.\\n\\n\r\nThe anime does go a bit slow from there and moves from the main characters a bit, going into parts of their stories, but I really enjoyed the weird flashbacks they threw in there because they were extremely interesting and made you really want to know what had happened in the past, so when the anime did slow down a lot, it could keep you going for a bit.\\n\\n\r\nThe anime is very serious at some parts and also very mature and what some people would consider slow in action, was just the blossoming relationship between the main characters, which, to someone watching this kind of romantic and supernatural anime would expect. There are very cute scenes between the main character and the girl, Matsuri and as the title says, it is very focused at the sky and Matsuri's power/ailment/curse is quite awesome in my opinion, I just wished she had used it more.\\n\\n\r\nI really enjoyed the turn it took with the main character's sister, Aono and her history and just her in general. She was insane, but that's what I like in anime girls and she was fiercely loyal and loving, which is awesome. \\n\\n\r\nThe art was really wonderful, in my opinion! I adored how they were drawn and Matsuri, especially, is one of the most beautiful anime girls I have ever seen.  I enjoyed how Aono and Matsuri were both very unique and splendid looking, but the main character and his normal friends were generally normal looking, since they were somewhat normal people. The main character's best friend, Mana, was also very enjoyable, unlike her part in many other animes when she is just in love with the guy and depressed all the time, but a tomboy, this time she had personality and caring and she was smart and curious! The settings were beautiful and the time that the main character and Matsuri did spend together was basically magical, in my opinion and the way it was animated gave off this unrivaled feeling of wonder and love.\\n\\n\r\nI always enjoy when in anime, people have normal responses to things and can act all sneaky and weird about things - example, the friend, Mana, thinks someone is at the main character's house, so she gets him out of it and then goes snooping! Normalcy!\\n\\n\r\nThe turn that the anime takes is very unique and the true story behind who you think is bad and good and everything else is also very interesting. The fights were fun to watch, even though not enough of them, in my opinion and I overall really loved this anime.\\n\\n",
            "date": "2007-11-07T10:24:00+00:00",
            "helpful_count": 175,
            "mal_id": 1235,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9646.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yandere",
                "username": "Yandere"
            },
            "url": "https://myanimelist.net/reviews.php?id=1235"
        },
        {
            "content": "Let&rsquo;s check off the things that annoy me, shall we?\r\n~  A world where kids conveniently don&rsquo;t have parents.  Because that would mean the writers would actually have to be skilful enough to write stories including them.  The only featured adult in the whole story is obviously a hindrance to everyone, except midway when he suddenly becomes every male pervert's role model.\r\n~  Girls that fawn over one witless guy who doesn&rsquo;t deserve any of them.  They fight to the death over him, but why should we care?  Why should we be invested in any of this if we cant understandwhy anyone would want him in the first place?  He is completely and utterly undeserving of it all, and it renders everyone's actions perplexing.  Well, not so much perplexing as it is tiresome to watch this anime go through every clich&eacute; in the book to appease undemanding 'fans' of the genre.\\n\\n\r\n~  Main protagonist boy who is an empty cipher throughout the entire story.  A complete plank of wood with no personality and no discerning features other than his hobby of taking photos of clouds.  This is not 'characterization', its an excuse to make him look interesting.  He is in actual fact no different than a million other one-note protagonists of this genre.  In fact, the more I think about it, the more it makes sense that the main characters of these stories are usually ciphers, rather than fully fleshed out and interesting people.  Because it makes it easier for male viewers to project themselves onto the character.  How sad.\\n\\n\r\n~  Girl character who is treated like a wayward sexual pet by guy.  At least Elfen Lied had the decency to make the female character a bloodthirsty psychopath.\\n\\n\r\n~  Boring characters.  Every single one of them.  Except for maybe the little girl in the green dress, she had a nice attitude.\\n\\n\r\nThis anime panders to all the moe-loving adult perverts and too-young-to-have-developed-decent-taste youth.  Sola's great animation and brief flashes of what could have been an interesting tale are let down by all of the above.  There was potential here; to explore people that can never live in the sun, the affects of immortality in a child's body, but the producers were more interested in filling a quota than in story and character.  Some of these characters are supposed to be more than a hundred years old yet they still act like brats.  Thats because logic is thrown out of the window in sola, because the characters are designed for viewers tastes.\\n\\n\r\nJapan's most popular anime of 2007?  Depressing.\\n\\n\r\nDon&rsquo;t downgrade this review because it&rsquo;s negative.  Downgrade it because you've yet to grow out of this genre and realise that this anime is the equivalent of a McDonalds happy meal: planned by a committee, packaged prettily but ultimately tacky, cynically driven and bad for you.",
            "date": "2008-01-26T04:35:00+00:00",
            "helpful_count": 131,
            "mal_id": 2165,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/29975.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Beatnik",
                "username": "Beatnik"
            },
            "url": "https://myanimelist.net/reviews.php?id=2165"
        },
        {
            "content": "As the title implies, this Romance, Drama is heavily themed on the sky (sola), which is definitely different than the usual anime but that may not always be a good thing. It&rsquo;s quite interesting how something we take for granted like the sky can be such a treasure to other&rsquo;s but it&rsquo;s irritating that the bulk of the story has something to do about the sky.\r\nThe other main focus of the show is on the blossoming romantic relationship between the two main characters; Yorito is an average guy who&rsquo;s obsessed with taking photos of the sky and Matsuri, she&rsquo;s the &ldquo;special girl&rdquo; usually found inthese types of anime. This type of set-up has been done many times before and compared to other masterpieces, Sola just seems average. With such a dull premise, a lack of action and unanswered questions it&rsquo;s easy to lose interest in this show. At least as the story begins to develop all of these issues become a thing of the past and the show ends up being good to watch.\\n\\n\r\nThis anime ends up doing a not-so-good job in the character department, with the same 7 characters throughout the series. The characters are really average and have the sort of personalities that have been seen many times by an anime fan. On the other hand the show does manage to surprise us with some interesting developments on Yorito (male protagonist). The only other interesting characters in this anime are Matsuri and Yorito&rsquo;s so called sister Aono because of the mystery that shrouds them and they&rsquo;re the only ones that are developed well, throughout the series.\\n\\n\r\nThe visual quality of this animation is definitely above average with this anime embracing various new animation techniques and styles. Just like the title implies, a lot of detail was put into the skies, clouds and lighting effects. Even the water looks superb, yet it&rsquo;s a shame that some of this effort wasn&rsquo;t put into adding more dynamic characters to the screen.\\n\\n\r\nThe music was decent with a unique blend of piano, string and harp melodies as background music. It is certainly suited to the calm and dramatic nature of this anime however it did little to add excitement, on the rare occasions of an action scene.\\n\\n\r\nOverall this anime closely resembles &ldquo;Lunar Legend Tsukihime&rdquo;, in the sense that both shows revolve around two mysterious girls romantically involved with the male protagonist, who&rsquo;s unsure of himself. Both shows have the same sort of pace as they start of slow but then finish quick. As a Romance Drama Sola does a decent job in both departments but it was only halfway into the short series that it really kicks in, with shocking character developments and intense fights. The show ended well with the final dramatic confrontation and happy-sad ending, so I only recommend this anime to fans of romance and drama but not for the action lover.\\n\r\n^_^",
            "date": "2007-10-23T08:46:00+00:00",
            "helpful_count": 94,
            "mal_id": 1091,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=1091"
        },
        {
            "content": "It was kind of boring at first, because after the first episode, nothing interesting really happened. It did get better during the middle, then better turned weird, but it wasn&rsquo;t that bad. Let&rsquo;s just say it has something to do with paper. A lot of paper.\r\nCharacters are really weird. First you have Yorito &ndash; someone completely obsessed with the sky. I don&rsquo;t even know why he&rsquo;s that obsessed. Then there&rsquo;s Matsuri, who surprisingly, is kinda ecchi in her own way. Aono &ndash; you either love or hate her. She&rsquo;s naturally funny, but towards the end, you just might hate her. Mayuko, the gothic Lolita, iskinda tsundere, and Takeshi, the guy who&rsquo;s always with her, I just don&rsquo;t get him at all. His personality changes all of a sudden during the second half. Mana&rsquo;s actually pretty insignificant.\\n\\n\r\nI&rsquo;m a bit surprised that Mai Nakahara and Ai Shimizu are both in Sola, and once again, they&rsquo;re playing close friends. Mai Nakahara plays Aono Morimiya, while Ai Shimizu plays Koyori Ishizuki. Mai Nakahara does not sound like her usual, cheerful self though. This is probably my least favorite out of all the characters she played, since Aono lacked emotion in her words. In fact, it was the same for almost all the characters. I just didn&rsquo;t feel their presence.\\n\\n\r\nAnimation is pretty good. The backgrounds are really nicely drawn, and I like the incorporation of real images with the animation. My only problem is the character design. The characters look really skinny &ndash; I know this is common in most anime, but their faces are really skinny. The characters tend to look old because of that, especially Yorito.\\n\\n\r\nThe opening and ending themes were really nice. I like how mellow and soft the songs were, especially the ending theme, titled appropriately as &ldquo;mellow melody&rdquo;. The opening theme, &ldquo;Colorless Wind&rdquo;  wasn&rsquo;t bad either. In fact, I think it&rsquo;s nicely done. I love the strings in the beginning, and how it really fits the story of Sola.I do have a problem with the BGM, because during the beginning of the series, the BGM used didn't really fit the scenes. I did like the BGM tracks that were variations/instrumental versions of the opening and ending themes.\\n\\n\r\nIt was a good attempt &ndash; it had a nice plot but again, it&rsquo;s the fault of bad execution. The story was a bit hurried once again, that the important details/events felt like they were lacking something. I find myself getting surprised now and then, but not because it was shocking. It&rsquo;s more of like &ldquo;Oh, why is she there?&rdquo; or &ldquo;How did that happen again?&rdquo; I just might rewatch it, not because I liked it enough to watch it again, but because to understand it better. Maybe by then, I&rsquo;ll like it more.",
            "date": "2007-08-04T04:52:00+00:00",
            "helpful_count": 59,
            "mal_id": 655,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5763.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jet2r0cks",
                "username": "jet2r0cks"
            },
            "url": "https://myanimelist.net/reviews.php?id=655"
        },
        {
            "content": "Animes are seperated into 3 categories: good, bad and exceptional. Sola belongs in the exceptional range, with the likes of Elfen Lied, eureka 7, Samurai Champloo, School Rumble etc..\r\nThis is definitely the series strongest point. Although it starts of slower then most animes but picks up quickly.The  story is interesting and is very \"deep\", tackling many subjects such as existence, isolation and other. The story also makes effective use of symbolism and foreshadow, such as the sky, the night which the audience may not recognize at first but will realize along the series. Its these attention to details and little things that make thestory exceptional.\\n\\n\r\n It is also worth noting that this series has one of the best endings ever, it is not a generic &quot;happily ever after ending&quot; which has been done to death, not much more can be said without spoiling the story, however the ending does not leave the audience feeling sad or &quot;empty&quot; as it wraps up all its loose ends and reveals everything to the audience.\\n\\n\r\nThe art is great, the action scenes are beautifully choreographed. However, my only gripe is that all the characters had a very triangular chin, which i can't stand.\\n\\n\r\nVoice acting is wonderful, especially the voices of matsuri and Aono. The theme music employs a light piano melody, which isn't spectacular by itself, but when combined with the animation onscreen, it really comes alive.\\n\\n\r\nCharacters in Sola may seem empty and lifeless at first, however once the audience watches the entire series, this will be explained and the audience will realize what a fantasic job the directors have done. Character design is also exceptional, especially Aono and Matsuri\\n\\n\r\nOverall, Sola is something truly beautiful. It is hard to tell you how so without revealing the plot but I am 100% sure anybody who watches this series will be deeply touched by it's wonder story.\\n",
            "date": "2008-02-08T13:54:00+00:00",
            "helpful_count": 33,
            "mal_id": 2391,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/vysis",
                "username": "vysis"
            },
            "url": "https://myanimelist.net/reviews.php?id=2391"
        },
        {
            "content": "If I asked you to name an anime from 2007 off the top of your head, I would be amazed if you came up with Sola out of the 200-odd possible choices, but in a 2007 poll, Sola was voted the best anime of the year. It has since been relegated to a lowly 915th place on this esteemed website's rankings (which is short-hand for forgettable and not worth watching. The more discerning of you may conclude that that is why I have chosen to do my first review on it, and you would be correct in your conclusion, as I know that the chancesof this review being equally forgettable are high). Has there really been that much good anime since then, or was it merely audience-pleasing at the time, and now considered generic and dull? Or is its low ranking unfair and does it deserve to be upheld as a shining example of a much maligned genre? (Well, no; I won't mislead you that much, it's no masterpiece).\\n\r\nWell, I say we tackle the negatives first, because I'm a 'glass-half-empty' type (figuratively- in the literal sense, I'm more a 'drain the glass, refill it, drain, continue ad nauseam [literally]' type) and I love looking for faults in things- firstly, it probably hasn't helped that the characters and plot have been reused countless times after this came out. I don't know if they were clichéd at the time of release, but they sure are now, which limits the enjoyment of both. Calling them 'plagiarised' would be going too far, but a few of them could be described as generic and unoriginal.\\n\r\nSecondly, the plot is really quite slow-paced, despite the occasional fight scene which is obviously (some might say clumsily) trying to attract the viewer's interest and make them feel that something is happening. In fact, you can't help but get the opposite impression- that not much is happening, if anything at all. And when things do start happening, they're weird and, saying this as quietly as possible, similar to Air (which was made in 2005). So far, we've got elements of unoriginality and clichés. Time to go look for some redeeming features...\\n\r\nUnlike many anime, Sola does have genuine merit on the art and sound front, it's extremely well done (for its time; animation techniques have improved noticeably since then). The opening music is catchy enough that it will stick in your memory, and you might find yourself humming it if you are engaged in particularly repetitive manual labour or studying (or that might be just me, which would be awkward). And you can't really hum the chorus as some of the notes are too high, but we'll ignore that. Also, the characters aren't all tediously unoriginal, and there are some very funny moments in the series, despite the genre. I'm still laughing at some of the jokes weeks later, much to the concern of those in physical proximity to me when I start laughing for no apparent reason.\\n\r\nIt is also a short series, at thirteen episodes; whereas too many episodes can kill a series through repetitiveness, I think too few can strangle it just as surely through lack of exposure to any sort of publicity that can keep it in the spotlight, and I reckon that's what happened to Sola. I personally have a preference for short series like this, so if you're like me and don't want to watch the same stuff over and over again, then Sola is a good option.\\n\r\nPour conclure, I haven't told you anything which will swing your opinion one way or another. If you hate romance/fantasy anime or people taking pictures of the sky or assaulting vending machines and household appliances, then Sola is very clearly not for you, as it features all of these quite heavily. If you live in England and would like to see a blue sky for the first time in about eight months, then you might want to watch this, because staring out of the window isn't going to help, and of course, if you do like romance/fantasy/vending machine killing anime, then this is obviously an anime which has been aimed specifically at your particular niche, and you will be in heaven, as someone has finally catered to your needs. If you do find yourself in one of these situations, then I am very happy for you. If you are undecided, watch the first two episodes, and you should have an opinion one way or another. \\n\r\nHappy anime-watching!",
            "date": "2011-12-21T04:55:00+00:00",
            "helpful_count": 17,
            "mal_id": 49687,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Myrmidon83",
                "username": "Myrmidon83"
            },
            "url": "https://myanimelist.net/reviews.php?id=49687"
        },
        {
            "content": "In many ways I feel as if Sola were made for me.\r\nCharacters designed by Naru Nanao, Check\r\nOne of the writers from Kanon the game, Check\r\nCharming slow paced romance, Check\r\nMamiko Noto playing an energetic, rain loving, zettai ryouki wielding character, Check!\r\nPerfectly consistent and plot-hole free?...ok, I guess not\r\nI guess I&rsquo;ll start with my complaints with the series.  Sola started very slowly with an almost slice of life feel.  The premise is quite typical of the romance genre.  You have your typical boy meets interesting girl and both fall in love.  The way the characters interacted was very charming as well as havingan overall happy mood with a sense of sadness/intrigue in the backgrounds.  That intrigue comes from the fantasy elements, in particular, yakas.  This isn&rsquo;t what bothered me, in fact I liked the inclusion of fantasy elements, its just that Sola doesn&rsquo;t know what it wants to do.  First we have the nice calming slice of life aspect, which characterizes the beginning of the series.  However, the 2nd half, was dominated by the fantasy/action elements, which was distinctly different and will probably alienate those initially watched Sola for the slice of life aspect.  While this was a perfectly normal setup the transition wasn&rsquo;t very smooth.  How else can I easily categorize this anime into 2 distinct parts, first half and 2nd half? \\n\\n\r\nAlso, I felt that quite a few characters were neglected.  Mana and Koyori really felt like token friends and didn&rsquo;t contribute much after the 1st half.  This was quite a shame as I much rather liked Mana, unfortunately (or is it fortunately?) she was a perfectly normal person.  Takeshi and Mayuko in the end fell in to a smaller and smaller role, especially when their background was explained.  In addition, there were several aspects that I felt they should have really expanded on/explained.  For example, the sword that Takashi wielded.  Even worst there were a few character inconsistencies especially near the end, something I won&rsquo;t delve into as to avoid spoilers.  In general, I thought the writing was weak.  \\n\\n\r\nStructure-wise, once again had a poor transition between the 1st half and the 2nd half.  Also, I really hated that fact that they explained so much near the end.  While we can infer most of what happened, I felt that it could have been better if they simply told us what happened earlier.  I must admit that it was quite interesting to discover the source of conflict juxtaposed with the falling action during the 2nd to last episode.\\n\\n\r\nOk enough of the bad&hellip;\\n\\n\r\nDuring the first half the way the characters interacted was quite charming.  In particular, I loved the exchanges between Matsuri and Yorito.  Their growing love for each other was nice to watch.  In addition, there are scenes of immense beauty and serenity.  The 2nd half, the story started to hit and when it hit, it really went.  Each episode was fast paced and exciting.  Also, they torture the viewer each week with a cliffhanger, this is something that should be marathoned.  Not only should it be marathoned for the painful cliffhangers, it should be marathoned due to the fact that Sola breaks down under scrutiny, as evident of the above paragraphs.  However, what made me rate this an 8 is that when I was watching I was quite entertained.  I just wished that I had watched it when the series had ended instead of watching weekly.  \\n\\n\r\nAs for the technical aspects, there isn&rsquo;t much to talk about.  The music was very serene and overall quite nice.  VA work in particular was very good, especially Matsuri and Aono.  Although, I wasn&rsquo;t really fond of Yorito&rsquo;s VA, everyone else was pretty good.  Animation-wise was above average and featured some nice fight scenes and beautiful scenery.  While I love Naru Nanao&rsquo;s artwork I felt that Sola didn&rsquo;t do as good a job with converting CG art to anime art.  Where as I though Da Capo and ef ~A Tale of Memories~ did a much better job. \\n\\n\r\nIn the end Sola probably won&rsquo;t stick with me for a very long time, I hate to say it but it was a bit forgettable.  Also, there were a few problems with the structure and the story itself as well as consistency.  However, that won&rsquo;t change the fact that when I was very entertained when watching.  Just remember to marathon the series.\\n",
            "date": "2008-04-19T20:03:00+00:00",
            "helpful_count": 15,
            "mal_id": 4173,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/42620.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/slpless",
                "username": "slpless"
            },
            "url": "https://myanimelist.net/reviews.php?id=4173"
        },
        {
            "content": "Ranged from love triangle , fantasy , mystery and even Existential theme\r\nAt First I did not believe but later on after I watched this anime without bias like someone here\r\nI've found that Sola deserve it's place for the best 2007 anime (Well , I wish Higurashi-Kai  were 2nd)\r\nBefore I seriously watch series anime , I did watch a lot of movie both Hollywood/popular ones and (So-called) Arthouse/Indie ones. I watched many Asian drama/romance some are boring as hell but some has it's value as good spiritualizers. And one of the directors I like best is Shunji Iwai who've made splendid All About Lily Chou-Chou, Picnic , Love Letter (renamed as &quot;When I close my eyes&quot; in US)\\n\\n\r\nWhat do they have to do with Sola? \\n\r\nI'm going to say that Sola could match any Japanese Drama/Romance movies and even better than some. For more as drama/romance movie-watcher I know that the Characterization will not be the same as action (movie or anime) which they should make it obvious to make the story on with action and focus on character personality only to move on and on. But Drama/Romance ones are to make their personality more ambiguious. Still someones might find that &quot;Oh! they lack of personality&quot; just because they're unable to cope with ambiguity.\\n\\n\r\nSola has Love-Triangle theme BUT it's UNCONVENTIONAL ONE! Many may found that it's absurd for some fighting scene. But if you've read a little of japanese culture or literature you'll know that fighting is something more than competition, it's something more meaningful than &quot;Oh! I'm going to kick yer asses hard!&quot; like in some action anime.\\n\\n\r\nAnd , seriously , how can you said that girl characters are sexual pet in this anime? Haven't you watch the scene where Matsuri get close to Yorito first (and...kiss). Don't you see how Aono is manipulative in both apparent and deeper ways. Every! I really mean Every! girls in this anime have power over men characters. Mana , Yorito's close friend , do not fall in love with him like in many other conventional romantic anime (or even some movie) and she  tried so hard to manage things around her to be in appropriate way.\\n\\n\r\nAdding that , I recommended Sola for a woman who have been working for Gender Issue. And she said she like it!\\n\r\nWill you still want to act like a Pseudo-Feminist and ween &quot;Oh! why hero get all girl&quot; like a crybaby? It's you who need to grow up. \\n\\n\r\nAnd for character , the best character for this anime , surprisingly it's Matsuri. She may seem like Everygirl character but that's when you judged her from &quot;Action anime Characterization&quot;. Matsuri is common in personality and yet more real (Well I'm talking about personality so exclude her speciality) . She acts cute as many real girls do (not overact) .She is not too innocent and yet not too teasing , she express innocent appropriately I mean she's not forced to do.\\n\\n\r\nHaven't you ever appreciated scenes when Yorito and Matsuri were together?\\n\r\nThey are very simple romantic scenes that I even recall some in my real life. They're simple yet heart-warming and wonderful.\\n\\n\r\nStill this anime add humanistic value to it. There will be a moment when you dislike some characters and later on you sympathize them. Some characters seem to have conflict , but later on you'll know that how much they want to be closed together like before. This anime portray human's tragedy without being (needlessly) sophisicated.\\n\\n\r\nMusic is one of the most important things that make Sola Atmospheric , apart from it's splendid background. But the flaw is Character Design which make some character less charming.\\n\\n\r\nIn later Episodes of the anime , where all breezy scene in first half ep. has been blown away , the story tend to get more focused about meaning of life and death. It may not portray this issue as more intense or intellectualized one. But still it move our heart. Existential theme is nothing new , but I appreciate how they fit this theme into the story without ruining it's Drama/Romance approach.\\n\\n\r\nDo not let moe-moe appearance fool you.\\n\r\nSola deserve more than average Romantic anime. It has no harem , no fanservice , free from sex appeal , innocent and yet brilliant\\n\r\nFinally , many of Sola scenes  make me feel the similar way I feel for Shunji Iwai's movie. Feeling that is deep and hard to explain.\\n\\n\r\nIf you want shallow existantial story without soul ... go away",
            "date": "2008-11-16T01:02:00+00:00",
            "helpful_count": 14,
            "mal_id": 9529,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/110986.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/erastale",
                "username": "erastale"
            },
            "url": "https://myanimelist.net/reviews.php?id=9529"
        },
        {
            "content": "I must say, I had higher expectations for this series because of my love for the slice of life/romance genre. I was also interested because of the supernatural tag, and although it did make the story more interesting, this series still lacked an important element; pacing. One of the biggest problems with anime adaptions of manga and visual novels are the pacing. Managing the pacing of a series is tough work, especially when you’re working under a 13-26 episode  restriction. Most animes deal with this in a cool and brilliant fashion, and others, not so much. Sadly, in that respect, Sola falls under the“not so much” category.\\n\\n\r\nSola is a story about a high school boy named Yorito, who loves to take pictures of the sky. His older sister Aono has been in the hospital for several months, and is visited frequently by his friend Mana and her sister. Yorito doesn’t devote  much time to seeing Aono in the hospital, and Mana gets annoyed by this. Instead of caring for his sister, he prefers to spend his time taking pictures of the sky (.... I know, right?). On top of that, he has been becoming close to a mysterious girl named Matsuri whom he met by chance one early morning. What he doesn’t know is that Matsuri has her secrets, and there may be more to her than meets the eye. The story is actually pretty good. It’s fairly original, and as I vaguely mentioned before, the addition of supernatural elements makes it much more interesting. \\n\\n\r\nAnother thing that bothered me was how bland the characters were. For example, we have Aono who is your generic “silent girl” role which has become pretty overused these days. I have nothing against Silent types! They rock my socks. But, Aono in this case did nothing for me. Mana, plays the typical “childhood friend” ( Even though they had just met recently ) so there’s nothing very interesting about her either. Overall, Matsuri was the most interesting as well as Tsujido Takeshi ( A side character who you can think ofas the bad guy or the good guy, it’s up to you. ) \\n\\n\r\nThe visuals are pretty standard, and aren’t very impressive, to say the least. They aren’t terrible, but I think that the viewer’s enjoyment of the series would have been greatly amplified if this series had better animation. The music however, is very good in some parts, and is one of the aspects I enjoyed most about the show. \\n\\n\r\nUltimately, Sola is a good anime to watch if you have a great deal of patience. It’s sad that such a good story is essentially ruined by poor pacing. Perhaps, reading the manga would satisfy my dissatisfaction of this series.  \\n",
            "date": "2011-08-16T15:26:00+00:00",
            "helpful_count": 8,
            "mal_id": 41611,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/502303.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MonkOnLSD",
                "username": "MonkOnLSD"
            },
            "url": "https://myanimelist.net/reviews.php?id=41611"
        },
        {
            "content": "A guy who worships skies just met a very weird girl that can fly, fighting against a man holding a sword, in a creepy church. That's normal right? The man sent her flying again and she was thrown in a cemetery. You see, it's the middle of the night, and what does the guy think is the normal thing to do? Yeah, you guessed it: looking for the weird STRANGER girl and TAKING HER HOME. Pfft, that's very normal! He then proceeds to invite her to stay at his place even after hearing that she is a curse and she's not human. Wow, so logical!\\n\r\nYou may ask how is that possible without asking his parents. Don't mind me, I forgot to tell you that THERE ARE LITERALLY NO ADULTS IN THIS ANIME except that one sword man. Yeah, very relatable!\\n\r\nNow, you got the illusion that it's going to be a very dark anime about the weird cursed girl who can't see the light and how she struggles with life... I can't blame you, that's what I thought too. But nope :) The anime, after the 1st two episodes, never explored that ever again. It turned into a boring, tries-so-hard to-make-things-dramatic, anime.\\n\r\nI really tried to enjoy this anime. But I'm sorry, my brain cells won't forgive me if I went on.",
            "date": "2017-06-20T10:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 250456,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675181.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/IAintAllBad",
                "username": "IAintAllBad"
            },
            "url": "https://myanimelist.net/reviews.php?id=250456"
        },
        {
            "content": "I've finished watching this anime a few days ago and actually like it. I thought it was going to be an all boring love story from what I saw in the first episode (a girlfriend told me to watch it, so what could I expect?)  but the anime get's better as it reaches it's end and finishes both sad and nicely. So is a very good anime to watch in your free time but don't expect it to be even as half good as, for example Kanon or Clannad.\r\nLet's start with the aspects of this anime. The story is really a common one atthe begining: \"a girl stays in the house of a boy for any reason at all\". Other thing is that this boy (Yorito) has kind of a obssesion with the sky and everytime he can he take's pictures of the \"different skies\". Don't worry you'll learn the meaning of this later on in the story. But putting aside the common events like this there is a great deal of fighting and use of supernatural powers (sort of vampire like) and the plot twists that makes a story really interesting. The thing is that, overall, the story is shown in a really annoying way that really ruins it baddly. The reason are this  flashbacks to the distant past that occur in the begining of one or two episodes and on the last one. I think this flashbacks do a really bad job trying to give some spectation to the viewer. Well at least in my case I found those flashbacks really irritating and out of context. They definitely spoil what could have been a fantastic tale.\\n\\n\r\nThe art and design in this anime is really well done, it reflects what the anime is aiming for depending of the event: sadness, darkness, etc. The looks on every building: Yorito's house, the hospital, the doll shop, the church, the school (lol take a look at it's endless roof xD!) and specially the different type of skies shown in the anime are very nice to watch. The character design is one of a kind in every character specially Matsuri and Aono look really great and opposite one to each other. So almost from the begining you know that there is going to be serious problems between these two girls.\\n\\n\r\n Now the sound is the best this anime has to offer: it's rich and the BGM's are adequate for each ocassion. The opening is really good (adding it to my list), the battle songs are amazing (a techno-electro mix) and the sad themes are really heart breaking. The sound really does make this anime feel awesome and different from any other due the quality of each and every track.\\n\\n\r\nTalking about the characters these are really awesome as well, specially Matsuri. She just looks gorgeous and her personality is just so different of what you expect when first glancing at her, very funny indeed. She is so different in just too many ways: from her war cry when trying to get her favourite juice (Sennoooo!!!) to her sort of a \"french\" look,  she really makes a difference with any other character I've seen. All the other characters are very well designed but it feels like Matsuri's personality and looks totally opacate the other characters, a pity because there are other interesting characters in this anime that I would loved to see having a more important role.\\n\\n\r\nI spended less than two days watching this anime. I know I watched it in a rush but overall I really find it very fun and worthwhile watching but this is not a \"must watch\" anime so if you are aiming for something really GOOD and sad then go watch Kanon, Clannad or even Air (that if you haven't yet). On the contrary if you'd like to watch a anime that has drama-love but action, supernatural ocurrences and great battles as well then this is the one for you. In the end this anime is different from the lot but not as good to be called a unique or innovating anime. This ends sad as well so if you must watch it grab you pack of tissues or just do as I did: right after you finish it watch the the DVD Special 1, only the first one (it's about a waterpark), you will find it really funny. But don't watch the second DVD Special (it shows some bonus scenes about what happens before Yorito meets Matsuri and it ends precisely when that meeting takes place) right away because you will end up as sad as you were when finishing the anime...\\n\\n\\n",
            "date": "2009-02-07T18:48:00+00:00",
            "helpful_count": 7,
            "mal_id": 12220,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/124642.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/vault2049",
                "username": "vault2049"
            },
            "url": "https://myanimelist.net/reviews.php?id=12220"
        },
        {
            "content": "If you are looking for just something where you need to chill, you've come to the right place. \r\nSola just has this calming feeling. It moves rather slowly for just 13 episodes. I was expecting it to fly by but no, it progressed slowly allowing us to get to know the characters very well before the grand finale.\r\nThe art is amazing, I loved the way Aono looked. It makes sense how the characters would react, and the flashbacks want to make you know more. \r\nIf this was any longer it would be boring. Just saying. \r\nI give this a 10 because of...\r\n-The art\r\n-The length\r\n-The Characterization\r\nIt'struly a great anime!!!",
            "date": "2015-02-19T05:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 180772,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4381871.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/starsonia913",
                "username": "starsonia913"
            },
            "url": "https://myanimelist.net/reviews.php?id=180772"
        },
        {
            "content": "Sola is an anime that will have you wondering until the end.\r\nWatching Sola is retty relaxing for the most part but don't get fooled by the first 20 minutes, this is not a slice of life but rather a supernatural with the pacing of a romance. By pacing of a romance I mean it's kinda slow but in the end it all comes together.. or does it? This anime will sometimes tell the plot through flashbacks and have it explained later through dialogue between certain characters.\r\nSola has some confusing story bits scattered throughout all the episode which I can't mention a single bit of thestory without spoilers other than the main character likes to take pictures of the sky and visits his sister in the hospital frequently. \\n\\n\r\nThere isn't a whole lot of characters in Sola, but because of this, the characters are easier to remember. The side characters take larger roles than expected. The side characters actually help the story move forward without even knowing what's going on.\\n\\n\r\nThere is action in Sola but not enough to fit under the \"action\" genre.\\n\\n\r\nThe soundtrack is really relaxing. The art is good and it has an older look but the environment looks really nice.\\n\\n\r\nSola has 13 episodes and 2 specials. The 2 specials don't really add to the ending but more like extra episodes. The 1st special is somewhere in the middle of the story and the 2nd special is right before the first episode.\\n\\n\r\nI don't have much else to say other than \"I like it.\"",
            "date": "2015-01-26T09:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 179006,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4228909.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheCoolestCat",
                "username": "TheCoolestCat"
            },
            "url": "https://myanimelist.net/reviews.php?id=179006"
        },
        {
            "content": "As with any new review of mine, there is generally a TL;DR part at the end with a basic summary of the positives and negatives.\r\nAh… Sola, what a wonderful show.  I had quite a bit of fun with this one, it kept me hooked enough to finish in two days. It would have been one if I didn’t exercise self-restraint, but I did, so it ended up being two days. One thing that really surprised me about this show was how mature it was handled, especially in the Romance aspect. It was well done, and a very believable romance. The show itself knows whatit’s trying to be, and together that allows a truly great story to be told.\\n\r\nThere is just one problem. It’s not a problem for me, but it will be for some others. Sola is not a fast paced show. There are a few action scenes, and they are quite well done too, but it does have a rather slow/relaxed plot pace, mainly at the beginning. It’s a show that brings out its story not through large action scenes and complicated plots twists, but through the actions of the characters, their dialogues and the way they handle the situation.\\n\\n\r\n*!!!!!* \\n\r\nIf you cannot sit through at least two episodes of no action, and only talking and character development, this is not your cup of tea, and you will most certainly not like this show, or at least it will dampen your overall thoughts of it. I will repeat again when I say, it is not a fast paced show. \\n\r\n*!!!!!*\\n\\n\r\nStory - 9/10\\n\\n\r\nThe story of Sola revolves around 3 main characters (technically it has seven prominent characters, but in terms of development and plot, they are not as important, and they are not main charecters), Matsuri Shihou, Yorito Morimiya and his sister, Aono Morimiyam, and the various mysterious circumstances surrounding the three. Yorito is in school, Aono, his sister in the hospitalized and Matsuri, they mysterious girl he meets at a vending machine while taking pictures of the sky. But not all is as it seems. Why does Matsuri disappear and reappear, having a great yearning to see the sky? Why is she only outside when it’s raining and dull? Why is Yorito’s sister hospitalized, why does she always have the curtains drawn closed in her hospital room? What about Yorito, he seems ordinary enough, but is there some hidden mystery to him?\\n\\n\r\nThese questions are ones that will rattle around your head when the show progresses and goes on, as it slowly goes on to explain them all. Looks can be deceiving, memories can be misleading and not everything is as it seems. Another thing I really pride the story on is the fact that even though the plot is not that big, in 13 episodes, the show felt complete. It ended, and it didn’t leave any strings attached, it didn’t leave some mystery unsolved, some plot element in-complete, and THAT is something that I see few shows doing. It was well paced, well written, and most of all, it was executed very nicely.\\n\\n\r\nArt & Sound – 8/10\\n\\n\r\nThe art of Sola certainly was a pleasure to see, especially the really beautiful, but simple picture of the sky that Yorito took. I really liked the background, and for a show that takes place in a fairly dim environment, the colors used really brought out the scenes. It didn’t leave out anything in the action scenes either. For a show that is not about large-scale, action packed battles, the animation for them were done really well. Props to the studio. Since it’s a Drama & Romance show, they could have easily not animated the scenes as long or as good, but they took the effort to do so, and I appreciate that.\\n\\n\r\nThe sound was fairly well done as well, a bit above average, the opening and ending were nice enough, but nothing to write home about. The BGM (background music) was decent, and it fit the scene when it was played. There are one or two stand out tracks I really enjoyed, but overall, it was a decent set of tracks.\\n\\n\r\nCharacters – 9/10\\n\\n\r\nAnother thing I loved about Sola was the characters. While Yorito might seem a bit plain, he is still an interesting character. Not as interesting as Aono and Matsuri, but still interesting. He’s simply a high school student who loves taking pictures of the sky, and can see a world of things in a simple picture of the sky, whereas others simply see clouds…… Either he’s got an artistic mind, or he’s hallucinating… Just joking, I actually liked that artistic part of him. It’s not a usual hobby, but it is a perfectly plausible one. The romantic & character development of all the characters are very well done, but I especially liked the development he went through, especially after a certain plot element was revealed. \\n\\n\r\nMasturi and Aono are both two very interesting characters. They both know each other, but Yoirito doesn’t know Matsuri at the beginning. This gives them both an air of mystery surrounding them. I don’t want to give too much out as that will spoil the plot a bit, but I never felt that at any time their actions were unwarranted. They are very believed and understandable characters. \\n\\n\r\nThe other 4 are sadly not explored that in detail. It's a shame as they were a little bit interesting. It is for this reason I will just lightly mention their names. Mana Ishizuki, Koyori Ishizuki, Mayuko Kamikawa and Takeshi Tsujidou. I felt they needed more development, but it was shelved so we could focus more on the main. That's both good and bad, but I was annoyed how we didn't get good character development for them. This is one of the negatives, and almost brought the character score down to 8, but I decided to give it a 9. We do get a bit of back-story on Mayuko and Takeshi, but still, much more could have been done.\\n\\n\r\nOverall though, the interactions were handled really well between the characters, and the drama was nice, without ever giving you the feeling it was trying to be melodramatic. It did not try to force you to feel emotions using melodrama (You know, lots of teary scenes, screaming fits, deliberately butchering characters to make you feel sad) like several shows try to do (These are not necessarily Drama shows, but that’s not the point.) The characters handled themselves maturely, the romance was done well, and the characters felt like individuals, their own people, and not stereotypes or cookie cutter figures.\\n\r\n--------------------------------\\n\r\nTL;DR Section:\\n\\n\r\nStory – 9/10\\n\r\nArt – 8/10\\n\r\nSound – 8/10\\n\r\nCharacters – 9/10\\n\r\nEnjoyment – 10/10\\n\r\nOverall (Average of Above) - 8.8/10 \\n\\n\r\nPros and Cons:\\n\r\n+Great Character Development (For the main three characters)\\n\r\n+Interesting/Well Rounded & Believable Characters\\n\r\n+Good Romance Subplot\\n\r\n+Enjoyable, but simple animation.\\n\r\n+Enjoyable Plot\\n\\n\r\n-A bit show paced. Not a negative for me, but not everyone's cup of tea.\\n\r\n-Not that much action - Same as above, No problems for me, but that's a personal opinion.\\n\r\n-Lackluster Character Development for side Characters\\n\r\n-Forgettable Opening and Ending (I'm really nitpicking at this point).\\n\\n\r\nOverall, a great show, BUT not for everyone. If you cannot stand a slow pace, especially at the beginning, and need action every episode or two to keep you going, you will mostly likely not like this show. If your not a fan of Drama, Romance or Supernatural, this show will most likely not interest you. Regardless of that, give it a go. You might even end up liking it. :)\\n",
            "date": "2015-04-10T05:16:00+00:00",
            "helpful_count": 6,
            "mal_id": 185289,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3085921.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Deoran_Old_Acc",
                "username": "Deoran_Old_Acc"
            },
            "url": "https://myanimelist.net/reviews.php?id=185289"
        },
        {
            "content": "A quick review to give people a vague idea of how this anime is and not just throw in my own unidentified views like most people-starts off exciting, slows down, reaches climax, comes to an epic end. \r\nMy Personal Views: (hahahaha), you have to have a little desire in a love or passion for or of something more pure and honest to undestand the first half, the later half you need some experience in letting go and contentment (I THINK) to be able to appreciate the ending. Although the ending did PISS ME OFF!!!!!!!!! that' why I gave it a nine =\\\r\nTWO THUMBS UP!!!",
            "date": "2007-10-28T19:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 1148,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/15384.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/WorldWide",
                "username": "WorldWide"
            },
            "url": "https://myanimelist.net/reviews.php?id=1148"
        },
        {
            "content": "I tried to power through this anime, but I just got tired of wasting my time.\r\nWith the problems presented, it could have been really good, but ended up just being bland a bit confusing.\r\nMagical characters are presented, but they're used more to cause angst and drama than anything else.\r\nThe chemistry between the main character and his love interests is lacking and uninteresting. There doesn't seem to be any at all.\r\nThe art and sound are fine, but nothing new or spectacular.\r\nThe only thing that really interested me was the relationship between Takeshi and Mayuko, and they are side characters.\r\nThis anime wasn't really worth my time, inmy opinion.",
            "date": "2011-12-22T15:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 49839,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/387972.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/livingdeadkat",
                "username": "livingdeadkat"
            },
            "url": "https://myanimelist.net/reviews.php?id=49839"
        },
        {
            "content": "A sad, short little anime about little precious things.\r\nYorito loves to photograph clouds. He seemingly lives a normal, if not dazed life. He vistis his sister, Aono in the hospital, who is suffering from an affliction that is never explained. He's friends with a sweet girl, Mana and her sister Koyori.\r\nOne morning, while waiting to see the sunrise, he meets a strangely familiar vampire girl, Matsuri.\r\nThis is an unusual vampire anime, for a variety of reasons. One being that it doesn't really focus on the vampirism as much as the immortality of the chracters and the pain it can cause them, and the inevitable lossof loved ones.\\n\\n\r\nMatsuri is such a person. Both haunted and hunted for her vampire blood. This is a whimsical anime that has darker undertones that mostly deal with what happens when you try to make yourself happy at the cost of others.\\n\\n\r\nWithout giving too much away, none of the characters are what they seem, and as they begin to realize this, they have to make heartbreaking decisions--which ultimately leads to Yorito wanting to show Matsuri the sunrise.\\n\\n\r\nAll of the characters are superficially silly but genuine. Each has their own personality and are generally likeable for they all have a motivation for their actions, even if they seem cruel on the outside--with the exception of Matsuri, whose kindness and sweetness actually hides a selfish act she's hoping she can get redemption for. The music is light and airy, and fitting, and there's good use of skies and bright colors to emphasize the fleeting and precious mortal world.\\n\\n\r\nThere are two \"DVD\" specials that accompany it, one being a fanservice filler episode and the other being a prequel to the events of the story--and the meeting of the two main characters.\\n\\n\r\nThis is a sad little romance that tries its best to smile through the pain, and one of those sweet anime that can't do much wrong.",
            "date": "2009-04-30T21:32:00+00:00",
            "helpful_count": 5,
            "mal_id": 14661,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/171075.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tentacle_raep",
                "username": "tentacle_raep"
            },
            "url": "https://myanimelist.net/reviews.php?id=14661"
        },
        {
            "content": "One of the first anime's I ever watched so maybe I have a small soft spot for it. I first watched it when I was 14 and rediscovered it over 5 years later. I must say I still love the anime. The story, as many have mentioned is slower then some, and the anime may appear a little odd - defiantly not what you would expect when reading the plot. However, it is underrated and not many know about it. The story is refreshing and easy to follow though also dives into deeper meanings. The characters may not have the best development but it isthe plot that sucked me in, twists and turns and a ending that you won't really expect. The anime is a hidden work of art that any anime fan needs to watch at least once.",
            "date": "2016-02-08T00:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 210415,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Amber_Jacobson",
                "username": "Amber_Jacobson"
            },
            "url": "https://myanimelist.net/reviews.php?id=210415"
        },
        {
            "content": "I haven't written a review of an anime before, but this show both moved me, and made me feel things I wasn't expecting to feel. Maybe I'm just a sucker for romance, but right from the first episode, I felt Sola was something wonderful and different.\r\nThe story is a really sweet and beautiful one with the blossoming romance of two of the main characters. The beginning is slow. It helped to build the characters as who they are in the present and helps the watcher (you) get attached to them. This slow start may have the unfortunate side-effect of turning away those who go intoit more casually, as the story doesn't pick up until about episode 5 and even then, slowly. The second half, however, has action and drama and backstory... and confusion. Everything makes sense on the surface, but if you look deeper, some things are just never explained. Sola has very well written characters, but stumbles a little in world building. The focal character changes in the last 2 or 3 episodes to add to a mysterious tone and for story reasons, but I personally was not fond of that\\n\\n\r\nThe art in Sola is wonderful. Which is to be expected when the characters and story find the beauty of the sky so important. I wasn't a fan of the actual photography that is prevalent in the ending credits, but I understand it's use. The action scenes are gorgeous and the character kept moving through space during it. In some anime, as soon as the battle is in the air, they just seem to float there when they fight. Sola doesn't have that, and that was very nice to see. The character designs are very good, especially on Matsuri. You can tell that a lot of effort was put into designing her, and I'm not one who normally finds anime girls beautiful, but I found her extremely so. Yorito has an emphasis on his normalcy, even in art. He's a good character, and the fact that he's so normal looking is of sharp contrast to the two female leads. Aoko is very very similar in both design and personality to Angel from Angel Beats or Rei from Neon Genesis Evangeleon. So that's kinda meh.\\n\\n\r\nThe soundtrack is absolutely beautiful. It wasn't perfect or outstanding, but it was really nice. Special emphasis on the opening theme for both capturing the allure the show, and to somehow remind me of the peacefulness and turmoil the sky always has.\\n\\n\r\nThe three main characters are... good. Again, Matsuri seems to have been spent the most time on. Her character is complicated without being confusing, and the fact that she can still be a source of humour and fun, made her a very enjoyable character to have on screen. I really liked Yorito's character, as he was normal without being bland, and he's not just our way into a more fantastic world, as he can still hold his own. His motivations are simple yet, anyone who's been in love can understand his occasionally rash behaviour. Aono's personality, however, was a draw on the show's emotional energy at some of the more intense scene's but it wasn't overpowering. It was especially refreshing the few times she breaks her emotional distance.\\n\\n\r\nI loved the show. It made me laugh, it made me gasp in fear, it made me cry. It's something that's really hard to put down once the initial establishing character lull was over. There was one really odd thing with my enjoyment, though. While it was really hard to put down, it was also extremely hard to pick back up once I had. I marathoned it in three sittings... over the course of more than a month. I decided that I was going to write this review as soon as I had finished it, as Sola has the interesting trait that I kept forgetting how good it was and how much I loved it. It got to the point in which I'd skip over it for weeks at a time and have to almost force myself to pick it back up. But I have no idea why! I have no idea why it was so easy to forget the quality of this show, but maybe someone else had the same experience and can tell me why.\\n\\n\r\nOverall, really, really good. It has its flaws, and even though I may have to remind myself repeatedly that I loved it, I still did.",
            "date": "2016-02-10T23:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 210642,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5050282.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ThisISDead",
                "username": "ThisISDead"
            },
            "url": "https://myanimelist.net/reviews.php?id=210642"
        },
        {
            "content": "sola is one of those little gems that comes once every few years, and I'd recommend it to absolutely everyone... Why? Because IMHO I don't think that there's a person who wouldn't enjoy it.\r\nThe story is quite something, the mystery starts at the first episode but every episode what you originally thought how the story was going to develop, turns out to be even more mysterious, suspense keeps increasing every episode and to me that is something very important in a series, that grasps you in a way that you desperately want to know what is going on and that the main story is notonly great but just plain awesome!\\n\\n\r\nIn regards to the animation, I honestly believe this is studio NOMAD's best series yet, I've seen some of their other works and by far, sola is the best one when it comes to animation, background detail, and character animation consistency.\\n\\n\r\nWhen it comes to the music, Ceui's Bikan no Fuukei (first episode opening theme and insert song in some of the episodes) is my favorite song of the series. The OP/ED themes are good, but Bikan no Fuukei is soooo related to the story and the characters that if it were the _only_ song featured in this anime, it'd be OK :P.\\n\\n\r\nOverall, if you like fantasy, romance, sibling-love (not the bro-con/sis-con one, you have a lot of choices for that one) and drama, this is a must watch! ;)",
            "date": "2012-09-09T20:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 71999,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21318.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shido_Tatsuhiko",
                "username": "Shido_Tatsuhiko"
            },
            "url": "https://myanimelist.net/reviews.php?id=71999"
        }
    ],
    [
        {
            "content": "I just recently finished sola and I wanted to start off by saying that I am very strange in what interests me in an anime and instantly, from the first episode, I knew that I would love sola. The song in the introduction of the first episode caught at my soul and moved my heart and I also have a personal attachment to taking pictures of the sky and my digital camera, which is what the main character in this anime is like, of course he doesn't quite understand why he is obsessed with the sky, but there is a deep and wonderful meaning behindit.\\n\\n\r\nThe anime, as I said, for me, had an awesome introduction, the music, the setting, the mystery of the night, the going to take pictures of the sunset and all that was beautiful, but I also loved how normal and cute the main girl character came off as when the main character first met her. She was not remarkable or amazing (although beautiful, one of the most beautiful I have seen), but she was very cute and charming and he instantly adored her as so many people would have.\\n\\n\r\nThe anime does go a bit slow from there and moves from the main characters a bit, going into parts of their stories, but I really enjoyed the weird flashbacks they threw in there because they were extremely interesting and made you really want to know what had happened in the past, so when the anime did slow down a lot, it could keep you going for a bit.\\n\\n\r\nThe anime is very serious at some parts and also very mature and what some people would consider slow in action, was just the blossoming relationship between the main characters, which, to someone watching this kind of romantic and supernatural anime would expect. There are very cute scenes between the main character and the girl, Matsuri and as the title says, it is very focused at the sky and Matsuri's power/ailment/curse is quite awesome in my opinion, I just wished she had used it more.\\n\\n\r\nI really enjoyed the turn it took with the main character's sister, Aono and her history and just her in general. She was insane, but that's what I like in anime girls and she was fiercely loyal and loving, which is awesome. \\n\\n\r\nThe art was really wonderful, in my opinion! I adored how they were drawn and Matsuri, especially, is one of the most beautiful anime girls I have ever seen.  I enjoyed how Aono and Matsuri were both very unique and splendid looking, but the main character and his normal friends were generally normal looking, since they were somewhat normal people. The main character's best friend, Mana, was also very enjoyable, unlike her part in many other animes when she is just in love with the guy and depressed all the time, but a tomboy, this time she had personality and caring and she was smart and curious! The settings were beautiful and the time that the main character and Matsuri did spend together was basically magical, in my opinion and the way it was animated gave off this unrivaled feeling of wonder and love.\\n\\n\r\nI always enjoy when in anime, people have normal responses to things and can act all sneaky and weird about things - example, the friend, Mana, thinks someone is at the main character's house, so she gets him out of it and then goes snooping! Normalcy!\\n\\n\r\nThe turn that the anime takes is very unique and the true story behind who you think is bad and good and everything else is also very interesting. The fights were fun to watch, even though not enough of them, in my opinion and I overall really loved this anime.\\n\\n",
            "date": "2007-11-07T10:24:00+00:00",
            "helpful_count": 175,
            "mal_id": 1235,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9646.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yandere",
                "username": "Yandere"
            },
            "url": "https://myanimelist.net/reviews.php?id=1235"
        },
        {
            "content": "Let&rsquo;s check off the things that annoy me, shall we?\r\n~  A world where kids conveniently don&rsquo;t have parents.  Because that would mean the writers would actually have to be skilful enough to write stories including them.  The only featured adult in the whole story is obviously a hindrance to everyone, except midway when he suddenly becomes every male pervert's role model.\r\n~  Girls that fawn over one witless guy who doesn&rsquo;t deserve any of them.  They fight to the death over him, but why should we care?  Why should we be invested in any of this if we cant understandwhy anyone would want him in the first place?  He is completely and utterly undeserving of it all, and it renders everyone's actions perplexing.  Well, not so much perplexing as it is tiresome to watch this anime go through every clich&eacute; in the book to appease undemanding 'fans' of the genre.\\n\\n\r\n~  Main protagonist boy who is an empty cipher throughout the entire story.  A complete plank of wood with no personality and no discerning features other than his hobby of taking photos of clouds.  This is not 'characterization', its an excuse to make him look interesting.  He is in actual fact no different than a million other one-note protagonists of this genre.  In fact, the more I think about it, the more it makes sense that the main characters of these stories are usually ciphers, rather than fully fleshed out and interesting people.  Because it makes it easier for male viewers to project themselves onto the character.  How sad.\\n\\n\r\n~  Girl character who is treated like a wayward sexual pet by guy.  At least Elfen Lied had the decency to make the female character a bloodthirsty psychopath.\\n\\n\r\n~  Boring characters.  Every single one of them.  Except for maybe the little girl in the green dress, she had a nice attitude.\\n\\n\r\nThis anime panders to all the moe-loving adult perverts and too-young-to-have-developed-decent-taste youth.  Sola's great animation and brief flashes of what could have been an interesting tale are let down by all of the above.  There was potential here; to explore people that can never live in the sun, the affects of immortality in a child's body, but the producers were more interested in filling a quota than in story and character.  Some of these characters are supposed to be more than a hundred years old yet they still act like brats.  Thats because logic is thrown out of the window in sola, because the characters are designed for viewers tastes.\\n\\n\r\nJapan's most popular anime of 2007?  Depressing.\\n\\n\r\nDon&rsquo;t downgrade this review because it&rsquo;s negative.  Downgrade it because you've yet to grow out of this genre and realise that this anime is the equivalent of a McDonalds happy meal: planned by a committee, packaged prettily but ultimately tacky, cynically driven and bad for you.",
            "date": "2008-01-26T04:35:00+00:00",
            "helpful_count": 131,
            "mal_id": 2165,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/29975.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Beatnik",
                "username": "Beatnik"
            },
            "url": "https://myanimelist.net/reviews.php?id=2165"
        },
        {
            "content": "As the title implies, this Romance, Drama is heavily themed on the sky (sola), which is definitely different than the usual anime but that may not always be a good thing. It&rsquo;s quite interesting how something we take for granted like the sky can be such a treasure to other&rsquo;s but it&rsquo;s irritating that the bulk of the story has something to do about the sky.\r\nThe other main focus of the show is on the blossoming romantic relationship between the two main characters; Yorito is an average guy who&rsquo;s obsessed with taking photos of the sky and Matsuri, she&rsquo;s the &ldquo;special girl&rdquo; usually found inthese types of anime. This type of set-up has been done many times before and compared to other masterpieces, Sola just seems average. With such a dull premise, a lack of action and unanswered questions it&rsquo;s easy to lose interest in this show. At least as the story begins to develop all of these issues become a thing of the past and the show ends up being good to watch.\\n\\n\r\nThis anime ends up doing a not-so-good job in the character department, with the same 7 characters throughout the series. The characters are really average and have the sort of personalities that have been seen many times by an anime fan. On the other hand the show does manage to surprise us with some interesting developments on Yorito (male protagonist). The only other interesting characters in this anime are Matsuri and Yorito&rsquo;s so called sister Aono because of the mystery that shrouds them and they&rsquo;re the only ones that are developed well, throughout the series.\\n\\n\r\nThe visual quality of this animation is definitely above average with this anime embracing various new animation techniques and styles. Just like the title implies, a lot of detail was put into the skies, clouds and lighting effects. Even the water looks superb, yet it&rsquo;s a shame that some of this effort wasn&rsquo;t put into adding more dynamic characters to the screen.\\n\\n\r\nThe music was decent with a unique blend of piano, string and harp melodies as background music. It is certainly suited to the calm and dramatic nature of this anime however it did little to add excitement, on the rare occasions of an action scene.\\n\\n\r\nOverall this anime closely resembles &ldquo;Lunar Legend Tsukihime&rdquo;, in the sense that both shows revolve around two mysterious girls romantically involved with the male protagonist, who&rsquo;s unsure of himself. Both shows have the same sort of pace as they start of slow but then finish quick. As a Romance Drama Sola does a decent job in both departments but it was only halfway into the short series that it really kicks in, with shocking character developments and intense fights. The show ended well with the final dramatic confrontation and happy-sad ending, so I only recommend this anime to fans of romance and drama but not for the action lover.\\n\r\n^_^",
            "date": "2007-10-23T08:46:00+00:00",
            "helpful_count": 94,
            "mal_id": 1091,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=1091"
        },
        {
            "content": "It was kind of boring at first, because after the first episode, nothing interesting really happened. It did get better during the middle, then better turned weird, but it wasn&rsquo;t that bad. Let&rsquo;s just say it has something to do with paper. A lot of paper.\r\nCharacters are really weird. First you have Yorito &ndash; someone completely obsessed with the sky. I don&rsquo;t even know why he&rsquo;s that obsessed. Then there&rsquo;s Matsuri, who surprisingly, is kinda ecchi in her own way. Aono &ndash; you either love or hate her. She&rsquo;s naturally funny, but towards the end, you just might hate her. Mayuko, the gothic Lolita, iskinda tsundere, and Takeshi, the guy who&rsquo;s always with her, I just don&rsquo;t get him at all. His personality changes all of a sudden during the second half. Mana&rsquo;s actually pretty insignificant.\\n\\n\r\nI&rsquo;m a bit surprised that Mai Nakahara and Ai Shimizu are both in Sola, and once again, they&rsquo;re playing close friends. Mai Nakahara plays Aono Morimiya, while Ai Shimizu plays Koyori Ishizuki. Mai Nakahara does not sound like her usual, cheerful self though. This is probably my least favorite out of all the characters she played, since Aono lacked emotion in her words. In fact, it was the same for almost all the characters. I just didn&rsquo;t feel their presence.\\n\\n\r\nAnimation is pretty good. The backgrounds are really nicely drawn, and I like the incorporation of real images with the animation. My only problem is the character design. The characters look really skinny &ndash; I know this is common in most anime, but their faces are really skinny. The characters tend to look old because of that, especially Yorito.\\n\\n\r\nThe opening and ending themes were really nice. I like how mellow and soft the songs were, especially the ending theme, titled appropriately as &ldquo;mellow melody&rdquo;. The opening theme, &ldquo;Colorless Wind&rdquo;  wasn&rsquo;t bad either. In fact, I think it&rsquo;s nicely done. I love the strings in the beginning, and how it really fits the story of Sola.I do have a problem with the BGM, because during the beginning of the series, the BGM used didn't really fit the scenes. I did like the BGM tracks that were variations/instrumental versions of the opening and ending themes.\\n\\n\r\nIt was a good attempt &ndash; it had a nice plot but again, it&rsquo;s the fault of bad execution. The story was a bit hurried once again, that the important details/events felt like they were lacking something. I find myself getting surprised now and then, but not because it was shocking. It&rsquo;s more of like &ldquo;Oh, why is she there?&rdquo; or &ldquo;How did that happen again?&rdquo; I just might rewatch it, not because I liked it enough to watch it again, but because to understand it better. Maybe by then, I&rsquo;ll like it more.",
            "date": "2007-08-04T04:52:00+00:00",
            "helpful_count": 59,
            "mal_id": 655,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5763.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jet2r0cks",
                "username": "jet2r0cks"
            },
            "url": "https://myanimelist.net/reviews.php?id=655"
        },
        {
            "content": "Animes are seperated into 3 categories: good, bad and exceptional. Sola belongs in the exceptional range, with the likes of Elfen Lied, eureka 7, Samurai Champloo, School Rumble etc..\r\nThis is definitely the series strongest point. Although it starts of slower then most animes but picks up quickly.The  story is interesting and is very \"deep\", tackling many subjects such as existence, isolation and other. The story also makes effective use of symbolism and foreshadow, such as the sky, the night which the audience may not recognize at first but will realize along the series. Its these attention to details and little things that make thestory exceptional.\\n\\n\r\n It is also worth noting that this series has one of the best endings ever, it is not a generic &quot;happily ever after ending&quot; which has been done to death, not much more can be said without spoiling the story, however the ending does not leave the audience feeling sad or &quot;empty&quot; as it wraps up all its loose ends and reveals everything to the audience.\\n\\n\r\nThe art is great, the action scenes are beautifully choreographed. However, my only gripe is that all the characters had a very triangular chin, which i can't stand.\\n\\n\r\nVoice acting is wonderful, especially the voices of matsuri and Aono. The theme music employs a light piano melody, which isn't spectacular by itself, but when combined with the animation onscreen, it really comes alive.\\n\\n\r\nCharacters in Sola may seem empty and lifeless at first, however once the audience watches the entire series, this will be explained and the audience will realize what a fantasic job the directors have done. Character design is also exceptional, especially Aono and Matsuri\\n\\n\r\nOverall, Sola is something truly beautiful. It is hard to tell you how so without revealing the plot but I am 100% sure anybody who watches this series will be deeply touched by it's wonder story.\\n",
            "date": "2008-02-08T13:54:00+00:00",
            "helpful_count": 33,
            "mal_id": 2391,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/vysis",
                "username": "vysis"
            },
            "url": "https://myanimelist.net/reviews.php?id=2391"
        },
        {
            "content": "If I asked you to name an anime from 2007 off the top of your head, I would be amazed if you came up with Sola out of the 200-odd possible choices, but in a 2007 poll, Sola was voted the best anime of the year. It has since been relegated to a lowly 915th place on this esteemed website's rankings (which is short-hand for forgettable and not worth watching. The more discerning of you may conclude that that is why I have chosen to do my first review on it, and you would be correct in your conclusion, as I know that the chancesof this review being equally forgettable are high). Has there really been that much good anime since then, or was it merely audience-pleasing at the time, and now considered generic and dull? Or is its low ranking unfair and does it deserve to be upheld as a shining example of a much maligned genre? (Well, no; I won't mislead you that much, it's no masterpiece).\\n\r\nWell, I say we tackle the negatives first, because I'm a 'glass-half-empty' type (figuratively- in the literal sense, I'm more a 'drain the glass, refill it, drain, continue ad nauseam [literally]' type) and I love looking for faults in things- firstly, it probably hasn't helped that the characters and plot have been reused countless times after this came out. I don't know if they were clichéd at the time of release, but they sure are now, which limits the enjoyment of both. Calling them 'plagiarised' would be going too far, but a few of them could be described as generic and unoriginal.\\n\r\nSecondly, the plot is really quite slow-paced, despite the occasional fight scene which is obviously (some might say clumsily) trying to attract the viewer's interest and make them feel that something is happening. In fact, you can't help but get the opposite impression- that not much is happening, if anything at all. And when things do start happening, they're weird and, saying this as quietly as possible, similar to Air (which was made in 2005). So far, we've got elements of unoriginality and clichés. Time to go look for some redeeming features...\\n\r\nUnlike many anime, Sola does have genuine merit on the art and sound front, it's extremely well done (for its time; animation techniques have improved noticeably since then). The opening music is catchy enough that it will stick in your memory, and you might find yourself humming it if you are engaged in particularly repetitive manual labour or studying (or that might be just me, which would be awkward). And you can't really hum the chorus as some of the notes are too high, but we'll ignore that. Also, the characters aren't all tediously unoriginal, and there are some very funny moments in the series, despite the genre. I'm still laughing at some of the jokes weeks later, much to the concern of those in physical proximity to me when I start laughing for no apparent reason.\\n\r\nIt is also a short series, at thirteen episodes; whereas too many episodes can kill a series through repetitiveness, I think too few can strangle it just as surely through lack of exposure to any sort of publicity that can keep it in the spotlight, and I reckon that's what happened to Sola. I personally have a preference for short series like this, so if you're like me and don't want to watch the same stuff over and over again, then Sola is a good option.\\n\r\nPour conclure, I haven't told you anything which will swing your opinion one way or another. If you hate romance/fantasy anime or people taking pictures of the sky or assaulting vending machines and household appliances, then Sola is very clearly not for you, as it features all of these quite heavily. If you live in England and would like to see a blue sky for the first time in about eight months, then you might want to watch this, because staring out of the window isn't going to help, and of course, if you do like romance/fantasy/vending machine killing anime, then this is obviously an anime which has been aimed specifically at your particular niche, and you will be in heaven, as someone has finally catered to your needs. If you do find yourself in one of these situations, then I am very happy for you. If you are undecided, watch the first two episodes, and you should have an opinion one way or another. \\n\r\nHappy anime-watching!",
            "date": "2011-12-21T04:55:00+00:00",
            "helpful_count": 17,
            "mal_id": 49687,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Myrmidon83",
                "username": "Myrmidon83"
            },
            "url": "https://myanimelist.net/reviews.php?id=49687"
        },
        {
            "content": "In many ways I feel as if Sola were made for me.\r\nCharacters designed by Naru Nanao, Check\r\nOne of the writers from Kanon the game, Check\r\nCharming slow paced romance, Check\r\nMamiko Noto playing an energetic, rain loving, zettai ryouki wielding character, Check!\r\nPerfectly consistent and plot-hole free?...ok, I guess not\r\nI guess I&rsquo;ll start with my complaints with the series.  Sola started very slowly with an almost slice of life feel.  The premise is quite typical of the romance genre.  You have your typical boy meets interesting girl and both fall in love.  The way the characters interacted was very charming as well as havingan overall happy mood with a sense of sadness/intrigue in the backgrounds.  That intrigue comes from the fantasy elements, in particular, yakas.  This isn&rsquo;t what bothered me, in fact I liked the inclusion of fantasy elements, its just that Sola doesn&rsquo;t know what it wants to do.  First we have the nice calming slice of life aspect, which characterizes the beginning of the series.  However, the 2nd half, was dominated by the fantasy/action elements, which was distinctly different and will probably alienate those initially watched Sola for the slice of life aspect.  While this was a perfectly normal setup the transition wasn&rsquo;t very smooth.  How else can I easily categorize this anime into 2 distinct parts, first half and 2nd half? \\n\\n\r\nAlso, I felt that quite a few characters were neglected.  Mana and Koyori really felt like token friends and didn&rsquo;t contribute much after the 1st half.  This was quite a shame as I much rather liked Mana, unfortunately (or is it fortunately?) she was a perfectly normal person.  Takeshi and Mayuko in the end fell in to a smaller and smaller role, especially when their background was explained.  In addition, there were several aspects that I felt they should have really expanded on/explained.  For example, the sword that Takashi wielded.  Even worst there were a few character inconsistencies especially near the end, something I won&rsquo;t delve into as to avoid spoilers.  In general, I thought the writing was weak.  \\n\\n\r\nStructure-wise, once again had a poor transition between the 1st half and the 2nd half.  Also, I really hated that fact that they explained so much near the end.  While we can infer most of what happened, I felt that it could have been better if they simply told us what happened earlier.  I must admit that it was quite interesting to discover the source of conflict juxtaposed with the falling action during the 2nd to last episode.\\n\\n\r\nOk enough of the bad&hellip;\\n\\n\r\nDuring the first half the way the characters interacted was quite charming.  In particular, I loved the exchanges between Matsuri and Yorito.  Their growing love for each other was nice to watch.  In addition, there are scenes of immense beauty and serenity.  The 2nd half, the story started to hit and when it hit, it really went.  Each episode was fast paced and exciting.  Also, they torture the viewer each week with a cliffhanger, this is something that should be marathoned.  Not only should it be marathoned for the painful cliffhangers, it should be marathoned due to the fact that Sola breaks down under scrutiny, as evident of the above paragraphs.  However, what made me rate this an 8 is that when I was watching I was quite entertained.  I just wished that I had watched it when the series had ended instead of watching weekly.  \\n\\n\r\nAs for the technical aspects, there isn&rsquo;t much to talk about.  The music was very serene and overall quite nice.  VA work in particular was very good, especially Matsuri and Aono.  Although, I wasn&rsquo;t really fond of Yorito&rsquo;s VA, everyone else was pretty good.  Animation-wise was above average and featured some nice fight scenes and beautiful scenery.  While I love Naru Nanao&rsquo;s artwork I felt that Sola didn&rsquo;t do as good a job with converting CG art to anime art.  Where as I though Da Capo and ef ~A Tale of Memories~ did a much better job. \\n\\n\r\nIn the end Sola probably won&rsquo;t stick with me for a very long time, I hate to say it but it was a bit forgettable.  Also, there were a few problems with the structure and the story itself as well as consistency.  However, that won&rsquo;t change the fact that when I was very entertained when watching.  Just remember to marathon the series.\\n",
            "date": "2008-04-19T20:03:00+00:00",
            "helpful_count": 15,
            "mal_id": 4173,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/42620.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/slpless",
                "username": "slpless"
            },
            "url": "https://myanimelist.net/reviews.php?id=4173"
        },
        {
            "content": "Ranged from love triangle , fantasy , mystery and even Existential theme\r\nAt First I did not believe but later on after I watched this anime without bias like someone here\r\nI've found that Sola deserve it's place for the best 2007 anime (Well , I wish Higurashi-Kai  were 2nd)\r\nBefore I seriously watch series anime , I did watch a lot of movie both Hollywood/popular ones and (So-called) Arthouse/Indie ones. I watched many Asian drama/romance some are boring as hell but some has it's value as good spiritualizers. And one of the directors I like best is Shunji Iwai who've made splendid All About Lily Chou-Chou, Picnic , Love Letter (renamed as &quot;When I close my eyes&quot; in US)\\n\\n\r\nWhat do they have to do with Sola? \\n\r\nI'm going to say that Sola could match any Japanese Drama/Romance movies and even better than some. For more as drama/romance movie-watcher I know that the Characterization will not be the same as action (movie or anime) which they should make it obvious to make the story on with action and focus on character personality only to move on and on. But Drama/Romance ones are to make their personality more ambiguious. Still someones might find that &quot;Oh! they lack of personality&quot; just because they're unable to cope with ambiguity.\\n\\n\r\nSola has Love-Triangle theme BUT it's UNCONVENTIONAL ONE! Many may found that it's absurd for some fighting scene. But if you've read a little of japanese culture or literature you'll know that fighting is something more than competition, it's something more meaningful than &quot;Oh! I'm going to kick yer asses hard!&quot; like in some action anime.\\n\\n\r\nAnd , seriously , how can you said that girl characters are sexual pet in this anime? Haven't you watch the scene where Matsuri get close to Yorito first (and...kiss). Don't you see how Aono is manipulative in both apparent and deeper ways. Every! I really mean Every! girls in this anime have power over men characters. Mana , Yorito's close friend , do not fall in love with him like in many other conventional romantic anime (or even some movie) and she  tried so hard to manage things around her to be in appropriate way.\\n\\n\r\nAdding that , I recommended Sola for a woman who have been working for Gender Issue. And she said she like it!\\n\r\nWill you still want to act like a Pseudo-Feminist and ween &quot;Oh! why hero get all girl&quot; like a crybaby? It's you who need to grow up. \\n\\n\r\nAnd for character , the best character for this anime , surprisingly it's Matsuri. She may seem like Everygirl character but that's when you judged her from &quot;Action anime Characterization&quot;. Matsuri is common in personality and yet more real (Well I'm talking about personality so exclude her speciality) . She acts cute as many real girls do (not overact) .She is not too innocent and yet not too teasing , she express innocent appropriately I mean she's not forced to do.\\n\\n\r\nHaven't you ever appreciated scenes when Yorito and Matsuri were together?\\n\r\nThey are very simple romantic scenes that I even recall some in my real life. They're simple yet heart-warming and wonderful.\\n\\n\r\nStill this anime add humanistic value to it. There will be a moment when you dislike some characters and later on you sympathize them. Some characters seem to have conflict , but later on you'll know that how much they want to be closed together like before. This anime portray human's tragedy without being (needlessly) sophisicated.\\n\\n\r\nMusic is one of the most important things that make Sola Atmospheric , apart from it's splendid background. But the flaw is Character Design which make some character less charming.\\n\\n\r\nIn later Episodes of the anime , where all breezy scene in first half ep. has been blown away , the story tend to get more focused about meaning of life and death. It may not portray this issue as more intense or intellectualized one. But still it move our heart. Existential theme is nothing new , but I appreciate how they fit this theme into the story without ruining it's Drama/Romance approach.\\n\\n\r\nDo not let moe-moe appearance fool you.\\n\r\nSola deserve more than average Romantic anime. It has no harem , no fanservice , free from sex appeal , innocent and yet brilliant\\n\r\nFinally , many of Sola scenes  make me feel the similar way I feel for Shunji Iwai's movie. Feeling that is deep and hard to explain.\\n\\n\r\nIf you want shallow existantial story without soul ... go away",
            "date": "2008-11-16T01:02:00+00:00",
            "helpful_count": 14,
            "mal_id": 9529,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/110986.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/erastale",
                "username": "erastale"
            },
            "url": "https://myanimelist.net/reviews.php?id=9529"
        },
        {
            "content": "I must say, I had higher expectations for this series because of my love for the slice of life/romance genre. I was also interested because of the supernatural tag, and although it did make the story more interesting, this series still lacked an important element; pacing. One of the biggest problems with anime adaptions of manga and visual novels are the pacing. Managing the pacing of a series is tough work, especially when you’re working under a 13-26 episode  restriction. Most animes deal with this in a cool and brilliant fashion, and others, not so much. Sadly, in that respect, Sola falls under the“not so much” category.\\n\\n\r\nSola is a story about a high school boy named Yorito, who loves to take pictures of the sky. His older sister Aono has been in the hospital for several months, and is visited frequently by his friend Mana and her sister. Yorito doesn’t devote  much time to seeing Aono in the hospital, and Mana gets annoyed by this. Instead of caring for his sister, he prefers to spend his time taking pictures of the sky (.... I know, right?). On top of that, he has been becoming close to a mysterious girl named Matsuri whom he met by chance one early morning. What he doesn’t know is that Matsuri has her secrets, and there may be more to her than meets the eye. The story is actually pretty good. It’s fairly original, and as I vaguely mentioned before, the addition of supernatural elements makes it much more interesting. \\n\\n\r\nAnother thing that bothered me was how bland the characters were. For example, we have Aono who is your generic “silent girl” role which has become pretty overused these days. I have nothing against Silent types! They rock my socks. But, Aono in this case did nothing for me. Mana, plays the typical “childhood friend” ( Even though they had just met recently ) so there’s nothing very interesting about her either. Overall, Matsuri was the most interesting as well as Tsujido Takeshi ( A side character who you can think ofas the bad guy or the good guy, it’s up to you. ) \\n\\n\r\nThe visuals are pretty standard, and aren’t very impressive, to say the least. They aren’t terrible, but I think that the viewer’s enjoyment of the series would have been greatly amplified if this series had better animation. The music however, is very good in some parts, and is one of the aspects I enjoyed most about the show. \\n\\n\r\nUltimately, Sola is a good anime to watch if you have a great deal of patience. It’s sad that such a good story is essentially ruined by poor pacing. Perhaps, reading the manga would satisfy my dissatisfaction of this series.  \\n",
            "date": "2011-08-16T15:26:00+00:00",
            "helpful_count": 8,
            "mal_id": 41611,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/502303.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MonkOnLSD",
                "username": "MonkOnLSD"
            },
            "url": "https://myanimelist.net/reviews.php?id=41611"
        },
        {
            "content": "A guy who worships skies just met a very weird girl that can fly, fighting against a man holding a sword, in a creepy church. That's normal right? The man sent her flying again and she was thrown in a cemetery. You see, it's the middle of the night, and what does the guy think is the normal thing to do? Yeah, you guessed it: looking for the weird STRANGER girl and TAKING HER HOME. Pfft, that's very normal! He then proceeds to invite her to stay at his place even after hearing that she is a curse and she's not human. Wow, so logical!\\n\r\nYou may ask how is that possible without asking his parents. Don't mind me, I forgot to tell you that THERE ARE LITERALLY NO ADULTS IN THIS ANIME except that one sword man. Yeah, very relatable!\\n\r\nNow, you got the illusion that it's going to be a very dark anime about the weird cursed girl who can't see the light and how she struggles with life... I can't blame you, that's what I thought too. But nope :) The anime, after the 1st two episodes, never explored that ever again. It turned into a boring, tries-so-hard to-make-things-dramatic, anime.\\n\r\nI really tried to enjoy this anime. But I'm sorry, my brain cells won't forgive me if I went on.",
            "date": "2017-06-20T10:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 250456,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675181.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/IAintAllBad",
                "username": "IAintAllBad"
            },
            "url": "https://myanimelist.net/reviews.php?id=250456"
        },
        {
            "content": "I've finished watching this anime a few days ago and actually like it. I thought it was going to be an all boring love story from what I saw in the first episode (a girlfriend told me to watch it, so what could I expect?)  but the anime get's better as it reaches it's end and finishes both sad and nicely. So is a very good anime to watch in your free time but don't expect it to be even as half good as, for example Kanon or Clannad.\r\nLet's start with the aspects of this anime. The story is really a common one atthe begining: \"a girl stays in the house of a boy for any reason at all\". Other thing is that this boy (Yorito) has kind of a obssesion with the sky and everytime he can he take's pictures of the \"different skies\". Don't worry you'll learn the meaning of this later on in the story. But putting aside the common events like this there is a great deal of fighting and use of supernatural powers (sort of vampire like) and the plot twists that makes a story really interesting. The thing is that, overall, the story is shown in a really annoying way that really ruins it baddly. The reason are this  flashbacks to the distant past that occur in the begining of one or two episodes and on the last one. I think this flashbacks do a really bad job trying to give some spectation to the viewer. Well at least in my case I found those flashbacks really irritating and out of context. They definitely spoil what could have been a fantastic tale.\\n\\n\r\nThe art and design in this anime is really well done, it reflects what the anime is aiming for depending of the event: sadness, darkness, etc. The looks on every building: Yorito's house, the hospital, the doll shop, the church, the school (lol take a look at it's endless roof xD!) and specially the different type of skies shown in the anime are very nice to watch. The character design is one of a kind in every character specially Matsuri and Aono look really great and opposite one to each other. So almost from the begining you know that there is going to be serious problems between these two girls.\\n\\n\r\n Now the sound is the best this anime has to offer: it's rich and the BGM's are adequate for each ocassion. The opening is really good (adding it to my list), the battle songs are amazing (a techno-electro mix) and the sad themes are really heart breaking. The sound really does make this anime feel awesome and different from any other due the quality of each and every track.\\n\\n\r\nTalking about the characters these are really awesome as well, specially Matsuri. She just looks gorgeous and her personality is just so different of what you expect when first glancing at her, very funny indeed. She is so different in just too many ways: from her war cry when trying to get her favourite juice (Sennoooo!!!) to her sort of a \"french\" look,  she really makes a difference with any other character I've seen. All the other characters are very well designed but it feels like Matsuri's personality and looks totally opacate the other characters, a pity because there are other interesting characters in this anime that I would loved to see having a more important role.\\n\\n\r\nI spended less than two days watching this anime. I know I watched it in a rush but overall I really find it very fun and worthwhile watching but this is not a \"must watch\" anime so if you are aiming for something really GOOD and sad then go watch Kanon, Clannad or even Air (that if you haven't yet). On the contrary if you'd like to watch a anime that has drama-love but action, supernatural ocurrences and great battles as well then this is the one for you. In the end this anime is different from the lot but not as good to be called a unique or innovating anime. This ends sad as well so if you must watch it grab you pack of tissues or just do as I did: right after you finish it watch the the DVD Special 1, only the first one (it's about a waterpark), you will find it really funny. But don't watch the second DVD Special (it shows some bonus scenes about what happens before Yorito meets Matsuri and it ends precisely when that meeting takes place) right away because you will end up as sad as you were when finishing the anime...\\n\\n\\n",
            "date": "2009-02-07T18:48:00+00:00",
            "helpful_count": 7,
            "mal_id": 12220,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/124642.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/vault2049",
                "username": "vault2049"
            },
            "url": "https://myanimelist.net/reviews.php?id=12220"
        },
        {
            "content": "If you are looking for just something where you need to chill, you've come to the right place. \r\nSola just has this calming feeling. It moves rather slowly for just 13 episodes. I was expecting it to fly by but no, it progressed slowly allowing us to get to know the characters very well before the grand finale.\r\nThe art is amazing, I loved the way Aono looked. It makes sense how the characters would react, and the flashbacks want to make you know more. \r\nIf this was any longer it would be boring. Just saying. \r\nI give this a 10 because of...\r\n-The art\r\n-The length\r\n-The Characterization\r\nIt'struly a great anime!!!",
            "date": "2015-02-19T05:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 180772,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4381871.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/starsonia913",
                "username": "starsonia913"
            },
            "url": "https://myanimelist.net/reviews.php?id=180772"
        },
        {
            "content": "Sola is an anime that will have you wondering until the end.\r\nWatching Sola is retty relaxing for the most part but don't get fooled by the first 20 minutes, this is not a slice of life but rather a supernatural with the pacing of a romance. By pacing of a romance I mean it's kinda slow but in the end it all comes together.. or does it? This anime will sometimes tell the plot through flashbacks and have it explained later through dialogue between certain characters.\r\nSola has some confusing story bits scattered throughout all the episode which I can't mention a single bit of thestory without spoilers other than the main character likes to take pictures of the sky and visits his sister in the hospital frequently. \\n\\n\r\nThere isn't a whole lot of characters in Sola, but because of this, the characters are easier to remember. The side characters take larger roles than expected. The side characters actually help the story move forward without even knowing what's going on.\\n\\n\r\nThere is action in Sola but not enough to fit under the \"action\" genre.\\n\\n\r\nThe soundtrack is really relaxing. The art is good and it has an older look but the environment looks really nice.\\n\\n\r\nSola has 13 episodes and 2 specials. The 2 specials don't really add to the ending but more like extra episodes. The 1st special is somewhere in the middle of the story and the 2nd special is right before the first episode.\\n\\n\r\nI don't have much else to say other than \"I like it.\"",
            "date": "2015-01-26T09:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 179006,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4228909.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheCoolestCat",
                "username": "TheCoolestCat"
            },
            "url": "https://myanimelist.net/reviews.php?id=179006"
        },
        {
            "content": "As with any new review of mine, there is generally a TL;DR part at the end with a basic summary of the positives and negatives.\r\nAh… Sola, what a wonderful show.  I had quite a bit of fun with this one, it kept me hooked enough to finish in two days. It would have been one if I didn’t exercise self-restraint, but I did, so it ended up being two days. One thing that really surprised me about this show was how mature it was handled, especially in the Romance aspect. It was well done, and a very believable romance. The show itself knows whatit’s trying to be, and together that allows a truly great story to be told.\\n\r\nThere is just one problem. It’s not a problem for me, but it will be for some others. Sola is not a fast paced show. There are a few action scenes, and they are quite well done too, but it does have a rather slow/relaxed plot pace, mainly at the beginning. It’s a show that brings out its story not through large action scenes and complicated plots twists, but through the actions of the characters, their dialogues and the way they handle the situation.\\n\\n\r\n*!!!!!* \\n\r\nIf you cannot sit through at least two episodes of no action, and only talking and character development, this is not your cup of tea, and you will most certainly not like this show, or at least it will dampen your overall thoughts of it. I will repeat again when I say, it is not a fast paced show. \\n\r\n*!!!!!*\\n\\n\r\nStory - 9/10\\n\\n\r\nThe story of Sola revolves around 3 main characters (technically it has seven prominent characters, but in terms of development and plot, they are not as important, and they are not main charecters), Matsuri Shihou, Yorito Morimiya and his sister, Aono Morimiyam, and the various mysterious circumstances surrounding the three. Yorito is in school, Aono, his sister in the hospitalized and Matsuri, they mysterious girl he meets at a vending machine while taking pictures of the sky. But not all is as it seems. Why does Matsuri disappear and reappear, having a great yearning to see the sky? Why is she only outside when it’s raining and dull? Why is Yorito’s sister hospitalized, why does she always have the curtains drawn closed in her hospital room? What about Yorito, he seems ordinary enough, but is there some hidden mystery to him?\\n\\n\r\nThese questions are ones that will rattle around your head when the show progresses and goes on, as it slowly goes on to explain them all. Looks can be deceiving, memories can be misleading and not everything is as it seems. Another thing I really pride the story on is the fact that even though the plot is not that big, in 13 episodes, the show felt complete. It ended, and it didn’t leave any strings attached, it didn’t leave some mystery unsolved, some plot element in-complete, and THAT is something that I see few shows doing. It was well paced, well written, and most of all, it was executed very nicely.\\n\\n\r\nArt & Sound – 8/10\\n\\n\r\nThe art of Sola certainly was a pleasure to see, especially the really beautiful, but simple picture of the sky that Yorito took. I really liked the background, and for a show that takes place in a fairly dim environment, the colors used really brought out the scenes. It didn’t leave out anything in the action scenes either. For a show that is not about large-scale, action packed battles, the animation for them were done really well. Props to the studio. Since it’s a Drama & Romance show, they could have easily not animated the scenes as long or as good, but they took the effort to do so, and I appreciate that.\\n\\n\r\nThe sound was fairly well done as well, a bit above average, the opening and ending were nice enough, but nothing to write home about. The BGM (background music) was decent, and it fit the scene when it was played. There are one or two stand out tracks I really enjoyed, but overall, it was a decent set of tracks.\\n\\n\r\nCharacters – 9/10\\n\\n\r\nAnother thing I loved about Sola was the characters. While Yorito might seem a bit plain, he is still an interesting character. Not as interesting as Aono and Matsuri, but still interesting. He’s simply a high school student who loves taking pictures of the sky, and can see a world of things in a simple picture of the sky, whereas others simply see clouds…… Either he’s got an artistic mind, or he’s hallucinating… Just joking, I actually liked that artistic part of him. It’s not a usual hobby, but it is a perfectly plausible one. The romantic & character development of all the characters are very well done, but I especially liked the development he went through, especially after a certain plot element was revealed. \\n\\n\r\nMasturi and Aono are both two very interesting characters. They both know each other, but Yoirito doesn’t know Matsuri at the beginning. This gives them both an air of mystery surrounding them. I don’t want to give too much out as that will spoil the plot a bit, but I never felt that at any time their actions were unwarranted. They are very believed and understandable characters. \\n\\n\r\nThe other 4 are sadly not explored that in detail. It's a shame as they were a little bit interesting. It is for this reason I will just lightly mention their names. Mana Ishizuki, Koyori Ishizuki, Mayuko Kamikawa and Takeshi Tsujidou. I felt they needed more development, but it was shelved so we could focus more on the main. That's both good and bad, but I was annoyed how we didn't get good character development for them. This is one of the negatives, and almost brought the character score down to 8, but I decided to give it a 9. We do get a bit of back-story on Mayuko and Takeshi, but still, much more could have been done.\\n\\n\r\nOverall though, the interactions were handled really well between the characters, and the drama was nice, without ever giving you the feeling it was trying to be melodramatic. It did not try to force you to feel emotions using melodrama (You know, lots of teary scenes, screaming fits, deliberately butchering characters to make you feel sad) like several shows try to do (These are not necessarily Drama shows, but that’s not the point.) The characters handled themselves maturely, the romance was done well, and the characters felt like individuals, their own people, and not stereotypes or cookie cutter figures.\\n\r\n--------------------------------\\n\r\nTL;DR Section:\\n\\n\r\nStory – 9/10\\n\r\nArt – 8/10\\n\r\nSound – 8/10\\n\r\nCharacters – 9/10\\n\r\nEnjoyment – 10/10\\n\r\nOverall (Average of Above) - 8.8/10 \\n\\n\r\nPros and Cons:\\n\r\n+Great Character Development (For the main three characters)\\n\r\n+Interesting/Well Rounded & Believable Characters\\n\r\n+Good Romance Subplot\\n\r\n+Enjoyable, but simple animation.\\n\r\n+Enjoyable Plot\\n\\n\r\n-A bit show paced. Not a negative for me, but not everyone's cup of tea.\\n\r\n-Not that much action - Same as above, No problems for me, but that's a personal opinion.\\n\r\n-Lackluster Character Development for side Characters\\n\r\n-Forgettable Opening and Ending (I'm really nitpicking at this point).\\n\\n\r\nOverall, a great show, BUT not for everyone. If you cannot stand a slow pace, especially at the beginning, and need action every episode or two to keep you going, you will mostly likely not like this show. If your not a fan of Drama, Romance or Supernatural, this show will most likely not interest you. Regardless of that, give it a go. You might even end up liking it. :)\\n",
            "date": "2015-04-10T05:16:00+00:00",
            "helpful_count": 6,
            "mal_id": 185289,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3085921.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Deoran_Old_Acc",
                "username": "Deoran_Old_Acc"
            },
            "url": "https://myanimelist.net/reviews.php?id=185289"
        },
        {
            "content": "A quick review to give people a vague idea of how this anime is and not just throw in my own unidentified views like most people-starts off exciting, slows down, reaches climax, comes to an epic end. \r\nMy Personal Views: (hahahaha), you have to have a little desire in a love or passion for or of something more pure and honest to undestand the first half, the later half you need some experience in letting go and contentment (I THINK) to be able to appreciate the ending. Although the ending did PISS ME OFF!!!!!!!!! that' why I gave it a nine =\\\r\nTWO THUMBS UP!!!",
            "date": "2007-10-28T19:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 1148,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/15384.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/WorldWide",
                "username": "WorldWide"
            },
            "url": "https://myanimelist.net/reviews.php?id=1148"
        },
        {
            "content": "I tried to power through this anime, but I just got tired of wasting my time.\r\nWith the problems presented, it could have been really good, but ended up just being bland a bit confusing.\r\nMagical characters are presented, but they're used more to cause angst and drama than anything else.\r\nThe chemistry between the main character and his love interests is lacking and uninteresting. There doesn't seem to be any at all.\r\nThe art and sound are fine, but nothing new or spectacular.\r\nThe only thing that really interested me was the relationship between Takeshi and Mayuko, and they are side characters.\r\nThis anime wasn't really worth my time, inmy opinion.",
            "date": "2011-12-22T15:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 49839,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/387972.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/livingdeadkat",
                "username": "livingdeadkat"
            },
            "url": "https://myanimelist.net/reviews.php?id=49839"
        },
        {
            "content": "A sad, short little anime about little precious things.\r\nYorito loves to photograph clouds. He seemingly lives a normal, if not dazed life. He vistis his sister, Aono in the hospital, who is suffering from an affliction that is never explained. He's friends with a sweet girl, Mana and her sister Koyori.\r\nOne morning, while waiting to see the sunrise, he meets a strangely familiar vampire girl, Matsuri.\r\nThis is an unusual vampire anime, for a variety of reasons. One being that it doesn't really focus on the vampirism as much as the immortality of the chracters and the pain it can cause them, and the inevitable lossof loved ones.\\n\\n\r\nMatsuri is such a person. Both haunted and hunted for her vampire blood. This is a whimsical anime that has darker undertones that mostly deal with what happens when you try to make yourself happy at the cost of others.\\n\\n\r\nWithout giving too much away, none of the characters are what they seem, and as they begin to realize this, they have to make heartbreaking decisions--which ultimately leads to Yorito wanting to show Matsuri the sunrise.\\n\\n\r\nAll of the characters are superficially silly but genuine. Each has their own personality and are generally likeable for they all have a motivation for their actions, even if they seem cruel on the outside--with the exception of Matsuri, whose kindness and sweetness actually hides a selfish act she's hoping she can get redemption for. The music is light and airy, and fitting, and there's good use of skies and bright colors to emphasize the fleeting and precious mortal world.\\n\\n\r\nThere are two \"DVD\" specials that accompany it, one being a fanservice filler episode and the other being a prequel to the events of the story--and the meeting of the two main characters.\\n\\n\r\nThis is a sad little romance that tries its best to smile through the pain, and one of those sweet anime that can't do much wrong.",
            "date": "2009-04-30T21:32:00+00:00",
            "helpful_count": 5,
            "mal_id": 14661,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/171075.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tentacle_raep",
                "username": "tentacle_raep"
            },
            "url": "https://myanimelist.net/reviews.php?id=14661"
        },
        {
            "content": "One of the first anime's I ever watched so maybe I have a small soft spot for it. I first watched it when I was 14 and rediscovered it over 5 years later. I must say I still love the anime. The story, as many have mentioned is slower then some, and the anime may appear a little odd - defiantly not what you would expect when reading the plot. However, it is underrated and not many know about it. The story is refreshing and easy to follow though also dives into deeper meanings. The characters may not have the best development but it isthe plot that sucked me in, twists and turns and a ending that you won't really expect. The anime is a hidden work of art that any anime fan needs to watch at least once.",
            "date": "2016-02-08T00:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 210415,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Amber_Jacobson",
                "username": "Amber_Jacobson"
            },
            "url": "https://myanimelist.net/reviews.php?id=210415"
        },
        {
            "content": "I haven't written a review of an anime before, but this show both moved me, and made me feel things I wasn't expecting to feel. Maybe I'm just a sucker for romance, but right from the first episode, I felt Sola was something wonderful and different.\r\nThe story is a really sweet and beautiful one with the blossoming romance of two of the main characters. The beginning is slow. It helped to build the characters as who they are in the present and helps the watcher (you) get attached to them. This slow start may have the unfortunate side-effect of turning away those who go intoit more casually, as the story doesn't pick up until about episode 5 and even then, slowly. The second half, however, has action and drama and backstory... and confusion. Everything makes sense on the surface, but if you look deeper, some things are just never explained. Sola has very well written characters, but stumbles a little in world building. The focal character changes in the last 2 or 3 episodes to add to a mysterious tone and for story reasons, but I personally was not fond of that\\n\\n\r\nThe art in Sola is wonderful. Which is to be expected when the characters and story find the beauty of the sky so important. I wasn't a fan of the actual photography that is prevalent in the ending credits, but I understand it's use. The action scenes are gorgeous and the character kept moving through space during it. In some anime, as soon as the battle is in the air, they just seem to float there when they fight. Sola doesn't have that, and that was very nice to see. The character designs are very good, especially on Matsuri. You can tell that a lot of effort was put into designing her, and I'm not one who normally finds anime girls beautiful, but I found her extremely so. Yorito has an emphasis on his normalcy, even in art. He's a good character, and the fact that he's so normal looking is of sharp contrast to the two female leads. Aoko is very very similar in both design and personality to Angel from Angel Beats or Rei from Neon Genesis Evangeleon. So that's kinda meh.\\n\\n\r\nThe soundtrack is absolutely beautiful. It wasn't perfect or outstanding, but it was really nice. Special emphasis on the opening theme for both capturing the allure the show, and to somehow remind me of the peacefulness and turmoil the sky always has.\\n\\n\r\nThe three main characters are... good. Again, Matsuri seems to have been spent the most time on. Her character is complicated without being confusing, and the fact that she can still be a source of humour and fun, made her a very enjoyable character to have on screen. I really liked Yorito's character, as he was normal without being bland, and he's not just our way into a more fantastic world, as he can still hold his own. His motivations are simple yet, anyone who's been in love can understand his occasionally rash behaviour. Aono's personality, however, was a draw on the show's emotional energy at some of the more intense scene's but it wasn't overpowering. It was especially refreshing the few times she breaks her emotional distance.\\n\\n\r\nI loved the show. It made me laugh, it made me gasp in fear, it made me cry. It's something that's really hard to put down once the initial establishing character lull was over. There was one really odd thing with my enjoyment, though. While it was really hard to put down, it was also extremely hard to pick back up once I had. I marathoned it in three sittings... over the course of more than a month. I decided that I was going to write this review as soon as I had finished it, as Sola has the interesting trait that I kept forgetting how good it was and how much I loved it. It got to the point in which I'd skip over it for weeks at a time and have to almost force myself to pick it back up. But I have no idea why! I have no idea why it was so easy to forget the quality of this show, but maybe someone else had the same experience and can tell me why.\\n\\n\r\nOverall, really, really good. It has its flaws, and even though I may have to remind myself repeatedly that I loved it, I still did.",
            "date": "2016-02-10T23:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 210642,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5050282.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ThisISDead",
                "username": "ThisISDead"
            },
            "url": "https://myanimelist.net/reviews.php?id=210642"
        },
        {
            "content": "sola is one of those little gems that comes once every few years, and I'd recommend it to absolutely everyone... Why? Because IMHO I don't think that there's a person who wouldn't enjoy it.\r\nThe story is quite something, the mystery starts at the first episode but every episode what you originally thought how the story was going to develop, turns out to be even more mysterious, suspense keeps increasing every episode and to me that is something very important in a series, that grasps you in a way that you desperately want to know what is going on and that the main story is notonly great but just plain awesome!\\n\\n\r\nIn regards to the animation, I honestly believe this is studio NOMAD's best series yet, I've seen some of their other works and by far, sola is the best one when it comes to animation, background detail, and character animation consistency.\\n\\n\r\nWhen it comes to the music, Ceui's Bikan no Fuukei (first episode opening theme and insert song in some of the episodes) is my favorite song of the series. The OP/ED themes are good, but Bikan no Fuukei is soooo related to the story and the characters that if it were the _only_ song featured in this anime, it'd be OK :P.\\n\\n\r\nOverall, if you like fantasy, romance, sibling-love (not the bro-con/sis-con one, you have a lot of choices for that one) and drama, this is a must watch! ;)",
            "date": "2012-09-09T20:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 71999,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21318.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shido_Tatsuhiko",
                "username": "Shido_Tatsuhiko"
            },
            "url": "https://myanimelist.net/reviews.php?id=71999"
        }
    ],
    [
        {
            "content": "I was very impressed with this show! I wasn't really into anime when it came out, so i've been catching up on alot of good shows that came out in 2007, and i was very impressed with the animation of this one! The character models are all very attractive with slender bodies/faces. I also think the characters had a lot of life and connections. This stories more or less about tragic relationships, and people that strive too be together but ultimately can't have what they want out of a relationship. My only complaint was that i wish it was longer! I recommend this to anyonethis has a little bit of everything in it",
            "date": "2012-02-12T10:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 53735,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1081507.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jaredross",
                "username": "jaredross"
            },
            "url": "https://myanimelist.net/reviews.php?id=53735"
        },
        {
            "content": "Sola is an anime I watched solely for my participation to yearly Anime Challenge organized on the website. Although I just wanted to marathon it for completing one of the challenges, I'm honestly surprised and moved by this anime, so much I couldn't just leave it there without reviewing it right away.\r\nFirst off one of my points concerning this anime is, in despite ten years passed after the airing of that piece of work, if one would argue it fits well in the old. It was at the quality you would expect from last decade animation, and I personally prefer it that way. In truth,anime who sorted in between the 2000s and 2010s are my favorite ones.\\n\\n\r\nArt (9) :\\n\\n\r\nOne of the astonishing remarks I could assimilate upon that show, would be merely its artstyle. I don't specialize in knowing studios and the whatnot in behind the pieces of otaku culture, but it definitely looked nice to me. For once, I found it colourful, some of the background showed city environments, and a bit linked to the characters, the different skies. And I love this medium ever since I watched an anime scene taking place in sunset.\\n\r\nThat was all of a paragraph dedicated to my love for old artstyle, and if I were to cite an equivalent level of design, although perhaps it could be a lot different, but none would say it isn't a bit close... This title would be a popular anime for every true fan, \"Suzumiya Haruhi no Yuuutsu\" or \"The Melancoly of Suzumiya Haruhi\" as well for westerner fans.\\n\r\nI do not usually talk about animation in my reviews, even though there were action scenes, but it is merely because that is not one of the points I would watch an anime. Facial expressions, nonetheless, could be worthy of mentioning.\\n\\n\r\nStory (8) :\\n\\n\r\nAlthough the story in herself was sufficiantly delved throughout the course of the show, there were some plotholes here and there, such as small details that are nowhere from being explained. But that is in itself inherent to the animation, and perhaps the original source is enough advanced on that subject and that would only matter for the budget.\\n\r\nEven so, the ending (quite the ending, satisfying, giving you feelings, but still not being the most wanted from the viewer ; at least we can say the author did not mean to take in account the viewer's approvement for the ending) wasn't what I expected. Still it should be rated that high for the sole reason of being well-executed.\\n\\n\r\nCharacter (8) :\\n\\n\r\nSince the story gets a bit boring in the middle if it weren't for character development it would only be useless. Nonetheless they are well pictured and not only the main characters are deeply described. It is necessary to tell not every side-character is there for the sole purpose of forming a gag, only the cutie lover friend of Mana.\\n\\n\r\nSound (8) :\\n\\n\r\nI did not take much into account the voices, therefore the only reason of judgement shall be soundtracks (there were some at interesting moments, piano was well fitting with the drama slow parts), sound effects (broken glass at the church, kicking the vending machine)...\\n\r\nBut the opening was rather greatly accompagned with the animation featured, and the song was good.\\n\\n\r\nEnjoyment (8) :\\n\\n\r\nI had much fun watching it, although I kinda forced me at some parts. Nonetheless in the midst I was kind of looping episodes after episodes. Definitely good watch, this anime could be featured in my favorite anime.\\n\\n\r\nOverall (8) :\\n\\n\r\nYou should watch it if you are into more elder titles, or the romance and drama parts attract you. Some should find the supernatural tagging kind of repelling but it serves the story, and this is precisely the point that gave off such a contestable ending. Similar titles I recommend from my experience are, as scale of comparison for points by points.\\n\r\nFor the school life scenes, \"Suzumiya Haruhi no Yuuutsu\" could be similar. If it was the romance, it shall be \"Ef: Tale of Memories\", and if it was the slice of life, something close to the fusion of \"Higashi no Eden\" and \"Fate/Stay night\". As of the surnatural tagging, there was one anime whose premise seemed kinda similar, \"Omamori Himari\".\\n\r\nTheorically as well, I managed to only cite anime from the 2000s and 2010s. I hope you will give any value to this review and if it encourages you to watch it, then it's definitely working.",
            "date": "2017-05-27T06:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 248621,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5047079.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lolsebca",
                "username": "Lolsebca"
            },
            "url": "https://myanimelist.net/reviews.php?id=248621"
        },
        {
            "content": "While this anime is not as bad the reviews, I kinda get why it has a low rating. First it lack details, we just watch the story going without given enough background to connect with the characters, we just kinda guessed throughout the whole series and it's not even a mystery anime, by the time the truth came out I already didn't care enough for the character to get all emotional.\r\nHonestly I LOVE sad animes (like Anohana, Angel Beats, Clannad, and Plastic Memories to name a few) but this one just kinda didn't get it right, while it has a heavy plot strangely it didn'tpiqued my interest. I liked the romantic development but it still feel incomplete. The good thing about this anime is it contains only small amount of cliches, where else would you find a loli that acts like a proper adult? Or a \"childhood friend\" character that's not annoying and even very understanding of the mc situation, or an older sister that's a \"Kuudere\"? It's pretty unique.\\n\\n\r\nThe animation is ok for an anime that's made more than 10 years ago. The sound could be alot better tho since in some sad scenes the music doesn't feel sad enough. I'm not sure if I can recommend it since it's kinda disappointing for me (and a lot of people).",
            "date": "2018-10-24T23:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 292522,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7313557.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SenpaiDray",
                "username": "SenpaiDray"
            },
            "url": "https://myanimelist.net/reviews.php?id=292522"
        },
        {
            "content": "I did enjoy the series for the most part but there were a few things that did bother me. Some stuff we just were not given answers for in the end. It's unfortunate because I did feel it had some decent potential overall. I was caught by surprise when we found out that Yorito was simply just a mere illusion. That was really when the show definitely piqued my interest. The character that I enjoyed the most ended up dying for the sake of giving Aono another chance to live as a normal human. I felt that the one truly deserving of being given anotherchance to live was definitely Mayuko. At the same time I do understand why Aono was given one, a chance to grieve over Yorito death I suppose. But it didn't help at all how over-possessive and bitchy she tended to behave. Definitely a character who deserves to be well disliked. It was more difficult to sympathize with her when you have Mayuko who's pushed aside. However to be somewhat positive on the ending, I did like how it emphasized on the sky connecting them all together. Perhaps for now I'd give this a solid 6. This is my first review but I just felt compelled to do one on this.",
            "date": "2017-11-10T08:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 262935,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5861117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/FlashoftheBlade",
                "username": "FlashoftheBlade"
            },
            "url": "https://myanimelist.net/reviews.php?id=262935"
        },
        {
            "content": "The best way to summarize Sola is to say that it's a great concept, poorly executed.\r\nThe story is awesome. Really awesome. Not since Kanon have I seen a story so semi-tragic and bittersweet. However, the art is terrible, and the voice acting is subpar. The way the story unfolds definitely could have been done better, and except for the song \"Binkan Na Fuukei\" by Ceui, the soundtrack is unexceptional. However, the story was so great I quite enjoyed it anyway.",
            "date": "2008-12-25T17:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 10628,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/103199.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/stormchasar",
                "username": "stormchasar"
            },
            "url": "https://myanimelist.net/reviews.php?id=10628"
        },
        {
            "content": "This anime was not done the it shoud have look if you watch this, stop after ep11 trust me okay if you'll be sorry and wished you never watched 12 & 13 these eps took my score from an 8 to a 5 you do the math",
            "date": "2009-01-06T18:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 11182,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/92206.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/True2daflame",
                "username": "True2daflame"
            },
            "url": "https://myanimelist.net/reviews.php?id=11182"
        },
        {
            "content": "I first watched this anime series maybe two years ago, then I watched it again just recently. \r\nI found this anime very entertaining. In fact., it's one of my top favorite anime series to date. I just love the flow of the story, the characters' development, the action scenes were so flawlessly made, the slight romance (apparently, one of the very reasons why I was so fond of this series--one might think it's a harem type, but in point of fact, it isn't. I just love Matsuri x Yorito) and of course the shocking truth behind the real identities of the siblings., \r\nThe ending waskinda sad though. But I understand why it had to happen. \\n\r\nAll in all., Sola was a really, really wonderful anime.",
            "date": "2011-07-19T03:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 39493,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/517965.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lynchan",
                "username": "Lynchan"
            },
            "url": "https://myanimelist.net/reviews.php?id=39493"
        },
        {
            "content": "If you're reading this for the synopsis then you're reading the wrong review. If you're looking for a critique in a reviewer's POV then you're at the right place.\r\nA romance-drama anime in the vain of Kyoani which means that it will take some time (around half-way through) before it launches itself to a climax. Fortunately it gives a lot of mysteries to the viewer to keep them interested all the way through.\r\nI didn't like the character designs at first especially since the lead male  looks quite odd when facing the camera. Then I realized that this difference in looks is a drastic change fromthe round faced lead-male. I guess the character designer is portraying him to be skinnier than average-skinny  or something. The other characters look standard fare so the bigger the role that character has the more they're important to the story. Look at the picture at myanimelist.net to figure out who's major and who's not.\\n\\n\r\nBackdrop-wise, the is attention to detail is breathtaking. From the sky, to the European flair of the town to the sun shines. Better than most animes.  Believable to the point that it's almost like being there. An unforgettable backdrop.\\n\\n\r\nAnimes aren't music first so I'll get right to the point. The OP, ED, and IN songs fit the anime perfectly. They're also excellent enough that they deserve to be listened to. This is one of those very few animes that I don't skip the OP and ED. Which means it's great.\\n\\n\r\nCharacter-wise the focus is on the 2 female leads of the story. I wouldn't tell you who they are but they're the two biggest faces on the myanimelist picture.\\n\\n\r\nA romance-drama that with a mixture of folklore, mystery, the supernatural, and tragedy in more ways than one. One of the few animes that I have watched in one sitting which always equate to excellence. Unfortuantely I can't recommend this on myanimelist since there's a limit of 5 recommendations. However, I will recommend this to anyone. Even those who doesn't watch anime",
            "date": "2009-03-29T20:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 13592,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160071.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Unregistered00",
                "username": "Unregistered00"
            },
            "url": "https://myanimelist.net/reviews.php?id=13592"
        },
        {
            "content": "Sola was a complete on the spur of the moment watch for me. \r\nI've never been too into the whole \"supernatural romance\" genre in anime and other media, but I've known about Sola for a while and I've always been interested in it, I just never took the time to watch it. Also, I watched the first episode with my best friend who didn't end up watching beyond that and didn't really like that much either. \r\nBut I did. \r\nThere was something about the first episode, and the concept of Sola in general, that really grabbed my attention, to my utter confusion. Now that Ifinished the show (by binging no less!) I've realized that there's really nothing that special about Sola. \\n\\n\r\nThe pacing is slow, the art isn't that great, the story is blah, and the characters are kind of annoying. But somehow, all those mediocre factors work together to make this an enjoyable show. You need to look at this work as a whole to be able to appreciate it.\\n\\n\r\nThe story, though plot hole-y and slow, played out nicely throughout the whole series. My one qualm would be that the mood was all over the place at times. The story starts out very slowly and speeds up for just a little bit, then goes into this slice of life type thing but with the required supernatural-romance quirks. Then all of a sudden, all these plot twists are thrown into the mix, even though they're still trying to maintain the quirky slice of life tone. Even still, the story was interesting, despite being hard to follow at times. Sola also falls under the category of heartwarming and tugs at your heart strings (I actually teared up a couple times while watching it whoopsies).\\n\\n\r\nI'm a sucker for good character development, but this show had very little (though I wasn't expecting it to). Our protagonist Yorito is a boy with his head stuck in the clouds and his face always behind a camera. Honestly, I liked this little thing about Yorito. His obsession with the sky was cute and was one of the likable factors of him. Our female protagonist, Matsuri, has these weird quirks about her that are kind of annoying, but sort of become endearing (Tomato bean juice). I suppose the character who goes through the most growth is Aono, Yorito's sister, but I can't really say without spoilers. I think my favorite character was probably Yorito's best friend Mana, who also had development in some way. I just liked that she was happy, and genuinely cared for her friends. She and her little sister Koyori lightened the story in a cute way. \\n\\n\r\nThe thing that stood out the most for me in Sola was the music. The OP, ED, insert song and the score were all beautiful and added to the whole feel of the series. The art is probably my least favorite thing about this series. Even though the scenery was pretty, the character art was... meh. There were quite a few wonky looking faces, and each character at least once had what I call \"the dorito chin\". Seriously, at times I wanted to pause and see if I could find the angle measure of Yorito's chin...\\n\\n\r\nOverall, I liked this series. As I said, it's nothing special; it's not anything you haven't seen before. But it's a sweet story that's worth a watch, if you can get past plot holes, sporadic pace changes and (at times) cringe worthy art. \\n\\n\r\nAlso this is my first review so sorry for any mistakes I made or just overall mediocrity. uvu;;\\n\\n\\n",
            "date": "2014-06-21T23:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 147971,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3661485.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/satoneshichimiya",
                "username": "satoneshichimiya"
            },
            "url": "https://myanimelist.net/reviews.php?id=147971"
        },
        {
            "content": "Story\r\nIn terms of story, Sola is quite unique. What seems to be at first a general, boy meets girl, boy falls in love type of story, it is actually a bit more complex than that. It does follow the usual routine though, but along the way, it is not the usual events that lead to the usual ending. So anyway, the story to me is very nice. It gives a refreshing new outlook on the romance genre. Sola also incorporates some supernatural themes into it, which makes it a little extra special. The story can get a little boring sometimes, since at the beginning, itis very slow paced. However, the last few episodes are jam-packed full of action scenes and good dialogue so it definitely balances it out.\\n\\n\r\nRating: 8/10\\n\r\n“Nice story that incorporates more than just romance.”\\n\\n\\n\r\nArt\\n\r\nExceptional. That basically sums all of it up. I am very picky about character designs and this is definitely in my top 5 regarding art and character designs/background quality. Must watch if you are looking for good art. Naru Nanao definitely is a master at drawing characters. She also drew Da Capo and the Ef series so you know its good.\\n\\n\r\nRating: 10/10\\n\r\n“Wonderful designs and backgrounds. Very nice and cute characters”\\n\\n\\n\r\nEnjoyment/Sound\\n\r\nWell, Sola was an enjoyable show for me. The first few episodes were a bit boring, and it was because of the art that kept me going. Good thing I did, since I really enjoyed it towards the end. The BGM was very good. The OP and ED were nice, as well as the animation that went with it. No problems with this section, except that the first few eps are a tad bit slow paced.\\n\\n\r\nRating: 9/10\\n\r\n“An enjoyable show to watch. Sounds are also good and helps accompany the story”\\n\\n\\n\r\nFinal Rating: 28/ 30\\n\r\n“Nice show to watch. Recommended to people who like romance with a bit of action placed into it. A must watch for people who would enjoy good high quality character designs. I definitely enjoyed watching the show and hopefully, you would too!”\\n",
            "date": "2010-01-09T18:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 22244,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/175289.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SolistraSora",
                "username": "SolistraSora"
            },
            "url": "https://myanimelist.net/reviews.php?id=22244"
        },
        {
            "content": "(This review is for those who have completed the show.) \r\n(This is not a traditional review.) \r\nThis anime gives me a strange feeling, as some others might probably feel. In many ways it's a unique anime, and it's hard for me to give it a score. \r\nIt contains many rather normal and predictable plots, though. When Aono began to teach Koyori paper folding, I immediately knew it's an important sign. It's also easy to guess Mayuko's identity. Therefore, most of the moving parts in this show are not powerful enough for me. The main story is more startling to me rather than touching. \r\nStill itis strange. First and the most superficial thing is that both male and female lead die at last. Besides, the story extends into many centuries before. (Actually I think this is almost like cheating, Loading the plot with the heaviness of history can always create the strong feeling.) \\n\r\nBoth strongly remind me of Air. In fact the writer of Sola once belonged to Key and wrote the large part of Kanon. The cast is also strange. As some reviews have already pointed out, Aono doesn't suit Nakahara Mai. Nagisa in Clannad is much better. (Actually this reminds me of Tamura Yukari, who casted Mae in Kanon, somehow similar to Aono. Personally I think her performance of Sunohara Mei in Clannad and Kanako in Ore no Imouto suits better) \\n\r\nBTW I really like the drawing style, especially the eyes.",
            "date": "2013-12-12T18:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 123603,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3395403.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ssdcgaddq",
                "username": "ssdcgaddq"
            },
            "url": "https://myanimelist.net/reviews.php?id=123603"
        },
        {
            "content": "An interesting tale but there are things that well...just don't make sense. Not really able to explain without spoiling so I will just say that what they are trying to do in the last couple episodes doesn't make sense given the options and in some ways denies how Matsuri said she felt about Yorito. Also, how the mind and memories were treated bothered me.",
            "date": "2014-01-03T20:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 127061,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KerrieV1243",
                "username": "KerrieV1243"
            },
            "url": "https://myanimelist.net/reviews.php?id=127061"
        },
        {
            "content": "****Spoilers Ahead, Do not Read this Review before watching the show*****\r\nSo, I rated this one well, as it deserved it, HOWEVER, I did not like it.  I regret having watched it, completely, I hate the melancholic end, the whole wrapping it up with the 'This is the life they gave me, I moved on' stuff.  A good ending, without argument.  A good story, without argument. In all ways, it was a great anime, and a great story, but I did NOT like it.  Since I have the ability to view things objectively, I can say that this series is done verywell, it is quite possibly a masterpiece in the romance/drama arena, HOWEVER.  I did not like it.",
            "date": "2013-06-27T19:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 102729,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/859171.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Gerentex",
                "username": "Gerentex"
            },
            "url": "https://myanimelist.net/reviews.php?id=102729"
        },
        {
            "content": "Well, another anime had the potential to an outstanding anime. Don't get me wrong, it's a WONDERFUL series, but it often gets confusing and it feels you've been left behind at some points. I think most people will enjoy this series, so give it a try!\r\nStory: Ah! The concept was astounding! However, it's poorly executed throughout the series. I feel this series should of had at least 24 episodes to make some room for the character relationships to grow. The romance genre for this series seems minimal to me and almost doesn't exist. However, that does not stop this anime from being one of myfavorites in my opinion. 7\\n\\n\r\nArt: See for yourself, and it'll explain itself! 10\\n\\n\r\nSound: I was hooked once I heard the opening theme. It draws you in and warms your heart. The overall music in the series is wonderful! 10\\n\\n\r\nCharacter: I really wish some more episodes and romance were thrown in there! That would have been the icing on the cake for this series and easily could be an all time favorite. However, that's not the case. But there is indeed character development. We find out the true identies of people and the 'antagonists' motives. That part comes together nicely... sometimes. Other times leave us somewhat confused about the characters. 7\\n\\n\r\nEnjoyment: Besides the lack of execution and romance, this was still a highly enjoyable anime and the ending was splendid in my opinion. 8\\n\\n\r\nOverall: It was almost all there. The concept, the story, it was all set up and ready to go. But it seems something was left out at times which most of the time, fills in later. The romance section of this anime hardly exist (They really should've had at least 24 eps and more romantic development!). However it is still a great anime and I would highly recommend it. 9",
            "date": "2013-04-13T19:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 93663,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/neogamer12345",
                "username": "neogamer12345"
            },
            "url": "https://myanimelist.net/reviews.php?id=93663"
        },
        {
            "content": "A very nice anime if you like character romance developments with action on the side, a slightly comedic yet tragic anime, I just with it didn't end how it ended :(",
            "date": "2011-07-31T21:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 40505,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/531027.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Voidedicon",
                "username": "Voidedicon"
            },
            "url": "https://myanimelist.net/reviews.php?id=40505"
        },
        {
            "content": "So I just finished Sola. And I feel that my day is still incomplete. Most awesome possum anime leave you feeling sad, depressed, happy, you know the typical emotions that you feel after watching something that left a huge impact on you. And Sola, failed to leave that impact. What it left for me, was more of a \"WTF? That's it?\"\r\nSTORY: 6\r\nOK I'll be sincere here. It wasn't so much as a boring uninteresting story, it was a story that felt like it left out important details. Like:\r\nHow did Matsuri become a Yaka in the first place? \r\nWhat are the origins or Yaka? \r\nWhat thecrap is her power? Rusting objects? Why?\\n\r\nAnd if Yaka's cannot go outside in the daytime because they will burn from UV exposure (much like vampires) why not just use Google and buy yourself a UV suit? I just Googled how much they cost and they are like $5 for kid sizes! I'm sure you can find an adult size. There, problem solved. Now you can go outside all you like without the worry of turning into a walking ball of fire.\\n\\n\r\nOK so enough with the obvious solutions to problems the idiots faced. The story had a nice end, but felt incomplete. You know when you have a delicious cake before you, with its beautiful taste of whatever your favorite kind of cake is but it's missing something? Yeah, it is missing those (insert your choice of topping). Or you're eating your favorite type of cookie but without any milk? (Idgaf if you are lactose intolerant. Milk is amazing with cookies) Yeah, that's pretty much what Sola did to me. It gave me an Oreo, but without any damn milk! \\n\\n\r\nART: 7\\n\r\nThe art was decently and nicely well done. But sometimes, I look at Yorito's chin and I say \"Man what the fuck is wrong with his chin? It looks so pointy. Well at least everyone else seems somewhat nor... HOLY SHIT Matsuri not your chin too! I don't want to feel like I'm watching Cyberchase! \\n\\n\r\nSOUND: 7\\n\r\nThe typical sounds of anime. As in the sounds from the early 2000 anime. I'll reserve this section for the actors/actresses:\\n\\n\r\nMana Ishizuki - VA - Honda, Youko: \\n\r\nBesides her name being that of a brand for cars she perfectly fit this character. Not squeaky or annoying, she sounded exactly like a normal high schooler. Just the way it was meant to be.\\n\\n\r\nYorito Morimiya - VA - Okamoto, Nobuhiko: \\n\r\nOh thank you Jesus! He doesn't sound like a faggot! He sounds like any other real good protagonist that has no powers but has the gumption to take in the truth and say \"Fuck it man, I've lived the way I wanted to of my own free will. And when I'm gone, I'll know I didn't regret smoking that weed!\" Because I know I don't. ;) \\n\\n\r\nAono Morimiya - VA - Nakahara, Mai:\\n\r\nOh hey it's Nagisa! Back from the dead I see? Oh wait, you're not Nagisa. You sound nothing like her. You sound like...Kanade? Except a bit more with a chilly feeling rather than a cute huggable, squeezable feeling.   \\n\\n\r\nMatsuri Shihou - VA - Noto, Mamiko:\\n\r\nYes. Just yes. Hecate all the way! With a little of Tifania sprinkled on top. Maybe some Kotomi in there as well. Then again don't they all sound exactly the same? Anyways if you aren't familiar with this VA you will be now. Famous for her Hecate roll in Shakugan no Shana, Kotomi in Clannad, and Tifania in The Familiar of Zero, she fits so wonderfully with Matsuri and other somewhat soft spoken characters that she practically brings them to life. Although to me she is very infamous at the same time with her roles with vertically challenged little shits. Oh don't remind me of Kouta! Please don't! \\n\\n\r\nCHARACTER: 7\\n\r\nDamn there was a lot of character development! I jizzed myself when a twist happened with Yorito! The sister's twist was obvious but even then still. WHAT A TWIST! Actually to be honest I'm dating this review as my most apathetic review ever! Every reviewer has to have an apathetic review to be known as a true critic. So this will be my first. Which means I can't be assed to write any further. So...\\n\\n\r\nENJOYMENT: 7\\n\r\nI enjoyed it yet wished it was done better.\\n\\n\r\nOVERALL: 7 \\n\r\nWatch it if you are bored and want a neat little anime to watch but get an ending that makes you wish you were watching Clannad instead. Or skip it and watch something funny instead like Kore wa Zombie Desu ka? to make you hurt with laughter. That upcoming review will actually be my most put in effort review ever. So it will be like 4-6hours of thought put into it. As for this one this only took me an hour and a half to write so feel free to put it down.\\n\r\nAs for the feedback IDGAF. I'm too lazy to continue on with the review as most people are going to say I didn't even help them anyways. So that discourages me to even make this review any better. Feel free to also leave a comment on my profile insulting me on how I wasted your time also. KTHXBAI! \\n\\n",
            "date": "2012-05-17T12:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 61389,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474449.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Golden_Darknezz",
                "username": "Golden_Darknezz"
            },
            "url": "https://myanimelist.net/reviews.php?id=61389"
        },
        {
            "content": "The story is not bad its not good in some point, its just that i realy dont like anime that has a ending that the main characters need to die it just suck. In the world is full of horrible things in the point the people are dieing any where in the world , whats the point of making anime that show a sad ending. I realy don't understand this........... \r\nBut still I need to be fair I like the character and everything else in the anime I just hate the ending",
            "date": "2007-12-16T00:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 1595,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Signal",
                "username": "Signal"
            },
            "url": "https://myanimelist.net/reviews.php?id=1595"
        }
    ]
]