[
    [
        {
            "content": "Seriously, is  it that bad to find this show entertaining? One can argue this is a typical slice of life, school, harem anime with typical character types and predictable story and you would not be far off. But, if you don't LIKE watching things like this, why are you watching it in the first place? Akane-iro is geared to the 'veteran' otaku who love specific voice actors or character types, or enjoy when different flags get triggered (like hot springs, school festivals, or costume changes) aka: fanservice. You can only watch so many different slice of life harem comedy titles to realize if youlike this particular genre or not. This genre lends itself to a lot of off the wall stories and anyone expecting something \"realistic\" will realize a true \"anime\" (aka normal anime) is not realistic at all. Which is why certain things feel obvious after you watch title after title. Why do you think there are 1000's of anime titles, but only about a few dozen genres. As for me I am a fan (not a raging fan mind you) of these types of anime. I am pretty sure I am not the only one in the world that found this entertaining for what its worth. \\n\\n\r\nJust like in life, if you expect one thing and get something else, you're bound to be disappointed. Watching this with an open mind, you will realize that Akane-Iro ni Somaru Saka is actually a very entertaining and funny anime. Like most slice of life school comedy harems, a premise is presented at the beginning of the show, which is usually far fetched but bound for some form of entertainment. If you read the anime summary you'll get the gist, but it does generate enough laughs and surprises to keep you entertained for 12 episodes. An amazing feat that many fail to miss is that 8 of the 10 characters get relatively large amounts of airtime for every episode. With that, the story seems to progress relatively quick and seamless. Sometimes you won't realize the episode is over before you know it. \\n\\n\r\nA big reason you get sucked into this anime are the character-types and voice actors lined up for this show. Alot of A-list seiyuu like Rie Kugimiya, Aya Hirano, and Wataru Hatano, headline the cast of characters. Big fan's of seiyuu like these, will be surprised at how well they lend their voices to these characters. Its inevitable that one will grow attached to one or some (all?) of these characters. Yeah yeah, you've seen these character types everywhere else, who the hell cares? The whole point of having these character types is to have a great chemistry between all the characters and this exceeded my expectations with flying colors (whatever that means). Fang-tan, ahoge-san, and company are all there, the comedy is pretty good and and the drama is just as good as well. The drama doesn't show itself too much to get in the way of the comedy aspect of this series but it is a warm welcome from the 'incomplete' dramas like the ones that never come to fruition (Honey and Clover, 5cm/s, etc). Characters progress perfectly fine in this story. You'll feel happy for some and sad for others, that is the nature of drama. In other titles that may get annoying but its perfectly fine in this series. One other thing that I highly enjoyed about this series is that the main character in the center of the harem, Junichi Nagase, was actually not a bad guy. Sure he might have his moments, but overall he was very outgoing and more \"realistic\" compared to most other male harem leads. Even the scenes when he's battling his conscience were especially funny.  \\n\\n\r\nThe production value is actually very high compared to your typical anime. The art design hardly ever faltered and never felt like a rushed product. Some people might be put off by the floating hairstyle of some of the girls, but I didn't mind it one bit. The details they put in to all the characters including the background characters is something to be commended. Every scene is filled with either characters or static objects. What does that even mean? That means when there isn't a close up of characters talking to each other, theres usually a large amount of detail to panning or zoomed out shots. Passed out cooks in a kitchen, well placed furniture in Minato's room, or Nagomi''s computer setup are good examples that show enough detail to keep every scene busy and with some depth. The art is far form being perfect but for what its worth, it more than does the job. On top of the great voice acting and art direction, they even have character music cd's available for each character and even give previews of their songs in the form of a new ending song for each episode. Sure it may be a gimmick, but you can't deny how great they can sing and how they managed to conjure up a few dozen songs just for this show. There are also a few drama cd's to supplement your fix of akane-iro after you're done with the series. It seems like the producers thought of everything short of a video game for this show.\\n\\n\r\nI never felt this was a waste of my time or got annoyed by the characters. Actually this is one of the more complete cast of characters that I have seen (out of 400 titles). I don't think I need to mention Code Geass, Hayate, TTGL, and Death Note but I will anyway since most of those characters made me rage at how many of them left many cliffhangers or a feeling of \"needing something\". Despite being a typical harem comedy anime, it's the small things that kept me wanting to watch more. The segments of Junichi's conscience and the analogy between Junichi's parents and the gang's current situation were pretty funny imo.\\n\\n\r\nAs far as slice of life/harem/comedies go this is easily one of the better ones. Its compete in almost every way. Great character chemistry and seiyuu Amazing amount of detail (down to the nipple, har). All crammed in a 12 episode package. What is not to like? If you don't like harem comedy this will obviously become fodder for low scoring. Especially for the fools who try to find seriousness in comedy... THEY WILL LOSE THE GAME.\\n\\n\r\nHell, hearing Rie Kugimiya say \"Stop licking already and eat me\" is well worth the price of admission. \\n\\n\r\nOne of the best lines is uttered in this anime too: \"If you want to dream, go dream while you're sleeping\" Priceless.",
            "date": "2010-04-24T00:55:00+00:00",
            "helpful_count": 252,
            "mal_id": 25383,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=25383"
        },
        {
            "content": "Akane-iro ni Somaru Saka is an anime that hurts itself by raising expectations and failing to meet them like clockwork. It goes out of its way to repeatedly build from mediocrity only to plunge itself back down to the point where you wonder why you even gave it much of a chance. It's someone jumping out of a 3 story building and landing on concrete, only to climb back up and jump over and over again. Until the person's bones are mush and the series limps to its god-awful ending.\r\nAs a series in general, Akane-iro ni Somaru Saka (from here on, Akasaka) is passable, Iwould go as far to say it's decent and occasionally enjoyable. Its gaping flaws are grossly magnified, rightly, by its constant, flagrant disappointment of its viewers. Basically Akasaka is not pure bad (far from it) but the parts that are actually good makes the parts that are bad look really bad. \\n\\n\r\nAkasaka is based off Feng's visual novel released back in 2007. The plot revolves around a boy by the name of Jun'ichi Nagase, who attends a prestigious high school and seems to bear some kind of tough reputation from middle school. Think typical harem school comedy male protagonist. There, I just developed the character to the same degree 12 episodes of Akasaka did. Anyhow, a naive aloof rich girl, Katagiri Yuuhi (CV: Kugimiya Rie), transfers to Jun'ichi's school and Jun'ichi, out of some act of divine inspiration kisses her, causing unspeakable chaos. Then, to close out a rather promising first episode and establish a quite original premise, it turns out that Yuuhi is Junichi's fiancee due to an arranged marriage.\\n\\n\r\nAkasaka's female cast is chock full eye-catching and potentially interesting characters. Expectations: high. The series proceeds to do nothing with all but two of the girls. Expectations: failed. \\n\\n\r\nLike many similar anime, Akasaka's plot (the plot is essentially just the premise) takes a back seat episodes 3-10 for some good unrelated episodes of fun. That's fine! It's a structure that has worked countless times. And by all means it can work here. But instead, Akasaka is filled extremely cliche situations solved in extremely cliche ways. For example, Jun'ichi's sister Minato (CV: Hirano Aya) takes Yuuhi shopping in a supermarket to make dinner. Six minutes of pointless dialogue about how amazed Yuuhi is of instant curry follows. We get it after the first few lines! Yuuhi talks about how she eats at home as Kugimiya Rie butchers French Japanese transliteration. She's rich, naive, aloof, we get that. Is it supposed to be funny that Yuuhi doesn't know about instant curry and thinks that her cooks and servants don't either? How overblown does the reaction and enlightenment need to be? There are lots of girls in this anime, some who look pretty interesting. Are we going to get episodes about them? With curry? That actually would be pretty awesome...\\n\\n\r\nWatching anime should never be physically painful, but that's what I felt as this series slowly killed itself. It's the pain you feel a promising show wastes all the good things it had going for it and falls into mediocrity. Akasaka occasionally strikes silver (no gold in this show, sorry) with a few lines of interesting dialogue and good animation, but after every good or decent episode or plot development the series feels as if it has some obligation to make up for it by spewing crap at our face. It's like you're at an amusement park and every time you have some fun, a burly security guard has to give you a swift punch in the gut. The ending begins suddenly in the last 3 episodes and was likewise promising. Too bad the conclusion of the series was so predictable that I might as well have drawn the storyboards myself and the things that you didn't predict either have no relevance to the plot or are so cheesy and/or wrong you're better off not predicting it. \\n\\n\r\nI'm a little harsh on this series because it really is a shame. Akasaka goes to show you how bad writing can absolutely destroy a series with everything else going for it. The art is good, the characters and landscapes are well drawn and fun to look at. Akasaka has a voice acting cast that would remind you of the New York Yankees, with the resulting mediocrity to match. When we have Kugimiya Rie (Shana, Louise, Taiga), Inoue Marina (Chiri from Zetsubou Sensei, Yoko from TTGL), Aya Hirano (Haruhi, Konata, Misa from Death Note) and Tanaka Rie (Chi from Chobits, Sugintou) in the same anime, we're going to be excited. I had my eye on this series ever since voice actors were announced and some art was available. \\n\\n\r\nIn the end, the voice acting was pretty good but by itself it cannot save a series. The music (besides the terrible OP) is good. It better be good when you have five voice actors with best selling seiyuu albums on your staff. Should there be an OVA about the supporting characters I would most likely flock to it with expectations held high. I've heard that the game this is based off was really cool. Too bad I can't say the same for the anime adaptation.",
            "date": "2008-12-29T13:53:00+00:00",
            "helpful_count": 193,
            "mal_id": 10780,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/10543.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/kevo",
                "username": "kevo"
            },
            "url": "https://myanimelist.net/reviews.php?id=10780"
        },
        {
            "content": "There are some shows that really have no business being bad.  Akane-iro ni Somaru Saka is one of those.  When you look at the talent gathered for this series it practically reads as a who’s who of seiyuu talent.  Unfortunately it is that talent that is one of the few bright spots in what is otherwise a pretty dismal series.\r\nThe story unfolds as your standard harem anime.  I always find some of the ridiculous situations these writers come up with quite hilarious.  A spoiled rich girl ends up living with a pair of siblings (not related by blood of course,more on that later) who just happen to not have any parents around because they are busy being John Steed and Emma Peel.  Of course our rich girl, Yuuhi Katagiri hates our hero Junichi but announces anyway that they are now fiancées.  I wonder if this kind of stuff really happens in Japan, because it happens an awful damn lot in anime and manga.  So despite me really wanting to like this at the beginning, this show has managed to get itself off to a bad start with me.\\n\\n\r\nHowever I did start to become pleasantly surprised as the story unfolded.  Slowly we are treated to a pretty sweet little romance as Yuuhi and Junichi develop feelings for one another, confess and start down a path I felt was leading to a lovely romantic ending.  That’s when they screwed it all up to hell.  It’s going to be damn hard for me to express my disappointment with the turn this show made about halfway through without giving away too many spoilers.  But it involves the ultra moe sister Minato and Japan's obsession with incestuous relationships involving close family members.  Yes the anime does take great pains to point out that Minato and Junichi are not biological siblings.  That’s not the point; your blood isn’t the only thing that makes you family.  If you’re raised as brother/sister you're brother/sister, regardless of what your birth certificate says.  In no way should siblings who know they are siblings be romantic interests.  Even though this is a harem romance with many possible choices for the lead to make it very clearly becomes a choice between Minato and Yuuhi.  It’s creepy, disturbing, and completely disgusting.\\n\\n\r\nAs characters, there is nothing particularly interesting about the three leads.  If you have one harem you’ve seen this one.  I only found the mains compelling for about the first half of the series before Minato became a love interest.  I did find most of them likable in the beginning just not original or inspiring.  The supporting cast has little to recommend either and is largely just background scenery.  Probably the silliest characters of all are Minato and Junichi's parents as their various spy stories are told throughout the series.  These have nothing to do with the main plot and feel totally out of place and stupid.  I think it was supposed to be clever and witty.  Fail.\\n\\n\r\nAs I mentioned, Akane-iro does a great job with its voice cast and music.  We are treated to quite a bit of songs, as there are a lot of ending themes sung by almost all of the seiyuu who do singing work.  It’s a shame that the story and dialogue were not on par with their talent.  I am not a huge fan of the art though.  It reminds me a lot of CLAMP, tall way to thin characters that are just too \"beautiful\".  Big eyes, cutesy hair accessories, and gravity defying bosoms and boys who could easily double as girls if you have those boobs and skirts dominate.\\n\\n\r\nIn the end this series was a prime example of how to waste great acting talent with a clichéd story, lackluster production values, and creepy plot elements.  Giving it a 6 is probably generous to how disappointing I found this series as a whole, but I really did enjoy the first half of this anime a lot.  If you simply must see every harem romance out there and are not bothered by incest then by all means watch this.  Everyone else should just steer clear and avoid the disappointment.\\n",
            "date": "2009-05-26T03:41:00+00:00",
            "helpful_count": 142,
            "mal_id": 15284,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=15284"
        },
        {
            "content": "[THIS REVIEW CONTAINS SPOILERS]\r\n(At Studio TNK)\r\nDirector [clapping his hands]: Okay, people. The next anime we're going to produce is Akane-iro ni somaru saka. Now, before we start production, I want everyone to play the visual novel and list out every event and trope that you believe should be included into the anime version. You have one week to complete this game.\r\n[One Week Later]\r\nDirector [looking around the room]: Alright. I want everyone to hand in their lists. [Everyone begins to pass their list to the director.] Okay, thank you. Now, here’s what will happen. A few assistants and I will now tally up the tropes thatshould be included into the anime version. The tropes with the most tallies will be included into the series. Only the top 20 tropes will be included. Thank you, we will see you in a few hours.\\n\\n\r\n[Several Hours Later]\\n\\n\r\nDirector [clearing his throat]: After, tallying the results, we have found 20 tropes that everyone in this room can agree with. Here are the tropes:\\n\\n\r\n– Bland and Boring Protagonist.\\n\r\n– Your Soon-to-Become-Fiance Living at the Protagonist’s House.\\n\r\n– Younger Sister in Love with Protagonist.\\n\r\n– Childhood Friend in Love with Protagonist.\\n\r\n– Rich Ojou-Sama in love with Protagonist.\\n\r\n– Best Friend Helping the Protagonist.\\n\r\n– The Student Council Involved with Protagonist.\\n\r\n– Violent Tsundere Character abusing the Protagonist.\\n\r\n– Dinner Involving Curry and Rice.\\n\r\n– Supernatural Events.\\n\r\n– Typical ‘Test of Courage’ Event.\\n\r\n– 'Resisting the Urge to Look at Naked Girls’ Event\\n\r\n– Random Mechs and Action Scenes.\\n\r\n– Lots of Fanservice (i.e. swimsuits, boobs, underwear).\\n\r\n– Home Sick Event.\\n\r\n– Hidden Porn Magazines.\\n\r\n– Cultural Festivals.\\n\r\n– Maid Cafe.\\n\r\n– Mountain Resort with Hot Spring.\\n\r\n– Incest Ending.\\n\\n\r\nDirector: I want all these events and tropes into this anime series. Next, I want the tsundere character, Yuuhi Katagiri, to be voiced by Rie Rugimiya. Also known as the ‘Queen of Tsundere’. \\n\\n\r\n[The Head Producer looks at him with an unsurprised face.]\\n\\n\r\nDirector: Don't look at me like that. I mean, come on, Yuuhi Katagiri is rude, abusive, and not very honest with her feelings. The only seiyuu that performs tsundere characters perfectly is Rie Rugimiya. Then, I want Aya Hirano to be on board, as she's a famous seiyuu with high credibility and does excellent voice overs for both soft-spoken and loud-spoken characters. In this case, she will play as the soft-spoken character Minato Nagase with special hidden abilities and talents.\\n\\n\r\nHead Producer [raising his hand]: What about animation and story?\\n\\n\r\nDirector [thinking]: Have little background details as possible, mainly focus on the school, Nagase's home, and lots of random scenes with snow. Next, have minimal facial details for each character, make them almost similar to each other. Keep it simple. Then, I want each of the girls to have a different hair-style with bright hair colors, mostly brown, pink, yellow, gray, etc. But, lastly, I want every character to produce an exaggerated expression for every action. \\n\\n\r\nDirector [taking a deep breath]: Now, for the story, I want it to be simple. Nothing too complex or deep, make it sightly predictable, except towards the end. I wants lots of random filler episodes in the middle and then, add many main story points towards the end. Keep the dialogue and interactions simple, mainly discussing about food, love, and reasons for why all the girls love the protagonist. Finally, add some stupid comedy that might or might not make the viewers laugh and then, add many random supernatural events to which there is have no reasonable explanation.\\n\\n\r\nHead Producer [looking shocked]: If that is what you want, then I’ll do it. \\n\\n\r\n[He stands up and heads towards the door with everyone else. Suddenly, the director stops him.]\\n\\n\r\nDirector: I forgot to say. Keep it to only one season, no sequels.  And have one OVA, which is mainly filled with fanservice material, so we can pander to the fans.\\n\\n\r\nHead Producer [looking relief]: Now, that is what I want to hear. I’ll get to work, right away.\\n\\n\\n",
            "date": "2015-06-16T08:15:00+00:00",
            "helpful_count": 89,
            "mal_id": 190410,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4408661.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Blood_Diver_A",
                "username": "Blood_Diver_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=190410"
        },
        {
            "content": "Watching Akane-iro is akin to dating the hot blond in class, only to find out that the most exciting conversation they can field is who Britanny Spears will date next.\r\nAkane-iro certainly had potential. Attractive character designs, famous voice actors, a decent sound track. \r\nSure, like the desire to go out with blond bombshell, the story of a girl forced to move into the house of his future fiancee... who *happens* to be a your average anime guy who just also* happens* to have a hot sister is not exactly original. But you think\r\n\"Hey, the voice actors and animations are good, and such stories, no matterhow cliched, can be fun.&quot;\\n\\n\r\nToo bad that after a few dates (episodes), the shallowness of series reigns supreme. Spas, School Festivals, Guy and girl landing in awkward positions... they're all here. While any anime featuring an over abundance of such scenes will not be a masterpiece, some can execute them well enough to at be pretty good.\\n\\n\r\nUnfortunately, Akane-iro fails more than it succeeds, each filler episode is a cliches of cliches, with as much unexpected events and funny moments as watching your cat drink a bowl of milk. The visuals are cute, but nothing's going to make you stare at for 30 minutes straight.\\n\\n\r\nAre there any redeeming qualities for Akane-iro?  It may be worth watching for the few scattered non-filler episodes that are surprisingly good (Episode 5 and 11  on their own would score a 9), but these only serve to highlight how abysmal most of the filler episodes are , (say 4, 6 and 7), which land firmly in the 4 - 6 category. \\n\\n\r\nAkane-iro's deserves only to run as a small window at the bottom corner of your screen, whose only purpose to provide a minor distraction as you try to finish that blasted assignment.\\n",
            "date": "2008-11-23T06:32:00+00:00",
            "helpful_count": 69,
            "mal_id": 9776,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101649.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ceptryn",
                "username": "Ceptryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=9776"
        },
        {
            "content": "Akane-iro ni Somaru Saka is a Romantic, Comedy like any other. That’s pretty much all there is to describe this mediocre anime series and if that doesn’t satisfy your information needs then by all means continue with this review.\r\n“Seen it, been there, done that…” Those are the thoughts that came to mind whilst I watched the first episode. It starts of ordinary enough when some posh girl (Yuuhi) is helped out by some guy (Junichi), who’s pretty well-known for some stupid rumour. Well at the beginning of the new school semester it comes to no surprise that said girl transfers to Junichi’s school and thusbegins their rocky relationship. Now I’ve got to say the end of the 1st episode was pretty funny because it was rather unexpected but after that brief moment this anime soon reminds us that sticking with the norm isn’t always the best choice. Here we have a barrage of anime tropes & clichés however I think this anime goes out of its way to contain every single romantic comedy cliché imaginable, including the arranged engagement between Yuuhi & Junichi and the two living together.\\n\\n\r\nFor the most part it is a series of random misadventures ranging from stuff like the old abandon school expeditions and even these mundane moments could have been more interesting if the characters weren’t so ordinary. There are a whole bunch of characters here, like the typical nurturing sister whose name I forget but the only ones worth mentioning are the main pair Junichi & Yuuhi. Like a lot of people I absolutely hate the loser type protagonist that appear in the romance genre, which is why I should like Junichi for not falling into the category but sadly apart from some amusing moments I just can’t seem to get used to this guy who always seems to have a chip on is shoulder. It doesn’t help when there’s a heroine like Yuuhi, where you just have to think of her as an older version of Nagi (Hayate no Gotoku!).\\n\\n\r\nWell it’s no surprise that Nagi comes to mind as they both share the same voice actor and there are also other similar voices to be found here, seeing how this anime has a lot of well-known VAs and sadly that’s what stands out and not the music or the cheesy SFX. The animation on the other hand just doesn’t stand out at all. With a very similar look to anime such as; H20 & School Days, the only feature that seems to stand out are the girl’s exaggerated hair that no one could find appealing.\\n\\n\r\nOverall Akane-iro ni Somaru Saka actually had a decent romance going on at some points but the random misadventure only proved to be a great annoyance to the story & the romance’s progression. Stuff that’s supposed to be funny just wasn’t but at least there are a few random things to chuckle at. In the end I was driven to despair, because this anime actually had some potential but did its best to ruin it every step of the way.",
            "date": "2009-01-17T12:35:00+00:00",
            "helpful_count": 37,
            "mal_id": 11619,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=11619"
        },
        {
            "content": "Well... honestly, I don't know why I enjoyed watching Akane-iro ni Somaru Saka like I did, but here I am. I didn't take it seriously, though, for it was impossible to take it seriously. While I was watching it I was really just making fun of it most of the time. Why, you might ask? Well&hellip; it was just so darn stupid. Clich&eacute;d. Annoying. You get the picture.\r\nThe story centers around a seemingly normal guy named Junichi, who rescues a tempered girl named Yuuhi (what is up with that girl&rsquo;s hair?) from some guys who were trying to pick her up (oh wow, an exampleof pure originality right there&hellip; not), and after misunderstandings arise and a first kiss ensues, it turns out that Yuuhi just happens to be Junichi&rsquo;s fianc&eacute;e. So she lives with him in his house under conditions of her father to see if he is a suitable fianc&eacute;, along with Junichi&rsquo;s well-endowed sister Minato, etc, etc, etc. Now, this story has some potential&hellip; sort of. But the episodes were filled with so many clich&eacute;d moments it was just&hellip; bad. You know those moments, the romantic kind maybe where someone &ldquo;accidentally gropes the girl&rsquo;s breast&rdquo; or someone &ldquo;accidentally falls on top of the other person&rdquo;. The typical &ldquo;filler type episodes&rdquo; are there too, such as a trip to the onsen or the &ldquo;school festival episode&rdquo;. These type of things can actually be fun to watch, for though they&rsquo;re repeated, they&rsquo;re repeated for the reason that they can bring enjoyment to an audience. However, in Akane-iro, it wasn&rsquo;t funny or interesting or really&hellip;anything.\\n\\n\r\nNow for characters. I am sorry to say there is not one character in this cast that I actually like. I don&rsquo;t know why exactly, but none of the characters are likeable. None of them are original, though Junichi is a different protagonist than the general guy caught up in a harem of this sort. As the series progresses, you are supposed to either side with Yuuhi or side with Minato. This would make sense, typical love triangle. There is one tiny problem though&hellip; Minato is Junichi&rsquo;s younger sister. Meaning, incest themes abound! For a while I&rsquo;d thought that Minato was adopted, but I wasn&rsquo;t sure if it was ever fully explained&hellip; so that was pretty stupid. I might have missed something though because sometimes I didn't pay attention. Go watch it yourself and see. Anyway, Yuuhi is the typical tsundere type, which I either really like or just am annoyed by completely. Unfortunately the latter won out the former on that one. Minato is more of a sweet, intelligent, and good at housekeeping type of girl, which also annoys me. Junichi&rsquo;s friends, the minor characters, were okay, like Fuyuhiko and Tsukasa. The student body president amazed me with her absolutely insane hair. Forget the comment about Yuuhi&rsquo;s hairstyle, just look at Mitsuki Siina! Seriously, how does she do it? Does she get up at 3 AM and just slap on the hairspray?\\n\\n\r\nAnyway. Moving onto sound, which is the reason I actually started watching this show. I came across it randomly from what I saw a friend was watching and I decided to watch it not only because it was on a whim but because of the popular voice actresses in this series, like Rie Kugimiya, Aya Hirano, Emiri Katou, and Inoue Marina. They all did a good job, all the voices fit their characters. But for some reason, I just could not stand Junichi&rsquo;s voice at all. I&rsquo;m not sure why&hellip; I guess I just didn&rsquo;t like it. The music didn&rsquo;t stand out much, and I don&rsquo;t really like the opening theme at all, though it could get in your head (regrettably so). I never much paid attention to the many ending themes. They were sung by the various voice actresses I believe.\\n\\n\r\nThe animation&hellip;it&rsquo;s okay, but it&rsquo;s not that good. Movements are generally stiff, the anatomy often looks wrong with people out of proportion. It&rsquo;s not fluid and it has no flair. It&rsquo;s nice enough to look at, I suppose.\\n\\n\r\nI was going to give this a 5&hellip; but I suppose I shall give it a 6, for I did like watching it most of the time, even though I thought it was terrible.\\n\r\n: D",
            "date": "2008-12-20T14:04:00+00:00",
            "helpful_count": 28,
            "mal_id": 10520,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21061.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/maybelletea",
                "username": "maybelletea"
            },
            "url": "https://myanimelist.net/reviews.php?id=10520"
        },
        {
            "content": "Akane-Iro ni Somaru Saka is the newest eroge adaptation by TNK, which are more famous for their work in School Days. Oh, another eroge made into an anime...inb4lameharemrite? Thats probably one of the first thoughts what will cross your mind when approaching this title, and to be honest you are not that wrong. If you cannot handle these times of anime, then you might as well give this a pass.\r\nStory: The story is nothing out of the ordinary for this anime, it follows a lot of cliches many animes have done in the past for this genre. The main heroine Katagiri Yuuhi, gets into troublewith some strangers, and gets rescued by the main lead Nagase Junichi. After a series of misunderstandings we learn that Yuuhi is Junichi's fiancee as decided by their parents. And now they must learn to get along while Yuuhi lives with Junichi and his sister Minato.\\n\\n\r\nArt: In terms of art this showed a lot of promise. With interesting and beautiful character designs that look perfect as long as they are still shots, because unfortunately throughout the series there were times where the animators got sloppy and the characters looked distorted and sometimes plain ugly.\\n\\n\r\nSound: In terms of sound, this is probably where most of the people will get drawn into the show. The voice cast of this anime is just something to make your jaw drop, we have top quality voicing from Kugimiya Rie, Hirano Aya, Hirohashi Ryou, Tanake Rie, Katou Emiri, Inoue Marina, and more playing major roles in this show. And they all portray their characters very well as expected by such good seiyuus. On voice cast alone the sound part would get 10/10 but VA is not all there is to an anime. The actual music used for the anime is rather simple and none really stand out much. So 8/10 is a fair score to give this show.\\n\\n\r\nCharacter: This is probably both the best and worst part of the anime. The characters are diverse and interesting, and you feel like you wanna learn more about all of them. However the anime only focus on the main heroine Yuuhi most of the time leaving the rest of the cast in the shadows. And then the anime proceeds to throwing away all effort they put in character development with a very disappointing ending. It feels like the anime wasted a great cast of characters.\\n\\n\r\nEnjoyment: I would be lying if I said I didnt enjoy the show somehow. It certainly wasnt that great of an anime, but it had its moments where I honestly had fun watching it. It depends on your tolerance with these types of animes.\\n\\n\r\nOverall: The show was nothing out of the ordinary. A lot of stereotypes and pretty terrible writting and producing turned this anime from something that had a lot of potential into something mediocre with not much to remember. It feels like this show could've been much more that it ended up being, and its a shame that wasnt the case. If you are looking for something that is different from the rest of the shows out there, this show is not for you. If you are looking for a show to waste some time, then by all means go ahead and give this anime a try.",
            "date": "2008-11-03T10:53:00+00:00",
            "helpful_count": 27,
            "mal_id": 9210,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/23773.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/game8910",
                "username": "game8910"
            },
            "url": "https://myanimelist.net/reviews.php?id=9210"
        },
        {
            "content": "Akane-iro ni Somaru Saka is pretty much your basic \"harem anime, \" and I have to say that it stays pretty tried and true with its formula.\r\nIt starts off with Junichi (main male lead) meeting this mysterious rich female transfer student (Yuuhi) who has been forced to marry him by her dad. This happens early on and you would expect the rest of the anime to have them slowly grow close to each other, but oddly enough it doesn&rsquo;t really do that, even though they are the main couple of the title. For most of the anime it seems to have Junichi and his friendssimply messing around having fun, from having parties on a boat, to school festivals and the like. Now I realize that with a title that has &quot;slice of life&quot; elements to it, this would be a standard formula for them to use. The only problem is they tended to stick so much to the gang just having fun, that I honestly forgot that Junichi and Yuuhi were even suppose to get together. There is even talk at the beginning that Junichi has some weird alternate personality to him, (which he does) and at that point I was expecting it to play some sort of key role in things, but again it doesn&rsquo;t really do that. In fact from what I remember counting, he only shows it about 3 times during the series. And even at the end of the anime I am not quite sure just what kind of &quot;major&quot; role it played in things, as it seems they could have removed it completely from the story and it wouldn&rsquo;t have mattered. Now things do start to pick up &quot;romance wise&quot; in the title, but that doesn&rsquo;t happen until around the last three episodes. When I say that this is a harem title that is a bit of a stretch, because out of the nine girls only three actually like him, and one of them it doesn&rsquo;t really even go past words. Now I have to give credit to them on the ending, I certainly wasn&rsquo;t expecting it to end the way it did when I first started watching this, and it sure was a different kind than most viewers will be expecting too. Plus it actual does conclude and he ends up together with one of the girls, so that&rsquo;s a big plus. So you don&rsquo;t have to worry about investing your time in this only for it to end without any kind of resolve. Even though this title does have some echhi-ness factors, it doesn&rsquo;t really go too deep into it. You may see a casual panty shot about three times in it, but most of it comes in the form of cleavage shots, and even that isn&rsquo;t really shown off too much. There is one episode where they visit a hot spring (or take a bath in general), but the steam censors it, at least the version I watched did. So anyway, because it doesn&rsquo;t really focus on the romance for a good portion of the show, you kind of have to take the enjoyment on an &quot;episode by episode&quot; case. There is some decent humor in this, but I don't think it will be enough to keep you into it. There is a small plot going on about what Junichi actually is, it can get interesting at times as more hints are given out as the story progresses...even if its not really well explained at the end.\\n\\n\r\nThe animation was good in this, while nobody ever really moved around enough to get a true judging on the whole &quot;fluidity&quot; aspects of it, the characters did come off with a certain charm to them. And I have to say that some of the hairstyles on the women were kind of bizarre--yet oddly charming. You get a lot of sunset scene here and it looks good enough to at least make you take notice of it. But the character design is probably the best thing regarding the art, while they weren&rsquo;t really drawn highly detailed, they did have appealing qualities such as (again) the hairstyles, expressions, and the clothing that they wear. The backgrounds never really stand out though, they are not drawn badly by any means, but not detailed enough to really take notice of them. Which in turn could be either a good or bad thing, because it makes you stay focused on the characters themselves.\\n\\n\r\nThe opening and closing theme were pretty nice, they both contained a bit of a happy--yet sincerity style to them. For some reason the opening makes me kind of sad, not because its bad, but just the way the music is displayed. Now I have to talk about my favorite aspect of this anime, and that was the voice acting! I won&rsquo;t go as far to say that it was spectacular or anything, but I did feel that each characters voice matched beautifully with the characters. Especially with a female named Minato, she had that kind of &quot;nice girl&quot; personality to her, and her voice actress complimented that very well for her. Nothing really worth mentioning about the background tracks, nothing there is particularly memorable, in fact even now I can&rsquo;t really remember much of it.\\n\\n\r\nThere are over twelve characters in this anime, but unfortunately you only get actual character development with three of them. Even to this day I am still unsure as to who some of the supporting cast members actually were, due to the fact that some would only show up every now and then as the story progressed. Nobody should ever really come off as annoying to the audience, though some people may be turned off with Junichi. Because despite his whole &quot;double personality&quot; ordeal, he doesn&rsquo;t really have much of an impacting persona, and seems to just kind of, well...be there.\\n\\n\r\nSo in conclusion, Akane-iro ni Somaru Saka isn&rsquo;t the worst of the harem titles out there, it really isn&rsquo;t even a bad anime in general, the story is what really brings this title down. Though I did end up finishing this, only because I don't like to drop something when I am well into it already. (again you can't anticipate any of the overall story since it doesn't really build much up, you just have to enjoy each episode as it happens if at all possible) If you&rsquo;re a hardcore harem fan and want something that is unique to the genera, then you probably should just look elsewhere, because this one is pretty standard fare. But if you&rsquo;re looking to maybe get into the genera, or are willing to go in with lower expectations, then I think you should be fine.\\n\\n\r\n&quot;Akane-iro ni Somaru Saka&quot; gets 5 censored bath scenes, out of 10!",
            "date": "2008-12-29T13:17:00+00:00",
            "helpful_count": 21,
            "mal_id": 10778,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70369.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Retro8bit",
                "username": "Retro8bit"
            },
            "url": "https://myanimelist.net/reviews.php?id=10778"
        },
        {
            "content": "Akane-iro was something i found hard to keep watching but i always complete what i start so i had to go thru it.\r\nStory\r\nWhen i watch ecchi/harem anime, i watch to enjoy them visually like almost everyone that watches this genre and not for the story 'cause who in their sane mind would watch ecchi/harem for the story? nobody, unless is something great like Golden Boy, but that doesn't mean mediocrity is acceptable when watching these genres, character development is just as important as the visuals in which both this anime fails, the story is mediocre, there's noting much to say other than the Main dudeJunichi meets a girl who didn't know he was going to marry and because he kissed her by ''accident'' (usually bad plot device), she now hates him for that and not because she has to marry him, that schtick goes on for 11 episodes and the ending to that annoying dynamic is bad.\\n\\n\r\nArt & Animation\\n\r\nThe art was fine, there are better works out there but for an ecchi anime it should be better.\\n\\n\r\nSound\\n\r\nThe voice acting wasn't amazing, looking at who the seiyuus are it should have been great but it was just fine.\\n\\n\r\nCharacter\\n\r\nThey were mediocre even with that VA cast that couldn't make them likeable, they stay the same all the time, annoying characters.\\n\\n\r\nEnjoyment\\n\r\nThere was not much to enjoy more than the ok sound and animation which is important in an ecchi anime along with the characters but these characters were mediocre, the OP is bad and the ED song of Ep. 10 was good, but in general this was hard to watch.",
            "date": "2015-08-05T15:57:00+00:00",
            "helpful_count": 17,
            "mal_id": 195263,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195263"
        },
        {
            "content": "*Contains major spoilers\r\nFirst time I get to see a VN based anime, so I didn't know exactly what to expect from it, also because the game is an eroge... I guess it was good enough afterall, but all this fixation about \"imouto fantasies\" and incest, that japanese have, is really weird... I think it's ok this time, because everything got explained in the end...\r\n{STORY - 5/10}\r\nJun'ichi was a real badass on Junior High and even got the \"Geno Killer\" nickname. Despite not fighting anymore, he was able to save Yuhii on the first episode without lifting a finger, people were affraid... She got transferred tothe same school next day and, soon enough, a relationship would be born between those two.\\n\\n\r\nThanks to an unexpected act from Jun'ichi, Yuhii begins to hate him. However, living under the same roof would boost their connection and improve their relationship. Like any other tsundere character, Yuhii slowly starts to show her feelings, as she gets closer to Jun'ichi. Problem is that his sister, Minato, would play this game too later on.\\n\\n\r\nSidestory from Jun'ichi's parents isn't an essential part, but pieces from it are featured on every episode, since they're key characters for this plot. His second encounter with Yuhii was something decided between both Katagiri and Nagase families, so they're important.\\n\\n\r\n{ART - 4/10}\\n\\n\r\nNothing really special about it. Actually, is pretty basic and dull, since it isn't filled with action nor features great battles and everything. Like most VNs, eyed are bigger than usual and clothing styles are very common. Overally, basic.\\n\\n\r\n{SOUND - 3/10}\\n\\n\r\nOP song is cheering, but is also annoying. There are several ED songs, with just one main theme. Most of them are better than the intro's one and they share the same genre.\\n\\n\r\n{CHARACTERS - 4/10}\\n\\n\r\nWe have Jun'ichi as main male protagonist, that suffers from an identity crysis and is very indecise, unable to choose what he really wants. He may look strong willed, but that's just a cover to his fear of being alone. Minato is sweet and always smiling. She hides her real affection from Jun'ichi because they're siblings. Yuhii is the typical tsundere, nervous and cold, still, able to show deep love after some time. Her hatred for Jun'ichi decreases as he gets serious about their relationship.\\n\\n\r\nOther characters include weird Nagomi, who hides a dark scheme under her sleeve, and both Fuyuhiko and Sugishita, that seem to like Jun'ichi more than usual. Actually, that's just a way to provocate him...\\n\\n\r\n{ENJOYMENT - 10/10}\\n\\n\r\nIt's a pretty funny anime actually. Nothing amazing about it, but I was able to have a good time, and that's all that matters to me. Maximum enjoyment!\\n\\n\r\n{OVERALL - 4/10}\\n\\n\r\nChoosing between two girls, one of them being your little sister. Jun'ichi has to act like a man and say what he really feels, despite all the negative circunstances. Will he run away from destiny his entire life? Or take a mature decision and be with the person he loves?",
            "date": "2013-10-31T05:46:00+00:00",
            "helpful_count": 12,
            "mal_id": 118845,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 10,
                    "overall": 4,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=118845"
        },
        {
            "content": "Akane-iro ni Somaru Saka has potential, but fails to deliver it throughout the episodes. The first episode sets up the story, and it is certainly interesting. However, unfortunately from there, it goes downhill. From a great introduction, Akane-iro ni Somaru Saka then becomes dully episodic, and most of episodes have little to do with with the actual story. The plot is really only addressed in the last 2 episodes, which, I have to admit, does do a decent job in wrapping everything up.\r\nThe characters are unique, but their development throughout the anime is pretty bland.You can just expect how each character would act in anygiven situation. Yuuhi is the obvious tsundere would would always deny her true feelings and make it obvious that she's doing it. She almost does this in every single situation... It's interesting to watch her in action the first few times, but afterward, something new is needed, but never comes around.\\n\\n\r\nSound and art are decent. Nothing bad, but doesn't deliver anything amazing or new either.\\n\\n\r\nThe comedy is decent, but good scenes that really makes you laugh out loud are rare and infrequent.\\n\\n\r\nOverall, Akane-iro ni Somaru Saka had potential, but the anime in its entirety does not meet up to expectations it sets in the beginning. I suggest this only if you've ran out of other things to watch.",
            "date": "2009-01-01T19:39:00+00:00",
            "helpful_count": 12,
            "mal_id": 10932,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/51496.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/gdavge2003",
                "username": "gdavge2003"
            },
            "url": "https://myanimelist.net/reviews.php?id=10932"
        },
        {
            "content": "I only write reviews which defend animes thats been UNDERATED like this one.\r\nI have no idea why people are mocking this anime, there is nothing wrong with this anime.\r\nThe storyline follows the classic romance comedy, face it people, pretty much All romance comedies containing harems follow pretty much the same storyline, in fact this anime was actually more difficult to predict than standard romance comedies. I actually predicted the ending wrong which very very rarely happens.\r\nI see in some reviews people mentioned that this anime was Cliche. I don't know how many romance comedies you've seen but to call this anime \"Cliche\" you obviously haven'tseen many romance comedies. I've seen over 80 and I will tell you compared to most other romance comedies this anime is far Less Cliche.\\n\\n\r\nThis anime is suppose to be a fun anime to watch thats enjoyable and easy on the emotions, if you are looking for epic romance or plot/storyline based animes then you should probably go watch shojo animes or rl serieses.\\n\\n\r\nArt work, outstanding, amazing, 10/10 would like to give 11/10 if possible.\\n\r\nEnding is resolved unlike ichigo 100% which has a total crap ending.\\n\r\nSome very funny parts. \\n\\n\r\nStoryline follows the typical romance comedy with Some original ideas. ---&gt; 7/10\\n\\n\r\nCharacters, very little flashbacks and all the characters could be developed better by revealing more about their lives however, this is suppose to be a fun anime to watch and they are such lovable characters (Mainly because graphics are so good) so I can overlook the negative points.  ---&gt; 7/10\\n\\n\r\nGraphics, couldn't ask for better. Smooth render, not pixelated at all. Very good use of colours and all girls/guys are bishojo/shounen (Eye candy so to speak) well illustrated and drawing of each character reflect their personalities perfectly. ---&gt; 10/10\\n\\n\r\nSound. Well just look at the cast and you will find all the voices you like in this anime. Opening is nice and it seems that this anime has a different song for each ending which is unique. ---&gt; 10/10\\n\\n\r\nAverages out to 8-9/10, anything lower than a 7 would mean you don't like romance comedies since most are worse off than this one.",
            "date": "2009-01-26T17:58:00+00:00",
            "helpful_count": 11,
            "mal_id": 11857,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/89565.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeKraze",
                "username": "AnimeKraze"
            },
            "url": "https://myanimelist.net/reviews.php?id=11857"
        },
        {
            "content": "WARNING: THIS CONTAINS MY OPINION AND A SPOILER!\r\nThis anime might be the most boring anime I've seen. And the worst ending I've seen. From episode 1-9, it was decent. nothing really happened, and I was sure this anime wasn't going to be anything special. At episode 10 I changed my mind from: \"meh nothing special\" to: \"wow! this might actually be a good anime after all\". I thought that it might have a good ending after all, but turns out I was wrong. After watching episode 11, I was sure there was no way out of this mess. There was no way this could havea good ending, or maybe a decent one. And I were right, I watched episode 12 found out that episode 3-12 doesn't even have to be there. Because the relationship between boy, sister and girl in episode 2 is same as the ending of episode 12. its hard to explain. But what I want to say is that if you haven't watched this anime yet, you can just skip episode 3-9. the story doesn't change. \\n\r\nEven though it had  good soundtracks, famous voice actors and good character desing, it wasn't as enjoyable as it should have been. the story ruined everything lol.\\n\r\nTHANK YOU FOR READING THIS CRAPPY \"REVIEW\".\\n\r\noh and btw this isn't a review, its just me writing shit while sleeping.",
            "date": "2010-06-08T17:09:00+00:00",
            "helpful_count": 10,
            "mal_id": 26935,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/338895.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dianim",
                "username": "Dianim"
            },
            "url": "https://myanimelist.net/reviews.php?id=26935"
        },
        {
            "content": "Preview: \r\nSuffice it to say that an angry highschool-girl/bear orgy in a hot spring( which totally should have happened in episode 6) would have been a great way to separate this piece of crap from the crowd.\r\nReview:\r\nWitness THE GENERIC HAREM ANIME STENCIL!!! \r\nI have just found a new way of watching anime. Within the first 5 minutes, if i realize that it's a piece of crap, I can skip through each episode in about a minute and just piece together what it's about without missing anything important.\r\n(maybe 10 clicks through the timeline, stopping to watch for a few seconds every now and then) \r\nUsing thisamazing new technique i can say that this anime is the same as a hundred others. I have dubbed the creation method of this type of anime: THE GENERIC HAREM ANIME STENCIL.  ( btw \"Beck\" is awesome)\\n\\n\r\nSo we have two chicks, one the main dude randomly meets and the other his sister (?) and the rest of their class comprising this boring harem. Uhhh....we have some sort of all around infatuation with the main guy im not sure why. \\n\\n\r\nAlso the chick he randomly meets gets to (WAIT FOR IT!!!!) randomly live with him for whatever reason. Cause, hey look, you know its hard to write material that generates sexual tension without every love interest living in the dudes house... (stop reading and go watch Beck)\\n\\n\r\nSomething concerning military stuff happens during the show...not quite sure why or what but it probably doesnt matter. \\n\\n\r\nSuffice it to say that an angry highschool-girl/bear orgy in a hot spring( which totally should have happened in episode 6) would have been a great way to separate this piece of crap from the crowd.\\n\\n\r\nOh right so that hot spring scene i never saw coming...same with those scenes where the main dude is alone with each of the chicks in the rain or in a cave or on a scary walk or a haunted house or uhhhh a farm? Anyway I bet 50 bucks that it happened in a contrived manner which is where I was going with that...\\n\\n\r\nOH YEA. I definitely hear the voice of Asuran from Gundam Seed in this show AND a gundam shows up....and a big octopus....who im sure had insane super-robo sex but again im skipping through....  (are you watchin Beck yet?)\\n\\n\r\nSo the last 4 eps were pretty uneventful other than the lucky click i made where the sliver haired chick was in the shower but again i was pressed for time and couldnt watch to see what crazy stuff would happen next.\\n\\n\r\nIn summary: more beastiality coulda helped this stupid show. Also I had Dennis Leary's Lock and Load in the background so that made it awesome, hence the 2 out of 10 and not the 1.\\n\\n\r\nOne more thing. Go buy or DL Beck. Go see it. Its the opposite of the lifeless drivel i just reviewed. ITS AWESOME!!! WATCH IT IN ENGLISH (seriously its far superior that the j dub)  IN ENGLISH THE DUDE WHO DID YUUSKE FROM YUYU HAKUSHO IS IN IT AND HES RAPPING I SWEAR TO GOD.",
            "date": "2009-09-16T02:18:00+00:00",
            "helpful_count": 9,
            "mal_id": 18826,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/63643.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Skins2153",
                "username": "Skins2153"
            },
            "url": "https://myanimelist.net/reviews.php?id=18826"
        },
        {
            "content": "Akane-iro ni Somaru Saka at first seems like a cliche romance and all. Accidentally meeting in an awkward way and ending up together. Thle story would've fit like that especially since the two main protagonists were giving hints of their feelings for each other. but that wasn't the case, it didn't happen. \r\nI gave the story a 5/10 because I personally hated how the story ended. I wanted it to be a bit more cliched cos if it was it would have been more fun to enjoy since you get those butterflies in the end when you see that the two main characters end uptogether.\\n\\n\r\nThe art was good, i gave it a 9.\\n\\n\r\nThe sound was okay, i have no comment. I gave it a 6.\\n\\n\r\nCharacters were a bit confusing but then later on easy to get, I gave it a 7.\\n\\n\r\nOverall it wasn't a bad anime, I was just really disappointed with the ending.\\n\\n\r\nbut if you like romances with a bit of twists in them then you should totally try watching this but if you're more into cliche kind of romances, the romances that will make you moe since you guessed the ending right and you get butterflies in your stomach.. it may not be a good idea to watch this >< \\n\\n\r\n-end-",
            "date": "2010-08-09T06:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 29452,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/360493.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SweetIchigo",
                "username": "SweetIchigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=29452"
        },
        {
            "content": "WARNING: This review contains spoilers and lots of swearing\r\nPeople say the journey is more important than the destination. However, after watching this tripe named Akane-iro ni Somaru Saka, I realized that isn't always the case. Nothing can compare to the amount of disappointment I got after finishing this series. This anime, although clichéd in a lot aspects, I actually thought was pretty passable. Well, that was until that asspull ending so big I think I ripped my anus.\r\n*STORY: 4/10\r\nAkane-iro ni Somaru Saka or Akasaka for short, is an anime produced by TNK based off a visual novel with the same name by Feng. The storystarts off with our main protagonist Nagase, Junichi saving a girl from being harrassed by men while on his way to school. Junichi later found out the girl he saved is the rich new transfer student Katagiri, Yuuhi. Yuuhi, at first, had a good opinion of Junichi but that changed when Junichi, because of his chuunibyo delusions, kissed Yuuhi out of nowhere. Now branded as a pervert, Yuuhi hates Junichi's guts. Much more to Yuuhi's disappointment, she discovered Junichi is actually her fiancé she transferred in to check up on. Yuuhi now decides to live with Junichi, together with Junichi's little sister Minato, to see if he really is worthy of being her bride. Thus the start of your typical romance harem.\\n\\n\r\nThe story is nothing special. Right of the bat we are bombarded with anime clichés like arranged marriage, the transfer student and the mandatory \"accidental\" kiss. It is your standard harem storyline complete with harem/ecchi tropes you have probably seen hundreds of times. However, if I have something I've learned from watching anime for years is that not all clichés are bad so I stuck with it. While Akasaka uses a lot of trite jokes mostly in the form of fanservice and side plots I couldn't care less about, there's still some enjoyment to be had in this anime. There was a point where I actually wondered why the rating was so low when it's not really that bad. The progression of the story is very slow, but the cute budding romance between our main couple, Junichi and Yuuhi, is enough to keep me watching. I genuinely got feels from this anime but sadly, everything was short-lived as they start to fuck up everything that was good about this anime.\\n\\n\r\n~SPOILERS STARTS HERE~\\n\\n\r\nI was in a pretty good mood when Junichi and Yuuhi finally became a couple in episode10 and shared a steamy kiss (unaware of the impending disappointment waiting for me). What happened next was an obvious attempt by the creators to be \"unique\". \\n\\n\r\nJunichi started doubting his feelings for Yuuhi so he had a serious little chat with his best friend (at this point I'm already filled with great trepidation) well you know what happened next. On the act of the imouto gods, Junichi realized he's actually in love with his little sister Minato. WHAT THE FLYING FUUUUUUUUUUUUUUUUCK!!!!!!!! And what's worst, Yuuhi is ok with it! Junichi confessed to Minato later, and it seems their feelings were mutual. The anime ends with Minato entering the bathroom to give Junichi a nice incestuous back scrub and later, Yuuhi also joined the bath saying she wouldn't just give up so easily blah blah. Ending credits.\\n\\n\r\nMy buddha, the only saving grace of the anime turned out to be a bag full of dog shit. Mind you, I'm not a fan of incest but that's not actually the main reason why I'm ranting so much about the ending. On the scale of 1 to Yosuga no sora, this anime is about a 7. Well it was hinted (but never confirmed) that Junichi and Minato aren't blood-related. You know, the usual pseudo-incest anime pulls off? The incest is part of the reason too but the main reason I am not very happy about that ending is because the ending basically rendered 10 episodes of developing Junichi and Yuuhi's relationship ABSOLUTELY POINTLESS. It felt like a everything was a fucking waste of time. Junichi and Minato hardly had any romantic interaction through-out the show and we just found out later that they actually liked each other, like what the fuck?\\n\\n\r\nTo be honest, I like Minato more as a character (not really as a love interest though) because Yuuhi is an annoying tsundere, but this is not how you end an anime. It's obvious the creators were trying to be different here, which isn't bad, it's just this time they failed VERY MISERABLY.\\n\\n\r\n~END OF SPOILERS~\\n\\n\r\n*CHARACTERS: 5/10\\n\r\nWell there's nothing really much to say about the characters because they are very one-dimensional; aren't unique or special in any way at all. We have the usual violent tsundere, the caring little sister and of course Akasaka wouldn't be considered a harem without other girls crushing on the main protagonist for reasons we don't know.\\n\\n\r\nThe main protagonist Junichi, in my opinion, is probably the most likeable of the characters mainly because he's not your usual overly perverse romcom harem MC who blushes and have fatal nosebleeds on every sight of something titillating. MCs like him are more common in action harems and I must say I greatly prefer this type of MC. However, that is not nearly enough to make up for the lack of character development in almost all of the characters, and not to mention, the whole bunch of other unimportant characters added just for the sake of having more characters.\\n\\n\r\n*ART/ANIMATION: 6/10\\n\r\nThe first thing I've notice was the character designs, more specifically the character's hairstyles that looked like it took them 10 cans of hairspray to shape it that way. They have some of the wildest hairstyles that I've seen in anime that is not battleshounen. TNK doesn't really stand out when it comes to art quality, though their animation can be good sometimes. When you look at their other works, art and animation is average at best. Akasaka's art and animation quality is not that much different.\\n\\n\r\n*SOUND/MUSIC: 8/10\\n\r\nWhen you have a cast of talented voice actors like Rie Kugimiya and Aya Hirano you can almost never go wrong with voice acting. And for Akasaka's opening and ending theme, well it's pretty okay but not really what I would consider memorable. \\n\\n\r\n*OVERALL/ENJOYMENT: 4/10\\n\r\nAkasaka, while it had its good moments, was mediocre at best, but it just have to sink even lower by pulling off that stupid ending. Unless you have a thing for imoutos, you should just stay away from this anime and forget it even existed, because what awaits you is just great disappointment and possibly anal fissures.",
            "date": "2015-08-05T09:43:00+00:00",
            "helpful_count": 8,
            "mal_id": 195231,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3166039.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Xynic",
                "username": "Xynic"
            },
            "url": "https://myanimelist.net/reviews.php?id=195231"
        },
        {
            "content": "“Akane-iro ni Somaru Saka” is one of those Anime that draws you in with the first episode. At the beginning of the series, you end up forming high expectations of the Anime because it in the long run is different from the cliché, only to have these expectations dashed at the end of the Anime because the storyline just couldn't hold itself together. Because of this, it is going to be very hard to leave out spoilers in my review.\r\nThe Anime starts off with the protagonist finding out that he has a fiance and the two of them living together. This particular plot device isactually used in quite a few Anime, which makes it a cliché. While this cliché tends to come across poorly, what drew me into this particular storyline, was the fact that this seemed like a fresh side to the cliché that was actually for once fleshed out. I found myself rooting for Jun'ichi and Yuuhi to get together by the end.\\n\\n\r\nAnd that is exactly why the Anime is such a let down. Basically, “Akane-iro ni Somaru Saka” is based off one of those dating simulation games over in Japan that are so popular. Normally, when this kind of media is adapted to an Anime, the viewer will have a bunch of pairings to choose from to root for, because the feelings of a bunch of characters are actually obvious. This way, when a different pairing then what you were rooting for becomes canon at the end, you aren't disappointed.\\n\\n\r\nHowever, with this particular Anime, the viewer is hit good and hard through a good portion of the episodes with Jun'ichi and Yuuhi. There are rather mild hints at other possible pairings, but the truth in the matter is, they are so very, very mild it isn't funny. They feel more like hints that could be misinterpreted as having a very different meaning. So, when the pairing between Jun'ichi and Yuuhi doesn't occur at the end, it is just disappointing, not matter how much you like the beginning.\\n\\n\r\nThe beautiful art work does make up for some of the plot failing, but the sound actually brings it down. Amongst the beautiful art work, I found myself wanting to slap my hands over my ears every time I heard Jun'ichi and Yuuhi speak. I know that their voice actors are popular and some people will fawn over any of their work, but I've heard both of them do better, or maybe the better word is, I've heard their voices in roles better suited towards them.\\n\\n\r\nI actually liked the characters at the beginning of the show, only to find myself frustrated with them later on. Sure, they were built on stereotypes, but the way they interacted was funny. So much so, I enjoyed the interactions. However, later on, these interactions fell apart and/or became boring. A lot of the sub characters were shoved aside for the main three and their importance diminished to filler.\\n\\n\r\nAs for my enjoyment, I honestly did like the beginning of the show. However, I was not happy with the ending, despite the fact it didn't come out of nowhere. I didn't really think of this as a harem Anime, until the end either, and then because of the ending, it became clear that this is a poorly done one. I think it is worth watching though, even if it is just once. That said... I do have an important warning that includes spoilers, but it is important for those who don't like this kind of show.\\n\\n\r\nWARNING: The person Jun'ichi decides that he likes is his sister.",
            "date": "2011-10-23T15:10:00+00:00",
            "helpful_count": 8,
            "mal_id": 46107,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66270.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Yemi_Hikari",
                "username": "Yemi_Hikari"
            },
            "url": "https://myanimelist.net/reviews.php?id=46107"
        },
        {
            "content": "This series is incredibly hard to interpret.\r\nStory: to start, the basic story is Junichi engaged to Yuuhi Katagiri, but Yuuhi refuses to acknowledge the engagement that her father has arranged and so she stays with Junichi before finalizing a decision...unfortunately, before moving in, she didn't have quite the pleasant experience meeting him...The first episode already was bland and it didn't really get interesting until we saw Junichi's sister, Minato, implicitly become Yuuhi's rival in Junichi's love.  That is where it got interesting...so there was a hint of incest relationship, which was a start for this series, but was eventually poorly executed.  Things areoften resolved too quickly in the series as if by magic.  Making each following episode very unappealing to look forward to as the show would continue to shift focus.  Eventually  Minato is chosen by Junichi but it was far too rushed with too many unexplained pieces of the plot in the final episode.  One after the other new things came out like Junichi as a subject, File X, etc...none of which was actually revealed earlier on in the series except in dull comedic scenarios.  All in all there was a story but it was poorly paced and executed.  4/10\\n\\n\r\nArt: Very noticeable poor animation quality, especially in the last episode where characters laughing looked like a bunch of bobble heads and possibly much more throughout the series that I don't remember or even want to remember.  The artwork was only mediocre.  Even worse in the last episode during the whole subconscious scenario and &quot;shadow of Junichi.&quot;  3/10\\n\\n\r\nSound: One of the only redeeming points of this series was its seiyuu cast.  What more could you possibly ask for than Aya Hirano, Rie Tanaka, Rie Kugimiya, and many more of the like all in one show?  Music, as expected was nicely done as a result.  7/10\\n\\n\r\nCharacter: If anything, there was no character development...at most we only got a bit of Junichi's past in the final episode.  Everyone else essentially played as side characters.  There was one episode with Tsukasa getting some nice plot development, but other than her, even Minato and Yuuhi who were the two lead female protagonists didn't get much background, and I won't get started on Karen, Mitsuki, and Nagomi. 3/10\\n\\n\r\nEnjoyment: This was suppose to be one of my highly anticipated shows this fall after being postponed from the horrendous summer 2008.  However, it clearly became one of the worse in fall 2008 and if anything one of the worst series in anime history for school-life romance series. 3/10\\n\\n\r\nOverall: This series was not good at all.  It had an amazing seiyuu cast and that was really about it.  I don't understand how anything could fail so hard with such an amazing cast.  If your old enough or simply daring enough, go play the ero-game...it's much more worth your time.  I only hope now the OVA will live up to its promise of a different story, let alone a much more compelling one.  This is not worth anyone's time watching despite the cast.  In a sense this show is like bad mouthing the seiyuus behind the scenes.  It had potential of being a satisfactory series around episode 9 or 10, but conflicts were simply rushed to be resolved leaving nothing really interesting for the final episode to work with much without having to rush the series to finish on a conclusive note... 4/10\\n",
            "date": "2008-12-31T01:18:00+00:00",
            "helpful_count": 7,
            "mal_id": 10847,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/10830.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Kit-Tsukasa",
                "username": "Kit-Tsukasa"
            },
            "url": "https://myanimelist.net/reviews.php?id=10847"
        },
        {
            "content": "Adaptations of harem based eroge have increased in frequency lately, Akane-iro ni Somaru Saka (hereby referred to as \"Akasaka\") is an example of one that has possibly been butchered due to some factors (using the seiyuu from the PS2 adaptations, the ending). Directed by Keitarou Motonaga, notorious for directing other harem anime (School Days, Onii-chan no Koto) and Katanagatari (a big surprise) Akasaka proves that it is a product of many trite, anime/eroge cliches that were mixed in a blender of sorts with hints of fanservice added as some sort of seasoning. Ah yes, the eroge itself was produced by feng around 1 year beforethe anime adaptation as well.\\n\\n\r\nEither way, I shall get on with the reviewing now. This is also my first review that isn't a joke so the probability of me making mistakes is pretty high.\\n\\n\r\nStory: 3/10\\n\\n\r\nThe main plot (which gets shoved out of the way within only 2 episodes, wow) is the stereotypical \"girl who has a bonus of being rich but she tries to make sure people don't know that ends up living with an ordinary high schooler who also turns out to be her fiancee, hilarity ensues\" one that is quite common amongst anime and eroge. The little differences are that the main heroine, Yuuhi Katagiri, turns out to be a tsundere (plus the \"ojou\" role is relegated to Karen Ayanokouji, someone who is only an add on heroine for the PS2 adaptation) and the Rie Kugimiya type too. The protagonist, Junichi Nagase, also probably fell for her at the beginning and as the series goes on he does build up his relationship with Yuuhi but it ultimately goes to waste in the end, for reasons that are possibly obvious and are what kind of add to the notoriety of the Akasaka adaptation. (Oops, spoiler.)\\n\\n\r\nWhen I mentioned in brackets that the plot does get shoved out of the way within only 2 episodes, it really does. The first 2 focus on Yuuhi meeting Junichi and making herself out to be a tsundere (since Junichi impulsively steals her first kiss, oh Junichi look at what you've done you indecisive harem protagonist) and Yuuhi getting to know Junichi's little sister, Minato. We learn about how Yuuhi is a sheltered rich girl in the second, but then we end up watching the cast's harem shenanigans afterwards until the last few \\n\r\nepisodes. \\n\\n\r\nOh yes, the classmates also decide to constantly remind Yuuhi and Junichi of the first kiss, to their dismay, and the dismay of the viewer since it gets irritating after the first few times. Episodes 3-10 are ultimately filler, even though some of them are dedicated to other not noteworthy cast members like the two childhood friends of Junichi, the main \"ojou\" (I think i'll say rich girl from now), the mysterious character whose motives aren't touched upon throughout the series, the school idol and student council president who is a trickster, the teacher who is childish and male and possibly others who will be described in the characters section. You could say they're there to develop the relationship but that could've been done without all these wasted minutes.\\n\\n\r\nActually, there were some things that were pretty cool (Junichi's parents, Nagomi's behaviour) but they were executed poorly and should've been relegated to a different series altogether. Here they were seen as unnecessary and plot holes that are never given any more thought.\\n\\n\r\n--\\n\\n\r\nArt: 5/10\\n\\n\r\nThe animation in Akasaka wasn't the worst, but it wasn't the best either. The animators possibly slacked off while working on the figures, as their faces were consistently off model at times (except for the last episode) when they were moving around and what not. The backgrounds were your standard fare for anime, not being really special in particular (although compared to others I haven't watched much so I might not be right in this area). The character designs were pretty fancy, mostly with the hairdos. The faces are cute, with the boy's faces making themselves look like they could qualify as successful crossdressers. Even though they weren't bad, they weren't entirely unique (Yuuhi's and Mitsuki's hairdos are pretty similar and if it weren't for Mitsuki's hat and different face they could've been mistakened for each other) the somewhat different faces and colours of the hairdos were the only ways you could differentiate the others. Watching Akasaka with the designs felt like watching someone playthrough a dating sim with animated scenes all around.\\n\\n\r\n--\\n\\n\r\nSound: 5/10\\n\\n\r\nThere's not much to say about the sound and music and whatnot, since the themes themselves were pretty forgettable and your standard J-pop fare. On the other hand, you can see that they used an all star seiyuu cast as replacements that would be used for the anime. With Rie Kugimiya (Yuuhi, of course), Aya Hirano (Minato), Wataru Hatano (Junichi), Akira Ishida (Fuyuhiko), Marina Inoue (Tsukasa)... anyone who wasn't a really minor character practically was voiced by a well-known seiyuu. (Aya is an exception as she was voiced by Kaori Fukuhara, and the Nagase mother since she was voiced by Atsuko Tanaka.) Sadly, their talent was put to waste and ended up being considered kind of annoying, especially Rie Kugimiya's tsundere spouting nonsense as Yuuhi. Some of the voices can get on the nerves of people, namely Minato's and Fuyuhiko's, maybe to mimic the original seiyuu? Who knows.\\n\\n\r\n--\\n\\n\r\nCharacter: 2/10\\n\\n\r\nAh, the part where you could easily frown at how badly they were handled. The characters in Akasaka were walking cliches, only having maybe one or two traits to separate them from the norm. The anime does try to make them look important and not flat; actually, that only goes for Junichi, but they fail.\\n\\n\r\nI'll be describing each of them, well at least from what I gathered from watching the anime.\\n\\n\r\nJunichi Nagase: Stereotypical harem protagonist who is living with an often praised little sister! Has two childhood friends, Fuyuhiko and Tsukasa, who like to trouble him a lot! Just like the student council president, Mitsuki Shiina, who uses him as some sort of lap dog of sorts since he's free! He also comes with the added traits of being somewhat idiotic when it comes to handling a tsundere, being untidy, really childish and having a back story that mainly gets focused on it during the last 2 episodes. Junichi comes off as manly and the only sane man in the first episode but he is then shown as a harem protagonist with a swimsuit fetish afterwards.\\n\\n\r\nHe is also snarky but that's because he gets treated like shit a lot by his friends. He goes through minor character development that maybe shouldn't qualify as character development. At the end he's revealed to have Chuuni syndrome (eternal manchild syndrome), something never mentioned anywhere else. It comes off as a weak excuse to add weak character development that you would only notice by him stating what happened. Indecisive as hell.\\n\\n\r\nYuuhi Katagiri: Token tsundere heroine who gets the bonus of being voiced by Rie Kugimiya and is also short and flatchested compared to the others. Also a rich girl who gets engaged to Junichi but shows her tsun side when he unexpectedly steals her first kiss and ends up using his first kiss too. Compared to other tsunderes, Yuuhi isn't as likable. She isn't as bad as, say, Naru from Love Hina or Louise from Zero no Tsukaima but she comes off as an incredibly shallow one who blames Junichi for most things. She also can't cook when she isn't being supervised and requires master chef Minato to help her. She seems to be knowledgeable about flowers and types of tea and teacups due to her upbringing as a rich girl too.\\n\\n\r\nMinato Nagase: Disgustingly sweet little sister demi-heroine who is possibly related to Junichi. Practically perfect, since she's great at household chores and is used to living in the jungle, she gets praised a lot by the other characters. Minato could be considered a Mary Sue because of her really friendly nature and plus she gets a good amount of attention in the episodes from the writing staff and the characters. Minato seems to be a bit of a brocon, as she knows a lot of things about Junichi to an extent that can be considered stalker behaviour if it weren't for the fact that she's his sister. She's the perfect girl of the dating sim in a little sister persona, but we actually never get told whether she does well academically. She's also in the tennis club.\\n\\n\r\nTsukasa Kiryuu: Childhood friend character who is one of the haremettes but you only get mild hints with a noticeable one in her spotlight episode, Tsukasa is a lively girl who is often seen with Fuyuhiko (as they apparently have the same personalities with some differences) who is in the Newspaper Club. Because she's in the newspaper club, this means that she's automatically a gossip. At times it is shown that she cares more about Junichi and the others, even moreso than Fuyuhiko. Apparently she wanted to be a seiyuu when she was younger because of a magical girl anime she watched with Junichi, and this is what her episode is all about.\\n\\n\r\nFuyuhiko Nishino: \"Bromantic foil\" character who surprisingly doesn't show much interest in persuing the girls. Practically has Tsukasa's character traits except he's an otaku of sorts who has the ability to talk to Junichi when he's going through brain revelations. He's shown at the end to be a decisive character who helps Junichi go through character development, so he's possibly genre savvy without constantly pointing it out. Also the vice president of the student council, but that's only seen twice.\\n\\n\r\nMitsuki Shiina: Student council president and school idol Amitie with an accent, Mitsuki is a trickster of sorts who isn't very good at keeping secrets (or is just a pest). Enjoys using Junichi as a lapdog and likes him but it's very easy to assume that she doesn't. There's not much to say about her, what a shame. Also a haremette.\\n\\n\r\nNagomi Shiraishi: ~Mysterious~ girl who acts like a dandere. Hinted to be an alien since she talks to some sort of unknown entity who wanted her to observe Junichi or something. A poorly executed character who is there to fulfill the fantasies of those who think that Yuuhi's breasts are too big, and she's also got a sister called Yutori. Also a haremette.\\n\\n\r\nKaren Ayanokouji: Rich girl character who tries too hard when it comes to pleasing people. Gracefully hot blooded and (assuming these jokes were hers) can't tell jokes. Competitive with people who are well-liked or something, wasn't on the best terms with Yuuhi at the beginning but they eventually become sleepover buddies or something. Also a haremette.\\n\\n\r\nMikoto Tachibana: Senpai character who hangs around Mitsuki. Plays tennis too? I dunno, she's fanservice space with little screen time. Also a haremette.\\n\\n\r\nSeijirou Sugishita: Playful teacher who's possibly gay for Junichi and gets into a only mentioned once rivalry with Fuyuhiko for the homo subtext with the protagonist space. He's a genderbent version of the unreliable teacher, and he also helps Junichi go through character development. He's poor.\\n\\n\r\nAya Nijou: Secretary and Treasurer of the student council. Shown to be blunt and considerably normal amongst the standards in this series. Not a haremette!\\n\\n\r\nNagase parents: Adventurous! Also, the mother is practically Fujiko Mine except nicer.\\n\\n\r\nSo there you have it. Cliche, cliche and cliche.\\n\\n\r\n--\\n\\n\r\nEnjoyment: 4/10\\n\\n\r\nYes, despite all of the flaws I pointed out needlessly in this review, I didn't really mind watching it. Sure it's bland and cliched, but there were not many really really horrible bits aside from the ending. Also, it averted some of the cliches that it used too (no hot spring peeking) so it wasn't entirely facepalm worthy? I don't really have much to say for this part, surprisingly enough. All the characters are unlikeable though.\\n\\n\r\n--\\n\\n\r\nOverall, Akane-iro ni Somaru Saka is an anime that achieves nothing in trying to be spectacular within its genre and was practically made to be fapping material (or what I said at the beginning). Others might like it, but I can say that it didn't tickle my fancy. I'm sure the original vn was hopefully better, and that the anime was just fucked up like most of eroge adaptations, so maybe this was just promotional material instead? The ending being like that so the angry people can just play the vn and experience the so-called true ending? Maybe.",
            "date": "2011-12-23T21:48:00+00:00",
            "helpful_count": 7,
            "mal_id": 49981,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/462986.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Feinerine",
                "username": "Feinerine"
            },
            "url": "https://myanimelist.net/reviews.php?id=49981"
        }
    ],
    [
        {
            "content": "Seriously, is  it that bad to find this show entertaining? One can argue this is a typical slice of life, school, harem anime with typical character types and predictable story and you would not be far off. But, if you don't LIKE watching things like this, why are you watching it in the first place? Akane-iro is geared to the 'veteran' otaku who love specific voice actors or character types, or enjoy when different flags get triggered (like hot springs, school festivals, or costume changes) aka: fanservice. You can only watch so many different slice of life harem comedy titles to realize if youlike this particular genre or not. This genre lends itself to a lot of off the wall stories and anyone expecting something \"realistic\" will realize a true \"anime\" (aka normal anime) is not realistic at all. Which is why certain things feel obvious after you watch title after title. Why do you think there are 1000's of anime titles, but only about a few dozen genres. As for me I am a fan (not a raging fan mind you) of these types of anime. I am pretty sure I am not the only one in the world that found this entertaining for what its worth. \\n\\n\r\nJust like in life, if you expect one thing and get something else, you're bound to be disappointed. Watching this with an open mind, you will realize that Akane-Iro ni Somaru Saka is actually a very entertaining and funny anime. Like most slice of life school comedy harems, a premise is presented at the beginning of the show, which is usually far fetched but bound for some form of entertainment. If you read the anime summary you'll get the gist, but it does generate enough laughs and surprises to keep you entertained for 12 episodes. An amazing feat that many fail to miss is that 8 of the 10 characters get relatively large amounts of airtime for every episode. With that, the story seems to progress relatively quick and seamless. Sometimes you won't realize the episode is over before you know it. \\n\\n\r\nA big reason you get sucked into this anime are the character-types and voice actors lined up for this show. Alot of A-list seiyuu like Rie Kugimiya, Aya Hirano, and Wataru Hatano, headline the cast of characters. Big fan's of seiyuu like these, will be surprised at how well they lend their voices to these characters. Its inevitable that one will grow attached to one or some (all?) of these characters. Yeah yeah, you've seen these character types everywhere else, who the hell cares? The whole point of having these character types is to have a great chemistry between all the characters and this exceeded my expectations with flying colors (whatever that means). Fang-tan, ahoge-san, and company are all there, the comedy is pretty good and and the drama is just as good as well. The drama doesn't show itself too much to get in the way of the comedy aspect of this series but it is a warm welcome from the 'incomplete' dramas like the ones that never come to fruition (Honey and Clover, 5cm/s, etc). Characters progress perfectly fine in this story. You'll feel happy for some and sad for others, that is the nature of drama. In other titles that may get annoying but its perfectly fine in this series. One other thing that I highly enjoyed about this series is that the main character in the center of the harem, Junichi Nagase, was actually not a bad guy. Sure he might have his moments, but overall he was very outgoing and more \"realistic\" compared to most other male harem leads. Even the scenes when he's battling his conscience were especially funny.  \\n\\n\r\nThe production value is actually very high compared to your typical anime. The art design hardly ever faltered and never felt like a rushed product. Some people might be put off by the floating hairstyle of some of the girls, but I didn't mind it one bit. The details they put in to all the characters including the background characters is something to be commended. Every scene is filled with either characters or static objects. What does that even mean? That means when there isn't a close up of characters talking to each other, theres usually a large amount of detail to panning or zoomed out shots. Passed out cooks in a kitchen, well placed furniture in Minato's room, or Nagomi''s computer setup are good examples that show enough detail to keep every scene busy and with some depth. The art is far form being perfect but for what its worth, it more than does the job. On top of the great voice acting and art direction, they even have character music cd's available for each character and even give previews of their songs in the form of a new ending song for each episode. Sure it may be a gimmick, but you can't deny how great they can sing and how they managed to conjure up a few dozen songs just for this show. There are also a few drama cd's to supplement your fix of akane-iro after you're done with the series. It seems like the producers thought of everything short of a video game for this show.\\n\\n\r\nI never felt this was a waste of my time or got annoyed by the characters. Actually this is one of the more complete cast of characters that I have seen (out of 400 titles). I don't think I need to mention Code Geass, Hayate, TTGL, and Death Note but I will anyway since most of those characters made me rage at how many of them left many cliffhangers or a feeling of \"needing something\". Despite being a typical harem comedy anime, it's the small things that kept me wanting to watch more. The segments of Junichi's conscience and the analogy between Junichi's parents and the gang's current situation were pretty funny imo.\\n\\n\r\nAs far as slice of life/harem/comedies go this is easily one of the better ones. Its compete in almost every way. Great character chemistry and seiyuu Amazing amount of detail (down to the nipple, har). All crammed in a 12 episode package. What is not to like? If you don't like harem comedy this will obviously become fodder for low scoring. Especially for the fools who try to find seriousness in comedy... THEY WILL LOSE THE GAME.\\n\\n\r\nHell, hearing Rie Kugimiya say \"Stop licking already and eat me\" is well worth the price of admission. \\n\\n\r\nOne of the best lines is uttered in this anime too: \"If you want to dream, go dream while you're sleeping\" Priceless.",
            "date": "2010-04-24T00:55:00+00:00",
            "helpful_count": 252,
            "mal_id": 25383,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=25383"
        },
        {
            "content": "Akane-iro ni Somaru Saka is an anime that hurts itself by raising expectations and failing to meet them like clockwork. It goes out of its way to repeatedly build from mediocrity only to plunge itself back down to the point where you wonder why you even gave it much of a chance. It's someone jumping out of a 3 story building and landing on concrete, only to climb back up and jump over and over again. Until the person's bones are mush and the series limps to its god-awful ending.\r\nAs a series in general, Akane-iro ni Somaru Saka (from here on, Akasaka) is passable, Iwould go as far to say it's decent and occasionally enjoyable. Its gaping flaws are grossly magnified, rightly, by its constant, flagrant disappointment of its viewers. Basically Akasaka is not pure bad (far from it) but the parts that are actually good makes the parts that are bad look really bad. \\n\\n\r\nAkasaka is based off Feng's visual novel released back in 2007. The plot revolves around a boy by the name of Jun'ichi Nagase, who attends a prestigious high school and seems to bear some kind of tough reputation from middle school. Think typical harem school comedy male protagonist. There, I just developed the character to the same degree 12 episodes of Akasaka did. Anyhow, a naive aloof rich girl, Katagiri Yuuhi (CV: Kugimiya Rie), transfers to Jun'ichi's school and Jun'ichi, out of some act of divine inspiration kisses her, causing unspeakable chaos. Then, to close out a rather promising first episode and establish a quite original premise, it turns out that Yuuhi is Junichi's fiancee due to an arranged marriage.\\n\\n\r\nAkasaka's female cast is chock full eye-catching and potentially interesting characters. Expectations: high. The series proceeds to do nothing with all but two of the girls. Expectations: failed. \\n\\n\r\nLike many similar anime, Akasaka's plot (the plot is essentially just the premise) takes a back seat episodes 3-10 for some good unrelated episodes of fun. That's fine! It's a structure that has worked countless times. And by all means it can work here. But instead, Akasaka is filled extremely cliche situations solved in extremely cliche ways. For example, Jun'ichi's sister Minato (CV: Hirano Aya) takes Yuuhi shopping in a supermarket to make dinner. Six minutes of pointless dialogue about how amazed Yuuhi is of instant curry follows. We get it after the first few lines! Yuuhi talks about how she eats at home as Kugimiya Rie butchers French Japanese transliteration. She's rich, naive, aloof, we get that. Is it supposed to be funny that Yuuhi doesn't know about instant curry and thinks that her cooks and servants don't either? How overblown does the reaction and enlightenment need to be? There are lots of girls in this anime, some who look pretty interesting. Are we going to get episodes about them? With curry? That actually would be pretty awesome...\\n\\n\r\nWatching anime should never be physically painful, but that's what I felt as this series slowly killed itself. It's the pain you feel a promising show wastes all the good things it had going for it and falls into mediocrity. Akasaka occasionally strikes silver (no gold in this show, sorry) with a few lines of interesting dialogue and good animation, but after every good or decent episode or plot development the series feels as if it has some obligation to make up for it by spewing crap at our face. It's like you're at an amusement park and every time you have some fun, a burly security guard has to give you a swift punch in the gut. The ending begins suddenly in the last 3 episodes and was likewise promising. Too bad the conclusion of the series was so predictable that I might as well have drawn the storyboards myself and the things that you didn't predict either have no relevance to the plot or are so cheesy and/or wrong you're better off not predicting it. \\n\\n\r\nI'm a little harsh on this series because it really is a shame. Akasaka goes to show you how bad writing can absolutely destroy a series with everything else going for it. The art is good, the characters and landscapes are well drawn and fun to look at. Akasaka has a voice acting cast that would remind you of the New York Yankees, with the resulting mediocrity to match. When we have Kugimiya Rie (Shana, Louise, Taiga), Inoue Marina (Chiri from Zetsubou Sensei, Yoko from TTGL), Aya Hirano (Haruhi, Konata, Misa from Death Note) and Tanaka Rie (Chi from Chobits, Sugintou) in the same anime, we're going to be excited. I had my eye on this series ever since voice actors were announced and some art was available. \\n\\n\r\nIn the end, the voice acting was pretty good but by itself it cannot save a series. The music (besides the terrible OP) is good. It better be good when you have five voice actors with best selling seiyuu albums on your staff. Should there be an OVA about the supporting characters I would most likely flock to it with expectations held high. I've heard that the game this is based off was really cool. Too bad I can't say the same for the anime adaptation.",
            "date": "2008-12-29T13:53:00+00:00",
            "helpful_count": 193,
            "mal_id": 10780,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/10543.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/kevo",
                "username": "kevo"
            },
            "url": "https://myanimelist.net/reviews.php?id=10780"
        },
        {
            "content": "There are some shows that really have no business being bad.  Akane-iro ni Somaru Saka is one of those.  When you look at the talent gathered for this series it practically reads as a who’s who of seiyuu talent.  Unfortunately it is that talent that is one of the few bright spots in what is otherwise a pretty dismal series.\r\nThe story unfolds as your standard harem anime.  I always find some of the ridiculous situations these writers come up with quite hilarious.  A spoiled rich girl ends up living with a pair of siblings (not related by blood of course,more on that later) who just happen to not have any parents around because they are busy being John Steed and Emma Peel.  Of course our rich girl, Yuuhi Katagiri hates our hero Junichi but announces anyway that they are now fiancées.  I wonder if this kind of stuff really happens in Japan, because it happens an awful damn lot in anime and manga.  So despite me really wanting to like this at the beginning, this show has managed to get itself off to a bad start with me.\\n\\n\r\nHowever I did start to become pleasantly surprised as the story unfolded.  Slowly we are treated to a pretty sweet little romance as Yuuhi and Junichi develop feelings for one another, confess and start down a path I felt was leading to a lovely romantic ending.  That’s when they screwed it all up to hell.  It’s going to be damn hard for me to express my disappointment with the turn this show made about halfway through without giving away too many spoilers.  But it involves the ultra moe sister Minato and Japan's obsession with incestuous relationships involving close family members.  Yes the anime does take great pains to point out that Minato and Junichi are not biological siblings.  That’s not the point; your blood isn’t the only thing that makes you family.  If you’re raised as brother/sister you're brother/sister, regardless of what your birth certificate says.  In no way should siblings who know they are siblings be romantic interests.  Even though this is a harem romance with many possible choices for the lead to make it very clearly becomes a choice between Minato and Yuuhi.  It’s creepy, disturbing, and completely disgusting.\\n\\n\r\nAs characters, there is nothing particularly interesting about the three leads.  If you have one harem you’ve seen this one.  I only found the mains compelling for about the first half of the series before Minato became a love interest.  I did find most of them likable in the beginning just not original or inspiring.  The supporting cast has little to recommend either and is largely just background scenery.  Probably the silliest characters of all are Minato and Junichi's parents as their various spy stories are told throughout the series.  These have nothing to do with the main plot and feel totally out of place and stupid.  I think it was supposed to be clever and witty.  Fail.\\n\\n\r\nAs I mentioned, Akane-iro does a great job with its voice cast and music.  We are treated to quite a bit of songs, as there are a lot of ending themes sung by almost all of the seiyuu who do singing work.  It’s a shame that the story and dialogue were not on par with their talent.  I am not a huge fan of the art though.  It reminds me a lot of CLAMP, tall way to thin characters that are just too \"beautiful\".  Big eyes, cutesy hair accessories, and gravity defying bosoms and boys who could easily double as girls if you have those boobs and skirts dominate.\\n\\n\r\nIn the end this series was a prime example of how to waste great acting talent with a clichéd story, lackluster production values, and creepy plot elements.  Giving it a 6 is probably generous to how disappointing I found this series as a whole, but I really did enjoy the first half of this anime a lot.  If you simply must see every harem romance out there and are not bothered by incest then by all means watch this.  Everyone else should just steer clear and avoid the disappointment.\\n",
            "date": "2009-05-26T03:41:00+00:00",
            "helpful_count": 142,
            "mal_id": 15284,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=15284"
        },
        {
            "content": "[THIS REVIEW CONTAINS SPOILERS]\r\n(At Studio TNK)\r\nDirector [clapping his hands]: Okay, people. The next anime we're going to produce is Akane-iro ni somaru saka. Now, before we start production, I want everyone to play the visual novel and list out every event and trope that you believe should be included into the anime version. You have one week to complete this game.\r\n[One Week Later]\r\nDirector [looking around the room]: Alright. I want everyone to hand in their lists. [Everyone begins to pass their list to the director.] Okay, thank you. Now, here’s what will happen. A few assistants and I will now tally up the tropes thatshould be included into the anime version. The tropes with the most tallies will be included into the series. Only the top 20 tropes will be included. Thank you, we will see you in a few hours.\\n\\n\r\n[Several Hours Later]\\n\\n\r\nDirector [clearing his throat]: After, tallying the results, we have found 20 tropes that everyone in this room can agree with. Here are the tropes:\\n\\n\r\n– Bland and Boring Protagonist.\\n\r\n– Your Soon-to-Become-Fiance Living at the Protagonist’s House.\\n\r\n– Younger Sister in Love with Protagonist.\\n\r\n– Childhood Friend in Love with Protagonist.\\n\r\n– Rich Ojou-Sama in love with Protagonist.\\n\r\n– Best Friend Helping the Protagonist.\\n\r\n– The Student Council Involved with Protagonist.\\n\r\n– Violent Tsundere Character abusing the Protagonist.\\n\r\n– Dinner Involving Curry and Rice.\\n\r\n– Supernatural Events.\\n\r\n– Typical ‘Test of Courage’ Event.\\n\r\n– 'Resisting the Urge to Look at Naked Girls’ Event\\n\r\n– Random Mechs and Action Scenes.\\n\r\n– Lots of Fanservice (i.e. swimsuits, boobs, underwear).\\n\r\n– Home Sick Event.\\n\r\n– Hidden Porn Magazines.\\n\r\n– Cultural Festivals.\\n\r\n– Maid Cafe.\\n\r\n– Mountain Resort with Hot Spring.\\n\r\n– Incest Ending.\\n\\n\r\nDirector: I want all these events and tropes into this anime series. Next, I want the tsundere character, Yuuhi Katagiri, to be voiced by Rie Rugimiya. Also known as the ‘Queen of Tsundere’. \\n\\n\r\n[The Head Producer looks at him with an unsurprised face.]\\n\\n\r\nDirector: Don't look at me like that. I mean, come on, Yuuhi Katagiri is rude, abusive, and not very honest with her feelings. The only seiyuu that performs tsundere characters perfectly is Rie Rugimiya. Then, I want Aya Hirano to be on board, as she's a famous seiyuu with high credibility and does excellent voice overs for both soft-spoken and loud-spoken characters. In this case, she will play as the soft-spoken character Minato Nagase with special hidden abilities and talents.\\n\\n\r\nHead Producer [raising his hand]: What about animation and story?\\n\\n\r\nDirector [thinking]: Have little background details as possible, mainly focus on the school, Nagase's home, and lots of random scenes with snow. Next, have minimal facial details for each character, make them almost similar to each other. Keep it simple. Then, I want each of the girls to have a different hair-style with bright hair colors, mostly brown, pink, yellow, gray, etc. But, lastly, I want every character to produce an exaggerated expression for every action. \\n\\n\r\nDirector [taking a deep breath]: Now, for the story, I want it to be simple. Nothing too complex or deep, make it sightly predictable, except towards the end. I wants lots of random filler episodes in the middle and then, add many main story points towards the end. Keep the dialogue and interactions simple, mainly discussing about food, love, and reasons for why all the girls love the protagonist. Finally, add some stupid comedy that might or might not make the viewers laugh and then, add many random supernatural events to which there is have no reasonable explanation.\\n\\n\r\nHead Producer [looking shocked]: If that is what you want, then I’ll do it. \\n\\n\r\n[He stands up and heads towards the door with everyone else. Suddenly, the director stops him.]\\n\\n\r\nDirector: I forgot to say. Keep it to only one season, no sequels.  And have one OVA, which is mainly filled with fanservice material, so we can pander to the fans.\\n\\n\r\nHead Producer [looking relief]: Now, that is what I want to hear. I’ll get to work, right away.\\n\\n\\n",
            "date": "2015-06-16T08:15:00+00:00",
            "helpful_count": 89,
            "mal_id": 190410,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4408661.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Blood_Diver_A",
                "username": "Blood_Diver_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=190410"
        },
        {
            "content": "Watching Akane-iro is akin to dating the hot blond in class, only to find out that the most exciting conversation they can field is who Britanny Spears will date next.\r\nAkane-iro certainly had potential. Attractive character designs, famous voice actors, a decent sound track. \r\nSure, like the desire to go out with blond bombshell, the story of a girl forced to move into the house of his future fiancee... who *happens* to be a your average anime guy who just also* happens* to have a hot sister is not exactly original. But you think\r\n\"Hey, the voice actors and animations are good, and such stories, no matterhow cliched, can be fun.&quot;\\n\\n\r\nToo bad that after a few dates (episodes), the shallowness of series reigns supreme. Spas, School Festivals, Guy and girl landing in awkward positions... they're all here. While any anime featuring an over abundance of such scenes will not be a masterpiece, some can execute them well enough to at be pretty good.\\n\\n\r\nUnfortunately, Akane-iro fails more than it succeeds, each filler episode is a cliches of cliches, with as much unexpected events and funny moments as watching your cat drink a bowl of milk. The visuals are cute, but nothing's going to make you stare at for 30 minutes straight.\\n\\n\r\nAre there any redeeming qualities for Akane-iro?  It may be worth watching for the few scattered non-filler episodes that are surprisingly good (Episode 5 and 11  on their own would score a 9), but these only serve to highlight how abysmal most of the filler episodes are , (say 4, 6 and 7), which land firmly in the 4 - 6 category. \\n\\n\r\nAkane-iro's deserves only to run as a small window at the bottom corner of your screen, whose only purpose to provide a minor distraction as you try to finish that blasted assignment.\\n",
            "date": "2008-11-23T06:32:00+00:00",
            "helpful_count": 69,
            "mal_id": 9776,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101649.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ceptryn",
                "username": "Ceptryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=9776"
        },
        {
            "content": "Akane-iro ni Somaru Saka is a Romantic, Comedy like any other. That’s pretty much all there is to describe this mediocre anime series and if that doesn’t satisfy your information needs then by all means continue with this review.\r\n“Seen it, been there, done that…” Those are the thoughts that came to mind whilst I watched the first episode. It starts of ordinary enough when some posh girl (Yuuhi) is helped out by some guy (Junichi), who’s pretty well-known for some stupid rumour. Well at the beginning of the new school semester it comes to no surprise that said girl transfers to Junichi’s school and thusbegins their rocky relationship. Now I’ve got to say the end of the 1st episode was pretty funny because it was rather unexpected but after that brief moment this anime soon reminds us that sticking with the norm isn’t always the best choice. Here we have a barrage of anime tropes & clichés however I think this anime goes out of its way to contain every single romantic comedy cliché imaginable, including the arranged engagement between Yuuhi & Junichi and the two living together.\\n\\n\r\nFor the most part it is a series of random misadventures ranging from stuff like the old abandon school expeditions and even these mundane moments could have been more interesting if the characters weren’t so ordinary. There are a whole bunch of characters here, like the typical nurturing sister whose name I forget but the only ones worth mentioning are the main pair Junichi & Yuuhi. Like a lot of people I absolutely hate the loser type protagonist that appear in the romance genre, which is why I should like Junichi for not falling into the category but sadly apart from some amusing moments I just can’t seem to get used to this guy who always seems to have a chip on is shoulder. It doesn’t help when there’s a heroine like Yuuhi, where you just have to think of her as an older version of Nagi (Hayate no Gotoku!).\\n\\n\r\nWell it’s no surprise that Nagi comes to mind as they both share the same voice actor and there are also other similar voices to be found here, seeing how this anime has a lot of well-known VAs and sadly that’s what stands out and not the music or the cheesy SFX. The animation on the other hand just doesn’t stand out at all. With a very similar look to anime such as; H20 & School Days, the only feature that seems to stand out are the girl’s exaggerated hair that no one could find appealing.\\n\\n\r\nOverall Akane-iro ni Somaru Saka actually had a decent romance going on at some points but the random misadventure only proved to be a great annoyance to the story & the romance’s progression. Stuff that’s supposed to be funny just wasn’t but at least there are a few random things to chuckle at. In the end I was driven to despair, because this anime actually had some potential but did its best to ruin it every step of the way.",
            "date": "2009-01-17T12:35:00+00:00",
            "helpful_count": 37,
            "mal_id": 11619,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=11619"
        },
        {
            "content": "Well... honestly, I don't know why I enjoyed watching Akane-iro ni Somaru Saka like I did, but here I am. I didn't take it seriously, though, for it was impossible to take it seriously. While I was watching it I was really just making fun of it most of the time. Why, you might ask? Well&hellip; it was just so darn stupid. Clich&eacute;d. Annoying. You get the picture.\r\nThe story centers around a seemingly normal guy named Junichi, who rescues a tempered girl named Yuuhi (what is up with that girl&rsquo;s hair?) from some guys who were trying to pick her up (oh wow, an exampleof pure originality right there&hellip; not), and after misunderstandings arise and a first kiss ensues, it turns out that Yuuhi just happens to be Junichi&rsquo;s fianc&eacute;e. So she lives with him in his house under conditions of her father to see if he is a suitable fianc&eacute;, along with Junichi&rsquo;s well-endowed sister Minato, etc, etc, etc. Now, this story has some potential&hellip; sort of. But the episodes were filled with so many clich&eacute;d moments it was just&hellip; bad. You know those moments, the romantic kind maybe where someone &ldquo;accidentally gropes the girl&rsquo;s breast&rdquo; or someone &ldquo;accidentally falls on top of the other person&rdquo;. The typical &ldquo;filler type episodes&rdquo; are there too, such as a trip to the onsen or the &ldquo;school festival episode&rdquo;. These type of things can actually be fun to watch, for though they&rsquo;re repeated, they&rsquo;re repeated for the reason that they can bring enjoyment to an audience. However, in Akane-iro, it wasn&rsquo;t funny or interesting or really&hellip;anything.\\n\\n\r\nNow for characters. I am sorry to say there is not one character in this cast that I actually like. I don&rsquo;t know why exactly, but none of the characters are likeable. None of them are original, though Junichi is a different protagonist than the general guy caught up in a harem of this sort. As the series progresses, you are supposed to either side with Yuuhi or side with Minato. This would make sense, typical love triangle. There is one tiny problem though&hellip; Minato is Junichi&rsquo;s younger sister. Meaning, incest themes abound! For a while I&rsquo;d thought that Minato was adopted, but I wasn&rsquo;t sure if it was ever fully explained&hellip; so that was pretty stupid. I might have missed something though because sometimes I didn't pay attention. Go watch it yourself and see. Anyway, Yuuhi is the typical tsundere type, which I either really like or just am annoyed by completely. Unfortunately the latter won out the former on that one. Minato is more of a sweet, intelligent, and good at housekeeping type of girl, which also annoys me. Junichi&rsquo;s friends, the minor characters, were okay, like Fuyuhiko and Tsukasa. The student body president amazed me with her absolutely insane hair. Forget the comment about Yuuhi&rsquo;s hairstyle, just look at Mitsuki Siina! Seriously, how does she do it? Does she get up at 3 AM and just slap on the hairspray?\\n\\n\r\nAnyway. Moving onto sound, which is the reason I actually started watching this show. I came across it randomly from what I saw a friend was watching and I decided to watch it not only because it was on a whim but because of the popular voice actresses in this series, like Rie Kugimiya, Aya Hirano, Emiri Katou, and Inoue Marina. They all did a good job, all the voices fit their characters. But for some reason, I just could not stand Junichi&rsquo;s voice at all. I&rsquo;m not sure why&hellip; I guess I just didn&rsquo;t like it. The music didn&rsquo;t stand out much, and I don&rsquo;t really like the opening theme at all, though it could get in your head (regrettably so). I never much paid attention to the many ending themes. They were sung by the various voice actresses I believe.\\n\\n\r\nThe animation&hellip;it&rsquo;s okay, but it&rsquo;s not that good. Movements are generally stiff, the anatomy often looks wrong with people out of proportion. It&rsquo;s not fluid and it has no flair. It&rsquo;s nice enough to look at, I suppose.\\n\\n\r\nI was going to give this a 5&hellip; but I suppose I shall give it a 6, for I did like watching it most of the time, even though I thought it was terrible.\\n\r\n: D",
            "date": "2008-12-20T14:04:00+00:00",
            "helpful_count": 28,
            "mal_id": 10520,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21061.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/maybelletea",
                "username": "maybelletea"
            },
            "url": "https://myanimelist.net/reviews.php?id=10520"
        },
        {
            "content": "Akane-Iro ni Somaru Saka is the newest eroge adaptation by TNK, which are more famous for their work in School Days. Oh, another eroge made into an anime...inb4lameharemrite? Thats probably one of the first thoughts what will cross your mind when approaching this title, and to be honest you are not that wrong. If you cannot handle these times of anime, then you might as well give this a pass.\r\nStory: The story is nothing out of the ordinary for this anime, it follows a lot of cliches many animes have done in the past for this genre. The main heroine Katagiri Yuuhi, gets into troublewith some strangers, and gets rescued by the main lead Nagase Junichi. After a series of misunderstandings we learn that Yuuhi is Junichi's fiancee as decided by their parents. And now they must learn to get along while Yuuhi lives with Junichi and his sister Minato.\\n\\n\r\nArt: In terms of art this showed a lot of promise. With interesting and beautiful character designs that look perfect as long as they are still shots, because unfortunately throughout the series there were times where the animators got sloppy and the characters looked distorted and sometimes plain ugly.\\n\\n\r\nSound: In terms of sound, this is probably where most of the people will get drawn into the show. The voice cast of this anime is just something to make your jaw drop, we have top quality voicing from Kugimiya Rie, Hirano Aya, Hirohashi Ryou, Tanake Rie, Katou Emiri, Inoue Marina, and more playing major roles in this show. And they all portray their characters very well as expected by such good seiyuus. On voice cast alone the sound part would get 10/10 but VA is not all there is to an anime. The actual music used for the anime is rather simple and none really stand out much. So 8/10 is a fair score to give this show.\\n\\n\r\nCharacter: This is probably both the best and worst part of the anime. The characters are diverse and interesting, and you feel like you wanna learn more about all of them. However the anime only focus on the main heroine Yuuhi most of the time leaving the rest of the cast in the shadows. And then the anime proceeds to throwing away all effort they put in character development with a very disappointing ending. It feels like the anime wasted a great cast of characters.\\n\\n\r\nEnjoyment: I would be lying if I said I didnt enjoy the show somehow. It certainly wasnt that great of an anime, but it had its moments where I honestly had fun watching it. It depends on your tolerance with these types of animes.\\n\\n\r\nOverall: The show was nothing out of the ordinary. A lot of stereotypes and pretty terrible writting and producing turned this anime from something that had a lot of potential into something mediocre with not much to remember. It feels like this show could've been much more that it ended up being, and its a shame that wasnt the case. If you are looking for something that is different from the rest of the shows out there, this show is not for you. If you are looking for a show to waste some time, then by all means go ahead and give this anime a try.",
            "date": "2008-11-03T10:53:00+00:00",
            "helpful_count": 27,
            "mal_id": 9210,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/23773.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/game8910",
                "username": "game8910"
            },
            "url": "https://myanimelist.net/reviews.php?id=9210"
        },
        {
            "content": "Akane-iro ni Somaru Saka is pretty much your basic \"harem anime, \" and I have to say that it stays pretty tried and true with its formula.\r\nIt starts off with Junichi (main male lead) meeting this mysterious rich female transfer student (Yuuhi) who has been forced to marry him by her dad. This happens early on and you would expect the rest of the anime to have them slowly grow close to each other, but oddly enough it doesn&rsquo;t really do that, even though they are the main couple of the title. For most of the anime it seems to have Junichi and his friendssimply messing around having fun, from having parties on a boat, to school festivals and the like. Now I realize that with a title that has &quot;slice of life&quot; elements to it, this would be a standard formula for them to use. The only problem is they tended to stick so much to the gang just having fun, that I honestly forgot that Junichi and Yuuhi were even suppose to get together. There is even talk at the beginning that Junichi has some weird alternate personality to him, (which he does) and at that point I was expecting it to play some sort of key role in things, but again it doesn&rsquo;t really do that. In fact from what I remember counting, he only shows it about 3 times during the series. And even at the end of the anime I am not quite sure just what kind of &quot;major&quot; role it played in things, as it seems they could have removed it completely from the story and it wouldn&rsquo;t have mattered. Now things do start to pick up &quot;romance wise&quot; in the title, but that doesn&rsquo;t happen until around the last three episodes. When I say that this is a harem title that is a bit of a stretch, because out of the nine girls only three actually like him, and one of them it doesn&rsquo;t really even go past words. Now I have to give credit to them on the ending, I certainly wasn&rsquo;t expecting it to end the way it did when I first started watching this, and it sure was a different kind than most viewers will be expecting too. Plus it actual does conclude and he ends up together with one of the girls, so that&rsquo;s a big plus. So you don&rsquo;t have to worry about investing your time in this only for it to end without any kind of resolve. Even though this title does have some echhi-ness factors, it doesn&rsquo;t really go too deep into it. You may see a casual panty shot about three times in it, but most of it comes in the form of cleavage shots, and even that isn&rsquo;t really shown off too much. There is one episode where they visit a hot spring (or take a bath in general), but the steam censors it, at least the version I watched did. So anyway, because it doesn&rsquo;t really focus on the romance for a good portion of the show, you kind of have to take the enjoyment on an &quot;episode by episode&quot; case. There is some decent humor in this, but I don't think it will be enough to keep you into it. There is a small plot going on about what Junichi actually is, it can get interesting at times as more hints are given out as the story progresses...even if its not really well explained at the end.\\n\\n\r\nThe animation was good in this, while nobody ever really moved around enough to get a true judging on the whole &quot;fluidity&quot; aspects of it, the characters did come off with a certain charm to them. And I have to say that some of the hairstyles on the women were kind of bizarre--yet oddly charming. You get a lot of sunset scene here and it looks good enough to at least make you take notice of it. But the character design is probably the best thing regarding the art, while they weren&rsquo;t really drawn highly detailed, they did have appealing qualities such as (again) the hairstyles, expressions, and the clothing that they wear. The backgrounds never really stand out though, they are not drawn badly by any means, but not detailed enough to really take notice of them. Which in turn could be either a good or bad thing, because it makes you stay focused on the characters themselves.\\n\\n\r\nThe opening and closing theme were pretty nice, they both contained a bit of a happy--yet sincerity style to them. For some reason the opening makes me kind of sad, not because its bad, but just the way the music is displayed. Now I have to talk about my favorite aspect of this anime, and that was the voice acting! I won&rsquo;t go as far to say that it was spectacular or anything, but I did feel that each characters voice matched beautifully with the characters. Especially with a female named Minato, she had that kind of &quot;nice girl&quot; personality to her, and her voice actress complimented that very well for her. Nothing really worth mentioning about the background tracks, nothing there is particularly memorable, in fact even now I can&rsquo;t really remember much of it.\\n\\n\r\nThere are over twelve characters in this anime, but unfortunately you only get actual character development with three of them. Even to this day I am still unsure as to who some of the supporting cast members actually were, due to the fact that some would only show up every now and then as the story progressed. Nobody should ever really come off as annoying to the audience, though some people may be turned off with Junichi. Because despite his whole &quot;double personality&quot; ordeal, he doesn&rsquo;t really have much of an impacting persona, and seems to just kind of, well...be there.\\n\\n\r\nSo in conclusion, Akane-iro ni Somaru Saka isn&rsquo;t the worst of the harem titles out there, it really isn&rsquo;t even a bad anime in general, the story is what really brings this title down. Though I did end up finishing this, only because I don't like to drop something when I am well into it already. (again you can't anticipate any of the overall story since it doesn't really build much up, you just have to enjoy each episode as it happens if at all possible) If you&rsquo;re a hardcore harem fan and want something that is unique to the genera, then you probably should just look elsewhere, because this one is pretty standard fare. But if you&rsquo;re looking to maybe get into the genera, or are willing to go in with lower expectations, then I think you should be fine.\\n\\n\r\n&quot;Akane-iro ni Somaru Saka&quot; gets 5 censored bath scenes, out of 10!",
            "date": "2008-12-29T13:17:00+00:00",
            "helpful_count": 21,
            "mal_id": 10778,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70369.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Retro8bit",
                "username": "Retro8bit"
            },
            "url": "https://myanimelist.net/reviews.php?id=10778"
        },
        {
            "content": "Akane-iro was something i found hard to keep watching but i always complete what i start so i had to go thru it.\r\nStory\r\nWhen i watch ecchi/harem anime, i watch to enjoy them visually like almost everyone that watches this genre and not for the story 'cause who in their sane mind would watch ecchi/harem for the story? nobody, unless is something great like Golden Boy, but that doesn't mean mediocrity is acceptable when watching these genres, character development is just as important as the visuals in which both this anime fails, the story is mediocre, there's noting much to say other than the Main dudeJunichi meets a girl who didn't know he was going to marry and because he kissed her by ''accident'' (usually bad plot device), she now hates him for that and not because she has to marry him, that schtick goes on for 11 episodes and the ending to that annoying dynamic is bad.\\n\\n\r\nArt & Animation\\n\r\nThe art was fine, there are better works out there but for an ecchi anime it should be better.\\n\\n\r\nSound\\n\r\nThe voice acting wasn't amazing, looking at who the seiyuus are it should have been great but it was just fine.\\n\\n\r\nCharacter\\n\r\nThey were mediocre even with that VA cast that couldn't make them likeable, they stay the same all the time, annoying characters.\\n\\n\r\nEnjoyment\\n\r\nThere was not much to enjoy more than the ok sound and animation which is important in an ecchi anime along with the characters but these characters were mediocre, the OP is bad and the ED song of Ep. 10 was good, but in general this was hard to watch.",
            "date": "2015-08-05T15:57:00+00:00",
            "helpful_count": 17,
            "mal_id": 195263,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195263"
        },
        {
            "content": "*Contains major spoilers\r\nFirst time I get to see a VN based anime, so I didn't know exactly what to expect from it, also because the game is an eroge... I guess it was good enough afterall, but all this fixation about \"imouto fantasies\" and incest, that japanese have, is really weird... I think it's ok this time, because everything got explained in the end...\r\n{STORY - 5/10}\r\nJun'ichi was a real badass on Junior High and even got the \"Geno Killer\" nickname. Despite not fighting anymore, he was able to save Yuhii on the first episode without lifting a finger, people were affraid... She got transferred tothe same school next day and, soon enough, a relationship would be born between those two.\\n\\n\r\nThanks to an unexpected act from Jun'ichi, Yuhii begins to hate him. However, living under the same roof would boost their connection and improve their relationship. Like any other tsundere character, Yuhii slowly starts to show her feelings, as she gets closer to Jun'ichi. Problem is that his sister, Minato, would play this game too later on.\\n\\n\r\nSidestory from Jun'ichi's parents isn't an essential part, but pieces from it are featured on every episode, since they're key characters for this plot. His second encounter with Yuhii was something decided between both Katagiri and Nagase families, so they're important.\\n\\n\r\n{ART - 4/10}\\n\\n\r\nNothing really special about it. Actually, is pretty basic and dull, since it isn't filled with action nor features great battles and everything. Like most VNs, eyed are bigger than usual and clothing styles are very common. Overally, basic.\\n\\n\r\n{SOUND - 3/10}\\n\\n\r\nOP song is cheering, but is also annoying. There are several ED songs, with just one main theme. Most of them are better than the intro's one and they share the same genre.\\n\\n\r\n{CHARACTERS - 4/10}\\n\\n\r\nWe have Jun'ichi as main male protagonist, that suffers from an identity crysis and is very indecise, unable to choose what he really wants. He may look strong willed, but that's just a cover to his fear of being alone. Minato is sweet and always smiling. She hides her real affection from Jun'ichi because they're siblings. Yuhii is the typical tsundere, nervous and cold, still, able to show deep love after some time. Her hatred for Jun'ichi decreases as he gets serious about their relationship.\\n\\n\r\nOther characters include weird Nagomi, who hides a dark scheme under her sleeve, and both Fuyuhiko and Sugishita, that seem to like Jun'ichi more than usual. Actually, that's just a way to provocate him...\\n\\n\r\n{ENJOYMENT - 10/10}\\n\\n\r\nIt's a pretty funny anime actually. Nothing amazing about it, but I was able to have a good time, and that's all that matters to me. Maximum enjoyment!\\n\\n\r\n{OVERALL - 4/10}\\n\\n\r\nChoosing between two girls, one of them being your little sister. Jun'ichi has to act like a man and say what he really feels, despite all the negative circunstances. Will he run away from destiny his entire life? Or take a mature decision and be with the person he loves?",
            "date": "2013-10-31T05:46:00+00:00",
            "helpful_count": 12,
            "mal_id": 118845,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 10,
                    "overall": 4,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=118845"
        },
        {
            "content": "Akane-iro ni Somaru Saka has potential, but fails to deliver it throughout the episodes. The first episode sets up the story, and it is certainly interesting. However, unfortunately from there, it goes downhill. From a great introduction, Akane-iro ni Somaru Saka then becomes dully episodic, and most of episodes have little to do with with the actual story. The plot is really only addressed in the last 2 episodes, which, I have to admit, does do a decent job in wrapping everything up.\r\nThe characters are unique, but their development throughout the anime is pretty bland.You can just expect how each character would act in anygiven situation. Yuuhi is the obvious tsundere would would always deny her true feelings and make it obvious that she's doing it. She almost does this in every single situation... It's interesting to watch her in action the first few times, but afterward, something new is needed, but never comes around.\\n\\n\r\nSound and art are decent. Nothing bad, but doesn't deliver anything amazing or new either.\\n\\n\r\nThe comedy is decent, but good scenes that really makes you laugh out loud are rare and infrequent.\\n\\n\r\nOverall, Akane-iro ni Somaru Saka had potential, but the anime in its entirety does not meet up to expectations it sets in the beginning. I suggest this only if you've ran out of other things to watch.",
            "date": "2009-01-01T19:39:00+00:00",
            "helpful_count": 12,
            "mal_id": 10932,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/51496.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/gdavge2003",
                "username": "gdavge2003"
            },
            "url": "https://myanimelist.net/reviews.php?id=10932"
        },
        {
            "content": "I only write reviews which defend animes thats been UNDERATED like this one.\r\nI have no idea why people are mocking this anime, there is nothing wrong with this anime.\r\nThe storyline follows the classic romance comedy, face it people, pretty much All romance comedies containing harems follow pretty much the same storyline, in fact this anime was actually more difficult to predict than standard romance comedies. I actually predicted the ending wrong which very very rarely happens.\r\nI see in some reviews people mentioned that this anime was Cliche. I don't know how many romance comedies you've seen but to call this anime \"Cliche\" you obviously haven'tseen many romance comedies. I've seen over 80 and I will tell you compared to most other romance comedies this anime is far Less Cliche.\\n\\n\r\nThis anime is suppose to be a fun anime to watch thats enjoyable and easy on the emotions, if you are looking for epic romance or plot/storyline based animes then you should probably go watch shojo animes or rl serieses.\\n\\n\r\nArt work, outstanding, amazing, 10/10 would like to give 11/10 if possible.\\n\r\nEnding is resolved unlike ichigo 100% which has a total crap ending.\\n\r\nSome very funny parts. \\n\\n\r\nStoryline follows the typical romance comedy with Some original ideas. ---&gt; 7/10\\n\\n\r\nCharacters, very little flashbacks and all the characters could be developed better by revealing more about their lives however, this is suppose to be a fun anime to watch and they are such lovable characters (Mainly because graphics are so good) so I can overlook the negative points.  ---&gt; 7/10\\n\\n\r\nGraphics, couldn't ask for better. Smooth render, not pixelated at all. Very good use of colours and all girls/guys are bishojo/shounen (Eye candy so to speak) well illustrated and drawing of each character reflect their personalities perfectly. ---&gt; 10/10\\n\\n\r\nSound. Well just look at the cast and you will find all the voices you like in this anime. Opening is nice and it seems that this anime has a different song for each ending which is unique. ---&gt; 10/10\\n\\n\r\nAverages out to 8-9/10, anything lower than a 7 would mean you don't like romance comedies since most are worse off than this one.",
            "date": "2009-01-26T17:58:00+00:00",
            "helpful_count": 11,
            "mal_id": 11857,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/89565.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeKraze",
                "username": "AnimeKraze"
            },
            "url": "https://myanimelist.net/reviews.php?id=11857"
        },
        {
            "content": "WARNING: THIS CONTAINS MY OPINION AND A SPOILER!\r\nThis anime might be the most boring anime I've seen. And the worst ending I've seen. From episode 1-9, it was decent. nothing really happened, and I was sure this anime wasn't going to be anything special. At episode 10 I changed my mind from: \"meh nothing special\" to: \"wow! this might actually be a good anime after all\". I thought that it might have a good ending after all, but turns out I was wrong. After watching episode 11, I was sure there was no way out of this mess. There was no way this could havea good ending, or maybe a decent one. And I were right, I watched episode 12 found out that episode 3-12 doesn't even have to be there. Because the relationship between boy, sister and girl in episode 2 is same as the ending of episode 12. its hard to explain. But what I want to say is that if you haven't watched this anime yet, you can just skip episode 3-9. the story doesn't change. \\n\r\nEven though it had  good soundtracks, famous voice actors and good character desing, it wasn't as enjoyable as it should have been. the story ruined everything lol.\\n\r\nTHANK YOU FOR READING THIS CRAPPY \"REVIEW\".\\n\r\noh and btw this isn't a review, its just me writing shit while sleeping.",
            "date": "2010-06-08T17:09:00+00:00",
            "helpful_count": 10,
            "mal_id": 26935,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/338895.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dianim",
                "username": "Dianim"
            },
            "url": "https://myanimelist.net/reviews.php?id=26935"
        },
        {
            "content": "Preview: \r\nSuffice it to say that an angry highschool-girl/bear orgy in a hot spring( which totally should have happened in episode 6) would have been a great way to separate this piece of crap from the crowd.\r\nReview:\r\nWitness THE GENERIC HAREM ANIME STENCIL!!! \r\nI have just found a new way of watching anime. Within the first 5 minutes, if i realize that it's a piece of crap, I can skip through each episode in about a minute and just piece together what it's about without missing anything important.\r\n(maybe 10 clicks through the timeline, stopping to watch for a few seconds every now and then) \r\nUsing thisamazing new technique i can say that this anime is the same as a hundred others. I have dubbed the creation method of this type of anime: THE GENERIC HAREM ANIME STENCIL.  ( btw \"Beck\" is awesome)\\n\\n\r\nSo we have two chicks, one the main dude randomly meets and the other his sister (?) and the rest of their class comprising this boring harem. Uhhh....we have some sort of all around infatuation with the main guy im not sure why. \\n\\n\r\nAlso the chick he randomly meets gets to (WAIT FOR IT!!!!) randomly live with him for whatever reason. Cause, hey look, you know its hard to write material that generates sexual tension without every love interest living in the dudes house... (stop reading and go watch Beck)\\n\\n\r\nSomething concerning military stuff happens during the show...not quite sure why or what but it probably doesnt matter. \\n\\n\r\nSuffice it to say that an angry highschool-girl/bear orgy in a hot spring( which totally should have happened in episode 6) would have been a great way to separate this piece of crap from the crowd.\\n\\n\r\nOh right so that hot spring scene i never saw coming...same with those scenes where the main dude is alone with each of the chicks in the rain or in a cave or on a scary walk or a haunted house or uhhhh a farm? Anyway I bet 50 bucks that it happened in a contrived manner which is where I was going with that...\\n\\n\r\nOH YEA. I definitely hear the voice of Asuran from Gundam Seed in this show AND a gundam shows up....and a big octopus....who im sure had insane super-robo sex but again im skipping through....  (are you watchin Beck yet?)\\n\\n\r\nSo the last 4 eps were pretty uneventful other than the lucky click i made where the sliver haired chick was in the shower but again i was pressed for time and couldnt watch to see what crazy stuff would happen next.\\n\\n\r\nIn summary: more beastiality coulda helped this stupid show. Also I had Dennis Leary's Lock and Load in the background so that made it awesome, hence the 2 out of 10 and not the 1.\\n\\n\r\nOne more thing. Go buy or DL Beck. Go see it. Its the opposite of the lifeless drivel i just reviewed. ITS AWESOME!!! WATCH IT IN ENGLISH (seriously its far superior that the j dub)  IN ENGLISH THE DUDE WHO DID YUUSKE FROM YUYU HAKUSHO IS IN IT AND HES RAPPING I SWEAR TO GOD.",
            "date": "2009-09-16T02:18:00+00:00",
            "helpful_count": 9,
            "mal_id": 18826,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/63643.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Skins2153",
                "username": "Skins2153"
            },
            "url": "https://myanimelist.net/reviews.php?id=18826"
        },
        {
            "content": "Akane-iro ni Somaru Saka at first seems like a cliche romance and all. Accidentally meeting in an awkward way and ending up together. Thle story would've fit like that especially since the two main protagonists were giving hints of their feelings for each other. but that wasn't the case, it didn't happen. \r\nI gave the story a 5/10 because I personally hated how the story ended. I wanted it to be a bit more cliched cos if it was it would have been more fun to enjoy since you get those butterflies in the end when you see that the two main characters end uptogether.\\n\\n\r\nThe art was good, i gave it a 9.\\n\\n\r\nThe sound was okay, i have no comment. I gave it a 6.\\n\\n\r\nCharacters were a bit confusing but then later on easy to get, I gave it a 7.\\n\\n\r\nOverall it wasn't a bad anime, I was just really disappointed with the ending.\\n\\n\r\nbut if you like romances with a bit of twists in them then you should totally try watching this but if you're more into cliche kind of romances, the romances that will make you moe since you guessed the ending right and you get butterflies in your stomach.. it may not be a good idea to watch this >< \\n\\n\r\n-end-",
            "date": "2010-08-09T06:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 29452,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/360493.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SweetIchigo",
                "username": "SweetIchigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=29452"
        },
        {
            "content": "WARNING: This review contains spoilers and lots of swearing\r\nPeople say the journey is more important than the destination. However, after watching this tripe named Akane-iro ni Somaru Saka, I realized that isn't always the case. Nothing can compare to the amount of disappointment I got after finishing this series. This anime, although clichéd in a lot aspects, I actually thought was pretty passable. Well, that was until that asspull ending so big I think I ripped my anus.\r\n*STORY: 4/10\r\nAkane-iro ni Somaru Saka or Akasaka for short, is an anime produced by TNK based off a visual novel with the same name by Feng. The storystarts off with our main protagonist Nagase, Junichi saving a girl from being harrassed by men while on his way to school. Junichi later found out the girl he saved is the rich new transfer student Katagiri, Yuuhi. Yuuhi, at first, had a good opinion of Junichi but that changed when Junichi, because of his chuunibyo delusions, kissed Yuuhi out of nowhere. Now branded as a pervert, Yuuhi hates Junichi's guts. Much more to Yuuhi's disappointment, she discovered Junichi is actually her fiancé she transferred in to check up on. Yuuhi now decides to live with Junichi, together with Junichi's little sister Minato, to see if he really is worthy of being her bride. Thus the start of your typical romance harem.\\n\\n\r\nThe story is nothing special. Right of the bat we are bombarded with anime clichés like arranged marriage, the transfer student and the mandatory \"accidental\" kiss. It is your standard harem storyline complete with harem/ecchi tropes you have probably seen hundreds of times. However, if I have something I've learned from watching anime for years is that not all clichés are bad so I stuck with it. While Akasaka uses a lot of trite jokes mostly in the form of fanservice and side plots I couldn't care less about, there's still some enjoyment to be had in this anime. There was a point where I actually wondered why the rating was so low when it's not really that bad. The progression of the story is very slow, but the cute budding romance between our main couple, Junichi and Yuuhi, is enough to keep me watching. I genuinely got feels from this anime but sadly, everything was short-lived as they start to fuck up everything that was good about this anime.\\n\\n\r\n~SPOILERS STARTS HERE~\\n\\n\r\nI was in a pretty good mood when Junichi and Yuuhi finally became a couple in episode10 and shared a steamy kiss (unaware of the impending disappointment waiting for me). What happened next was an obvious attempt by the creators to be \"unique\". \\n\\n\r\nJunichi started doubting his feelings for Yuuhi so he had a serious little chat with his best friend (at this point I'm already filled with great trepidation) well you know what happened next. On the act of the imouto gods, Junichi realized he's actually in love with his little sister Minato. WHAT THE FLYING FUUUUUUUUUUUUUUUUCK!!!!!!!! And what's worst, Yuuhi is ok with it! Junichi confessed to Minato later, and it seems their feelings were mutual. The anime ends with Minato entering the bathroom to give Junichi a nice incestuous back scrub and later, Yuuhi also joined the bath saying she wouldn't just give up so easily blah blah. Ending credits.\\n\\n\r\nMy buddha, the only saving grace of the anime turned out to be a bag full of dog shit. Mind you, I'm not a fan of incest but that's not actually the main reason why I'm ranting so much about the ending. On the scale of 1 to Yosuga no sora, this anime is about a 7. Well it was hinted (but never confirmed) that Junichi and Minato aren't blood-related. You know, the usual pseudo-incest anime pulls off? The incest is part of the reason too but the main reason I am not very happy about that ending is because the ending basically rendered 10 episodes of developing Junichi and Yuuhi's relationship ABSOLUTELY POINTLESS. It felt like a everything was a fucking waste of time. Junichi and Minato hardly had any romantic interaction through-out the show and we just found out later that they actually liked each other, like what the fuck?\\n\\n\r\nTo be honest, I like Minato more as a character (not really as a love interest though) because Yuuhi is an annoying tsundere, but this is not how you end an anime. It's obvious the creators were trying to be different here, which isn't bad, it's just this time they failed VERY MISERABLY.\\n\\n\r\n~END OF SPOILERS~\\n\\n\r\n*CHARACTERS: 5/10\\n\r\nWell there's nothing really much to say about the characters because they are very one-dimensional; aren't unique or special in any way at all. We have the usual violent tsundere, the caring little sister and of course Akasaka wouldn't be considered a harem without other girls crushing on the main protagonist for reasons we don't know.\\n\\n\r\nThe main protagonist Junichi, in my opinion, is probably the most likeable of the characters mainly because he's not your usual overly perverse romcom harem MC who blushes and have fatal nosebleeds on every sight of something titillating. MCs like him are more common in action harems and I must say I greatly prefer this type of MC. However, that is not nearly enough to make up for the lack of character development in almost all of the characters, and not to mention, the whole bunch of other unimportant characters added just for the sake of having more characters.\\n\\n\r\n*ART/ANIMATION: 6/10\\n\r\nThe first thing I've notice was the character designs, more specifically the character's hairstyles that looked like it took them 10 cans of hairspray to shape it that way. They have some of the wildest hairstyles that I've seen in anime that is not battleshounen. TNK doesn't really stand out when it comes to art quality, though their animation can be good sometimes. When you look at their other works, art and animation is average at best. Akasaka's art and animation quality is not that much different.\\n\\n\r\n*SOUND/MUSIC: 8/10\\n\r\nWhen you have a cast of talented voice actors like Rie Kugimiya and Aya Hirano you can almost never go wrong with voice acting. And for Akasaka's opening and ending theme, well it's pretty okay but not really what I would consider memorable. \\n\\n\r\n*OVERALL/ENJOYMENT: 4/10\\n\r\nAkasaka, while it had its good moments, was mediocre at best, but it just have to sink even lower by pulling off that stupid ending. Unless you have a thing for imoutos, you should just stay away from this anime and forget it even existed, because what awaits you is just great disappointment and possibly anal fissures.",
            "date": "2015-08-05T09:43:00+00:00",
            "helpful_count": 8,
            "mal_id": 195231,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3166039.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Xynic",
                "username": "Xynic"
            },
            "url": "https://myanimelist.net/reviews.php?id=195231"
        },
        {
            "content": "“Akane-iro ni Somaru Saka” is one of those Anime that draws you in with the first episode. At the beginning of the series, you end up forming high expectations of the Anime because it in the long run is different from the cliché, only to have these expectations dashed at the end of the Anime because the storyline just couldn't hold itself together. Because of this, it is going to be very hard to leave out spoilers in my review.\r\nThe Anime starts off with the protagonist finding out that he has a fiance and the two of them living together. This particular plot device isactually used in quite a few Anime, which makes it a cliché. While this cliché tends to come across poorly, what drew me into this particular storyline, was the fact that this seemed like a fresh side to the cliché that was actually for once fleshed out. I found myself rooting for Jun'ichi and Yuuhi to get together by the end.\\n\\n\r\nAnd that is exactly why the Anime is such a let down. Basically, “Akane-iro ni Somaru Saka” is based off one of those dating simulation games over in Japan that are so popular. Normally, when this kind of media is adapted to an Anime, the viewer will have a bunch of pairings to choose from to root for, because the feelings of a bunch of characters are actually obvious. This way, when a different pairing then what you were rooting for becomes canon at the end, you aren't disappointed.\\n\\n\r\nHowever, with this particular Anime, the viewer is hit good and hard through a good portion of the episodes with Jun'ichi and Yuuhi. There are rather mild hints at other possible pairings, but the truth in the matter is, they are so very, very mild it isn't funny. They feel more like hints that could be misinterpreted as having a very different meaning. So, when the pairing between Jun'ichi and Yuuhi doesn't occur at the end, it is just disappointing, not matter how much you like the beginning.\\n\\n\r\nThe beautiful art work does make up for some of the plot failing, but the sound actually brings it down. Amongst the beautiful art work, I found myself wanting to slap my hands over my ears every time I heard Jun'ichi and Yuuhi speak. I know that their voice actors are popular and some people will fawn over any of their work, but I've heard both of them do better, or maybe the better word is, I've heard their voices in roles better suited towards them.\\n\\n\r\nI actually liked the characters at the beginning of the show, only to find myself frustrated with them later on. Sure, they were built on stereotypes, but the way they interacted was funny. So much so, I enjoyed the interactions. However, later on, these interactions fell apart and/or became boring. A lot of the sub characters were shoved aside for the main three and their importance diminished to filler.\\n\\n\r\nAs for my enjoyment, I honestly did like the beginning of the show. However, I was not happy with the ending, despite the fact it didn't come out of nowhere. I didn't really think of this as a harem Anime, until the end either, and then because of the ending, it became clear that this is a poorly done one. I think it is worth watching though, even if it is just once. That said... I do have an important warning that includes spoilers, but it is important for those who don't like this kind of show.\\n\\n\r\nWARNING: The person Jun'ichi decides that he likes is his sister.",
            "date": "2011-10-23T15:10:00+00:00",
            "helpful_count": 8,
            "mal_id": 46107,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66270.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Yemi_Hikari",
                "username": "Yemi_Hikari"
            },
            "url": "https://myanimelist.net/reviews.php?id=46107"
        },
        {
            "content": "This series is incredibly hard to interpret.\r\nStory: to start, the basic story is Junichi engaged to Yuuhi Katagiri, but Yuuhi refuses to acknowledge the engagement that her father has arranged and so she stays with Junichi before finalizing a decision...unfortunately, before moving in, she didn't have quite the pleasant experience meeting him...The first episode already was bland and it didn't really get interesting until we saw Junichi's sister, Minato, implicitly become Yuuhi's rival in Junichi's love.  That is where it got interesting...so there was a hint of incest relationship, which was a start for this series, but was eventually poorly executed.  Things areoften resolved too quickly in the series as if by magic.  Making each following episode very unappealing to look forward to as the show would continue to shift focus.  Eventually  Minato is chosen by Junichi but it was far too rushed with too many unexplained pieces of the plot in the final episode.  One after the other new things came out like Junichi as a subject, File X, etc...none of which was actually revealed earlier on in the series except in dull comedic scenarios.  All in all there was a story but it was poorly paced and executed.  4/10\\n\\n\r\nArt: Very noticeable poor animation quality, especially in the last episode where characters laughing looked like a bunch of bobble heads and possibly much more throughout the series that I don't remember or even want to remember.  The artwork was only mediocre.  Even worse in the last episode during the whole subconscious scenario and &quot;shadow of Junichi.&quot;  3/10\\n\\n\r\nSound: One of the only redeeming points of this series was its seiyuu cast.  What more could you possibly ask for than Aya Hirano, Rie Tanaka, Rie Kugimiya, and many more of the like all in one show?  Music, as expected was nicely done as a result.  7/10\\n\\n\r\nCharacter: If anything, there was no character development...at most we only got a bit of Junichi's past in the final episode.  Everyone else essentially played as side characters.  There was one episode with Tsukasa getting some nice plot development, but other than her, even Minato and Yuuhi who were the two lead female protagonists didn't get much background, and I won't get started on Karen, Mitsuki, and Nagomi. 3/10\\n\\n\r\nEnjoyment: This was suppose to be one of my highly anticipated shows this fall after being postponed from the horrendous summer 2008.  However, it clearly became one of the worse in fall 2008 and if anything one of the worst series in anime history for school-life romance series. 3/10\\n\\n\r\nOverall: This series was not good at all.  It had an amazing seiyuu cast and that was really about it.  I don't understand how anything could fail so hard with such an amazing cast.  If your old enough or simply daring enough, go play the ero-game...it's much more worth your time.  I only hope now the OVA will live up to its promise of a different story, let alone a much more compelling one.  This is not worth anyone's time watching despite the cast.  In a sense this show is like bad mouthing the seiyuus behind the scenes.  It had potential of being a satisfactory series around episode 9 or 10, but conflicts were simply rushed to be resolved leaving nothing really interesting for the final episode to work with much without having to rush the series to finish on a conclusive note... 4/10\\n",
            "date": "2008-12-31T01:18:00+00:00",
            "helpful_count": 7,
            "mal_id": 10847,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/10830.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Kit-Tsukasa",
                "username": "Kit-Tsukasa"
            },
            "url": "https://myanimelist.net/reviews.php?id=10847"
        },
        {
            "content": "Adaptations of harem based eroge have increased in frequency lately, Akane-iro ni Somaru Saka (hereby referred to as \"Akasaka\") is an example of one that has possibly been butchered due to some factors (using the seiyuu from the PS2 adaptations, the ending). Directed by Keitarou Motonaga, notorious for directing other harem anime (School Days, Onii-chan no Koto) and Katanagatari (a big surprise) Akasaka proves that it is a product of many trite, anime/eroge cliches that were mixed in a blender of sorts with hints of fanservice added as some sort of seasoning. Ah yes, the eroge itself was produced by feng around 1 year beforethe anime adaptation as well.\\n\\n\r\nEither way, I shall get on with the reviewing now. This is also my first review that isn't a joke so the probability of me making mistakes is pretty high.\\n\\n\r\nStory: 3/10\\n\\n\r\nThe main plot (which gets shoved out of the way within only 2 episodes, wow) is the stereotypical \"girl who has a bonus of being rich but she tries to make sure people don't know that ends up living with an ordinary high schooler who also turns out to be her fiancee, hilarity ensues\" one that is quite common amongst anime and eroge. The little differences are that the main heroine, Yuuhi Katagiri, turns out to be a tsundere (plus the \"ojou\" role is relegated to Karen Ayanokouji, someone who is only an add on heroine for the PS2 adaptation) and the Rie Kugimiya type too. The protagonist, Junichi Nagase, also probably fell for her at the beginning and as the series goes on he does build up his relationship with Yuuhi but it ultimately goes to waste in the end, for reasons that are possibly obvious and are what kind of add to the notoriety of the Akasaka adaptation. (Oops, spoiler.)\\n\\n\r\nWhen I mentioned in brackets that the plot does get shoved out of the way within only 2 episodes, it really does. The first 2 focus on Yuuhi meeting Junichi and making herself out to be a tsundere (since Junichi impulsively steals her first kiss, oh Junichi look at what you've done you indecisive harem protagonist) and Yuuhi getting to know Junichi's little sister, Minato. We learn about how Yuuhi is a sheltered rich girl in the second, but then we end up watching the cast's harem shenanigans afterwards until the last few \\n\r\nepisodes. \\n\\n\r\nOh yes, the classmates also decide to constantly remind Yuuhi and Junichi of the first kiss, to their dismay, and the dismay of the viewer since it gets irritating after the first few times. Episodes 3-10 are ultimately filler, even though some of them are dedicated to other not noteworthy cast members like the two childhood friends of Junichi, the main \"ojou\" (I think i'll say rich girl from now), the mysterious character whose motives aren't touched upon throughout the series, the school idol and student council president who is a trickster, the teacher who is childish and male and possibly others who will be described in the characters section. You could say they're there to develop the relationship but that could've been done without all these wasted minutes.\\n\\n\r\nActually, there were some things that were pretty cool (Junichi's parents, Nagomi's behaviour) but they were executed poorly and should've been relegated to a different series altogether. Here they were seen as unnecessary and plot holes that are never given any more thought.\\n\\n\r\n--\\n\\n\r\nArt: 5/10\\n\\n\r\nThe animation in Akasaka wasn't the worst, but it wasn't the best either. The animators possibly slacked off while working on the figures, as their faces were consistently off model at times (except for the last episode) when they were moving around and what not. The backgrounds were your standard fare for anime, not being really special in particular (although compared to others I haven't watched much so I might not be right in this area). The character designs were pretty fancy, mostly with the hairdos. The faces are cute, with the boy's faces making themselves look like they could qualify as successful crossdressers. Even though they weren't bad, they weren't entirely unique (Yuuhi's and Mitsuki's hairdos are pretty similar and if it weren't for Mitsuki's hat and different face they could've been mistakened for each other) the somewhat different faces and colours of the hairdos were the only ways you could differentiate the others. Watching Akasaka with the designs felt like watching someone playthrough a dating sim with animated scenes all around.\\n\\n\r\n--\\n\\n\r\nSound: 5/10\\n\\n\r\nThere's not much to say about the sound and music and whatnot, since the themes themselves were pretty forgettable and your standard J-pop fare. On the other hand, you can see that they used an all star seiyuu cast as replacements that would be used for the anime. With Rie Kugimiya (Yuuhi, of course), Aya Hirano (Minato), Wataru Hatano (Junichi), Akira Ishida (Fuyuhiko), Marina Inoue (Tsukasa)... anyone who wasn't a really minor character practically was voiced by a well-known seiyuu. (Aya is an exception as she was voiced by Kaori Fukuhara, and the Nagase mother since she was voiced by Atsuko Tanaka.) Sadly, their talent was put to waste and ended up being considered kind of annoying, especially Rie Kugimiya's tsundere spouting nonsense as Yuuhi. Some of the voices can get on the nerves of people, namely Minato's and Fuyuhiko's, maybe to mimic the original seiyuu? Who knows.\\n\\n\r\n--\\n\\n\r\nCharacter: 2/10\\n\\n\r\nAh, the part where you could easily frown at how badly they were handled. The characters in Akasaka were walking cliches, only having maybe one or two traits to separate them from the norm. The anime does try to make them look important and not flat; actually, that only goes for Junichi, but they fail.\\n\\n\r\nI'll be describing each of them, well at least from what I gathered from watching the anime.\\n\\n\r\nJunichi Nagase: Stereotypical harem protagonist who is living with an often praised little sister! Has two childhood friends, Fuyuhiko and Tsukasa, who like to trouble him a lot! Just like the student council president, Mitsuki Shiina, who uses him as some sort of lap dog of sorts since he's free! He also comes with the added traits of being somewhat idiotic when it comes to handling a tsundere, being untidy, really childish and having a back story that mainly gets focused on it during the last 2 episodes. Junichi comes off as manly and the only sane man in the first episode but he is then shown as a harem protagonist with a swimsuit fetish afterwards.\\n\\n\r\nHe is also snarky but that's because he gets treated like shit a lot by his friends. He goes through minor character development that maybe shouldn't qualify as character development. At the end he's revealed to have Chuuni syndrome (eternal manchild syndrome), something never mentioned anywhere else. It comes off as a weak excuse to add weak character development that you would only notice by him stating what happened. Indecisive as hell.\\n\\n\r\nYuuhi Katagiri: Token tsundere heroine who gets the bonus of being voiced by Rie Kugimiya and is also short and flatchested compared to the others. Also a rich girl who gets engaged to Junichi but shows her tsun side when he unexpectedly steals her first kiss and ends up using his first kiss too. Compared to other tsunderes, Yuuhi isn't as likable. She isn't as bad as, say, Naru from Love Hina or Louise from Zero no Tsukaima but she comes off as an incredibly shallow one who blames Junichi for most things. She also can't cook when she isn't being supervised and requires master chef Minato to help her. She seems to be knowledgeable about flowers and types of tea and teacups due to her upbringing as a rich girl too.\\n\\n\r\nMinato Nagase: Disgustingly sweet little sister demi-heroine who is possibly related to Junichi. Practically perfect, since she's great at household chores and is used to living in the jungle, she gets praised a lot by the other characters. Minato could be considered a Mary Sue because of her really friendly nature and plus she gets a good amount of attention in the episodes from the writing staff and the characters. Minato seems to be a bit of a brocon, as she knows a lot of things about Junichi to an extent that can be considered stalker behaviour if it weren't for the fact that she's his sister. She's the perfect girl of the dating sim in a little sister persona, but we actually never get told whether she does well academically. She's also in the tennis club.\\n\\n\r\nTsukasa Kiryuu: Childhood friend character who is one of the haremettes but you only get mild hints with a noticeable one in her spotlight episode, Tsukasa is a lively girl who is often seen with Fuyuhiko (as they apparently have the same personalities with some differences) who is in the Newspaper Club. Because she's in the newspaper club, this means that she's automatically a gossip. At times it is shown that she cares more about Junichi and the others, even moreso than Fuyuhiko. Apparently she wanted to be a seiyuu when she was younger because of a magical girl anime she watched with Junichi, and this is what her episode is all about.\\n\\n\r\nFuyuhiko Nishino: \"Bromantic foil\" character who surprisingly doesn't show much interest in persuing the girls. Practically has Tsukasa's character traits except he's an otaku of sorts who has the ability to talk to Junichi when he's going through brain revelations. He's shown at the end to be a decisive character who helps Junichi go through character development, so he's possibly genre savvy without constantly pointing it out. Also the vice president of the student council, but that's only seen twice.\\n\\n\r\nMitsuki Shiina: Student council president and school idol Amitie with an accent, Mitsuki is a trickster of sorts who isn't very good at keeping secrets (or is just a pest). Enjoys using Junichi as a lapdog and likes him but it's very easy to assume that she doesn't. There's not much to say about her, what a shame. Also a haremette.\\n\\n\r\nNagomi Shiraishi: ~Mysterious~ girl who acts like a dandere. Hinted to be an alien since she talks to some sort of unknown entity who wanted her to observe Junichi or something. A poorly executed character who is there to fulfill the fantasies of those who think that Yuuhi's breasts are too big, and she's also got a sister called Yutori. Also a haremette.\\n\\n\r\nKaren Ayanokouji: Rich girl character who tries too hard when it comes to pleasing people. Gracefully hot blooded and (assuming these jokes were hers) can't tell jokes. Competitive with people who are well-liked or something, wasn't on the best terms with Yuuhi at the beginning but they eventually become sleepover buddies or something. Also a haremette.\\n\\n\r\nMikoto Tachibana: Senpai character who hangs around Mitsuki. Plays tennis too? I dunno, she's fanservice space with little screen time. Also a haremette.\\n\\n\r\nSeijirou Sugishita: Playful teacher who's possibly gay for Junichi and gets into a only mentioned once rivalry with Fuyuhiko for the homo subtext with the protagonist space. He's a genderbent version of the unreliable teacher, and he also helps Junichi go through character development. He's poor.\\n\\n\r\nAya Nijou: Secretary and Treasurer of the student council. Shown to be blunt and considerably normal amongst the standards in this series. Not a haremette!\\n\\n\r\nNagase parents: Adventurous! Also, the mother is practically Fujiko Mine except nicer.\\n\\n\r\nSo there you have it. Cliche, cliche and cliche.\\n\\n\r\n--\\n\\n\r\nEnjoyment: 4/10\\n\\n\r\nYes, despite all of the flaws I pointed out needlessly in this review, I didn't really mind watching it. Sure it's bland and cliched, but there were not many really really horrible bits aside from the ending. Also, it averted some of the cliches that it used too (no hot spring peeking) so it wasn't entirely facepalm worthy? I don't really have much to say for this part, surprisingly enough. All the characters are unlikeable though.\\n\\n\r\n--\\n\\n\r\nOverall, Akane-iro ni Somaru Saka is an anime that achieves nothing in trying to be spectacular within its genre and was practically made to be fapping material (or what I said at the beginning). Others might like it, but I can say that it didn't tickle my fancy. I'm sure the original vn was hopefully better, and that the anime was just fucked up like most of eroge adaptations, so maybe this was just promotional material instead? The ending being like that so the angry people can just play the vn and experience the so-called true ending? Maybe.",
            "date": "2011-12-23T21:48:00+00:00",
            "helpful_count": 7,
            "mal_id": 49981,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/462986.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Feinerine",
                "username": "Feinerine"
            },
            "url": "https://myanimelist.net/reviews.php?id=49981"
        }
    ],
    [
        {
            "content": "I've seen lots of romance anime and maybe 1/4 of them lack something, and it's originality. Would I group this anime with that 1/4? Yes I would.\r\nStory: 6/10\r\nThe story in the anime is not that original, as I've seen it in lots of anime. Boy has a random encounter into a girl -> Girl transfers into that boy's school, not knowing that the boy was in the same school she was transferring in. -> turns out girl was boy's fiance -> sister gets angry. Something along those lines. The story lacked originality, and another added to that is, it was a bit boring to me.Why did I rate this a 6? Mainly because of the comedy. Though, I don't know how misunderstandings like boy falls onto girl and magically touches her breasts or sees her panties. I've seen that shit too much now, please stop it. The romance side, there was some subtle Yaoi in there, for the girls of course, but yet I find myself laughing at it too and not being disgusted. The relationship that builds up between Junichi and Yuuhi is basically arguing and fighting but it can be very sweet sometimes. Oh yeah, I forgot, there's fan-service, and there's quite a lot.\\n\\n\r\nArt: 8/10\\n\\n\r\nThe art was above average, considering it's from 2008.  I swear, they probably put all their time designing Minato because damn, she's very cute. The animation was average and the design on each character is simple, but I like that simplicity.\\n\\n\r\nSound: 7/10\\n\\n\r\nThe OP is very nice, fitting the theme of the anime, being happy (mostly) and so does the ED. The OST fits each scene, but not a lot used (or maybe I'm deaf.)\\n\\n\r\nCharacter: 7/10\\n\\n\r\nNagase Junichi, nicknamed \"Genokiller\" who had a history of fighting a lot of people and also driving his maid out of the house. Well, that's history, but now he's a kind person who values his sister a lot. And of course, an idiot.\\n\\n\r\nNagase Minato, a sister who cares about his brother ALOT. A type of person who has a princess aura. Very calm and is very good at chores. Also super cute. She also thinks about others before herself.\\n\\n\r\nKatagiri Yuuhi, the tsundere who surprisingly doesn't have a flat-chest. Can be annoying sometimes, but hey she's a tsundere. Compared to Minato, not that great at cooking.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nI watched this anime awhile ago, and I re-watched it earlier. I enjoyed it still, even though I knew what was coming. \\n\\n\r\nOverall: 7/10\\n\\n\r\nIf you like love triangles such as this, then this is your anime. Would I re-watch this? Well, I just re-watched it but thinking again, I might not in the future.",
            "date": "2015-02-08T04:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 179932,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426345.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/torrapamii",
                "username": "torrapamii"
            },
            "url": "https://myanimelist.net/reviews.php?id=179932"
        },
        {
            "content": "I try my best not to be piss. but oh well, here it goes\r\nStory 4/10\r\n- It started good, I actually enjoy it the first few episodes. So this story went by a guy name Nagase saved a girl name Yuuhi who apparently is his future wife.\r\n- she moved in to Nagase's sibling house becos she cant accept the planning marriage and wanna learn more about junichi\r\n- At first he 'is interested' in her. / as she was also try hard to like him at first\r\n- Then doubtful of his own feeling. / she know that she love him\r\n- Finally realized that he love his sisterbecause he thought that he can't live without his sister for an absolute shit reason.\\n\\n\\n\r\nArt 5/10\\n\\n\r\n- average at best, colourful.\\n\r\n- cute character design\\n\\n\r\nSound 8/10\\n\\n\r\n- the only thing that can make me forgive this anime ending is the soundtrack.\\n\r\n- Op and Ed song are catchy, and performed by one of the voice actor itself *cough* Kugimiya Rie*cough*\\n\r\n- - The amount of notable seiyuu is so damn high, Emiri Kato, Aya Hirano, Kugimiya Rie, Rie Tanaka\\n\\n\r\nCharacter 7/10\\n\\n\r\n* emphasizing on 3 of the main leads \\n\\n\r\n- Ok let see, I was hoping character development here , for all I can say Yuuhi is probably had the most character development from how she was all this'tsundere' arrogant bitch to this kind ' go and take my fiancee its find i love him so much that im willing to sacrifice this love for his happiness' *gasp breath*\\n\r\n- I wont even start with Nagase, instead of character development, I dont even know the exact word for me describe his 'downfall' in this anime. I think, how he was described in the story exactly what makes him bad. Its not that because he realized that he love his sister after all this while, but the fact that, he actually dont make move on that, never even consider that as an option, and apart from that, trolling over some women heart - kiss her - make her fall in love with him - and finally have some balls to dump her without even trying to make a proper discussion. ok im done\\n\r\n- Minato, oh Minato, she just that beautiful imouto, cute, perfect, know how to do housework, smart, pure and popular. and oh, she gets the male lead without doing a shit, ok thats too harsh... *roll eyes* maybe a little shit, like cook curry rice for him, wash his clothes and stuff. zzzz u know, women stuff\\n\\n\r\nEnjoyment 5/10\\n\\n\r\n- I was kind enough to give this show 5 after all that unexpected end. \\n\r\n- I did enjoy it firsthand.\\n\r\n- The ending spoil my fun\\n\r\n- I guess maybe its because the story kinda trick me into believing that nagase likes yuuhi ( i mean duh, like so obvious) but then in the end choosing his sister ( wtf)?\\n\r\n- I never get harem like this.\\n\\n\r\nOverall 5/10\\n\\n\r\n- i pretty much spit it all out already.\\n\r\n- the show will be good/fair/great if they pull it a little longer with some explanation on each character background and development.\\n\r\n- The ending was too rush.\\n\r\n-  To be honest, after watching half of all the episodes about how he's 'in love' with Yuuhi, and to end the other 2 last episodes of him depressed because he cant choose who he love the most, then finally go for his sister ( who apparently not his biological sister) .\\n\r\n- Really, who are not going to piss of because of that? Can anyone shot Nagase with a gun please?\\n\\n\\n",
            "date": "2014-05-29T11:53:00+00:00",
            "helpful_count": 6,
            "mal_id": 144987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1289183.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/xtulthu",
                "username": "xtulthu"
            },
            "url": "https://myanimelist.net/reviews.php?id=144987"
        },
        {
            "content": "If you plan on watching this anime, then you must have some background in romance/harem/comedy.  As this particular genre dictates, try not to pick on originality, because it is non-existant in this genre. \r\nOverall, this show isn't exactly a must watch.  I like to point out some pros/cons.\r\nPros:\r\n-cast (this anime has some serious big names involved in term of art/character design, voice actors)\r\n-This is what I found to be the best one of all. The end female is unexpected , and gradually worked in.  (Personally this gave me enjoyment score of 10.  but i still have a write a fair review)\r\n-Greatcharacter design on males and females.  The main guy has masculine in his own right, not a pretty boy, not a nerd, or completely generic.  \\n\\n\r\nCons:\\n\r\n-story:  to be honest, this is really what kept this show down. While the actual romantic comedy and the ending (as i explained in the pros earlier) is solid.  You may notice some completely irrelevent things going on in this story that just makes you go \"wdf?\".  \\n\\n\r\nOverall, this anime is solid for any romance/harem/comedy genre lovers.  If your just going around to look for a great anime, this is not for you.  This anime belongs to fans of the genre.\\n\\n\r\nIMO, if your this genre fan of romance/harem/comedy (well technically, the harem factor in this anime is minimal to non existant), this anime is a MUST WATCH for the genre fans.  \\n\r\nI've been disappointed time and time again by predictable endings in dramas and romance comedies alike of the predictable ending.  I am still shocked this anime actually was willing to step out of the mold.",
            "date": "2012-01-27T07:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 52651,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/mike13531",
                "username": "mike13531"
            },
            "url": "https://myanimelist.net/reviews.php?id=52651"
        },
        {
            "content": "After playing the eroge the show was based on, I decided to give it a shot. The only things they have in common are the character designs, as most of the show has been re-written to be more of a love-comedy than a more serious love story like in the game. This isn't a downside however, the show is still enjoyable and fun to watch. However, in the later parts where the show reaches the climax, the transition from comedy to serious isn't done very smoothly and leaves a lot to be desired.\r\nIn other words, if you're just looking for a fun love comedy, thenyou should watch the show. If you want a more serious and elaborate love story then you should play the game. I prefer the eroge myself, it's hard to beat out h-scenes.",
            "date": "2009-01-04T15:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 11105,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/47388.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnonymousV2",
                "username": "AnonymousV2"
            },
            "url": "https://myanimelist.net/reviews.php?id=11105"
        },
        {
            "content": "Things you should know about this series:\r\na) The side antics and filler episodes, while humorous to a degree, feel exactly like what they are, side antics and filler. The story as a whole doesn’t suffer because of them, but you suffer through them mostly to get the tid bits of character progress they hide within them.\r\nb) The core story should be strong enough to keep you interested, but where I feel this series kicks it up a notch is within the last two to four episodes. The drama starts to build up, and the ending is refreshing in the way it breaks from the clichéway slice of life harems usually end.\\n\r\nThere are little things here and there that make you wonder, and some of those questions never get fully answered, but even with what you end up with, it’s satisfying. \\n\\n\r\nUltimately, I really liked this series. Right after I post this, I’m going to go see if there is a manga associated with it in an attempt to get maximum story exposure. \\n\r\nI recommend it, even if the overall score is low… but ultimately… who am I, but some guy on the internet. Those are my two cents, take them or leave them, but don’t give them back to me… I don’t like pennies. \\n",
            "date": "2013-04-06T21:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 92781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1047525.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Draconalis",
                "username": "Draconalis"
            },
            "url": "https://myanimelist.net/reviews.php?id=92781"
        },
        {
            "content": "After watching the first episode of the series, I was greatly reminded of one past anime I've watched: Final Approach. Although Akane-iro ni Somaru Saka gives a rather similar feel as Final Approach, nonetheless I find it very entertaining and think that it deserves 7/10.\r\nStory: Yes I have seen anime with similar story line but the story is still different and it caught my attention. This is especially so at the ending, which gave me quite a surprise. Being a romance comedy(more of comedy actually), it will definitely give you a laugh or two each episode. However, while the story slowly builds up to apeak, it suddenly took a short dive midway: I felt that the ending was a little anti-climax. Furthermore, I did not really like the ending :)\\n\\n\r\nArt: The art might not be the best in this season [best art probably goes to Clannad ~After Story~?], but it is not horrible either. The use of bright colours definitely captures the audiences and makes up a little for the lack of detail.\\n\\n\r\nSound: I like the opening song. It fits nicely to how the anime is like. The voice actors are great too!\\n\\n\r\nCharacter: I think they are quite nicely drawn. Furthermore, the main characters are all well developed. Also, the character voices are very natural. As expected of Kugimiya Rie and Hirano Aya. Oh, tsundere-lovers will fall in love with Yuuhi.\\n\\n\r\nEnjoyment: I was looking forward for each of the episodes to be released while it was still airing. So, do you think I enjoy watching this anime?\\n\\n\r\nI would recommend this anime to others for it's enjoyment factor. However, if you are looking for something new, perhaps you should try other animes like Toaru Majusu no Index.",
            "date": "2008-12-19T09:25:00+00:00",
            "helpful_count": 5,
            "mal_id": 10486,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/123927.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/qseft",
                "username": "qseft"
            },
            "url": "https://myanimelist.net/reviews.php?id=10486"
        },
        {
            "content": "This was the worst anime i ever watched!\r\nThe story was crap wtf was even going on? Story made no sense the girl hated him then loved him then hated again and wtf was that ending? they took that guy to somewhere then from nowhere his parents appeared killed someone and left....and that weird girl with pink hair who even is she? it all made no sense! \r\nStory- horible\r\nart-not my fav\r\nsound- normal\r\ncharacter- pretty bad\r\nEnjoyment- Wouldn't watch again not even for 500$\r\nOverall- WOULDN'T recommend for anyone its so bad its basically just a waste of time...",
            "date": "2017-08-31T16:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 256624,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6505088.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ItzYaBoiSatan",
                "username": "ItzYaBoiSatan"
            },
            "url": "https://myanimelist.net/reviews.php?id=256624"
        },
        {
            "content": "I can't describe how blown away I was after watching this. This is not one of your typical harem animes. Yes indeed the plot has been totally overused, but the real plot is what makes it different from  all the other animes I've seen.\r\nFirst of all let me say this:   This is not your typical comedy/harem anime like Love Hina or School Rumble. This to me is more drama/harem. There are funny moments  indeed,  but there is more emtional drama than comedy throughout the anime. The anime, to the average comic/harem lover will be kinda slow and with little orno comedy. Reason being why many people gave it a very low score.  \\n\\n\r\nThis is what I like to call a Serious  Harem Anime since the characters feelings ( (Junichi, Minato Katagiri) are all genuine and real and not the lovey dovey type like Rosario + Vampire. This is what totally blew me away and kept me on toes throughout the ending.\\n\\n\r\nI really enjoyed this anime ^_^ 11/10",
            "date": "2009-10-02T13:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 19306,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/241213.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HaremFanatic",
                "username": "HaremFanatic"
            },
            "url": "https://myanimelist.net/reviews.php?id=19306"
        },
        {
            "content": "When I found this anime, at first I thought \" great drawings, looks cute, I should watch this\". And you know what? It didn't worth it, totally waste of time.\r\nI can't believe I've wasted 4 hour for this. When I watched the last episode, I was like \" So... it's over? that was all?\". Nothing is explained at the end and there is no creativity. Just the cliche things you can see almost in every romance anime.\r\nthe boy and the girl meet at the street, the boy helps her, the she transfers to his class, they can't get along, and as always, a close friendwho is secretly in love with the boy.. and bla bla bla. The only interesting things were jun's father and mother, the relationship between jun's fatehr and yuuhi's father, and nagomi... and none of them are explained. definitely waste of time",
            "date": "2009-05-15T16:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 15048,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/84453.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ginkaen",
                "username": "Ginkaen"
            },
            "url": "https://myanimelist.net/reviews.php?id=15048"
        },
        {
            "content": "THIS LITTLE REVIEW CONTAINS A BIG SPOILERS\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\nI can't deny that i really enjoyed and laughed a lot while watching the Anime at the first episodes, and it's really nice that we have a boy loves a girl.. but it's so fuckin stupid for me to find out that the boy turned to loving his sister in a romantic way, ruined my mood! \r\nSo DON'T WATCH THIS SHIT!\r\nwaste of time! \r\nBye",
            "date": "2015-06-19T14:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 190660,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Danc110",
                "username": "Danc110"
            },
            "url": "https://myanimelist.net/reviews.php?id=190660"
        },
        {
            "content": "If you don't like personal opinion reviews please skip this review.\r\nEveryone talks about how terrible the story was, and how it raised expectations, but then didn't meet them even half way...but I honestly loved it! The characters, in my opinion, were VERY well done!!\r\nStory: Junichi, and Minato live together (Brother and sister), but there has always been a strange sexual attraction...Then Yuuhi comes to move in! Who is 'Yuuhi'? She's the cute, tsundre who Junichi is going to marry! Wait--what? Yes, it is an arranged marriage. Minato and Yuuhi quickly become friends...but what about the strange attraction between Minato and Junichi? It doesn't fade away...\r\nArt:The art was AWESOME! I didn't see the anime in high def, but the art was awesome. I'm not a fan of 'fan-service', but there were little bits of it...Minato was my favorite character but her breasts were HUGE! What the heck?? There was also another character, (Can't remember her name, she wanted to voice act) who's breast were 5x the size of Minato's. Like I said, not into fan-service at all, but I was like \"O____O what the fluff\"...\\n\\n\r\nSound: I liked the theme song, it was so catchy, and most certainly fit the anime! The voice actors were awesome!\\n\\n\r\nCharacter: I felt as though all the characters were very well developed!\\n\\n\r\nEnjoyment:...every part of it...I loved!\\n\\n",
            "date": "2011-02-20T12:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 34599,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/367113.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Drumming1997",
                "username": "Drumming1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=34599"
        },
        {
            "content": "Nothing really preliminary to discuss; it's harem, cute girls, etc. Let's get right to the blunt review:\r\nStory: 6\r\nNot original. Guy lives with girls; one girl was set up to be his fiance;  which leads to many, many emotions. However, the grade is above average because they put a teeny twist on it. I try to write spoiler-free reviews and this one is no different. If you want to enjoy some love triangle romance without too much (hardly any) deep thinking/thought, this one does an above average job at it.\r\nArt: 8\r\nVery good. Not disappointing at all.\r\nSound: 6\r\nWell, the girls sound like girls and the boyssound like boys; the inanimate sounds sound like inanimate sounds. It's done in an \"okay\" manner, but excuse me for there being too many \"Mmm\"s, \"oh\"s, and \"uh\"s.\\n\\n\r\nCharacter: 7\\n\r\nGood. Would've liked to have seen more character development in the majority of the girls, due to the fact that really 2.5 develop along with the plot. 2.5 because of a startling expression of love in one of the hero's friends near the end of the series, and it seems so rushed and brash, like the creators thought that it would be a great idea to have one more girl fight for his heart. However, ****SPOILER**** \\n\r\nit obviously doesn't pan-out in the end and, like I said above, seems rushed for no reason at all.\\n\r\nI'm really leaving out one important detail pertaining mainly to one character, but saying anything will ruin the story completely. I'll leave you with this: you would have to be completely ignorant of the fact if you don't know what I'm talking about by the end of the series.\\n\\n\r\nEnjoyment: 6\\n\r\nI had some fun watching it. But for a 12 episode-long series, it moved along at a snail's pace. Most likely because of a lack in story and this anime suffers because of it.\\n\\n\r\nOverall: 6\\n\r\nIn a 12 episode spread, the overall grade should be based on your enjoyment, the characters, and the story. The animation and sound act only as a nice little piece of garnish on top of a [would-be] steak dinner.\\n\r\nAh, I just can't write a totally comprehensive review without giving a pretty big \"something\" away. So, if you found this review satisfactory, and have decided to watch the show because of it (or others), stop reading, now because this is pretty big. Oh, before I get to that, there is one OVA after the series which I haven't watched, but expect plenty of fanservice or airtime with the girl he chose.\\n\\n\r\n****SPOILER****\\n\\n\r\nOne of the love interests is his sister. But, the things is, we are told right at the end of the 12th episode by some dialogue between our hero's parents that Minato, his sister, probably isn't his sister. (It's not explicitly told in the dialogue, but it's definitely, 100%, implied).\\n\r\nOkay, there. \\n",
            "date": "2009-10-24T11:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 19971,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243290.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Saintly",
                "username": "Saintly"
            },
            "url": "https://myanimelist.net/reviews.php?id=19971"
        },
        {
            "content": "This Anime is probably one of the more stereotypical of the Romance/Comedy genre. Don't get me wrong, I really liked the series. It was just a bit uninteresting compared to other Romance/Comedy Anime you could have seen. But the fact that it was a basic summary of all the elements of a Romance/Comedy Anime made it a nice heart warming show to remind why I love that genre.\r\nThe story is very stereotypical, a young rich girl comes from her higher-up family to be-wed a city boy living with his caring sister. I haven't seen that in any other wife-based Anime (Sarcasm). Anyway, lovable characters popout left and right from the beginning and it becomes easy to tell who is important and who is semi important. The whole story revolves mostly around three main characters, although most of the side-characters each provide a little something to the plot in nearly every episode. One of the things I like about this Anime is that the ending is very dramatically built up which keeps you watching. I won't spoil the ending, but it gave me a good sense of satisfaction.\\n\\n\r\nThis Anime was made in the late nineties and the art style is very borderline between its time period and the millennium. Mostly everything is detailed, but not to a remarkable point where it stands out: it's about a step above bland. Some of the hair styles left a lot to be admired, but other than that it had a nice soft feel to it.\\n\\n\r\nAs far as the BGM and sound goes, there is nothing really to say. It's not bad, but it's not good. The intro and ending aren't something you'd add to an Mp3 player and listen to in your free time, but they didn't completely break your ear drums.\\n\\n\r\nOne of the main things I like is that the characters are all very lovable. Simply put, there's two arguing lovers, an extremely caring sister, a poke-fun-at-you-and-make-funny-rumors-about-you best friend, a nosy reporter friend, and the list goes on. They are your stereotypical cast of Romance/Comedy characters, but they aren't very exciting. In addition, only do the three main characters really develop like I mentioned before.\\n\\n\r\nThis is a very well rounded Anime that you could probably finish in one day and enjoy it. It won't pull your heart strings, but it will make you chuckle once in awhile. The one thing is that it's hard to really feel like you are in the characters shoes, which is a main concern in my definition of enjoying Anime. In any Anime, you want to take yourself away and imagine what it is like in the eyes of the characters. This one, sadly, keeps you in a glass box on the outside looking in.\\n\\n\r\nOverall, I say this Anime is good for the genre that it is, but nothing sticks out about it. You could watch it if you don't have anything big on your Anime list, or possibly need to watch a decent Anime to cool down, then I'd suggest it.",
            "date": "2009-12-20T22:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 21572,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/270813.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NinjinJess",
                "username": "NinjinJess"
            },
            "url": "https://myanimelist.net/reviews.php?id=21572"
        },
        {
            "content": "I'll write a short review about this :))\r\nStory(10/10)\r\nIt's kinda interesting and their meeting is well but there's an unexpected twist I never thought it'll happen so it's very unique love story....\r\nArt(10/10)\r\nIt's art is like typical modern anime so I give it a score of 10\r\nCharacter(10/10)\r\nIt's great most character types in romantic comedy are here :))\r\nEnjoyment(10/10)\r\nIt's fun and interesting I kinda want to download it and watch it over and over again\r\nOverall(10/10)\r\nIt's fun great and amusing it's really different from everything I hope it has a 2nd season :))",
            "date": "2012-04-04T12:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 57899,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1186789.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/crescent917",
                "username": "crescent917"
            },
            "url": "https://myanimelist.net/reviews.php?id=57899"
        },
        {
            "content": "Well, this is officially my first review, so please bear with me.\r\nStory: 6/10\r\nI liked the way the story progresses for the most part, it was exciting to see what would happen next and how the relationships develop. You get to see how the main character is dealing with an uneasy situation at home all while all his friends seem to be prying in on his private life no matter how hard he tries to keep it to himself. Pretty standard slice of life stuff, just seeing how everyone interacts with each other on a daily basis. My only quarrel with this show is that itstops after one season and the story is really inconclusive at the end. I'll try not to go into too much detail, but the MC is faced with a difficult choice in the end and even after he's made his choice it doesn't seem to have changed anything between the characters. That's the only reason I had to rate story at 6, just didn't get any feeling of resolve or satisfaction after I was finished watching.\\n\\n\r\nArt: 8/10\\n\r\nI am not really picky about art, although it will have an effect if it is just awful. That being said, this has decent artwork and animation is nice and smooth, so I have no problems with it.\\n\\n\r\nSound: 6/10\\n\r\nNot really picky about sound either, but the problem with this is it seems to have a pretty big lack of any enhancing music. I don't have an opinion on OP or ED considering I never watch them, but there just seems to be a lack of music to enhance moods or situations during the anime.\\n\\n\r\nCharacter: 7/10\\n\r\nI liked the characters, they all have their own personalities and are all equally zany throughout. Character progression itself was a little lacking as I was left only caring about the MC and one or two others, the rest just didn't have any impact on how I felt or how the story went on.\\n\\n\r\nEnjoyment: 9/10\\n\r\nI did enjoy the show, it has plenty of laughs and an entertaining slice of life for every episode. I'm not sure yet if this is worthy of a rewatch, but I did enjoy this time through.\\n\\n\r\nOverall: 7/10\\n\r\nThis is a decent anime for those of you that like a little romance with some comedy dashed in there. If you're looking for harem though as the anime information suggests this show has, you'll probably be disappointed as this show has almost nothing at all harem related in it. Anyway, if you're looking for an entertaining show to add to your list, this is worth checking out.",
            "date": "2015-02-16T12:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 180564,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4055829.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JVogie91",
                "username": "JVogie91"
            },
            "url": "https://myanimelist.net/reviews.php?id=180564"
        },
        {
            "content": "Nagase Junichi, a gentle student, however, is reputed to be a killer, he is the victim of rumors spread by his friends, but fate preached a play to him: a beautiful girl was in danger, Nagase saved her from the men who were on top of her, and she felt a special feeling for him at that hour. Over time, their relationship turns into a typical love triangle whose storyline is very different from the manga.\r\nIn short: Anime medium, main characters immobile, secondary almost null throughout the plot. The story has remained firm in the proposal until the end, which saves this anime.",
            "date": "2018-08-13T13:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 286399,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7037206.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LeonardoRJ12",
                "username": "LeonardoRJ12"
            },
            "url": "https://myanimelist.net/reviews.php?id=286399"
        },
        {
            "content": "I finished this anime a few weeks ago. In all honesty, I believe this is not a bad anime. But is not good as well. Its more on the line of confusing more than all things. There are small things I liked about it. Mainly fanservice and what they did that almost made me very satisfied that I watched it. It reminds me of Oreimo. \"It had a lot of potential but didn't go where it needed to be.\" I will always remember this anime for how confusing it is. I believe its not all about is it good of bad cause all anime nomatter what have good and bad things in it depending on hoe much the weigh against each other.",
            "date": "2016-08-26T14:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 227660,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4078079.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/UltimateAD",
                "username": "UltimateAD"
            },
            "url": "https://myanimelist.net/reviews.php?id=227660"
        },
        {
            "content": "\"I'm sorry Japan but you've gone one step too far this is it I'm doing it.\" -President Harry S. Truman in 1945 after hearing Japan had released Akaneiro.\r\nAkaneiro ni Somaru Saka, or Akane as it shall hence be known, is everything that is wrong with anime. A bland and boring cast and plot, combined with a stupid ending makes for a show that will either make you wish you had yor time back, or that you could remove the rest of your remaining time and end it all. So let's dive into this dumpsterfire of a show.\r\nStory- 3\r\nSpoilers inbound.\r\nSo our main character Junichi meets thisrich young mistress called Yuuhi who due to WaCkY cIrCuMsTaNcEs ends up living with him after he creates a misunderstand with her ruining their relations. After another 9 episodes of filler which contain nothing either related to the plot or anything interesting, Yuuhi, after beating Junichi up every episode, realises she likes him too. I would like to point out that this show has focussed entirely around these two characters, with everybody else being resigned to small support roles who don't have much screentime...\\n\r\nWhich is why it blindsided me and probably everybody, when Junichi decides to get with his sister, TitsMcOniisan face instead. Not only is this a bizzare incest ending, but Breastylechest had little to no time spent in this show at all, and basically null and voids any point of Yuuhi having been in the show at all. In effect we could have had a 1 episode show where a character realises he likes his sister. I'm not necessarily opposed to the incest route (although it is bizzare), if handled correctly, like say Oreimo does, but the bit that really gets me is how the MC does a 180 on who he has feelings for and just says \"Yeah. I like my sister now\", and his sister who had no screen time ends up as the main heroine in the final episode. I'm sure I'd feel even more annoyed if I was actually invested in Yuuhi at all and she wasn't just a 2d cut and paste rich girl who beat the MC and wowed herself at the fact that there was a real world every episode.\\n\\n\r\nArt- 6\\n\r\nThe art's alright. It's not the best. It looks a bit dated and a bit eh, but there's nothing wrong with it.\\n\\n\r\nSound- 6 \\n\r\nI genuinely can't remember much about the soundtrack, but that might be partly because I watched this a long while ago. After going back and listening to some of it it doesn't seem offensive, but once again is very eh.\\n\\n\r\nCharacter- 3\\n\r\nAny development had is forced and happens unexpectedly. The show seems to think massive arbitrary changes in the character's mindset is a personality change. The show could've worked well if they'd maybe been able to have a few more episodes. And then actually spent those, along with the 12 they already had, developing a good relationship between the two main characters + sister semen demon, instead of just have some bland scenario the rich girl gets into every week because look she's rich!\\n\\n\r\nEnjoyment- 2\\n\r\nWhy is this a thing? I don't mind cheap slice of life that goes nowhere, much like I don't mind jokes that ramble on and lack a punchline. But those jokes need a good set up to be worthwhile. The point of that type of joke is the journey and not the destination, and this anime had neither journey not destination. It essentially was chucked in a jungle and handed a map with nothing on it an told to explore for 30 days, whereupon it goes in a big circle before ending up back where it started having lost the map and settling down to die.\\n\\n\r\nOverall- 3\\n\r\nThis dumpster fire should be avoided unless you like wasting your time/want to torture some poor prisoner of war.\\n\\n\r\nDo I recommend Akane?\\n\r\nOnly for those who enjoy self harm.",
            "date": "2018-03-06T19:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 273236,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheAnimeGandalf",
                "username": "TheAnimeGandalf"
            },
            "url": "https://myanimelist.net/reviews.php?id=273236"
        },
        {
            "content": "First off, I liked it. I'm going to keep this short, as others are pretty thorough, yet when I read reviews I end up moving on after a paragraph. I'm going to point out what I would have wanted to know before starting. \r\nSecond, it's a love story. It's a romance/comedy anime. By comedy, what I really mean is it doesn't have a super serious tone. \r\nThird, it's not *really* a Harem anime, at least not in my eyes. It's a love triangle story. They do add a couple token love interests, but they don't *actually* add them, if that makes sense. If you're aHarem disciple, you won't be getting 4-5 girls courting some lucky bastard. You're getting two girls in love with the same guy, which is often (mis)labeled as \"Harem\". Not really Echii either.\\n\\n\r\nThat isn't to say it was bad, I certainly liked it, especially near the end. If you want to hear how or why it succeeds (or at least doesn't fail) as a romance anime, I'm sure some other reviewer is going to do a better job then I could.\\n\\n\r\nIn short, I'm glad I watched it, but it's not a Harem.",
            "date": "2017-09-16T14:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 257716,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6553187.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Bluemilk92",
                "username": "Bluemilk92"
            },
            "url": "https://myanimelist.net/reviews.php?id=257716"
        },
        {
            "content": "I have mix feelings about this anime. I watched the whole series but can't say I love it nor hate it. The show itself is very endearing and the art and use of colors was astounding. But where it becomes mediocre is the storyline. \r\nThe first episode makes you think that the rest of the anime will be interesting, but truth be told that it really is not. The whole story is pointless, its your typical love triangle but with an incest twist. \r\nIts best to watch it for yourself, you might like it more than i did, or maybe not.",
            "date": "2010-04-23T07:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 25348,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/239492.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Darkchao45",
                "username": "Darkchao45"
            },
            "url": "https://myanimelist.net/reviews.php?id=25348"
        }
    ],
    [
        {
            "content": "this warning review may contain spoilers.\r\nFirst impressions, so another anime based off a hentai game. I really need to watch something different I guess?\r\nStory, 5/10 \r\nladies and gentlemen of all ages I welcome you to generic rom-com anime number nine thousand five hundred twenty two.\r\nThe story starts out with this fish girl named yuuhi who is saved by are main character junichi from a group of teenage thugs.\r\n Later on he  finds out this girl who he hand saved had transferred into his school and that this girl is actually his bride to be who will be living with him,\r\nBut the twist is theydon't really like one each other  and both of them aren't a big fan of getting married by force.\\n\\n\r\nSo I thought was an interesting idea especially because it's coming from a generic visual novel anime adaptation,\\n\r\nWhich gave it something a bit more interesting I guess.\\n\r\nBecause the idea of people who hate each over and slowly become kind of  close over time kind of interesting to me.\\n\r\nWhich it dose an ok job presenting it.\\n\r\nEven though the in between bits kind of the usual shit.\\n\\n\r\nI also liked the little sub plot with the main character trying to come to terms with what life could offer him instead of living in the past.\\n\\n\r\nThose when I look back on it where quite nice touches.\\n\\n\r\nBut those kinda get retconed in a way ,\\n\r\nBecause they decided to have this love triangle going on in the background involving Junechi his sister and yuuhi.\\n\r\nWhich was handled in the most cliché way possible. \\n\r\nWhile watching this I am thinking to myself. Really show your really going to do this why?\\n\r\nBecause you had something good going here and you decide to throw it off a cliff.\\n\r\nIt doesn't completely bother me that much because at the end of the day the story could only go so far being what it is.\\n\r\nBut they could have done something a little different.\\n\r\nWhich would have been nice.\\n\\n\r\nCharacters, 5/10 \\n\\n\r\nThe main character is pretty much a generic protagonist with the only thing interesting about him was being this geno killer thing.\\n\\n\r\nThe other characters were pretty one note nothing really special about them.\\n\r\nThere basic cardboard cutouts pretty much.\\n\\n\r\nArt, 5/10\\n\\n\r\nThe animtion for the most part was all right nothing good nor bad about it. \\n\\n\r\nThe art style is a bit bright and colorful for my taste.\\n\\n\r\nthe character designs also looked alright.\\n\r\nIt's just usual shit.\\n\\n\r\nSound, 6/10 \\n\r\nIt had an ok op. The ost was pretty average by rom-con standards.\\n\\n\r\nBecause nothing really took my interest.\\n\\n\r\nEnjoyment, 5/10 \\n\\n\r\nWhen it comes to enjoyment about this show I really don't have much to say. It was pretty generic.\\n\r\nBut one thing I did enjoy about it is that it had some promise and it had some good parts about it.\\n\\n\r\nOverall, 5/10\\n\r\nSo overall akaneiro ni somaru saka is pretty much a standard fare when it comes to rom-com thing. It did try to be better but instead of trying something new. It went the cliche way. So this show is pretty forgeable.\\n\r\nBut it's an ok time passer I guess if you like Rom-com I guess.\\n\\n\r\nBut if you not a big fan of that shit probably go somewhere else.\\n\\n\\n\\n\\n",
            "date": "2016-03-05T20:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 212327,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4681991.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Biogundam",
                "username": "Biogundam"
            },
            "url": "https://myanimelist.net/reviews.php?id=212327"
        },
        {
            "content": "[Might Contain Spoilers]\r\nI've always been a fan of the 12 episode series thing, and I thought this one had a good story for such a short series, but like a lot of the 12 episode series I've watched, it didn't wrap it up as much as I was hoping...\r\nThe story itself was good, rich girl comes to town to live with her fiance to get to know him better, runs into a group of gangsters, boy comes to her rescue, she falls in love with him... yada yada yada, unoriginal was what I thought at first, but then as soon as she fell in lovewith him, it was hilarious to see how she immediately fell OUT of love with him when his hormones took over and kissed her in public. That's when her scary side kicked in and stuck with her the rest of the series, and to make it better, he's her fiance. I immediately knew I found a series I would like.\\n\\n\r\nAs in any harem anime, there are plenty of things that would put anyone in an awkward position (bath houses, hot springs, tripping on top of a girl, etc.), and that's what I love about this anime, it's got all that. So it has a good story, AND plenty of those scenes.\\n\\n\r\nI liked the entire anime up until the point where incest kicked in. Sure, there have been some great animes with that kind of stuff in it, like Ouran High School Host Club (Hikaru and Kaoru), but I still can't picture dating a sibling. Cousins, sure, but Sister, no. All of this is when the story got complicated. I was able to understand it all, but it was a total love triangle, which always ends up with someone's heart being broken in the end...\\n\\n\r\nOverall, great show. Good story, interesting characters... all of it was great. If you can handle those awkward moments I was talking about before and incest, give this anime a try, I'm sure you'll like it!",
            "date": "2012-09-26T16:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 73355,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=73355"
        },
        {
            "content": "The main reason I thought this anime was entertaining is because, the main character(male lead) doesn't pick the obvious choice(tsundere gir). \r\nThe ending was ok, because the main character actually gets to the point and chooses who he likes in the end rather than it being a competition between the girls to get the guy.The art was mediocre. I really didn't like the opening and ending songs weren't too enticing. Regarding the characters, besides the main protagonist and his friend there wasn't anything special. I enjoyed it a little but it kind of gets a bit annoying. I have to give my respects out tothe ending because this is one of the few animes where the main character actually makes a choice in near the end. Overall I would say this anime was not as entertaining as i thought it would be.",
            "date": "2012-10-11T13:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 74675,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1490451.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Emperor_Eye",
                "username": "Emperor_Eye"
            },
            "url": "https://myanimelist.net/reviews.php?id=74675"
        },
        {
            "content": "Okay so it will be my first review. Why Akane-iro ni Somaru Saka? I started watch it three months ago, but i stopped, cuz it really annoyed me. Now i have tried again and i was thinking to myself \" why i actually dropped this?\" Now i remember. It's not like i don't like harem and simple plot. I like it = anime must enjoy. But srsly... don't waste your time on it. I watched it and i still don't know where the story is? Of course it has a lot of funny moments, but it's a little.. caricatural sense of humour. \r\nThe art? Ithink is fine. Hmmm it's the best side of all anime. Sound? Ekhem i don't even heard beside opening (which is horrible).\\n\r\n---\\n\r\nSo if you don't like sister-brother love, harem, no character - don't watch it !\\n\r\nI really tortured myself T_T",
            "date": "2012-12-21T17:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 80820,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1599197.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Suiko-chan",
                "username": "Suiko-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=80820"
        },
        {
            "content": "Akane-iro ni Somaru Saka is not your typical slice of life comedy, it delves deep into one's owns emotions and reveals what you actually think. The actual ratings were very high at first but I personally did not like how the series ended, with an unexpected twist that almost no one could predict. Throughout a good romantic series but it left the viewer wondering of what could of been.",
            "date": "2012-03-27T22:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 57197,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1210299.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KingOfTragedy",
                "username": "KingOfTragedy"
            },
            "url": "https://myanimelist.net/reviews.php?id=57197"
        },
        {
            "content": "Coming into this show, I wasn't sure what to expect. The characters seem like any other from a harem. You have the sometimes self-aware, but mostly dense main character, two love interests, one being the tsundere, and the other being the kind, caring one, followed by all the side characters that may or may not show romantic interests in the MC. Standard layout, so it should be fairly enjoyable, no? Not really. There are very few shows I have watched where I felt frustrated watching it, let alone having to force myself to continue through most of it. Akaneiro ni Somaru Saka was one suchshow.\\n\\n\r\nFrom the get go, there are two characters with the silliest hair design I have ever seen. It was to the point that I would be agitated when I saw them just because of how ridiculous their hair was. Other than them, the characters all look rather nice. The voice acting for them was also rather enjoyable, but I am no expert in that area. The one thing I will say is that sometimes the main character's voice sounded rather stuffy.\\n\\n\r\nThere are some episodes where the show really just shines, and was a blast to watch, where you're really invested, and others where you feel like you have to slosh through them just to get to more of the good ones. To be honest, the episodes between 2 and 10 are completely skippable, where random stuff happens but there's little to no character development. You could skip from 2 to 10 and, for the most part, understand what is going on in the show. You should watch them, they do add some important details, I'm just making the point that they're basically filler. Episodes 10 and above are the part of this show are the parts in romances everyone has been waiting for, the parts with the actual romance. By ep. 10 you, more or less, know how the show will end, but it's being able to experience it and watch how it unfolds that really grasps you. All of these episodes were fantastic, so much so, that I was talking to the characters and yelling obscenities when one thing or another happened.\\n\\n\r\nWhile I am not going to spoil who ends up with who, I will say that the ending was absolutely ruined when the character who was not chosen barges in when things are about to get good, and declares that she will be staying with them to keep an eye on them. What? Why? Why would the writers do that? The viewers do not get any pay off or reward after all of that. It's so bad that the girl who was not chosen, received more time than the one who was. How is that satisfying? It's not. The ending left an awful taste in my mouth, enough to get me to write this review, my first one. Overall it wasn't the worst show I have seen, but it had gotten my hopes up only to not deliver on a satisfying ending.",
            "date": "2015-10-27T09:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 202092,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4080771.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BolshoyMax",
                "username": "BolshoyMax"
            },
            "url": "https://myanimelist.net/reviews.php?id=202092"
        },
        {
            "content": "Well, I finished watching 'Akane-iro ni Somaru Saka'. A curious romance story, but the most surprising thing is the last episode. It was unbelievable. That's truth, I can't understand why the writes choose this way to end the anime.\r\nAnyway, I can't fault. The story was interesting, and feelings and relationships between characters were amezing. And the nude scenes... SO interesting :P\r\nIt's sad that there won't be a second season. It would be interesting see more episodes after the last episode event. In any case, I liked that anime.",
            "date": "2013-12-29T13:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 126213,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2934215.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Felikis",
                "username": "Felikis"
            },
            "url": "https://myanimelist.net/reviews.php?id=126213"
        },
        {
            "content": "When i started to watch it, it was ok and somehow enjoyable but after 6th episode it became totally dreadful\r\nFirst i thought about drop it but than i thought maybe it's gonna be different in next but it was totally a piece of crap\r\nI mean what the hell was the waiter thinking so he wrote this shit, it's not any romantic but the one of the worst anime ever i watched\r\nThe story was awful and somehow i made me remember lots of more anime which have almost the same story\r\nSo i don't think, it's something that I'm gonna watch again in my life, not evengoing to suggest anyone yo watch.\\n",
            "date": "2017-03-24T05:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 243345,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5625276.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ShellX02",
                "username": "ShellX02"
            },
            "url": "https://myanimelist.net/reviews.php?id=243345"
        },
        {
            "content": "This anime was just another short anime about a lucky ass guy running around with cute chicks that all like him, with him getting beat to crap all the time for thinking anything perverted the creators somehow though them knocking him up all the time is comical not at all.. good drawing though i cant do it.",
            "date": "2009-03-15T10:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 13198,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/145146.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/BatriX",
                "username": "BatriX"
            },
            "url": "https://myanimelist.net/reviews.php?id=13198"
        },
        {
            "content": "This anime wasn't really all impressive... The fact that there is Imouto Moe....I personally don't really like incest but other than that, the story was pretty good and the turn of events(*spoiler* How a girl,who the guy met for the first time, suddenly lives in the guys house *spoiler*). The plot wasn't really that great but it was quite funny and it is a quite good anime to watch",
            "date": "2012-08-19T08:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 70291,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1392245.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/azurekim1",
                "username": "azurekim1"
            },
            "url": "https://myanimelist.net/reviews.php?id=70291"
        },
        {
            "content": "Before I start this review, from this point forward, I will be calling this anime \"Akane\" cause I don't want to write the full name at all.  Nonetheless, let's get going!\nStory: The story of Akane involves a faithful meeting between our main protagonist Junichi, and a cute girl by his words, named Yuuhi.  Saving her from 2 guys who were possibly going to do some bad things to her, Junichi saves Yuuhi and that faithful encounter sparks them to know who the other person is.  On another faithful encounter, the 2 meet each other again, and deciding that he should \"take thechance\", Junichi shoots himself forward and gives Yuuhi her first kiss. (God, I sound like I'm writing a sappy-ass fanfiction.) But, all does not go well in the world of Akane as Yuuhi reveals her true nature as a tsundere via telling him to die, and a punch to the face.  (This case is more tsun- then -dere.)  And even bigger faithful meeting happens later that night as they both find out that they are fiances to each other, via arranged marriage by families.  Though this premise sounds hilarious and interesting as hell, looks can be deceiving.  Hell, look at Puella Magi Madoka Magica.  The story itself basically builds the audience up, then craps on them over and over and over and over again, till a really strange and stupid ending comes up and basically destroys the whole point of this anime ever needing to exist in the first place.  The anime also uses a full scenes in random parts of the anime as really dumb side stories on Junichi's parents that has really no significance in the story whatsoever.\\n\\n\nCharacters: (I will be only doing the main 3 characters.) First is Junichi.  As a person who has had Chuunibyou in the past, Junichi is currently a bright and happy person who lives with his sister while their parents are out doing god knows what.  He completely relies on his sister for everything, as he is not really able to take care of himself too much.  Junichi follows the typical harem king where he is completely dense and indecisive, thus creating problems to himself that lonely guys everywhere would consider a frikin' luxury.  Next is Yuuhi.  Known as \"Hime\" to her friends, Yuuhi is a daughter of the Katagiri family, a well known family that owns a crap ton of companies.  In the series, she is shown to be a tsundere and could really care less about Junichi, really.  With a child-like personality, she becomes extremely fascinated by everyday things and has a habit of pushing random buttons.  Finally, we have Minato.  As Junichi's younger sister, Minato takes care of her brother on practically everything and has an incredibly close bond to him, to the point of having a brother complex.  Kind and mature, Minato acts as a motherly figure towards her brother.  Other characters in this really have no other purpose then to drive the plot along.  They have one trait only and exploit that to the point of being annoying.  \\n\\n\nAnimation and sound: The animation for this is actually pretty decent.  The character design is well done and deserves praise with its fluidity.  The voices in this are pretty decent as well, with everyone's favorite tsundere voice actress, Rie, and Aya Hirano as the voice of Minato.  (I seriously cannot believe that Haruhi Suzumiya and Minato are voice by the same person.)  The opening songs and endings however sound-wise, are very generic and boring, and I suggest to skip it.  \\n\\n\nPersonal enjoyment: Believe it or not, I have a harem spectrum.  It ranges from really good harems (i.e. Clannad, Kanon 2006), to really, really bad harems (i.e. HSOTD, School days, demon king Daimao).  This anime is smack dab in the middle, maybe edging towards the bad side.  While this anime has several ups, it has many downs and so many unnecessary plot points that I can say with an honest voice, are random and stupid.  Above all, the ending, is just, no.  The ending can bring any anime down a lot due to its unsatisfactory conclusion. If you like crappy love stories, go ahead.  This is the perfect thing for you.",
            "date": "2013-10-04T23:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 115503,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=115503"
        },
        {
            "content": "Firstly, Akane-iro ni somaru saka is a very well executed and has many aspects that makes us wan't to finish the anime. The plot was fairly adequate with many twists and turns. However, after the first episode I feel that the plot went dry as it progressed. \r\nHowever, the last 3 episodes were so infuriating I could have pulled my own hair out. I honestly hated the ending and that is what made me feel that I wouldn't watch the anime again.",
            "date": "2014-03-16T15:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 135883,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3448789.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Fedelia",
                "username": "Fedelia"
            },
            "url": "https://myanimelist.net/reviews.php?id=135883"
        },
        {
            "content": "This anime is something you might watch if you enjoy weird twists. While i myself was not particuarly fond of this type of twist it was still preety enjoyable. I think the best part was the characters. They were all very individual and had there own special traits. The art and sound were good as well, i have heard and seen beter though. And finally the story. While some may be into the final couple i was not. I give it an overall 7. I would reccomend this anime, as most of my problems with it lie strictly in my bais opinion.",
            "date": "2009-06-16T22:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 15820,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/194966.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SassyMarmot",
                "username": "SassyMarmot"
            },
            "url": "https://myanimelist.net/reviews.php?id=15820"
        },
        {
            "content": "Short Reasons (I avoided hinting too much but if you want to read why I gave them low scores read at the bottom. Although I'll still be vague.)\r\nStory : 5/10\r\nThe story is a bit cliche, but so are a lot of things. They knew how to use the their opening plot. But some things just can't keep going right..(read hint below)\r\nArt: 8/10\r\nI'm rating this anime on the year 2013. Compared to its competitors back in the 2008, the art is quite good and consistent.\r\nSound: 7/10\r\nSame reasoning with Art but wasn't exactly \"very\" good in my opinion.\r\nCharacter: 6/10\r\nCharacters were amusing and fun to watch. Theydidn't feel all that generic and you could see some development throughout the episodes. But some things just can't keep going right..(read hint below)\\n\\n\r\nEnjoyment: 6/10\\n\r\nPretty much self explanatory if you've read the above.\\n\\n\\n\r\nReason for low scores: (Hint for why)\\n\r\nThe anime was building up pretty well, it was like watching your very first balloon get inflated. But instead of being handed to you, the bastard inflating it lets go of the balloon and laughs at you as you both watch it release the air and fly away. \\n\\n\\n",
            "date": "2013-03-30T12:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 91635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Linarc",
                "username": "Linarc"
            },
            "url": "https://myanimelist.net/reviews.php?id=91635"
        },
        {
            "content": "I'll cut to the chase. The anime has the love & romance scenes. After watching the whole anime in my opinion it does kinda border the ecchi/hentaish catagory. There are several funny scenes - love scenes and some heart breaking scenes. After watching the anime I felt it was knid of similar to the anime Tora Dora. Not only because the same voice was used for both female leading characters in both the animes but also the story was knid of similar to. If you like this anime then i recommend you watch Tora Dora.",
            "date": "2009-07-05T05:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 16466,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/178226.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/spinky",
                "username": "spinky"
            },
            "url": "https://myanimelist.net/reviews.php?id=16466"
        },
        {
            "content": "where to start it's a normal harem,ecchi,romance anime with a lil bit action in it but really a tiny bit.\r\nwell i guess i enjoyed it kinda.it's drawings were cool and ecchines is ok\r\nso if u are bored and wanna see some romance,ecchi u can watch it",
            "date": "2010-03-29T08:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 24436,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/291600.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/chingstah",
                "username": "chingstah"
            },
            "url": "https://myanimelist.net/reviews.php?id=24436"
        },
        {
            "content": "Not exactly, but it's not much better than that series. Akane Iro ni Somaru Saka is yet another visual novel anime in a sea of recent visual novel anime that have all become the rage in Japan as of late. But how does it fare against most others of its type? Not very well, honestly. Despite cute character designs, a decent cast of actors and actresses, and a few humorous bits here and there, most of the series spends 12 episodes saying things it could have said in half that.\r\nPart of this is responsible by a single character: Yuuhi. If tsundere was an actual partof the English dictionary, you would probably find a picture of her there (along with nearly every other role done by her actress, Rie Kugimiya). Frankly, I'm sick of romance series plagued with these kinds of heroines, as these characters come off less as girls who are shy around their love interest but act mean or violent as a way of hiding their true feelings than robots that have switches on the back of their heads that allow them to change emotions at will. One episode she's being shy, flustered, and helpful, the next she's being a grade-A bitch.\\n\\n\r\nNot like Junichi is much better. He's surprisingly careless when it comes to those around him (especially to his sister), and comes off less as a teasing but well-meaning guy like Yuichi from Koyoto Animation's Kanon and more like an ass who only thinks of himself, only having a venerable change of heart when the show needs him to open up to Minato and Yuuhi. Oh, and let's not get into how he lusts over his sister a couple of times in the series, even fighting his inner demon at one point to resist the urge! As for Minato herself, she's domestic to a tee. It's less cute than it is disturbing, and Aya Hirano doesn't sound all that interested in her character as she reads from the script (can't say I blame her). So already Akane Iro ni Somaru Saka fails to tell a decent romance story by having a couple with no chesmisty or any reason for them to get together other than the writers making them do so.\\n\\n\r\nAs a comedy, it's not much better. Akane Iro ni Somaru Saka attempts to be funny by having Nagomi, a weird pink-haired girl, randomly pop up in places and jot down data concerning Junichi and Yuuhi's relationship. While a fairly amusing character, she is underutilized and doesn't really do much until the final episodes. The rest of the \"comedy\" revolves around the same tired jokes you've seen in stuff like Love Hina and Girls Bravo. Like the boy walking in on the girl while she's naked, or the lights go off and the guy falls on top of the girl and touches her breast, or the girl getting embarrassed by something and slapping the guy in the face. (Stuff the Japanese consider to be \"comedy gold\".) The only genuinely funny moment I found in the entire series was when Minato told Yuuhi about her older brother's porno collection, keeping a straight face through out, even when she reveals to her his second stash of porn. It doesn't sound funny when you read it, but trust me: that one scene is funnier than 90% of the series hands down. I rarely laugh out loud when I watch anime, but I did then.\\n\\n\r\nOkay, so the humor is (with the exception of the above scene) stale and not all that funny. But hey, this is a visual novel anime adaption! Surely there are other girls that you can attach yourself to and like, right?\\n\\n\r\nAgain, not really. There are other girls in this series, but since they all think Junichi and Yuuhi should be together, it takes a lot of the tension that could have build up between them. Again, this wouldn't bother me so much if Yuuhi was a like able character, but she isn't, especially when Junichi's childhood friend, the snoopy Tsukasa (voiced playfully by Marina Inoue) is a much nicer girl overall and (in my opinion) would make a far better choice as a girlfriend for him. The rest of the female cast isn't very interesting. There's Karen, the rich, pampered girl, Mitsuki the cutesy student body president, and various other supporting girls. The show mainly revolves around Junichi, Yuuhi, and Minato, and they never let you forget it.\\n\\n\r\nEventually Akane Iro ni Somaru Saka gets serious and stops playing with kiddie gloves when it comes to Junichi and Yuuhi's relationship, but not until the final two episodes. The writers waste whole episodes on stupid filler (like the obligatory school festival and the obligatory \"haunted\" house) instead of utilizing the time they had to flesh out the characters more (main and supporting alike). You know who I found myself liking the most in the series? Junichi's amusing parents, who are explorers and travelers by nature, infrequently arriving in helicopters to talk to their son about what's going in his life. They're cool, calm, and collective (unlike the rest of the series' cast), which is part of the reason I attached to them pretty quickly. Every time they came and left I felt a little annoyed, because I knew that I would be going back to the Accidentally Careless Boy Lives With His Annoying Fiance and Overly Domestic Sister Show soon after.",
            "date": "2014-06-14T13:37:00+00:00",
            "helpful_count": 0,
            "mal_id": 146993,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3730577.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RirukaNo1",
                "username": "RirukaNo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=146993"
        },
        {
            "content": "Well, to begin I'll try to make this as spoiler free as possible. Although my main problem is the ending so I'll probably mention it once. So *spoilers* you've been warned.\r\nStory: 7/10\r\nThe story is about our stock character protaginist (for those who don't know it's means a character usually the main one who has no defining qualities) saving a girl from being mugged. Afterwords he misinterpretes said relationship as one in romantic nature which she doesn't like, causing her to go (adorable) tsundere. Later they find out their parents are actually set up an arranged marriage between them. Me being a lover of cheesy romcomswith unique (or not so unique. I think I've seen a couple other anime with the same arranged marriage things though for non-comedy this is probably the best.) twists I thought the story was pretty interesting. Though since it was based off a visual novels and only like 12 episodes it did have faults. Mainly basic harem problems.\\n\\n\r\nArt:7/10\\n\r\nIt was basic modern anime. Meaning it had nice color, and well made backgrounds. So yeah..\\n\\n\r\nSound:5/10\\n\r\nI didn't actually pay attention...\\n\\n\r\nCharacter:6/10\\n\r\nThe character's were actually pretty well done. Our main character despite being a stock character had a interesting back story. His little sister was unique, and our main heroine was really cute. Of course their other character's like the best friend guy which was good because instead of being the pervert who does pervy things, he's basically the devil tempting our protaginist. I thought it was fun.\\n\\n\r\nOverall:6/10\\n\r\nDespite everything else having decent scores. I had one major problem with this show being the ending. *Spoiler* I have this whole harem double standard thingy where I hate any harem where the main character doesn't choose my favorite girl. (Like this and Hoshizora) This developed the main girl a lot just to have his sister picked! His sister! Oh wait, they're actually not related by blood! How convientent! Too bad he didn't know, and he still was okay... Not that I have anything against you incest lovers this is soley for my hatred of animes that don't let my favorite girl get picked. \\n\r\nSo if you want to cry in bed for about a couple weeks (it's Sakurasou all over again! I liked Nanami) then yeah! If you want to watch a romantic comedy until episode 11, or 12 then pulled out that last couple chapters of the manga even better!",
            "date": "2014-06-29T05:40:00+00:00",
            "helpful_count": 0,
            "mal_id": 149259,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3658019.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GoodLuck",
                "username": "GoodLuck"
            },
            "url": "https://myanimelist.net/reviews.php?id=149259"
        },
        {
            "content": "Junichi is a high school student living with his sister when suddenly a girl barges into their lives, claiming that Junichi will be her fiance. Though it sounds just like a more forceful version of Da Capo SS, the difference is that the little princess this time is actually cute and has a real chance at winning the main character's heart.\r\nASS (quite a loaded abbreviation) is a light, comedic harem based around ordinary school life and the after school adventures of a group. I originally picked this up due to the incredibly strong list of Seiyuu and they definitely deliver.\r\nOverall, this is a fairly averageharem. A good watch for its length if you've got nothing better to do.\\n\\n\r\nAnimation:\\n\r\nThe animation is crisp and clean, definitely up to 2008 standards. The characters are drawn very nicely though some of the girls have gravity-defying hair. The overall presentation is very consistent except for the random UFO and the action sequences where the parents randomly appear.\\n\\n\r\nSound:\\n\r\nThe OP and ED are fairly good but nothing spectacular. The BGM is a good support for the storyline but could have been much more dramatic at times (thus falling short of Da Capo Status). The VAs, on the other hand, make up for what is otherwise a fairly average story and character set.\\n\\n\r\nStory:\\n\r\nThe premise and initial exposition of the characters was very well done. The main and supporting characters were presented in an interesting and plot-progressing way. Usually we don't see the main character taking action in the first episode... Anyways, the series appears to be very one sided until two thirds through the series. Will Junichi go with his initial impulse or will unexpected relationships develop? Watch the show to find out.\\n\\n\r\nOne of the more disappointing aspects of this show is the weak climax in the last episode. It should have been a lot more dramatic and powerful considering how long the series built up to it.\\n\\n\\n\r\nCharacter:\\n\r\nJunichi was a middle school delinquent until his sister moved in and redeemed him. He is lazy but brash, a good change compared to most of the wimpy, shy guys seen in typical harems. Minato takes care of Junichi and is essentially a \"perfect\" sister, doing all the Cs (chores, cooking, and cleaning).\\n\\n\r\nInto this family comes Yuhi, the daughter of a friend of Junichi's father, who has been forced by her father to marry Junichi. She initially comes to detest Junichi and bring evidence of why he is unfit for her. Obviously, things don't go her way as she eventually develops feelings for him.\\n\\n\r\nThe character development in general was well done, though I'm not about to nominate anyone here for the best character of the year...\\n\\n\r\nValue:\\n\r\nA fairly good, light harem overall. There are some deeper points in the series (the entire alien observation and Minato's true relation to the Nagase family for example) that may merit a second watch.",
            "date": "2015-11-01T14:31:00+00:00",
            "helpful_count": 0,
            "mal_id": 202428,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202428"
        },
        {
            "content": "I thought that this anime was really good in my books because im a person that likes a good harum and i think Akane-iro ni Somaru Saka passed the fullfillments as in that there was both romance and drama and pretty good comady thrown in but there still was some falts but not many to get freaked out about i also thought that the end was well hidden and put it to the full enjoyment to end it so i would reccomend this anime",
            "date": "2010-03-09T17:43:00+00:00",
            "helpful_count": 0,
            "mal_id": 23844,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/speedpunk",
                "username": "speedpunk"
            },
            "url": "https://myanimelist.net/reviews.php?id=23844"
        }
    ],
    [
        {
            "content": "I have sort of a mixed opinion on this anime. I mean I've never really liked Harems, I've always liked Reverse Harems so this was a first for me. I first watched this because the quality of the Art was outstanding. I wish the story would have moved faster though, and I was pretty upset with the ending. But all in all it was a pretty feel-good anime that gave you a lot of entertainment.",
            "date": "2012-10-13T20:19:00+00:00",
            "helpful_count": 0,
            "mal_id": 74869,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1451781.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/XxYoursTrulyxX",
                "username": "XxYoursTrulyxX"
            },
            "url": "https://myanimelist.net/reviews.php?id=74869"
        },
        {
            "content": "First, let me say this; this anime was not a \"harem\". A harem needs to have a minimum of 3 girls being love interests to the protagonist through out the series. And while a few of the girls can be considered \"implied\" to like the Main Hero, it's not really set in stone and as such, this is not a \"harem\" anime. It is based off of a harem game, but with only 2 love interests, you can't call this a harem. (Karen did call herself Yūhi's love rival, but that was barely in the last episodes, and it was more gag effect, she wasn'treally a love interest; even if the girl has no chance, she needs to be a love interest and it has to be a part of the story, not just randomly thrown in there)\\n\\n\r\nNow besides that point, this was a good story though I would say that you should avoid this anime if you don't like incest, stay away from this (there are a few things that could point to it not being incest, but those might also be something else), so be careful.\\n\\n\r\nIt's funny, it's sweet and the art is pretty well done. It'll give you a good laugh and it's nice. A great anime that is fun and lovable. You'll really love this anime and will wish for more, so be warned and enjoy XD!!!",
            "date": "2013-08-19T23:57:00+00:00",
            "helpful_count": 0,
            "mal_id": 110481,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2463757.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/deathmailrock",
                "username": "deathmailrock"
            },
            "url": "https://myanimelist.net/reviews.php?id=110481"
        },
        {
            "content": "I won't be watching this one again.  I just don't buy this Romantice Insest.  I don't let your kids watch it if you want to keep them away from such ideas.",
            "date": "2012-10-02T14:46:00+00:00",
            "helpful_count": 0,
            "mal_id": 73919,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/davidshao",
                "username": "davidshao"
            },
            "url": "https://myanimelist.net/reviews.php?id=73919"
        },
        {
            "content": "I really liked the anime even though the story was good it was kind of predictable, but still enjoyable. The anime looked very good and the sound was also pretty good too, overall I really enjoyed watching the anime, but you should ask yourself whether you like the genre or not, because if you dislike these kind of anime, you are going to dislike Akane-iro ni Somaru Saka. I would recommend watching it if you are into these kind of anime.",
            "date": "2013-12-27T14:45:00+00:00",
            "helpful_count": 0,
            "mal_id": 125881,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3432497.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Moffiko",
                "username": "Moffiko"
            },
            "url": "https://myanimelist.net/reviews.php?id=125881"
        }
    ]
]