[
    [
        {
            "content": "Oh boy, Fate/Extra: Last Encore. I should say, right off the bat, that while I am a fan of the Fate universe, I am not a fan of some of their more recent adaptations. (I’m looking at you, Fate/Apocrypha) As a series that’s over the top like Fate/Extra Last Encore, it felt like a chance for me to take a wild ride, turn my brains off, and try to enjoy this for what it is. How did I feel at the end? Well, let’s just say that I want my time back if I had a holy grail.\r\nWhen Shaft was announced as the studio forproduction, I immediately raised an eyebrow and found myself wondering if this could ever work. As an anime adaptation of Fate/Extra, this became a plot that’s modified for the sake of anime storytelling. It sells its story similar to some of the other Fate franchise’s series if you’re familiar with the franchise. Jumping into this show was not easy for me despite my familiarity with the Fate universe.\\n\\n\r\nSo I decided to give this a shot anyway. Why not? It has an alluring premise and takes place in an alternate timeline to Fate/stay night. In this timeline, mana have disappeared and Wizards are forced to use virtual space for magic. Similar to some of the other Fate series, a Holy Grail War is set up by a computer that pits 128 Masters in a tournament. The winner will be chosen with a wish to be granted by the Moon Cell Automaton, a mysterious computer of unimaginative powers. Main male protagonist Makuno Kishinami gets caught up into this battle for survival and is clueless on why he is involved. Luckily for him, he gets a servant called Saber. (do note for the sake of avoiding spoilers, I’ll just refer her as “Red Saber” from now on)\\n\\n\r\nYes, this formula is definitely not something new despite some differences with the world setting and premise. What bugs me though is how the main plot is executed with Hakuno and Red Saber as the main characters. Don’t me wrong. They are highly entertaining to watch at first but after a while, you may wonder if it’s worth investing time into them at all. In particular, Hakuno is a very oddball character and seems to be only motivated to survive and avenge the deaths of others. In a way, the guy can be viewed as an anti-hero. My impression of Hakuno gradually faded more and more after seeing his development. In essence, he doesn’t develop much at all and his personality feels all over the place. It doesn’t help that Red Saber is incredibly one dimensional and behaves like a child. While she can be addictively cute to watch at times, Red Saber is hardly a character I would declare as well-written. We don’t know much about her and it’s hard to judge what her motivations are in the story. So yeah, watch this for the mindless character chemistry but if you’re watching for concrete characterization, look elsewhere.\\n\\n\r\nIf you’re hoping some of your favorite Fate character to show up in this series, then prepare for disappointment. Only a small handful of characters like Rin, Sakura, and Shinji appear and most of their roles are downplayed to get over the main cast. Some of the characters from Fate/Grand Order game also shows up although their roles are so small that you’ll likely forget them incredibly easily. Most of the minor characters have their roles minimized and episodes’ resolutions feel rushed. Oh and Shinji….what a bastard. I wish the series deleted him and never gave him a chance to show up for his abominable personality. But the series’ main story is not abominable. It’s actually much worse. For the majority of viewers, you’ll probably scratch your head on what the hell is going on. I know I did and feel like the series tries to do way too many things at once. Now, I know Shaft is known for their style to present this anime like a theatric thriller with avant garde cinematography. But wow, this show easily fell apart in the beginning and didn’t manage to salvage itself at all. With just 10 episodes, it became more of mindless popcorn entertainment than a creative story to tell.\\n\\n\r\nI mentioned Shaft few times already but I’ll do it again. The studio’s ideas can easily be recognized by their artistic choreography and avant garde artwork. Running gags with violence and head tilts are also pretty easy to spot. The biggest culprit here is Hakuno as he gets his limbs tore apart, body impaled, and put into a position where he can easily die. Somehow, he survives and we see his reaction in a dark grimy way. I think Shaft wanted us to experience what they do best at and honestly, I think they went a bit overboard this time. The shock value in this anime feels impactful but serves little purpose besides amplifying Hakuno’s personality up to the 11. Oh and the fan service. It seems this show wants to milk Red Saber as an eye candy ever chance it gets. The camera always flirts with her by showing lewd body parts, poses, and try to make her as sexy as possible. Bath scenes occur several times in the show and Red Saber never seems to be uncomfortable being nude. It’s pretty shameless and easily distracting to the point where viewers may talk more about the fan service than the story. On the other hand, I think the battle cinematics is nicely made. It’s fast paced and captures an alluring style of fighting. While glorifying servants’ abilities to fight, it also doesn’t make us forget how badass Hakuno can be. Finally, I have to point out that both the OP and ED theme songs are quite attractive once you get used to the style. The charismatic movements of Red Saber is exceptional there. \\n\\n\r\nAfter watching Fate/Extra Last Encore, I have to wonder what the hell the producers were thinking. Were they trying to make a show to get us viewers into liking the characters and story? Or was this another attempt for cash grab so fans can pour their money into their franchise. Either way, this show ended up being a disappointment for me. I can’t recall how many times I scratched my head. Oh and Red Saber's voice...she sounds like a kid stuck in an adult’s body with that infamous UMU. What a shame for a show that could have been something so much more.",
            "date": "2018-03-31T11:17:00+00:00",
            "helpful_count": 154,
            "mal_id": 275898,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=275898"
        },
        {
            "content": "When it comes to what makes the Fate franchise what it is, some will might say it's the very well-made fight scenes while others will say it's the dark psychological tone that it has. While all of that is definitely true, what really makes the Fate franchise what it is; it's the interesting philosophical dialogues between the characters and that is really, what Fate/Extra Last Encore succeeded at most.\r\nFate/Extra Last Encore is a studio Shaft's adaption from a game and it serves as an alternative setting to Fate/Stay Night's. The concept of the story is pretty much the same as you can imagine, there arechosen masters that summon a servant each, each servant and master are fighting together to be on top and get a wish granted. The big difference is that it's happening in a tournament in the far future, year 3020 where not a lot of humans are alive. It's hard to get any deeper than that in the story because otherwise, it will be a spoiler. I also don't think you came to check this anime out thinking it will be very different than the original series story anyway. What is very different is that compared to Ufotable's adaptions of the Fate franchise, Fate/Extra focus more on the philosophical dialogues and less on the flashy fight scenes but it has those as well. As I mentioned before a lot of twists will be discoverable later in the story but I will not mention them to not spoil, just so you know that there are a lot of other interesting differences. The downside of the story category is that it doesn't explain the settings really well.\\n\\n\r\nThe characters are easily the most interesting part here. There is the protagonist, Hakuno who seems a bit uninteresting at the start but don't worry they made sure he will be interesting, there is a lot of focus on \"who he is?\" which make the character a lot more interesting as the story goes on. For the face of the series, it's obviously the Saber \"UMU\" Nero, she will get a lot of focus, even more than you imagine which is a good thing in my opinion since she is probably the most fun character to watch (Red Saber>Original Saber, fight me). Rin also gets a lot of shine here, she is more badass than the usual herself. Besides that, there are the other servants and masters, I will assure you that they all have an interesting unique design so you might enjoy watching them.\\n\\n\r\nWell for the art it's really a matter of opinion, those who are familiar with Shaft's works like the Monogatari series and such will welcome the art easily and would even find it great and suiting, others might despise it, as it doesn't look like ufotable's art and flashy animation. I personally belong to the group who are familiar with Shaft's works and finding the art great even though ufotable is my favorite all-time studio. The one thing that most fans will most likely won’t admire shaft for, is the different character designs for the characters that aren't new to Fate like Rin, Sakura, and Shinji. Overall, the art and animation style is a plus for me as I think it's really suited for the psychological and mystery tones of Fate/Extra.\\n\\n\r\nFor the music part of the series, the opening (\"Bright Burning Shout\" by Takanori Nishikawa) is amazing, it's rocky and catchy, really suiting for this series, it took my favorite opening spot this season (Winter 2018). Visually it only shows Nero fighting with different hairstyles, take that however you want. (Fun fact: It's the first time that a male sings the opening song for a fate series). For the ending (\"Tsuki to Hanataba\" by Sayuri), I think it's quite suited, don't sure if I love the song but I do like it, what I love is the visuals, they are showing the connection between Hakuno and Saber while also showing the Master and servant they are currently fighting, I really liked that. For the voice acting there is, of course, the umu so enjoy it. The ost has all kinds of tracks from futuristic to emotional, nothing crazy but I think it's very suited.\\n\\n\r\nSummary:\\n\\n\r\nPros:\\n\r\n- Characters are fun to watch.\\n\r\n- Interesting philosophical dialogues.\\n\r\n- Great and catchy opening.\\n\r\n- Suited animation style. (Makes the dialogues more psychologically interesting)\\n\\n\r\nCons:\\n\r\n- The art style might look weird to some.\\n\r\n- The story isn't explained so it'd be easy to understand.\\n\\n\r\nFate/Extra Last Encore isn't for everyone, that's for sure and that's why I wouldn't recommend it if you aren't a huge Fate fan. Because if you have only watched Fate/Zero and Fate/Stay Night [Unlimited Blade Works] then you have nothing to do with this series, you wouldn't enjoy it. However, if you are a huge Fate fan who have read the original visual novel, watched all the anime adaptions or of course, if you played the game then watch it, it was made for you.",
            "date": "2018-03-31T11:11:00+00:00",
            "helpful_count": 113,
            "mal_id": 275897,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2659237.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MrMushin",
                "username": "MrMushin"
            },
            "url": "https://myanimelist.net/reviews.php?id=275897"
        },
        {
            "content": "“I am not a fake, I will forge my own identity” \r\nThere is a saying that goes between the Ufotable Fate series purists, that “Any Fate not made by Ufotable is shit” and that statement was usually right from what I've seen, Fate Loli was as mentioned all about Lolis, Fate Apocrypha was a laughable joke to most and then we have this anime, Fate Extra Last Encore that was made this time by Shaft. The Fate series is popular enough to be adopted by almost every studio and this brings either positive or negative results, and fortunately unlike other non-Ufotable Fate anime series, FateExtra did not disappoint as much. Why? It had a main character even better than Emiya Shirou. And that's saying something.\\n\\n\r\nBased off the game of the same name, Fate Extra introduces us to a character named Kishinami Hakuno who is betrayed by his friend Shinji (oh Shinji you are there every time) but escapes death and is chosen to participate in the Holy Grail war, not before getting the most powerful servant of them all, Saber (yada yada same introduction as all other Fates) but this time Saber isn't an elegant King of Knights, oh no, this new Saber is a busty mainly-for-fanservice character whose sole purpose isn't just to attract horny teenagers to get a Saber Figure but this Saber also plays an important part and thankfully unlike Unlimited Blade Works, her backstory is given a proper explanation in a later episode, further fleshing her out as a character (no pun intended).\\n\\n\r\nEven though we had 10 episodes we didn't see much action, it was mainly build-up, discussion, backstory and meetings. This Fate wasn't the action Fate, if you want that go to UBW, this Fate’s focus was more in world building and character introductions like Rani who play an important part in the Fate Universe (although she plays a small part in this anime). One of the things I didn't like much about this anime was that mostly adopted a 'villain of the week’ Shounen trope and to be honest it didn't bring as much development as I had hoped, although it’s portrayal was better than many Shounen anime out there it still felt somewhat lacking, either due to my dissatisfaction with the trope or because it wasn't done well. On the other hand the plot progressed smoothly, thankfully the episode number was increased from 6 to 10 mid-season this meant we got much more development especially for our main character Kishinami Hakuno. \\n\\n\r\nMany times (or actually every time) it is the male main character who defines an anime for what it is, Emiya Shirou defined the storyline for Fate UBW, Kiritsugu defined Fate Zero, much in the same way, Hakuno defined Fate Extra. Although he had little to no personality in episode 1 (please note that he was still better in character than Shirou, at least to me) the focus and improvement noticed in the second half is what made me increase my score from a good 7 to a great 9, Extra just felt that good that it felt equal to UBW and to a lesser extent with Zero (Fate Zero is best Fate, fight me :P). As for the other characters Saber was quite the focus as well even though her relationship with Hakuno felt more like Saber was teaching Hakuno everything instead of them both working together equally (although I must say that also changes later on) but the important fact here is that Nero got her backstory while Arturia didn't. Or at least it was much more explored. So overall for the main characters development was excellent and elegantly done.\\n\\n\r\nNow where does that leave the side characters? Unfortunately they didn't get enough screen time or development. Tohsaka came at convenient times and although her fight with Berserker and another friend-turned-enemy (I'm not spoiling it, watch and understand) was amazing she had little or nothing to do with the plot progression which is unfortunate since she could have done much better given the chance. Other than that I could only find Rani a recurring character that too only because she came for 2-3 episodes and not 1-2 for the villains and she didn't get development at all. Her story as well was very brief and felt like an afterthought. As for the other characters we have the villains, only some of which got development and the cameos by Shinji and Kotomine Kirei in the first episode. Pretty disappointing for the side characters but amazing for the main ones.\\n\\n\r\nDisappointing and amazing reminds me of the confusing yet amazing yet somewhat disappointing art style of the anime. Animated by Shaft (you know, those Monogatari people?) I made a huge mistake by expecting Ufotable-like art style and instead got an animation below average. It felt horrible at first and I couldn't get used to it at all in the first episode. Fortunately the staff themself might have realised and fixed most of the issues and after episode 3 or so the art improved considerably, especially so in the Dream Land. The Dream Land arc was my favorite since it was so dark and intriguing not to mention mysterious, the Dream Land arc might as well be the only reason Fate Extra is so amazing. If the main characters don't impress you, there's a high chance the Dream Land arc will, so I won't gloss over it much and move on. Something you should gloss over is the soundtrack, because that is amazing and my favorite part about Fate Extra apart from the main characters.\\n\\n\r\nAs a nod to UBW, the OP started off a lot like Brave Shine and the song itself was just as amazing not to mention the visuals used. Meanwhile something I found much better was the ED sung by none other than Sayuri who sung Tsuki to Hanataba and all you need to do is to go on YouTube, search this song and listen for yourself the amazing power of Sayuri’s voice, if you haven't already heard Sora wa Sore wa Chiisana Hikari no Youna from Boku dake ga Inai Machi (ERASED) and fallen in love with her voice. On the other hand the background music used was unsurprisingly excellent, why unsurprisingly? If you've watched the Monogatari series you'll realise. \\n\\n\r\nAll in all Fate Extra is an anime that although falls short of beating Fate Zero it does pretty much equal UBW in many aspects which says a lot about it's quality since most other Fate anime made by non-Ufotable studios were either flawed or garbage (very rarely did we see a good non-Ufotable Fate) but Fate Extra has its shortcomings and they measure up on the scale as well. Although this was a show I enjoyed a lot, I can't ignore it's flaws as well, side characters, art style and villains were problems Shaft couldn't fix for the anime and so I felt disappointed to a certain extent but also was amazed too since this quite literally is the best non-Ufotable Fate we have (apologies for repeating non-Ufotable so many times) so we can move forward. What will the next Fate be? Will it be better than UBW (arguably the most popular Fate)? Will it surpass Fate Zero in quality? These are questions only the future can answer so all we can do is wait and see what happens. As for now, enjoy this beautiful anime.\\n\\n\r\nOverall Rating: 7.2\\n\\n\r\nP.S: Hakuno x Hakuno (you won't get it unless you watch it so don't worry :P)",
            "date": "2018-04-01T23:28:00+00:00",
            "helpful_count": 43,
            "mal_id": 276473,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=276473"
        },
        {
            "content": "The theatre \r\nThe murmuring of the audience revibrates off the walls of the auditorium. It's opening night. Many are anticipating the performance because it's a branch story of a famous franchise. Others are skeptical and don't believe that it will be able to hold up against it's predecessors. Soon the lights dim and the audience silences as the curtain opens, revealing the stage. As the actors put on their performance, many watching become immediately confused with the story and find themselves unable to connect with the protagonist. Though the crowd is losing interest, there's suddenly a change in dynamic. For the heroine finally steps outonto the stage, her blonde hair and red attire immediately captivating all who gaze upon her. The crowd roars and vigorously applauds, for the theatrical woman was the primary reason why many attended the show to begin with. But would this stunning lady be enough to cement the performance as something truly spectacular?\\n\\n\r\nFor the majority of viewers, apparently not. But the beautiful heroine known to many as simply \"Saber\" isn't the only positive aspect of the show. If viewers were to simply dig a little deeper, they might discover that there's more to the show than meets the eye.\\n\\n\r\nFate/Extra is yet another installation in the popular Fate franchise. Being a fan of the series, I went into this anime with some expectations, especially considering the fact that Studio Shaft, the one who took on this project, is one of my favorite anime studios. Now I've never played the source material, so I came into this anime with no knowledge on what it would cover. Unfortunately, by the end of it, I still wasn't entirely certain on what it was about.\\n\\n\r\nThe biggest issue that I had with this anime was it's convoluted story. Now while I feel that Fate/Extra is somewhat underrated, I have to admit that the plot left more to be desired. I honestly tried to understand what was going on, but so much of the story and details around the characters were left vague or entirely unexplained. This problem can be partly attributed to the short supply of episodes, but that still isn't a good enough excuse considering the fact that many short anime are able to succeed. There were several intriguing plot twists, such as the origins of how protagonist Hakuno came to be, but even they were a sort of double edged sword. Because while they shed some light on the story and characters, they also opened the door to many more questions that were usually left unanswered. I sadly couldn't enjoy each episode to the fullest because I was constantly trying to make sense of everything that was going on, and based off of what I've heard from others, this problem plagued many who watched the anime.\\n\\n\r\nThe second and final significant issue that I had was that aside from the main characters, the rest of the cast received very little development. Now don't get me wrong, I actually liked a lot of the characters. The servants were pretty interesting, with my favorite being Nursery Rhyme. However, the anime decided to have several two episode arcs featuring the protagonists vs a master and servant pair, and after the heroes prevail, they move on and the losers are forgotten. Now let's briefly analyze how Fate/Extra's sister anime Fate/Zero went about showcasing it's characters. In the entire 12 episode first season, only ONE out of the 14+ participants in the Holy Grail War perished. This allowed for every master and servant pair to develop over the course of the first season, making them much more fleshed out and letting viewers more easily connect with them. Fate/Extra on the other hand barely dedicated any time in developing it's supporting cast, which resulted in many otherwise interesting characters being quite shallow.\\n\\n\r\nNow that we've got the boring critical analysis out of the way, it's time to talk about the good stuff. UMU! Let's go!\\n\\n\r\nFirst of all, the visuals are stunning. Shaft's animation techniques can be a bit of an acquired taste and aren't for everyone, however I think that they're amazing and really creative. I particularly loved the visuals used during the Alice and Nursery Rhyme arc, because they were similar to the inventive and unsettling animation used in segments of Madoka Magica, one of Shaft's most iconic anime. Another great aspect of the show was the soundtrack. There are several great tracks in this anime, with my personal favorite being the ending theme song by Sayuri.\\n\\n\r\nLet's address the star of the show. Who is this stunning person you may ask? Why Saber of course! Since it's not immediately revealed in the anime, I'll keep her true identity a secret. Now I've seen complaints stating that the anime is just Saber fanservice and has no depth to it, but I'd have to somewhat disagree. Yes, the anime does dedicate a lot of time to Saber's antics, cuteness, and naked body. But she is also used as a device to dig into the mentality of Hakuno, the true protagonist of the story. The pair have many a philosophical conversation throughout the course of the anime that provide insight on each of their beliefs and conceptions of the world and themselves. These talks are oftentimes quite deep, and actually end up being the highlight of each episode for me. I don't think there's anything quite as intriguing as studying the psychological state of a character, and the anime really succeeds at gradually providing insight into Hakuno's thought process and his eventual spiral into despair. Saber herself is oftentimes full of inspirational advice that not only touches Hakuno, but can even reach out to the viewers themselves. This isn't an anime about cool and flashy action sequences. In fact, the fights showcased in this show are generally quite lackluster, especially when compared to others in the franchise, and I believe are one of the prominent reasons as to why this anime has generally low ratings. However, this isn't a show about fighting, but about people, as most good Shaft anime usually are about. And if you recognize this, then you may just realize that Fate/Extra isn't really all that bad.\\n\\n\r\nYou know, I really enjoyed this anime. Despite the confusing story and underdeveloped side characters, there was still so much to like about this show. The cast was still fun to watch, the presentation was fantastic, it was intriguing, and just a simply entertaining viewing experience. Oh, and it had Saber in it. Bonus! Now as the actor's take their final bow and the curtain closes, it seems that many in the audience left the theatre unimpressed. I, however, pleasantly enjoyed the show, and I hope that it satisfied you too.",
            "date": "2018-04-01T20:58:00+00:00",
            "helpful_count": 42,
            "mal_id": 276450,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3813391.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/XHellLyterX",
                "username": "XHellLyterX"
            },
            "url": "https://myanimelist.net/reviews.php?id=276450"
        },
        {
            "content": "Born directly from the father of Type Moon, Kinoko Nasu himself, Fate/Extra: Last Encore is a fascinating title in the franchise of Fate, and the Type Moon universe at large. Despite Nasu’s attempts to inform everyone about the intentions behind this anime and how everyone would be at an even playing field here, mass confusion broke out. It is only loosely based on the game, and due to the unique circumstances of the show’s narrative, it has been deemed unfit as a start. Perhaps this explains the disgustingly poor reception of this wonderful show.\r\nSuch a shame, since this anime is a sheer, flooring spectacle. Itdoes not stop. It explains as it goes along, showing the sheer brutality of its style and depictions of events. Regrettably the blitzed pacing makes us ask questions in order to connect how characters figure things out or otherwise do something important in terms of progressing the narrative. Thankfully it is the only severe problem with the narrative, as all other questions you ask slowly get answered. The anime should let itself breathe more, as its crammed tightly with exposition that moves at a lightning pace, whether that be exposition about the setting or about a character. It clenches you by your wrists and never lets go, as it flies off into the hellish world it wants to show you as it unfolds before your very eyes! A disorienting start that gives you an oppressive, dreadful vibe, and never lets that vibe escape. It is ubiquitous throughout this precisely crafted, chaotic spectacle of a series. The series gradually pieces itself together like a puzzle. The information we learn shows is that this is no ordinary Fate anime; this technological nightmare of a system the character's life in is equal parts bewildering and horrifying. The more you learn, the more crushing everything feels, as the setting is nothing more than an automation of atrocity in which mankind has no hope beyond one last chance at survival. Nearly everything makes sense in broken context of this ravaged, now disorganized world of the frightening future, despite how brisk the pace is and how convoluted things can be regarding the floors and the vile, disturbing setting. The visions Hakuno has are largely an exception, excluding visions of the past. Sadly, that alone makes this a daunting choice, no matter where you are in terms of Fate expertise, and what makes or does not make sense will not only be difficult to explain, but will likely be lost on you regardless. The excessive flashbacks do not mitigate this issue either.\\n\\n\r\nThe scenery is a glorious feast for the eyes, and the directing conveys this omnipresent sense of dread masterfully. SHAFT and the main director, Akiyuki Shinbou, as well as an added director, Yukihiro Miyamoto, mastered their craft perfectly with the most brimming of creative architecture your ever-pleading eyes can consume. An interesting idea that helped sell the distorted and discomforting feel of the events and setting was how often times, certain parts of the images on screen would distort as if it were a static channel on a TV or a moment of poor connection. The fight in the opening alone is proof of their luscious visuals, even if the fights in the show itself are a bit more into the territory of clumsiness to an extent, depending on the fight. Said fights are certainly far superior to Apocrypha, however, as all of them have the lovely styles and kinetic movement to rival the 22nd episode of that series. The designs are wonderful as well; everything blends perfectly with the fascinating, layered, brisk, and intense nature of the show. It is every bit as beautiful as this show’s incarnations of Rin and Sakura, and Saber herself. The rose petals and all of the attacks look majestic and vibrant, almost as much as the aforementioned architecture. Locations like the school, and Wonderland, are distinct and mesmerizing for the eyes, with such beauty only being comparable to the uniqueness of it all. The only issue is the occasional tampering of brightness that has no purpose. Other than that, the visuals are beyond exemplary.\\n\\n\r\nThe music, while not able to be as much of a pleasure to the senses as the visuals, is still wonderful and interesting. The Opening, \"Bright Burning Shout\" by Takanori Nishikawa, is fantastic, perfect for a series of action, given how adrenaline-pumping it is. The Ending, \"Tsuki to Hanataba (月と花束)\" by Sayuri, functions in mucha  similar way, with a more emotional tinge to it, though the vocals may prove bothersome to some. The background music works well for whatever scene it is in, blending in wonderfully with the mind-bending environments and the crystal clear mood of every scene. Each smaller setting within Last Encore has its own music, so aside from the opening and ending, if you hear a track in one primary location, it will almost never be played anywhere else. Think of it like video game level music, almost. None of these tracks are absurdly memorable but are ultimately nice accompaniment.\\n\\n\r\nWhat is most raw of all is what it says. People are full of desperation. They cling to survival to the point where they forget what makes life meaningful in the first place, regardless of any conflict or glory or despair. People can lose a sense of purpose and identity, a sense of life. They can be swallowed up by hatred, by confusion, by pettiness and vanity. People must always have a drive to make their lives fulfilling, finding out the meaning in things and what purpose they wish their life to have. They cannot let fear or hatred hold them back, let alone consume them as they proceed to make pathetic and ruinous decisions. They must make their lives truly have value, even with the inevitability of death, as the dead leave a legacy of decisions and worth for the living to interpret. The protagonists and each master servant pair each convey this in their own fascinating ways, with standouts aside from the beautiful and boisterous Saber and the unnerving and interesting main protagonist with his nightmarish powers that haunt him most of all, including this show’s fascinating and visceral incarnation of Shinji Matou, and other masters. Each master has a strong desire, far more than the main protagonist, and it can be fascinating and even disturbing to know what they’re in for, particularly due to the magnificent presentation of each of these, courtesy of Shinbou whose directing is phenomenal. Other characters, such as Rin, are merely there for other narrative reasons, but are entertaining nonetheless. Saber, however, is the ultimate joy, and Hakunon is fascinating to see get pieced together.\\n\\n\r\nFate/Extra Last Encore is arguably the most fascinating of the franchise's installments. It is a sheer spectacle in a completely different way to its brethren, and what it attempts to convey is far removed from what installments such as UBW and Zero wanted to tell, and what concepts works such as Apocrypha and Grand Order failed to properly explore. Does that make it the best? Not necessarily, but it is the most intriguing. It is the most terrifying and somber, next to Zero, the supposed holy grail of the franchise itself. Yes, UMU; it's such a fascinating work in so many respects deserves the respect it sorely lacks! Incomplete work or not, this work is a sight to behold. As I bid you adieu and await the continuation, I implore for this series to get the respect it truly deserves, as it is a passionate risk that pays off surprisingly well.",
            "date": "2018-04-02T12:59:00+00:00",
            "helpful_count": 21,
            "mal_id": 276556,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322238.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CodeBlazeFate",
                "username": "CodeBlazeFate"
            },
            "url": "https://myanimelist.net/reviews.php?id=276556"
        },
        {
            "content": "UMU! \r\nAfter episode 7 I felt the need to write a review about it.\r\nBut First let me address something that I see happening a lot\r\nthe Fate/Extra LE anime is not newbie-friendly so if you were not into fate.. like ate least have watched all the animes and plays Fate GO then you will prolly not understand much of it.. its the same as Buying FATE EXTELLA on steam without having played Fate Extra CCC on a PSP.. because stella is a direct sequel to CCC and so on... in case of fate extra le if you play FGO you are already familiar with the servants,knows their background story and maybe have even some kind of emotional attachment to them.\\n\r\nOr if you have played the Extra games it will be even better because you will enjoy the modifications BASED NASU is personally doing as he is charge of the series.\\n\\n\r\nSo for me the anime is outstanding..  And im not even a fan of nero... I also would prefer Hakunon instead of Hakuno hahaha.\\n\r\nShaft's Artstyle and screenplay make it even suitable for this kind of plot\\n\r\nBringing back Gekidan Inu Curry to do the art makes me want to hug Akiyuki Shinbo.\\n\r\nStory-wise I just feel like its being kinda rushed since its only 2 episodes for each battle but its faithful to the game.. its a fucking dungeon , you win the floormaster and go up.. simply as that.\\n\r\nI personally really like when they change vibes for something.. the OST of the anime gives a mistery and omnious feeling making you feel curious abouts wtf are really happening.\\n\r\nThe Characters in the anime are portrayed way more serious and mature than they actually are.. Mainly nero.. her own voice actress Sakura Tange stated that. ( I Wonder how Shaft would make Richard I look like serious because he is literally a clown Saber. I wish it was Him instead of Gawain but ok ok )\\n\\n\r\nOverall.. Im really happy with this adaptation so far.\\n\\n\\n\r\nThanks for reading.",
            "date": "2018-03-12T06:19:00+00:00",
            "helpful_count": 14,
            "mal_id": 273639,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1272231.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dReams-C",
                "username": "dReams-C"
            },
            "url": "https://myanimelist.net/reviews.php?id=273639"
        },
        {
            "content": "While writing a review on a show that is more of a mystery more than anything is a bit foolish before the series has finished having seen seven episodes what I have seen is promising. The main problem most people have coming into this is that they are expecting a different kind of show, believing it to be primarily about action and what a \"normal Grail War\" is about. However Nasu's stories have always been at their best when they are about something else. There is always a element of mystery present in his works. From the question of the situation of the Tohno family,and the details behind Tohno Shiki's injury, and his connection to the vampire killer. The slowly unfolding plot of Kara no Kyoukai where confusion is further added from the non-chronological order the story is presented. To the questions about the history and workings of the Grail War, and the question of what the Shadow is in Heavens Feel.\\n\\n\r\nThe things presented in Last Encore have their basis in concepts presented and dealt with in many other Nasu works, allowing a savvy-fan to theorize and think of many in-setting answers to what is going on. Things such as Deadface have relation to the concept of grudges in Nasu, tying our protagonist potentially to things like the Jack the Ripper of Fate/Apocrypha. Only that he is likely a being born of and propelled by the grudges of dead masters and npcs rather than aborted children. \\n\\n\r\nThere are things we can theorize, and things we expect, but Last Encore has both been a lot of fun making people think as to what is going on, and pulling out surprises that make sense in hindsight.\\n\\n\r\nTo those who feel discontent about the series it is somewhat understandable, but it is worth checking out the discussion on it on the forum of Beasts Lair, or to watch again and think things over again.\\n\\n\r\nYou will feel more lost as a anime-only viewer, but I do not believe that it is impossible. Playing Extra, or understanding CCC gives further context to the characters, and gives you the base of the setting. But Last Encore  is meant to be a confusing and enticing ride for everyone, veteran and new.",
            "date": "2018-03-12T13:25:00+00:00",
            "helpful_count": 12,
            "mal_id": 273660,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Menwearpink",
                "username": "Menwearpink"
            },
            "url": "https://myanimelist.net/reviews.php?id=273660"
        },
        {
            "content": "When I heard there was a Fate anime in 2018 done by SHAFT, one of the best studios out there, I was hyped with its weird pairing.\r\nNow it's over and I'm here to give my thoughts.\r\nStory (4/10)\r\nThe Fate series has always been slightly confusing at first but at the end, you'll understand everything and have fun.\r\nAnd it's always related to 7 classes of servants with masters fighting to win the Holy Grail.\r\nThis show took this and went 10000x more complex with it.\r\nWith the War being like a RPG where you have to clear floors to progress to the top, it was interesting on paper.\r\nI lovedhow they were taking risks with the writing.\\n\\n\r\nHowever, for 10 episodes, the exposition dominated the show so not many fights happened.\\n\\n\r\n10 episodes was too short. Due to this, the story was super rushed and everyone, me included, are left confused.\\n\\n\r\nCharacters (4/10)\\n\\n\r\nRed Saber and Hakuno were the only 2 that were showcased in this show.\\n\\n\r\nThe other servants and masters were forgettable with barely anything being explored about them.\\n\\n\r\nRed Saber was cute and charming but I feel like the writers milked her character too much.\\n\\n\r\nHakuno has some interesting abilities but is such a boring lead.\\n\\n\r\nRin was fine but nothing special here.\\n\\n\r\nAlice and Hakuno was great in their episodes.\\n\\n\r\nI'm disappointed. So many characters felt so useless in the end.\\n\\n\r\nArt & Animation (8/10)\\n\\n\r\nIt doesn't have great fights since the studio is inexperienced with fights.\\n\\n\r\nOtherwise, excellent job with such a weird yet breathtaking world.\\n\\n\r\nCharacters looked good for a world like this.\\n\\n\r\nSound (7/10)\\n\\n\r\nGood OP and ED songs, solid OST.\\n\\n\r\nEnjoyment (5/10)\\n\\n\r\nI enjoyed it to a small degree. But the lack of action hurts it a lot.\\n\\n\r\nIt's not bad but just a disappointment.\\n\\n\r\nWeakest Fate show I've seen and it's too bad since I thought this would be amazing after that 1st episode.\\n\\n\r\nScore 5.6/10 (rounded down to 5)",
            "date": "2018-04-02T14:49:00+00:00",
            "helpful_count": 8,
            "mal_id": 276568,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6391437.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/animejas",
                "username": "animejas"
            },
            "url": "https://myanimelist.net/reviews.php?id=276568"
        },
        {
            "content": "What i want to say first is: DON'T LOOK THE SCORE ON MAL AND WATCH THIS MASTERPIECE!!!!!\r\nOhh man,i want to say that i didn't play the games (Fate/extra,Fate/Extra CCC) but i loved the show and i think shaft did more than ufotable would be able to do, i like the way that shaft play with your mind and after you watch a episode you are like \"what the fuck?\" and after a episode \"owww that was, how could i be that stupid to don't think about that\", if you want to understand the show you need to be careful on dialog and what happing onscreen, that what Nasu want, to play with our minds \"For the people familiar with the original game, I want them to go \"What...?\" at the differences.\" \\n\\n\r\nIF YOU LIKE MYSTERY AND LOVED MONOGATARI AND MADOKA MAGICA YOU NEED TO WATCH THIS!\\n\\n\r\nStory 9/10\\n\\n\r\nSome things are still not clear and the episodes 2,3 are made \\n\r\nin hurry, but the story is very good!\\n\\n\r\nArt 10/10\\n\\n\r\nThe way shaft is careful with every detail is brilliant, and i love the animation and the way that is made\\n\\n\r\nSound 10/10\\n\\n\r\nThe sound in this show is awesome, the voices are awesome, and OP/END EARGASMMM\\n\\n\r\nCharacter 10/10\\n\\n\r\nI loved all the characters in this anime, Hakuno the transformation like in episode 1,2 was that guy that is bored all the time and don't give a fuck and after episode 3 he get personality,motivation and a purpose, like n the episode that pass caught up personality, the death face, his \"past\", AWESOME\\n\\n\r\nNero is just brilliant, UMU, i love the way that Shaft make his past\\n\\n\r\nRin/Rani their past was so fucking sad but so fucking good, and i love that shaft don't change Rin personality, like is the same Rin from Fate Stay Night\\n\\n\r\nAnd all the floor master, JUST BRILLIANT\\n\\n\r\nEnjoyment: For me this is a fucking masterpiece and i loved the show and i can't wait until July\\n\\n\r\nOverall: In my opinion, this is the best fate series, and the way that Nasu/Shaft is brilliant\\n\r\nI RECOMAND TO EVERYONE TO WATCH THIS SERIES AND DON'T LOOK THE SCORE ON MAL AND WATCH THIS MASTERPIECE!!!!!\\n\\n",
            "date": "2018-04-02T15:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 276572,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6055515.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Cotocea",
                "username": "Cotocea"
            },
            "url": "https://myanimelist.net/reviews.php?id=276572"
        },
        {
            "content": "The animation was okay at best, the plot was all over the place, scenes were shown out of order, the ending; while not as bad as Arcana Famigilia or Soul Eater, is a let down because while it doesn't piss you off the show just... ends. So why did I like it? Because it had Nero and Nero had umu. So I don't rate this a 7/10 I rate it am umu/10\r\nBreak it down a tad more:\r\nStory - all over the place\r\nArt - its no Ufotable but it does its job. Action is mediocre\r\nSound - I mean it works...\r\nCharacter - MC is an edgelord, Nerosaves this show\\n\r\nEnjoyment - Nero saves it with her umu powers\\n\r\nOverall - Umu",
            "date": "2018-05-18T14:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 280879,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6901158.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/meme_sheriff",
                "username": "meme_sheriff"
            },
            "url": "https://myanimelist.net/reviews.php?id=280879"
        },
        {
            "content": "When first hearing Fate/Extra would be adapted into an Anime, I was excited for one of my favourite PSP games to finally have an anime form, right on Apocrypha finishing it’s spotty airing.\r\n...right up until SHAFT reared its ugly head.\r\nRight from the start, you can tell this is a show made by SHAFT just by colours and composition alone, it almost feels as disjointed as a Wes Andersen movie without the humour as every introductory shot insists on bombarding the viewer with artsy stills and not getting to the point of the story. Failing that, SHAFT at least set up the story in the MoonCell; a supercomputer within the moon that mages' go to in attempts to win the Holy Grail using summoned historical and mythological figures, the typical fanfare of the Fate franchise, with the literal blank slate of a protagonist and incredibly oblivious Saber servant included! \\n\r\nI don't have anything against works made by SHAFT, but the studio itself for copy-pasting the same style of production onto everything they get their hands on, as well as retroactively touching up animation after airing for commercial release. After being disappointed with 3-gatsu no Lion, Arakawa and Mekakucity Actors, I have zero confidence in being able to like anything made by SHAFT that doesn’t involve Gen Urobuchi. Akiyuki Shinbou’s caustic style of filmmaking bleeds far too much into adaptations, so much so that TYPE-MOON may as well abandon the animated features to come after the cliffhanger ending of Last Encore left me with a foul taste.\\n\\n\r\nWhile I'm compelled to TL;DR this as a 3/10 burning trash fire that truly shows SHAFT being incapable of adapting anything that isn't Monogatari, seemingly oblivious to the fact that their stylistic choices and direction overall do not go with everything - and the studio can (and will) sabotage an anime by adapting it as poorly as possible to fit their image. \\n\\n\r\nNow, for the long wall of text that summarises my feelings in individual segments.\\n\\n\r\nAnimation: 3/10\\n\\n\r\nI almost wonder if shaft, with all their talented animators who can work wonders with over-the top sequences and scenes actually did this anime - not that the animation looks bad, but the opening is this mess of CGI environments that the singular Saber looks like a ragdoll in, hitting literally nothing but shadows with her sword - frames are skipped or missed out entirely in action sequences to make the motions look clunky and jittery, with shoddy post-production dust, light and smoke effects that do fights a disservice. Scenes of dialogue are atrociously bad, with still frames and cutaways occupying a majority of the screen-time while voices ramble on - gestures and motions made for only either displaced dramatic emphasis or memes. Shinji Matou doing the cliched shaft head-tilt in the middle of conversation is just jarring and honestly lazy, it feels like this studio keeps a template on animating this crap over and over, regurgitating any value that pose once had at the viewer.\\n\\n\r\nChoreography in scenes is jarring and strange, with settings being as inconsistent as they are colourful, and characters moving about well enough, but the transitions are always to some unknown - no consistency is established, much like the first episode of GATE, except all the way through. The main problem for this occurrence is that the setting is in distinctly different locales, each with their own visuals and aesthetic, and this type of scene transition only works with one part of the story thanks to the context of the setting. In everything else, there is zero cause to unnaturally alter the colour palette of the setting unless you're trying to instil a certain mood, yet nothing in the dialogue even indicates a change in tone, and no result comes of it.\\n\\n\r\nFight scenes last for such a short time, without any buildup to it in previous scenes, and entirely stupid moments where the brightness on-screen noticeably fluctuates between fine and so dark that the bright colour palettes become indistinguishable from the background, and the viewer barely sees these shots that would be cool if not for this ridiculous toying with contrast and white balance in scenes that are supposed to be tense. IN THE VERY FIRST SCENE, this happens for more than three seconds to the point where I had to squint to see what was going on because the editors made it intentionally hard to see - likely to prevent the flashes of bright reds and yellows from causing any seizures, but given the mature visuals and themes that occur occasionally, surely SHAFT can animate it properly, seeing as UFOtable made UBW with similar effects without compromising the viewer's ability to actually watch the show.\\n\\n\r\nStory and Characters: 2/10\\n\r\nThere isn’t enough character in the characters and the story is a mess, so one section for both!\\n\r\nI know Nasu was involved in the writing of this show, but his obsession with Fakes does this entire anime a disservice - while Shirou Emiya is at least a protagonist whose ideals are challenged as a blank slate, Hakuno Kishinami was always a bland-self insert for the player of the Fate/Extra games, though that's not to say the character had poor writing initially. Hakuno in the games is introspective, using an internal monologue as commentary while being involved in the plot. Hakuno in Last Encore has been twisted, warped into something that is not Hakuno at all, but a caricature of what the director and writer believe to be a good protagonist – disconnected, bland and redundant. A protagonist who is neither expressive or particularly interesting in Last Encore, and who never seems to have words of his own - which the writing STILL manages to screw up whenever he speaks, or anyone else does. The female version of the same character who has a speaking role in only one episode is more interesting by far, and she barely gets screentime between the exposition dumps.\\n\r\nEverything characters say is either half-assed exposition or incredibly dull dialogue that's supposed to retain my interest while the bright, flashy colours hold my attention, with no less than three tired bathhouse scenes where Nero goes into triads about herself or meaningless conversation, all the while naked or in something that reveals even more skin than her regular outfit – to the point where the show will concoct any excuse for Nero fanservice.\\n\r\nSaber, out of all the playable servants in Extra, is the least interesting despite being well-written, since Archer from Stay Night or even the other Extra original, Tamamo-no-Mae, could have been in with much better contribution to the plot than Nero. The show even references Tamamo and EMIYA in the first few episodes as a sticker and a crumbling tutorial boss-like jobber, much to rub the wasted potential of Last Encore in the faces of thee audience. \\n\\n\r\nSpeaking of Nero, whose identity really shouldn't be a secret at this point, she's the most interesting character by having the most to say - Sakura Tange voicing, Nero essentially speaks for a majority of the runtime. Between hearing her tall tales like some kind of overly-cheerful war veteran between every 'Umu!' was refreshing for the overall dull pacing of the show, and her explanations in short, concise remarks before promptly going back to the subject of herself was honestly refreshing - while grating, Tange's voice talent is good enough to put charm and character into her role, much like Jack the Ripper in Fate/Apocrypha. It's a shame since every other character is about as base as possible, with no real motivations laid out or actual character to speak of, even the protagonist who takes up to the very end of the anime to realise his own motivation before the series is left on an abrupt cliffhanger.\\n\\n\r\nThe main crux of the plot is that one-thousand years after an alternate ending to Fate/Extra, the digital environ within the Moon Cell, S.E.R.A.P.H, is now falling apart as it now has floors between each stage of the Holy Grail War, with floor masters mirroring the cast of the original game and servants the piece of cardboard known as Hakuno has to defeat to ascend to the next floor. Each floor is a different landscape shaped by the floor Master as they contain the last remnants of humans while earth has apparently been left as a barren wasteland, but we never hear of earth outside of one scene, so automatically the motivation of one character, Rin, is utterly removed to make her an atypical mentor character. To see characters whose stories were complex and gripping be reduced to two-episode arc villains upsets me, especially when their interactions are reduced to the same quality as bad fanfiction – the appearance of Robin Hood was excellent, seeing as he retained the same charm present in Fate/Grand Order and Extra thanks in part to Toriumi Kousuke.\\n\r\nAlongside that, new characters are inserted to service the plot for very little reason other than to earn my ire, as a pink haired character who screams ‘Determined Opportunist’ and whose name I’ve honestly forgotten appears several times to engage in meaningless conversation. Why not a different character, instead of a new one? Four characters from Extra are entirely missing, each of whom could fill that role instead, so why paste on a generic stand-in when the designs and characters are already there to use in the production of the show? It makes no sense to design an entirely new character who serves no purpose, let alone not use that character outside some vague exposition.\\n\\n\r\nOne of the most egregious things Last Encore does to patronize the viewer outside of stating the obvious or dumping exposition in moments of still shots and clunky transition is to pull things out of thin air to retroactively explain them later – like Dead Face, a weird rage mode for Hakuno made from pure edgy fanfiction, explained away five episodes after it first appears, with the power to apparently resurrect him from being fatally wounded at least three times in the entirety of the show without explanation. He’s stabbed, many, many times only to appear spotless an episode later, without a single problem from being impaled on several swords at once.\\n\r\nAll this time spent on just talking to explain away the shitty writing within the show does what shaft like to regurgitate best – retroactively explaining it away and expecting the viewer to nod their head in amazement at their “good writing”. It feels like the villains lose for no reason whatsoever and have zero sense to kill the protagonists while they’re incapacitated, and since it’s established repeatedly that Hakuno can just come back if he dies, the plot loses all tension whatsoever since the narrative is following the immortal cardboard cutout and his babbling fanservice girl.\\n\r\nAs much as this series likes to pretend it has any deep psychological elements, it falls flat when everything is explained to the viewer – no use of camera angles, tension, music or expression to convey the struggles of the protagonist going through an identity crisis, just a blank slate.\\n\\n\r\nFor a short series, I do understand the need to cut content. But if that was the case, why include so many scenes where nothing is accomplished or developed upon? It baffles me to think that so much time could be wasted turning parts of the story that could be covered in single episodes and drag it out to double the runtime. So much more could have been squeezed out of Last Encore if it wasn’t trying so hard to be a flashy art piece and convey a narrative that is coherent while having those same interesting themes tied into it instead of loosely covering it with a sheet of vacuous, surface-level dialogue. \\n\\n\r\nMusic and Art: 5/10\\n\\n\r\nWhile the writing, animation and composition ruin the show, the art style is actually pleasant enough to distract from the atrocity of writing that Last Encore is, where Wada Arco’s design actually make the series nice to look at when the animation isn’t being a let-down – the Nursery Rhythm episodes are by far the best for creating the strange atmosphere that suits shaft’s style, where colour and contrast are emphasized greatly. Nero standing out amongst the blue hues predominant in most of the background in episodes, the contrast turned up in scenes to make the characters really show. Which is a shame as the aforementioned turning down of the brightness occurs too just when the colours and artwork is a spectacle in action scenes, taking away from the value of Last Encore’s art direction.\\n\r\nThe music isn’t bad, however both the opening and ending themes feel incredibly disjointed from the animations themselves, especially the opening as a good song for an opening isn’t synced at all to the animation, highlighting just how poor the sound mixing was for these segments. In Last Encore overall, there isn’t any real problem with the music otherwise. The score matches the mood of the scenes very consistently, though the music itself sounds very much like stock fantasy RPG soundtrack, with very little techno influences despite being set in a virtual world – failing to set up any growing sense of tension throughout it – the music could have done with being remixed for certain scenes like transformations or episode 10 to incite a sense of wrongness, but the bell chimes used in Alice’s episodes instill a good balance of music that would accompany a traditional fairy tale and something being very, very wrong with the setting.\\n\\n\r\nEnjoyment and Overall: 3/10\\n\\n\r\nWhile the art and sound direction are redeeming qualities, the story, characters and direction alongside absolutely dogshit pacing where content is stretched out to fill runtime with irrelevant conversation, Last Encore does no justice at all to the game the adaptation comes from.\\n\r\nIf you want a solid story with the same setting, I would recommend the original game or it’s sequels, but not this at all. Shaft should not have been trusted with this adaptation, and simply ‘looking good’ by way of art style or animation is not a way to impress when the writing and characterization are so lacking.\\n\\n\r\nKinoko Nasu, the main writer of the original Fate/Stay Night and Extra, stated that he wanted this to be a starting point for those as their first “EXTRA” experience, for the audience to become familiar with the original game and other works from Last Encore, and vice versa, yet this only really succeeds at confusing viewers for the first time and annoying fan of the franchise with it’s inconsistencies. If you’re expecting this anime to give fans fanservice in the form of cool moments from Extra, don’t. If you’re unsure of where to start with the fate franchise, it’s not this. Last Encore is an awful adaptation, and many who are starting off are simply better off watching Apocrypha, which at least has more than one redeeming quality outside of the evidently higher production value.\\n",
            "date": "2018-04-12T12:38:00+00:00",
            "helpful_count": 6,
            "mal_id": 277870,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7142316.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/WaffleOverdose",
                "username": "WaffleOverdose"
            },
            "url": "https://myanimelist.net/reviews.php?id=277870"
        },
        {
            "content": "The Fate franchise being one of my favorites;Fate Extra LE was an anime I was excited to see ,but I should have learned my lesson from getting hype for Apocrypha in 2017 and not jump on the hypetrain. I felt like my reasons were justified for LE though as it was being animated by Shaft, one of my favorite studios and also had Nasu himself writing the script. Before I get into my reasons for not liking Extra LE, I will say that I never played the game Fate Extra or CCC, I`ve only played Extella so my understanding of the anime is not asgood as someone who has played the game it`s based on.\\n\\n\r\nOne of the main reasons I disliked LE is the format. Everyone is probably familiar with the format of the Holy Grail War  but LE has a strange take on it. Hakuno and Nero and sometimes Rin would get to a floor, fight the master that controls the floor than advance. If you ever read Tower of God it is kind of like Baam and co climbing the tower floors. In Tower though each floor is given enough chapters to form a well-paced story; in LE each floor was over in 2 episodes and you could forget about one floor as soon as they move on to the next. \\n\\n\r\nEven if it was the usual Grail War it wouldn`t have helped. The battles were all lackluster. Fights are a vital part of a Fate anime and I wasn`t expecting the fights to be as good as Zero and UBW but better than what we got from this. All the fights felt too short and none of them had that epic feel. Even Apocrypha for all its flaws had fights that felt epic. The biggest kick in the balls was Nero unleashing her Noble Phantasm. It lasted all of 30 seconds and the whole sequence was just her dashing over with a big slash. The main servants Noble Phantasm deserves more than this. The first time I saw Artoria use Excalibur in Zero was one of the most exciting parts of Zero; in LE Neros NP was just another forgettable moment.\\n\\n\\n\r\nThe story was the biggest problem. It was hard for me to summon any interest at times. Hakunos whole thing of trying to recall who he is and what his purpose is felt cliché. It was hard to care about the enemy masters and servants when you knew they would get beaten in 2 episodes. They felt like villain of the day type of characters to me, so why should I care? The only good part was the designs of some of the floors like the city floor and the Madoka Magica themed floor.\\n\\n\r\nThe characters also lacked  depth. Nero as the main servant should have good character interaction with Hakuno but most of their dialogue involved Hakuno being depressed and Nero encouraging him. Hakuno would have random moments of anger and put his serious face on and ramble about how much hate he has like Sasuke used to do. The most memorable of Nero and Hakunos scenes were the fanservice ones. I make no secret of liking ecchi/hentai as my list will show but from this anime I wanted interesting conversations like the ones Kirei and Gilgamesh had in Zero; instead we get an emo kid needing encouragement every step of the way.\\n\\n\r\nThe only things I really liked about LE was the animation and opening song. A boring story and bad use of characters really lowered the enjoyment of watching this every week. There`s supposed to be a continuation of this but I have no hope for it getting better. If you are new to Fate do not start with this shitshow under any means and even if you have watched Zero/UBW/2006 Fate I would not recommend wasting time on this.",
            "date": "2018-04-02T13:21:00+00:00",
            "helpful_count": 6,
            "mal_id": 276559,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6112143.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/VioleGrace107",
                "username": "VioleGrace107"
            },
            "url": "https://myanimelist.net/reviews.php?id=276559"
        },
        {
            "content": "It is somewhat troubling that a review has to begin like this, but let me adress the elephant in the room: This is not Fat/Extra, this is Fate/Monogatari.\r\nMany viewers seem to be turned off not only by the rather unattractive setting we've been given in the first 2-3 episodes, but especially by how little this feels like it is Fate, if one were to compare it to the popular anime adaptations by UFOtable that is.\r\nAs a fan of the franchise myself, I initially found it difficult to get into the series, mainly because of the initial shock of how different it was from the game,followed by whatever that plot during the second and third episodes was supposed to be ( was that a Tron reference?). However, as the show progresses, it shows more similarities to the original VN in terms of character interaction, which gives the show it's own value. Sadly,  it's standing within a franchise that is popular mainly for its battle royale element is suspect so far.\\n\\n\\n\r\nHere's what the show isn't:\\n\\n\r\nA Battle Royale\\n\\n\r\nA clash of ideals\\n\\n\r\nGritty\\n\\n\r\nMagical\\n\\n\\n\\n\\n\r\nSadly, it has to be said that Shaft has ditched most of the things that make Fate an appealing series, leaving not much for the general fan to enjoy, unless they had delved into the game before.\\n\\n\r\nWhat remains is character building through character interaction and conversation. Shaft are known for lengthy dialogue in their works since Akiyuki Shinbo joined. Luckily Type-Moon's VN's are kind of known for that as well. Last Encore stays true to this, especially in the two recent episodes as of the writing of this review.\\n\\n\r\nSpin-offs and sequels that break with the style of the original series too much tend to have a rough time entertaining the existing fanbase and meeting the expectations of newcomers. Last Encore is no exception to this, though I have to say that the show is still very enjoyable if it is judged by its own merits. It still retains a cast of interesting characers, both in terms of personality and waifu/husbando material. For veterans it holds a new outlook on the grail wars within the mooncell and is certainly a worthy \"sequel\" of sorts to the original trilogy of Extra, given its narrative references to the game. Sadly it falls completely on its ass when it comes to the fight scenes. I've often heard the unjust criticism of shaft not being able to do action, but this time I will have to agree. Not looking at this show from the angle of it being supposedly action made it a lot more ameable for me.\\n\\n\\n\\n\r\nOverall, the show has lots to offer for those who are willing to take it as something other than a battle royale and are versed in the original game. For newcomers to the franchise or even just to the world of the Extra series, this series is most likely a complete miss.",
            "date": "2018-03-11T16:11:00+00:00",
            "helpful_count": 6,
            "mal_id": 273599,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4726606.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/addioo12",
                "username": "addioo12"
            },
            "url": "https://myanimelist.net/reviews.php?id=273599"
        },
        {
            "content": "Fate/Extra is one of the many Fate series, as I would recommend anyone watching Fate for the first time to watch Fate/Zero and Fate/stay night first, before watching this series, to know more about the lore and characters in Fate.\r\nThis review is based on the first 5 episodes of the anime.\r\nStory: 6/10\r\nFate/Extra starts of in a futuristic looking world, where you're introduced to the main character and learn something about the kind of holy grail war taking place in this world. The story starts of very vague and gives you more questions than answers to the many things going in this series. In the nextfew episodes a few things are explained, although it still remains pretty vague overall. However, the amount of unanswered questions can make you more interested in watching more of the story, so it isn't necessarily bad (in the first few episodes).\\n\\n\r\nArt and sound: 7/10\\n\r\nThe art and sound in the anime are pretty good, and the animation is consistent as well. \\n\\n\r\nCharacter: 6/10\\n\r\nAs of episode 5 the main character Hakuno Kishinami hasn't really shown any character development and is a pretty bland character. Saber has a pretty bland character as well, because she is just full of energy, willing to fight any opponent, so I hope they will develop these two characters more in the series. The supporting characters originating from Fate/stay night have pretty much the same personalities as they had, which are shown pretty decent here. Overall the characters are pretty decent, but there is still a lot of room for character development, as they haven't shown anything out of the ordinary yet.\\n\\n\r\nEnjoyment: 7/10\\n\r\nFate/Extra has a lot of unanswered questions, urging me to watch more of it and has a pretty interesting premise, but the story and characters have a lot of room for improvement, putting my enjoyment at a 7/10 for now.\\n\\n\r\nOverall: 7/10 (6,6/10)\\n\r\nAs of episode 5 Fate/Extra is pretty good, it has an interesting premise and urges to watch more, because of the many unanswered questions, but has room for a lot of improvement as well. I would recommend fans of the Fate series, who are interested in a setting outside of the main story of Fate to watch this series and I would recommend newcomers to the Fate series to watch Fate/Zero and Fate/stay night first, before watching this anime.",
            "date": "2018-03-04T09:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 273003,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6934386.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DtDaniel",
                "username": "DtDaniel"
            },
            "url": "https://myanimelist.net/reviews.php?id=273003"
        },
        {
            "content": "This review contains spoilers.\r\nIn my opinion, Fate/Extra is a massive mistake by Shaft. At the same time that the studio is adventuring into strange waters by adapting a TYPE-MOON title, they`re diverting too much from their usual adaptations when they decide to go for a linear-focused narrative. Fate/Extra being adapted by this manner, in my opinion, is a recipe for disaster.\r\nIn Fate/Extra, differently from other Shaft titles, there`s a linear narrative that has to be told by clear, objective and focused means. Fate`s world is rich in important details that NEED to be stated in a clear form for the universe to make sense. Shaftbuilds up a headless, footless monster when they decide to use the stylized approach that became famous in the non-linear -monogatari titles to be the vanguard of the series. This stylized approach, in Fate/Extra, becomes more important than the narrative itself. This becomes a serious problem for the linearity of the script because it leaves the spectator lost in the timeline and in the sense of the universe. Each episode starts and ends in a completely different manner than the previous – a basic continuity mistake that is TOO basic for an acclaimed studio as Shaft. I had to check the number of the episode while I watched to confirm if I wasn`t jumping over any of them by mistake.\\n\\n\r\nThe first episode of Fate/Extra is so badly-scripted that I thought I had been watching the second episode by mistake. It raises more questions than answers. Builds up an universe but doesn`t explains it. It completely ruins the suspension of disbelief. It`s in my list as one of the worst title debuts ever produced.\\n\\n\r\nFate/Extra is VERY objective when it only shows Saber/Nero in a 1-minute-25-second-action Opening. It tells us Nero is the marketing point, and she really is. Not only that, but Nero is the ONLY character with a backstory built-up that is concrete enough to be developed upon. The unforgivable mistake is, perhaps, the worst contradiction of the series – focusing the screentime on amorphous, monotonous, shapeless blobs that pretend to be characters -instead of in the actually interesting character that is Nero.\\n\r\nJust like other TYPE-MOON titles adapted to animation, the main character is once more an insertion mass for the spectator. Kishinami Hakuno is an extremely bad-built and bad-developed character, with the unique and essential function to react to the mishaps in the narrative while pretending to be you. Even after all this, he still fails to deliver while having, on average, two dialogues per episode and, on average, the most screentime of all characters. Hakuno`s backstory is badly-written, confusing and has many non-capped holes to be relevant. His personality has no taste and his motivations are empty. When animation studios adapt TYPE-MOON main characters, they seem to write it down while taking a massive poo dump.\\n\\n\r\nThis doesn`t get better if we compare Hakuno to the supporting characters. They are merely touched by the narrative, with no intention of development. Shinji, Rin, Rani – they`re all characters with no development potential that are used solely as story-progression tools. They`re used, then get discarded. When the narrative freezes, there they are to unfreeze it. Then they get discarded again.\\n\\n\r\nWhat really irritates me when the topic is Shaft is the absurd quantity of unneeded, uninteresting, confusing and evasive dialogue. This is not only a problem of Fate/Extra itself, but of a lot of other Shaft-adapted titles: the characters say words, but they`re not speaking anything. These types of pretentious dialogues make the characters look like college philosophers – they only serve as hole-fillers to extend the lifespan of the episodes. Fate/Extra, with its humble 10 episodes, shoots its own foot when it adds these redundant dialogues. The script jumps over a whole floor because of the limited screentime – it`s a tragedy.\\n\\n\r\nOne of my problems with Fate/Extra is the monotony in the adaptation. The script is essentially descriptive. The series doesn`t want to surprise you, or to make you feel with the characters, or even create a bond between you and the story. The only function of the narrative is to communicate the facts in the most tasteless, abrupt form possible. When only one of the characters is in the scene, it seems as like all the other characters are frozen in time, only to not ask anything about what happened when they were not in scene. This kind of wearisome approach was principally noticed in the final scenes of the series, when Hakuno makes the `hard` choice between Rin and Rani. A potential climax was being built only for the decision to be communicated in the most abrupt and monotone way. It let me down immensely.\\n\\n\r\nI won`t even comment how much of a let down the ending was.\\n\\n\r\nIn Fate/Extra`s case, it really seems like the Opening is the cover of a book. We can`t really judge the book by its cover. The animation budget was probably completely wasted in the opening, because we don`t really see much of good battle scenes like we do in the Opening Song. Animation is mediocre, it really seemed stiff at times. Art direction is also not one of the best – the characters design chosen doesn`t really go well with the narrative in my opinion.\\n\\n\r\nFate/Extra is a title to avoid. Much of the promises are not delivered and the script is very confusing and full of holes. This makes the series really frustrating to watch for the spectator. I hope the continuation can, at minimum, bring this ship back to the surface.\\n",
            "date": "2018-04-23T20:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 278840,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3529443.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/hunternoobx",
                "username": "hunternoobx"
            },
            "url": "https://myanimelist.net/reviews.php?id=278840"
        },
        {
            "content": "If an anime gets you to think, really cares about the character and ask questions, this is the one. There are so many questions in the show, why the earth is corrupted; why the holy grail system is built; instead of getting burnt, why dead body sort of like...disappeared in the incinerator; who is the glasses nerd; why is Rin disappeared... After a few episodes, I am sure if you really pay attention to every detail in the show, you will have so many questions and you really want to watch the next one. And maybe you will ask yourself this: if you not sureabout something, and you know this will harm everyone's interest, will you still accomplish it? My girlfriend answered this question without hesitating LOL she said: if I have you, I don't give a damn.",
            "date": "2018-02-24T07:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 272326,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/2011xavior",
                "username": "2011xavior"
            },
            "url": "https://myanimelist.net/reviews.php?id=272326"
        },
        {
            "content": "Liked by some, hated by some, and seen as average by many, fate/extra is somewhat of the opinion divider. This is the first fate adaption by shaft, and considering the reception of this it is probably the last one.\r\nThis review covers both this and the 3 ep ova sequel. A few spoilers in the review below, turn away if you want to go in 100% blind.\r\nThe protagonist, hakuno, where he is friends with shinji and meets other fate series characters, while the peace doesn't last long as we see the move towards the beginning of the ?th holy grail war, and hakuno is backstabbed bythe mentioned friend\\n\\n\r\nWhile we see old fate characters their roles are limited compared to what you might expect, and towards the end of the show the real roles and reasons for the characters existences are revealed\\n\\n\r\nA lot of these things mentions are only part of the first few eps. Which is the main downside of this show. Things are happening but why they actually happen is not fully revealed at the time they are relevant.\\n\\n\r\nRin and Rani, their existence isn't fully explained until ep 10. Before then the show barely explains there presence at all.\\n\\n\r\nNow on the bright side the artwork is stunning, probably not quite up there with the ufo produced fate but it goes it's own way and defines it's style on it's own, at least fate-wise. A bit more fanservice is present than the other fate series, which depending on your preferences may be a plus or a minus.\\n\\n\r\nThis show continues the trend of fate characters having differing reasonings for fighting, and we see hakuno be not quite the the strong mc, but unlike other bland male mcs, he lacks a lot of the annoying quirks, there is no harems or social awkwardness here and instead his motivation is based on his lack of understanding of his existence.\\n\\n\r\nTo wrap this up, while this isn't a masterpiece or anything like that it's worth a watch if you enjoy the fate series and don't mind a different take on it. If you go in expecting fate ubw or zero it's probably not going to fully hold up, but it's still fun and entertaining in it's own way.",
            "date": "2018-09-02T01:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 287938,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6836774.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Aboar",
                "username": "Aboar"
            },
            "url": "https://myanimelist.net/reviews.php?id=287938"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nIt's worse than Fate/Apoc if you can believe that, which is considered the worst Fate adaptation.\r\nThe Main character of Last Encore, Hakuno, is like Sieg 2.0 (Sieg is from Fate/Apocropha). At least in Apoc they had more episodes and several servants to take focus away from Sieg but in Last Encore, all we ever do is focus on Hakuno and he's not even interesting DESPITE certain revelations about him and his edgelord powers.\r\nSome would argue that Hakuno + Saber (Nero) is more interesting than Sieg + Jeanne, which is only half true considering Sieg and Hakuno has the similar personalities and Nerois more energetic than Jeanne but people often forget that in Fate/Apoc, it's not a duo but a trio of characters. Sieg + Jeanne + Astolfo and Astolfo easily makes up in personality for both Sieg and Jeanne.\\n\\n\r\nAction scenes are worse overall compared to other Fate animes and due to its 10 episodes (+ 2 more later) there's tons of info dumping every episode for a convoluted story that so far up its butt that it makes Fate/Apoc look like Shakespeare.\\n\\n\r\nThe story is flat-out confusing as heck. It has too much exposition and dialogue without explaining much, and despite Nasu's intention (and statement) of making the story friendly to newcomers to the Fate/Extra series. Even those who have played the Fate/Extra games and know its lore are confused.\\n\\n\r\nI definitely recommend passing over this.",
            "date": "2018-08-09T13:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 286024,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6574305.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nuka-Raider",
                "username": "Nuka-Raider"
            },
            "url": "https://myanimelist.net/reviews.php?id=286024"
        },
        {
            "content": "I should preface my review by saying that I really love Shaft's animation style, and that my review might look jilted at the high art rating compared to the average overall rating.\r\nFate/Extra is very... \"Fate\" in its execution. It focuses very much on the \"MC has a big secret we need to learn\" that most other series' have, while also likening their journey of self-discovery to the mysteries of each Servant they encounter. That being said, right off the bat I can tell you it was much more enjoyable than Fate/Apocraphya. The battles might not have as grand of spectacle, but the artstyle and lackof bass drops make up for that completely. While the fights aren't really able to top Fate/Zero or UBW, it seems like they were less of a focus when compared to the mystery of the Grand Holy Grail War that's currently stagnating.\\n\\n\r\nTwo main issues prevent this from being a 7 or an 8.\\n\\n\r\n1. The amount of episodes were short to the detriment of the show. I often hate it when shows drag out too long, as it usually results in either poorly constructed arcs or random filler within episodes. This show has the opposite problem. Where I was fully invested in the story (reflected in the score of a 7), unfortunately my enjoyment suffered due to a confusing narrative as a result of poor episode structure. It jumped around more than S2 of Westworld in timelines, but it wasn't always clear as to what was going on. This really drug the show down in episodes like 6 and 7 where the artstyle is absolutely unique, but the storytelling is so confusing I was getting narrative whiplash. The climax reflects this as well, as the \"end\" of this season is going to be a two hour movie, leaving the series feeling only 2/3 finished. They should have made this a 12-14 episode season and it would have fixed plenty of these odd narrative problems.\\n\\n\r\n2. So while some of the narrative whiplash resulted in not having enough space for each episode, the rest resulted from a poor choice of presentation to reflect the time skips. I had trouble telling when I was in the present, the past, or the future, and afterwards I'm still not sure. I'm fine if they reveal it at the end what was going on, but often these waters are still left muddy. This leaked into an odd presentation of floors too. As the MC tries to ascend floors, he essentially only has one enemy each time. The issue with this, is it's counterproductive to traditional fate where masters will ally and betray each other with a certain finesse to ensure their survival of the Holy Grail battle. The structure feels even more \"VN-like\" than usual, as if I can see the sections of the game passing me by.\\n\\n\r\nOverall, I think the review for the movie will be closer to my \"final review\" as I almost feel like I'm writing for an unfinished series. The animations were choice, the colors were nice, the sound was decent, but the character and story suffered due to poor storytelling and pacing. This still manages to hop above Apochraphya, as the characters weren't abysmal (I found myself invested in the 3rd floor and 2nd floor stories quite a bit) and I really got a sense for the motivations they had for their want of the grail. It's worth a watch if you're a Fate fan, but it's probably not the series you should start with.",
            "date": "2018-07-28T15:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 285012,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6874523.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AmericanSomnium",
                "username": "AmericanSomnium"
            },
            "url": "https://myanimelist.net/reviews.php?id=285012"
        },
        {
            "content": "I really enjoy Shaft animation, the Monogatari series in particular being my favorite anime series\r\nI really enjoy the Fate series, having seen most of the main animated material and Zero being one of the first anime I ever watched.\r\nSo why don’t I like Fate/Extra: Last Encore, a Fate installment animated by Shaft?\r\nIn all fairness, many of the elements that make up smaller portions of the story work or present themselves perfectly adequately. Shaft animation might often appear in a trademark stylized way, but since the animation was fluid and reasonably detailed it certainly gains a pass. \r\nSome of the scenery shots and images from thefinal episode very well make their way into wallpaper-worthy territory. Music, whether background, battle, or theme song, aren’t particularly stand out, but music is at least doing its job if it stays supporting the action and not interrupting it.\\n\\n\r\nCharacters have always formed the major backbone of the series, since all of events and themes revolve around the actions of key characters. Fate/Extra Last Encore falls more in line with past Fate installments rather than branching out into some of the wider Nasuverse characters. \\n\\n\r\nThe main character falls somewhat into the generic high school age MC with burgeoning intriguing characteristics, but lacks the originality of Shirou in Stay Night or the more mature takes on heroism seen in Fate/Zero. Tohsaka Rin makes an appearance and remains in the character expected from her earlier appearances in Fate anime. The other more minor characters come and go on an almost episode-level basis and barely do more than act as obstacles and opponents for the main character and his servant. \\n\\n\r\nAnd the main servant, the Arturia Saber lookalike from the media, commercials, games, art, and ruiner of trying to learn anything about the Roman Empire, Red Saber Emperor of Roses. Saber Nero Claudius.... Why Fate has an obsession with genderbending is still unknown. She certainly adds an upbeat, optimistic outlook to the usually downcast Fate series, but the reception would vary viewer to viewer.\\n\\n\r\nThe largest sticking point for the series comes from the plot. The Fate series has always used the Holy Grail as its principle McGuffin, and while that is present in Fate/Extra, it doesn’t appear to be the focus of the main characters. Instead the plot wanders, passing through different and mostly unconnected stages. \\n\\n\r\nEach stage wanted to discuss different ideas or the traits of the cast, but seemed to devote too little time while trying to balance action with dialog, and the series ended up not allowing for enough of either. Episode 7 stands out as something I personally rewatched multiple times and still failed to comprehend the reason for it and the point it was trying to make.\\n\\n\r\nSome of the actions and abilities of the cast also seemed to be skated over due to a lack of time to explain their existence, but only poked further plot holes or raised more questions. Many lines of dialog seemed to try to explain what the reason for these abilities was, but became unnecessarily philosophical and lacking in focus to the point that it was more confusing than simply accepting \"magic\" as the explanation. \\n\\n\r\nFate/Extra: Last Encore falls as the weakest entry to the Fate series in the animated universe. The characters were functional, but failed to distinguish themselves, the technical aspects worked fine to well, but the plot left so much to be desired that the series as a whole is hard to recommend. Perhaps supplemental material helps Fate\\Extra make more sense, but until then it seems fine to skip this entry in favor of Zero or Unlimited Blade Works.\\n",
            "date": "2018-04-17T20:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 278353,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3655051.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Calcature",
                "username": "Calcature"
            },
            "url": "https://myanimelist.net/reviews.php?id=278353"
        }
    ],
    [
        {
            "content": "Oh boy, Fate/Extra: Last Encore. I should say, right off the bat, that while I am a fan of the Fate universe, I am not a fan of some of their more recent adaptations. (I’m looking at you, Fate/Apocrypha) As a series that’s over the top like Fate/Extra Last Encore, it felt like a chance for me to take a wild ride, turn my brains off, and try to enjoy this for what it is. How did I feel at the end? Well, let’s just say that I want my time back if I had a holy grail.\r\nWhen Shaft was announced as the studio forproduction, I immediately raised an eyebrow and found myself wondering if this could ever work. As an anime adaptation of Fate/Extra, this became a plot that’s modified for the sake of anime storytelling. It sells its story similar to some of the other Fate franchise’s series if you’re familiar with the franchise. Jumping into this show was not easy for me despite my familiarity with the Fate universe.\\n\\n\r\nSo I decided to give this a shot anyway. Why not? It has an alluring premise and takes place in an alternate timeline to Fate/stay night. In this timeline, mana have disappeared and Wizards are forced to use virtual space for magic. Similar to some of the other Fate series, a Holy Grail War is set up by a computer that pits 128 Masters in a tournament. The winner will be chosen with a wish to be granted by the Moon Cell Automaton, a mysterious computer of unimaginative powers. Main male protagonist Makuno Kishinami gets caught up into this battle for survival and is clueless on why he is involved. Luckily for him, he gets a servant called Saber. (do note for the sake of avoiding spoilers, I’ll just refer her as “Red Saber” from now on)\\n\\n\r\nYes, this formula is definitely not something new despite some differences with the world setting and premise. What bugs me though is how the main plot is executed with Hakuno and Red Saber as the main characters. Don’t me wrong. They are highly entertaining to watch at first but after a while, you may wonder if it’s worth investing time into them at all. In particular, Hakuno is a very oddball character and seems to be only motivated to survive and avenge the deaths of others. In a way, the guy can be viewed as an anti-hero. My impression of Hakuno gradually faded more and more after seeing his development. In essence, he doesn’t develop much at all and his personality feels all over the place. It doesn’t help that Red Saber is incredibly one dimensional and behaves like a child. While she can be addictively cute to watch at times, Red Saber is hardly a character I would declare as well-written. We don’t know much about her and it’s hard to judge what her motivations are in the story. So yeah, watch this for the mindless character chemistry but if you’re watching for concrete characterization, look elsewhere.\\n\\n\r\nIf you’re hoping some of your favorite Fate character to show up in this series, then prepare for disappointment. Only a small handful of characters like Rin, Sakura, and Shinji appear and most of their roles are downplayed to get over the main cast. Some of the characters from Fate/Grand Order game also shows up although their roles are so small that you’ll likely forget them incredibly easily. Most of the minor characters have their roles minimized and episodes’ resolutions feel rushed. Oh and Shinji….what a bastard. I wish the series deleted him and never gave him a chance to show up for his abominable personality. But the series’ main story is not abominable. It’s actually much worse. For the majority of viewers, you’ll probably scratch your head on what the hell is going on. I know I did and feel like the series tries to do way too many things at once. Now, I know Shaft is known for their style to present this anime like a theatric thriller with avant garde cinematography. But wow, this show easily fell apart in the beginning and didn’t manage to salvage itself at all. With just 10 episodes, it became more of mindless popcorn entertainment than a creative story to tell.\\n\\n\r\nI mentioned Shaft few times already but I’ll do it again. The studio’s ideas can easily be recognized by their artistic choreography and avant garde artwork. Running gags with violence and head tilts are also pretty easy to spot. The biggest culprit here is Hakuno as he gets his limbs tore apart, body impaled, and put into a position where he can easily die. Somehow, he survives and we see his reaction in a dark grimy way. I think Shaft wanted us to experience what they do best at and honestly, I think they went a bit overboard this time. The shock value in this anime feels impactful but serves little purpose besides amplifying Hakuno’s personality up to the 11. Oh and the fan service. It seems this show wants to milk Red Saber as an eye candy ever chance it gets. The camera always flirts with her by showing lewd body parts, poses, and try to make her as sexy as possible. Bath scenes occur several times in the show and Red Saber never seems to be uncomfortable being nude. It’s pretty shameless and easily distracting to the point where viewers may talk more about the fan service than the story. On the other hand, I think the battle cinematics is nicely made. It’s fast paced and captures an alluring style of fighting. While glorifying servants’ abilities to fight, it also doesn’t make us forget how badass Hakuno can be. Finally, I have to point out that both the OP and ED theme songs are quite attractive once you get used to the style. The charismatic movements of Red Saber is exceptional there. \\n\\n\r\nAfter watching Fate/Extra Last Encore, I have to wonder what the hell the producers were thinking. Were they trying to make a show to get us viewers into liking the characters and story? Or was this another attempt for cash grab so fans can pour their money into their franchise. Either way, this show ended up being a disappointment for me. I can’t recall how many times I scratched my head. Oh and Red Saber's voice...she sounds like a kid stuck in an adult’s body with that infamous UMU. What a shame for a show that could have been something so much more.",
            "date": "2018-03-31T11:17:00+00:00",
            "helpful_count": 154,
            "mal_id": 275898,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=275898"
        },
        {
            "content": "When it comes to what makes the Fate franchise what it is, some will might say it's the very well-made fight scenes while others will say it's the dark psychological tone that it has. While all of that is definitely true, what really makes the Fate franchise what it is; it's the interesting philosophical dialogues between the characters and that is really, what Fate/Extra Last Encore succeeded at most.\r\nFate/Extra Last Encore is a studio Shaft's adaption from a game and it serves as an alternative setting to Fate/Stay Night's. The concept of the story is pretty much the same as you can imagine, there arechosen masters that summon a servant each, each servant and master are fighting together to be on top and get a wish granted. The big difference is that it's happening in a tournament in the far future, year 3020 where not a lot of humans are alive. It's hard to get any deeper than that in the story because otherwise, it will be a spoiler. I also don't think you came to check this anime out thinking it will be very different than the original series story anyway. What is very different is that compared to Ufotable's adaptions of the Fate franchise, Fate/Extra focus more on the philosophical dialogues and less on the flashy fight scenes but it has those as well. As I mentioned before a lot of twists will be discoverable later in the story but I will not mention them to not spoil, just so you know that there are a lot of other interesting differences. The downside of the story category is that it doesn't explain the settings really well.\\n\\n\r\nThe characters are easily the most interesting part here. There is the protagonist, Hakuno who seems a bit uninteresting at the start but don't worry they made sure he will be interesting, there is a lot of focus on \"who he is?\" which make the character a lot more interesting as the story goes on. For the face of the series, it's obviously the Saber \"UMU\" Nero, she will get a lot of focus, even more than you imagine which is a good thing in my opinion since she is probably the most fun character to watch (Red Saber>Original Saber, fight me). Rin also gets a lot of shine here, she is more badass than the usual herself. Besides that, there are the other servants and masters, I will assure you that they all have an interesting unique design so you might enjoy watching them.\\n\\n\r\nWell for the art it's really a matter of opinion, those who are familiar with Shaft's works like the Monogatari series and such will welcome the art easily and would even find it great and suiting, others might despise it, as it doesn't look like ufotable's art and flashy animation. I personally belong to the group who are familiar with Shaft's works and finding the art great even though ufotable is my favorite all-time studio. The one thing that most fans will most likely won’t admire shaft for, is the different character designs for the characters that aren't new to Fate like Rin, Sakura, and Shinji. Overall, the art and animation style is a plus for me as I think it's really suited for the psychological and mystery tones of Fate/Extra.\\n\\n\r\nFor the music part of the series, the opening (\"Bright Burning Shout\" by Takanori Nishikawa) is amazing, it's rocky and catchy, really suiting for this series, it took my favorite opening spot this season (Winter 2018). Visually it only shows Nero fighting with different hairstyles, take that however you want. (Fun fact: It's the first time that a male sings the opening song for a fate series). For the ending (\"Tsuki to Hanataba\" by Sayuri), I think it's quite suited, don't sure if I love the song but I do like it, what I love is the visuals, they are showing the connection between Hakuno and Saber while also showing the Master and servant they are currently fighting, I really liked that. For the voice acting there is, of course, the umu so enjoy it. The ost has all kinds of tracks from futuristic to emotional, nothing crazy but I think it's very suited.\\n\\n\r\nSummary:\\n\\n\r\nPros:\\n\r\n- Characters are fun to watch.\\n\r\n- Interesting philosophical dialogues.\\n\r\n- Great and catchy opening.\\n\r\n- Suited animation style. (Makes the dialogues more psychologically interesting)\\n\\n\r\nCons:\\n\r\n- The art style might look weird to some.\\n\r\n- The story isn't explained so it'd be easy to understand.\\n\\n\r\nFate/Extra Last Encore isn't for everyone, that's for sure and that's why I wouldn't recommend it if you aren't a huge Fate fan. Because if you have only watched Fate/Zero and Fate/Stay Night [Unlimited Blade Works] then you have nothing to do with this series, you wouldn't enjoy it. However, if you are a huge Fate fan who have read the original visual novel, watched all the anime adaptions or of course, if you played the game then watch it, it was made for you.",
            "date": "2018-03-31T11:11:00+00:00",
            "helpful_count": 113,
            "mal_id": 275897,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2659237.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MrMushin",
                "username": "MrMushin"
            },
            "url": "https://myanimelist.net/reviews.php?id=275897"
        },
        {
            "content": "“I am not a fake, I will forge my own identity” \r\nThere is a saying that goes between the Ufotable Fate series purists, that “Any Fate not made by Ufotable is shit” and that statement was usually right from what I've seen, Fate Loli was as mentioned all about Lolis, Fate Apocrypha was a laughable joke to most and then we have this anime, Fate Extra Last Encore that was made this time by Shaft. The Fate series is popular enough to be adopted by almost every studio and this brings either positive or negative results, and fortunately unlike other non-Ufotable Fate anime series, FateExtra did not disappoint as much. Why? It had a main character even better than Emiya Shirou. And that's saying something.\\n\\n\r\nBased off the game of the same name, Fate Extra introduces us to a character named Kishinami Hakuno who is betrayed by his friend Shinji (oh Shinji you are there every time) but escapes death and is chosen to participate in the Holy Grail war, not before getting the most powerful servant of them all, Saber (yada yada same introduction as all other Fates) but this time Saber isn't an elegant King of Knights, oh no, this new Saber is a busty mainly-for-fanservice character whose sole purpose isn't just to attract horny teenagers to get a Saber Figure but this Saber also plays an important part and thankfully unlike Unlimited Blade Works, her backstory is given a proper explanation in a later episode, further fleshing her out as a character (no pun intended).\\n\\n\r\nEven though we had 10 episodes we didn't see much action, it was mainly build-up, discussion, backstory and meetings. This Fate wasn't the action Fate, if you want that go to UBW, this Fate’s focus was more in world building and character introductions like Rani who play an important part in the Fate Universe (although she plays a small part in this anime). One of the things I didn't like much about this anime was that mostly adopted a 'villain of the week’ Shounen trope and to be honest it didn't bring as much development as I had hoped, although it’s portrayal was better than many Shounen anime out there it still felt somewhat lacking, either due to my dissatisfaction with the trope or because it wasn't done well. On the other hand the plot progressed smoothly, thankfully the episode number was increased from 6 to 10 mid-season this meant we got much more development especially for our main character Kishinami Hakuno. \\n\\n\r\nMany times (or actually every time) it is the male main character who defines an anime for what it is, Emiya Shirou defined the storyline for Fate UBW, Kiritsugu defined Fate Zero, much in the same way, Hakuno defined Fate Extra. Although he had little to no personality in episode 1 (please note that he was still better in character than Shirou, at least to me) the focus and improvement noticed in the second half is what made me increase my score from a good 7 to a great 9, Extra just felt that good that it felt equal to UBW and to a lesser extent with Zero (Fate Zero is best Fate, fight me :P). As for the other characters Saber was quite the focus as well even though her relationship with Hakuno felt more like Saber was teaching Hakuno everything instead of them both working together equally (although I must say that also changes later on) but the important fact here is that Nero got her backstory while Arturia didn't. Or at least it was much more explored. So overall for the main characters development was excellent and elegantly done.\\n\\n\r\nNow where does that leave the side characters? Unfortunately they didn't get enough screen time or development. Tohsaka came at convenient times and although her fight with Berserker and another friend-turned-enemy (I'm not spoiling it, watch and understand) was amazing she had little or nothing to do with the plot progression which is unfortunate since she could have done much better given the chance. Other than that I could only find Rani a recurring character that too only because she came for 2-3 episodes and not 1-2 for the villains and she didn't get development at all. Her story as well was very brief and felt like an afterthought. As for the other characters we have the villains, only some of which got development and the cameos by Shinji and Kotomine Kirei in the first episode. Pretty disappointing for the side characters but amazing for the main ones.\\n\\n\r\nDisappointing and amazing reminds me of the confusing yet amazing yet somewhat disappointing art style of the anime. Animated by Shaft (you know, those Monogatari people?) I made a huge mistake by expecting Ufotable-like art style and instead got an animation below average. It felt horrible at first and I couldn't get used to it at all in the first episode. Fortunately the staff themself might have realised and fixed most of the issues and after episode 3 or so the art improved considerably, especially so in the Dream Land. The Dream Land arc was my favorite since it was so dark and intriguing not to mention mysterious, the Dream Land arc might as well be the only reason Fate Extra is so amazing. If the main characters don't impress you, there's a high chance the Dream Land arc will, so I won't gloss over it much and move on. Something you should gloss over is the soundtrack, because that is amazing and my favorite part about Fate Extra apart from the main characters.\\n\\n\r\nAs a nod to UBW, the OP started off a lot like Brave Shine and the song itself was just as amazing not to mention the visuals used. Meanwhile something I found much better was the ED sung by none other than Sayuri who sung Tsuki to Hanataba and all you need to do is to go on YouTube, search this song and listen for yourself the amazing power of Sayuri’s voice, if you haven't already heard Sora wa Sore wa Chiisana Hikari no Youna from Boku dake ga Inai Machi (ERASED) and fallen in love with her voice. On the other hand the background music used was unsurprisingly excellent, why unsurprisingly? If you've watched the Monogatari series you'll realise. \\n\\n\r\nAll in all Fate Extra is an anime that although falls short of beating Fate Zero it does pretty much equal UBW in many aspects which says a lot about it's quality since most other Fate anime made by non-Ufotable studios were either flawed or garbage (very rarely did we see a good non-Ufotable Fate) but Fate Extra has its shortcomings and they measure up on the scale as well. Although this was a show I enjoyed a lot, I can't ignore it's flaws as well, side characters, art style and villains were problems Shaft couldn't fix for the anime and so I felt disappointed to a certain extent but also was amazed too since this quite literally is the best non-Ufotable Fate we have (apologies for repeating non-Ufotable so many times) so we can move forward. What will the next Fate be? Will it be better than UBW (arguably the most popular Fate)? Will it surpass Fate Zero in quality? These are questions only the future can answer so all we can do is wait and see what happens. As for now, enjoy this beautiful anime.\\n\\n\r\nOverall Rating: 7.2\\n\\n\r\nP.S: Hakuno x Hakuno (you won't get it unless you watch it so don't worry :P)",
            "date": "2018-04-01T23:28:00+00:00",
            "helpful_count": 43,
            "mal_id": 276473,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=276473"
        },
        {
            "content": "The theatre \r\nThe murmuring of the audience revibrates off the walls of the auditorium. It's opening night. Many are anticipating the performance because it's a branch story of a famous franchise. Others are skeptical and don't believe that it will be able to hold up against it's predecessors. Soon the lights dim and the audience silences as the curtain opens, revealing the stage. As the actors put on their performance, many watching become immediately confused with the story and find themselves unable to connect with the protagonist. Though the crowd is losing interest, there's suddenly a change in dynamic. For the heroine finally steps outonto the stage, her blonde hair and red attire immediately captivating all who gaze upon her. The crowd roars and vigorously applauds, for the theatrical woman was the primary reason why many attended the show to begin with. But would this stunning lady be enough to cement the performance as something truly spectacular?\\n\\n\r\nFor the majority of viewers, apparently not. But the beautiful heroine known to many as simply \"Saber\" isn't the only positive aspect of the show. If viewers were to simply dig a little deeper, they might discover that there's more to the show than meets the eye.\\n\\n\r\nFate/Extra is yet another installation in the popular Fate franchise. Being a fan of the series, I went into this anime with some expectations, especially considering the fact that Studio Shaft, the one who took on this project, is one of my favorite anime studios. Now I've never played the source material, so I came into this anime with no knowledge on what it would cover. Unfortunately, by the end of it, I still wasn't entirely certain on what it was about.\\n\\n\r\nThe biggest issue that I had with this anime was it's convoluted story. Now while I feel that Fate/Extra is somewhat underrated, I have to admit that the plot left more to be desired. I honestly tried to understand what was going on, but so much of the story and details around the characters were left vague or entirely unexplained. This problem can be partly attributed to the short supply of episodes, but that still isn't a good enough excuse considering the fact that many short anime are able to succeed. There were several intriguing plot twists, such as the origins of how protagonist Hakuno came to be, but even they were a sort of double edged sword. Because while they shed some light on the story and characters, they also opened the door to many more questions that were usually left unanswered. I sadly couldn't enjoy each episode to the fullest because I was constantly trying to make sense of everything that was going on, and based off of what I've heard from others, this problem plagued many who watched the anime.\\n\\n\r\nThe second and final significant issue that I had was that aside from the main characters, the rest of the cast received very little development. Now don't get me wrong, I actually liked a lot of the characters. The servants were pretty interesting, with my favorite being Nursery Rhyme. However, the anime decided to have several two episode arcs featuring the protagonists vs a master and servant pair, and after the heroes prevail, they move on and the losers are forgotten. Now let's briefly analyze how Fate/Extra's sister anime Fate/Zero went about showcasing it's characters. In the entire 12 episode first season, only ONE out of the 14+ participants in the Holy Grail War perished. This allowed for every master and servant pair to develop over the course of the first season, making them much more fleshed out and letting viewers more easily connect with them. Fate/Extra on the other hand barely dedicated any time in developing it's supporting cast, which resulted in many otherwise interesting characters being quite shallow.\\n\\n\r\nNow that we've got the boring critical analysis out of the way, it's time to talk about the good stuff. UMU! Let's go!\\n\\n\r\nFirst of all, the visuals are stunning. Shaft's animation techniques can be a bit of an acquired taste and aren't for everyone, however I think that they're amazing and really creative. I particularly loved the visuals used during the Alice and Nursery Rhyme arc, because they were similar to the inventive and unsettling animation used in segments of Madoka Magica, one of Shaft's most iconic anime. Another great aspect of the show was the soundtrack. There are several great tracks in this anime, with my personal favorite being the ending theme song by Sayuri.\\n\\n\r\nLet's address the star of the show. Who is this stunning person you may ask? Why Saber of course! Since it's not immediately revealed in the anime, I'll keep her true identity a secret. Now I've seen complaints stating that the anime is just Saber fanservice and has no depth to it, but I'd have to somewhat disagree. Yes, the anime does dedicate a lot of time to Saber's antics, cuteness, and naked body. But she is also used as a device to dig into the mentality of Hakuno, the true protagonist of the story. The pair have many a philosophical conversation throughout the course of the anime that provide insight on each of their beliefs and conceptions of the world and themselves. These talks are oftentimes quite deep, and actually end up being the highlight of each episode for me. I don't think there's anything quite as intriguing as studying the psychological state of a character, and the anime really succeeds at gradually providing insight into Hakuno's thought process and his eventual spiral into despair. Saber herself is oftentimes full of inspirational advice that not only touches Hakuno, but can even reach out to the viewers themselves. This isn't an anime about cool and flashy action sequences. In fact, the fights showcased in this show are generally quite lackluster, especially when compared to others in the franchise, and I believe are one of the prominent reasons as to why this anime has generally low ratings. However, this isn't a show about fighting, but about people, as most good Shaft anime usually are about. And if you recognize this, then you may just realize that Fate/Extra isn't really all that bad.\\n\\n\r\nYou know, I really enjoyed this anime. Despite the confusing story and underdeveloped side characters, there was still so much to like about this show. The cast was still fun to watch, the presentation was fantastic, it was intriguing, and just a simply entertaining viewing experience. Oh, and it had Saber in it. Bonus! Now as the actor's take their final bow and the curtain closes, it seems that many in the audience left the theatre unimpressed. I, however, pleasantly enjoyed the show, and I hope that it satisfied you too.",
            "date": "2018-04-01T20:58:00+00:00",
            "helpful_count": 42,
            "mal_id": 276450,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3813391.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/XHellLyterX",
                "username": "XHellLyterX"
            },
            "url": "https://myanimelist.net/reviews.php?id=276450"
        },
        {
            "content": "Born directly from the father of Type Moon, Kinoko Nasu himself, Fate/Extra: Last Encore is a fascinating title in the franchise of Fate, and the Type Moon universe at large. Despite Nasu’s attempts to inform everyone about the intentions behind this anime and how everyone would be at an even playing field here, mass confusion broke out. It is only loosely based on the game, and due to the unique circumstances of the show’s narrative, it has been deemed unfit as a start. Perhaps this explains the disgustingly poor reception of this wonderful show.\r\nSuch a shame, since this anime is a sheer, flooring spectacle. Itdoes not stop. It explains as it goes along, showing the sheer brutality of its style and depictions of events. Regrettably the blitzed pacing makes us ask questions in order to connect how characters figure things out or otherwise do something important in terms of progressing the narrative. Thankfully it is the only severe problem with the narrative, as all other questions you ask slowly get answered. The anime should let itself breathe more, as its crammed tightly with exposition that moves at a lightning pace, whether that be exposition about the setting or about a character. It clenches you by your wrists and never lets go, as it flies off into the hellish world it wants to show you as it unfolds before your very eyes! A disorienting start that gives you an oppressive, dreadful vibe, and never lets that vibe escape. It is ubiquitous throughout this precisely crafted, chaotic spectacle of a series. The series gradually pieces itself together like a puzzle. The information we learn shows is that this is no ordinary Fate anime; this technological nightmare of a system the character's life in is equal parts bewildering and horrifying. The more you learn, the more crushing everything feels, as the setting is nothing more than an automation of atrocity in which mankind has no hope beyond one last chance at survival. Nearly everything makes sense in broken context of this ravaged, now disorganized world of the frightening future, despite how brisk the pace is and how convoluted things can be regarding the floors and the vile, disturbing setting. The visions Hakuno has are largely an exception, excluding visions of the past. Sadly, that alone makes this a daunting choice, no matter where you are in terms of Fate expertise, and what makes or does not make sense will not only be difficult to explain, but will likely be lost on you regardless. The excessive flashbacks do not mitigate this issue either.\\n\\n\r\nThe scenery is a glorious feast for the eyes, and the directing conveys this omnipresent sense of dread masterfully. SHAFT and the main director, Akiyuki Shinbou, as well as an added director, Yukihiro Miyamoto, mastered their craft perfectly with the most brimming of creative architecture your ever-pleading eyes can consume. An interesting idea that helped sell the distorted and discomforting feel of the events and setting was how often times, certain parts of the images on screen would distort as if it were a static channel on a TV or a moment of poor connection. The fight in the opening alone is proof of their luscious visuals, even if the fights in the show itself are a bit more into the territory of clumsiness to an extent, depending on the fight. Said fights are certainly far superior to Apocrypha, however, as all of them have the lovely styles and kinetic movement to rival the 22nd episode of that series. The designs are wonderful as well; everything blends perfectly with the fascinating, layered, brisk, and intense nature of the show. It is every bit as beautiful as this show’s incarnations of Rin and Sakura, and Saber herself. The rose petals and all of the attacks look majestic and vibrant, almost as much as the aforementioned architecture. Locations like the school, and Wonderland, are distinct and mesmerizing for the eyes, with such beauty only being comparable to the uniqueness of it all. The only issue is the occasional tampering of brightness that has no purpose. Other than that, the visuals are beyond exemplary.\\n\\n\r\nThe music, while not able to be as much of a pleasure to the senses as the visuals, is still wonderful and interesting. The Opening, \"Bright Burning Shout\" by Takanori Nishikawa, is fantastic, perfect for a series of action, given how adrenaline-pumping it is. The Ending, \"Tsuki to Hanataba (月と花束)\" by Sayuri, functions in mucha  similar way, with a more emotional tinge to it, though the vocals may prove bothersome to some. The background music works well for whatever scene it is in, blending in wonderfully with the mind-bending environments and the crystal clear mood of every scene. Each smaller setting within Last Encore has its own music, so aside from the opening and ending, if you hear a track in one primary location, it will almost never be played anywhere else. Think of it like video game level music, almost. None of these tracks are absurdly memorable but are ultimately nice accompaniment.\\n\\n\r\nWhat is most raw of all is what it says. People are full of desperation. They cling to survival to the point where they forget what makes life meaningful in the first place, regardless of any conflict or glory or despair. People can lose a sense of purpose and identity, a sense of life. They can be swallowed up by hatred, by confusion, by pettiness and vanity. People must always have a drive to make their lives fulfilling, finding out the meaning in things and what purpose they wish their life to have. They cannot let fear or hatred hold them back, let alone consume them as they proceed to make pathetic and ruinous decisions. They must make their lives truly have value, even with the inevitability of death, as the dead leave a legacy of decisions and worth for the living to interpret. The protagonists and each master servant pair each convey this in their own fascinating ways, with standouts aside from the beautiful and boisterous Saber and the unnerving and interesting main protagonist with his nightmarish powers that haunt him most of all, including this show’s fascinating and visceral incarnation of Shinji Matou, and other masters. Each master has a strong desire, far more than the main protagonist, and it can be fascinating and even disturbing to know what they’re in for, particularly due to the magnificent presentation of each of these, courtesy of Shinbou whose directing is phenomenal. Other characters, such as Rin, are merely there for other narrative reasons, but are entertaining nonetheless. Saber, however, is the ultimate joy, and Hakunon is fascinating to see get pieced together.\\n\\n\r\nFate/Extra Last Encore is arguably the most fascinating of the franchise's installments. It is a sheer spectacle in a completely different way to its brethren, and what it attempts to convey is far removed from what installments such as UBW and Zero wanted to tell, and what concepts works such as Apocrypha and Grand Order failed to properly explore. Does that make it the best? Not necessarily, but it is the most intriguing. It is the most terrifying and somber, next to Zero, the supposed holy grail of the franchise itself. Yes, UMU; it's such a fascinating work in so many respects deserves the respect it sorely lacks! Incomplete work or not, this work is a sight to behold. As I bid you adieu and await the continuation, I implore for this series to get the respect it truly deserves, as it is a passionate risk that pays off surprisingly well.",
            "date": "2018-04-02T12:59:00+00:00",
            "helpful_count": 21,
            "mal_id": 276556,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322238.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CodeBlazeFate",
                "username": "CodeBlazeFate"
            },
            "url": "https://myanimelist.net/reviews.php?id=276556"
        },
        {
            "content": "UMU! \r\nAfter episode 7 I felt the need to write a review about it.\r\nBut First let me address something that I see happening a lot\r\nthe Fate/Extra LE anime is not newbie-friendly so if you were not into fate.. like ate least have watched all the animes and plays Fate GO then you will prolly not understand much of it.. its the same as Buying FATE EXTELLA on steam without having played Fate Extra CCC on a PSP.. because stella is a direct sequel to CCC and so on... in case of fate extra le if you play FGO you are already familiar with the servants,knows their background story and maybe have even some kind of emotional attachment to them.\\n\r\nOr if you have played the Extra games it will be even better because you will enjoy the modifications BASED NASU is personally doing as he is charge of the series.\\n\\n\r\nSo for me the anime is outstanding..  And im not even a fan of nero... I also would prefer Hakunon instead of Hakuno hahaha.\\n\r\nShaft's Artstyle and screenplay make it even suitable for this kind of plot\\n\r\nBringing back Gekidan Inu Curry to do the art makes me want to hug Akiyuki Shinbo.\\n\r\nStory-wise I just feel like its being kinda rushed since its only 2 episodes for each battle but its faithful to the game.. its a fucking dungeon , you win the floormaster and go up.. simply as that.\\n\r\nI personally really like when they change vibes for something.. the OST of the anime gives a mistery and omnious feeling making you feel curious abouts wtf are really happening.\\n\r\nThe Characters in the anime are portrayed way more serious and mature than they actually are.. Mainly nero.. her own voice actress Sakura Tange stated that. ( I Wonder how Shaft would make Richard I look like serious because he is literally a clown Saber. I wish it was Him instead of Gawain but ok ok )\\n\\n\r\nOverall.. Im really happy with this adaptation so far.\\n\\n\\n\r\nThanks for reading.",
            "date": "2018-03-12T06:19:00+00:00",
            "helpful_count": 14,
            "mal_id": 273639,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1272231.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dReams-C",
                "username": "dReams-C"
            },
            "url": "https://myanimelist.net/reviews.php?id=273639"
        },
        {
            "content": "While writing a review on a show that is more of a mystery more than anything is a bit foolish before the series has finished having seen seven episodes what I have seen is promising. The main problem most people have coming into this is that they are expecting a different kind of show, believing it to be primarily about action and what a \"normal Grail War\" is about. However Nasu's stories have always been at their best when they are about something else. There is always a element of mystery present in his works. From the question of the situation of the Tohno family,and the details behind Tohno Shiki's injury, and his connection to the vampire killer. The slowly unfolding plot of Kara no Kyoukai where confusion is further added from the non-chronological order the story is presented. To the questions about the history and workings of the Grail War, and the question of what the Shadow is in Heavens Feel.\\n\\n\r\nThe things presented in Last Encore have their basis in concepts presented and dealt with in many other Nasu works, allowing a savvy-fan to theorize and think of many in-setting answers to what is going on. Things such as Deadface have relation to the concept of grudges in Nasu, tying our protagonist potentially to things like the Jack the Ripper of Fate/Apocrypha. Only that he is likely a being born of and propelled by the grudges of dead masters and npcs rather than aborted children. \\n\\n\r\nThere are things we can theorize, and things we expect, but Last Encore has both been a lot of fun making people think as to what is going on, and pulling out surprises that make sense in hindsight.\\n\\n\r\nTo those who feel discontent about the series it is somewhat understandable, but it is worth checking out the discussion on it on the forum of Beasts Lair, or to watch again and think things over again.\\n\\n\r\nYou will feel more lost as a anime-only viewer, but I do not believe that it is impossible. Playing Extra, or understanding CCC gives further context to the characters, and gives you the base of the setting. But Last Encore  is meant to be a confusing and enticing ride for everyone, veteran and new.",
            "date": "2018-03-12T13:25:00+00:00",
            "helpful_count": 12,
            "mal_id": 273660,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Menwearpink",
                "username": "Menwearpink"
            },
            "url": "https://myanimelist.net/reviews.php?id=273660"
        },
        {
            "content": "When I heard there was a Fate anime in 2018 done by SHAFT, one of the best studios out there, I was hyped with its weird pairing.\r\nNow it's over and I'm here to give my thoughts.\r\nStory (4/10)\r\nThe Fate series has always been slightly confusing at first but at the end, you'll understand everything and have fun.\r\nAnd it's always related to 7 classes of servants with masters fighting to win the Holy Grail.\r\nThis show took this and went 10000x more complex with it.\r\nWith the War being like a RPG where you have to clear floors to progress to the top, it was interesting on paper.\r\nI lovedhow they were taking risks with the writing.\\n\\n\r\nHowever, for 10 episodes, the exposition dominated the show so not many fights happened.\\n\\n\r\n10 episodes was too short. Due to this, the story was super rushed and everyone, me included, are left confused.\\n\\n\r\nCharacters (4/10)\\n\\n\r\nRed Saber and Hakuno were the only 2 that were showcased in this show.\\n\\n\r\nThe other servants and masters were forgettable with barely anything being explored about them.\\n\\n\r\nRed Saber was cute and charming but I feel like the writers milked her character too much.\\n\\n\r\nHakuno has some interesting abilities but is such a boring lead.\\n\\n\r\nRin was fine but nothing special here.\\n\\n\r\nAlice and Hakuno was great in their episodes.\\n\\n\r\nI'm disappointed. So many characters felt so useless in the end.\\n\\n\r\nArt & Animation (8/10)\\n\\n\r\nIt doesn't have great fights since the studio is inexperienced with fights.\\n\\n\r\nOtherwise, excellent job with such a weird yet breathtaking world.\\n\\n\r\nCharacters looked good for a world like this.\\n\\n\r\nSound (7/10)\\n\\n\r\nGood OP and ED songs, solid OST.\\n\\n\r\nEnjoyment (5/10)\\n\\n\r\nI enjoyed it to a small degree. But the lack of action hurts it a lot.\\n\\n\r\nIt's not bad but just a disappointment.\\n\\n\r\nWeakest Fate show I've seen and it's too bad since I thought this would be amazing after that 1st episode.\\n\\n\r\nScore 5.6/10 (rounded down to 5)",
            "date": "2018-04-02T14:49:00+00:00",
            "helpful_count": 8,
            "mal_id": 276568,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6391437.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/animejas",
                "username": "animejas"
            },
            "url": "https://myanimelist.net/reviews.php?id=276568"
        },
        {
            "content": "What i want to say first is: DON'T LOOK THE SCORE ON MAL AND WATCH THIS MASTERPIECE!!!!!\r\nOhh man,i want to say that i didn't play the games (Fate/extra,Fate/Extra CCC) but i loved the show and i think shaft did more than ufotable would be able to do, i like the way that shaft play with your mind and after you watch a episode you are like \"what the fuck?\" and after a episode \"owww that was, how could i be that stupid to don't think about that\", if you want to understand the show you need to be careful on dialog and what happing onscreen, that what Nasu want, to play with our minds \"For the people familiar with the original game, I want them to go \"What...?\" at the differences.\" \\n\\n\r\nIF YOU LIKE MYSTERY AND LOVED MONOGATARI AND MADOKA MAGICA YOU NEED TO WATCH THIS!\\n\\n\r\nStory 9/10\\n\\n\r\nSome things are still not clear and the episodes 2,3 are made \\n\r\nin hurry, but the story is very good!\\n\\n\r\nArt 10/10\\n\\n\r\nThe way shaft is careful with every detail is brilliant, and i love the animation and the way that is made\\n\\n\r\nSound 10/10\\n\\n\r\nThe sound in this show is awesome, the voices are awesome, and OP/END EARGASMMM\\n\\n\r\nCharacter 10/10\\n\\n\r\nI loved all the characters in this anime, Hakuno the transformation like in episode 1,2 was that guy that is bored all the time and don't give a fuck and after episode 3 he get personality,motivation and a purpose, like n the episode that pass caught up personality, the death face, his \"past\", AWESOME\\n\\n\r\nNero is just brilliant, UMU, i love the way that Shaft make his past\\n\\n\r\nRin/Rani their past was so fucking sad but so fucking good, and i love that shaft don't change Rin personality, like is the same Rin from Fate Stay Night\\n\\n\r\nAnd all the floor master, JUST BRILLIANT\\n\\n\r\nEnjoyment: For me this is a fucking masterpiece and i loved the show and i can't wait until July\\n\\n\r\nOverall: In my opinion, this is the best fate series, and the way that Nasu/Shaft is brilliant\\n\r\nI RECOMAND TO EVERYONE TO WATCH THIS SERIES AND DON'T LOOK THE SCORE ON MAL AND WATCH THIS MASTERPIECE!!!!!\\n\\n",
            "date": "2018-04-02T15:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 276572,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6055515.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Cotocea",
                "username": "Cotocea"
            },
            "url": "https://myanimelist.net/reviews.php?id=276572"
        },
        {
            "content": "The animation was okay at best, the plot was all over the place, scenes were shown out of order, the ending; while not as bad as Arcana Famigilia or Soul Eater, is a let down because while it doesn't piss you off the show just... ends. So why did I like it? Because it had Nero and Nero had umu. So I don't rate this a 7/10 I rate it am umu/10\r\nBreak it down a tad more:\r\nStory - all over the place\r\nArt - its no Ufotable but it does its job. Action is mediocre\r\nSound - I mean it works...\r\nCharacter - MC is an edgelord, Nerosaves this show\\n\r\nEnjoyment - Nero saves it with her umu powers\\n\r\nOverall - Umu",
            "date": "2018-05-18T14:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 280879,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6901158.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/meme_sheriff",
                "username": "meme_sheriff"
            },
            "url": "https://myanimelist.net/reviews.php?id=280879"
        },
        {
            "content": "When first hearing Fate/Extra would be adapted into an Anime, I was excited for one of my favourite PSP games to finally have an anime form, right on Apocrypha finishing it’s spotty airing.\r\n...right up until SHAFT reared its ugly head.\r\nRight from the start, you can tell this is a show made by SHAFT just by colours and composition alone, it almost feels as disjointed as a Wes Andersen movie without the humour as every introductory shot insists on bombarding the viewer with artsy stills and not getting to the point of the story. Failing that, SHAFT at least set up the story in the MoonCell; a supercomputer within the moon that mages' go to in attempts to win the Holy Grail using summoned historical and mythological figures, the typical fanfare of the Fate franchise, with the literal blank slate of a protagonist and incredibly oblivious Saber servant included! \\n\r\nI don't have anything against works made by SHAFT, but the studio itself for copy-pasting the same style of production onto everything they get their hands on, as well as retroactively touching up animation after airing for commercial release. After being disappointed with 3-gatsu no Lion, Arakawa and Mekakucity Actors, I have zero confidence in being able to like anything made by SHAFT that doesn’t involve Gen Urobuchi. Akiyuki Shinbou’s caustic style of filmmaking bleeds far too much into adaptations, so much so that TYPE-MOON may as well abandon the animated features to come after the cliffhanger ending of Last Encore left me with a foul taste.\\n\\n\r\nWhile I'm compelled to TL;DR this as a 3/10 burning trash fire that truly shows SHAFT being incapable of adapting anything that isn't Monogatari, seemingly oblivious to the fact that their stylistic choices and direction overall do not go with everything - and the studio can (and will) sabotage an anime by adapting it as poorly as possible to fit their image. \\n\\n\r\nNow, for the long wall of text that summarises my feelings in individual segments.\\n\\n\r\nAnimation: 3/10\\n\\n\r\nI almost wonder if shaft, with all their talented animators who can work wonders with over-the top sequences and scenes actually did this anime - not that the animation looks bad, but the opening is this mess of CGI environments that the singular Saber looks like a ragdoll in, hitting literally nothing but shadows with her sword - frames are skipped or missed out entirely in action sequences to make the motions look clunky and jittery, with shoddy post-production dust, light and smoke effects that do fights a disservice. Scenes of dialogue are atrociously bad, with still frames and cutaways occupying a majority of the screen-time while voices ramble on - gestures and motions made for only either displaced dramatic emphasis or memes. Shinji Matou doing the cliched shaft head-tilt in the middle of conversation is just jarring and honestly lazy, it feels like this studio keeps a template on animating this crap over and over, regurgitating any value that pose once had at the viewer.\\n\\n\r\nChoreography in scenes is jarring and strange, with settings being as inconsistent as they are colourful, and characters moving about well enough, but the transitions are always to some unknown - no consistency is established, much like the first episode of GATE, except all the way through. The main problem for this occurrence is that the setting is in distinctly different locales, each with their own visuals and aesthetic, and this type of scene transition only works with one part of the story thanks to the context of the setting. In everything else, there is zero cause to unnaturally alter the colour palette of the setting unless you're trying to instil a certain mood, yet nothing in the dialogue even indicates a change in tone, and no result comes of it.\\n\\n\r\nFight scenes last for such a short time, without any buildup to it in previous scenes, and entirely stupid moments where the brightness on-screen noticeably fluctuates between fine and so dark that the bright colour palettes become indistinguishable from the background, and the viewer barely sees these shots that would be cool if not for this ridiculous toying with contrast and white balance in scenes that are supposed to be tense. IN THE VERY FIRST SCENE, this happens for more than three seconds to the point where I had to squint to see what was going on because the editors made it intentionally hard to see - likely to prevent the flashes of bright reds and yellows from causing any seizures, but given the mature visuals and themes that occur occasionally, surely SHAFT can animate it properly, seeing as UFOtable made UBW with similar effects without compromising the viewer's ability to actually watch the show.\\n\\n\r\nStory and Characters: 2/10\\n\r\nThere isn’t enough character in the characters and the story is a mess, so one section for both!\\n\r\nI know Nasu was involved in the writing of this show, but his obsession with Fakes does this entire anime a disservice - while Shirou Emiya is at least a protagonist whose ideals are challenged as a blank slate, Hakuno Kishinami was always a bland-self insert for the player of the Fate/Extra games, though that's not to say the character had poor writing initially. Hakuno in the games is introspective, using an internal monologue as commentary while being involved in the plot. Hakuno in Last Encore has been twisted, warped into something that is not Hakuno at all, but a caricature of what the director and writer believe to be a good protagonist – disconnected, bland and redundant. A protagonist who is neither expressive or particularly interesting in Last Encore, and who never seems to have words of his own - which the writing STILL manages to screw up whenever he speaks, or anyone else does. The female version of the same character who has a speaking role in only one episode is more interesting by far, and she barely gets screentime between the exposition dumps.\\n\r\nEverything characters say is either half-assed exposition or incredibly dull dialogue that's supposed to retain my interest while the bright, flashy colours hold my attention, with no less than three tired bathhouse scenes where Nero goes into triads about herself or meaningless conversation, all the while naked or in something that reveals even more skin than her regular outfit – to the point where the show will concoct any excuse for Nero fanservice.\\n\r\nSaber, out of all the playable servants in Extra, is the least interesting despite being well-written, since Archer from Stay Night or even the other Extra original, Tamamo-no-Mae, could have been in with much better contribution to the plot than Nero. The show even references Tamamo and EMIYA in the first few episodes as a sticker and a crumbling tutorial boss-like jobber, much to rub the wasted potential of Last Encore in the faces of thee audience. \\n\\n\r\nSpeaking of Nero, whose identity really shouldn't be a secret at this point, she's the most interesting character by having the most to say - Sakura Tange voicing, Nero essentially speaks for a majority of the runtime. Between hearing her tall tales like some kind of overly-cheerful war veteran between every 'Umu!' was refreshing for the overall dull pacing of the show, and her explanations in short, concise remarks before promptly going back to the subject of herself was honestly refreshing - while grating, Tange's voice talent is good enough to put charm and character into her role, much like Jack the Ripper in Fate/Apocrypha. It's a shame since every other character is about as base as possible, with no real motivations laid out or actual character to speak of, even the protagonist who takes up to the very end of the anime to realise his own motivation before the series is left on an abrupt cliffhanger.\\n\\n\r\nThe main crux of the plot is that one-thousand years after an alternate ending to Fate/Extra, the digital environ within the Moon Cell, S.E.R.A.P.H, is now falling apart as it now has floors between each stage of the Holy Grail War, with floor masters mirroring the cast of the original game and servants the piece of cardboard known as Hakuno has to defeat to ascend to the next floor. Each floor is a different landscape shaped by the floor Master as they contain the last remnants of humans while earth has apparently been left as a barren wasteland, but we never hear of earth outside of one scene, so automatically the motivation of one character, Rin, is utterly removed to make her an atypical mentor character. To see characters whose stories were complex and gripping be reduced to two-episode arc villains upsets me, especially when their interactions are reduced to the same quality as bad fanfiction – the appearance of Robin Hood was excellent, seeing as he retained the same charm present in Fate/Grand Order and Extra thanks in part to Toriumi Kousuke.\\n\r\nAlongside that, new characters are inserted to service the plot for very little reason other than to earn my ire, as a pink haired character who screams ‘Determined Opportunist’ and whose name I’ve honestly forgotten appears several times to engage in meaningless conversation. Why not a different character, instead of a new one? Four characters from Extra are entirely missing, each of whom could fill that role instead, so why paste on a generic stand-in when the designs and characters are already there to use in the production of the show? It makes no sense to design an entirely new character who serves no purpose, let alone not use that character outside some vague exposition.\\n\\n\r\nOne of the most egregious things Last Encore does to patronize the viewer outside of stating the obvious or dumping exposition in moments of still shots and clunky transition is to pull things out of thin air to retroactively explain them later – like Dead Face, a weird rage mode for Hakuno made from pure edgy fanfiction, explained away five episodes after it first appears, with the power to apparently resurrect him from being fatally wounded at least three times in the entirety of the show without explanation. He’s stabbed, many, many times only to appear spotless an episode later, without a single problem from being impaled on several swords at once.\\n\r\nAll this time spent on just talking to explain away the shitty writing within the show does what shaft like to regurgitate best – retroactively explaining it away and expecting the viewer to nod their head in amazement at their “good writing”. It feels like the villains lose for no reason whatsoever and have zero sense to kill the protagonists while they’re incapacitated, and since it’s established repeatedly that Hakuno can just come back if he dies, the plot loses all tension whatsoever since the narrative is following the immortal cardboard cutout and his babbling fanservice girl.\\n\r\nAs much as this series likes to pretend it has any deep psychological elements, it falls flat when everything is explained to the viewer – no use of camera angles, tension, music or expression to convey the struggles of the protagonist going through an identity crisis, just a blank slate.\\n\\n\r\nFor a short series, I do understand the need to cut content. But if that was the case, why include so many scenes where nothing is accomplished or developed upon? It baffles me to think that so much time could be wasted turning parts of the story that could be covered in single episodes and drag it out to double the runtime. So much more could have been squeezed out of Last Encore if it wasn’t trying so hard to be a flashy art piece and convey a narrative that is coherent while having those same interesting themes tied into it instead of loosely covering it with a sheet of vacuous, surface-level dialogue. \\n\\n\r\nMusic and Art: 5/10\\n\\n\r\nWhile the writing, animation and composition ruin the show, the art style is actually pleasant enough to distract from the atrocity of writing that Last Encore is, where Wada Arco’s design actually make the series nice to look at when the animation isn’t being a let-down – the Nursery Rhythm episodes are by far the best for creating the strange atmosphere that suits shaft’s style, where colour and contrast are emphasized greatly. Nero standing out amongst the blue hues predominant in most of the background in episodes, the contrast turned up in scenes to make the characters really show. Which is a shame as the aforementioned turning down of the brightness occurs too just when the colours and artwork is a spectacle in action scenes, taking away from the value of Last Encore’s art direction.\\n\r\nThe music isn’t bad, however both the opening and ending themes feel incredibly disjointed from the animations themselves, especially the opening as a good song for an opening isn’t synced at all to the animation, highlighting just how poor the sound mixing was for these segments. In Last Encore overall, there isn’t any real problem with the music otherwise. The score matches the mood of the scenes very consistently, though the music itself sounds very much like stock fantasy RPG soundtrack, with very little techno influences despite being set in a virtual world – failing to set up any growing sense of tension throughout it – the music could have done with being remixed for certain scenes like transformations or episode 10 to incite a sense of wrongness, but the bell chimes used in Alice’s episodes instill a good balance of music that would accompany a traditional fairy tale and something being very, very wrong with the setting.\\n\\n\r\nEnjoyment and Overall: 3/10\\n\\n\r\nWhile the art and sound direction are redeeming qualities, the story, characters and direction alongside absolutely dogshit pacing where content is stretched out to fill runtime with irrelevant conversation, Last Encore does no justice at all to the game the adaptation comes from.\\n\r\nIf you want a solid story with the same setting, I would recommend the original game or it’s sequels, but not this at all. Shaft should not have been trusted with this adaptation, and simply ‘looking good’ by way of art style or animation is not a way to impress when the writing and characterization are so lacking.\\n\\n\r\nKinoko Nasu, the main writer of the original Fate/Stay Night and Extra, stated that he wanted this to be a starting point for those as their first “EXTRA” experience, for the audience to become familiar with the original game and other works from Last Encore, and vice versa, yet this only really succeeds at confusing viewers for the first time and annoying fan of the franchise with it’s inconsistencies. If you’re expecting this anime to give fans fanservice in the form of cool moments from Extra, don’t. If you’re unsure of where to start with the fate franchise, it’s not this. Last Encore is an awful adaptation, and many who are starting off are simply better off watching Apocrypha, which at least has more than one redeeming quality outside of the evidently higher production value.\\n",
            "date": "2018-04-12T12:38:00+00:00",
            "helpful_count": 6,
            "mal_id": 277870,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7142316.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/WaffleOverdose",
                "username": "WaffleOverdose"
            },
            "url": "https://myanimelist.net/reviews.php?id=277870"
        },
        {
            "content": "The Fate franchise being one of my favorites;Fate Extra LE was an anime I was excited to see ,but I should have learned my lesson from getting hype for Apocrypha in 2017 and not jump on the hypetrain. I felt like my reasons were justified for LE though as it was being animated by Shaft, one of my favorite studios and also had Nasu himself writing the script. Before I get into my reasons for not liking Extra LE, I will say that I never played the game Fate Extra or CCC, I`ve only played Extella so my understanding of the anime is not asgood as someone who has played the game it`s based on.\\n\\n\r\nOne of the main reasons I disliked LE is the format. Everyone is probably familiar with the format of the Holy Grail War  but LE has a strange take on it. Hakuno and Nero and sometimes Rin would get to a floor, fight the master that controls the floor than advance. If you ever read Tower of God it is kind of like Baam and co climbing the tower floors. In Tower though each floor is given enough chapters to form a well-paced story; in LE each floor was over in 2 episodes and you could forget about one floor as soon as they move on to the next. \\n\\n\r\nEven if it was the usual Grail War it wouldn`t have helped. The battles were all lackluster. Fights are a vital part of a Fate anime and I wasn`t expecting the fights to be as good as Zero and UBW but better than what we got from this. All the fights felt too short and none of them had that epic feel. Even Apocrypha for all its flaws had fights that felt epic. The biggest kick in the balls was Nero unleashing her Noble Phantasm. It lasted all of 30 seconds and the whole sequence was just her dashing over with a big slash. The main servants Noble Phantasm deserves more than this. The first time I saw Artoria use Excalibur in Zero was one of the most exciting parts of Zero; in LE Neros NP was just another forgettable moment.\\n\\n\\n\r\nThe story was the biggest problem. It was hard for me to summon any interest at times. Hakunos whole thing of trying to recall who he is and what his purpose is felt cliché. It was hard to care about the enemy masters and servants when you knew they would get beaten in 2 episodes. They felt like villain of the day type of characters to me, so why should I care? The only good part was the designs of some of the floors like the city floor and the Madoka Magica themed floor.\\n\\n\r\nThe characters also lacked  depth. Nero as the main servant should have good character interaction with Hakuno but most of their dialogue involved Hakuno being depressed and Nero encouraging him. Hakuno would have random moments of anger and put his serious face on and ramble about how much hate he has like Sasuke used to do. The most memorable of Nero and Hakunos scenes were the fanservice ones. I make no secret of liking ecchi/hentai as my list will show but from this anime I wanted interesting conversations like the ones Kirei and Gilgamesh had in Zero; instead we get an emo kid needing encouragement every step of the way.\\n\\n\r\nThe only things I really liked about LE was the animation and opening song. A boring story and bad use of characters really lowered the enjoyment of watching this every week. There`s supposed to be a continuation of this but I have no hope for it getting better. If you are new to Fate do not start with this shitshow under any means and even if you have watched Zero/UBW/2006 Fate I would not recommend wasting time on this.",
            "date": "2018-04-02T13:21:00+00:00",
            "helpful_count": 6,
            "mal_id": 276559,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6112143.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/VioleGrace107",
                "username": "VioleGrace107"
            },
            "url": "https://myanimelist.net/reviews.php?id=276559"
        },
        {
            "content": "It is somewhat troubling that a review has to begin like this, but let me adress the elephant in the room: This is not Fat/Extra, this is Fate/Monogatari.\r\nMany viewers seem to be turned off not only by the rather unattractive setting we've been given in the first 2-3 episodes, but especially by how little this feels like it is Fate, if one were to compare it to the popular anime adaptations by UFOtable that is.\r\nAs a fan of the franchise myself, I initially found it difficult to get into the series, mainly because of the initial shock of how different it was from the game,followed by whatever that plot during the second and third episodes was supposed to be ( was that a Tron reference?). However, as the show progresses, it shows more similarities to the original VN in terms of character interaction, which gives the show it's own value. Sadly,  it's standing within a franchise that is popular mainly for its battle royale element is suspect so far.\\n\\n\\n\r\nHere's what the show isn't:\\n\\n\r\nA Battle Royale\\n\\n\r\nA clash of ideals\\n\\n\r\nGritty\\n\\n\r\nMagical\\n\\n\\n\\n\\n\r\nSadly, it has to be said that Shaft has ditched most of the things that make Fate an appealing series, leaving not much for the general fan to enjoy, unless they had delved into the game before.\\n\\n\r\nWhat remains is character building through character interaction and conversation. Shaft are known for lengthy dialogue in their works since Akiyuki Shinbo joined. Luckily Type-Moon's VN's are kind of known for that as well. Last Encore stays true to this, especially in the two recent episodes as of the writing of this review.\\n\\n\r\nSpin-offs and sequels that break with the style of the original series too much tend to have a rough time entertaining the existing fanbase and meeting the expectations of newcomers. Last Encore is no exception to this, though I have to say that the show is still very enjoyable if it is judged by its own merits. It still retains a cast of interesting characers, both in terms of personality and waifu/husbando material. For veterans it holds a new outlook on the grail wars within the mooncell and is certainly a worthy \"sequel\" of sorts to the original trilogy of Extra, given its narrative references to the game. Sadly it falls completely on its ass when it comes to the fight scenes. I've often heard the unjust criticism of shaft not being able to do action, but this time I will have to agree. Not looking at this show from the angle of it being supposedly action made it a lot more ameable for me.\\n\\n\\n\\n\r\nOverall, the show has lots to offer for those who are willing to take it as something other than a battle royale and are versed in the original game. For newcomers to the franchise or even just to the world of the Extra series, this series is most likely a complete miss.",
            "date": "2018-03-11T16:11:00+00:00",
            "helpful_count": 6,
            "mal_id": 273599,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4726606.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/addioo12",
                "username": "addioo12"
            },
            "url": "https://myanimelist.net/reviews.php?id=273599"
        },
        {
            "content": "Fate/Extra is one of the many Fate series, as I would recommend anyone watching Fate for the first time to watch Fate/Zero and Fate/stay night first, before watching this series, to know more about the lore and characters in Fate.\r\nThis review is based on the first 5 episodes of the anime.\r\nStory: 6/10\r\nFate/Extra starts of in a futuristic looking world, where you're introduced to the main character and learn something about the kind of holy grail war taking place in this world. The story starts of very vague and gives you more questions than answers to the many things going in this series. In the nextfew episodes a few things are explained, although it still remains pretty vague overall. However, the amount of unanswered questions can make you more interested in watching more of the story, so it isn't necessarily bad (in the first few episodes).\\n\\n\r\nArt and sound: 7/10\\n\r\nThe art and sound in the anime are pretty good, and the animation is consistent as well. \\n\\n\r\nCharacter: 6/10\\n\r\nAs of episode 5 the main character Hakuno Kishinami hasn't really shown any character development and is a pretty bland character. Saber has a pretty bland character as well, because she is just full of energy, willing to fight any opponent, so I hope they will develop these two characters more in the series. The supporting characters originating from Fate/stay night have pretty much the same personalities as they had, which are shown pretty decent here. Overall the characters are pretty decent, but there is still a lot of room for character development, as they haven't shown anything out of the ordinary yet.\\n\\n\r\nEnjoyment: 7/10\\n\r\nFate/Extra has a lot of unanswered questions, urging me to watch more of it and has a pretty interesting premise, but the story and characters have a lot of room for improvement, putting my enjoyment at a 7/10 for now.\\n\\n\r\nOverall: 7/10 (6,6/10)\\n\r\nAs of episode 5 Fate/Extra is pretty good, it has an interesting premise and urges to watch more, because of the many unanswered questions, but has room for a lot of improvement as well. I would recommend fans of the Fate series, who are interested in a setting outside of the main story of Fate to watch this series and I would recommend newcomers to the Fate series to watch Fate/Zero and Fate/stay night first, before watching this anime.",
            "date": "2018-03-04T09:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 273003,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6934386.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DtDaniel",
                "username": "DtDaniel"
            },
            "url": "https://myanimelist.net/reviews.php?id=273003"
        },
        {
            "content": "This review contains spoilers.\r\nIn my opinion, Fate/Extra is a massive mistake by Shaft. At the same time that the studio is adventuring into strange waters by adapting a TYPE-MOON title, they`re diverting too much from their usual adaptations when they decide to go for a linear-focused narrative. Fate/Extra being adapted by this manner, in my opinion, is a recipe for disaster.\r\nIn Fate/Extra, differently from other Shaft titles, there`s a linear narrative that has to be told by clear, objective and focused means. Fate`s world is rich in important details that NEED to be stated in a clear form for the universe to make sense. Shaftbuilds up a headless, footless monster when they decide to use the stylized approach that became famous in the non-linear -monogatari titles to be the vanguard of the series. This stylized approach, in Fate/Extra, becomes more important than the narrative itself. This becomes a serious problem for the linearity of the script because it leaves the spectator lost in the timeline and in the sense of the universe. Each episode starts and ends in a completely different manner than the previous – a basic continuity mistake that is TOO basic for an acclaimed studio as Shaft. I had to check the number of the episode while I watched to confirm if I wasn`t jumping over any of them by mistake.\\n\\n\r\nThe first episode of Fate/Extra is so badly-scripted that I thought I had been watching the second episode by mistake. It raises more questions than answers. Builds up an universe but doesn`t explains it. It completely ruins the suspension of disbelief. It`s in my list as one of the worst title debuts ever produced.\\n\\n\r\nFate/Extra is VERY objective when it only shows Saber/Nero in a 1-minute-25-second-action Opening. It tells us Nero is the marketing point, and she really is. Not only that, but Nero is the ONLY character with a backstory built-up that is concrete enough to be developed upon. The unforgivable mistake is, perhaps, the worst contradiction of the series – focusing the screentime on amorphous, monotonous, shapeless blobs that pretend to be characters -instead of in the actually interesting character that is Nero.\\n\r\nJust like other TYPE-MOON titles adapted to animation, the main character is once more an insertion mass for the spectator. Kishinami Hakuno is an extremely bad-built and bad-developed character, with the unique and essential function to react to the mishaps in the narrative while pretending to be you. Even after all this, he still fails to deliver while having, on average, two dialogues per episode and, on average, the most screentime of all characters. Hakuno`s backstory is badly-written, confusing and has many non-capped holes to be relevant. His personality has no taste and his motivations are empty. When animation studios adapt TYPE-MOON main characters, they seem to write it down while taking a massive poo dump.\\n\\n\r\nThis doesn`t get better if we compare Hakuno to the supporting characters. They are merely touched by the narrative, with no intention of development. Shinji, Rin, Rani – they`re all characters with no development potential that are used solely as story-progression tools. They`re used, then get discarded. When the narrative freezes, there they are to unfreeze it. Then they get discarded again.\\n\\n\r\nWhat really irritates me when the topic is Shaft is the absurd quantity of unneeded, uninteresting, confusing and evasive dialogue. This is not only a problem of Fate/Extra itself, but of a lot of other Shaft-adapted titles: the characters say words, but they`re not speaking anything. These types of pretentious dialogues make the characters look like college philosophers – they only serve as hole-fillers to extend the lifespan of the episodes. Fate/Extra, with its humble 10 episodes, shoots its own foot when it adds these redundant dialogues. The script jumps over a whole floor because of the limited screentime – it`s a tragedy.\\n\\n\r\nOne of my problems with Fate/Extra is the monotony in the adaptation. The script is essentially descriptive. The series doesn`t want to surprise you, or to make you feel with the characters, or even create a bond between you and the story. The only function of the narrative is to communicate the facts in the most tasteless, abrupt form possible. When only one of the characters is in the scene, it seems as like all the other characters are frozen in time, only to not ask anything about what happened when they were not in scene. This kind of wearisome approach was principally noticed in the final scenes of the series, when Hakuno makes the `hard` choice between Rin and Rani. A potential climax was being built only for the decision to be communicated in the most abrupt and monotone way. It let me down immensely.\\n\\n\r\nI won`t even comment how much of a let down the ending was.\\n\\n\r\nIn Fate/Extra`s case, it really seems like the Opening is the cover of a book. We can`t really judge the book by its cover. The animation budget was probably completely wasted in the opening, because we don`t really see much of good battle scenes like we do in the Opening Song. Animation is mediocre, it really seemed stiff at times. Art direction is also not one of the best – the characters design chosen doesn`t really go well with the narrative in my opinion.\\n\\n\r\nFate/Extra is a title to avoid. Much of the promises are not delivered and the script is very confusing and full of holes. This makes the series really frustrating to watch for the spectator. I hope the continuation can, at minimum, bring this ship back to the surface.\\n",
            "date": "2018-04-23T20:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 278840,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3529443.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/hunternoobx",
                "username": "hunternoobx"
            },
            "url": "https://myanimelist.net/reviews.php?id=278840"
        },
        {
            "content": "If an anime gets you to think, really cares about the character and ask questions, this is the one. There are so many questions in the show, why the earth is corrupted; why the holy grail system is built; instead of getting burnt, why dead body sort of like...disappeared in the incinerator; who is the glasses nerd; why is Rin disappeared... After a few episodes, I am sure if you really pay attention to every detail in the show, you will have so many questions and you really want to watch the next one. And maybe you will ask yourself this: if you not sureabout something, and you know this will harm everyone's interest, will you still accomplish it? My girlfriend answered this question without hesitating LOL she said: if I have you, I don't give a damn.",
            "date": "2018-02-24T07:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 272326,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/2011xavior",
                "username": "2011xavior"
            },
            "url": "https://myanimelist.net/reviews.php?id=272326"
        },
        {
            "content": "Liked by some, hated by some, and seen as average by many, fate/extra is somewhat of the opinion divider. This is the first fate adaption by shaft, and considering the reception of this it is probably the last one.\r\nThis review covers both this and the 3 ep ova sequel. A few spoilers in the review below, turn away if you want to go in 100% blind.\r\nThe protagonist, hakuno, where he is friends with shinji and meets other fate series characters, while the peace doesn't last long as we see the move towards the beginning of the ?th holy grail war, and hakuno is backstabbed bythe mentioned friend\\n\\n\r\nWhile we see old fate characters their roles are limited compared to what you might expect, and towards the end of the show the real roles and reasons for the characters existences are revealed\\n\\n\r\nA lot of these things mentions are only part of the first few eps. Which is the main downside of this show. Things are happening but why they actually happen is not fully revealed at the time they are relevant.\\n\\n\r\nRin and Rani, their existence isn't fully explained until ep 10. Before then the show barely explains there presence at all.\\n\\n\r\nNow on the bright side the artwork is stunning, probably not quite up there with the ufo produced fate but it goes it's own way and defines it's style on it's own, at least fate-wise. A bit more fanservice is present than the other fate series, which depending on your preferences may be a plus or a minus.\\n\\n\r\nThis show continues the trend of fate characters having differing reasonings for fighting, and we see hakuno be not quite the the strong mc, but unlike other bland male mcs, he lacks a lot of the annoying quirks, there is no harems or social awkwardness here and instead his motivation is based on his lack of understanding of his existence.\\n\\n\r\nTo wrap this up, while this isn't a masterpiece or anything like that it's worth a watch if you enjoy the fate series and don't mind a different take on it. If you go in expecting fate ubw or zero it's probably not going to fully hold up, but it's still fun and entertaining in it's own way.",
            "date": "2018-09-02T01:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 287938,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6836774.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Aboar",
                "username": "Aboar"
            },
            "url": "https://myanimelist.net/reviews.php?id=287938"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nIt's worse than Fate/Apoc if you can believe that, which is considered the worst Fate adaptation.\r\nThe Main character of Last Encore, Hakuno, is like Sieg 2.0 (Sieg is from Fate/Apocropha). At least in Apoc they had more episodes and several servants to take focus away from Sieg but in Last Encore, all we ever do is focus on Hakuno and he's not even interesting DESPITE certain revelations about him and his edgelord powers.\r\nSome would argue that Hakuno + Saber (Nero) is more interesting than Sieg + Jeanne, which is only half true considering Sieg and Hakuno has the similar personalities and Nerois more energetic than Jeanne but people often forget that in Fate/Apoc, it's not a duo but a trio of characters. Sieg + Jeanne + Astolfo and Astolfo easily makes up in personality for both Sieg and Jeanne.\\n\\n\r\nAction scenes are worse overall compared to other Fate animes and due to its 10 episodes (+ 2 more later) there's tons of info dumping every episode for a convoluted story that so far up its butt that it makes Fate/Apoc look like Shakespeare.\\n\\n\r\nThe story is flat-out confusing as heck. It has too much exposition and dialogue without explaining much, and despite Nasu's intention (and statement) of making the story friendly to newcomers to the Fate/Extra series. Even those who have played the Fate/Extra games and know its lore are confused.\\n\\n\r\nI definitely recommend passing over this.",
            "date": "2018-08-09T13:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 286024,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6574305.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nuka-Raider",
                "username": "Nuka-Raider"
            },
            "url": "https://myanimelist.net/reviews.php?id=286024"
        },
        {
            "content": "I should preface my review by saying that I really love Shaft's animation style, and that my review might look jilted at the high art rating compared to the average overall rating.\r\nFate/Extra is very... \"Fate\" in its execution. It focuses very much on the \"MC has a big secret we need to learn\" that most other series' have, while also likening their journey of self-discovery to the mysteries of each Servant they encounter. That being said, right off the bat I can tell you it was much more enjoyable than Fate/Apocraphya. The battles might not have as grand of spectacle, but the artstyle and lackof bass drops make up for that completely. While the fights aren't really able to top Fate/Zero or UBW, it seems like they were less of a focus when compared to the mystery of the Grand Holy Grail War that's currently stagnating.\\n\\n\r\nTwo main issues prevent this from being a 7 or an 8.\\n\\n\r\n1. The amount of episodes were short to the detriment of the show. I often hate it when shows drag out too long, as it usually results in either poorly constructed arcs or random filler within episodes. This show has the opposite problem. Where I was fully invested in the story (reflected in the score of a 7), unfortunately my enjoyment suffered due to a confusing narrative as a result of poor episode structure. It jumped around more than S2 of Westworld in timelines, but it wasn't always clear as to what was going on. This really drug the show down in episodes like 6 and 7 where the artstyle is absolutely unique, but the storytelling is so confusing I was getting narrative whiplash. The climax reflects this as well, as the \"end\" of this season is going to be a two hour movie, leaving the series feeling only 2/3 finished. They should have made this a 12-14 episode season and it would have fixed plenty of these odd narrative problems.\\n\\n\r\n2. So while some of the narrative whiplash resulted in not having enough space for each episode, the rest resulted from a poor choice of presentation to reflect the time skips. I had trouble telling when I was in the present, the past, or the future, and afterwards I'm still not sure. I'm fine if they reveal it at the end what was going on, but often these waters are still left muddy. This leaked into an odd presentation of floors too. As the MC tries to ascend floors, he essentially only has one enemy each time. The issue with this, is it's counterproductive to traditional fate where masters will ally and betray each other with a certain finesse to ensure their survival of the Holy Grail battle. The structure feels even more \"VN-like\" than usual, as if I can see the sections of the game passing me by.\\n\\n\r\nOverall, I think the review for the movie will be closer to my \"final review\" as I almost feel like I'm writing for an unfinished series. The animations were choice, the colors were nice, the sound was decent, but the character and story suffered due to poor storytelling and pacing. This still manages to hop above Apochraphya, as the characters weren't abysmal (I found myself invested in the 3rd floor and 2nd floor stories quite a bit) and I really got a sense for the motivations they had for their want of the grail. It's worth a watch if you're a Fate fan, but it's probably not the series you should start with.",
            "date": "2018-07-28T15:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 285012,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6874523.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AmericanSomnium",
                "username": "AmericanSomnium"
            },
            "url": "https://myanimelist.net/reviews.php?id=285012"
        },
        {
            "content": "I really enjoy Shaft animation, the Monogatari series in particular being my favorite anime series\r\nI really enjoy the Fate series, having seen most of the main animated material and Zero being one of the first anime I ever watched.\r\nSo why don’t I like Fate/Extra: Last Encore, a Fate installment animated by Shaft?\r\nIn all fairness, many of the elements that make up smaller portions of the story work or present themselves perfectly adequately. Shaft animation might often appear in a trademark stylized way, but since the animation was fluid and reasonably detailed it certainly gains a pass. \r\nSome of the scenery shots and images from thefinal episode very well make their way into wallpaper-worthy territory. Music, whether background, battle, or theme song, aren’t particularly stand out, but music is at least doing its job if it stays supporting the action and not interrupting it.\\n\\n\r\nCharacters have always formed the major backbone of the series, since all of events and themes revolve around the actions of key characters. Fate/Extra Last Encore falls more in line with past Fate installments rather than branching out into some of the wider Nasuverse characters. \\n\\n\r\nThe main character falls somewhat into the generic high school age MC with burgeoning intriguing characteristics, but lacks the originality of Shirou in Stay Night or the more mature takes on heroism seen in Fate/Zero. Tohsaka Rin makes an appearance and remains in the character expected from her earlier appearances in Fate anime. The other more minor characters come and go on an almost episode-level basis and barely do more than act as obstacles and opponents for the main character and his servant. \\n\\n\r\nAnd the main servant, the Arturia Saber lookalike from the media, commercials, games, art, and ruiner of trying to learn anything about the Roman Empire, Red Saber Emperor of Roses. Saber Nero Claudius.... Why Fate has an obsession with genderbending is still unknown. She certainly adds an upbeat, optimistic outlook to the usually downcast Fate series, but the reception would vary viewer to viewer.\\n\\n\r\nThe largest sticking point for the series comes from the plot. The Fate series has always used the Holy Grail as its principle McGuffin, and while that is present in Fate/Extra, it doesn’t appear to be the focus of the main characters. Instead the plot wanders, passing through different and mostly unconnected stages. \\n\\n\r\nEach stage wanted to discuss different ideas or the traits of the cast, but seemed to devote too little time while trying to balance action with dialog, and the series ended up not allowing for enough of either. Episode 7 stands out as something I personally rewatched multiple times and still failed to comprehend the reason for it and the point it was trying to make.\\n\\n\r\nSome of the actions and abilities of the cast also seemed to be skated over due to a lack of time to explain their existence, but only poked further plot holes or raised more questions. Many lines of dialog seemed to try to explain what the reason for these abilities was, but became unnecessarily philosophical and lacking in focus to the point that it was more confusing than simply accepting \"magic\" as the explanation. \\n\\n\r\nFate/Extra: Last Encore falls as the weakest entry to the Fate series in the animated universe. The characters were functional, but failed to distinguish themselves, the technical aspects worked fine to well, but the plot left so much to be desired that the series as a whole is hard to recommend. Perhaps supplemental material helps Fate\\Extra make more sense, but until then it seems fine to skip this entry in favor of Zero or Unlimited Blade Works.\\n",
            "date": "2018-04-17T20:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 278353,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3655051.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Calcature",
                "username": "Calcature"
            },
            "url": "https://myanimelist.net/reviews.php?id=278353"
        }
    ],
    [
        {
            "content": "UMU!\r\nLA will say right here and now, but Fate/Extra: Last Encore was LA's wild card of Winter 2018 and it sure was a wild ride to the Fate/Extra: Last Encore \"world\" of SHAFT-iness and and defeating masters every floor...\r\nFate/Extra: Last Encore is quite the different take on the Fate series but holds some of the same basic rules as the Fate series, having the same \"must defeat Masters and their Servants to obtain the Holy Grail\", \"getting to know the opponents and their backstories\" and finally having a Saber that the main protagonist has as it's Servant. However what's different about this Fate compared toFate stay night series and Fate Apocrypha is that our main protagonist Hakuno Kishinami voiced by Atsushi Abe is an intentional blank slate living in what is pretty much a pseudo-matrix world with the implementation of the Holy Grail War and the last of \"humanity\" at stake. \\n\\n\r\nHakuno himself is a bit of an interesting main protagonist, him not knowing who he is, WHY he's going up the floors and how he even gotten a Saber in the first place, but obviously we do learn latter on \"what he is\" and how he \"frees\" many of opponents stuck in the automation world, he is the text book definition of an underdog with a blank slate, but even then LA kinda gets it because Hakuno in the visual novel this anime adaptation is based on is like your player avatar, but even then the anime and game itself has another reason for his blank slate. Now onto the new Saber and boy is this Saber different, in comparison to the original Saber, this Saber voiced by Sakura Tange is genki, optimistic and has GREAT chemistry with Hakuno let laone the rest of the cast (be it opponent or other Master etc.), her dialogue as well as her voice actor really makes her likable.\\n\\n\r\nNow the many opponents Hakuno and Saber comes across may just be \"Master of the arc\"-like situations considering the format of this Holy Grail but in-depth it shows of Hakuno's world and what humanity's negative aspects in full force within these Masters and their Servants, from pride, sloth, loneliness, wrath and such and this is telling of making Hakuno make sense of many of the Master's intention and holding hope for Hakuno once he reaches the 7th and final floor of his wish in the process.\\n\\n\r\nIn terms of animation, done by SHAFT, well it's SHAFT so some unique directions and art style will be at work here and even the character designs are interesting, and because mostly this is a SHAFT work, LOTS of dialogue with unique transitions will be at play here, YES, it did confuse LA from time to time at times but LA kinda sees why SHAFT wanted to adapted this and was kinda perfect for them. Fate/Extra: Last Encore is an interesting case where SHAFT's controlled lunacy makes sense in animated form especially in how it's presented as a surreal world (best example being Caster's world where it's pretty much a literal Witch's Nest a la Madoka) but LA thinks the aesthetics of SHAFT's animation complemented AND intentionally confusing animation.\\n\\n\r\nAs for voice acting, the voice cast was great in many aspects, especially with Sakura Tange as Saber, she just brought life to the anime for all her genkiness in comparison to the dreary atmosphere of the anime. Atsushi Abe was pretty good as Hakuno even if he was suppose to be a blank slate who finally realizes his true goal in all this. Now the minor cast is interesting, from returning voice cast of the original fate series (mainly Kana Ueda as Rin Tohsaka and Hiroshi Kamiya as Shinji Matou) but new characters like Misao Amari voiced by Ayaka Imamura, Rani voiced by Asami Sanada and Mugihito as Dan Blackmore were all interesting voice actors in Fate/Extra: Last Encore. But major props to Sakura Tange as Saber.\\n\\n\r\nFate/Extra: Last Encore is different to say the least, but just because it's \"different\" doesn't mean it gets a free pass, LA knows that. Fate/Extra: Last Encore does falter from SHAFT's direction for being confusing and what with a 10 episode screentime, there is some rushing just masked as confusion as well let alone the final episode was nothing but finishing at the 6th floor and not completing the story. LA KNOWS that SHAFT's schedule slipping is common thus the \"final arc\" will be released soon as LA writes this review but even then, SHAFT must had been in a strict deadline because of it and delayed it. LA would like to see what the hell happens in the 7th floor and see the story finished.\\n\\n\r\nFate/Extra: Last Encore is plagued with problems from the rushed story to it's actual internal SHAFT problems, but nonetheless LA kept rooting for Fate/Extra: Last Encore to be a good Fate series thus was LA's wild card of Winter 2018 and for the most part, even though LA was intentionally confused, LA was still interested in Fate/Extra: Last Encore, not because of SHAFT's animation, but of Fate/Extra: Last Encore's story in general, the \"worlds\" were interesting let alone the new and interesting Masters, Hakuno himself a mystery as well as his wish. For as much rushing Fate/Extra: Last Encore did, it did develop it's characters and talk about world building to the point LA is fascinated by Fate/Extra: Last Encore's structure of the Holy Grail as it's Masters let alone Saber and sure the final episode isn't the \"final episode\" due to schedule slipping on SHAFT's part but again, LA would like to see this story end.\\n\\n\r\nFate/Extra: Last Encore NEEDS one last encore...but until then, it's LA's wild card of Winter 2018 and a pretty interesting installment to the Fate franchise.",
            "date": "2018-04-03T15:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 276736,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=276736"
        },
        {
            "content": "When the announcement came that Studio Shaft was going to adapt an entry into the ever expansive Fate series I was legitimately looking forward to it with bated breath, but admittedly a little skeptical. The Fate franchise is one that I hold very highly and each adaptation, somehow or another, managing to keep my love and adulation for the series growing strong. So couple that with Studio Shaft at the helm this time, being one of my favorite anime production studios with such great works like Madoka Magica and the Monogatari series being their most acclaimed series, needless to say I was very much hyped.\r\nHowever,Shafts take into the Fate series was one met with a very conflicting and polarizing opinion form not only Fates core fanbase, but from pretty much anyone who viewed it. Those that are familiar with the Fate franchise know of two primary entries – Fate/Zero and Unlimited Blade Works – and how the action present within these Fate series is some of the most spectacular ever presented in anime. Of course that opinion is hotly debated, the best part about all the Fate entries is their ability to captivate the audience and immerse them in the action.\\n\\n\r\nFate/Extra takes an alternate approach though, and opts to go in the style that Shaft has built a solid reputation out of; philosophical and a heavy dialogue driven plot met with their avant-garde and surrealistic use of cinematography. The focus of this series does not lie within the flashy and thrilling action scenes that the viewers of previous Fate iterations are accustomed to, and while there are prominent action scenes that do take place, it is a character driven plot layered with mystery set within an alternative timeline/setting.\\n\\n\r\nSo let’s talk a bit about the plot (I will obviously avoid revealing too many spoilers) and try to understand why so many people came out of this series either confused, let down, or a mixture of anything in between.\\n\r\nSo if you are at all familiar with the Fate series you kind of understand the basics, Extra works similar to any other Fate series in the same way where a number of masters are given the opportunity to do battle against other masters using servants summoned based on various historical figures. They compete against one another to win the coveted prize; the Holy Grail – a mysterious object that grants the victor a wish they desire most. However, instead of a grail, the wish granting object in Extra is an enigmatic computer called the Moon Cell Automaton and the entire tournament is happening within a virtual space where magic is permitted.\\n\r\nEssentially it is a ‘last man standing’ or battle royale type of deal.\\n\r\nOur main character – Kishinami Hakuno – gets roped into competing in this virtual war and seemingly has no recollection of why he is involved, as well as ‘who he is’. As the case most of the time, he is reluctant to be a part of something he doesn’t understand, but is eventually persuaded that he will find the answers to his questions if he does go through with it. To do so he must traverse and ascend seven floors in total within the virtual space to reach the goal, with the aid of his acquired servant of course. Since the series is shrouded in mystery most of the time, a lot of important plot details are either left lacking explanation or just not mentioned at all. The details regarding Moon Cell’s actuality as well as various characters involvements tend to be on the lacking side.\\n\\n\r\nSpeaking of characters, in all honesty it just felt that the majority of characters introduced were harshly underdeveloped with a lot of backstory not really justifying certain characters involvement with the virtual war. Many supporting characters only get a handful of scenes – or rather, sometimes just one episode – with the focus on them. It’s another issue present within Extra; it’s not very well-paced and the characters suffer the most from it. Ten episodes were not enough to get invested and wanting to know more about the other masters and servants. Primary character focus constantly shifted between Hakuno and his servant, Saber (I will omit from revealing her actual identity since it is a spoiler), with Hakuno initially showing no motivation in the war and only really caring about finding out his own identity. Hakuno is a mystery himself, and with him being an amnesiac he is essentially a default player in a game. \\n\r\nHis servant, Saber, is a total opposite from him. From the moment she appears she makes sure to let you know that she is a big deal. She displays a very arrogant, confident and vain personality which is highly contrary to the OG Saber of Fate/stay night’s stoic and expressionless demeanour. This personality, with her heavily vain mannerisms, is no setback or negative as it simply makes her that much more enjoyable to watch; essentially carrying the series herself. As with all servants though, she is extremely loyal and displays total confidence in not only her capabilities, but that of Hakuno’s as well. \\n\r\nLastly, the final character worth mentioning – and a much welcome return – is Toosaka Rin who is the only major returning character. Though her role in Extra is reduced to the supporting role section, I personally was relieved to see her back in a Fate series with her being my favourite. Her motivation and role for joining Hakuno and Sabers journey is also left a little unexplained properly at the beginning much like all the other supporting masters and servants, but later towards the end we get some clarity regarding her role.\\n\\n\r\nNow let’s move on to what is arguably the most positive element that nearly anyone agrees on; the art and animation. If you are at all familiar with Shaft’s art style over the years then you know what you’re going to get. It true Shaft fashion the show is filled to the brim with avant-garde and extremely surreal visuals on top of the studios trademark animation quirks and tropes (i.e. head-tilts, close-ups, quick changing transitions between scenes). No moment where this was on more display than during the Wonderland-esque floor. I seriously got Madoka Magica déjà vu during these moments. On the whole, the art may not be the closest to Shafts best, but it does not detract from the overall quality of the show. The animation in battle sequences, though admittedly fewer than I would have liked, is above par despite being nothing special by Fates standards. This is perfectly shown off during the opening and is actually a thing of beauty in retrospect watching Saber show her stuff. Some people found issue with the way some of the characters were designed, most notably Saber, Rin and Shinji too, but this was fine and I just think people overreacting since they pretty much now associate ufotables designs as the norm for the Fate characters. I found no issue to bring aside from Rins attire (why sleeveless all of a sudden) and Nursery Rhyme’s color scheme being different from what I have seen.\\n\\n\r\nI’ll briefly cover the sound and music since I found little to gripe about here as well. Fates OST’s tend to opt for more thematic and epic scores when it comes to the choreographed battle sequences and to times where moments are ominous and foreboding on what is to come. Extra is no different in this department, despite not really having any outstanding music like in Zero and Unlimited Blade Works, it still manages to add a level of immersion for the viewers to get invested in what is happening. Extras dialogue is made to be delivered as if you were watching a theatrical performance of a play and that is essential what the show tries to make it set out to look like (though I don’t know if that was their intention) with the central focus coming from the exposition that accommodates more than a majority of Extras running time each episode.\\n\r\nFate/Extras opening and ending themes are both nicely used and both harmoniously go hand-in-hand with the accompanying animation sequences.\\n\\n\r\nTo conclude this review now I’ll just say that while I can agree that Fate/Extra: Last Encore is by no means anywhere close to being as good as almost any other Fate out there it is still not the worst though. That honour remains a tie between Fate/Apocrypha (because with how badly the second-half was executed) and Fate/kaleids third season (for focusing more on everyday life rather than magical battles). I think too many people felt like the show was less action packed and too dialogue heavy. While they aren’t wrong, it’s not entirely a bad thing though. For me, the pacing was Extras biggest issue. Here’s hoping that the planned sequel can improve on what the show needed.\\n\\n\r\nStory --- 7/10 --- Interesting concept for Fate, but unfortunately was too rushed in the end and many answers needed more in detail explanation.\\n\\n\r\nCharacters --- 8/10 --- Solid likable lead cast, few favourites return. Underdeveloped supporting characters however needed to be more fleshed out.\\n\\n\r\nArt & Animation --- 9/10 --- It’s Shaft after all, their outstanding surrealistic visuals are on full display.\\n\\n\r\nSound & Music --- 8/10 --- Catchy opening and ending, as well as the same orchestral and thematic style of music that has become a stable of Fates series’.\\n\\n\r\nEnjoyment --- 8/10 --- While I do wish the series did have more action, I was not upset with a more dialogue driven series since Shaft has been opting for these more often now.\\n\\n\r\nIf you made it all the way through this review, thank you for reading. UMU! Feedback is appreciated as I am considering doing more reviews in the upcoming seasons.",
            "date": "2018-04-02T22:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 276616,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4025379.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OmegaOtaku",
                "username": "OmegaOtaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=276616"
        },
        {
            "content": "The reason I'm writing this review is because of how low the rating is now (6.81 right now)\r\nI never cared about all the fate series aside from the original ones, I found fate/zero and stay night to be very good yet they were never the perfect anime despite how much effort and money were put into them yet people start comparing this one to them and that's probably the reason it has such a low rating. \r\nFate/Extra is not the same as the others because of lots of reasons, the budget is definitely low because I have never seen a shaft anime with so manyflows in art and animation as this one, the story is different and the main premise is probably the only thing that remains from the other fate series so it would be better to stop comparing and start focusing on the flows and good points of this one rather than say it's bad just because of how much was put into the others.\\n\\n\r\nWhat makes me like Fate/Extra is how different it is, Fate/Zero and Stay Night was all about fighting to get to your wish while this one was more about finding that wish, about why you exist and what is the meaning of your life, it tried to make something new and kinda succeeded in doing that. \\n\r\nYes the series does take the \"fight to proceed\" idea yet it is never about just that, it's more about the characters rather than throwing them in order to progress, with each episode in anime we get to know more and more about the characters, how their life was and what was going on in their head and if people really want to compare they would have found that the 2 main series rarely focused on anyone's stories and reasons aside from the main characters and antagonists which is why I wrote that it's wrong to compare because each one of them has it's own flaws and charms.\\n\\n\r\nI love the characters in extra, I can't talk about the MC much without spoiling or rather I can't talk much about all the other characters as well but him being EMOish is justified pretty reasonably in the last 2-3 episodes, Saber is a very good character mainly because of how different and unique she is, how she acts and encourages the MC is great which reflects how great her character is specially with how heavy her backstory was.\\n\r\nWhat I loved the most is that even the side characters have actual stories that we experience and history we get to know about, sadly this being a 10 episode anime with such low budget doesn't help the anime to completely show every character but we get to see a nice amount of them and their stories which is nice. \\n\\n\r\nThe art and the animation were bad, the worst I have seen from shaft till this day tbh which is kinda disappointing because I was excited when I knew that shaft was the one doing the anime this time, tbh that was the main reason I watched this fate anime even though I don't really care much about the alternative ones. \\n\\n\r\nThe OSTs and The opening were good but the ending song is amazing so credit to the singer.\\n\r\nThe voice actors were alright but I loved saber's voice so much tbh.\\n\\n\r\nOverall I would give this anime an 8/10 and I would have liked to see this anime more fleshed out specially since the translation of the original manga (or game) was abandoned. \\n\r\nI would recommend this to anyone whether they want a new fate alternative or anyone that wants to watch something in general.  \\n\r\nI hope the sequel gets a better budget next time because it would completely flourish the rest of the story out.",
            "date": "2018-04-02T08:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 276527,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4063361.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mezo-RPWPA",
                "username": "Mezo-RPWPA"
            },
            "url": "https://myanimelist.net/reviews.php?id=276527"
        },
        {
            "content": "Story: The fact that Shaft and the original creator chose to do an original take on the Fate/Extra story is enticing in itself for it attracted both fans of the original source material and anime only's, but also a double-edged sword in itself also, for the staff could've done better in worldbuilding and pacing. By the time of this review, when I learned it was only going to have 10 episodes, I felt robbed of a unique experience and take on the Fate franchise, as it truly felt like there could've been at least 20+ episodes to this, considering how the story is structured, andhow much room there is to develop the characters, and for Shaft to truly introduce the world of Fate/Extra to the audience, especially considering the fact that it is a mix of the source material and original work, just sayin'. \\n\\n\r\nHereunto, for the best part of it, Shaft's take on Fate is a whole new experience from the perspective of the viewer, for the psychological aspects and deep themes truly assist in achieving the goal of developing characters Shaft wants us to appreciate and be invested in. For any anime fan who wants to be invested in Fate, Last Encore is an entirely different take on the story, but not advisable as a gateway to the franchise, despite it being an original, for I think the new perspective and take can act better to people who have already seen the Deen and Ufotable entries, for they can compare and contrast, in terms of the worldbuliding, cinematography, and takes on Fate's universe and lore.\\n\\n\r\nArt: As always, Shaft never fails to deliver its standout style that they can only nail perfectly, resulting in a fresh take and view on the lore of Fate. However, it shouldn't be compared to the Deen and Ufotable entries, for the art part at least. Sure, Ufotable spoiled the audience with its bombastic animation, CGI utilization, and diverse color palette, but Shaft's take on the art for this entry is great, for the contrasting color palette helps in introducing this entry that truly leans on the psychological aspect of Fate.\\n\\n\r\nSound: It's the first Fate entry to use a male artist for the OP, in itself fresh enough to stand on its own compared to the Deen and Ufotable entry OPs, and the ED is pretty solid, coming from a great and well-known artist in Sayuri. By the time of this review, the OST has not been released yet, but the sound design is well made, considering that it aims to work with the art in delivering the emphasis on the psychological aspect of Fate, something the previous entries' soundtracks simply did not lean into, a unique on its own.\\n\\n\r\nCharacters: Being an original take on the Fate/Extra lore, and considering the already saturated and very long anime cast of the Fate franchise, Shaft truly had the potential to introduce new characters, as fans have seen with their previous works, but the 10-episode cap is a big obstacle from achieving this. In itself, the cast is pretty solid, and long-time fans of Fate can find nostalgia in the cast as expected, but can stand on their own as unique to Last Encore for how they are written and introduced in this story. I really believe having 20+ episodes can bring out the best in its cast, as it increases episode per episode like any other Fate entry, and with Shaft's credentials, could've been better than Ufotable's and Deen's take on character development, but then again, we can't have everything though. \\n\\n\r\nEnjoyment: With everyone being on even ground on Shaft's original take on Fate/Extra, I felt like I did not miss out on anything, since I did not play the games or read this novel entry, and I truly enjoyed the first 8 episodes, for everything was fresh and new, and you already know how I felt when I learned it only had 2 episodes left after that. Now, I just look forward to how Shaft will deliver on the ending, for I still believe Shaft will do a good job on concluding this, whether establishing a sense of continuity towards a possible 2nd cour/season, or something else unprecedented, that of only which Shaft can only bring out.\\n\\n\r\nOverall: Shaft's entry is a must watch for fans of the franchise who want something new from Fate, and is a distant relative of the Ufotable and Deen entries. Don't get me wrong, it's fun and compelling to see Fate's universe in a brand new perspective, but I truly believe it could've been more in everything except the visuals, direction, and sound design, as Shaft never fails to deliver good shows for audiences of all ages and otaku stereotypes. It just could've been more, as simple as that.",
            "date": "2018-03-27T19:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 275395,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6744155.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/cloudnine501",
                "username": "cloudnine501"
            },
            "url": "https://myanimelist.net/reviews.php?id=275395"
        },
        {
            "content": "Fate/Extra: Last Encore is near it's final episode.  But, if it wasn't ten episodes long I would've dropped it after episode 7.\r\nMy history with Extra goes back to when I played the game on PSP when I was in High School so I have nostalgia for the original game though I'll admit the gameplay of it is passible at best.  But, this isn't an adaptation of the game it's pseudo-sequel in a sense with mentions and allusions too the original game.\r\nThe story is confusing and hard too follow.  The Characters are flat or unlikable at best.  The music outside the openingtheme is forgettable and wallpaper.  Though the animation and backgrounds are great most of the time.  Now than let's go over my thoughts on the story.\\n\\n\r\nStory (1):\\n\r\nThis story is incredibly hard to follow and if someone goes into this series not knowing anything about Fate, I would be surprised if they didn't drop it out of confusion.  While this may have something to do with the subs I watched since an official subtitled version is currently unavailable.  But, the story is incredibly hard too follow with the lack of coherence being at it's strongest in episodes 6-7 where I had to look up a summary to understand what happened.\\n\\n\r\nArt (6):\\n\r\nAs much as I hate this anime.  The animation and backgrounds can be stunning at times.  The city lights of Shinji's floor were beautiful.  The green forests of Dan's floor were easy to get lost in.  The bizarre wonderlands of Alice's floor were fascinating.  But, even this varies in quality and whenever I looked at these backgrounds I felt like they were being wasted and I wished they were used better.  The animation varies not just from episode to episode.  But, from scene too scene where one minute Saber's sword is the size of her arm and the next it's bigger than she is.\\n\\n\r\nSound (4):\\n\r\nI would give sound a lower score if it didn't do it's job.  When there's a sad scene there is sad music.  When there's a fight scene there is exciting music.  But, the music is only used a wallpaper as in it's just there to do what it was put there to do and nothing more.  Great music should elevate a scene and making grander.  But, this music doesn't though the opening music is fantastic.\\n\\n\r\nCharacter (3):\\n\r\nThe main character is one of the most unexpressive and uninteresting character I have ever seen.  He never emotes when He's supposed too and when he does it only hatred which even than that's rare.  When someone reveals something too him his face is blank, when A child plays with him his face is blank and when he is in pain his face is blank.  His only motivation is hatred and he has no reason to continue this series after the first three episodes.  He's a borderline sociopath and we are suppose to root for him.\\n\r\nThe rest of the cast range from under-developed (Rider, Archer, Rani and Caster) or unlikable jerks (Rin, Shinji, Dan, Julius).  Keep in mind I love Fate/Extra's cast and too seem them this butchered is heartbreaking too me.\\n\\n\r\nEnjoy (2):\\n\r\nThe only reason it's not a 1 is because of the backgrounds and at times good animation.  Also, Saber's backstory along with Episode 9's 1st half actually made me smile while also making me hate the anime more.\\n\\n\r\nOverall (1, though if you round up my scores it's below 0):\\n\r\nThis is hands down one of the most confusing and heartbreaking series I have ever watched.  So much wasted potential, not beginner friendly at all and worse of all made me hate character I ounce loved and liked.  I can't wait for this series to end and depending on how it does I'll update this review.",
            "date": "2018-03-27T17:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 275378,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4911970.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Tion22",
                "username": "Tion22"
            },
            "url": "https://myanimelist.net/reviews.php?id=275378"
        },
        {
            "content": "This series, which was made by Shaft, is pretty neat for me because of reasons... Though many wouldn't understand, I think the ways Shaft made this using their \r\nunique story telling and \r\nstunning, but static, visuals \r\nmade this series stand out from the usual stuff the Fate Series had to offer, which is pretty justifiable because of the point that this is from a different story in itself. \r\nI'm pretty sure, people who are fans of the Fate Series and the Monogatari Series will like this Anime, though it might take a couple of episodes for it  to actually show that it is indeedworth watching; just like in the case of Fate Kaleid Liner Prisma Illya.\\n\\n\r\n------------------------------------------------------------------------------\\n\\n\r\nAlso, I forgot to mention (to the non Monogatari Fans) that the story telling of this series is quite abstract, meaning the timeline and the chronological order of the scenes are totally jumbled up; here's how it usually transpires :\\n\\n\r\nSomething looks like it's happening in the present -> Event that's actually in the present -> Something looks like it's happening in the present -> Event that's actually in the present -> Something looks like it's happening in the present -> Event that's actually in the present -> Something looks like it's happening in the present -> Event that's actually in the present -> The actual conclusion and stuff that's been transpiring infront of the confused viewers\\n\\n\r\nIt lacks a ton of context but atleast it makes watching the Anime fun to do (for detective game nerds like me I guess), though I guess not everybody likes these types of tropes... \\n",
            "date": "2018-03-23T00:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 274635,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Virid-Ian",
                "username": "Virid-Ian"
            },
            "url": "https://myanimelist.net/reviews.php?id=274635"
        },
        {
            "content": "This is probably the first review i've ever made. Lemme start by saying this: I'm disappointed. \r\nI was very much looking forward to this anime. The game has a cool story, but the actual gameplay is awful so i'd rather not play it if I could. So what better way to enjoy the story than through a beautiful anime, right? Wrong. This anime took what I knew of the story of Fate/Extra, and tossed it in a blender with some Shaft-ness and fanservice and let it go. \r\nStory: Almost no clue what's going on most of the time. They jump between backgrounds and settings, droprandom story elements then never mention them again. The first episode doesn't leave you wanting more, it leaves you thinking \"...What?\"\\n\\n\r\nArt: As expected of Shaft, the artwork is amazing. Beautiful character designs, gorgeous backgrounds and unnecessary head tilts. This anime is pretty, if nothing else. \\n\\n\r\nSound: It's alright. The fact that no music in particular comes to mind when I think of this show makes a point that it's very unremarkable. \\n\\n\r\nCharacter: Let's be real here. We're all here for Nero. Nero is the selling point of this show. Without Nero, the show is nothing, and this anime knows it. From her being literally the only character in the opening, to them constantly shoving her near-naked body in our faces, Nero is more of a focal point than the supposed main character. Speaking of the main character, he's so boring and one-note that it's almost funny. All he really does is keep a straight face and say \"hate\" for 23 minutes while Nero does seven backflips and screams UMU. \\n\\n\r\nEnjoyment: As you may have guessed, I didn't enjoy this show at all, so I ended up dropping it. I WANTED to like this show. It had tempted me with great visuals and one of my favorite Fate characters, but let me down with the bad story execution. Unless you told me that show does a complete 180 later on, I wouldn't bother picking it back up again. \\n\\n\r\nOverall, if you're one of those people who watches anime solely to see that one cute character you saw on social media, then maybe you'll stick to your guns and watch this. Hell, maybe you'll even enjoy it. But as someone who was looking forward to seeing how Fate/Extra played out in anime form, it's preeeetty bad.",
            "date": "2018-03-14T09:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 273801,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3964449.jpg",
                "scores": {
                    "animation": 10,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lightblade7",
                "username": "Lightblade7"
            },
            "url": "https://myanimelist.net/reviews.php?id=273801"
        },
        {
            "content": "And here we go again. Another Fate adaptation. Was I hyped? Of course, it’s Fate. If not for the story, Fate is at the very least worth watching for its amazing fight scenes. That’s what I thought till now. And then Shaft’s adaptation of Last Encore came out…\r\nStory: 5/10\r\nThis is not your regular Fate story. In this world magic is more of a technological/scientific - phenomenon. Usually not really my cup of tea, but it has a potential to be an amazing and enjoyable story if done right. \r\nThe 1st episode was confusing to say the least, but I was willing to give it thebenefit of the doubt. I mean, the 1st episode of Steins;Gate didn’t make much sense either and the show turned out to be a masterpiece. But while Steins;Gate picked up its pace rather quickly, Last Encore is still a mess after 6 episodes. \\n\\n\r\nCharacters: 4/10 \\n\\n\r\nThis is going to be painful…and not only because the characters look awful (I mean, what’s up with Rin’s design?)\u2028usually, I start caring for characters by episode 2 - 3. In case of Fate/Zero/UBW/Apocrypha (yes, I enjoyed Apocrypha) I already cared by the 2nd half of the first episode. After 6 episodes of Last Encore I still don’t give a thing about all these characters. You wanna know why?  \\n\\n\r\nThe main character is way too plain and not capable of showing any emotion (even Sieg in Apocrypha had more character and he was SUPPOSED to be plain being a homocolus and all). From time to time he says how he hates everyone, but he doesn’t show it at all, so it’s hard to believe. I have absolutely no idea why his servant even bothers with him. Speaking of... \\n\r\n\u2028Saber has potential to be a badass character with the right amount of cheerfulness. However, Shaft seems to use her only for unnecessary and obvious fan service, not giving her any character development.  \\n\\n\r\nAs for other characters…they don’t get enough screen time and don’t get any character development (till now). They each get to be an episode the most and they don’t even get the spotlight. Other Fate adaptations have proven that a servant or a master doesn’t need to be the main character to get some decent backstory and to make the viewers care for him/her. Last Encore fails miserably in that regard.  \\n\\n\r\nArt: 2/10\\n\\n\r\nBiggest disappointment of all. Simply put, the animation does not do Fate justice. AT ALL. It looks way too cheap and flat for a Fate series. While watching this show I constantly have the feeling that Last Encore is a low budget project that tries really hard to hide this fact by adding random movements and poses. Some scenes make me thing that someone put a ‘darken’ filter over them and muted the colours, other scenes just scream that the staff lacked imagination. This all is really dissappointing, since Shaft has produced some nice - looking stuff (like 3 - gatsu no Lion). \\n\\n\r\nMusic: 6/10\\n\\n\r\nNot memorable at all, but guess it’s okay - it at least isn’t annoying, unlike the characters and the animation\\n\\n\r\nAm I going to continue watching this show? Probably. Is it worth watching? Probably not",
            "date": "2018-03-13T10:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 273723,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/381339.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KuroYume-96",
                "username": "KuroYume-96"
            },
            "url": "https://myanimelist.net/reviews.php?id=273723"
        },
        {
            "content": "This is my first review and I just wanted to write this down.\r\nFirst of all, Last Encore is NOT the gateway into the Fate Series.\r\nIt has a unique backstory and only glances on core terminology.\r\nSecond, I've seen a lot of people complaining about how \"they're butchering the story (from the PSP game it's based of)\", but Shaft already said It was an original script based on the game.\r\nAnd I think the way they are going is good and filled with references to those who have played It.\r\nThe art style differs a lot from other Fate anime, but that is how Arco Wada (the game's designer)drew them in the first place. (Honestly, I found this Rin design cuter)\\n\\n\r\nThe main character is extremely bland and does not have any personality . But [spoiler reasons]. Other masters and servants have been reimagined, and that did weirded me at first. But they gave reasons, and I can't complain.\\n\\n\r\nSo, to sum It all up. The series is good with knowledge, but hard to catch by itself.\\n\r\nIf you want to watch it you can, but I suggest watching other Fate anime first and maybe even play the PSP game if you want to understand.",
            "date": "2018-03-04T20:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 273057,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4521516.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Nexidal",
                "username": "Nexidal"
            },
            "url": "https://myanimelist.net/reviews.php?id=273057"
        },
        {
            "content": "Not every Fate series is for everyone - Apocrypha is a pretty contentious subject in particular (I liked it for what it was), and Prisma Illya, at least the anime (manga was great!) is hit or miss too depending on your tolerance for relentless loli pandering and mostly terrible fights with a few really good ones. However, despite my not necessarily liking all of them, they still ended up feeling like Fate and having at least something likable about them, including Deen's original FSN.\r\nLast Encore... doesn't. Outside of a really nice opening it's just lacking in anything that makes Fate... Fate.\r\nEdge of your seat fights?Haha no, they're all genuine garbage, poorly animated with no sense of weight or fluidity - even the motion is generally pretty jerky. Definite'y don't expect ANYTHING like UBW's Ufotable animation or Apocrypha's over the top and at times impressionistic style - these are bare-bones, low-quality fights that fail on pretty much every level possible. Uninteresting on a strategic or tactical level and not even good at being eye candy.\\n\\n\r\nCharacters? Well... it has Red Saber. Everyone likes Red Saber, right? I mean, we all loved her in the Rome part of FGO, right? All kidding aside, I like Nero just fine, actually probably among my favorite characters of the Extra/Extella setting in general, but she is the ONLY character here who even makes a token attempt to appear as an actual character. Everyone else is a cardboard cutout at best. It's hard to say more without spoilers, will just say that the studio clearly had no idea what the hell it was doing with most of them and barely even tried with many.\\n\\n\r\nEmotional scenes? Drained of all weight when you don't give a damn about anyone in them or actively want them all to die, and the main character is probably the worst of them all, somehow managing to drop below 1 dimension to be the first ever 0 dimensional character in anime, actively siphoning the drama from anything meaningful(?) happening! Truly a feat to be remembered. People can complain about Sieg from Apocrypha all they want, but at least he was surrounded by more interesting people - Hakuno is not, and he's FAR worse than Sieg ever was.\\n\\n\r\nDesigns? Eh. I don't mind the Extra style though it's not my favorite, and the anime doesn't ruin them TOO horribly - but they're still not great here and the janky animation doesn't do them any favors. Extella got away with lower quality models by dint of what it was, this anime does way too many close-ups to BS its way through.\\n\\n\r\nAnimation? Boy friggin' howdy are you out of luck. Shaft apparently decided to Monogatari everything, so half the damn characters strike random poses constantly, like a crappy budget Jojo that wants to be Monogatari and fails at even that. Scene animations are abrupt and unexplained. Everyone either stands 100% still for the entire conversation without breathing once, or is constantly contorting in ever more improbably ways for no apparent reason. Already touched on fights, but the animation isn't any less crap there, energy attacks in particular look like garbage, and as short as the fights are they STILL suffer from clearly reused animation.\\n\\n\r\nDialogue? Hoo buddy. I can't COMPLETELY blame Shaft for this one, the Extra setting suffers from a terminal overdose of stupid, unnecessary terminology on a level that puts the rest of Fate to shame, but Shaft's archetypal pseudo-philosophical mumbo-jumbo adds an extra layer of obfuscation to ensure no one has any idea what the hell is going on. Sort of like my last sentence, but add half a dozen references to concepts that are never explained, probably toss in a Jesus allegory or two, couch it in underwhelming voice acting, and then throw in an arbitrary reference to something from another Fate series to top things off.\\n\\n\r\nThe anime was clearly rushed - and while it was stuck explaining one of Fate's more unnecessarily complex settings in short order, that doesn't excuse the atrocious pacing.\\n\\n\r\nAs a whole I find little to no redeeming quality in this adaptation - it's all the worst aspects of Fate made worse by the worst of Shaft, without any of the good points of either side. I'd go so far as to say that it is by far the worst Fate anime adaptation currently and not really even worth checking out - though if you do, the 3 episode rule works well here, aside from an intriguing first ep, 2 and 3 are highly indicative of the rest.",
            "date": "2019-04-26T03:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 307173,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4936204.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Eleiryn",
                "username": "Eleiryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=307173"
        },
        {
            "content": "Animation:\r\nGood! the shade and light filters are very beautiful, highlight the trait, the battles are very lively, I just missed the more elaborate choreographies.\r\nNote 7/10.\r\nDirection:\r\nMedian! it goes well with the feeling in some scenes and is very bad in others, at least it is good in the main scenes, and as a good director of Shaft, it is full of visual mannerisms.\r\nNote 6/10.\r\nScript:\r\nDisputable! The story is so confused and vague that several explanations are not objective at all, what leaves things a little forced, besides the fact that history in general has nothing d +. What draws attention is the heroine Nero, an extremely sympatheticand charismatic character, with their moments of reflection and criticism, I loved the character, she carried the anime for me.\\n\r\nNote 6/10.\\n\\n\r\nSoundtrack:\\n\r\nMedian! not bad, does his job well, but it is not remarkable and does not attract attention.\\n\r\nNote 5/10.\\n\\n\r\nEntertainment:\\n\r\nMedium! The confused story takes a bit of the \"fun\", and away to Nero, it does not have very charismatic characters, the action scenes are not very exciting either, there must be people who have fun with it, but in common sense it was a lot of fun.\\n\r\nNote 5/10.\\n\\n\r\nConclusion:\\n\r\nIt is a very confused anime with very vague concepts, a medium direction in order to arrest the public, a beautiful and well-made animation and a wonderful heroine.\\n\r\nI recommend it to people who like crazy stories and Nero fans.\\n\r\nFinal note 6/10.",
            "date": "2019-02-17T14:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 301887,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5057817.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/haadouukeen",
                "username": "haadouukeen"
            },
            "url": "https://myanimelist.net/reviews.php?id=301887"
        },
        {
            "content": "Blizzard: Oh shit we messed up\r\nBethesda: Lol I'll show you how to make your fan base hate you\r\nShaft Studios: Hold my beer\r\nForeal tho, why do you guys keep making the fate series worse and worse? Like do you guys really have nothing better to do than make another pile of junk? Don't get me wrong. First 2 Fate series were absolutely amazing, then after that went all down hill. Pls stop beating up the dead horse. Leave it to die and don't make another horrible spinoff/money milking machine/adaption.\r\nGetting into the actual anime itself. Solid fight animation (for the most part). But I'm getting a lotof the Bakemonogatari vibes from cut scenes when people are talking/walking. Stop trying to be another god damn 'popular' series and just do what you guys did with the first Fate series. Don't try to copy another series for the love of god. (Yes I'm well aware same studio as Bakemonogatari with fate extra).\\n\\n\\n\r\nA little hard to complain about next thing, since it involves a spoiler but let's just say lolis go poof here. And clearly the studio doesn't understand the community LOL\\n\\n\r\nHere's a summary of each episode. Episode 1 : chit chat for 20 mins, last min go find new servant/master. Episode 2: chit chat for 19 mins, 1.5 mins of fight, finishes off with 1 hit kill last 30 seconds. Rinse and repeat.\\n\\n\r\nOverall I would not recommend if you think changing studios will make the series great again. Ya might as well skip it and go watch something else. Characters are bland. Fight scenes are average. Just flashy but nothing special. Music is ok. Don't make Fate series a fan service anime (or attempt). Did not enjoy it overall, this anime is basically a Fate series x Bakemonogatari mashup",
            "date": "2018-12-03T15:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 295216,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/510123.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Lexmin",
                "username": "Lexmin"
            },
            "url": "https://myanimelist.net/reviews.php?id=295216"
        },
        {
            "content": "Fate/Extra:Last Encore is a sequel story of the original game in a different universe.\r\nI personally enjoyed the show quite a lot and I think studio  SHAFT handled it very nicely. Of course,there were some issues,but I generally think it was great. The appearance of our beautiful empress is something not to be missed,so enjoy the show!\r\nThe art was brilliant and I loved the fact that it was based on the original game's art style by artist Wada Arco. SHAFT's aesthetic is so unique and it's great that they brought elements from some of their previous works like Madoka Magica's nightmare fuel or the famousMonogatari series' bizarre way of portraying the characters and showing their inner state at given moments. I was quite fond of the soundtrack since it was matching to the show's intends. \\n\\n\r\nStory-wise it might be quite confusing for those that are not familiar with Fate/Extra's original game or Fate/ series in general as it proves to be newbie-unfriendly,so I highly recommend it that this isn't your starting point with the franchise. Apparently the anime adaptation is a sequel to the original game and it takes place approximately 1000 years after the events of its prequel. Due to having to cut 2 episodes off of the anime, I think some details weren't explained properly in the beginning,which could have arose some misunderstandings,but I personally don't find it to be a problem,because the proceeding of the story left a bigger impression in my mind.I find it depressing that they had to cut the anime so suddenly at episode 10 and proceed with it 3 months later,but nevertheless it was still enjoyable and deserves a better rate than the one it currently has.\\n\\n\r\nI found it quite intriguing that the studio chose to concentrate mainly on Hakuno,Saber and Rin,not because the rest of the characters were redundant in the general Fate/Extra universe,but because the main trio of the adaptation were the leading point in the sequel. I actually thought that Hakuno was going to be the typical plain Fate main protagonist, but don't let this fool you! He developed splendidly throughout the story and became one of my personal favorites,although I thought of him as quite the nuisance in the beginning. What I felt lacking was the absence of some further character progression with some of the characters and therefore felt kind of rushed,but I already mentioned what the reason behind it might be.Still,they could've added an episode or so to refine it a bit. Despite that,the rest of it was fine.\\n\\n\r\nOverall,I think Fate/Extra : Last Encore is something not to missed as it is purely great and a candy for the eye,despite it having a few flaws. Intriguing story,decent characters,magnificent visuals and great soundtrack are what make the whole show!Hope you enjoy the show as much as I did. I highly hope that SHAFT would be interested in either animating Fate/Extra CCC thoroughly, or just provide us with a backstory anime to Last Encore to make the image of the premise more clear.\\n\\n\r\nSide note:\\n\r\n I somehow regret that many dropped it too suddenly before even reaching the middle of the anime and hence caused its bad score and missed a whole bunch of content,which actually explains most of their wonders.One of  the things I found to have put the majority of people off watching it is that SHAFT didn't make it a 100% faithful adaptation to the game,even though it was intentional and the original writer of the Fate/series clearly stated in the beginning that this would be a different story,so it can bring new content to both veterans and newbies. Another reason for the lack of interest is that this Fate in particular was different from the rest in terms of art,story,setting and way of conveying the information,which I don't view as negative,but instead as a nice moment of diversity. I don't see the need for each Fate to be the same as the other and I'm tired of this stereotype regarding the franchise that it should be mandatory for it to contain \"epic battle scenes\" or be animated by ufotable, because the charm of each series would vanish if that were to happen.\\n",
            "date": "2018-08-11T15:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 286216,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/aleks1401",
                "username": "aleks1401"
            },
            "url": "https://myanimelist.net/reviews.php?id=286216"
        },
        {
            "content": "In terms of the fate series, this is pretty moderate, sure there's better, sure there's worse. Another male historical icon has been converted to, ahem, ~a woman~, which if you watch any of the fate series and are complaining about this fact, you sir are watching the wrong kind of medium. And if you wanted more Tohsaka, you'll definitely be satisfied, because she's relevant for the plot, but if you are just here for Tohsaka, and we know some of you will be here for those juicy thighs, you will probably just want to look up more fan art of her. Fate/extra last encore islike the mashed potatoes of the fate series, it's something good to eat anytime, but it's not special enough to stand out on its own.",
            "date": "2018-08-04T20:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 285598,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7308250.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lemony_Crisket",
                "username": "Lemony_Crisket"
            },
            "url": "https://myanimelist.net/reviews.php?id=285598"
        },
        {
            "content": "I will keep this brief. This is shaft we are talking about. The monogatari vibes are insane. But because it is shaft, the show has a lot of... complicated scenes. Rapid jump cuts, evocative angles that are suppose to carry the emotion instead the dialogue. But debatable this is a harder to follow anime than monogatari. The monogatari series has a lot of quick shots of statements to help illustrate thoughts. That aside, again because it is studio Shaft, the animation is superb, the characters can look vibrant, or menacing when needed. If you can follow the story direction, it is a great story. Astory showing multiple viewpoints of how to make the best of a bad situation, or to make nothing of it at all. But given this is marketed for everyone, I marked down the story and character because the sort of way of presenting the story can lead to confusion. overall I liked the show fine. It is another fate series well done, but if you came here expecting something more like Ufotable's works and nothing different, you WILL be disappointed.",
            "date": "2018-07-25T01:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 284733,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6884572.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dogemy",
                "username": "Dogemy"
            },
            "url": "https://myanimelist.net/reviews.php?id=284733"
        },
        {
            "content": "I love the Fate/ Series. Even when a given show or game has been bad, I've usually been able to find an objectively redeeming part to it that I can say made the experience worthwhile. Unfortunately, Fate/Extra: Last Encore didn't really have anything like that. If you look at the art, in still frames it could look quite captivating, but when you watch the animation, you can see so many cut corners and lost opportunities. If you listen to the music, it was okay... but that's it. It didn't feel like it was tailored to the show like the music in other Fate/ series did.The story was preachy and repetitive with too much of an attempt at being philosophical, but without the quality to back it up. At least Unlimited Blade Works and Apocrypha were able to push their philosophies without needing to tell you every episode or two what they were trying to get across; those shows would show you what they wanted to say more often than tell you, but Last Encore is too focused on telling you \"this is the theme\", likely due to the fact there are only 10 Episodes so far. When the second cour/season of it comes out (Fate/Extra: Last Encore - Irusterias Tendouron), I hope the writers start using less verbal statements about the theme and instead allow the artists and animators to give more visual cues. Speaking of the art, while I commented on the overall appearance earlier, WHEN the show used artistic symbolism, as seldom as it did, it was often done to great effect. I wish to see more of that going forward, but so far have no reason to expect such. Finally... the Characters.\\n\\n\r\nOur protagonist is bland. Shirou and Sieg at least had core traits going for them and Sieg was about as blank of a slate you could get before creating a brain-dead character. Hakuno, however, has no personality, no motive, and no desires... you know, aside from \"I want to kill because I am angry at everyone who is alive for no reason other than the fact they are alive.\" I can understand in the first couple of episodes that he wasn't sure who he wanted to be or what he wanted to do, but after 10 episodes? He has reached the point where he needed to get some sort of will of his own. He's supposed to be the \"hero\", but really the protagonist keeping everything moving has been Saber.\\n\r\nSaber, our obligatory genderbent knight-king, is probably the most well-done character in this show, and this is coming from someone who hates all the Artoria clones the franchise has made and is irrationally in love with Tosaka Rin. Saber has a wish and a reason to fight. She leads the plot forward and has very real desires and flaws. She is the closest we get to a fully-developed character... but if you look at her, she's really not that well fleshed-out. Like everything else about the show, her character is very much told, and very rarely shown. She is often explained in interesting ways, such as the clip show about her true name, which happened to be one of the best writing moments in the show... yet when we hear about her, it's only in info dumps. When we see who she is, it's in only two lights. Light 1: She is a fighter constantly willing to rush head-first into a struggle if it means furthering her goals. Light 2: She is a child who wants what she wants and will not accept what anybody else has to say about the matter. You can see the overlap and the laziness thereof. She has interesting moments, but they don't warrant her being given the same love as other beloved female characters within the franchise's animes.\\n\r\nTosaka Rin, a character who can only be messed up by someone who has little writing experience, is probably one of the most bland characters in the show right after the main character himself. She doesn't do anything aside from set in motion a scheme that she doesn't do anything about for the majority of the episodes and when she does \"do something\", the extent of her action is saying, basically, \"go through this door and get to the center area where you'll have to make a tough decision because neither me nor Rani could do what we were supposed to.\"\\n\r\nRani, the second most interesting character: She is literally there to help explain Rin's actions/inaction (depending on how you look at it). She's interesting solely because they don't tell you everything you want to know about her right away, and they give you some mystery befitting her attempt at a personality. I repeat, I love Rin as my favorite girl in the franchise. With my bias towards Rin, this flat 2-dimensional character should not be more likable and interesting than the character I went into this show already prepared to adore... but she is. It just shows how poorly characters were handled. Rani did have the potential to be a great character, just as all the characters in this did, but those involved in this project were either too inexperienced or too disinterested to get this show done right.\\n\\n\r\nStill, despite all my objections with the show, it's not a \"bad\" show. It's not good by any stretch, but it's definitely an entertaining show if you can look past its many, MANY flaws, much like Sword Art Online in that respect. I enjoyed this show far more than I should have, but that's mostly because Saber, Rani, and a side character named Hakuno (not the main character) all pulled their weight in making the show palatable. Sure, I wish it was better executed and see no reason why it was done as sloppily as it was, but it just goes to show UFOtable is better equipped for this franchise than Shaft is, which is a disappointment, but not totally unexpected.",
            "date": "2018-07-15T23:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 284083,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Briry",
                "username": "Briry"
            },
            "url": "https://myanimelist.net/reviews.php?id=284083"
        },
        {
            "content": "Yet another entry of the evergrowing list of anime from the fate franchise, I was finally able to watch it on netflix just a few days ago. If you are completely new to the Fate series then be aware that there are things within this show that you'll have to piece together in order to understand. As for Fate fans, this show will be pretty enjoyable. I would recommend Fate/Extra: Last Encore to people already familiar with Fate. \r\nThe story is pretty decent, although it is pretty obvious that it is based off a videogame given how linear it is. What I mean by this is that each encounter with a servant and master all follow the same structure with there being only one master on each floor that the main characters have to beat in order to move on to the next floor, just like in a video game where you need to beat the boss in order to move on to the next level. This structure isn't necessarily bad but it does give the show a somewhat predictable course as it doesn't really diversify all that much. However, the story is rather still enjoyable. The main issue with the story though is just how confusing it can be, even to people already familiar with fate. There isn't enough explanation for things, even with all the exposition given. There were times while watching where I stopped to go look at the type-moon wiki just to clarify the details of the story. Even then, I'm still unsure about some parts of it. So be aware that you'll need to pay attention to the details given and be prepared to be confused. Another issue is just how easily some of the servants are defeated, not once did I feel like the main characters were going to lose or were going to suffer any major consequence. \\n\\n\r\n The art and animation of this show is great, which is no surprise given how this is made by Studio Shaft.  The vibrant colors and the slight shading give this show a crisp aesthetic, making it a very good source of eye candy.\\n\\n\r\n The soundtrack is just fine, it doesn't really stand out and isn't very memorable. That isn't to say it's terrible, it's enjoyable to listen to whenever it plays. My favorite song from the show is definitely the ending song, which is augmented by beautiful visuals.\\n\\n\r\nThe characters of this show are what redeems it the most, a good portion of them are at least okay. If the story is going to be structured in a linear way then having good characters on each floor would be essential to whether or not that structure would work and fortunately is does manage. The characters that aren't very developed much are Rin Tohsaka and Rani, who are given the least amount of characterization out of them all. Rin mainly serves as a source of exposition and aids Hakuno and Saber a little bit but that's really it. She maintains her personality from Fate/Stay Night but that isn't very apparent given her lack of development. Nani is worse off since she is pretty emotionless and almost nothing is revealed about her character at all. Go to the type-moon wiki and you'll see how she really is a fleshed-out character but I guess that didn't carry over into the anime which is unfortunate. Another poor character is Rider as not much is revealed about her other than her having a pirate-like personality. All the other characters show at least some personality and conflict. A good example is surprisingly Shinji Matou, the most unlikable character from Fate/Stay Night, who manages to come off as sympathetic. He doesn't like having to kill people in the Moon Holy Grail War and wants to live peacefully but is also pretty arrogant. Moving on, the main character Hakuno is just okay. He's kind of bland to be honest but this is mended by his conflict regarding what he is and how he views himself and the world around him for it. He tries to deny what he is initially but eventually decides to not allow that to define him. The main problem with him is his constant pondering regarding who he is which feels cliche very typical with Fate and the anime gives little reason for us to care about this question or him for that matter. However, the character that makes this anime for me is Saber. It seems like no matter how mediocre any fate anime can be, the Sabers from those shows are always great and Fate/Extra's Saber is no exception. She is very open, accepting yet prideful and flamboyant. She has the grace of Saber from Fate/Zero and Stay Night and the charm and charisma of Rider from Fate/Zero. I think anyone who watches this show will find it difficult not to like her. Her only issue is just how overpowered she is which diminishes the tension of the story, but it's still great to watch her character as she is given the most development. \\n\\n\r\n  Overall, this show is flawed yet still enjoyable, especially for anyone who's a fan of Fate. I'd recommend this to people already familiar with Fate; to those who haven't watching anything from Fate, don't start here.",
            "date": "2018-07-05T21:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 283090,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4891878.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/COSMIC_SAIYAN",
                "username": "COSMIC_SAIYAN"
            },
            "url": "https://myanimelist.net/reviews.php?id=283090"
        },
        {
            "content": "\"Fate extra last encore is made so it can be viewed by newcomers and old fans alike\" - says the lying mushroom.\r\nSo Nasu lied again, in other words bears still shit in the woods. This is the guy who said that the tsukihime remake is still undergoing while playing bloodborne while getting others to write for him. Nasu's word hold as much weight as toilet paper, and you can use it as such. But there is a more important issue we need to tackle, and that is why does this exist?\r\nAs a long term fate franchise viewer, I am up to date with the mostrecent patches and nerfs of the franchise. So I have a question, why make another alternate timeline for FE, especially when it is obviously getting pruned?\\n\\n\r\nYes, FELE is a pruning event, 990 years in the future, humanity near extinct, hakunon lost to twice. For all extent and purpose, this is a pruning event. You aren't going to continue this timeline, TM, and you know it.\\n\\n\r\nThe official timeline is, FE -> CCC -> extella (roughly, even though they technically are still separate timelines), FELE fits none of these. Hell Twice is nicknamed 2030, not 3020.\\n\\n\r\nSo, the anime in addition to being impossible to understand for newcomers, it is also fanfic for FE. It reuses everything from FE, and brings nothing new.\\n\\n\r\nWhy, WHY DON'T YOU JUST ANIMATE FE then? or Extella/zero (ie. FE under a different name)\\n\\n\r\nWHY, what is the purpose of this show!?\\n\\n\r\nI have no problem with TM reusing old characters and setting, FGO CCC event did that, but hey at least CCC event still provided some new lore and setting, it is not 100% reliant on CCC (maybe 80%), or when rasputin dug up Kirei's corpse, at least we got rasputin from that, and rasputin interaction was new.\\n\\n\r\nWhat is FELE bringing? nothing. You can't watch this without knowing deeply about FE, but if you know FE, why watch this show instead of the actual continuation of the timeline?\\n\\n\r\nIn short, official TM fanfic (as canon as carnival phantasm), no need to watch, just go play FE.",
            "date": "2018-04-26T05:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 279045,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3688861.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ap1001",
                "username": "ap1001"
            },
            "url": "https://myanimelist.net/reviews.php?id=279045"
        },
        {
            "content": "At the time of writing this review, there is a trailer making the rounds online for the upcoming film Christopher Robin in which a CG Winnie the Pooh talks to Ewan McGregor in the instantly recognisable voice of Jim Cummings. To hear this voice, which has become so ubiquitous through Disney as to be permanently associated with the character, coming from the mouth of a CG teddy bear in live action is both deeply nostalgic and unspeakably confusing. The effects of seeing the Fate franchise moved into SHAFTland are not quite so dramatic, but comparably bizarre.\r\nSHAFT are a studio of limited gifts. Their works are instantly recognisable,and although their style is undoubtedly their own, it teeters on the verge of predictability after seeing two or three anime filled with the same abstract imagery and sharp colours; meandering monologues and jarring close-ups; shiny-skinned and scantily-clad girls; characters who tilt their heads back; and the myriad other tells that alert informed viewers that they are watching another SHAFT production. Whilst this is an unmistakable asset to an anime whose themes and characters accord with the SHAFTian style, such as Puella Magi Madoka Magica, it is liable to distract and irritate in other circumstances.\\n\\n\r\nThankfully, the opaque chuunibyou babble that characterises all of Kinoko Nasu's artistic output dovetails nicely with SHAFT's predilection for directionless talking head monologues delivered either in ironic deadpan or with ironic pep. This lends a certain lightness to Fate/EXTRA Last Encore's inevitable rhapsodic elaborations upon the, uh, Moon Cell (?), which by ufotable's trusty and exquisitely detailed pen may have been treated with grim earnestness. Wait, is this a good thing?\\n\\n\r\nPerhaps it doesn't matter. Despite an excruciatingly SHAFTian first episode in which protagonist Hakuno Kishinami is introduced as a student in an virtual reality institution apparently modelled off Madoka Kaname's middle school—an identical glass-walled design is used in both anime, so we can only assume the programmers were big Madoka fans—Fate/EXTRA Last Encore turns out to be at least as entertaining as the Monogatari series and less time-consuming. Much of this entertainment is admittedly thanks to the gender-swapped Nero Claudius, who is as likeable a Saberface as Type-Moon have created; apparently written under the reasonable assumption that nothing Fate-related will sell without an Artoria clone attached, Fate/EXTRA Last Encore truly goes the distance in its reliance upon its ostentatious and proud heroine to carry the anime on charisma alone.\\n\\n\r\nCan SHAFT be blamed for their emphasis on Nero? Given the willingness of masochists worldwide to endure endless Monogatari iterations on the promise of more Senjougahara content, the allure of a charismatic female babbler appears to be a winning strategy for the studio. It is undeniable: the quality of Fate/EXTRA Last Encore is directly proportional to the screen-time and dialogue allotted to Nero, hence the nigh unwatchable first episode in which she is absent. She preens, she proclaims, she proselytises. She says 'umu!', which is attractively declarative. She has gigantic breasts and knee-high golden armoured boots with stupendous heels.\\n\\n\r\nUmu! This anime has characters. Besides Nero! It has characters. A few of them are even familiar to us. Rin Tohsaka plays a supporting role as an amateur thigh boots model. I am sure this role will prove satisfactory to Tohsaka's ravenous enthusiast community, which perdures as resolutely as Saber's. We also have small appearances by Shinji and Sakura Matou‚ the former of whom is as characteristically unsympathetic as his ordinary iteration, but with added head tilt. The rest of the cast is composed of new characters, including the requisite heroic spirits. SHAFT takes advantage of the freedom that the virtual reality setting provides by using the environment occupied by the spirit as part of their set piece e.g. Robin Hood appears in a forest area.\\n\\n\r\nThese new characters inflate the cast, but unlike earlier Fate adaptations like Fate/Zero and Fate/Apocrypha, the focus of Fate/EXTRA Last Encore is quite narrowly on our protagonists, forgoing a broader view of all the Holy Grail War participants. Whereas those anime conveyed the impression that the various combatants were in equal danger, with no overwhelming preference shown towards any character, Hakuno and Nero's enemies are predominantly presented as antagonists, and they receive limited characterisation before being dispatched. On the one hand, this makes the show more predictable; but it also proves more economical given the episode count of ten, and it's hard to argue with this approach when Nero is clearly the central driver of the plot, urging the unmotivated Hakuno to continue his fight.\\n\\n\r\nUmu! This anime has a plot. Besides Nero! It has a plot. After unexpectedly summoning UmU, Hakuno discovers that he is the first Master to contract a Servant in this ambivalently apocalyptic virtual reality future world for a thousand years; however, he has lost his memory of everything before his last moments at school, making him effectively a brainless magic meat puppet. With little else to do besides study Nero's breasts in the VR thermae (unintentionally satirising the otaku lifestyle more ferociously than any of those tired light novel adaptations with otaku protagonists), he successively traverses the computer generated environments of the moon machine reality's 'strata', including a city, a forest and a ghostly dreamland. On each stratum, he engages in the standard combat between Masters that is the hallmark of Fate. As such, the other Masters are fought in a discrete and consecutive fashion rather than in a free-for-all.\\n\\n\r\nUmu! So far so simple. The computer generated nature of these strata is actually the point we should emphasise, because it permits SHAFT to express their incomprehensible visual style to its most fully abstract expression in sharp congruity with the comparably incomprehensible dialogue. Altogether, this produces a mental effect unprecedented in anime history or phenomenology, which I would metaphorically describe as the gradual transformation of the brain into fluffy fresh cotton candy. I touched the Swirl of the Root and, unable to handle the truth of the universe, I ceased to exist as a continuous consciousness. I have rejoined the Akashic Records and my physical shell hosts but sugary sweet pink happy fluff created by my vestigial organs as a hopeless immune response to the mental onslaught of Fate/EXTRA Last Encore.\\n\\n\r\nUmu! Okay, I am back. I cannot tell if Fate/EXTRA Last Encore is a good anime. I believe I enjoy it unironically on the basis that it was probably produced ironically; but because I cannot verify this, I also harbour a suspicion that I may be inappropriately enjoying an autistic man's severely disturbed attempt to contrive 'human drama'. Actually, on second thought, this describes at least 30% of my experiences with any media involving Type-Moon and SHAFT individually, so it follows that overlap between the two would produce this outcome. There is no possibility of escape: this anime must be accepted.\\n\\n\r\nUmu! Let's begin again: I cannot tell if Fate/EXTRA Last Encore is an anime that expresses a capacity to be enjoyed by a wide audience, but it will probably be appreciated by anybody who actually wants to watch it. Yorokobe, shounen.",
            "date": "2018-04-21T00:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 278626,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3571629.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RakiRaki",
                "username": "RakiRaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=278626"
        },
        {
            "content": "This anime is not the best fate anime and it isn't the worst either. It's just a boring anime. Let me give you a background of myself before you start judging. I have watched all the fate anime, play fgo, read the visual novels, and even played fate extra. That still didn't make me biased enough to blindly like this anime. Let me get the good points out of the way because it's only the art and the sound. \r\nThe art was amazing and I could tell who did it as soon as I saw the characters move. The guy from bakemonogatari. The mannerisms ofhis character and the backgrounds of his scenes are so distinct that I could tell they the people that had a part in bakemonogatari also had a part in this anime. That turned out to be one of the one problems even though I was initially excited, but I'll get into that later.\\n\\n\r\nThe sound was pretty good. I honestly have no qualms about the sound track at all. It was appropriate for the scenes and nothing seemed out of place. I even added a few songs to my playlist, including the op and ed.\\n\\n\r\nOk now we can talk about the bad stuff.So I watched three anime this season. They were Overlord,Fate Extra Last Encore , and Darling in the Franxx which is still going on. This was the worst out of the three. Why you ask? The show was boring. The first episode had me hyped up for the rest of the season and I could tell that they took some artistic liberties, but I was ok with that. The anime is not fateful to the game. It is not a problem I am just stating a fact. Just because the anime and the game have the same characters does not mean that the anime is fateful to the game. Hell they even changed some of the character dynamics between a master and servant. So it is safe to say that the anime wanted to be its own thing and wanted to distance itself from the game. Which I can kind of understand because the game feels like a visual novel with nothing but dialogue.  Ok, so I can see that I am on a rant so I will try to consolidate the problems into two major problems. These two major problems being pacing and character development.\\n\\n\r\nSo let us start off with pacing. You remember how I said that it was a bad that the people that worked on bakemonogatari, also worked on this? Well this is why. The pacing was god awful. So this is the structure of the anime. Frist episode introudtion, 2-3 Frist Servant, 4-5, Second Servant, 6-7, Third Servant, 8-9 Fourth Servant,  and 10 episode is conclusion. Now this structure doesn't seem bad and you know considering what they were working with, it seems like the best way to do it. But you want to know why the first episode was the best out of the series? It had the best blend of action and dialogue. After that it's just philosophical dialogue for like 18 minutes and then action for like 1.  If you have seen bakemonogatari then you know what I'm talking about. They could turn a discussion about drinking water into a 5 minute philosophical discussion. Now that works in bakemonogatari, but not in fate. They throw in some exposition here and there, but most of the time I'm just zoning out. The fight scenes were good, but they ended so quickly that the 1 1/2 episode build up to it wasn't even worth it. The next problem is the character development.\\n\\n\r\nNow I will start off by saying I like Nero. I think she is cute and better than Saber. But I flipped a table when I saw that umu counter. I have no idea why the translators did that,but it honestly pissed me off seeing that umu counter in the uppper left counter. I will admit that the one episode they had for Nero's character development was fine. It wasn't the best, but it was the best part of episode that it appeared in. So over the course of the anime, Nero does not develop because she's basically a completed character. So who do we look to for character development? The main character Hakuno. In the game Hakuno is a self insert character. You pick his choices and his name, so he's a blank slate. They could have done anything with his character and no one would have batted an eye, but they didn't. I would dare say that he is the worst protagonist in the entire fate series. I hate Shriou and Sieg, but he is the worst. Does he actually change as a character? Yes, but it's near the very end of the anime. See the problem with the development is that he has discussions with Nero and through these discussions and battles, he grows as a character. But for some reason, he still seems like the same character as when he started. I honestly don't know they did that. He clearly states his motives and becomes determined, but he still seems like an underdeveloped character. Fooly Cooly an anime with only 6 episodes, I repeat 6 EPISODES did better with character development than this anime. I think the main problem is that character is being dragged by the plot and he only ever makes 2 real choices in the entire anime without the input from others.\\n\\n\r\nSo why did I mention Overlord 2 and Darling in the Franxx? Darling in the Franxx started off as a meme for me, but 13 episodes in and I'm still engaged because of how good the characters are. Hell even the character in that anime has inner monologues, but there only a few seconds and now 90% of the episode. Overlord 2 has mostly action, but once again that setting and story are so interesting that I never felt bored watching it. Well I read the books as well  so there is a little bias.\\n\\n\r\nShould they have followed the source material? Yes and no. They should have followed the format and setting of the game. Fill in the grinding with whatever they want. Would that have made the anime better? I don't know, it depends on their execution.  Some of the changes like the character dynamics I liked, but some changes made no sense or had no bearing on the plot at all. So it made we wonder why they made those changes if they never did anything with them.\\n\\n\r\nOnce again the anime is not bad nor is it good. Fate apocrypha was so bad that I stopped at episode 23. But it was still better than this anime in almost every way, except for the sound and art. \\n\\n\r\nP.S: Sorry for bad grammar and lack of focus.",
            "date": "2018-04-08T20:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 277477,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2023485.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 3,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/scaley61",
                "username": "scaley61"
            },
            "url": "https://myanimelist.net/reviews.php?id=277477"
        }
    ],
    [
        {
            "content": "I've only watched 5 episodes but this is what I've gathered thus far. \r\nIf you've played the Fate Extra games, then... don't expect that. The characters and the designs are from the first Extra but the setting is an AU. Although it also seems as though the Moon Cell Holy Grail War may have occurred before the setting of this anime. So get ready to be introduced to a different virtual reality, some kind of restart? I'm not 100% sure yet. \r\nAlso, I would like to add that Saber (Nero) uses Imperial Privilege which is a skill that she has in FGO (and I donot believe she has that skill in the game).\\n\\n\r\nWhat I love about this series so far are the characters. Nero especially. Nero has this charisma about her which shines in the animation. I actually played Fate Extella recently and I had mixed feelings about her in that game, but I'm loving her in this. Shinji isn't too bad in this either. And Twice looks so good. \\n\\n\r\nIt's hard to form any real opinions with 5 episodes, but I'm enjoying it thus far and will recommend this to other Fate fans. I think it'll be good for non-Fate fans as well, as the setting is different than the main plotline.",
            "date": "2018-03-21T04:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 274439,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1271505.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tsubamexgaeshi",
                "username": "tsubamexgaeshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=274439"
        },
        {
            "content": "***THIS REVIEW CONTAINS SPOILERS***\r\nYou thought Apocrypha was bad? You thought Sieg was a bland character? You thought Apocrypha's story wasn't interesting? You thought Darnic and Vlat Tepes were pointless? Well, Fate/Extra: Last Encore is here to set a new standard.\r\nThe premise is completely different from your standard Fate stuff. Our story, or lack thereof, is set in a virtual world where a super computer chooses 128 masters who are pitted against each other in order to ascend and reach the 7th stratum, whatever the hell that is. Our hero,\r\nHakuno Kishinami, after somehow surviving multiple knife stabs in the back, gets chosen as a 129th masterand alongside his servant Saber fights the other masters and their servants. \\n\\n\r\nWell, if by fight you mean that Saber effortlessly slashes the enemy with her sword, then the previous sentence is spot on. There was absolutely no creativity in the fights. Not even a minimal amount of strategy and tactics. No enemy felt strong. There was no sense of struggle, difficulty or danger. In one occasion Saber just gets a power-up from Hakuno's command spell and was again able to defeat her enemy with ease. Not to mention that the command spell mechanic was never explained. The world building was atrocious. New terms and mechanics were often being introduced on the spot without a detailed explanation just so a current problem could be solved or an enemy defeated (codecast, dead face etc). This anime just throws terms left and right, like S.E.R.A.P.H, Moon Cell, Angelica Cage etc. without thoroughly explaining them and/or establishing a logical connection. Somewhere at episode 6 I stopped trying to make any sense of the story and just continued watching to see how much of a disaster this anime was gonna turn out.\\n\\n\r\nThe battle royale element, something which is a primary aspect of Fate, is completely eliminated. There are no pacts and ceasefires, no multiple Masters and Servants engaging in combat at the same time, no lone Servant forming a contract with a new Master. Absolutely no dynamic in the conflict and relations between Master and Servant. It's just Hakuno and Saber versus everyone else and it all comes down to this: Hakuno and the almighty Saber ascend to a new stratum, defeat a Master and a Servant, ascend to the next stratum,\\n\r\nrinse and repeat. Completely boring if you ask me. For some reason, they skipped the 4th stratum. I guess even the staff found the idea boring and repetitive or they ran out of money.\\n\\n\r\nNo character had any major development and I didn't really care for any of them. Saber was the closest one to getting actual development but even hers was a poor attempt at a backstory. Hakuno is worse than Sieg and the only thing for which I remember him are his constant \"All right\", \"I understand\", \"Thank you\" replies and his blank stare which is seen maybe about 30 or more times throughout the anime all thanks to bad directing and pointless still shots.\\n\\n\r\nThe character interactions were lame and the dialogue was really badly written. Sometimes, the anime takes a simple thing and tries to turn it into a major achievement. Take for example episode 4. It was obvious the sniper fire was coming from the tower, which was the tallest and the only structure in the forest and it's an obvious fact that snipers prefer high places. But in a later scene, Saber praises Hakuno because he was able to quickly determine the sniper's position. Lolwut? *clap clap clap*\\n\\n\r\nThe animation was nothing special, but certain segments were so bad that I actually had to pause the video in order to laugh at how bad they were. For example, in episode 2 during the bath scene, when Saber does a back flip it all looks like some kind of noobish flash animation. In one shot there's just a black silhouette of Saber moving horizontally from right to left and in the next shot we see Saber's cardboard cutout turning counter-clockwise until finally she lands on her feet (the only part which was done right). The whole thing however looked really cheap and stupid. Second example would be in episode 5 when Rani gets shot and Hakuno falls off her bike and rolls on the ground. That looked pretty lame.  The same walking animation was used on several scenes and very often, when characters jumped or were falling from a great height, they looked like some static sprites in a video game animation. How did Shaft go from Madoka to this? I guess 7 years is a really long time.\\n\\n\r\nI didn't like the visual designs either. There were even worse than Ufotable's, which are in my opinion worse than the original DEEN's, which tried to be as closest to the VN designs as possible. As if Hakuno's poker face wasn't enough, I also got to see an ugly version of Rin, Sakura and Shinji.\\n\\n\r\nThere was a lot of fanservice. Even the OP has a panty shot. In the anime, whenever Saber isn't saying \"umu\", she's probably one-shotting an enemy or flashing her butt and boobs. I gotta say, those are some good milkers but I wish the milking stopped at Fate/Apocrypha.\\n\\n\r\nThe soundtrack is generic and boring. And the worst part is that it often switches from orchestral music to some kind of electronic, drumstep mishmash with wub wubs and saw synths. I guess that would make sense since the setting takes place in a virtual world but in\\n\r\nthe end it all sounded very stupid and a bit cringey. The OP is actually good, in my opinion. Maybe because I am fond of rock and metal. I didn't like the ED.\\n\\n\r\nFate/Extra: Last Encore was very bad. The story was a mess of different concepts put together without any explanation or connection. Nothing seemed logical and every concept felt like it was created on the spot to solve the current situation and then immediately be discarded. The characters were boring and were killed off rather quick. The fights were lame, the animation was weak and the soundtrack inconsistent. So why did I give it a 2/10 rating. Well, the OP was good.\\n",
            "date": "2019-04-22T09:00:00+00:00",
            "helpful_count": 0,
            "mal_id": 306904,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7282456.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Vortexhighway",
                "username": "Vortexhighway"
            },
            "url": "https://myanimelist.net/reviews.php?id=306904"
        },
        {
            "content": "Thoughts on Fate/Extra Last Encore:\r\nIt was by far and a way the worst Fate franchise anime series ever made. Firstly: the story. It's difficult to try to summarise the show without spoiling huge details but it starts off with the protagonist (named Hakuno) who feels only hatred and has no memories of his past. He lives in a digital world that is somehow on the moon, and in episode 1 he gets stabbed and nearly murdered by Shinji Matou from the main series during a school murder-contest to see which students will get to participate in the next Holy Grail War, surviving long enough tofind the sword of Nero Saber, whom he summons to fight for him after a sudden thousand-year timeskip. Hakuno and Nero have to fight various masters and servants in order to make their way to the Holy Grail.\\n\r\nThe series has countless major flaws which made it almost impossible to enjoy. Firstly, the protagonist himself is extremely boring. He claims to only feel hatred for all those around him (and this is further reinforced by the plot twist regarding his identity), but his actions never support this and instead he just acts like a normal guy all the time. None of his internalised conflict ever shows itself, and this makes all of his monologues sound like pretentious nonsense.\\n\r\nThis is worsened by the fact that the story is filled with weird flashbacks, memories, and hallucination scenes which make it extremely hard to follow. Rin Tohsaka (she's in this series too) has a tendency to disappear for an episode or two at a time without explanation, then reappear once again without explanation. Speaking of without explanation, Rin in this series wields Gae Bolg and has an extremely Scathach-like costume, but we never learn why or how she came to be infused with Scthach's appearance or weapon. What they do with her in the final episode also makes no sense, since Rin and Rani's conflict could apparently have easily been avoided if Rin had just done what she did for Hakuno before a certain too-spoilery-to-talk-about event happened. It is also never explained how Alice knew about the monster at the end of her sanctum when it didn't exist until [spoiler] turned into it.\\n\r\nNeedless to say, plotholes are rife throughout the show, though I will admit that a lot of them probably come from the fact that the show has such a short episode count, so writer Kinoko Nasu had to cram as much story as he could into a very short time, and in so doing cut major corners.\\n\r\nThe only truly great episodes in the series are the ones featuring Alice (Nursery Rhyme), but I admit that I mainly love those so much becasue of the stunning experimental animation styles used.\\n\r\nRegarding the rest of the animation, the show is a mixed bag. The 2D work is flat-up astonishing, but it's often superimposed with terrible, cheap-looking CGI that ruins the visual aesthetic.\\n\r\nAnother problem is how a large number of the enemy servants are built up to look like major threats in the trailer and at the start of their arcs, only to be easily defeated anticlimactically by Saber every single time with no real variation. The battles themselves often feel like they waste a lot of potentially amazing weapons, such as the entire fleet of ghost ships that Francis Drake's noble phantasm summons, all of which do basically nothing and are never utilised during the aerial battle.\\n\\n\r\nIt really did feel like a lot of \"cool factor\" was missing due to the lack of other masters and servants throughout the Moon Cell Sanctums aside from the floor masters and Hakuno as well, since all of the fights were either one-on one or two-on-two with very little in the way of interference or unexpected developments, and most of them felt underwhelming as a result when compared to the epic scale of the battles in the recent Fate/Apocrypha.\\n\\n\r\nIn summary then, Fate/Extra Last Encore is a boring, pretentious, VERY confusing, plot-hole filled show with terrible characterisation, a lead who is overpowered to the point of destroying tension, and some of the most underwhelming battles I have ever seen in anime. 3/10, not recommended (apart from the Nursery Rhyme arc).",
            "date": "2018-07-16T14:13:00+00:00",
            "helpful_count": 0,
            "mal_id": 284126,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6526526.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TheLegendOfDan",
                "username": "TheLegendOfDan"
            },
            "url": "https://myanimelist.net/reviews.php?id=284126"
        }
    ]
]