[
    [
        {
            "content": "The story is a bit original, because this guy have to marry a girl who can accidentally be his younger sister. And lucky the protagonist isn't an mediocre idiot, but still not a Don Juan.The art is good so far as i saw, good quality.\r\nNothing to say about the music, not bad. You must watch if you like romance, and harem. it's quite enjoyable if you look for an \"ecchi comedy romance\". But don't be fool and don't look for a \"Clannad\" or \"Death Note\" in this anime.",
            "date": "2012-07-11T11:21:00+00:00",
            "helpful_count": 210,
            "mal_id": 66085,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/489378.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sasha-niichan",
                "username": "Sasha-niichan"
            },
            "url": "https://myanimelist.net/reviews.php?id=66085"
        },
        {
            "content": "Just plain trash just skip this.\r\nThe story could have been good. Its a interesting setup but it gets turned into a stupid clitche harem.\r\nThe dialogue is so bad that I actually have a hard time watching because it makes me feel embarrassed for the characters.\r\nThe storyline has no pace and is just random stuff coming out of nowhere.\r\nI will admit tho the art and animation is pretty good but thats about the only good point.",
            "date": "2012-07-21T09:25:00+00:00",
            "helpful_count": 152,
            "mal_id": 67229,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1105247.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/huehue93",
                "username": "huehue93"
            },
            "url": "https://myanimelist.net/reviews.php?id=67229"
        },
        {
            "content": "Kono naka ni Hitori,\r\nUnlike many other shows, the main character actually has to urgently get a wife which helps develop the plot unlike many other romance stories where the story gets no where. The twist is that he lost his childhood memories and he has a lost sister who is trying to marry him.\r\nThe main character seems like a really nice well rounded person as he is not too much of a pervert, loser or gets into too many accidents. However, as most characters do, he makes stupid decisons that piss people off. The people around him all seem to have their own unique personalities.\r\nSofar, it has been enjoyable without too uncomfortable or stupid moments.\\n\r\nOverall, i would give this show an 8 as it is nothing special but nothing bad either. If you watch it without expectations you'll probably enjoy the comedy and the progression of the plot. However, as most harems are, its not perfect but at least the story is going forward ( doesn't look like a back to where you started story). It's obvious that the main character does not do things the easy way or else there would be no plot and a simple resolution.\\n\\n\r\nI would recommend people who enjoy nice romance anime to watch this.  However it isn't a show for people who want a clever main character that uses strategy to solve his problems like code geass or death note",
            "date": "2012-07-07T14:39:00+00:00",
            "helpful_count": 73,
            "mal_id": 65613,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1188909.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Andyis",
                "username": "Andyis"
            },
            "url": "https://myanimelist.net/reviews.php?id=65613"
        },
        {
            "content": "In my view people are underestimating this anime. \r\nRecommend seeing 3 episodes before of drop the anime, mysteries begin starting the episodes 2~3.\r\nWatch 3 episodes before of give the note for the anime please.\r\nI must also say before that if you do not like animes with hot scenes that appear panties and etc. .. you should avoid this anime, although my goal here is to give you a chance to show.\r\nFor me, the author of this work is doing a very good job at getting to have both an anime thriller with a theme so simple, I see that many people did not understand theessence of the work (his main focus is the suspense, you should not expect he works upon the characters and how their feelings etc. ..) and I come here to try to convince people to give a chance to the anime.\\n\\n\r\nGood talking a little anime itself.\\n\\n\r\nHe tells the story of a son of an owner of a large company who dies and leaves everything to his son but for him to assume the company he has to get married first, on the day of the funeral of his father appears a person saying his sister by  (his father would have had her with another woman who is not the mother of the protagonist), the protagonist moves to a school after the death of his father to find a woman to marry, but before that he needs solve this mystery and find out who is his supposed sister by father (because he does not want to marry his sister.) The anime is totally focused on this mystery and to help in this development appears several other girls in the protagonist's life when he starts attend the college, the anime works fine its mystery story leading you to believe that is one of the girls and it's nothing you of a smack in the face and you already start to distrust another person holds the anime and you're wanting solve the mystery and find out who is the sister that, if you love to solve mysteries and uncover clues like a detective advise you to watch this anime.\\n\\n\r\nProof of it all, is one that appears 2 or 3 girls with the same cell that changes the voice, the question is which of the three who can be? Or is it someone else? Who supposedly said on the radio for the school Shougo (protagonist) who stop looking for her sister? Who was the girl who called him six hours every day? Whoever stole the phone of one of the girls who had thrown it in the trash? Whom is actually the person who helps Shougo and lives on his side?\\n\\n\r\nThat's just some of the mysteries that await you, who seek to be unraveled by someone!\\n\\n\r\nHow about you become a bit like detective?\\n\\n\r\nNote: Since the goal of the anime is the suspenseful if I dwell too much on his description I could end up giving spoilers and many Eventually grace.\\n\\n\r\n----------------------------------------------------------------------------------------------\\n\\n\r\nHistory: 10\\n\r\nSuspense is the essence of this anime, and he is very well done in this part, as I said above still can not solve the mystery, and keep seeing the episodes to see if I can find any clues.He will play for one side to the other and making you believe a track that is not true and nothing you're already distrusting someone else (as I said above), every detail leaves you intrigued and each new track makes you seek links with other previous tracks to try to solve the mystery, it really is exciting in that respect.\\n\\n\r\nArt: 9\\n\r\nThe anime art is good, and very detailed, perhaps a bit too colorful and glossy, but you get used to it,scenarios are well made in every detail and the characters also has appearances quite pleasant with well defined traits.\\n\\n\r\nCharacters: 7\\n\r\nI think it might be one of the weaknesses of this work, I really think that it ta strong in its suspense because the characters do not make you like them, do not have a work upon the feelings of the characters, what they think, what they think, really the whole work is focused on suspense.\\n\\n\r\nSound: 7\\n\r\nThe sound should be the weakest part of the anime, are not well placed, in the opening scene has a sound more or less, the closure is a bit better, if you expect an anime Kimi to Boku like that in my opinion has a fantastic sound and good choice of songs, Kono naka probably will not suit you.Some scenes even have music and they do not fit the times he has, but as the anime style is mystery, suspense think to understand a little of that side, the strong anime of this genre does not have to be sound (is how I see it)\\n\\n\r\nEnjoyment: 7\\n\r\nThe anime is fun and provide a sense of wondering what will happen next, if you expect an anime filled with comedy, comedy scenes without forced and more natural, you probably will not like this anime.Now if you expect that anime makes you actually engage with it, try to understand what goes into it, that detail is what this show is for you.",
            "date": "2012-08-29T01:41:00+00:00",
            "helpful_count": 40,
            "mal_id": 71091,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1386051.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/slyffer",
                "username": "slyffer"
            },
            "url": "https://myanimelist.net/reviews.php?id=71091"
        },
        {
            "content": "(Previously on \"WHO IS IMOUTO?”)\r\nShougo had just came back from his father's funeral. He had learned about his large inheritance, but in order to receive it, he must attend a school and get married to a lovely girl. But, one of the girls is his long-lost sister. Shougo, heir to the Mikadono Group, knew he didn't want to bone his sister, so he became a temporary Private Investigator, searching and uncovering the identity of his long-lost sister. Will he succeed? Or will he bone his sister?\r\nWith his naive, kind, and determined personality, he ventures forth into the unknown school called Miryuin Private Academy and searchesfor his sister. There, he encountered many women, like the blond, competitive princess Rinka, or the childish and quiet student council president Mana, or the mysterious witch girl. Every girl he encountered were suspicious and questionable. He needed an assistant and, thus, Ikusu, aka 'Mr. X', showed up. With 'Mr. X, as his partner, they followed up on some leads and would soon uncover the mystery. Or will they?\\n\\n\r\n[Cue the CSI Theme Song: “Who are You” by The Who]\\n\\n\r\n(On this Episode of \"WHO IS IMOUTO?”)\\n\\n\r\nPrivate Investigator Shougo has been, for three days, searching for the elusive Imouto.  He has followed up on several leads, all of which had led to dead ends. As of now, there are five potential candidates, and they all seem very suspicious, as if they know who is the real “IMOUTO”, but refuse to tell him.  He was getting desperate.  He needed evidence, he needed some lead.\\n\\n\r\nJust when he was at his wit’s end, Mr. X, his partner, burst through the door.  She noticed his frustration and offered a suggestion.\\n\\n\r\nShe said, “Why don’t we do a DNA test?  I’ll get the hair samples of all the candidates and then we can compare them with your hair.”\\n\\n\r\nHe had almost forgotten that Mr. X was a ninja in training, and it completely slipped his mind to use a DNA test.  What a fool he was.\\n\\n\r\nHe said, “Your right!  Why didn’t I think of that?  Go get the samples, and then perform a DNA test.”\\n\\n\r\nShe complied and went out the front door.\\n\\n\r\n[Several days later.]\\n\\n\r\nThe results were in, Shougo was holding a vanilla envelope, which contained the answers.  He opened it and stared at the contents.\\n\\n\r\n“My God”, he said, “This can’t be true!? Can it?”\\n\\n\r\n“What? What happened?  Who is it?” asked Mr. X.\\n\\n\r\n“This girl. I…I was close to her…very close to her! And, yet, she’s my sister!”\\n\\n\r\n“Tell me, who is it? Tell me!\" she yelled.\\n\\n\r\nHe stuttered, “It’s…it’s…it’s…\\n\\n\r\n*Tune in to next time on “WHO IS IMOUTO?”. Where we reveal the true “IMOUTO” or is it?*",
            "date": "2015-05-19T22:22:00+00:00",
            "helpful_count": 38,
            "mal_id": 188242,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4408661.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 7,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Blood_Diver_A",
                "username": "Blood_Diver_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=188242"
        },
        {
            "content": "Kono Naka ni Hitori, Imouto ga Iru anime, like most recent animes, is an adaptation of its manga. \r\nStory: Shougo Mikadono is the son of a famous business man that is left with a will which states that he will be the successor of the company also has to marry before graduating highschool. However his long lost sister, who keeps her identity anonymous, states that she will marry him. Of course incest is creepy shit, so Shougo wants to avoid this but the imouto (sister in japanese) will attend his highschool where she will try to make him fall in love with her. Remember hedoesn't know who she is which poses a problem\\n\\n\r\nThis idea is actually pretty intresting but oh. my. god. it was poorly executed. Now you obviously know that the girls on the cover are part of Shougo's harem which means character development would be quite difficult. But its like the team barely put any effort at all. Based on the 1st episode a girl suddenly shows a romantic interest. Now this probably would send a message to the audience that \"hey this girl seems to already have feelings already which makes her suspicious already.\" But god damn when the 2nd girl was introduced she also SUDDENLY have feelings. Now you can tell that this story was rushed beyond believe, and will continue, because 2 of the 5 girls were introduced where they are in \"good\" terms with the male without any decent reason. i honestly wouldnt be suprised if all the girls \"fall in love in first sight.\" If thats the case then Shougo is a lucky bastard. \\n\\n\r\nNow that i established that character development is not even present in this anime i'd like to say that the dialogue is just terrible and ive already scene a typical boy-meets-girl cliche. *spoiler alert* The girl with black hair, Tsuruma Konoe, was saved by an incoming truck by Shougo who pushed her out of the way. no wait....THE BUS FUCKING HIT HER. I'm not even kidding folks she was smacked by a truck. Next thing you know the boy runs to ask the girl if shes okay and she didn't even have a bruise....wow hulk mode. *spoiler ends* \\n\\n\r\nI want to quickly top this off by saying that this is a generic harem bullshit. Actually this reminded me of other generic animes such as Fortune Arterial and R-15 and guess what, same director. I also realized he did kissxsis which was actually decent-good but how coincidental is the fact that both animes are related to incest. \\n\\n\r\nArt- Not jaw-dropping but okay. You obviously won't see the insane animation works from Hironori Tanaka or Takashi Hashimoto but the actual art is good\\n\r\nI give it a 7....i give the artists a 10 for having the balls to stick through this project. -respect-\\n\\n\r\nSound- I'm not even sure how to rate this. everything sounds normal. Now if your talking about the OP and ED, those are just so annoying to listen that i had to skip them. the voice seems typical but the background music for the OP is just a mess. The different sounds aren't even aesthetically place. Its just a messy bunch imo.  But in the end its whatever the viewers preference is because music is music. \\n\\n\r\ncharacter: Oh god....Okay let me start by saying you will probably never see any character development but there are distinct personalities with each girl. Shougo is just a failure...excuse me he's just really typical guy who happens to be rich. Now that could be ideal for his situation but when you start to see him talk and move around...you would much rather see him be an asshole or some cocky person where he can be somewhat intresting. \\n\\n\r\nHere's my take on the girls. they are all going to be distinct but ridiculously bland in their category. the tsundere in this story probably blushes by looking at the cloud that Shougo is looking at. Nah I'm kidding but don't expect to see very very good tsunderes like aisaka taiga or louise (both voiced by kugimiya rie i might add)...hell don't expect anything that would make you grow attached to them. oh yea the dialogue is just bad, no intresting conversations whatsoever. \\n\\n\r\nenjoyment: I was actually frustrated and bored. I've read the manga and found it pretty interesting so i was somewhat excited by the anime adaptation of it but boy i was disappointed. With this very bad start to this show it almost seems impossible to bounce back and have a good finish. I gave the story a 6 because it had POTENTIAL...lets just hope the anime can use the interesting plot to their advantage....probably not. \\n\\n\\n\r\nOverall: it is generic, boring, and boring and boring. \\n\r\nIn all seriousness its just bad in my opinion but i won't be surprised if other people enjoy it. This doesn't mean that those guys or girls are trees with no sense of taste but i for one already can't stand it.",
            "date": "2012-07-12T21:40:00+00:00",
            "helpful_count": 34,
            "mal_id": 66263,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442440.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/StreetSmartz",
                "username": "StreetSmartz"
            },
            "url": "https://myanimelist.net/reviews.php?id=66263"
        },
        {
            "content": "NakaImo\r\nFast review.\r\nStory\r\nThe problem with this anime is that it was predictable, the story is good but predictable and in the 9th episode i knew who the sister was, it was obvious if you payed attention to the things they said and what they knew till that episode, and even in the first episodes i knew she was going to be the sister with another suspect that i had, but i knew it, was predictable so the story was fine.\r\nArt & Animation\r\nBeing an ecchi harem anime this should have great art, but it was just good, nothing amazing or great, the uncensored parts were fine, Ikusuparts were good and funny, it was good overall, don't expect much nudes.\\n\\n\r\nSound\\n\r\nIt was fine, the voice acting was good, but the background music was ok, the OP and ED were boring, overall was fine.\\n\\n\r\nCharacter\\n\r\nAlmost everyone were ok, just Miyabi and Ikusu were interesting and sometimes Konoe, but it was fine because of somethings that you will see, if you get to watch it.\\n\\n\r\nEnjoyment\\n\r\nI enjoyed the art and the comedy mixed with the ecchiness, it was fine.",
            "date": "2015-08-07T15:56:00+00:00",
            "helpful_count": 28,
            "mal_id": 195457,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195457"
        },
        {
            "content": "Okay this is my very first review ever, so don't be too harsh for me.\r\nWhen I first got my sight on this anime, I immediately thought it's gonna be boring, half-baked anime, that's what I had in my mind after seeing how low the anime is rated on MAL. But as soon as I started watching the anime, I was pleasantly surprised, it was way better than I expected it to be, in my opinion the anime is highly underrated, and deserves to be rated better.\r\nStory: 7/10\r\nThe story of Kono Naka ni Hitori, Imouto ga Iru! was pretty good in my opinion. Sure it wasn'tsomething unique, just another school romance anime with some harem, but there is no way I would call it boring. The story itself kept me intrigued untill the very end. Anime seemed to be dragged out, and the second half of it wasn't even close to being as good as first half. Then the humor was typical, boring jokes and of course how without accidental tits squeezing situations. The ending left some questions in my head. It just felt too rushed and incomplete. I don't know If I can expect another season, since the anime wasn't successful. Probably not. :(\\n\\n\r\nIf you're looking for something impressive or unique, this anime might not be for you. But if generic school romance comedy is what you looking for, you might be left satisfied with this.\\n\r\nSure this isn't maid-sama, or toradora but definitely \"worth giving a shot\" anime.\\n\\n\r\nArt & Animation: 8/10\\n\r\nThis section is pretty hard to talk about, because there's not much action, where the animation capabilities could be seen properly. But anime itself was pretty pleasant to watch, characters seemed to be drawn modern, didn't really felt like watching 90s anime. Only downside I disliked was the shining redness on girls shoulders, knees, and everyone knows where else.\\n\\n\r\nCharacters: 7/10\\n\r\nIf the story is cliché and generic, could the characters present themselves as deep, interesting personalities? Dont think so.\\n\\n\r\nTsundere girl? Check. The good girl (a.k.a. the Tsuruma, Konoe)? Check. Perverted friend that supports and helps main hero? Check. There are no characters that would be totaly unique, and all the girls seem to be somewhat similiar and maybe even too unexceptional.\\n\\n\r\nThere also was little character development, characters changed (sensibilities, deeds, likes, motives) really little through the series. Despite that it wasn't boring to watch.\\n\\n\r\nOverall: 8/10\\n\r\nNakaimo obviously isn't amazing nor great anime by any means. But sometimes it's totaly enought to be an enjoyable anime by what this has to offer. It brought nothing new to the table, but my hand just can't rise to give a worse rating to the anime, that kept me intrigued throught the series untill the very end.\\n\\n\r\n---\\n\r\nEnglish isn't my main language so I apologise for possible spelling or grammar mistakes in advance.",
            "date": "2014-12-14T07:20:00+00:00",
            "helpful_count": 14,
            "mal_id": 172175,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4042001.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Augiz",
                "username": "Augiz"
            },
            "url": "https://myanimelist.net/reviews.php?id=172175"
        },
        {
            "content": "Hooray! My first review! I just happen to download this randomly, and it turned out regrettably a waste of time... I barely able to finish the whole episode.\r\nStory 5/10\r\nWell, the prologue turned to be quite simple. Nothing deep. Confusing at some point... \r\nArt 5/10\r\nThe art it just aint my type. Average. Not the type that will make you fall in love with and keep you watching even if the story is unpleasant.\r\nSound 4/10\r\nNothing special.\r\nCharacter 3/10\r\nIn my opinion... A lame pathetic looking main character, and unbelievably annoying bunch of female characters.\r\nEnjoyment 2/10\r\nAt first, I was kind of interested in the story, even though the art andcharacters didn't simply fit my taste... but as the story progressed, I begin to lose all of my interest.\\n\\n\r\nWell, I honestly wrote personally what I think. In the end, it all depends on your taste.",
            "date": "2012-07-09T16:00:00+00:00",
            "helpful_count": 12,
            "mal_id": 65859,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/447076.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Officer-Kaoko",
                "username": "Officer-Kaoko"
            },
            "url": "https://myanimelist.net/reviews.php?id=65859"
        },
        {
            "content": "Before I start, let me tell you that I'm a big fan of Harem animes (Hoshizora E Kakaru Hashi, Mashiro-Iro Symphony, Akane-Iro Ni Somaru Saka and the such) so I'll write this review on the viewpoint of a harem fan.\r\nLet's start! ^o^\r\nStory: You are given the chance to be a heir to a big company. The only condition is that you should get married first. So you enroll in a school so that you can find your typical waifu (wife) then, suddenly, you have five awesome and beautiful girls sorrounding you. You can choose one of them so that you can marry her and leadthe company.\\n\\n\r\nSounds like a dream life eh? You get to choose who you want to marry and become rich at the same time. It's like hitting two birds with one stone.\\n\\n\r\nThe TWIST: One of those 5 awesome and beautiful girls is your long lost, blood-related Imouto (Little Sister) who was separated from the family long ago because she is an illegitimate child.\\n\\n\r\nNakaImo is a little original when it comes to the story part. A harem anime typically consists of three or more girls fighting for the love of the male lead but the twist is what made it original. I can't even imagine myself being in the shoes of the male lead because it's so hard to choose even though some guys are saying that there's only 20% chance that the male lead can choose his Imouto by mistake. It's only a little original because the characters have the same personality for a harem anime. (Which will be discussed later in the character part)\\n\\n\r\nArt: The art is what I liked most about this anime. The girls are, well, how can I say this? Have a little moe (as in moeblobs from K-on!! or Upotte!) and then all of them are kawaii (Like those girls in Visual Novels). I admit, I have a crush on all of the girls in this anime (especially on Konoe Tsuruma).\\n\\n\r\nSound: The OP single (Choose Me ♥ DAARIN by StylipS) is what's catchy about this anime. I usually repeat this song again and again on my phone when I'm on the bus. I can't find anything else about sound that caught my attention.\\n\\n\r\nCharacter: The typical harem anime. We have a genius, silent-type, class president, vice-president (not to mention a TSUNDERE (by the way, I'm also a big fan of Tsunderes. I want to have a Tsundere girlfriend in the future)).\\n\\n\r\nEnjoyment: If you're looking for a typical harem anime with a not-so-typical storyline, then NakaImo is for you. After all, the fanservice given by this anime can make you squeal. (I don't want to spoil you but I can't get the sound Konoe made when she was squealing out of my mind).\\n\\n\r\nOverall: If you're a big (and I mean BIG) fan of Harem animes, then this is for you. The love story isn't too heavy unlike Mashiro-Iro Symphony (or Princess Lover!) and it isn't too light unlike Hoshizora E Kakaru Hashi.",
            "date": "2012-09-06T02:41:00+00:00",
            "helpful_count": 12,
            "mal_id": 71669,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155579.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/loveiszero",
                "username": "loveiszero"
            },
            "url": "https://myanimelist.net/reviews.php?id=71669"
        },
        {
            "content": "I know that almost everyone says this, regardless of whether it is true or not, but this is truly my first review. i dont know what rupok93's problem is but i would guess he is a huge shonen jump fan and landed on this anime by mistake, and simply cannot see the beauty of harem anime. \r\nStory: 10\r\ni love the concept of having the main character having to choose from a group of girls without accidentally choosing his sister by mistake. \r\nArt: 10\r\nThe artwork is great and does not affect the entertainment level of watching this series\r\nSound: 8\r\nnothing too special but its not bad butnot the best either\\n\\n\r\nCharacter: 10\\n\r\ni enjoy all of the characters in this series. my personal favorite is konoe but all of the girls are good. and none of them are annoying or bring down the overall enjoyment of the series.\\n\\n\r\nEnjoyment: 10\\n\r\nnuff said\\n\\n\r\nOverall: 10\\n\r\nto be honest with you i have no idea why this anime is ranked in the 3000s. i believe that it should be within the top 1000 atleast if not the top 500. it is by no means the best anime i have seen, but it is for sure the best harem i have seen. i enjoy this anime much more than i did highschool dxd or sekirei. if you are a fan of harem i recommend this anime to you.\\n\\n",
            "date": "2012-07-22T17:15:00+00:00",
            "helpful_count": 8,
            "mal_id": 67371,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1253421.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnimeGuruTV",
                "username": "AnimeGuruTV"
            },
            "url": "https://myanimelist.net/reviews.php?id=67371"
        },
        {
            "content": "Every guy wishes to become someone successful and famous that all the girls would just scream out his name and asks for marriage. And that is Kono Naka ni Hitori, Imouto ga Iru!, shortened as Nakaimo, premise. So allow me to vent out my thoughts for the show.\r\nSTORY: 5/10\r\nIt may not be the first to feature this, but Nakaimo still delivers a story that has been retold by many animes before. From the start of the story, the show made it clear that it will definitely include some incest - specifically brocon - which I am now getting used to. \r\nNakaimo centers around Shougo Mikagami,the next head of his late-father's successful company who is sent to Miryuuin Academy to look for a life partner but is thwarted when news of him having a little sister who attends the same academy as him came in and is now struggling to find her. Along the way he meets various girls that took interest in him but Shougo is having trouble choosing from them fearing that one of them maybe his little sister.\\n\r\nThe story's a first but the main concept is as bland as ever. But a plot twist in the end did earn a few points for me. However, it alone can't make this stand out from the bunch. The story can also be humorous from time to time while fan service is just waiting around the corner preparing for a proper scene to show off some thin fabric and skin, which kept me either ogling or annoyed when it became too much. The story all throughout didn't exceed my expectations but what was surprising is the revelation on who Shougo's true little sister is. Wanna find out, watch it yourself.\\n\\n\r\nVISUAL QUALITY AND AUDIO: 7/10\\n\r\nLike its story, the visual is what you'd expect from the given genre. The art emanates warm colors found in the well detailed backdrops. Character design is pretty especially how they highlight a given character that it separates it from the rest of the cast. Animation's decent too.\\n\r\nVoice acting is well delivered and greatly mimics the character's expressions. Soundtrack is good but not all memorable.\\n\\n\r\nCHARACTERS: 7/10\\n\r\nNakaimo features a cast of wacky people; the protagonist, the busty honor student, a tsudere swimmer, a cross-dressing ninja, a blonde elitist, a gluttonous president, a young shop manager, and even a loli teacher. Given that, their personalities and characteristics are quite unique but it still what you'd expect from an anime of this genre. Their girls' ways to approach Shougo  is quite amusing and sometimes humorous. Character development takes place as the story progresses.\\n\\n\r\nOVERALL: 7/10\\n\r\nNot the kind of an anime that will go against the flow but Nakaimo delivers a fun-filled romance story. I greatly enjoyed this that I finished the series and I'm still willing to watch it all over again. So Nakaimo is worth checking out in your into the common harem genre.\\n\\n",
            "date": "2013-11-06T05:46:00+00:00",
            "helpful_count": 6,
            "mal_id": 119463,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3288039.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JonBort",
                "username": "JonBort"
            },
            "url": "https://myanimelist.net/reviews.php?id=119463"
        },
        {
            "content": "Kono Naka ni Hitori, Imouto ga Iru!\r\nWhere you get to watch a young man named Shougu Mikadono play the pray like hell that I don't fuck my sister game, which is a fun game to play.\r\n*shh it's the one we all think it is*",
            "date": "2015-08-13T16:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 196084,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4577865.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NewYearsDay",
                "username": "NewYearsDay"
            },
            "url": "https://myanimelist.net/reviews.php?id=196084"
        },
        {
            "content": "How to start this review... I guess I could start by saying that Nakaimo: My Sister is Among Them!, or Kono Naka ni Hitori, Imouto ga Iru! if you prefer the Japanese name, is an ordinary harem/echii anime. Or, at least, that's what I thought when I began this series. In all reality, it's a unique series to it's genre, and I mean the harem genre, not the echii, since there are multiple animes with similar echii aspects.\r\nAs for the story, I found it unique and interesting throughout the entire series, and quite enjoyable really. The story goes like this: The president of a highlysuccessful company has just died, leaving his entire company to his son, however, in order to inherit it, he must get married by the end of his high school life. So he has been sent to a new high school to start looking for a bride-to-be. But, there's another catch, he has a sister that his family never knew about, and she goes to the same high school as him, and what's even more surprising, she's in love with him and wants to marry him. So now, he has to figure out which girl is his sister out of an entire group of girls that are potential wives. When I found all of this out, it got better each episode. The thing is, you never know who his sister is until the very end, and the series keeps making you think one thing, but then takes a giant curve and gets you thinking about another thing, and I never saw the ending coming. Very good story.\\n\\n\r\nArtwork, similar to most animes being made these years. The designs of the characters are well made, you are able to tell them apart easily, and the setting seems modernly realistic. All aspects in which make a good anime.\\n\\n\r\nAs for sound, voice acting was well done, I recognized some actors and actresses from other animes. I didn't like all of them, but that's just me. Overall, very professional and well done.\\n\\n\r\nI think what I liked about this story were the choices in characters. The main guy seemed really cool, and down-to-earth, unlike some characters you may find in animes these days. He was mature in some parts, but had just the right amount of a perverted side to him as most normal teenage boys would, so he seemed real to me. As for the girls, I liked them all, especially Rinka, my personal favorite. They all had different personalities, and they were all in love with the main guy, or at least I assume so. In the story, they each get their moment in the spotlight, so the screen time was evenly distributed between them so they each have about 2 episodes about themselves, and the moments in this anime that made me laugh the most were always where the girls were thinking that Shougo has a thing for guys whenever something weird is happening between him and Ikusu (which obviously isn't a guy).\\n\\n\r\nI can honestly say that I didn't hate this anime. In terms of fanservice, believe me, there's plenty of that. There were moments of awkwardness that made me cringe, which is common in most echiis these days, and of course, there's always just enjoying one guy getting loved by a bunch of girls to an extent where you wish all his girl troubles were yours. It wasn't until the end where I was unsatisfied on where the story went. This isn't really spoiling anything, but like in most harems, the main character never chooses which girl he will get with, it'll end with all of them proclaiming their love to him or something like that. Even though it had an unsatisfying ending, I do recommend this to anyone looking for a harem/echii with fanservice and a good storyline.",
            "date": "2013-04-10T19:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 93335,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=93335"
        },
        {
            "content": "I guess I'll never see profiteroles the same way after watching this one... With a really flawless plot, what screws it was the share of uncensored fanservice moments. Can't say it wasn't good, but great animes don't appeal to that...\r\n{STORY - 5/10}\r\nAfter the death of Kumagorou Mikadono, his son, Shougo, gets transferred to Miryuuin Academy, with the mission of finding the girl with whom he would spend the rest of his life. This needed for him to become the new president from his father's entreprise, the Mikadono Group.\r\nProblem is that Shougo has an unknown half-sister, whose has promised marrying with him and studies at thesame academy. Soon enough, Shougo starts attracting some particular girls, unable to date them under the risk of getting in love with his sister.\\n\\n\r\nAn well elaborated main scheme, based on all this situation, is proved to be related with Shougo's ascension. Discovering who his real sister's identity is required to avoid a huge scandal against the Mikadono Group.\\n\\n\r\nConstant calls from a misterious girl that artificially modificated her voice and claims to be Shougo's sister makes him concerned. The device used turns into a lead. Still, putting and end to this mistery seems impossible, as the suspect changes everytime...\\n\\n\r\n{ART - 6/10}\\n\\n\r\nNothing that much impressive, but overally gorgeous. All girls are beautiful and the eye design is amazing. Everything looks so smooth and sweet...\\n\\n\r\n{SOUND - 7/10}\\n\\n\r\nSimple backgrounding and really nice OP and ED songs. Both of them match this anime's style, being cheering and cute. Other thing I noticed is the use of unrelated songs at Mei's cafe. First time this happens to me...\\n\\n\r\n{CHARACTERS - 5/10}\\n\\n\r\nThere are few, but all of them are very distinct. Shougo is one of those confident guys, who has a charming side and respects women. Not knowing who is his sister prevents him from showing true affection to all the other girls that he knows...\\n\\n\r\nKonoe and Kannagi are the first ones Shougo meets. The fact that both are childhood friends is forgotten as he suffered an accident on that time. Konoe shows a calm and sweet personality, being a total pervert on the inside. Kannagi loves Shougo since the first day they met, but she's unable to show her feelings and wants to stay by his side all the time.\\n\\n\r\nThe cafe owner and prodigy girl, Mei Sagara, deeply relates to Kannagi and is a essential piece from this puzzle. Rinka is also on the middle of this entire scheme, as her father is a Mikadono's rival. After being helped by Shougo, she starts developing feeling for him too. Like on many other seinen manga based animes I've watched, there's also a woman that disguises herself as a man... I don't know why but I feel attracted to this type of character every time I see one...\\n\\n\r\n{ENJOYMENT - 10/10}\\n\\n\r\nIt's impossible not liking an ecchi... Other than that, the mistery involved is awesome. It just keeps you wondering who the real sister is on every episode, with a true answer being shown only at the ending... It was totally unpredictable and that's why I liked it so much.\\n\\n\r\n{OVERALL - 6/10}\\n\\n\r\nChoosing someone affraid of a blood relation, Shougo is both lucky and unlucky. There's a girl somewhere that wants to meet his brother and be his new family, but her identity is unknown... Shougo has to discover who she is and stay by her side. Until that, starting a deep relationship with any girl could mean trouble and some other problems may get on his way. An investigation full of twists begins...",
            "date": "2013-11-14T04:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 120199,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=120199"
        },
        {
            "content": "+ Imoutos!\r\n+ Absolutely cute and pink art, makes me feel like a cream puff if you know what I mean...\r\n+ Miyabi is cute! x3\r\n+ Funny and cute episodes, like when they're at the ball or amusement park\r\n+ It surprises the viewer couple of times\r\n+/- Old (good?) character types, a good girl, tsundere, a rich girl, a genki and clumsy girl and a cosplay girl\r\n- It doesn't take \"can't sister and brother be lovers?\" -theme to any deeper reflection.\r\n- Too many pointless fanservice and naugty jokes\r\n- Homophopic moments and jokes\r\n- The mystery is kind of boring\r\n- Like usual, the main guy doesn't have any personality\r\n- Theplot is forseeable after all.",
            "date": "2012-10-04T00:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 74041,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1023647.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/CinnamonHime",
                "username": "CinnamonHime"
            },
            "url": "https://myanimelist.net/reviews.php?id=74041"
        },
        {
            "content": "Kono Naka ni Hitori, Imouto ga Iru is a typical harem anime with a serious setting and a mysterious sister. That being said it could have some more comedy as most viewers want mostly two things from a harem anime and that is fan service and jokes. So if you are a fan of the genre and also a story lover more than the fan service and jokes I would recommend this anime.",
            "date": "2012-10-25T04:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 75869,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1226335.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dxbladexd",
                "username": "dxbladexd"
            },
            "url": "https://myanimelist.net/reviews.php?id=75869"
        },
        {
            "content": "This Is My First Review So Sorry If I'm Wrong Haha\r\nThe Anime It Self Has A Outstanding Story Line And Thus I'll Rate It Overall 10. I Enjoyed It Cause Of It's Comedic Parts And Also The Romantic Stuffs. I Love The Genre \"Romantic\" And This Anime Has It. A Perfect Combination Of Comedy And Romance, Plus The Harem Part Makes It Exciting. Who Will He Choose? Who Does He Love The Most? More Apparently Who Is His Little Sister? Haha I Already Finished The Anime So I'll Say 10 Of 10 Is Worth It.\r\nThanks! Love The Anime! Hopefully It'll Have Another Season.",
            "date": "2014-12-22T07:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 173619,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/IanVrix98",
                "username": "IanVrix98"
            },
            "url": "https://myanimelist.net/reviews.php?id=173619"
        },
        {
            "content": "My sister is among them! As undoubtedly noted in synopsis, this follows a young lad slated to helm his father's company. To that end, he's transferred to a prestigious school with the goal of choosing a wife. To add a plot twist, he gets a mysterious caller who names herself his sister--and in that culture, marrying your sister is a terrible scandal!\r\nThat's most of the story. Most of bits remaining consists of Shougo's getting along (or not) with the various girls. This is a harem story and ecchi genre, so panty shots and other lewd stuff happens. The aforementioned mystery begins appearing in episode 9,but if you've read any detective or mystery stuff, you'll probably be able to guess some of it.\\n\\n\r\nOverall, the story was meh. I don't mind some suspense, but had to force myself to sit through very bland characters and their schoolgirl doings to get to the \"what's really going on behind the scenes?\" Just me, but the story felt stilted aside from the mystery.\\n\\n\r\nArt's pretty straightforward. Each girl is reasonably pretty, and the expressions look human enough. It's possible to forget you're watching an anime, if try hard enough, but otherwise nothing remarkable.\\n\\n\r\nNothing about the sound or music impressed me. Maybe my high standards, but it felt like the anime's producers were rushing to get it done rather than get high-quality work.\\n\\n\r\nCharacters...eesh, seen better. Shougo is very much not a confident guy, always easily pushed around. It's only when he decides to take on the mystery that he suddenly becomes fascinating. Even after, nope, he doesn't have any confidence with girls; frequently it's the girl who asks him on a date, he just goes along with it.\\n\\n\r\nNow the girls:\\n\r\n1) Konoe is a typical \"easy catch for harem guy\"\\n\r\n2) Myabi, your really insecure girl\\n\r\n3) Kunitachi, student council member who puts on a fierce air to hide her own bashfulness around Shougo. If this is an tsundere character, that never gets explored nor explained.\\n\r\n4) Tendou, student council president, is just a rambunctious kid with great love of food\\n\r\n5) Sagara was genuinely interesting for a bit, as she is involved deeply in the mystery and doesn't fall for Shougo suddenly, but after the series she's just another has-been\\n\\n\r\nEnjoyment...if you come without standards, maybe you'll enjoy the suspense and fan service. I prefer anime with a good story, believable characters, and solid plot. Definitely not a good choice for serious anime fans.\\n\\n\r\nOverall, it was very bland. I found the answers to the suspense probably the only exciting thing, everything else felt too rushed to be worthwhile. I actually stopped watching midway through once because this was so dull.",
            "date": "2019-01-18T15:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 299389,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Brom2855",
                "username": "Brom2855"
            },
            "url": "https://myanimelist.net/reviews.php?id=299389"
        },
        {
            "content": "Shogo Mikadono had been living a comfortable, carefree life up until high school.  As the only child of the Mikadono group, a wealthy network of the Mikadono family and it’s friends and business partners, he’s been selected as the sole heir to the company and family name that his father, Kumagoro Mikadono, has dedicated his life to strengthening and expanding.  Unfortunately, on the day of his ageing father’s death, when Shogo is finally given a taste of what’s written in the family patriarch’s will, it’s revealed that in order for the young heir to inherit his father’s very lucrative estate, he must undergoone final task;  To enroll at a certain high school, fall in love with a dignified and agreeable classmate, and make her his fiancee, with whom he’ll be sharing untold riches on the day of their marital vows!  It might not be the most romantic grounds for a proposal that anyone’s ever heard of...  Still beats the idea of having to come together to repopulate the earth, when you get right down to it...  But for a rich man to marry an attractive woman who’s only interested in business and money isn’t a new concept, and it certainly isn’t unheard of.\\n\\n\r\nHowever, as is the unfortunate pattern of life, even the simplest plans must become complicated somewhere down the line.  Not long after hearing about this stipulation, he’s confronted from just out of reach by a soft, reassuring voice that he won’t always be alone...  That the owner of the voice is his long lost sister, who has every intention of marrying him and staying by his side forever.  Wait, did I say soft and reassuring?  Because I meant deeply concerning, as it turns out that his father did in fact father an illegitimate daughter who’s been separated from him since birth, and to make this revelation even more shocking is the fact that the girl with the voice is also going to his new school!  Now, his attempts to pluck a bridal rose from a garden full of crazy weeds is being hampered by the fear that one of his sultry suitors may actually be his secret sister!  This matrimonial minefield is made even harder to cross by the fact that with each step that moves him forward, he’s being confronted by red herrings that are only pretending to be his sister for their own ends.  Can Shogo safely pick the woman of his dreams and collect his rightful inheritance, or is the only thing he’s bound to inherit a deformed child and a one way ticket to Alabama?\\n\\n\r\nYou know, the longer I do these reviews, the more likely I am to cross every single animation studio off of my list at some point.  This time around, we’re talking about Studio Gokumi, a company that spun off from Gonzo in the early 2010’s.  The name literally means Studio Group 5, which...  I don’t know.  I have no idea what that does, or even COULD mean on a larger scale.  In any case, they haven’t done very much work, although I have seen two of their shows before, namely A Channel and Yuki Yuna is a Hero, two shows whose best qualities were their visual qualities.  A Channel, like most of Gokumi’s early work, was low budget, but managed in such a way that it’s lack of funds could never hurt it in any noticeable way.  Yuki Yuna, like most of Gokumi’s later work, was gorgeously animated with a lavish budget that the producers took full, appreciative advantage of.  Between the two, Nakaimo is closer to A Channel, being one of the studio’s earliest projects, and it looks way better than it really needed to look, given the nature of the material.  \\n\\n\r\nTrue to form, Nakaimo looks perfectly fine.  The visuals aren’t mind-blowing of world-challenging, but they’re more than serviceable enough to be above complaint.  The animators were very clearly working with a tight budget, so the movement on screen is never exactly fluid, but the characters still move just as much as they need to to convey a sense of life.  There are shortcuts taken, which is kind of inevitable in such a situation, as movement occasionally has to be limited to save some money, but it’s never prominent enough to bother even the most astute viewer.  Not to mention, these shortcuts pay off with interest when the show DOES want to dazzle us with more impressive shots, such as one of the main characters swimming in beautifully animated water, or when they need to show us random CG effects like a can flying at someone’s head from off screen.  I’ve said before that given the choice, I’d prefer a well-managed low budget over a lackadaisical high budget at least seven times out of ten, and Nakaimo easily delivers on what I wanted to see from it.\\n\\n\r\nThe artwork is also very pretty, with it’s only real flaw being certain shots where the background has an unnatural sort of heavenly shine to it.  It doesn’t happen often, thankfully, but it’s irritating when it does.  The backgrounds are fairly well drawn, and while most man-made backgrounds to have a surprising level of intricacy in their design and range of details, things like grass, trees and bushes do blur a bit when you look at them closely.  The characters themselves are drawn to type, milking the most cliched archetypes of the ecchi genre dry, extending all the way to the teacher being a little girl.  You’ve got the cosplaying loli, the pigtailed flat-chested tsundere, the overdressed goth-loli sweetheart girl, and of course Itsuke from Haruhi as the protagonist.  It’s saving grace is that once you get past the clichés, the characters are still designed and drawn really well, although the constant blushing can get extremely annoying.  The lighting and filtering effects are also utilized well, if not very often.\\n\\n\r\nThe soundtrack is a bit on the generic side, but it’s not bad by any means.  It’s very pretty in it’s orchestration, but it’s also really repetitive, as any given track just loops around every few seconds or so.  It does it’s job well enough, and you’ll hardly notice it, unless it’s doing the one thing about it that impressed me...  Instead of playing off the little sister mystery as sexy or romantic, moments dealing with the mystery...  AKA phone calls allegedly from the sister and certain off-color remarks tying into it...  Are paired with music that actually manages to make the concept feel creepy or ominous, which is how it damn well should feel, so props for that.  The opening theme, Choose Me Darling by StylipS, is your typical fast, catchy song from multiple harmonized female singers, but what makes it awesome is the percussion underneath it, which creates a pretty memorable beat.  That, and i’m pretty sure a decent amount of the animation budget went into it, as it makes for a pretty awesome watch, and it goes out of it’s way to introduce the characters and several plot points that happen throughout the show.\\n\\n\r\nThe English dub was produced by Sentai Filmworks, and before I start doling out the praise...  Of which I have plenty to go around...  I’m going to have to go into some negatives, because Nakaimo’s dubbers made two huge mistakes.  First of all, I was shocked to see that Steven Foster wasn’t on this dub.  Yeah, he quit a while ago, but I’ve only ever seen lip-synching this bad under his direction.  In his heyday, his response to the critics blasting him for his translation choices was to release dubs where he stayed true to the original Japanese right down to the letter, and stopped giving a fuck about lip flaps.  These were his *better* dubs, so I’m kind of assuming the company figured out from him that they can do this to save some time and effort and still remain on peoples’ good sides.  This purely speculative explanation, whether true or untrue, doesn’t excuse the final product, where characters talk while their mouths are closed and stop talking while their mouths are still open.  It’s over-all a pretty sloppy job, but the other mistake is even worse.\\n\\n\r\nSee, there are several voice actors in the anime industry who have immediately distinctive voices.  I like to bring these individuals up as...  How can I put this gently...  Target practice for beginner voice chasers.  You don’t need much experience in voice chasing to recognize voices like Greg Ayres, Luci Christian, Monica Rial, Brittany Karbowski, J Michael Tatum or Hillary Haag, because while these are all fantastic actors, they can not disguise their voices for shit.  This usually isn’t a problem, as you don’t need to be a chameleon to be a good actor, but Nakaimo presents a unique circumstance.  The plot of the story revolves around finding out which member of the harem is Shogo’s little sister, and right in episode 1, we’re given a brief clip of the sister’s real, unfiltered voice.  Sentai was clever enough to not credit this voice, but it uses the same actor as the eventually revealed sister character, and they used the most distinct-sounding voice actor they had.  They could have used Emily Neves, who’s actually really good at disguising her voice, but nope!  Even the most unseasoned of viewers can figure out the mystery as soon as the sister talks again.\\n\\n\r\nFor this reason and this reason alone, I almost want to recommend the Japanese track with subtitles, as the sub didn’t make this mistake, but if you did that, you’d be sacrificing what actually turns out to be a pretty awesome dub.  I’ll admit that Clint Bickham is a bit awkward in the beginning, but he grows nicely into the character before long.  Monica Rial and Brittany Karbowski play his two most prominent love interests, and of course, they’re more than reliable even with the worst material, which is good, because by the end of episode 1, they’ve respectively gushed to themselves over how puffy and cream-filled their boobs are and tried to badger Shogo into sticking his tongue into them through convoluted logic.  I would not trust lines like this to any other actors, so thank god the director knew what material to drop in front of what actor.  Most of the actors are newcomers and less-popular names, with the exception of veteran Tiffany Grant as the trio’s homeroom teacher, and while everyone does a pretty damn good job, none of them stand up enough to be brought up on the same platform as our three leads.  If it wasn’t for the serious misstep I mentioned earlier, I’d tell you to skip the dub and watch it in Japanese...  You know what?  Screw it, just do that.  Good acting isn’t worth spoilers.\\n\\n\r\nOff the top of my head, I can pick out two genres and one trend that have dominated the anime landscape in recent years, earning an equal amount of ire from anything but the lowest common denominator of the anime viewing community.  These genres are Harem and Moe, and the trend...  One that many critics wish would just go away and die already...  Is incest.  Specifically little sister incest, because incest without focus apparently isn’t abrasive enough.  The harem genre has been a mainstay for decades at this point, and in it’s trek through time, it’s become one of the laziest, samiest things imaginable.  I mentioned earlier that the characters were drawn to type, and that’s because there are a lot of repetitive types to draw from.  Moe hasn’t been around quite as long, but it’s become just as repetitive with it’s sexist characterizations and shameless melodramatic tragedy porn.  These three elements are copied and pasted to death because they work...  People flock to them, both here and especially in Japan, so nobody bothers changing it.  That would be all well and good, if it wasn’t for the crushing feeling that people pushing out this material know damn well that they don’t have to try.\\n\\n\r\nWell, this was more or less what I was expecting when I bought the series on DVD, but I was very quickly astounded to notice just how much this series DOES try.  It puts forth genuine effort to be more than the some of it’s parts.  If you haven’t had the mystery spoiled for you...  Which means you’re probably watching the sub...  It’s a shockingly good mystery, played out through a story that’s way more interesting than anybody should justifiably expect it to be.  A character is introduced in episode 2 who’s supposed to be the show’s stand-in for one of the worst harem tropes imaginable, the ever insulting “Trap” character,  and while I won’t tell you just what their deal is...  It’ll be more satisfying that way...  I can think of two reasons the character was introduced.  The first I’ll get to later, but the second ultimately makes them my favorite character in the show.  Instead of acting as a member of the harem, they exist to help Shogo unravel the mystery of his sister through their epic set of ninja investigation skills.  This in turn adds a little more depth and attention to the plot, which can often be forgotten among the tons of fanservice.\\n\\n\r\nThe story has many twists and turns, and a handful of the characters do get individual arcs, which is a common enough way for a story like this to explore each member of the harem, but Nakaimo does it a little differently.  While each arc ties into the fleshing out of an individual character, they also revolve around the mystery of his sister’s identity, with each one setting up what we’re supposed to believe is a new red herring for him and his gender-neutral ninja sidekick to discuss and solve.  Each character with the exception of the student council president has their own backstory, their own tough circumstances, and their own reasons for getting tied into the mystery.  What they don’t have, however, is individual reasons to pursue Shogo, because guess what?  Half the harem don’t even really want him!  Only three of the six girls compete over him, with the other three busy pursuing their own interests that he may or may not be relevant to.  It’s a pretty sad commentary on the repetitive nature of the harem genre that THAT’s a breath of fresh air.  Having said that, I liked these characters, underwritten as they may have been, and I genuinely cared what happened to them.  Shuffle and Maken-Ki didn’t make me feel that way.\\n\\n\r\nAfter all that praise, you’re probably expecting me to call Nakaimo a genre defying masterpiece, right?  Oh God no.  It may be one of the better products of it’s genre, but it’s still a product of it’s genre, and as such, it comes with a lot of the same trappings.  When it comes to the writing that carries the series to it’s full run, coincidence is the rule, not the exception.  It’s hard not to roll your eyes at how the different arcs incorporate themselves into the little sister theme, from a girl claiming to be his sister to promote her little sister maid cafe to the entire school thinking Shogo’s so awesome that calling him Big Brother becomes a trend.  Even when the plot gets really interesting towards the climax, it doesn’t...  DO...  A climax, and very little is actually followed up on.  Also, I should probably mention that there’s a ton of nudity in this anime.  Not only that, but they go out of their way to show every female character named at some point...  Well, thankfully, this excludes the teacher.  I generally separate nude scenes into categories of integral, incidental and forced, and while Nakaimo’s are all over the place, most of them feel forced.  Hell, the other reason the gender-flip character exists is to guarantee maximum flesh output.  Seriously, they’re excuse for casual nudism makes the chick from MGS who breathes through her skin seem legit.\\n\\n\r\nOh, and by the way, if you’re one of the special little snowflakes who gets triggered when they hear a work of fiction called ‘sexist,’ you might want to jump on over to one of my other works.  “You can’t call a fictional work sexist, that’s stupid, it’s not real!”  Yeah, well, there’s a reason the term pop culture has the word culture in it.  The way you write people is a reflection of the way you view them, and the popularity of the work is a reflection of how accepted that mindset is.  Nobody watches Coal Black without thinking “That’s racist.”  On that note, there are several character constructs of the harem genre that I consider sexist, and while Nakaimo only hits a few of them, it’s still really bad.  Girls holding onto a crush for well over ten years is sexist and unrealistic.  Girls becoming obsessed over a boy over a misunderstanding that makes her think they’re betrothed is sexist and paints women as idiots.  Girls being so thirsty for the D that they claim being a pedophile is better than being gay is...  Well, I’ll give them this, at least it’s a new one.  But it still ties into the harem genre’s age-old insistence that girls will obsessively want the self-insert male character, and through him, the lonely male viewer. \\n\\n\r\nIf there’s one area where this show actually did come close to impressing me, it’s with the actual little sister character.  While the series begins on a note that some sexy, exploitative Imouto hijinks are about to go down, you find out by the end that while the plot line is wildly misguided, it does manage to follow a more scientific interpretation of incestuous feelings, ala the idea of Genetic Sexual Attraction.  In a nutshell, it’s been more or less proven that when two blood siblings aren’t raised as siblings, they’re genetically predisposed to find each other attractive later in life, and yeah, Nakaimo does adhere to this, whether intentionally or not.  Unfortunately, I don’t think the writers really know what they had with this material, because it’s an uncommon enough subject matter that it still deserves to be taken seriously, and some serious groundwork needs to be laid down before it can ever be approached with this level of ecchi kitsch.  I won’t spoil how the series ends, obviously, but like with all of it’s other promising aspects, it winds up dropping this ball pretty hard.  Like I said before, I do appreciate it for trying.\\n\\n\r\nNakaimo, My Sister is Among Them is available from Sentai Filmworks, and can generally be found on Blu-Ray and DVD at a very generous 30-40 dollar price range.  The set comes with an OVA episode 13, and while it kinda ties something off, it's ultimately not that important to the story.  The original light novel by Hajime Taguchi is not available stateside, and I’m kind of feeling like that’s a good thing, because it continues way longer than the anime, and some of the spoilers I’ve heard about the extended story have been pretty cringeworthy.  The manga adaptation, illustrated by Mottun, is also not available stateside.\\n\\n\r\nDespite it’s unfortunate history, harem anime don’t have to be bad.  They can be great, just like any other genre.  The difference is that all the good harem titles I can think of were high concept works that used the genre as a backdrop for a clear, ambitious plot that received most of the writer’s focus.  A few good examples would be Chobits and some versions of Negima.  I wouldn’t put it anywhere near the same playing field as those titles, but for what it’s worth, Nakaimo DID vastly exceed my expectations.  Of course, I was expecting it to be a 1/10 piece of filth, so that’s admittedly not saying much.  It tried, and at the end of the day, that alone made me develop a soft spot for it.  There was some genuine effort that went into making this title stand out among it’s genre, and while that effort might have ultimately been bogged down and silenced by the trends and clichés of the genre, it still makes enough of an impact to show what the genre CAN be.  I enjoyed this show, I’d watch it again, and I’d even recommend it to a few people, but I’d be a bad critic if I didn’t judge it as a whole.  I give Nakaimo: My Sister is Among Them a 4/10.",
            "date": "2017-01-11T21:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 238092,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=238092"
        }
    ],
    [
        {
            "content": "The story is a bit original, because this guy have to marry a girl who can accidentally be his younger sister. And lucky the protagonist isn't an mediocre idiot, but still not a Don Juan.The art is good so far as i saw, good quality.\r\nNothing to say about the music, not bad. You must watch if you like romance, and harem. it's quite enjoyable if you look for an \"ecchi comedy romance\". But don't be fool and don't look for a \"Clannad\" or \"Death Note\" in this anime.",
            "date": "2012-07-11T11:21:00+00:00",
            "helpful_count": 210,
            "mal_id": 66085,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/489378.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sasha-niichan",
                "username": "Sasha-niichan"
            },
            "url": "https://myanimelist.net/reviews.php?id=66085"
        },
        {
            "content": "Just plain trash just skip this.\r\nThe story could have been good. Its a interesting setup but it gets turned into a stupid clitche harem.\r\nThe dialogue is so bad that I actually have a hard time watching because it makes me feel embarrassed for the characters.\r\nThe storyline has no pace and is just random stuff coming out of nowhere.\r\nI will admit tho the art and animation is pretty good but thats about the only good point.",
            "date": "2012-07-21T09:25:00+00:00",
            "helpful_count": 152,
            "mal_id": 67229,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1105247.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/huehue93",
                "username": "huehue93"
            },
            "url": "https://myanimelist.net/reviews.php?id=67229"
        },
        {
            "content": "Kono naka ni Hitori,\r\nUnlike many other shows, the main character actually has to urgently get a wife which helps develop the plot unlike many other romance stories where the story gets no where. The twist is that he lost his childhood memories and he has a lost sister who is trying to marry him.\r\nThe main character seems like a really nice well rounded person as he is not too much of a pervert, loser or gets into too many accidents. However, as most characters do, he makes stupid decisons that piss people off. The people around him all seem to have their own unique personalities.\r\nSofar, it has been enjoyable without too uncomfortable or stupid moments.\\n\r\nOverall, i would give this show an 8 as it is nothing special but nothing bad either. If you watch it without expectations you'll probably enjoy the comedy and the progression of the plot. However, as most harems are, its not perfect but at least the story is going forward ( doesn't look like a back to where you started story). It's obvious that the main character does not do things the easy way or else there would be no plot and a simple resolution.\\n\\n\r\nI would recommend people who enjoy nice romance anime to watch this.  However it isn't a show for people who want a clever main character that uses strategy to solve his problems like code geass or death note",
            "date": "2012-07-07T14:39:00+00:00",
            "helpful_count": 73,
            "mal_id": 65613,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1188909.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Andyis",
                "username": "Andyis"
            },
            "url": "https://myanimelist.net/reviews.php?id=65613"
        },
        {
            "content": "In my view people are underestimating this anime. \r\nRecommend seeing 3 episodes before of drop the anime, mysteries begin starting the episodes 2~3.\r\nWatch 3 episodes before of give the note for the anime please.\r\nI must also say before that if you do not like animes with hot scenes that appear panties and etc. .. you should avoid this anime, although my goal here is to give you a chance to show.\r\nFor me, the author of this work is doing a very good job at getting to have both an anime thriller with a theme so simple, I see that many people did not understand theessence of the work (his main focus is the suspense, you should not expect he works upon the characters and how their feelings etc. ..) and I come here to try to convince people to give a chance to the anime.\\n\\n\r\nGood talking a little anime itself.\\n\\n\r\nHe tells the story of a son of an owner of a large company who dies and leaves everything to his son but for him to assume the company he has to get married first, on the day of the funeral of his father appears a person saying his sister by  (his father would have had her with another woman who is not the mother of the protagonist), the protagonist moves to a school after the death of his father to find a woman to marry, but before that he needs solve this mystery and find out who is his supposed sister by father (because he does not want to marry his sister.) The anime is totally focused on this mystery and to help in this development appears several other girls in the protagonist's life when he starts attend the college, the anime works fine its mystery story leading you to believe that is one of the girls and it's nothing you of a smack in the face and you already start to distrust another person holds the anime and you're wanting solve the mystery and find out who is the sister that, if you love to solve mysteries and uncover clues like a detective advise you to watch this anime.\\n\\n\r\nProof of it all, is one that appears 2 or 3 girls with the same cell that changes the voice, the question is which of the three who can be? Or is it someone else? Who supposedly said on the radio for the school Shougo (protagonist) who stop looking for her sister? Who was the girl who called him six hours every day? Whoever stole the phone of one of the girls who had thrown it in the trash? Whom is actually the person who helps Shougo and lives on his side?\\n\\n\r\nThat's just some of the mysteries that await you, who seek to be unraveled by someone!\\n\\n\r\nHow about you become a bit like detective?\\n\\n\r\nNote: Since the goal of the anime is the suspenseful if I dwell too much on his description I could end up giving spoilers and many Eventually grace.\\n\\n\r\n----------------------------------------------------------------------------------------------\\n\\n\r\nHistory: 10\\n\r\nSuspense is the essence of this anime, and he is very well done in this part, as I said above still can not solve the mystery, and keep seeing the episodes to see if I can find any clues.He will play for one side to the other and making you believe a track that is not true and nothing you're already distrusting someone else (as I said above), every detail leaves you intrigued and each new track makes you seek links with other previous tracks to try to solve the mystery, it really is exciting in that respect.\\n\\n\r\nArt: 9\\n\r\nThe anime art is good, and very detailed, perhaps a bit too colorful and glossy, but you get used to it,scenarios are well made in every detail and the characters also has appearances quite pleasant with well defined traits.\\n\\n\r\nCharacters: 7\\n\r\nI think it might be one of the weaknesses of this work, I really think that it ta strong in its suspense because the characters do not make you like them, do not have a work upon the feelings of the characters, what they think, what they think, really the whole work is focused on suspense.\\n\\n\r\nSound: 7\\n\r\nThe sound should be the weakest part of the anime, are not well placed, in the opening scene has a sound more or less, the closure is a bit better, if you expect an anime Kimi to Boku like that in my opinion has a fantastic sound and good choice of songs, Kono naka probably will not suit you.Some scenes even have music and they do not fit the times he has, but as the anime style is mystery, suspense think to understand a little of that side, the strong anime of this genre does not have to be sound (is how I see it)\\n\\n\r\nEnjoyment: 7\\n\r\nThe anime is fun and provide a sense of wondering what will happen next, if you expect an anime filled with comedy, comedy scenes without forced and more natural, you probably will not like this anime.Now if you expect that anime makes you actually engage with it, try to understand what goes into it, that detail is what this show is for you.",
            "date": "2012-08-29T01:41:00+00:00",
            "helpful_count": 40,
            "mal_id": 71091,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1386051.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/slyffer",
                "username": "slyffer"
            },
            "url": "https://myanimelist.net/reviews.php?id=71091"
        },
        {
            "content": "(Previously on \"WHO IS IMOUTO?”)\r\nShougo had just came back from his father's funeral. He had learned about his large inheritance, but in order to receive it, he must attend a school and get married to a lovely girl. But, one of the girls is his long-lost sister. Shougo, heir to the Mikadono Group, knew he didn't want to bone his sister, so he became a temporary Private Investigator, searching and uncovering the identity of his long-lost sister. Will he succeed? Or will he bone his sister?\r\nWith his naive, kind, and determined personality, he ventures forth into the unknown school called Miryuin Private Academy and searchesfor his sister. There, he encountered many women, like the blond, competitive princess Rinka, or the childish and quiet student council president Mana, or the mysterious witch girl. Every girl he encountered were suspicious and questionable. He needed an assistant and, thus, Ikusu, aka 'Mr. X', showed up. With 'Mr. X, as his partner, they followed up on some leads and would soon uncover the mystery. Or will they?\\n\\n\r\n[Cue the CSI Theme Song: “Who are You” by The Who]\\n\\n\r\n(On this Episode of \"WHO IS IMOUTO?”)\\n\\n\r\nPrivate Investigator Shougo has been, for three days, searching for the elusive Imouto.  He has followed up on several leads, all of which had led to dead ends. As of now, there are five potential candidates, and they all seem very suspicious, as if they know who is the real “IMOUTO”, but refuse to tell him.  He was getting desperate.  He needed evidence, he needed some lead.\\n\\n\r\nJust when he was at his wit’s end, Mr. X, his partner, burst through the door.  She noticed his frustration and offered a suggestion.\\n\\n\r\nShe said, “Why don’t we do a DNA test?  I’ll get the hair samples of all the candidates and then we can compare them with your hair.”\\n\\n\r\nHe had almost forgotten that Mr. X was a ninja in training, and it completely slipped his mind to use a DNA test.  What a fool he was.\\n\\n\r\nHe said, “Your right!  Why didn’t I think of that?  Go get the samples, and then perform a DNA test.”\\n\\n\r\nShe complied and went out the front door.\\n\\n\r\n[Several days later.]\\n\\n\r\nThe results were in, Shougo was holding a vanilla envelope, which contained the answers.  He opened it and stared at the contents.\\n\\n\r\n“My God”, he said, “This can’t be true!? Can it?”\\n\\n\r\n“What? What happened?  Who is it?” asked Mr. X.\\n\\n\r\n“This girl. I…I was close to her…very close to her! And, yet, she’s my sister!”\\n\\n\r\n“Tell me, who is it? Tell me!\" she yelled.\\n\\n\r\nHe stuttered, “It’s…it’s…it’s…\\n\\n\r\n*Tune in to next time on “WHO IS IMOUTO?”. Where we reveal the true “IMOUTO” or is it?*",
            "date": "2015-05-19T22:22:00+00:00",
            "helpful_count": 38,
            "mal_id": 188242,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4408661.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 7,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Blood_Diver_A",
                "username": "Blood_Diver_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=188242"
        },
        {
            "content": "Kono Naka ni Hitori, Imouto ga Iru anime, like most recent animes, is an adaptation of its manga. \r\nStory: Shougo Mikadono is the son of a famous business man that is left with a will which states that he will be the successor of the company also has to marry before graduating highschool. However his long lost sister, who keeps her identity anonymous, states that she will marry him. Of course incest is creepy shit, so Shougo wants to avoid this but the imouto (sister in japanese) will attend his highschool where she will try to make him fall in love with her. Remember hedoesn't know who she is which poses a problem\\n\\n\r\nThis idea is actually pretty intresting but oh. my. god. it was poorly executed. Now you obviously know that the girls on the cover are part of Shougo's harem which means character development would be quite difficult. But its like the team barely put any effort at all. Based on the 1st episode a girl suddenly shows a romantic interest. Now this probably would send a message to the audience that \"hey this girl seems to already have feelings already which makes her suspicious already.\" But god damn when the 2nd girl was introduced she also SUDDENLY have feelings. Now you can tell that this story was rushed beyond believe, and will continue, because 2 of the 5 girls were introduced where they are in \"good\" terms with the male without any decent reason. i honestly wouldnt be suprised if all the girls \"fall in love in first sight.\" If thats the case then Shougo is a lucky bastard. \\n\\n\r\nNow that i established that character development is not even present in this anime i'd like to say that the dialogue is just terrible and ive already scene a typical boy-meets-girl cliche. *spoiler alert* The girl with black hair, Tsuruma Konoe, was saved by an incoming truck by Shougo who pushed her out of the way. no wait....THE BUS FUCKING HIT HER. I'm not even kidding folks she was smacked by a truck. Next thing you know the boy runs to ask the girl if shes okay and she didn't even have a bruise....wow hulk mode. *spoiler ends* \\n\\n\r\nI want to quickly top this off by saying that this is a generic harem bullshit. Actually this reminded me of other generic animes such as Fortune Arterial and R-15 and guess what, same director. I also realized he did kissxsis which was actually decent-good but how coincidental is the fact that both animes are related to incest. \\n\\n\r\nArt- Not jaw-dropping but okay. You obviously won't see the insane animation works from Hironori Tanaka or Takashi Hashimoto but the actual art is good\\n\r\nI give it a 7....i give the artists a 10 for having the balls to stick through this project. -respect-\\n\\n\r\nSound- I'm not even sure how to rate this. everything sounds normal. Now if your talking about the OP and ED, those are just so annoying to listen that i had to skip them. the voice seems typical but the background music for the OP is just a mess. The different sounds aren't even aesthetically place. Its just a messy bunch imo.  But in the end its whatever the viewers preference is because music is music. \\n\\n\r\ncharacter: Oh god....Okay let me start by saying you will probably never see any character development but there are distinct personalities with each girl. Shougo is just a failure...excuse me he's just really typical guy who happens to be rich. Now that could be ideal for his situation but when you start to see him talk and move around...you would much rather see him be an asshole or some cocky person where he can be somewhat intresting. \\n\\n\r\nHere's my take on the girls. they are all going to be distinct but ridiculously bland in their category. the tsundere in this story probably blushes by looking at the cloud that Shougo is looking at. Nah I'm kidding but don't expect to see very very good tsunderes like aisaka taiga or louise (both voiced by kugimiya rie i might add)...hell don't expect anything that would make you grow attached to them. oh yea the dialogue is just bad, no intresting conversations whatsoever. \\n\\n\r\nenjoyment: I was actually frustrated and bored. I've read the manga and found it pretty interesting so i was somewhat excited by the anime adaptation of it but boy i was disappointed. With this very bad start to this show it almost seems impossible to bounce back and have a good finish. I gave the story a 6 because it had POTENTIAL...lets just hope the anime can use the interesting plot to their advantage....probably not. \\n\\n\\n\r\nOverall: it is generic, boring, and boring and boring. \\n\r\nIn all seriousness its just bad in my opinion but i won't be surprised if other people enjoy it. This doesn't mean that those guys or girls are trees with no sense of taste but i for one already can't stand it.",
            "date": "2012-07-12T21:40:00+00:00",
            "helpful_count": 34,
            "mal_id": 66263,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442440.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/StreetSmartz",
                "username": "StreetSmartz"
            },
            "url": "https://myanimelist.net/reviews.php?id=66263"
        },
        {
            "content": "NakaImo\r\nFast review.\r\nStory\r\nThe problem with this anime is that it was predictable, the story is good but predictable and in the 9th episode i knew who the sister was, it was obvious if you payed attention to the things they said and what they knew till that episode, and even in the first episodes i knew she was going to be the sister with another suspect that i had, but i knew it, was predictable so the story was fine.\r\nArt & Animation\r\nBeing an ecchi harem anime this should have great art, but it was just good, nothing amazing or great, the uncensored parts were fine, Ikusuparts were good and funny, it was good overall, don't expect much nudes.\\n\\n\r\nSound\\n\r\nIt was fine, the voice acting was good, but the background music was ok, the OP and ED were boring, overall was fine.\\n\\n\r\nCharacter\\n\r\nAlmost everyone were ok, just Miyabi and Ikusu were interesting and sometimes Konoe, but it was fine because of somethings that you will see, if you get to watch it.\\n\\n\r\nEnjoyment\\n\r\nI enjoyed the art and the comedy mixed with the ecchiness, it was fine.",
            "date": "2015-08-07T15:56:00+00:00",
            "helpful_count": 28,
            "mal_id": 195457,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195457"
        },
        {
            "content": "Okay this is my very first review ever, so don't be too harsh for me.\r\nWhen I first got my sight on this anime, I immediately thought it's gonna be boring, half-baked anime, that's what I had in my mind after seeing how low the anime is rated on MAL. But as soon as I started watching the anime, I was pleasantly surprised, it was way better than I expected it to be, in my opinion the anime is highly underrated, and deserves to be rated better.\r\nStory: 7/10\r\nThe story of Kono Naka ni Hitori, Imouto ga Iru! was pretty good in my opinion. Sure it wasn'tsomething unique, just another school romance anime with some harem, but there is no way I would call it boring. The story itself kept me intrigued untill the very end. Anime seemed to be dragged out, and the second half of it wasn't even close to being as good as first half. Then the humor was typical, boring jokes and of course how without accidental tits squeezing situations. The ending left some questions in my head. It just felt too rushed and incomplete. I don't know If I can expect another season, since the anime wasn't successful. Probably not. :(\\n\\n\r\nIf you're looking for something impressive or unique, this anime might not be for you. But if generic school romance comedy is what you looking for, you might be left satisfied with this.\\n\r\nSure this isn't maid-sama, or toradora but definitely \"worth giving a shot\" anime.\\n\\n\r\nArt & Animation: 8/10\\n\r\nThis section is pretty hard to talk about, because there's not much action, where the animation capabilities could be seen properly. But anime itself was pretty pleasant to watch, characters seemed to be drawn modern, didn't really felt like watching 90s anime. Only downside I disliked was the shining redness on girls shoulders, knees, and everyone knows where else.\\n\\n\r\nCharacters: 7/10\\n\r\nIf the story is cliché and generic, could the characters present themselves as deep, interesting personalities? Dont think so.\\n\\n\r\nTsundere girl? Check. The good girl (a.k.a. the Tsuruma, Konoe)? Check. Perverted friend that supports and helps main hero? Check. There are no characters that would be totaly unique, and all the girls seem to be somewhat similiar and maybe even too unexceptional.\\n\\n\r\nThere also was little character development, characters changed (sensibilities, deeds, likes, motives) really little through the series. Despite that it wasn't boring to watch.\\n\\n\r\nOverall: 8/10\\n\r\nNakaimo obviously isn't amazing nor great anime by any means. But sometimes it's totaly enought to be an enjoyable anime by what this has to offer. It brought nothing new to the table, but my hand just can't rise to give a worse rating to the anime, that kept me intrigued throught the series untill the very end.\\n\\n\r\n---\\n\r\nEnglish isn't my main language so I apologise for possible spelling or grammar mistakes in advance.",
            "date": "2014-12-14T07:20:00+00:00",
            "helpful_count": 14,
            "mal_id": 172175,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4042001.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Augiz",
                "username": "Augiz"
            },
            "url": "https://myanimelist.net/reviews.php?id=172175"
        },
        {
            "content": "Hooray! My first review! I just happen to download this randomly, and it turned out regrettably a waste of time... I barely able to finish the whole episode.\r\nStory 5/10\r\nWell, the prologue turned to be quite simple. Nothing deep. Confusing at some point... \r\nArt 5/10\r\nThe art it just aint my type. Average. Not the type that will make you fall in love with and keep you watching even if the story is unpleasant.\r\nSound 4/10\r\nNothing special.\r\nCharacter 3/10\r\nIn my opinion... A lame pathetic looking main character, and unbelievably annoying bunch of female characters.\r\nEnjoyment 2/10\r\nAt first, I was kind of interested in the story, even though the art andcharacters didn't simply fit my taste... but as the story progressed, I begin to lose all of my interest.\\n\\n\r\nWell, I honestly wrote personally what I think. In the end, it all depends on your taste.",
            "date": "2012-07-09T16:00:00+00:00",
            "helpful_count": 12,
            "mal_id": 65859,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/447076.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Officer-Kaoko",
                "username": "Officer-Kaoko"
            },
            "url": "https://myanimelist.net/reviews.php?id=65859"
        },
        {
            "content": "Before I start, let me tell you that I'm a big fan of Harem animes (Hoshizora E Kakaru Hashi, Mashiro-Iro Symphony, Akane-Iro Ni Somaru Saka and the such) so I'll write this review on the viewpoint of a harem fan.\r\nLet's start! ^o^\r\nStory: You are given the chance to be a heir to a big company. The only condition is that you should get married first. So you enroll in a school so that you can find your typical waifu (wife) then, suddenly, you have five awesome and beautiful girls sorrounding you. You can choose one of them so that you can marry her and leadthe company.\\n\\n\r\nSounds like a dream life eh? You get to choose who you want to marry and become rich at the same time. It's like hitting two birds with one stone.\\n\\n\r\nThe TWIST: One of those 5 awesome and beautiful girls is your long lost, blood-related Imouto (Little Sister) who was separated from the family long ago because she is an illegitimate child.\\n\\n\r\nNakaImo is a little original when it comes to the story part. A harem anime typically consists of three or more girls fighting for the love of the male lead but the twist is what made it original. I can't even imagine myself being in the shoes of the male lead because it's so hard to choose even though some guys are saying that there's only 20% chance that the male lead can choose his Imouto by mistake. It's only a little original because the characters have the same personality for a harem anime. (Which will be discussed later in the character part)\\n\\n\r\nArt: The art is what I liked most about this anime. The girls are, well, how can I say this? Have a little moe (as in moeblobs from K-on!! or Upotte!) and then all of them are kawaii (Like those girls in Visual Novels). I admit, I have a crush on all of the girls in this anime (especially on Konoe Tsuruma).\\n\\n\r\nSound: The OP single (Choose Me ♥ DAARIN by StylipS) is what's catchy about this anime. I usually repeat this song again and again on my phone when I'm on the bus. I can't find anything else about sound that caught my attention.\\n\\n\r\nCharacter: The typical harem anime. We have a genius, silent-type, class president, vice-president (not to mention a TSUNDERE (by the way, I'm also a big fan of Tsunderes. I want to have a Tsundere girlfriend in the future)).\\n\\n\r\nEnjoyment: If you're looking for a typical harem anime with a not-so-typical storyline, then NakaImo is for you. After all, the fanservice given by this anime can make you squeal. (I don't want to spoil you but I can't get the sound Konoe made when she was squealing out of my mind).\\n\\n\r\nOverall: If you're a big (and I mean BIG) fan of Harem animes, then this is for you. The love story isn't too heavy unlike Mashiro-Iro Symphony (or Princess Lover!) and it isn't too light unlike Hoshizora E Kakaru Hashi.",
            "date": "2012-09-06T02:41:00+00:00",
            "helpful_count": 12,
            "mal_id": 71669,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155579.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/loveiszero",
                "username": "loveiszero"
            },
            "url": "https://myanimelist.net/reviews.php?id=71669"
        },
        {
            "content": "I know that almost everyone says this, regardless of whether it is true or not, but this is truly my first review. i dont know what rupok93's problem is but i would guess he is a huge shonen jump fan and landed on this anime by mistake, and simply cannot see the beauty of harem anime. \r\nStory: 10\r\ni love the concept of having the main character having to choose from a group of girls without accidentally choosing his sister by mistake. \r\nArt: 10\r\nThe artwork is great and does not affect the entertainment level of watching this series\r\nSound: 8\r\nnothing too special but its not bad butnot the best either\\n\\n\r\nCharacter: 10\\n\r\ni enjoy all of the characters in this series. my personal favorite is konoe but all of the girls are good. and none of them are annoying or bring down the overall enjoyment of the series.\\n\\n\r\nEnjoyment: 10\\n\r\nnuff said\\n\\n\r\nOverall: 10\\n\r\nto be honest with you i have no idea why this anime is ranked in the 3000s. i believe that it should be within the top 1000 atleast if not the top 500. it is by no means the best anime i have seen, but it is for sure the best harem i have seen. i enjoy this anime much more than i did highschool dxd or sekirei. if you are a fan of harem i recommend this anime to you.\\n\\n",
            "date": "2012-07-22T17:15:00+00:00",
            "helpful_count": 8,
            "mal_id": 67371,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1253421.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnimeGuruTV",
                "username": "AnimeGuruTV"
            },
            "url": "https://myanimelist.net/reviews.php?id=67371"
        },
        {
            "content": "Every guy wishes to become someone successful and famous that all the girls would just scream out his name and asks for marriage. And that is Kono Naka ni Hitori, Imouto ga Iru!, shortened as Nakaimo, premise. So allow me to vent out my thoughts for the show.\r\nSTORY: 5/10\r\nIt may not be the first to feature this, but Nakaimo still delivers a story that has been retold by many animes before. From the start of the story, the show made it clear that it will definitely include some incest - specifically brocon - which I am now getting used to. \r\nNakaimo centers around Shougo Mikagami,the next head of his late-father's successful company who is sent to Miryuuin Academy to look for a life partner but is thwarted when news of him having a little sister who attends the same academy as him came in and is now struggling to find her. Along the way he meets various girls that took interest in him but Shougo is having trouble choosing from them fearing that one of them maybe his little sister.\\n\r\nThe story's a first but the main concept is as bland as ever. But a plot twist in the end did earn a few points for me. However, it alone can't make this stand out from the bunch. The story can also be humorous from time to time while fan service is just waiting around the corner preparing for a proper scene to show off some thin fabric and skin, which kept me either ogling or annoyed when it became too much. The story all throughout didn't exceed my expectations but what was surprising is the revelation on who Shougo's true little sister is. Wanna find out, watch it yourself.\\n\\n\r\nVISUAL QUALITY AND AUDIO: 7/10\\n\r\nLike its story, the visual is what you'd expect from the given genre. The art emanates warm colors found in the well detailed backdrops. Character design is pretty especially how they highlight a given character that it separates it from the rest of the cast. Animation's decent too.\\n\r\nVoice acting is well delivered and greatly mimics the character's expressions. Soundtrack is good but not all memorable.\\n\\n\r\nCHARACTERS: 7/10\\n\r\nNakaimo features a cast of wacky people; the protagonist, the busty honor student, a tsudere swimmer, a cross-dressing ninja, a blonde elitist, a gluttonous president, a young shop manager, and even a loli teacher. Given that, their personalities and characteristics are quite unique but it still what you'd expect from an anime of this genre. Their girls' ways to approach Shougo  is quite amusing and sometimes humorous. Character development takes place as the story progresses.\\n\\n\r\nOVERALL: 7/10\\n\r\nNot the kind of an anime that will go against the flow but Nakaimo delivers a fun-filled romance story. I greatly enjoyed this that I finished the series and I'm still willing to watch it all over again. So Nakaimo is worth checking out in your into the common harem genre.\\n\\n",
            "date": "2013-11-06T05:46:00+00:00",
            "helpful_count": 6,
            "mal_id": 119463,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3288039.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JonBort",
                "username": "JonBort"
            },
            "url": "https://myanimelist.net/reviews.php?id=119463"
        },
        {
            "content": "Kono Naka ni Hitori, Imouto ga Iru!\r\nWhere you get to watch a young man named Shougu Mikadono play the pray like hell that I don't fuck my sister game, which is a fun game to play.\r\n*shh it's the one we all think it is*",
            "date": "2015-08-13T16:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 196084,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4577865.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NewYearsDay",
                "username": "NewYearsDay"
            },
            "url": "https://myanimelist.net/reviews.php?id=196084"
        },
        {
            "content": "How to start this review... I guess I could start by saying that Nakaimo: My Sister is Among Them!, or Kono Naka ni Hitori, Imouto ga Iru! if you prefer the Japanese name, is an ordinary harem/echii anime. Or, at least, that's what I thought when I began this series. In all reality, it's a unique series to it's genre, and I mean the harem genre, not the echii, since there are multiple animes with similar echii aspects.\r\nAs for the story, I found it unique and interesting throughout the entire series, and quite enjoyable really. The story goes like this: The president of a highlysuccessful company has just died, leaving his entire company to his son, however, in order to inherit it, he must get married by the end of his high school life. So he has been sent to a new high school to start looking for a bride-to-be. But, there's another catch, he has a sister that his family never knew about, and she goes to the same high school as him, and what's even more surprising, she's in love with him and wants to marry him. So now, he has to figure out which girl is his sister out of an entire group of girls that are potential wives. When I found all of this out, it got better each episode. The thing is, you never know who his sister is until the very end, and the series keeps making you think one thing, but then takes a giant curve and gets you thinking about another thing, and I never saw the ending coming. Very good story.\\n\\n\r\nArtwork, similar to most animes being made these years. The designs of the characters are well made, you are able to tell them apart easily, and the setting seems modernly realistic. All aspects in which make a good anime.\\n\\n\r\nAs for sound, voice acting was well done, I recognized some actors and actresses from other animes. I didn't like all of them, but that's just me. Overall, very professional and well done.\\n\\n\r\nI think what I liked about this story were the choices in characters. The main guy seemed really cool, and down-to-earth, unlike some characters you may find in animes these days. He was mature in some parts, but had just the right amount of a perverted side to him as most normal teenage boys would, so he seemed real to me. As for the girls, I liked them all, especially Rinka, my personal favorite. They all had different personalities, and they were all in love with the main guy, or at least I assume so. In the story, they each get their moment in the spotlight, so the screen time was evenly distributed between them so they each have about 2 episodes about themselves, and the moments in this anime that made me laugh the most were always where the girls were thinking that Shougo has a thing for guys whenever something weird is happening between him and Ikusu (which obviously isn't a guy).\\n\\n\r\nI can honestly say that I didn't hate this anime. In terms of fanservice, believe me, there's plenty of that. There were moments of awkwardness that made me cringe, which is common in most echiis these days, and of course, there's always just enjoying one guy getting loved by a bunch of girls to an extent where you wish all his girl troubles were yours. It wasn't until the end where I was unsatisfied on where the story went. This isn't really spoiling anything, but like in most harems, the main character never chooses which girl he will get with, it'll end with all of them proclaiming their love to him or something like that. Even though it had an unsatisfying ending, I do recommend this to anyone looking for a harem/echii with fanservice and a good storyline.",
            "date": "2013-04-10T19:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 93335,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=93335"
        },
        {
            "content": "I guess I'll never see profiteroles the same way after watching this one... With a really flawless plot, what screws it was the share of uncensored fanservice moments. Can't say it wasn't good, but great animes don't appeal to that...\r\n{STORY - 5/10}\r\nAfter the death of Kumagorou Mikadono, his son, Shougo, gets transferred to Miryuuin Academy, with the mission of finding the girl with whom he would spend the rest of his life. This needed for him to become the new president from his father's entreprise, the Mikadono Group.\r\nProblem is that Shougo has an unknown half-sister, whose has promised marrying with him and studies at thesame academy. Soon enough, Shougo starts attracting some particular girls, unable to date them under the risk of getting in love with his sister.\\n\\n\r\nAn well elaborated main scheme, based on all this situation, is proved to be related with Shougo's ascension. Discovering who his real sister's identity is required to avoid a huge scandal against the Mikadono Group.\\n\\n\r\nConstant calls from a misterious girl that artificially modificated her voice and claims to be Shougo's sister makes him concerned. The device used turns into a lead. Still, putting and end to this mistery seems impossible, as the suspect changes everytime...\\n\\n\r\n{ART - 6/10}\\n\\n\r\nNothing that much impressive, but overally gorgeous. All girls are beautiful and the eye design is amazing. Everything looks so smooth and sweet...\\n\\n\r\n{SOUND - 7/10}\\n\\n\r\nSimple backgrounding and really nice OP and ED songs. Both of them match this anime's style, being cheering and cute. Other thing I noticed is the use of unrelated songs at Mei's cafe. First time this happens to me...\\n\\n\r\n{CHARACTERS - 5/10}\\n\\n\r\nThere are few, but all of them are very distinct. Shougo is one of those confident guys, who has a charming side and respects women. Not knowing who is his sister prevents him from showing true affection to all the other girls that he knows...\\n\\n\r\nKonoe and Kannagi are the first ones Shougo meets. The fact that both are childhood friends is forgotten as he suffered an accident on that time. Konoe shows a calm and sweet personality, being a total pervert on the inside. Kannagi loves Shougo since the first day they met, but she's unable to show her feelings and wants to stay by his side all the time.\\n\\n\r\nThe cafe owner and prodigy girl, Mei Sagara, deeply relates to Kannagi and is a essential piece from this puzzle. Rinka is also on the middle of this entire scheme, as her father is a Mikadono's rival. After being helped by Shougo, she starts developing feeling for him too. Like on many other seinen manga based animes I've watched, there's also a woman that disguises herself as a man... I don't know why but I feel attracted to this type of character every time I see one...\\n\\n\r\n{ENJOYMENT - 10/10}\\n\\n\r\nIt's impossible not liking an ecchi... Other than that, the mistery involved is awesome. It just keeps you wondering who the real sister is on every episode, with a true answer being shown only at the ending... It was totally unpredictable and that's why I liked it so much.\\n\\n\r\n{OVERALL - 6/10}\\n\\n\r\nChoosing someone affraid of a blood relation, Shougo is both lucky and unlucky. There's a girl somewhere that wants to meet his brother and be his new family, but her identity is unknown... Shougo has to discover who she is and stay by her side. Until that, starting a deep relationship with any girl could mean trouble and some other problems may get on his way. An investigation full of twists begins...",
            "date": "2013-11-14T04:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 120199,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=120199"
        },
        {
            "content": "+ Imoutos!\r\n+ Absolutely cute and pink art, makes me feel like a cream puff if you know what I mean...\r\n+ Miyabi is cute! x3\r\n+ Funny and cute episodes, like when they're at the ball or amusement park\r\n+ It surprises the viewer couple of times\r\n+/- Old (good?) character types, a good girl, tsundere, a rich girl, a genki and clumsy girl and a cosplay girl\r\n- It doesn't take \"can't sister and brother be lovers?\" -theme to any deeper reflection.\r\n- Too many pointless fanservice and naugty jokes\r\n- Homophopic moments and jokes\r\n- The mystery is kind of boring\r\n- Like usual, the main guy doesn't have any personality\r\n- Theplot is forseeable after all.",
            "date": "2012-10-04T00:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 74041,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1023647.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/CinnamonHime",
                "username": "CinnamonHime"
            },
            "url": "https://myanimelist.net/reviews.php?id=74041"
        },
        {
            "content": "Kono Naka ni Hitori, Imouto ga Iru is a typical harem anime with a serious setting and a mysterious sister. That being said it could have some more comedy as most viewers want mostly two things from a harem anime and that is fan service and jokes. So if you are a fan of the genre and also a story lover more than the fan service and jokes I would recommend this anime.",
            "date": "2012-10-25T04:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 75869,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1226335.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dxbladexd",
                "username": "dxbladexd"
            },
            "url": "https://myanimelist.net/reviews.php?id=75869"
        },
        {
            "content": "This Is My First Review So Sorry If I'm Wrong Haha\r\nThe Anime It Self Has A Outstanding Story Line And Thus I'll Rate It Overall 10. I Enjoyed It Cause Of It's Comedic Parts And Also The Romantic Stuffs. I Love The Genre \"Romantic\" And This Anime Has It. A Perfect Combination Of Comedy And Romance, Plus The Harem Part Makes It Exciting. Who Will He Choose? Who Does He Love The Most? More Apparently Who Is His Little Sister? Haha I Already Finished The Anime So I'll Say 10 Of 10 Is Worth It.\r\nThanks! Love The Anime! Hopefully It'll Have Another Season.",
            "date": "2014-12-22T07:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 173619,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/IanVrix98",
                "username": "IanVrix98"
            },
            "url": "https://myanimelist.net/reviews.php?id=173619"
        },
        {
            "content": "My sister is among them! As undoubtedly noted in synopsis, this follows a young lad slated to helm his father's company. To that end, he's transferred to a prestigious school with the goal of choosing a wife. To add a plot twist, he gets a mysterious caller who names herself his sister--and in that culture, marrying your sister is a terrible scandal!\r\nThat's most of the story. Most of bits remaining consists of Shougo's getting along (or not) with the various girls. This is a harem story and ecchi genre, so panty shots and other lewd stuff happens. The aforementioned mystery begins appearing in episode 9,but if you've read any detective or mystery stuff, you'll probably be able to guess some of it.\\n\\n\r\nOverall, the story was meh. I don't mind some suspense, but had to force myself to sit through very bland characters and their schoolgirl doings to get to the \"what's really going on behind the scenes?\" Just me, but the story felt stilted aside from the mystery.\\n\\n\r\nArt's pretty straightforward. Each girl is reasonably pretty, and the expressions look human enough. It's possible to forget you're watching an anime, if try hard enough, but otherwise nothing remarkable.\\n\\n\r\nNothing about the sound or music impressed me. Maybe my high standards, but it felt like the anime's producers were rushing to get it done rather than get high-quality work.\\n\\n\r\nCharacters...eesh, seen better. Shougo is very much not a confident guy, always easily pushed around. It's only when he decides to take on the mystery that he suddenly becomes fascinating. Even after, nope, he doesn't have any confidence with girls; frequently it's the girl who asks him on a date, he just goes along with it.\\n\\n\r\nNow the girls:\\n\r\n1) Konoe is a typical \"easy catch for harem guy\"\\n\r\n2) Myabi, your really insecure girl\\n\r\n3) Kunitachi, student council member who puts on a fierce air to hide her own bashfulness around Shougo. If this is an tsundere character, that never gets explored nor explained.\\n\r\n4) Tendou, student council president, is just a rambunctious kid with great love of food\\n\r\n5) Sagara was genuinely interesting for a bit, as she is involved deeply in the mystery and doesn't fall for Shougo suddenly, but after the series she's just another has-been\\n\\n\r\nEnjoyment...if you come without standards, maybe you'll enjoy the suspense and fan service. I prefer anime with a good story, believable characters, and solid plot. Definitely not a good choice for serious anime fans.\\n\\n\r\nOverall, it was very bland. I found the answers to the suspense probably the only exciting thing, everything else felt too rushed to be worthwhile. I actually stopped watching midway through once because this was so dull.",
            "date": "2019-01-18T15:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 299389,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Brom2855",
                "username": "Brom2855"
            },
            "url": "https://myanimelist.net/reviews.php?id=299389"
        },
        {
            "content": "Shogo Mikadono had been living a comfortable, carefree life up until high school.  As the only child of the Mikadono group, a wealthy network of the Mikadono family and it’s friends and business partners, he’s been selected as the sole heir to the company and family name that his father, Kumagoro Mikadono, has dedicated his life to strengthening and expanding.  Unfortunately, on the day of his ageing father’s death, when Shogo is finally given a taste of what’s written in the family patriarch’s will, it’s revealed that in order for the young heir to inherit his father’s very lucrative estate, he must undergoone final task;  To enroll at a certain high school, fall in love with a dignified and agreeable classmate, and make her his fiancee, with whom he’ll be sharing untold riches on the day of their marital vows!  It might not be the most romantic grounds for a proposal that anyone’s ever heard of...  Still beats the idea of having to come together to repopulate the earth, when you get right down to it...  But for a rich man to marry an attractive woman who’s only interested in business and money isn’t a new concept, and it certainly isn’t unheard of.\\n\\n\r\nHowever, as is the unfortunate pattern of life, even the simplest plans must become complicated somewhere down the line.  Not long after hearing about this stipulation, he’s confronted from just out of reach by a soft, reassuring voice that he won’t always be alone...  That the owner of the voice is his long lost sister, who has every intention of marrying him and staying by his side forever.  Wait, did I say soft and reassuring?  Because I meant deeply concerning, as it turns out that his father did in fact father an illegitimate daughter who’s been separated from him since birth, and to make this revelation even more shocking is the fact that the girl with the voice is also going to his new school!  Now, his attempts to pluck a bridal rose from a garden full of crazy weeds is being hampered by the fear that one of his sultry suitors may actually be his secret sister!  This matrimonial minefield is made even harder to cross by the fact that with each step that moves him forward, he’s being confronted by red herrings that are only pretending to be his sister for their own ends.  Can Shogo safely pick the woman of his dreams and collect his rightful inheritance, or is the only thing he’s bound to inherit a deformed child and a one way ticket to Alabama?\\n\\n\r\nYou know, the longer I do these reviews, the more likely I am to cross every single animation studio off of my list at some point.  This time around, we’re talking about Studio Gokumi, a company that spun off from Gonzo in the early 2010’s.  The name literally means Studio Group 5, which...  I don’t know.  I have no idea what that does, or even COULD mean on a larger scale.  In any case, they haven’t done very much work, although I have seen two of their shows before, namely A Channel and Yuki Yuna is a Hero, two shows whose best qualities were their visual qualities.  A Channel, like most of Gokumi’s early work, was low budget, but managed in such a way that it’s lack of funds could never hurt it in any noticeable way.  Yuki Yuna, like most of Gokumi’s later work, was gorgeously animated with a lavish budget that the producers took full, appreciative advantage of.  Between the two, Nakaimo is closer to A Channel, being one of the studio’s earliest projects, and it looks way better than it really needed to look, given the nature of the material.  \\n\\n\r\nTrue to form, Nakaimo looks perfectly fine.  The visuals aren’t mind-blowing of world-challenging, but they’re more than serviceable enough to be above complaint.  The animators were very clearly working with a tight budget, so the movement on screen is never exactly fluid, but the characters still move just as much as they need to to convey a sense of life.  There are shortcuts taken, which is kind of inevitable in such a situation, as movement occasionally has to be limited to save some money, but it’s never prominent enough to bother even the most astute viewer.  Not to mention, these shortcuts pay off with interest when the show DOES want to dazzle us with more impressive shots, such as one of the main characters swimming in beautifully animated water, or when they need to show us random CG effects like a can flying at someone’s head from off screen.  I’ve said before that given the choice, I’d prefer a well-managed low budget over a lackadaisical high budget at least seven times out of ten, and Nakaimo easily delivers on what I wanted to see from it.\\n\\n\r\nThe artwork is also very pretty, with it’s only real flaw being certain shots where the background has an unnatural sort of heavenly shine to it.  It doesn’t happen often, thankfully, but it’s irritating when it does.  The backgrounds are fairly well drawn, and while most man-made backgrounds to have a surprising level of intricacy in their design and range of details, things like grass, trees and bushes do blur a bit when you look at them closely.  The characters themselves are drawn to type, milking the most cliched archetypes of the ecchi genre dry, extending all the way to the teacher being a little girl.  You’ve got the cosplaying loli, the pigtailed flat-chested tsundere, the overdressed goth-loli sweetheart girl, and of course Itsuke from Haruhi as the protagonist.  It’s saving grace is that once you get past the clichés, the characters are still designed and drawn really well, although the constant blushing can get extremely annoying.  The lighting and filtering effects are also utilized well, if not very often.\\n\\n\r\nThe soundtrack is a bit on the generic side, but it’s not bad by any means.  It’s very pretty in it’s orchestration, but it’s also really repetitive, as any given track just loops around every few seconds or so.  It does it’s job well enough, and you’ll hardly notice it, unless it’s doing the one thing about it that impressed me...  Instead of playing off the little sister mystery as sexy or romantic, moments dealing with the mystery...  AKA phone calls allegedly from the sister and certain off-color remarks tying into it...  Are paired with music that actually manages to make the concept feel creepy or ominous, which is how it damn well should feel, so props for that.  The opening theme, Choose Me Darling by StylipS, is your typical fast, catchy song from multiple harmonized female singers, but what makes it awesome is the percussion underneath it, which creates a pretty memorable beat.  That, and i’m pretty sure a decent amount of the animation budget went into it, as it makes for a pretty awesome watch, and it goes out of it’s way to introduce the characters and several plot points that happen throughout the show.\\n\\n\r\nThe English dub was produced by Sentai Filmworks, and before I start doling out the praise...  Of which I have plenty to go around...  I’m going to have to go into some negatives, because Nakaimo’s dubbers made two huge mistakes.  First of all, I was shocked to see that Steven Foster wasn’t on this dub.  Yeah, he quit a while ago, but I’ve only ever seen lip-synching this bad under his direction.  In his heyday, his response to the critics blasting him for his translation choices was to release dubs where he stayed true to the original Japanese right down to the letter, and stopped giving a fuck about lip flaps.  These were his *better* dubs, so I’m kind of assuming the company figured out from him that they can do this to save some time and effort and still remain on peoples’ good sides.  This purely speculative explanation, whether true or untrue, doesn’t excuse the final product, where characters talk while their mouths are closed and stop talking while their mouths are still open.  It’s over-all a pretty sloppy job, but the other mistake is even worse.\\n\\n\r\nSee, there are several voice actors in the anime industry who have immediately distinctive voices.  I like to bring these individuals up as...  How can I put this gently...  Target practice for beginner voice chasers.  You don’t need much experience in voice chasing to recognize voices like Greg Ayres, Luci Christian, Monica Rial, Brittany Karbowski, J Michael Tatum or Hillary Haag, because while these are all fantastic actors, they can not disguise their voices for shit.  This usually isn’t a problem, as you don’t need to be a chameleon to be a good actor, but Nakaimo presents a unique circumstance.  The plot of the story revolves around finding out which member of the harem is Shogo’s little sister, and right in episode 1, we’re given a brief clip of the sister’s real, unfiltered voice.  Sentai was clever enough to not credit this voice, but it uses the same actor as the eventually revealed sister character, and they used the most distinct-sounding voice actor they had.  They could have used Emily Neves, who’s actually really good at disguising her voice, but nope!  Even the most unseasoned of viewers can figure out the mystery as soon as the sister talks again.\\n\\n\r\nFor this reason and this reason alone, I almost want to recommend the Japanese track with subtitles, as the sub didn’t make this mistake, but if you did that, you’d be sacrificing what actually turns out to be a pretty awesome dub.  I’ll admit that Clint Bickham is a bit awkward in the beginning, but he grows nicely into the character before long.  Monica Rial and Brittany Karbowski play his two most prominent love interests, and of course, they’re more than reliable even with the worst material, which is good, because by the end of episode 1, they’ve respectively gushed to themselves over how puffy and cream-filled their boobs are and tried to badger Shogo into sticking his tongue into them through convoluted logic.  I would not trust lines like this to any other actors, so thank god the director knew what material to drop in front of what actor.  Most of the actors are newcomers and less-popular names, with the exception of veteran Tiffany Grant as the trio’s homeroom teacher, and while everyone does a pretty damn good job, none of them stand up enough to be brought up on the same platform as our three leads.  If it wasn’t for the serious misstep I mentioned earlier, I’d tell you to skip the dub and watch it in Japanese...  You know what?  Screw it, just do that.  Good acting isn’t worth spoilers.\\n\\n\r\nOff the top of my head, I can pick out two genres and one trend that have dominated the anime landscape in recent years, earning an equal amount of ire from anything but the lowest common denominator of the anime viewing community.  These genres are Harem and Moe, and the trend...  One that many critics wish would just go away and die already...  Is incest.  Specifically little sister incest, because incest without focus apparently isn’t abrasive enough.  The harem genre has been a mainstay for decades at this point, and in it’s trek through time, it’s become one of the laziest, samiest things imaginable.  I mentioned earlier that the characters were drawn to type, and that’s because there are a lot of repetitive types to draw from.  Moe hasn’t been around quite as long, but it’s become just as repetitive with it’s sexist characterizations and shameless melodramatic tragedy porn.  These three elements are copied and pasted to death because they work...  People flock to them, both here and especially in Japan, so nobody bothers changing it.  That would be all well and good, if it wasn’t for the crushing feeling that people pushing out this material know damn well that they don’t have to try.\\n\\n\r\nWell, this was more or less what I was expecting when I bought the series on DVD, but I was very quickly astounded to notice just how much this series DOES try.  It puts forth genuine effort to be more than the some of it’s parts.  If you haven’t had the mystery spoiled for you...  Which means you’re probably watching the sub...  It’s a shockingly good mystery, played out through a story that’s way more interesting than anybody should justifiably expect it to be.  A character is introduced in episode 2 who’s supposed to be the show’s stand-in for one of the worst harem tropes imaginable, the ever insulting “Trap” character,  and while I won’t tell you just what their deal is...  It’ll be more satisfying that way...  I can think of two reasons the character was introduced.  The first I’ll get to later, but the second ultimately makes them my favorite character in the show.  Instead of acting as a member of the harem, they exist to help Shogo unravel the mystery of his sister through their epic set of ninja investigation skills.  This in turn adds a little more depth and attention to the plot, which can often be forgotten among the tons of fanservice.\\n\\n\r\nThe story has many twists and turns, and a handful of the characters do get individual arcs, which is a common enough way for a story like this to explore each member of the harem, but Nakaimo does it a little differently.  While each arc ties into the fleshing out of an individual character, they also revolve around the mystery of his sister’s identity, with each one setting up what we’re supposed to believe is a new red herring for him and his gender-neutral ninja sidekick to discuss and solve.  Each character with the exception of the student council president has their own backstory, their own tough circumstances, and their own reasons for getting tied into the mystery.  What they don’t have, however, is individual reasons to pursue Shogo, because guess what?  Half the harem don’t even really want him!  Only three of the six girls compete over him, with the other three busy pursuing their own interests that he may or may not be relevant to.  It’s a pretty sad commentary on the repetitive nature of the harem genre that THAT’s a breath of fresh air.  Having said that, I liked these characters, underwritten as they may have been, and I genuinely cared what happened to them.  Shuffle and Maken-Ki didn’t make me feel that way.\\n\\n\r\nAfter all that praise, you’re probably expecting me to call Nakaimo a genre defying masterpiece, right?  Oh God no.  It may be one of the better products of it’s genre, but it’s still a product of it’s genre, and as such, it comes with a lot of the same trappings.  When it comes to the writing that carries the series to it’s full run, coincidence is the rule, not the exception.  It’s hard not to roll your eyes at how the different arcs incorporate themselves into the little sister theme, from a girl claiming to be his sister to promote her little sister maid cafe to the entire school thinking Shogo’s so awesome that calling him Big Brother becomes a trend.  Even when the plot gets really interesting towards the climax, it doesn’t...  DO...  A climax, and very little is actually followed up on.  Also, I should probably mention that there’s a ton of nudity in this anime.  Not only that, but they go out of their way to show every female character named at some point...  Well, thankfully, this excludes the teacher.  I generally separate nude scenes into categories of integral, incidental and forced, and while Nakaimo’s are all over the place, most of them feel forced.  Hell, the other reason the gender-flip character exists is to guarantee maximum flesh output.  Seriously, they’re excuse for casual nudism makes the chick from MGS who breathes through her skin seem legit.\\n\\n\r\nOh, and by the way, if you’re one of the special little snowflakes who gets triggered when they hear a work of fiction called ‘sexist,’ you might want to jump on over to one of my other works.  “You can’t call a fictional work sexist, that’s stupid, it’s not real!”  Yeah, well, there’s a reason the term pop culture has the word culture in it.  The way you write people is a reflection of the way you view them, and the popularity of the work is a reflection of how accepted that mindset is.  Nobody watches Coal Black without thinking “That’s racist.”  On that note, there are several character constructs of the harem genre that I consider sexist, and while Nakaimo only hits a few of them, it’s still really bad.  Girls holding onto a crush for well over ten years is sexist and unrealistic.  Girls becoming obsessed over a boy over a misunderstanding that makes her think they’re betrothed is sexist and paints women as idiots.  Girls being so thirsty for the D that they claim being a pedophile is better than being gay is...  Well, I’ll give them this, at least it’s a new one.  But it still ties into the harem genre’s age-old insistence that girls will obsessively want the self-insert male character, and through him, the lonely male viewer. \\n\\n\r\nIf there’s one area where this show actually did come close to impressing me, it’s with the actual little sister character.  While the series begins on a note that some sexy, exploitative Imouto hijinks are about to go down, you find out by the end that while the plot line is wildly misguided, it does manage to follow a more scientific interpretation of incestuous feelings, ala the idea of Genetic Sexual Attraction.  In a nutshell, it’s been more or less proven that when two blood siblings aren’t raised as siblings, they’re genetically predisposed to find each other attractive later in life, and yeah, Nakaimo does adhere to this, whether intentionally or not.  Unfortunately, I don’t think the writers really know what they had with this material, because it’s an uncommon enough subject matter that it still deserves to be taken seriously, and some serious groundwork needs to be laid down before it can ever be approached with this level of ecchi kitsch.  I won’t spoil how the series ends, obviously, but like with all of it’s other promising aspects, it winds up dropping this ball pretty hard.  Like I said before, I do appreciate it for trying.\\n\\n\r\nNakaimo, My Sister is Among Them is available from Sentai Filmworks, and can generally be found on Blu-Ray and DVD at a very generous 30-40 dollar price range.  The set comes with an OVA episode 13, and while it kinda ties something off, it's ultimately not that important to the story.  The original light novel by Hajime Taguchi is not available stateside, and I’m kind of feeling like that’s a good thing, because it continues way longer than the anime, and some of the spoilers I’ve heard about the extended story have been pretty cringeworthy.  The manga adaptation, illustrated by Mottun, is also not available stateside.\\n\\n\r\nDespite it’s unfortunate history, harem anime don’t have to be bad.  They can be great, just like any other genre.  The difference is that all the good harem titles I can think of were high concept works that used the genre as a backdrop for a clear, ambitious plot that received most of the writer’s focus.  A few good examples would be Chobits and some versions of Negima.  I wouldn’t put it anywhere near the same playing field as those titles, but for what it’s worth, Nakaimo DID vastly exceed my expectations.  Of course, I was expecting it to be a 1/10 piece of filth, so that’s admittedly not saying much.  It tried, and at the end of the day, that alone made me develop a soft spot for it.  There was some genuine effort that went into making this title stand out among it’s genre, and while that effort might have ultimately been bogged down and silenced by the trends and clichés of the genre, it still makes enough of an impact to show what the genre CAN be.  I enjoyed this show, I’d watch it again, and I’d even recommend it to a few people, but I’d be a bad critic if I didn’t judge it as a whole.  I give Nakaimo: My Sister is Among Them a 4/10.",
            "date": "2017-01-11T21:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 238092,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=238092"
        }
    ],
    [
        {
            "content": "Shougo Mikadono The male protagonist who is the heir to the Mikadono Group. For him to take over,needs to graduate from school as well as finding a life partner so moves to a new school to find that girl.\r\nSimple enough premise, But what sets this series apart is there is a reoccurring sub plot, which is that Shougo father had a kid with another women, a story that if got out in the press could ruin the company's reputation, The story is Shougo trying to find who this girl is, This plot is doing REALLY Well, its presented similarly to a \"Murder Mystery/Who Done It?\"Which in enjoyed, they gave you just enough that you WANTED to watch episode after episode to find the next clue.\\n\\n\r\nUp to a point in this Anime i was rather enjoying it, The Characters had a charm to them, and you get attached to the main lead as for once he wasn't as Wimpy as other guys, But nearer the end of the series, it lost it's focus on the \"Finding a Life Partner\" and pushed the Sister plot a little too much and as a result felt really rushed the last few episodes and left and unsatisfactory after taste, If it didn't end the way it did, Leaving parts of the story not even resolved apart from MAYBE some later OVA (Or 1 Episode OVA Which is an Unaired 13TH Episode) Which could change my ending views, But it comes a little too late for the series as a whole up to this point in time. \\n\\n\r\nAn Anime that started off strong and had some unique things to show, But tailed off near the end, Hurt the scores a little, still a good series, just not great.",
            "date": "2012-10-24T16:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 75849,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1514017.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lukas10",
                "username": "Lukas10"
            },
            "url": "https://myanimelist.net/reviews.php?id=75849"
        },
        {
            "content": "All i can say that is the anime should be called \"Will I﻿ Bang My Sister?\" because...\r\nduh its a harem and boy he doesn't know which one is his sister among his group of horny lady that want him",
            "date": "2013-02-20T20:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 87429,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1914366.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/IDC_SAO",
                "username": "IDC_SAO"
            },
            "url": "https://myanimelist.net/reviews.php?id=87429"
        },
        {
            "content": "This is my first review so please bear with me. \r\nA TL;DR synopsis of this series is a guy who's trying succeed his late father's company, but has to find a lover first. Twist? One of the prospects is his unknown sister. \r\nStory - Score: 5 \r\nAs far as story and plot goes...well.... This was something that hasn't been done before (the core plot theme anyways), but for some reason it kinda makes you shake your head all the same. Another interesting develop-able plot turned into another generic harem situation, which this anime pretty much is. As one of the other reviewer stated, this wasjust a dragged out cat and mouse game. To be fair, it's supposed to do that because that's what the main plot theme was supposed to be: him trying to find a lover while to trying to avoid picking out his sister. However, he makes it plainly clear that he's trying to avoid at all costs. So people who are looking for a wincest anime? Don't get your hopes up please. \\n\\n\r\nLike many wincest potential animes, they are all doomed to deliver. And this one is no exception, if his views and stance is not clear enough. This isn't a spoiler per say because honestly the majority consensus not only in the anime industry but in society in general for incest is terribly harsh. Therefore the wincest element is always just reduced to a plot device or attraction gatherer. And the true ones are tend to be very niche. Don't trust me? You can go see it for yourself.\\n\\n\r\nAnyways going back to the story itself. This is a fairly paced story. It doesn't drag out too long, but in doing so it sometimes feel like it's been a little rushed at times. Also the ending will leave you perplexed due to the anime covering only a portion of the light novel it was adapted from. So honestly it's not even a finished anime. And a second season seems to be not a possibility anytime soon, so you would have to rely on the original source for the conclusion... \\n\\n\r\nIF anybody decides to revive that project. It seems like it has a poor fan base, considering that the source material had already wrapped... years ago... So honestly you're probably better off having to read the wiki or scouring through the net to learn how it all ends. \\n\\n\r\nArt - Score: 6\\n\r\nNothing too special, nothing thought provoking nor anything that would push the envelope. Something that was nice and safe. Just your standard typical anime art style. Ecchi art style at that.\\n\\n\r\nSound - Score: 6 \\n\r\nLike the art, your standard run of the mill music. From its opening to its ending. Pretty forgettable to most. Few of the scenes music was pretty nice almost like from a generic visual novel game or something, but that was just it. Just pretty nice. \\n\\n\r\nCharacter - Score:5\\n\r\nRun of the mill characters as well. You got from your nice, kind, ideal girl to your tsunderes to rich proper lady, to the airheads... Your basic harem staple. Nothing new. \\n\r\nSame with the protagonist. Standard guy who's a closet perv, but is afraid and wish-washy to go far with any girls, but this time with the mystery sister as an excuse.\\n\\n\r\nEnjoyment - Score: 6\\n\r\nHonestly I gave this a fair rating just because of the fact that even though there were times when it made me groan, it also made me chuckle a bit when things started to get a bit wild. Not in the ecchi sense, but the weird moments sense. So I don't wanna be mean and give it a poor score just because it didn't please me all the time, but that does not mean it has fully redeemed itself. Nowhere close. \\n\\n\r\nOverall - Score:6\\n\r\nWarning: This show is not for everyone. People who like a bit of story alongside with their dish of moe and fanservice stuff rolled into a harem sushi? Then this show is definitely for you. People who expected incest. Sorry. See my story review comment above (If you all came here because of (a) certain reviewer(s) from youtube said this is incest..well..they were slightly right?). People who wanted a great, complex, mind blowing or even a concrete story? Umm.. ha ha ha... You're in the wrong section, friend... This show have deviated a bit far from it's original source to become an ecchi/fanservice guilty pleasure sin. Typical fate of good number of anime adaptations or even original creations at times.\\n\\n\r\nPersonally speaking that's where the whole show should've focused on. Just be your typical ecchi with some comedy moe moments at the side. At least that way it could've been another staple of the ecchi/moe genre, but instead it tried to mix both it and the original source's story in an attempt to deliver something that all fans could enjoy, resulting in a shaky mess.... \\n\\n\r\nAll in all, it was not bad... but definitely not good. It was a stable harem series. Nothing more.\\n\\n\r\nHonestly this should've been a VN (visual novel) or even a galge (gal game)... Those girls would've been perfect for that kind of stuff.\\n",
            "date": "2014-09-29T23:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 162975,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2652905.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/YuriShipper",
                "username": "YuriShipper"
            },
            "url": "https://myanimelist.net/reviews.php?id=162975"
        },
        {
            "content": "The premise of this show actually sounded pretty interesting. It was suggested to me by someone on reddit, and I thought y'know...why not? The idea here is that it's a typical harem setup...with a funny twist!\r\nStory - 2 (Dreadful)\r\nKumagoro Mikadono, the owner of a company with his namesake(Mikadono Group), ends up dying and leaving it all to his supposed heir, the main character Shougo. However, he placed one stipulation here before the company truly gets handed over to him. He has to get married and have a wife first. This is where your typical harem type comedy comes into play. He transfers to a newschool, and obviously with a last name Mikadono, the same as the company, women are throwing themselves at him left and right for various reasons. So getting women couldn't be easier! Except the twist comes. Kumagoro Mikadono had an illegitimate daughter, and Shogo doesn't know her nor does he remember a good bit of his past due to an injury. So he has a sister....and she goes to the same school as him.\\n\\n\r\nYikes! The premise essentially becomes him trying to find a wife, with his potential sister being among them. The first couple episodes hilarity definitely ensues, where he's even placed in bed with two of the women he suspects to be his sister. He had been fed sexual enhancement foods prior, and he has to strain himself all night to not make a fatal mistake while these women get comfortable next to him. Sounds hilarious, doesn't it?\\n\\n\r\nAnd then the show falls apart after we establish a plot. There are so many plot holes, tedious moments, and overuse of fan service it becomes overwhelming. At times I just wanted to turn the show off. The series also tries to adopt a type of mystery feel as it progresses, where Shougo tries piecing together clues and moments of his past to find out that one simple question. But that aspect just feels forced, and at times it feels like Shougo is just going around accusing everyone of being his sister anyway. The amount of coincidence and convenience for plot in this show is also obscene, where some of these girls knew him prior to the accident that gave him the scar on his forehead(which caused his memory loss). Not only did they know him prior though, they also loved him back then as well. It's ludicrous.\\n\\n\r\n**SPOILERS**\\n\\n\\n\r\nThe anime isn't even that bad, funnily enough, compared to the light novel adaptation in terms of plot coincidence/convenience. Seriously, go read a wiki on it. There's so many forced twists for the sake of things, you can't help but laugh out loud at how far fetched all this is. One girl  believed to be his sister ends up really just being his cousin instead(Which doesn't make things any better, by the way). The girl he eventually chooses for his wife actually ends up being the illegitimate daughter anyway. Then it's revealed he's not even really Kumagoro Mikadono's son, so he's not blood related to the \"sister\" making it k.\\n\\n\r\nOne word summarizes this: \"Wat\"\\n\\n\\n\r\n**END SPOILERS**\\n\\n\r\nArt - 5 (Mediocre)\\n\\n\r\nNothing to write home about here. It's nothing amazing, it's passable.\\n\\n\r\nSound - 4 (Decent)\\n\\n\r\nAgain, no wow factors in this department. I recognize some of the voice actors/actresses, and that was about my only enjoyment after a certain part. More due to remembering their other, better work.\\n\\n\r\nCharacter - 1 (Pathetic)\\n\\n\r\nI can only imagine the author was joking when he made every single character in this show, a tried and true cliche/trope. I think the aspect that honestly makes me scratch my head the most isn't even the beta main character surrounded by T&A constantly, not just one but two generic  tsundere characters, ditzy genki girl, or even the red herring used to purposely throw you off  incessantly. It's the blatant and obvious fan service character \"Mister X\". He also happens to be a modern day ninja. I kid you fucking not. \\n\\n\r\nMister X is a character sent to infiltrate Shougo's school to investigate the illegitimate daughter, however in order to do this best he goes undercover as a student called Ikusu Mizutani. We later learn that Mister X is actually a woman(surprise...not really), but also has to expose her skin everyday for specific periods of time, to become one with the atmosphere and eliminate her presence(explained as her odor). So how best to do this? By being naked from head to toe in Shogo's room while he's there. If this wasn't absolutely ridiculous enough, she also has no idea where babies come from and at one point attempts to \"practice\" with Shougo. I am not making this up, it's not funny either. It's cringe worthy.\\n\\n\r\nEnjoyment - 1 (Pathetic)\\n\\n\r\nAfter the first 3-4 episodes, it becomes apparent this show is going nowhere and actually becomes a chore to watch. The repeat of \"she's your sister! No wait, she is!\" happens so damn much, that I just didn't care anymore. The humor also had potential, but they would rather pander to the fan service and have characters say shit like \"you can eat my cream puffs\" when referencing their breasts. LOL WAT?\\n\\n\r\nOverall - 2 (Dreadful)\\n\\n\r\nJust skip this at all costs. It's so bad and I regret ever picking it up to watch it. Ugh. Only if your base desires overwhelm your sense of judgment could I see anyone liking this. \"it got tiddies\" is about the only plus I can mention here, but the art isn't even exceptional so it's not like you're getting high quality stuff here.",
            "date": "2016-04-01T04:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 215027,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/945183.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Romrat",
                "username": "Romrat"
            },
            "url": "https://myanimelist.net/reviews.php?id=215027"
        },
        {
            "content": "If she looks like an imouto, sounds like an imouto and acts like an imouto, then she probably is an imouto. \r\nKono Naka ni Hitori, Imouto ga Iru! also known as NakaImo or My Sister Is Among Them! So it is supposed to be mystery anime in which main character, Shougo Mikadono, is looking for his future wife, but among those girls there is also his mystery sister. OMG what a twist! \r\nThis guy doesn’t think incest is wincest, so he wants to find out who is imouto and avoid choosing her accidentally (imouto for some twisted reasons wants to be chosen though… she isone of those incest-imoutos like Kirino Kousaka from Oreimo or Akiko Himenokoji from OniAi, if that's your thing this anime is must-see I guess).\\n\\n\r\nThere may be some spoilers ahead. But I think I don’t even need to tell you who is imouto to ruin the mystery, show ruins it without me.\\n\\n\r\nAt first this concept sounded pretty stupid to be honest, but also kinda promising comedy-wise so I decided to watch. I like harem, comedy and ecchi combination and mystery sounded refreshing addition, how that would  even work?\\n\\n\r\nWell… it didn’t work. \\n\r\nMystery was just not very good. Honestly I guessed it right before watching any episodes, judging by the character designs alone I had a hunch who is imouto and it turned out to be right very soon with all those little but obvious hints and even more obvious red herrings… That was very disappointing, I was almost expecting to be proved wrong because that would’ve made mystery good, or actually I wanted to be proven wrong. But it was just as predictable as I feared. Predictability is of course a curse in mystery genre and this anime suffers from it a lot. \\n\\n\r\nAnd yes I also predicted that after the mystery Imouto is revealed (the end of this anime) eventually it turns out they are not siblings after all (in light novels) - that guess was right too it seems. Sighs… Plot twists in light novels are honestly just ridiculous and confusing to be honest, but not surprising in a good way. Good mystery is surprising, but simple. This was anything but… \\n\r\nI only talk about anime from now on, so imouto remains imouto for me, I am not planning to read light novels and honestly seems that anime is at least better than them… It doesn’t mean much though.\\n\\n\r\nStory: 3 Good ideas here and there, but mostly gone totally wrong. Everything goes as you expect or then your expectations were too high. Seeing those hints or identifying red herrings doesn’t make you feel smart but makes you wonder if you are expected to be stupid. Fortunately show seems to realize this at times and don’t dumb down the most obvious. But it still doesn’t save the mystery from being predictable which makes it boring and frustrating to watch.\\n\\n\r\nArt: 6 Mediocre. Nothing special, not ugly, but pretty simple and rather generic character designs. Very light colors, which is a pretty interesting stylistic choice. There is nudity which means some bare oppai here and there. You’ll be warned.\\n\\n\r\nSound: 6 Nothing especially stands out, for better or for worse. VAs do their job, OP and ED are there but I don’t remember them anymore... that tells something.\\n\\n\r\nCharacters 4: There is this usual harem-cast, one guy and his girls. I personally liked Shougo, he is generic and has not much character, but he is not a complete loser. He is actually somewhat capable, not just kind. He can dance, reason and control his sexual impulses pretty well even in those lucky pervert situations he finds himself in all the time. And he is also rich, future president of his father’s company and sort of guy that girls would actually be interested in (for monetary reasons alone). Problem in many harem animes is that the main character is very useless in all ways, yet all the girls fall for him just because he is after all a nice guy. Shougo is a rich guy who is also nice. Yet he is boring as main characters usually are, there is nothing especially personal in him, and he doesn’t develop much. There is also this cliché that he has lost his memory and these ”new girls” are actually his childhood friends who have (of course) always loved him. Yes they have that cliché too. Girls are also pretty unoriginal. Tsundere, airhead, another tsundere who is elitist, cosplaying genius, reverse-trap modern day ninja and girl that is practically just boobs. Honestly that is how I would describe Konoe Tsuruma, she likes cream puffs alright, but other than that her character traits are just... her cream puffs (more ways than one). Okay she is also revealed to be homophobe, not a redeeming quality. Another homophobe is the tsundere Miyabi Kannagi. She actually says that the incest is better option than homosexuality!?.... Like what is wrong with this anime?! I understand that many in Japan are rather conservative, but I haven’t seen such a homophobic anime before that says incest is better option…. It’s just those jealous characters in that one episode but still… very weird and frustrating. \\n\r\nCosplaying genius Mei Sagara and elitist-tsundere Rinka Kunitachi are a bit more promising characters, but development is minimal and all girls have pretty much same arcs, they are all suspected to be sisters for some reason, they fall in love with MC and join his harem after misunderstandings are cleared up. Airhead class president Mana Tendou joins the harem just because all others do and has no arc of her own.\\n\r\nMizutani Ikusu or Mister X, and of course she is really a girl that surprises no one after you see and hear the character and Mister X is also the cause of previously mentioned unneeded burst of homophobia. She is some sort of joke character and as spy, or sort of ninja, she tries to uncover the identity of the sister along with main character, she also hangs around naked for ninja-related reasons (just fan-service) and despite her cross-dressing and obvious lack of sexual education she is probably the best option of all those girls.\\n\\n\r\nEnjoyment  5: I’m easy to please, yet this mystery was so lacking. Comedy was at times poor as well and overall predictability made this anime mainly boring. It had some ok jokes though but not much, not enough to make it enjoyable. I was expecting a surprising twist.... it never came.\\n\\n\r\nOverall 4: Predictable attempt of ”mystery”, ecchi was mostly just mediocre at best, characters were cute but rather shallow and had no development. There were boobs though.... so I give decent I guess. I've seen worse :D     \\n",
            "date": "2018-07-10T12:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 283641,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Herr_Meister",
                "username": "Herr_Meister"
            },
            "url": "https://myanimelist.net/reviews.php?id=283641"
        },
        {
            "content": "If you're a fan of all female main characters fawning over the male protagonist, then this is your cup of cake.\r\nThe story is very good (8) without a doubt, although it can feel like your watching all of the Saw Movies (can get confusing). Although after you think you have figured out the plot or a certain situation, it usually leaves you confused as you were wrong or way off. That is the main reason I kept on watching, along with the amazing humour. The sound and art are outstanding (10). Can't really say anything more about it really other than it really catches youreyes and ears. The characters are also great (9), every character when introduced will give you a laugh along with confusion. I enjoyed this greatly (9) and overall I say this is (9).\\n",
            "date": "2018-05-15T10:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 280626,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7016789.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bostafani",
                "username": "Bostafani"
            },
            "url": "https://myanimelist.net/reviews.php?id=280626"
        },
        {
            "content": "Totally underrated.\r\nThe cover art, the synopsis as well as the overall ratings it was given on this website (which I personally do not agree with) might give hints that it'll be your standard cliche harem anime. I suspected as such at the beginning.\r\nDon't judge a book by it's cover. I can't say that it's completely original but it's definitely above that your cliche harem anime. Interesting plot development, mystery and plot twist. Introducing new characters into the story is smooth, not just appearing out of nowhere and 'we have a new transfer student today' kind of thing. \r\nIt's not repetitive in how the MCapproaches and deals with each character. AND most importantly, the MC is not a blockhead, he actually can use his brain for something for once.\\n\\n\r\nThe only drawback for me was the fact that it has quite a bit of uncensored parts, which might deter those anime fans who don't want to see that kind of stuff. You were warned!\\n\\n\r\nOverall, this anime really deserves more attention.",
            "date": "2018-04-09T06:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 277526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6481989.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/H3LGh45t98",
                "username": "H3LGh45t98"
            },
            "url": "https://myanimelist.net/reviews.php?id=277526"
        },
        {
            "content": "I'm writing this as someone who watches anime pretty exclusively to find brother/sister incest stories. I hadn't heard much about this one so I put it off for a long time, but I'm glad I finally got around to it. Although there are some stupid moments I could've done without (people pretending to be the main character's sister for no apparent reason), overall I enjoyed the show. I spoiled myself to figure out who the real sister was from the beginning so I could have more enjoyment from the start of the show (since I'm 100% not interested in the non-incest pairings), but your mileagemay vary.  For me though I was satisfied with the level of interactions the real sister has with her brother, and although the ending isn't totally satisfying, it's not as annoying as some.\\n\\n\r\nThe show suffers in the same way that many \"harem\" anime shows suffer in that women endless love the main guy, sometimes for really illogical reasons, and nothing is ever decided as to who he actually picks. I  much prefer shows where a winner is chosen, but this one was fun enough, and at only 13 episodes you can get through it quite quickly. It's not a hentai so there are no nice sex scenes, but there are quite a few nude shots and lots of ecchi boob grabbing moments and similar.\\n\\n\r\nArt and animation were pretty nice, though fairly standard. I really enjoyed some of the voice acting for some of the characters, Miyabi, Shougou and Kunitachi especially. The story line with Sagara seems unexplained/weird, but other than that I enjoyed it. I'd really like to see a season two, though from my understanding the continued story in the light novels gets very convoluted and I'd prefer the anime to maintain the relationships as they are at the end of the series.\\n\\n\r\nAnyway, if you're looking for a somewhat light-hearted incest-positive anime, give it a go. You may not love the end results (incest is still frowned upon in this world), but the journey there is somewhat fun.",
            "date": "2017-11-30T05:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 264224,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/royalsiblings",
                "username": "royalsiblings"
            },
            "url": "https://myanimelist.net/reviews.php?id=264224"
        },
        {
            "content": "At first glance, this anime looked like a harmen anime and I was right from the first look. But surprisingly this anime tries to approach the viewers with a mystery story for the next 12 episodes while the main character looks for his sister so he doesn't accidently marry her. To make it worst, his sister has a brother complex which doesn't help at all. \r\nSo in conclusion, bad mystery (easy to guess whats going to happen), obvious harmen, and insest to wrap it up. Skip this anime unless you are here for the mediocre butts and nudes. \r\nOverall Rating\r\n6.2",
            "date": "2012-10-11T17:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 74691,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372117.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Prind",
                "username": "Prind"
            },
            "url": "https://myanimelist.net/reviews.php?id=74691"
        },
        {
            "content": "First off this show is terrifyingly under-rated. However I understand why, the fanservice is pretty over the top and in the first 3 episodes they have several momentum breaking fanservice scenes for no good reason. These scenes are so bad I might have dropped this anime had I not read a review advising to stick with it and that it got better, I hope that others will do the same as well.\r\nStory: 8.5\r\nFirst off this story seems a little shallow with the \"Don't accidentally date your sister!\" plot device seeming like it won't get much done. However the story decides to throw twists in prettyconstantly, doing a good job to keep you on your toes and doubting what you know. The liberal use of fanservice aside they actually create a desirable main lead and a reason for these girls to be interested in him. For a harem they also take the interesting route of starting him off with 2 romantic interests and then expand the cast, however by the end of the anime there are only 3 real competitors so it hardly feels like a normal harem, and that's a great thing. This anime is a Mystery Harem in the order, never letting go the fact he can't figure out his sister yet keeping it interesting by throwing in new characters and motivations. The MC gets in a load of stereotypical ecchi harem situations but unlike most actually has reasons to be in them. A good example of this is when the female cast believes he is 'gay' and decide to try to straighten him out through seduction. It gives us several scenes that you would typically see in an ecchi anime but actually bothers to make up a logical and fun reason to have it, and for that I thank this anime. Also tangent here, the MC in this can actually dance, I couldn't even of another Harem where the MC could dance well, this sadly is ruined a bit by the fanservice they smash in during this time however. \\n\\n\r\nArt 6.5:\\n\\n\r\nThe arts not bad, but the animation is rather weak, the intro is utterly guilty of this feeling like its shot at half frame rate, I checked 3 different sources to see if this was an error but its really is just bad. It feels like they might have done the intro after making the whole rest of the anime. The show itself uses a lot of still shots with pan and zooming. The characters are drawn well enough (though the breast size seems to be whatever is convenient for the scene...) to be quite likable, but when comes to backgrounds and animations they're bellow average.\\n\\n\r\nSound 8:\\n\\n\r\nThe sound design of the anime is quite fitting, its not impressive like some anime (Fate/NGNL) which sweeps you off your feet but I never felt the lack of it or mixed feelings like I've gotten in shows like Mahouka Koukou no Rettousei. The voice actors do solid jobs so I have no complaints, only sad there are no standout tracks that make me have to go look them up (Date-A-Live) on the spot. \\n\\n\r\nCharacters 9:\\n\\n\r\nHow can I give a 9 to such generic characters? Honestly its because they act like they're supposed to. The cast are pretty stereotypical character models for harem females for the most part but they act like it. They are over the top and do stupid things but doing so in character makes them much more likable, I wouldn't mind if they were more complex characters. However that's what gets you a 10 in my scores, so despite the fact that I really liked them I had to dock them a point for not having too much to them. I will say this is the first time I've been interested in 3 female leads in a harem. Normally only one will stand out, two at best but possibly because they don't dig too deep with them they're all fun and I don't harbor strong feelings towards the one I want to win like normal. \\n\\n\r\nOverall/ Enjoyment 8:\\n\\n\r\nI rate animes off my enjoyment of the world. I'm a bit different from others in that I like the world created to be intriguing enough to want me to learn more about it. This anime made me go check the wiki for info about it after I finished, that automatically gets an 8 from me as I wanted to learn more about. Sadly very little of the manga is translated and none of the light novel, however the twists keep coming from what of the wiki I read. This series really suprised me, while I wouldn't call this a masterpeice it was well worth my time and its a shame so many will give up on it after reading these reviews",
            "date": "2014-06-17T22:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 147401,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/gyro2death",
                "username": "gyro2death"
            },
            "url": "https://myanimelist.net/reviews.php?id=147401"
        },
        {
            "content": "Hey folks this will be my review for Kono Naka ni Hitori, Imouto ga Iru. There are plenty of words to try and accurately describe how terrible this anime is, however you may feel like I'm over exaggerating. Simply put, think of a deep exasperating sigh and the feel of dragging frustration and boredom, and you will have the feeling of watching this anime.\r\nThe story starts off poorly but at least alright enough to watch. Our male MC Mikadono, Shougo is attending his fathers funeral when through the wall a female voice comes and tells him that she is his sister. His mother arrives andtells him that to inherit the company he also needs to find a woman who he truly loves and marries her. This leads to the troubling mystery premise of our show. Shougo must attempt to find a wife at his school and his sister could turn out to be the one he chooses, which he is fervently against.\\n\\n\r\nAs the story progresses we are shown around 6 different girls, two being the most likely to be chosen. While all the girls gather around we have some of these girls pretending to be his sister for various reasons and personal gains. This is where the story becomes tedious and aggravating. We watch as shougo gets bothered and tricked and lied too, then he learns the true identity and all is forgiven, then the cycle repeats. We do eventually get to find out who his sister is however nobody is chosen to be his wife.\\n\\n\r\nThe art and sound were not bad. Art was a bit old. the music was pretty good and the voice acting again pretty good.\\n\\n\r\nThe characters were stifling. Shougo was too nice and understanding yet sometimes dominant. Most of the girls were clingy and un inspired blank molds. They didn't even bother to give them personality. Two girls out of the bunch stood out, one being a professional assassin who likes to reduce her scent by being naked in shougos room and the other a witch clothed spectacled girl who runs a maid cafe. I'm not even going to bother naming the cast because it just doesn't matter.\\n\\n\r\nI hated this anime. I started watching it and it seemed like it might get a 6, however after the third sister impostor and the terrible writing and scenario scripting I nearly dropped it. I can't believe people can give decent harems low scores then look at this and say, \"yeah that wasn't bad, have an 8\". I love these themes and tags too, so it isn't like I dislike the anime for what it is at its core. It was just poorly written and planned out. Don't watch this, save yourself the time. \\n\\n\r\nTLDR: This anime is terrible, don't wast your time. Poor writing and scenarios, no personality characters, no conclusion to the romance.",
            "date": "2016-03-14T20:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 212962,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=212962"
        },
        {
            "content": "You ever play where's waldo and get super pissed because you really can't find that sneaky bugger? Well, welcome to Kono Naka and trust me. You really won't know where waldo is until the very end.\r\nStory: So the story is based around our main character who happens to be the lucky recipient of a huge Trust fund but alas he must first get married. That's where the story takes huge turn. You'd think to yourself, \"ok, well he's gonna meet a bunch of girls and fall in love.\" WRONG! That's where the unique part of the story comes in to play. It just so happensthat one of the girls is his sister. \\n\\n\r\nCharacters: You know the characters aren't awful. They might at times seem like they're trying way too hard but that's what makes the show so amazing. It really keeps you on your toes and wondering, \"damn, which one is the sister.\" In fact, my guess to who was his sister was completely wrong.\\n\\n\r\nOverall: So ya, this show has it's little incestuous twist but in all honesty it makes the show very funny and it sort of turns it into a little guessing game. You know after reading other reviews I noticed that most people either hated it or loved it. So if you do plan to watch this. Don't expect some amazing love story because that's not what this is. If you plan to watch this, which I do hope you take the time, understand that this is more comedy then it is romance.",
            "date": "2012-12-02T15:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 78992,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1072251.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NervousWreck",
                "username": "NervousWreck"
            },
            "url": "https://myanimelist.net/reviews.php?id=78992"
        },
        {
            "content": "Kono Naka takes a unique approach to the problem of maintaining dramatic tension in a comedy harem anime. Most series write some kind of socially debilitating trait into either the protagonist or the girls to prevent them from resolving situations in a sane way and allowing for the escalation of increasingly improbable hijinks.\r\nIn contrast to this, in Kono Naka has comparatively sane and level characters on both sides. Instead, they build the tension through the mechanism hinted at in the story's title: one of the girls in the harem is secretly the protagonist's sister (and he knows it). Since the protagonist has to get marriedbefore graduation he's under immense pressure to find a girl he likes (and there are plenty interested in him). Over the course of the series, these two forces push him back and forth between playboy and gynophobe.\\n\\n\r\nIt's refreshing because the actions of all the characters are (more or less) relatable; there are no insane characters or total idiots -- you can imagine these events actually taking place.\\n\\n\\n\r\nIt's not perfect of course. The anime is composed of three arcs. The first arc is by far the best (4 episodes). The second arc is quite weak (it could be cut without losing anything important). The third and final arc is ok; it picks up where the first arc ended but it's pretty predictable (my guess of the outcome made during episode 1 was validated in episode 12).\\n\\n\\n\r\nTo summarize: It's a show with a neat premise and OK execution. It could be better in the middle and the ending is predictable, but if you like harem comedies this is one to watch.",
            "date": "2016-09-26T19:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 230324,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ElfGuard",
                "username": "ElfGuard"
            },
            "url": "https://myanimelist.net/reviews.php?id=230324"
        },
        {
            "content": "I dropped this anime after the first episode. I mean seriously, he's getting girls by the minute, and these romantic situations are getting just plain old.\r\n But alas, my love for harems continued to spring and I decided to give this anime another shot and I'm pretty glad I did. The latest episode explains everything to why the characters act a certain way and the plot is actually pretty good once you finish the latest episode. Trust me, nothing is that great about the anime until episode 4. \r\nBut, the anime still has its cons that make it not that enjoyable, but it still shouldn'tget overally bad ratings by people who just watch the first ep (like I did before) since the plot and the story clear up later on in the story.\\n\\n",
            "date": "2012-08-09T17:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 69253,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1367161.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/afterkaze",
                "username": "afterkaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=69253"
        },
        {
            "content": "Nakaimo attempts to deviate from the normal harem trope using the common moe cliches of little sisters and archetypes, changing from an average harem to one that ends up being somewhat opposite of just that. However, because of the more dramatic and serious tone of the show, the impact of the story falls flat in an attempt to maintain its drama with an environment of moe blob archetypes and underdeveloped characters.\r\nThere's nothing special to be seen in Nakaimo. The art and animation are sub-par at best, and most if not all of the character designs are nothing special, other than hair color and someone whowears a witch costume through a good portion of the series. Music did not stand out, nor make much impact on any dramatic scenes that deserved the attention. At the very least, the story itself is unique and a bit of a departure from the normal harem trope, but for reasons to be further explained in spoilers, it can't achieve its full potential of drama.\\n\\n\r\nThe biggest weakness of this anime is its story-telling and pacing, and the characters involved in it. A good harem would present its cast of characters, and put them through some emotional trial, and force them to go through dramatic character dynamics to help them grow and form more intense relationships with each other. Unfortunately, for Nakaimo, rather than having regular character development, it puts the viewer in the same position as the main character; unaware of his surroundings, and confused.\\n\\n\r\nWhat makes this anime different from other harems is that instead of having to build relationships with multiple girls, our main character has to tread lightly and meticulously pick a suitor to marry, and is also wary of being lured in by his illegitimate little sister. So with this atmosphere, Shougo is constantly suspicious of the girls around him, hindering the relationships between them to grow. This is the exact opposite of what we need in a main character and his relationships with other girls. \\n\\n\r\n-Minor Spoilers, but In-Depth review follows-\\n\\n\r\nAs if that itself wasn't enough of a problem, each girl has her own reason to actually go out of her way to fake being Shougo's little sister. This is the show's method of presenting trial for our main character, but in doing so it actually lowers the quality of the show. Being that it is a short series, each girl gets roughly 2-3 episodes to herself with her scheme of trying to pretend to be Shougo's little sister, and considering we don't actually find out who it was or why they did it until the end of their arc, there is little to no actual development of the character herself, nor any growth in the bond with Shougo.  \\n\\n\r\nWhen the final mystery of the anime is revealed to the audience and main character, the unfortunate truth is that the revealed character didn't receive the proper development over the show. Even the last few episodes that should be dedicated to this character were not, and further hindered the climax of the show. but it is fair to say that she receives the most attention and development compared to the other girls (which isn't saying much). Her and the 'side-kick' character that lives with Shougo, Mizutani Ikusu. She is probably the most interesting character as far as personality goes, for her upfront and bold appearance, while being naked for most of the show. \\n\\n\r\nNakaimo definitely has good grounds to be different, but unfortunately it's too short and too quick for it to get anywhere. It lacks the time and devotion needed to interesting characters, and hurts itself as a harem anime because of its unique plot and attempt to be bigger than it really is.",
            "date": "2013-12-31T00:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 126415,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Arizzle",
                "username": "Arizzle"
            },
            "url": "https://myanimelist.net/reviews.php?id=126415"
        },
        {
            "content": "I can say without a doubt that this is the worst anime I've ever seen. I have to wonder, why did I decide to watch Nakaimo in the first place? I guess because the premise seemed interesting. Sadly, it turned out to be a total waste of time. \r\nStory:\r\nThe premise of Nakaimo is pretty simple: a standard harem with one twist. Unlike something like Oreimo (where the protagonist knows who his sister is and is fine with dating her), the protagonist of this show didn't even know he had a sister (because of some poorly explained head trauma), and is doing everything he can tonot end up with her, even though the sister makes it clear that she plans on marrying him. I guess the appeal of this premise is the mystery behind who the sister is, but with one look at the poster, I guessed who it was perfectly. Once that aspect is gone, you get a completely bland, forgettable mess. The pacing was horrible too. The harem has a whopping six girls (one who is added later), and within 12 episodes, they try to give each of them at least 2-3 episodes of focus and \"character development\". These episodes only exist to make you frustrated about who the real sister is. It's not spoilers to say that each girl is framed as the real sister at least once, and it's just annoying to see that be thrown around so much. I'll get into how that went later, but the pacing ended up a mess because of it, and any attempt at a story is buried behind a ton of worthless fluff. In the first episode, one girl is hit by a truck. There are no consequences or impacts on the story. It's just something that happens. \\n\r\nArt:\\n\r\nThe actual animation wasn't that bad, but the art was a pain to look at. The character designs were bad and the quality was the definition of low budget, and that's not even mentioning the ridiculous amount of fanservice found in the worst places. Also, I don't think the animators knew anything about how things look. There was a scene where a girl's dress strap goes untied, which actually can happen, but the animation makes it look like some sort of invisible pervert was untying it behind her back.  \\n\r\nSound: \\n\r\nThis is harder to talk about because I don't actually remember any of the OST (that's how boring it was). But, the opening was catchy, and that's probably the only good thing about the show.\\n\r\nCharacters: \\n\r\nTake your standard harem cast, boil down any potential interesting character development, and you're left with the starch-bland cast of Nakaimo. The protagonist is so generic that I can't even remember his name, and he's the kind of character who acts however the episode wants him to act with no continuity to his \"established\" personality, which is the worst type of character. The girls are all standard tropes, but instead of being entertaining or having some sort of twist like characters in other harems, they get no development whatsoever. I mentioned that the show tries to give each of them a few episodes of their own, but those attempts always fell flat on their faces. The characters are boring and generic with no depth at all, and to top it off, they're not even designed well. \\n\r\nEnjoyment:\\n\r\nThis anime was a chore to watch. After starting it and then neglecting it for weeks, I had to sit myself down and watch the remaining episodes in one go. Even if I liked harems, I wouldn't like this show. I mean, right before this, I watched Nisekoi (which I actually really enjoyed), so I guess I just got my hopes up. \\n\r\nBottom line: this anime is a boring, generic, ugly waste of time. There's no reason you should watch it. Even if you're into fanservice harems, you're not going to find any enjoyment here.",
            "date": "2016-02-20T09:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 211304,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3889219.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/lunarpen",
                "username": "lunarpen"
            },
            "url": "https://myanimelist.net/reviews.php?id=211304"
        },
        {
            "content": "Kono Naka ni Hitori, Imouto ga Iru!, is a Harem anime about Shougo Mikadono. After his father's death, he is left as the sole heir to the Mikadono Group. A large corporation which Shougo's father ran. In order to take head of the Mikadono Group, Shougo must find a woman he likes, and marry her. That's all the plot info you really need to know, so let's get onto the review...\r\n-Story: The story of the anime is pretty original, the biggest twist, is the little sister. At the very beginning of the series, Shougo learns he has a step-sister on his father's side. He thenlearns that his sister not only wants to marry him, but goes to the same school as him. So, while trying to find a suitable bride, Shougo must uncover the mystery behind his little sister. The story in the anime is slightly better than mediocre for me. Of course, everybody has opinions.\\n\\n\r\nMoving onto the Art; The show is not a masterpiece, but it's not terrible. The animation is fluid, and the style of art is nice. To make this paragraph longer, I'm also going to throw in this sentence, as well as the sound review. The sound is not too bad. Nothing really stands out to me. So I give it a decent rating.\\n\\n\r\nCharacters... Oh, the characters in this anime. We'll start off with the main character: Shougo Mikadono. As I explained above, he is the heir to a wealthy corporation and must find a bride by the time he graduates. I honestly can't think of words to describe him...\\n\r\nThere are 5 candidates able to be Shougo's sister. Konoe, the cute girl, whom Shougo meets first. Miyabi, the Tsundere who loses her Tsun-. Mei (Sagara), the owner of little sister cafe, and tends to like cosplaying (Or just dressing up). Rinka (Kunitachi) the vice-president of the student council, and a true tsundere. Finally, we have Mana (Tendou) the president of the student council, and a happy-go-lucky, ditsy character.\\n\r\nOur final main character is X, or Ikusu. Is a girl, the same age as Shougo. At his school, she pretends to be a boy and passes off quite well. She is actually part of the Mikadono Group sent to help Shougo. She pretty much does whatever she likes, whether it be pretending to be with Shougo (Making people think he is gay) or parade around Shougo's apartment naked. \\n\r\nThere are a lot of characters and some are pretty interesting.\\n\\n\r\nMy enjoyment I'd say is not too high. I prefer to watch it when I'm done watching all my other animes. This anime is filled to the brim with fanservice. From large breasts, of which the nipples are being covered by hair, towel or a shirt, to at one point, an incredibly short skirt. But, I expected as much from it. I'd say as far as enjoyment goes, 7/10.\\n\\n\r\nOverall, the anime is a light hearted anime and should be treated as such. The amount of awkward social situations Shougo finds himself in astounds me, and amuses me at the same time. Still, I've seen better anime. Overall; 6/10",
            "date": "2012-09-01T15:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 71351,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HollowBlades",
                "username": "HollowBlades"
            },
            "url": "https://myanimelist.net/reviews.php?id=71351"
        },
        {
            "content": "WELL this is one of those typical harem, shounen genre anime where the girls just fall straight into the protagonist's lap and love him for who knows what reason. (usually just because they do) Though this is one of the more poorly done ones. compared to say HS DXD or something similar that has more production value and time put into it.\r\nStory: As described, the MC has to find a girl to marry so he can head his family by joining a school and searching for one, however rumor has it, his sister is in it and wants to marry him.. It seemed alright atFIRST, but then of course for the stupid reasons of course these girls fall for him, whether it be because of childhood, or just a random single date..  They also included \"plot twists\" which are so freaking retarded, I face palmed every time. It's a real pain to watch half the time. The only twist or mystery for the viewer, \"can you guess who the sister is?\"\\n\\n\r\nArt: The only thing I did stay for is the fan service. I mean that's what these genres are generally about. (That and my friend begged me too.) The art is decent, the curves and whatnot I mean. I watched the uncensored version say YAY, there was one thing they could do decently. \\n\\n\r\nSound: I admit, I'm a massive 2D sis-con who loses it when they hear \"onii-chan\" in the cutest voice possible, this anime is just filled with it. It was good for a first few episodes but gets really annoying. (If you watch you'll see what I mean) The OP and ED are mediocre, what you would usually expect from these series. Nothing amazing.\\n\\n\r\nCharacters: Despite what I did say, they don't all for for him. More like half of them do, that being said.. Again they're al nothing special, typical characters, personalities, and you just pick your favorite. The back story's for these girls are't really worth mentioning either (I know this getting boring but bare with me!) HOWEVER the MC is a tad retarded at one point, turns in Ichika from IS at one point I SWEAR. \\n\\n\r\nOverall: This is just fan-service, obviously not for a serious story, otherwise prepare to face-palm a lot in the process of watching this. \\n\\n\r\n4/10 CREAMPUFFS.",
            "date": "2014-02-28T15:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 134201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3117145.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Baka_Aniki",
                "username": "Baka_Aniki"
            },
            "url": "https://myanimelist.net/reviews.php?id=134201"
        },
        {
            "content": "***This is a somewhat spoiler free review. I tried my best to word things w/o spoiling anything.***\r\nKono Naka ni Hitori, Imouto ga Iru! is an anime that while the initial premise really pulled me in, its inability to provide thought provoking plot twists and just a sheer amount of unnecessary content really dragged it down.\r\nStory: 3/10\r\nSo like I stated above this show actually had a pretty interesting concept. The show revolves around Shougo who is to become the head of his deceased father’s company. In order to do so however he must complete a guideline set forth by his father. This guideline demands that Shougomust attend a certain high school, attract a mate, and marry before taking his spot as the head of the company (what an awesome dad). I didn't have a problem with this premise at all; in fact I thought just by hearing that first it could be an interesting harem. The story’s conflict arises early on when someone begins posting as his ill legitimate sister which could affect his position with the company. This is again another great idea to make the story more interesting. Where it goes wrong however is when it accuses every female character of being his sister. It’s also very easy (at least for me) to come up with a reasonable guess on who the real sister is very early on in the series. I guess where the series goes wrong the most is how predicable it is. There are really no interesting twists or misdirection that make me think, “Wow didn’t see that coming”. Another flaw in the overall story is how much pointless content is included in the middle episodes. I kind of feel like there was a struggle to make episodes the required length in episodes five through nine before the final “twist” was introduced. The show leads up to the final episode and in all honesty I felt like it was a letdown. Overall the story had a chance to bring something new to the harem genera but it ended up not hitting its intended marks.\\n\\n\r\nAnimation: 8.5/10\\n\\n\r\nOne great thing about this show is the stunning animation. Everything appears in very light colors and the use of reflections is done very well. The character models are all pretty detailed for both the main cast and some of the extras in the backgrounds. The scenery is colored much of the same way helping to keep the mood of the current scene. The main settings for the show, the school, Shougo’s room, and the café are all very detailed each time we are present.\\n\\n\r\nSound: 7/10\\n\\n\r\nI am usually very picky on sound since most of my spare time is spent recording music or just listening to different types of music. The music of this anime while not amazing was still pretty good and helped set up some interesting scenes. The voice actors also did a pretty good job matching the personalities of their characters.\\n\\n\r\nCharacters: 6.3/10\\n\\n\r\nThis category is hard to score because while some of the characters did grow on me, every one of them are pretty generic. You have your elitist, airhead, tomboy, and cosplayer. We have all seen these roles countless times in other anime so why should we bother with these empty shells? That’s what I first thought when introduced to each character but to my surprise I actually grew to like some of these characters due to some character development. While some of them where pretty much cast aside without any development (Mana) most of the cast received one to three episode character arcs that pretty much set up why they fall for Shougo. The show should have done a better job fully utilizing the cast but overall they did a good enough job.\\n\\n\r\nOverall: 6.2/10\\n\\n\r\nWhile it isn’t a masterpiece, if you can look past some boring parts that lead to nowhere, predictable plot twists, and a forgettable anticlimactic ending, this show may offer you something worthwhile. There are some really good, sweet moments and some great animation and sound to be found here.\\n\\n\r\nEnjoyment: 5.8/10\\n\\n\r\nThanks for reading my review! If you liked my writing style, would like to see some other reviews, or just want to talk, please stop by my page!\\n\\n\r\nSincerely,\\n\r\nAwesome Drummer",
            "date": "2017-05-14T23:09:00+00:00",
            "helpful_count": 0,
            "mal_id": 247708,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/407839.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ImRingo",
                "username": "ImRingo"
            },
            "url": "https://myanimelist.net/reviews.php?id=247708"
        },
        {
            "content": "So this another harem ecchi show, so you already know that to expect from it. However, this show has following unique features\r\n1. Kinda strong plot, because search for his Imouto will be one of the reason you'll look forward into next episode.\r\n2. Nice humor, situation and character traits occasionally will take place during the show. If only there were more numerous.",
            "date": "2013-01-19T04:18:00+00:00",
            "helpful_count": 0,
            "mal_id": 84139,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78679.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DragonFire",
                "username": "DragonFire"
            },
            "url": "https://myanimelist.net/reviews.php?id=84139"
        }
    ],
    [
        {
            "content": "An enjoyable story with interesting drama.\r\nThis was a pretty good teen romance story, with mysteries and a modest amount of little sister complex stuff woven in. Its not exactly emotionally gripping, like Oreimo was, but it is nearly as cute. \r\nThe story is about a young man named Shougo Mikadono, who is the only son of the head of a huge and successful company. Unfortunately his father has passed away, but his dying wish was for Shougo to find a bride by the time he completes high school. So his mother arranges for him to attend Miryuin Acadamy in the hopes he would find asuitable young lady that way. The problem is, Shougo is rumored to have a secret half-sister who is also reportedly attending the same school. He doesn't know what she looks like so he has to be very careful in his romances with any girl attending the school.\\n\\n\r\nI enjoyed the series. The plot was a bit tortured, but still interesting. The dialog and story line was decent and the characters were pretty cute. Definitely PG with occasional \"naked barbie doll\" fan service. I think it deserves 6/10 but I am going to push it to 7/10 just because it made me smile so many times...",
            "date": "2014-08-28T18:47:00+00:00",
            "helpful_count": 0,
            "mal_id": 158341,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3075337.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/bearvarine",
                "username": "bearvarine"
            },
            "url": "https://myanimelist.net/reviews.php?id=158341"
        }
    ]
]