[
    [
        {
            "content": "The skies is a vast and mysterious place. It’s unlimited and holds infinite potential for sky pirates and aviators of war. For a young pilot named Kal-el Albus, he’s looking for more than just flying the skies. He’s looking for revenge for the harsh life that he’s endured during a time period known as the ‘Wind Revolution’. But now as a young man, he embarks on a journey along with his sister Ariel to discover more than just riding the winds.\r\nTaking place in the same world as the movie Toaru Hikushi E No Tsuioku, this show holds little similarity besides its initial setting. In otherwords, it’s not a necessity to watch the film to understand or gain pleasure from this series. Yet, they do hold a similarity based on a concept – the reality of war. Because with war, there’s countless casualties, misunderstandings, and death that breeds hatred. Kal-el knows that from experience when he was just a kid. From a biographical viewpoint, it’s almost too harsh for a reality to sink it all in. Yet for him, he holds onto his promise to never forgive or forget.\\n\\n\r\nComing into this series will feel like an adventure at first. The setting has a steam punk-esque that illustrates itself with the usage of its vehicles. But by standards, they are powered by hydrogen and fuel rather than some super tech gadget that you would find in mecha theme series. There’s also battleships too and other weaponry designed for warfare. For what’s worth, we quickly find out that there are nations at war and our main characters gets caught up in the middle of it. More than that is the mystery regarding a phenomenon known as the ‘End of the Sky’. It raises many flags for questions relating to its secret, the truth behind the conflicts, and our curiosity of how all this ties together with the main characters.\\n\\n\r\nSpeaking of characters, this series spends a good majority of its time to let viewers to get know them. In particular, Kal-el is one that stands out more than just besides his name. Despite having a similar name to the man of steel Superman along with the skill to fly, Kal-el is far from invulnerable. We do get a sense of justice from him but sometimes, his pride and arrogance gets the best of him. In essence, he still has a lot more to learn of the world and himself. His new position as a cadet allows him to discover potential and the truth. Yet on many occasions, Kal-el finds himself in trouble with his life in danger and realizing his own insecurities. This doesn’t just solely fall with his hands but connects with other characters such as Claire Cruz. The duo shares a rather peculiar relationship that ranges from respect, friendship, and romance. Yet, it’s easy to tell that their love story is one that is set to self-destruct. For more than just tragic reasons, their relationship also holds deep secrets and hidden truths that Kal-el held scars for his whole life. Strictly speaking, a romance during a time of war is never a fantastic idea. Whether their feelings blooms or decays is like a flower that does not last forever. \\n\\n\r\nBut of course, no one’s immortal in this show either. No one lives forever and war brings that truth to its finest. Throughout the series, characters faces the reality of war. Namely the Sky Clan, the unit that most of the main and supporting characters are enlisted in, experiences firsthand why there is grief and despair when sent to the line of battle. There is no salvation in the line of duty. Whether killing others for survival or nationalism, there’s one thing the cadets all needs to know and that’s for fighting for what’s right. For most of characters, no one is safe despite their various reasons for entering in the war. The series doesn’t neglect to spare characters from certain death. This may catch some viewers in surprise as several major supporting characters meets their doom as result of fighting. But at the same time, this should bring about reality – that war is never without a price.\\n\\n\r\nTheoretically speaking, there are several ways the series demonstrates its feelings through its course. The most obvious one is romance between Claire and Kal-El. It’s very different compared to the classic Clark Kent/Lois Lane from the Superman franchise. Rather, it feels rushed and sometimes lifeless because our main characters lacks compatibility. Young people fall in love yet their story has tragic holes in it by dark revelations and startling discoveries. Yet, the show doesn’t stop at that point with the romantic aspect as it expands to some of our supporting characters. Unfortunately, the show doesn’t handle its romance aspect in a manner deemed as everlasting. It doesn’t just matter with the class levels or relationship development. Rather, it comes off as an average love story based on mutual attraction and predictability; as in the traditional fan ships. The only part is that some ships are bound to sink, not in the way of the ‘friend zone’ but more as into heaven. However, it does bring back its point to illustrate the reality of warfare as love isn’t met to last during such crisis. \\n\\n\r\nOn the other hand, the appealing parental and sibling love between characters is one that we should smile upon. Kal-El has a family and even though not related by blood, they treat him with respect, dignity, and care. In many ways, it feels like they love him as their own child. Similarly, Kal-El and Ariel shares a close relationship despite their constant bickering. A prominent evidence comes from their time spent in the air. On one instance, Kal-El experiences a brink of despair similar to one in his past. Looking back now, this show’s relationship shines stronger when it focuses on commitment as opposed to becoming a couple by love.\\n\\n\r\nAt the same time, we get a tense feeling of vengeance coming from not only Kal-El but also a young boy named Ignacio Axis. With silver hair, a cold stare, and stoic personality, Ignacio is the classic lone wolf. We learn through flashbacks with his circumstances and motivations why he became the person as he is today. In a way, there’s a similarity between Kal-El and Ignacio based on their quest for revenge. They are driven by vengeance and their desire to achieve justice by their own standards. Toaru Hikuushi e no Koiuta (The Pilot’s Love Song) set these standards and attempts to give viewers a chance to see how they are resolved. In the end, their resolutions and ideas might be different from what the audience have in mind. I think by this show’s standards, it isn’t presented as a didactic story but rather for how chains of reactions leads to certain outcomes. Unfortunately, these outcomes are ambiguous and feels rushed with a lack of depth.\\n\\n\r\nBecause nations are at war, expect plenty of action both on land and in the air. The dogfights are coordinated with credible effort. From minute one, the show demonstrates that it can handle its exposition of war in fluid way. The dogfights are rapid with bullets raining from the sky but not in mindless action. Rather than just a full throttle spraying of bullets, we also get strategic movements, heroic sacrifices, and what it truly is like being a pilot. Similarly on land, there’s bloodshed and violence as action-oriented episodes presents every effort to demonstrate its cruel reality. \\n\\n\r\nEven with a credible story however comes with that prevents this series from shining. For one thing, the story itself is predictable with cliches and a blend romance based on mutual attraction. Certain revelations and discoveries are presented in a quick fashion and anticlimactic despite its initial built-up. Although some of its flashback scenes paints a realistic format of cruel life, there’s little strength in their actual present stories. Main characters’ development suffers as result along with supporting characters including some which held potential development but seemingly tossed out of the show for good. There’s also a bit of disappointment relating to its setting. In essence, the setting the show takes place in embellishes itself with fantastic features for potential world building. Yet, the majority of the show chooses to focus on its character relationships and state of affairs with its main story. In retrospect, there’s a lack of depth in exploring what’s behind the scenes. Even some of the initial mysteries are pinned down when compared to our main characters’ thirst for revenge. \\n\\n\r\nArtistic wise, the show demonstrates a high degree of fantastical features. It presents lush backgrounds with aesthetic designs with its aircrafts. Some of them holds a similar degree with historical vehicles while others (such as battleships) creates a feeling of intellectual depth. Some scenes also gives off a feeling of tranquility and almost a dream-like atmosphere such as romantic moments. The flashbacks also illustrates to show, rather than tell the audience of what our main characters has gone through during their childhood with a black and white world quality. Character design also makes sense on most parts although some characters’ ages doesn’t match their appearance. Luckily, the show omits fan service even with the adaption of the classic beach episode; for training purposes of course!\\n\\n\r\nA fantasy series would also require a stellar soundtrack to match its high caliber degree of action. Luckily, it is consistent in terms of coordination. Dogfights in the air matches well with every movement with adamant integrity. The OST also demonstrates both an ethereal and vigorous way of presenting certain scenes to match the mood. On the other hand, some of the characters’ voices can be exasperating to the ears. Really, how long can you listen to Kal-El scream in agony at whatever he has trouble on mind? Or otherwise, Claire examining her own insecurities? It will take some time to get over their mannerisms. Luckily, the OP and ED song might be just what you need for their quality and delicacy.\\n\\n\r\nHatred, fear, oppression, revenge, love, regret. Those are just a few of qualities coming from war that the show brings together. Yet, there is some peace at mind with characters that demonstrates their heroism in the line of duty. This show focuses on aspects of that through human dynamics. The romance coming out of this show will come out as cliché by the classic ‘love at first sight’ circumstance. However, the parental/sibling bond is a strength that is hard to overlook. With impressive action sequences and a fantastic setting, expect warfare to come as reality painted by grim truths. Watching this show in the end will feel like taking a journey to a world, one which holds feelings in a fictional realm. \\n\\n",
            "date": "2014-03-31T10:39:00+00:00",
            "helpful_count": 115,
            "mal_id": 138079,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=138079"
        },
        {
            "content": "Just by looking at the title (Love Song of a Pilot), the description, and a preview, most people will get the impression that this is a heavy-hitting drama with a beautiful romance augmented by plenty of flying through the skies. I’m pretty sure that description up there also suggests Toaru Hikuushi no Koiuta will cover touching themes as well, such as how hate can be conquered by finding love. The setup is fairly enticing. You’re probably thinking this is a story that will hit your heart.\r\nLower your expectations, NOW. Trash the images my first paragraph produced. Reduce the dramatic impact you are expecting by about50% and lower the charm of the romance you are picturing by about 80%. And were you expecting quirky, vibrant, enjoyable, and interesting characters that you could feel attached to? You are only kidding yourself. With all of the proper cuts applied and high expectations moved to the side, you have what Toaru Hikushii no Koiuta really is: an average drama story that had all the right tools to be excellent.\\n\\n\r\nStory (5)\tCharacters (5)\\n\r\nWhat is a drama’s primary responsibility? To make you cry and feel emotion, that’s what. How does Toaru Hikushi no Koiuta accomplish this? Well, I can say that the method it uses is one I find to be obnoxious: It spends six episodes focusing on a handful of uninteresting cadet characters goofing around until finally, by episode 7 or 8, it decides to start chopping off some heads. In other words, by the second half, war breaks out and about fifty percent of the characters die. Essentially the whole first half of goofing around is designed with the purpose of placing weight on the characters’ impending deaths, however this was accomplished fairly poorly due to the fact that the characters were so uninteresting that it was just unspectacular to see them dick off, cook food, and constantly mock each other. However, most of the characters do establish romantic ties (although very light ones) with each other. And although it seems like a cheap half-assed effort to throw some easy emotional weight onto some of these guys, the minor romances might just give you enough of a reason to care for the characters.\\n\\n\r\nThat’s basically it. The story brings up a handful of characters, kills a couple of them in battle, and makes an effort to hoard your sympathies by showing the survivors crying all over the place and mourning over their lost love ones. There’s nothing particularly excellent or enlightening about this story, its characters, or its emotion. It’s really just the typical second-class drama.\\n\\n\r\nAnd where does the romance fit into all of this? Well, lucky for you romance fans, the first episode jumps right into it, and it is perhaps the only episode where you will get a look at some genuinely heartwarming moments between Kalel and Clair. You think it’s going to continue to be this sweet? No way. The romance just… I don’t know the words… loses its gas I guess? Kalel and Clair just begin to seem too close and too familiar with each other. The romance would have been more effective had Clair been more aloof like she was portrayed as in the first episode, and Kalel would have to work harder to get her. You think the anime would have gone that way considering how it underscores the class difference that separates these two lovers. There were just far too few genuinely charming moments between the two. Even a plot twist that could have brought this romantic relationship to a crazier level was not taken full advantage of. \\n\\n\r\nAside from all of these things, there are a few other elements to the story that aren’t necessarily important. If you hear any of this “holy spring” or “end of the sky” sh*t and can’t figure out what the hell any of it means, don’t stress over it. Understanding those concepts will do nothing to better your experience with this anime. \\n\\n\r\nEnjoyment (6)\\n\r\nIf you cry as easily as Ari (the redhead) does, this drama story might work for you. If you’re like me and are more on the insensitive side, this story will be a waste of time. The story, overall, turned out to be a LOT weaker than I expected. I had the willpower to finish this series only because I kept on expecting for something brilliant to suddenly happen. That’s because this anime’s themes and concepts WERE capable of brilliance. It is too bad that so many faulty decisions were made in the storytelling.  \\n",
            "date": "2014-04-01T19:21:00+00:00",
            "helpful_count": 91,
            "mal_id": 138253,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2589599.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kaboomneverscrub",
                "username": "kaboomneverscrub"
            },
            "url": "https://myanimelist.net/reviews.php?id=138253"
        },
        {
            "content": "**No spoilers** The Pilot's Love Song is a mix of drama, romance and action, though I would say it leans toward primarily being a drama. The show starts with a relatively easygoing feeling, but gets much more serious by the halfway point and remains so until the end.\r\nThe main theme that this series focuses on is the reality of war, which includes the concepts of overcoming fear, accepting loss and the importance of forgiveness through love. There is a fairly decent-sized cast of side characters without being too overwhelming, and there are several romantic interests among them which helps to keep your interest even ifyou're not super into the main relationship. Though their primary purpose is generally to further the drama, the action scenes are quite well-done and do a good job of making you feel like the characters are truly in danger.\\n\\n\r\nOn the negative, the story, at times, is a little confusing and the pacing feels a little off. Given that this is a short series at only 13 episodes, there was perhaps a little too much time spent both on the initial ramping-up to the main conflict and on the denouement after the main conflict.\\n\\n\r\nThere are also times you may find yourself questioning the decisions of the characters, or exactly what their motivations are, and, while that is often a good thing to some extent in storytelling, I felt that there could have been a little more gradual hinting given to the watcher so that some things didn't seem quite as sudden when they were revealed. Having said that, most things are tied up by the end, though it may leave some people feeling a little unfulfilled.\\n\\n\r\nIn summary, if you're the type of person who focuses a lot on logic, consistency and smooth storytelling, this series may not be for you. On the other hand, if you are more about the character relationships and the drama, while being able to suspend your disbelief regarding some inconsistencies or unexplained phenomenon, you will probably enjoy this show like I did.",
            "date": "2014-09-16T10:15:00+00:00",
            "helpful_count": 49,
            "mal_id": 160617,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/51582.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ddrcrono",
                "username": "ddrcrono"
            },
            "url": "https://myanimelist.net/reviews.php?id=160617"
        },
        {
            "content": "Toaru Hikuushi e no Koiuta (The Pilot's Love Song) is a story that primarily focuses on the growth of the main character Kal-el, the adventure that he goes on, and his love story. Set in a fantasy-esque setting, the show tries to produce images like the \"holy spring\" or the \"end of the sky\". The story starts out with a day-to-day pilot school setting but later shifts to a battlefront setting.\r\n\tAlmost immediately, the show attempts to dive into the romantic zone. It tries to go for the classic \"love at first sight\" complete with romantic scenery and music instead of a gradual development between thetwo main love interests. If you're into romanticized scenes such as a \"couple moment\" where the girl is \"flying\" through the air with her arms spread wide from the backseat of a bike in a titanic-like image, then the beginning of this story may be a good watch for you. However, be warned that there will never be full conclusion where the two ride into the romantic sunset hand in hand and live happily ever after. Anyhow, the characters Kal-el and Claire quickly become infatuated with each other. Kal-el gets obsessive whenever he thinks about her. Conveniently enough throughout the story, they become stranded alone with each other in various scenarios for dramatic effect. As for the other students in their class, most of them come in convenient parings, though not all these love stories will end happily, or the way that most people would want them to.\\n\\n\r\n\tThe pasts of the main characters in the story are revealed through long flashbacks instead of current events. I rather liked the background stories for the four main characters. Each of their back-stories are fairly well developed and it becomes evident why each of them behaves the way that they do. Unfortunately, none of these characters ever get a chance to fully understand one another. \\n\\n\r\nThe main character, Kal-el Albus, is the former crown prince of the Ballesteros Empire; his family was removed from power during a time of revolution.  A major theme in the story revolves around Kal-el's hate for the public figure called Nina Viento. Even though he was taken in and loved by a warm and welcoming new family, he still desires revenge on the girl that took everything away from him. A point that the show tries to get across is the importance of forgiveness. People seem to be pretty forgiving here in the face of love.\\n\\n\r\n\tAs mentioned before, the story goes from happy training/school days scenes to a full blown \"war\" against the fabled sky clan. There is an immediate change in pace and the remainder of the story comes out a bit rushed. The aerial fights weren't bad to observe, however, some flying angles got a little dizzy to look at. If you have a slight motion sickness like I do, you might feel a bit of a headache going through some of those scenes. Still, it certainly is a treat for those who have a love for airplanes and/or the Air Force. During the \"war\", the story tries really hard to bring out the feels. The amount of emotion that you feel during those scenes depends on how easily you get emotional over the deaths of minor characters. But for some of the deaths, the death flags were raised high up in the air and waved around in circles. I imagine it'd be a pretty terrifying experience watching your friends and classmates dying all around you. Just picture the raw fear that the characters would experience. Whether or not some of the deaths were \"uncalled\" for, we get a good glimpse at the devastating reality of war. There is an emphasis on \"guts\" and the \"courage\" to sacrifice yourself for other people's sake. In the end, the ones who experience the most pain are the ones who are left behind. In this story the military also gives out purple heart-like badges to the families of the deceased. It's all the military can really do for the families out of gratitude, but no gesture can truly express the emotions felt on both sides.\\n\\n\r\n\tIt's a bit of a head-scratcher how they were so willing to send students off into actual battle in that condition. The least they can do is supply them with actual planes instead of the training planes they had to use. Those planes didn't even have covers, so casualties became almost inevitable. Why did they venture into enemy territory with so many students in the first place?\\n\\n\r\n\tIt can be noted that in this world, there is a literal end to the sky. The whole reason behind all the sacrifices was to complete their expedition to the end of the sky, watch their floating island get destroyed.... have an adventure... take some pictures... maybe eat a snack after... Their motives for the entire trip becomes pretty questionable given the high casualty rate.\\n\\n\r\n\tIn the end there are still many questions that are left unanswered. The \"legendary sky clan is still shrouded in mystery even though we get to sneak a glance at their technologically advanced city. The Holy Levamme  Empire is only portrayed as \"mysterious allies\" with an ambiguous reference to a silver fox plane. There is a possibility that it is directly tied with the novelist's other pilot novel. We are also never told the reason behind Nina Viento's temporary loss of power, whether it was because she was emotionally unstable or that it was only for the sake of drama.\\n\\n\r\n\tMany of the events came off feeling predictable. Some of the characters seem to just disappear. For example, what happened to Wolfgang's partner who always called him \"aniki\"?  What happened to rest of the course 1 students besides Fausto? Either they all mysteriously died after the fighting, I missed something important, or they are apparently so insignificant they don't even get mentioned in the slightest. There were scenes where characters die off so quickly it leaves you mentally unprepared. Instead of crying or feeling sorrow, you would just think \"Wait a second, did that person really just die? Rip....\" The main characters in contrary are shrouded in plot armor and conveniently escape and live. The different situations where Kal-el could have died were above and beyond. There were many other things that just went by unexplained such as a one-time mention of a notion to overthrow the revolutionary government towards the end. Oh well, it's up to you to imagine what that will lead to I guess..?\\n\\n\r\n\tThe soundtrack throughout the show was good. Right of the bat, some \"grand\" themed ost plays as the characters leave for the floating island of Isla. I rather liked the Op song. It was nice to listen to. The art was decent but the animation wasn't always consistent. As a side note, I can't say that I'm a fan of the computer art designed plane base.\\n\\n\r\n\tThe ending felt okay for me. There is a lack of a conclusive ending, but as with a lot of the rest of the story, that is up to your own interpretation. The plot for most part is pretty straightforward, and while the show was enjoyable at times, there were other times where I would tilt my head and wonder if the show couldn't have used its potential a little better.\\n\\n\r\nMy Score: 6/10        Decent\\n",
            "date": "2014-11-21T01:40:00+00:00",
            "helpful_count": 19,
            "mal_id": 169373,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3677367.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DreamingLily",
                "username": "DreamingLily"
            },
            "url": "https://myanimelist.net/reviews.php?id=169373"
        },
        {
            "content": "Toaru Hikuushi e no Koiuta it is then! Well before i get in depth with the review , i would like first o make a general comment about the anime(as i always do on my reviews)\r\n Taking into account its popularity and score I consider Toaru Hikuushi e no Koiuta by far the most underrated  anime of the early 2014 releases and i will explain myself.\r\nStory 8:The whole story takes place in an actuall fantasy world where war between  3 factions is quite active.Kal el is a young prince who has been hiding his identity in order to get revenge, to the causeof his parent's death meaning Nina Viento(aka Claire Kruz), that led a revolution a few years ago, a girl  with who he will get in love with during his staying on isla. Though the story is just above average the way that this anime captivates u its insane, it retains a fantastic balance between the characters and develops them without exaggerations and misleads\\n\\n\r\nArt 10: Pure perfection. I have seen over 110 animes, i would easily put Toaru Hikuushi e no Koiuta in my top 3.The quality of the art is OUTSTANDING  and i dont only mean the colours the enviroment  and the details. I mean the naturality of the movement, and the liveliness, i wont lie when i thought sometimes i was watching a movie in blue-ray cause that the kind of impression u get  when u watch this anime\\n\\n\r\nSound 6: It could have  been better, i sort of like the sound effect though, but it doesnt exceeds the mediocrity on that aspect\\n\\n\r\nCharacters 9: The only reason i dont really watch animes with romace, or focused in romance its because i find the characters quite annoying. Well thats not the case here, even though the anime is centered on a flirt(kal el-claire) characters  have quite correct and normal reactions , and not that over-dose lolipop-ubercute and shy reactions we get to see evrytime.The other characters amazing aswell and very well developed.Ariel-Ignacio Mitty(i love this guy) its with its own pesonal story\\n\\n\r\nEnjoyment 9 : I wont lie i am not very into romances when it coems to animes.but THIS one , really blew my mind in every aspect.\\n\\n\r\nI will say just this, it is a shame that some  mediocre animes(not nesceserily mainstream) get all that hype  for no reason and such beautifull animes  like Toaru Hikuushi e no Koiuta  dont get the attention that deserve.My total score is a 8.5 which would easily be 9 with some more decent sound",
            "date": "2014-04-01T16:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 138225,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3389493.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Subxaero",
                "username": "Subxaero"
            },
            "url": "https://myanimelist.net/reviews.php?id=138225"
        },
        {
            "content": "Very Good: 8.\r\nStory- It's plot was totally unique, in the sense that it revolves around a moral lesson, where forgiving is divine, no other anime (that I know of) that does that kind of plot where a moral lesson take over as to what the situation is. Ok, so the plot specs was a bit too cheesy of sorts and often wasn't very clear as to why certain country of sort put a group of people in a flying island that seems to defy the laws of physics only to have it sacrifice to the so called \"End Of the Sky.\" \r\nFair 6.\r\nArt- I'd probablyfine the way it is since there isn't any fanservice for the pirreos to howl about which is one reason why I give this category a 6. But, the planes....oh the planes, the setting was suppose to be in the late 19th century so why would planes of 20th century designs be doing in that time period? Also, I can't help but notice a VTOL aircraft with such horrible design have to be an old model compare to an Macchi C.202 where Kal gets to pilot it on the last episode, there are also air crafts that were clearly of German design like the Bf 102 and the Stuka, clearly an amateur plane enthusiast will be able to tell that the VTOL aircraft that the Republic Of Ballesteros were using was a much more modern design.Frankly, I can say that this series creator Inumura, Koroku wasn't much of a techie, then again, I forgive him....just a little to give this category a fair rating.\\n\\n\r\nCharacter- Ok, so in this serial it was all about Kal and Claire, Kal, is basically what you might call as into this situation where he has fallen from grace after the wind revolution, in fact her predicament can be compared to the French Revolution, where the fate of the Dauphin was unclear, but in his case, it was the continuation as to what has happen to the Dauphin- which btw refers to him, where one would feel sorry for him that he has to go through such predicament that he develops hatred to the very person he blames the most who happens to be Clair aka Nina Viento, however the touching part that I like was when his mother before being sent to the gallows told him to forgive than to hate. I'm one of the few who was surprise that Nina and Clair are one and the same, I kinda like her sweet and kind personality, but there were time that I've wish that she could have use her authority as the governor of Isla instead of being a puppet of the four oligarchs, I also like the part where she regains her powers from being forgiven by Kal, but for me that's as far as I can say about her.\\n\\n\\n\r\nGood 7.\\n\\n\r\nSound- The rating is for the opening theme.\\n\\n\\n\r\nDecent 4.\\n\\n\r\nEnjoyment- I'd say that my rating for this category was for the moral lesson that this anime carry's, also, I based my ratings because of the apathy that I've have for the character's as we see into their back story about the fate that the have to undergo and that's as good as it gets. \\n\\n\r\nPoor 3.\\n\\n\r\nOverall- The story maybe good, but unfortunately, this anime has a lot of ill-fitting parts, in fact this anime focuses too much on the romance and slice of life, that it has neglected its adventure genre, now, in an aerial combat a pilot has to make himself a hard target, but in one scene where a group of student adopted a sitting duck in the sky tactic was pretty stupid to say the least, also giving the student a Lee Enfield rife instead of a Vickers Machine gun to defend themselves in an aerial attack goes to show you as to how stupid Inumura, Koroku is when it comes to the principals of aerial combat, it goes to show you that he is more of a novelist who isn't trying hard enough to make the anime's action element exciting. Also, his concept about the setting was too illogical to say the least when one might wonder as to why would a group of people set out in a flying island only to abandon it and sacrifice it to the \"End of the Sky,\" also why would a temporary settlement in the flying island have to be attacked when their just doing something stupid- I mean, what's in it for them? And last but not least, this anime may have ended in an open ending, but it wasn't just a typical open ending where the end is narrow, this anime has a very wide open ending and it was disappointing that it had to end that way, so overall even with a nice story, the ending was a disappointment.which is one reason why I give this anime's overall a 3.",
            "date": "2014-07-27T10:44:00+00:00",
            "helpful_count": 9,
            "mal_id": 153959,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=153959"
        },
        {
            "content": "Just finished watching the show and it left me with a bitter taste in my mouth and I just have to get this off my chest.\r\nRegret is one of the most powerful emotions there is.\r\nI hate writing long essays of review so expect this one to be short. (ironically didn't turn out to be quite short)\r\nSo, simply put, the show is kind of divided into several events where they basically transition from one genre to another. 1-6 there's mostly adventure with a bit of comedy, 7-11 action, drama and some romance, and finally the last two focus mainly on romance with a bit of drama.\r\nOverallthey pulled switching the atmosphere of the series quite well although I personally was offset by a sudden shift after the sixth episode, but I got used to it.\\n\\n\r\nThey deliver the story not in the first episode, but later in first half, so there's a nice feeling of backstory and retrospective of characters. The first thing you'll notice watching the anime is how there is tons of stuff happening. There is never a dull moment. The story is the main plot of the series as it should be. Without going into any more detail, I'll just drop my opinion here that they SHOULD HAVE made a 24-episode here not a 13. Definitely a lot of good material, and generally a really good anime.\\n\r\nNow you stop reading unless you watched the anime and you're wondering what it is that bothers me. Maybe it pissed you off as well.\\n\\n\\n\r\n*SPOILER*\\n\r\nShe didn't confess to him. She didn't, and I'm so pissed off since I was shipping them the entire time. First time I felt so passionate about anime's relationship so much lol.\\n\r\nIt's anime, not real life, don't get all smart now with me, young man/lady. I don't want to turn this into a debate, so lets move on.\\n\r\nJust to emphasize once again, it should have been a 24 episode long anime. OR, there should have been a 1-2-3 episode OVA of Kal-el and Ari's relationship. That would majorly improve the - kind of - cliffhanger ending regarding the relationship.\\n\r\nThere, I feel much better now.\\n\\n\r\nOverall a great anime, well worth watching even if you're mostly for romance, it's still very well worth it.",
            "date": "2015-02-02T07:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 179497,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4182277.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NiBer",
                "username": "NiBer"
            },
            "url": "https://myanimelist.net/reviews.php?id=179497"
        },
        {
            "content": "Look if you want something that will give you enjoyment for 5 hours this will do that, if you want to have the feels every couple episode this will do that, the world haven't seen anything like it that come to mind, you will see a couple thing coming but you will still have the feels when it happen\r\nStory been done a few times\r\nsound  music was lovely and battle sound were battle sounds\r\ncharacter side character are mostly basic with some exception main is pretty good main\r\nenjoyment  was lot found my self actual fill something\r\noverall 10/10",
            "date": "2017-08-03T04:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 254578,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5945497.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/snakelord63",
                "username": "snakelord63"
            },
            "url": "https://myanimelist.net/reviews.php?id=254578"
        },
        {
            "content": "It is in my opinion, one of the best tearjerkers after Clannad. Dont start that thing about other anime having better tearjerker moments than this one because this is purely in my personal opinion. A clear plot, a few twists and turns, but so far, a really good anime to watch and rewatch. This, however needs a season 2 simply because it lacks enough story to fill up all the details that it presented.\r\nGood, well rounded anime, it is a personal favorite and a must watch.",
            "date": "2015-06-24T01:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 191105,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4692115.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ISpyAGuitarist",
                "username": "ISpyAGuitarist"
            },
            "url": "https://myanimelist.net/reviews.php?id=191105"
        },
        {
            "content": "When I first watched this anime, the story immediately got my attention. Well, romance genres always gets my eyes. The ending was quite the hanger so I'm really expecting for a second season.\r\nBut I really think that they will make another season for this anime coz, it was really a hanger, and the scenes of the lovers was just not enough!",
            "date": "2014-04-19T20:33:00+00:00",
            "helpful_count": 5,
            "mal_id": 140555,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3711479.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheBlank",
                "username": "TheBlank"
            },
            "url": "https://myanimelist.net/reviews.php?id=140555"
        },
        {
            "content": "***spoiler free***\r\nStory 5/10\r\nThe story is told in a linear fashion with interesting backstories in between. There are nice slice of life and funny moments in preparation for what's to come. However, there are parts with rushed/cheesy romances, utter predictability (especially episode titles), and a few things left unexplained that can leave a sour feel throughout the series.\r\nArt 5/10\r\nIt isn't as crisp, clean and sharp as the other 2014 anime but the aircraft battles that take place look/feel intense as well as the detail of the aircraft itself. The art could've been a little darker since there were themes of hate and revenge.\r\nSound 7/10\r\nThe show haslovely orchestral music to fit nicely with each scene from the happy and playful moments to the sad and depressing ones. The same can be said about the voice acting as well. The characters sound quite believable in most situations when conveying their emotions and desires. Although at times it can be overdone to the point where reducing the volume is the best option.\\n\\n\r\nCharacters 3/10\\n\r\nThe main characters Claire &amp; Kal-el receive interesting/dark backstories to get the viewer sucked in. The way they're both setup is quite intriguing. In contrast to that, there were two problems in the series. First is that there are too many characters to be developed in just 13 episodes. Second, there are moments for certain characters that are made so blatantly obvious that when it becomes their time to shine, the emotional impact doesn't deliver what's intended because of the predictability in past episodes. Couple this with the beautiful music just adds to the confusion of how one should feel about the characters.\\n\\n\r\nEnjoyment 2/10\\n\r\nAs for me, I grew to hate this series. It started off very well but the way the characters were setup halfway in the anime was beyond predictable. I just couldn't buy what was being sold to me after that point. Also, hearing the characters scream was an ear sore. And the student's fighting gear against enemies was questionable. The only thing that kept me in was the music.\\n\\n\r\nOverall 4/10\\n\r\nIf you like people with dark pasts, intense aircraft battles, nice orchestral music, and romance twist, then give this one a shot. My only complaint would be to tone down the cheesiness of the romance and the predictability of what happens to certain characters. Also, you should read episode titles after you finish each episode so you don't get spoiled when watching. If you can get past those things, you should try this one.",
            "date": "2014-04-24T17:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 141179,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/130615.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/billybob300c",
                "username": "billybob300c"
            },
            "url": "https://myanimelist.net/reviews.php?id=141179"
        },
        {
            "content": "This is a review of the series. Or it's supposed to be one, but I almost never write reviews, and I see no reason to bore people with things many others have written, so I'll offer some other perspectives (just don't read if you're under 20). Simply said, it's a story about war, love and adventure. Undoubtedly it is very ambitious, with moods going from girly giddy to PTSD then back to boyhood wonder in a brisk pace, but 13 episodes are just that, only 13 episodes. You don't feel like you've tasted enough of the world and its people.  And I could seeall the cliches coming from 9 episodes away, so don't expect originality either.  The technical aspects are passable.\\n\\n\r\nHowever, don't rule out this series, because watching this anime can be good. I will be frank: anime has mostly become an exclusive wasteland for fetishists thanks to popular demand. Sometimes, it is even soul-destroying and only aggravating the emptiness felt by certain people who are deeply disillusioned with life. Maybe it has always been so, but I digress. Some writer once said a story will come to mean different things to different people. So does this series to me. By that I don't mean it's an awesome tearjerker (already done that to death), or a magical cure for depression (that's stupid). But it has actually made me think, and at some point I found my attention drifting away.\\n\\n\r\nFor a long time I have been alienated by fiction (that at least attempts to be emotional), anime or not. I am too old for high school idols or pretty-headed haremettes.  I see no point in trying out yet another gratuitously dystopian fantasy just to see which fictional character could outbastard other fictional bastards.  I am too aware to enjoy the kind of romances dominated by female interests, which believe in debasing men even if the vapid and vacillating women almost never deserve it, especially the subgenre of infidelity / divorce / \"empowerment\" fantasy that is mostly about feeding the infamous Rationalization Hamster. When I read about how 70% (or 90% in certain places) of US soldiers from Iraq face divorce (robbery), or how 1/4 of Britons commit infidelity, or how a female Facebook executive publicly encourages other females to sleep around with \"bad boys\" then snatch an obedient guy for marriage, I suppose I no longer have the energy to be fazed or sarcastic. It's like a broken record. But this anime struck a chord with me.\\n\\n\r\nI, and probably many other people, have more in common with the prince than I'd care to admit. Just that, we don't have a loving family to heal us, or a destination so noble like the End of the sky to inspire us, or a grand conflict to humble our self-centered indignation, or the chance to forge an unquestioning bond of love in the face of death, free of doubt and pride, with a person that deserves it. We don't have a wise mother to tell us that embracing our hatred against her killer, which is the world itself, would eventually destroy us, no matter how justified we might seem. Such simple, theatrical words that I used to dismiss. Now ... \\n\\n\r\nIt was something to ruminate on, and nice when it lasted.",
            "date": "2014-08-18T13:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 157045,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/marewmarew",
                "username": "marewmarew"
            },
            "url": "https://myanimelist.net/reviews.php?id=157045"
        },
        {
            "content": "(Spoiler free!)\r\nToaru Hikuushi e no Koiuta is set in a pre WW2 era where in essence, a bunch of explorers go on an expedition called the Isla project. flying to find the \"End of the Sky\" much like an expedition to find the edge of the world. From there, romance blooms among the pilots of the Isla project's trainee school through the hardships of battle and loss of friends along the journey. The story follows the main protagonist, Kal-El Albus, a former crown prince of an overthrown empire, and his journey through hatred and revenge, to eventually, forgiveness and romance. \r\nSounds like quite a lotto take in right? Yeah, that's kinda what I felt watching this anime. But despite being disoriented for quite a while, it slowly became quite an enjoyable ride for me after a few episodes\\n\\n\r\nStory: 7\\n\\n\r\nThe story line of the anime is simple and complex at the same time. As it is a romance anime after all, it involves people falling in love (duh). But the context of this romance anime can be confusing at times. Looking beyond that, Toaru Hikuushi e no Koiuta has a pretty engaging story overall, with much detail in the lives of the various characters portrayed. And the feels are also quite strong! Honestly, if I were a girl, I'd probably have cried quite a few times.\\n\\n\r\nThe only reason why it didn't get a higher score was because of its incredibly slow start. It took 2-3 episodes before we were fully filled in on what's really going on\\n\\n\r\nArt: 6\\n\\n\r\nToaru Hikuushi e no Koiuta is a romance anime after all, but due to the nature of the story, some degree of artwork is needed to portray action scenes fully, especially duing dogfights. It was... sufficient. Apart from that, characters were nicely drawn, but at times, slightly plain. Sufficient\\n\\n\r\nSound: 5\\n\\n\r\nProbably my only qualm of the anime. Openings and endings were fine, but music especially during intense moments was repreated. That same dissonant piano music seemed slightly too underwhelming for the scenes unfolding like dogfights in the sky.\\n\\n\r\nCharacter: 7\\n\\n\r\nThis anime doesn't spare on character development, and it's interesting to see most of the cast growing as the anime progresses. Toaru Hikuushi e no Koiuta also does a great job making the audience feel the struggle and greif that characters are put through. Creators also did a great job delving into the back story of most of the main characters.\\n\\n\r\nPerhaps exploring other supporting characters would've been even more awesome, but... seems too much to as for haha\\n\\n\r\nEnjoyment: 7\\n\\n\r\nOverall, it was a pretty touching series, pulling me back for yet another episode. The only qualm I have overall, would be the ending of the anime. It ran a little short, but still, sufficient to tell the story. \\n\\n\\n\r\nFinally:\\n\r\nToaru Hikuushi e no Koiuta was good. If you are new to the romance genre coming from shounen anime, it has a nice balance between action and drama. Although it didn't jerk any tears from me, it does have a touching and engaging story. My only advice to those wanting to watch Toaru Hikuushi e no Koiuta, is to get through the first few episodes, and let the rest of the story take you away",
            "date": "2014-12-24T07:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 174013,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BlastHell",
                "username": "BlastHell"
            },
            "url": "https://myanimelist.net/reviews.php?id=174013"
        },
        {
            "content": "Okay, if you are looking at my \"enjoyment\" score (10) and wondering why I gave the show a 5, you'll understand soon. This is a show that sells itself as a romantic story about a pilot and a girl in the midst of a gruesome war.  About the compassionate love between a soldier and a lady. I was expecting tragedy that tugs at my heartstrings and the realities of war's effect on people. This would have been great if the show was written with heart, but, sadly, it wasn't...\r\nI would not have enjoyed watching this show at all if it wasn't for my friendthat watched with me.  Because of the incredibly simple plot and terrible pacing, we were able to spend most of our time making fun of the terrible characters, making predictions on the \"plot twists\", and making really funny nicknames for each character.  I swear, we may have figured out a way to make any anime fun to watch no matter how terrible the show really is!!!\\n\\n\r\nWe would dub over scenes in real time as a way of explaining how unrealistic and predictable they were.  For example, while the characters were flying next to each other, they would actually just talk without any radio or normal communications device.  I mean, how can anyone hear one another with two gigantic gas engine propellers on either side of the plane running full throttle?? We would dub over, \"what did you say?!\" and \"I can't hear you with these gigantic engines running!! Try sign language!\" \\n\\n\r\nWe named this one really fat dude Porkins, and the super hot girl that somehow liked him (seriously weird romances) Gold Digger because the only way that relationship could make sense in our minds was if Porkins was filthy rich. We also predicted that Porkins was going to die in the most stupid way, too (like in Star Wars).  Turns out we were right!! the dude literally flew into enemy fire with a broken plane for no reason only after he ejected Gold Digger from his plane......WHY DIDN'T HE JUST EJECT BOTH OF THEM!!! AND WHY DID HE THINK THAT GOLD DIGGER WAS GOING TO BE JUST FINE??? seriously stupid writing, but we were laughing so hard that we had to pause the video for at least 5 minutes.\\n\\n\r\nNow, lets talk about pacing!  The director and writers of this show have no clue how to end an episode!!  For example, Porkins' death although hilarious was supposed to be a huge emotional war hero scene....you'd think the episode would end with his death to instill the emotions of the episode, but no!! NO!! why would they do that when they can cut to the rest of the pilots standing on the runway wondering where Porkins and Gold Digger are....and then end it with the rest of the planes landing without Porkins' plane....My friend and I made a game out of this after the 3rd episode since the first three episodes had terrible endings.  We would pick out which scene would be the end only to find out the show was going to make use of the last minute to show you something completely irrelevant to ruin the possible cliff hanger....of course this also gave us a lot of laughs, as well. \\n\\n\r\nIn the end, we ended up enjoying the show by turning it into a comedy when it was trying really really hard to be a serious war story.  If you find a show similar to this, take as many steps as possible to make fun of it so that you can actually enjoy it. Seriously, Porkins was hilarious!!",
            "date": "2015-03-30T08:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 184089,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2401229.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/zacho3to",
                "username": "zacho3to"
            },
            "url": "https://myanimelist.net/reviews.php?id=184089"
        }
    ],
    [
        {
            "content": "The skies is a vast and mysterious place. It’s unlimited and holds infinite potential for sky pirates and aviators of war. For a young pilot named Kal-el Albus, he’s looking for more than just flying the skies. He’s looking for revenge for the harsh life that he’s endured during a time period known as the ‘Wind Revolution’. But now as a young man, he embarks on a journey along with his sister Ariel to discover more than just riding the winds.\r\nTaking place in the same world as the movie Toaru Hikushi E No Tsuioku, this show holds little similarity besides its initial setting. In otherwords, it’s not a necessity to watch the film to understand or gain pleasure from this series. Yet, they do hold a similarity based on a concept – the reality of war. Because with war, there’s countless casualties, misunderstandings, and death that breeds hatred. Kal-el knows that from experience when he was just a kid. From a biographical viewpoint, it’s almost too harsh for a reality to sink it all in. Yet for him, he holds onto his promise to never forgive or forget.\\n\\n\r\nComing into this series will feel like an adventure at first. The setting has a steam punk-esque that illustrates itself with the usage of its vehicles. But by standards, they are powered by hydrogen and fuel rather than some super tech gadget that you would find in mecha theme series. There’s also battleships too and other weaponry designed for warfare. For what’s worth, we quickly find out that there are nations at war and our main characters gets caught up in the middle of it. More than that is the mystery regarding a phenomenon known as the ‘End of the Sky’. It raises many flags for questions relating to its secret, the truth behind the conflicts, and our curiosity of how all this ties together with the main characters.\\n\\n\r\nSpeaking of characters, this series spends a good majority of its time to let viewers to get know them. In particular, Kal-el is one that stands out more than just besides his name. Despite having a similar name to the man of steel Superman along with the skill to fly, Kal-el is far from invulnerable. We do get a sense of justice from him but sometimes, his pride and arrogance gets the best of him. In essence, he still has a lot more to learn of the world and himself. His new position as a cadet allows him to discover potential and the truth. Yet on many occasions, Kal-el finds himself in trouble with his life in danger and realizing his own insecurities. This doesn’t just solely fall with his hands but connects with other characters such as Claire Cruz. The duo shares a rather peculiar relationship that ranges from respect, friendship, and romance. Yet, it’s easy to tell that their love story is one that is set to self-destruct. For more than just tragic reasons, their relationship also holds deep secrets and hidden truths that Kal-el held scars for his whole life. Strictly speaking, a romance during a time of war is never a fantastic idea. Whether their feelings blooms or decays is like a flower that does not last forever. \\n\\n\r\nBut of course, no one’s immortal in this show either. No one lives forever and war brings that truth to its finest. Throughout the series, characters faces the reality of war. Namely the Sky Clan, the unit that most of the main and supporting characters are enlisted in, experiences firsthand why there is grief and despair when sent to the line of battle. There is no salvation in the line of duty. Whether killing others for survival or nationalism, there’s one thing the cadets all needs to know and that’s for fighting for what’s right. For most of characters, no one is safe despite their various reasons for entering in the war. The series doesn’t neglect to spare characters from certain death. This may catch some viewers in surprise as several major supporting characters meets their doom as result of fighting. But at the same time, this should bring about reality – that war is never without a price.\\n\\n\r\nTheoretically speaking, there are several ways the series demonstrates its feelings through its course. The most obvious one is romance between Claire and Kal-El. It’s very different compared to the classic Clark Kent/Lois Lane from the Superman franchise. Rather, it feels rushed and sometimes lifeless because our main characters lacks compatibility. Young people fall in love yet their story has tragic holes in it by dark revelations and startling discoveries. Yet, the show doesn’t stop at that point with the romantic aspect as it expands to some of our supporting characters. Unfortunately, the show doesn’t handle its romance aspect in a manner deemed as everlasting. It doesn’t just matter with the class levels or relationship development. Rather, it comes off as an average love story based on mutual attraction and predictability; as in the traditional fan ships. The only part is that some ships are bound to sink, not in the way of the ‘friend zone’ but more as into heaven. However, it does bring back its point to illustrate the reality of warfare as love isn’t met to last during such crisis. \\n\\n\r\nOn the other hand, the appealing parental and sibling love between characters is one that we should smile upon. Kal-El has a family and even though not related by blood, they treat him with respect, dignity, and care. In many ways, it feels like they love him as their own child. Similarly, Kal-El and Ariel shares a close relationship despite their constant bickering. A prominent evidence comes from their time spent in the air. On one instance, Kal-El experiences a brink of despair similar to one in his past. Looking back now, this show’s relationship shines stronger when it focuses on commitment as opposed to becoming a couple by love.\\n\\n\r\nAt the same time, we get a tense feeling of vengeance coming from not only Kal-El but also a young boy named Ignacio Axis. With silver hair, a cold stare, and stoic personality, Ignacio is the classic lone wolf. We learn through flashbacks with his circumstances and motivations why he became the person as he is today. In a way, there’s a similarity between Kal-El and Ignacio based on their quest for revenge. They are driven by vengeance and their desire to achieve justice by their own standards. Toaru Hikuushi e no Koiuta (The Pilot’s Love Song) set these standards and attempts to give viewers a chance to see how they are resolved. In the end, their resolutions and ideas might be different from what the audience have in mind. I think by this show’s standards, it isn’t presented as a didactic story but rather for how chains of reactions leads to certain outcomes. Unfortunately, these outcomes are ambiguous and feels rushed with a lack of depth.\\n\\n\r\nBecause nations are at war, expect plenty of action both on land and in the air. The dogfights are coordinated with credible effort. From minute one, the show demonstrates that it can handle its exposition of war in fluid way. The dogfights are rapid with bullets raining from the sky but not in mindless action. Rather than just a full throttle spraying of bullets, we also get strategic movements, heroic sacrifices, and what it truly is like being a pilot. Similarly on land, there’s bloodshed and violence as action-oriented episodes presents every effort to demonstrate its cruel reality. \\n\\n\r\nEven with a credible story however comes with that prevents this series from shining. For one thing, the story itself is predictable with cliches and a blend romance based on mutual attraction. Certain revelations and discoveries are presented in a quick fashion and anticlimactic despite its initial built-up. Although some of its flashback scenes paints a realistic format of cruel life, there’s little strength in their actual present stories. Main characters’ development suffers as result along with supporting characters including some which held potential development but seemingly tossed out of the show for good. There’s also a bit of disappointment relating to its setting. In essence, the setting the show takes place in embellishes itself with fantastic features for potential world building. Yet, the majority of the show chooses to focus on its character relationships and state of affairs with its main story. In retrospect, there’s a lack of depth in exploring what’s behind the scenes. Even some of the initial mysteries are pinned down when compared to our main characters’ thirst for revenge. \\n\\n\r\nArtistic wise, the show demonstrates a high degree of fantastical features. It presents lush backgrounds with aesthetic designs with its aircrafts. Some of them holds a similar degree with historical vehicles while others (such as battleships) creates a feeling of intellectual depth. Some scenes also gives off a feeling of tranquility and almost a dream-like atmosphere such as romantic moments. The flashbacks also illustrates to show, rather than tell the audience of what our main characters has gone through during their childhood with a black and white world quality. Character design also makes sense on most parts although some characters’ ages doesn’t match their appearance. Luckily, the show omits fan service even with the adaption of the classic beach episode; for training purposes of course!\\n\\n\r\nA fantasy series would also require a stellar soundtrack to match its high caliber degree of action. Luckily, it is consistent in terms of coordination. Dogfights in the air matches well with every movement with adamant integrity. The OST also demonstrates both an ethereal and vigorous way of presenting certain scenes to match the mood. On the other hand, some of the characters’ voices can be exasperating to the ears. Really, how long can you listen to Kal-El scream in agony at whatever he has trouble on mind? Or otherwise, Claire examining her own insecurities? It will take some time to get over their mannerisms. Luckily, the OP and ED song might be just what you need for their quality and delicacy.\\n\\n\r\nHatred, fear, oppression, revenge, love, regret. Those are just a few of qualities coming from war that the show brings together. Yet, there is some peace at mind with characters that demonstrates their heroism in the line of duty. This show focuses on aspects of that through human dynamics. The romance coming out of this show will come out as cliché by the classic ‘love at first sight’ circumstance. However, the parental/sibling bond is a strength that is hard to overlook. With impressive action sequences and a fantastic setting, expect warfare to come as reality painted by grim truths. Watching this show in the end will feel like taking a journey to a world, one which holds feelings in a fictional realm. \\n\\n",
            "date": "2014-03-31T10:39:00+00:00",
            "helpful_count": 115,
            "mal_id": 138079,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=138079"
        },
        {
            "content": "Just by looking at the title (Love Song of a Pilot), the description, and a preview, most people will get the impression that this is a heavy-hitting drama with a beautiful romance augmented by plenty of flying through the skies. I’m pretty sure that description up there also suggests Toaru Hikuushi no Koiuta will cover touching themes as well, such as how hate can be conquered by finding love. The setup is fairly enticing. You’re probably thinking this is a story that will hit your heart.\r\nLower your expectations, NOW. Trash the images my first paragraph produced. Reduce the dramatic impact you are expecting by about50% and lower the charm of the romance you are picturing by about 80%. And were you expecting quirky, vibrant, enjoyable, and interesting characters that you could feel attached to? You are only kidding yourself. With all of the proper cuts applied and high expectations moved to the side, you have what Toaru Hikushii no Koiuta really is: an average drama story that had all the right tools to be excellent.\\n\\n\r\nStory (5)\tCharacters (5)\\n\r\nWhat is a drama’s primary responsibility? To make you cry and feel emotion, that’s what. How does Toaru Hikushi no Koiuta accomplish this? Well, I can say that the method it uses is one I find to be obnoxious: It spends six episodes focusing on a handful of uninteresting cadet characters goofing around until finally, by episode 7 or 8, it decides to start chopping off some heads. In other words, by the second half, war breaks out and about fifty percent of the characters die. Essentially the whole first half of goofing around is designed with the purpose of placing weight on the characters’ impending deaths, however this was accomplished fairly poorly due to the fact that the characters were so uninteresting that it was just unspectacular to see them dick off, cook food, and constantly mock each other. However, most of the characters do establish romantic ties (although very light ones) with each other. And although it seems like a cheap half-assed effort to throw some easy emotional weight onto some of these guys, the minor romances might just give you enough of a reason to care for the characters.\\n\\n\r\nThat’s basically it. The story brings up a handful of characters, kills a couple of them in battle, and makes an effort to hoard your sympathies by showing the survivors crying all over the place and mourning over their lost love ones. There’s nothing particularly excellent or enlightening about this story, its characters, or its emotion. It’s really just the typical second-class drama.\\n\\n\r\nAnd where does the romance fit into all of this? Well, lucky for you romance fans, the first episode jumps right into it, and it is perhaps the only episode where you will get a look at some genuinely heartwarming moments between Kalel and Clair. You think it’s going to continue to be this sweet? No way. The romance just… I don’t know the words… loses its gas I guess? Kalel and Clair just begin to seem too close and too familiar with each other. The romance would have been more effective had Clair been more aloof like she was portrayed as in the first episode, and Kalel would have to work harder to get her. You think the anime would have gone that way considering how it underscores the class difference that separates these two lovers. There were just far too few genuinely charming moments between the two. Even a plot twist that could have brought this romantic relationship to a crazier level was not taken full advantage of. \\n\\n\r\nAside from all of these things, there are a few other elements to the story that aren’t necessarily important. If you hear any of this “holy spring” or “end of the sky” sh*t and can’t figure out what the hell any of it means, don’t stress over it. Understanding those concepts will do nothing to better your experience with this anime. \\n\\n\r\nEnjoyment (6)\\n\r\nIf you cry as easily as Ari (the redhead) does, this drama story might work for you. If you’re like me and are more on the insensitive side, this story will be a waste of time. The story, overall, turned out to be a LOT weaker than I expected. I had the willpower to finish this series only because I kept on expecting for something brilliant to suddenly happen. That’s because this anime’s themes and concepts WERE capable of brilliance. It is too bad that so many faulty decisions were made in the storytelling.  \\n",
            "date": "2014-04-01T19:21:00+00:00",
            "helpful_count": 91,
            "mal_id": 138253,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2589599.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kaboomneverscrub",
                "username": "kaboomneverscrub"
            },
            "url": "https://myanimelist.net/reviews.php?id=138253"
        },
        {
            "content": "**No spoilers** The Pilot's Love Song is a mix of drama, romance and action, though I would say it leans toward primarily being a drama. The show starts with a relatively easygoing feeling, but gets much more serious by the halfway point and remains so until the end.\r\nThe main theme that this series focuses on is the reality of war, which includes the concepts of overcoming fear, accepting loss and the importance of forgiveness through love. There is a fairly decent-sized cast of side characters without being too overwhelming, and there are several romantic interests among them which helps to keep your interest even ifyou're not super into the main relationship. Though their primary purpose is generally to further the drama, the action scenes are quite well-done and do a good job of making you feel like the characters are truly in danger.\\n\\n\r\nOn the negative, the story, at times, is a little confusing and the pacing feels a little off. Given that this is a short series at only 13 episodes, there was perhaps a little too much time spent both on the initial ramping-up to the main conflict and on the denouement after the main conflict.\\n\\n\r\nThere are also times you may find yourself questioning the decisions of the characters, or exactly what their motivations are, and, while that is often a good thing to some extent in storytelling, I felt that there could have been a little more gradual hinting given to the watcher so that some things didn't seem quite as sudden when they were revealed. Having said that, most things are tied up by the end, though it may leave some people feeling a little unfulfilled.\\n\\n\r\nIn summary, if you're the type of person who focuses a lot on logic, consistency and smooth storytelling, this series may not be for you. On the other hand, if you are more about the character relationships and the drama, while being able to suspend your disbelief regarding some inconsistencies or unexplained phenomenon, you will probably enjoy this show like I did.",
            "date": "2014-09-16T10:15:00+00:00",
            "helpful_count": 49,
            "mal_id": 160617,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/51582.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ddrcrono",
                "username": "ddrcrono"
            },
            "url": "https://myanimelist.net/reviews.php?id=160617"
        },
        {
            "content": "Toaru Hikuushi e no Koiuta (The Pilot's Love Song) is a story that primarily focuses on the growth of the main character Kal-el, the adventure that he goes on, and his love story. Set in a fantasy-esque setting, the show tries to produce images like the \"holy spring\" or the \"end of the sky\". The story starts out with a day-to-day pilot school setting but later shifts to a battlefront setting.\r\n\tAlmost immediately, the show attempts to dive into the romantic zone. It tries to go for the classic \"love at first sight\" complete with romantic scenery and music instead of a gradual development between thetwo main love interests. If you're into romanticized scenes such as a \"couple moment\" where the girl is \"flying\" through the air with her arms spread wide from the backseat of a bike in a titanic-like image, then the beginning of this story may be a good watch for you. However, be warned that there will never be full conclusion where the two ride into the romantic sunset hand in hand and live happily ever after. Anyhow, the characters Kal-el and Claire quickly become infatuated with each other. Kal-el gets obsessive whenever he thinks about her. Conveniently enough throughout the story, they become stranded alone with each other in various scenarios for dramatic effect. As for the other students in their class, most of them come in convenient parings, though not all these love stories will end happily, or the way that most people would want them to.\\n\\n\r\n\tThe pasts of the main characters in the story are revealed through long flashbacks instead of current events. I rather liked the background stories for the four main characters. Each of their back-stories are fairly well developed and it becomes evident why each of them behaves the way that they do. Unfortunately, none of these characters ever get a chance to fully understand one another. \\n\\n\r\nThe main character, Kal-el Albus, is the former crown prince of the Ballesteros Empire; his family was removed from power during a time of revolution.  A major theme in the story revolves around Kal-el's hate for the public figure called Nina Viento. Even though he was taken in and loved by a warm and welcoming new family, he still desires revenge on the girl that took everything away from him. A point that the show tries to get across is the importance of forgiveness. People seem to be pretty forgiving here in the face of love.\\n\\n\r\n\tAs mentioned before, the story goes from happy training/school days scenes to a full blown \"war\" against the fabled sky clan. There is an immediate change in pace and the remainder of the story comes out a bit rushed. The aerial fights weren't bad to observe, however, some flying angles got a little dizzy to look at. If you have a slight motion sickness like I do, you might feel a bit of a headache going through some of those scenes. Still, it certainly is a treat for those who have a love for airplanes and/or the Air Force. During the \"war\", the story tries really hard to bring out the feels. The amount of emotion that you feel during those scenes depends on how easily you get emotional over the deaths of minor characters. But for some of the deaths, the death flags were raised high up in the air and waved around in circles. I imagine it'd be a pretty terrifying experience watching your friends and classmates dying all around you. Just picture the raw fear that the characters would experience. Whether or not some of the deaths were \"uncalled\" for, we get a good glimpse at the devastating reality of war. There is an emphasis on \"guts\" and the \"courage\" to sacrifice yourself for other people's sake. In the end, the ones who experience the most pain are the ones who are left behind. In this story the military also gives out purple heart-like badges to the families of the deceased. It's all the military can really do for the families out of gratitude, but no gesture can truly express the emotions felt on both sides.\\n\\n\r\n\tIt's a bit of a head-scratcher how they were so willing to send students off into actual battle in that condition. The least they can do is supply them with actual planes instead of the training planes they had to use. Those planes didn't even have covers, so casualties became almost inevitable. Why did they venture into enemy territory with so many students in the first place?\\n\\n\r\n\tIt can be noted that in this world, there is a literal end to the sky. The whole reason behind all the sacrifices was to complete their expedition to the end of the sky, watch their floating island get destroyed.... have an adventure... take some pictures... maybe eat a snack after... Their motives for the entire trip becomes pretty questionable given the high casualty rate.\\n\\n\r\n\tIn the end there are still many questions that are left unanswered. The \"legendary sky clan is still shrouded in mystery even though we get to sneak a glance at their technologically advanced city. The Holy Levamme  Empire is only portrayed as \"mysterious allies\" with an ambiguous reference to a silver fox plane. There is a possibility that it is directly tied with the novelist's other pilot novel. We are also never told the reason behind Nina Viento's temporary loss of power, whether it was because she was emotionally unstable or that it was only for the sake of drama.\\n\\n\r\n\tMany of the events came off feeling predictable. Some of the characters seem to just disappear. For example, what happened to Wolfgang's partner who always called him \"aniki\"?  What happened to rest of the course 1 students besides Fausto? Either they all mysteriously died after the fighting, I missed something important, or they are apparently so insignificant they don't even get mentioned in the slightest. There were scenes where characters die off so quickly it leaves you mentally unprepared. Instead of crying or feeling sorrow, you would just think \"Wait a second, did that person really just die? Rip....\" The main characters in contrary are shrouded in plot armor and conveniently escape and live. The different situations where Kal-el could have died were above and beyond. There were many other things that just went by unexplained such as a one-time mention of a notion to overthrow the revolutionary government towards the end. Oh well, it's up to you to imagine what that will lead to I guess..?\\n\\n\r\n\tThe soundtrack throughout the show was good. Right of the bat, some \"grand\" themed ost plays as the characters leave for the floating island of Isla. I rather liked the Op song. It was nice to listen to. The art was decent but the animation wasn't always consistent. As a side note, I can't say that I'm a fan of the computer art designed plane base.\\n\\n\r\n\tThe ending felt okay for me. There is a lack of a conclusive ending, but as with a lot of the rest of the story, that is up to your own interpretation. The plot for most part is pretty straightforward, and while the show was enjoyable at times, there were other times where I would tilt my head and wonder if the show couldn't have used its potential a little better.\\n\\n\r\nMy Score: 6/10        Decent\\n",
            "date": "2014-11-21T01:40:00+00:00",
            "helpful_count": 19,
            "mal_id": 169373,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3677367.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DreamingLily",
                "username": "DreamingLily"
            },
            "url": "https://myanimelist.net/reviews.php?id=169373"
        },
        {
            "content": "Toaru Hikuushi e no Koiuta it is then! Well before i get in depth with the review , i would like first o make a general comment about the anime(as i always do on my reviews)\r\n Taking into account its popularity and score I consider Toaru Hikuushi e no Koiuta by far the most underrated  anime of the early 2014 releases and i will explain myself.\r\nStory 8:The whole story takes place in an actuall fantasy world where war between  3 factions is quite active.Kal el is a young prince who has been hiding his identity in order to get revenge, to the causeof his parent's death meaning Nina Viento(aka Claire Kruz), that led a revolution a few years ago, a girl  with who he will get in love with during his staying on isla. Though the story is just above average the way that this anime captivates u its insane, it retains a fantastic balance between the characters and develops them without exaggerations and misleads\\n\\n\r\nArt 10: Pure perfection. I have seen over 110 animes, i would easily put Toaru Hikuushi e no Koiuta in my top 3.The quality of the art is OUTSTANDING  and i dont only mean the colours the enviroment  and the details. I mean the naturality of the movement, and the liveliness, i wont lie when i thought sometimes i was watching a movie in blue-ray cause that the kind of impression u get  when u watch this anime\\n\\n\r\nSound 6: It could have  been better, i sort of like the sound effect though, but it doesnt exceeds the mediocrity on that aspect\\n\\n\r\nCharacters 9: The only reason i dont really watch animes with romace, or focused in romance its because i find the characters quite annoying. Well thats not the case here, even though the anime is centered on a flirt(kal el-claire) characters  have quite correct and normal reactions , and not that over-dose lolipop-ubercute and shy reactions we get to see evrytime.The other characters amazing aswell and very well developed.Ariel-Ignacio Mitty(i love this guy) its with its own pesonal story\\n\\n\r\nEnjoyment 9 : I wont lie i am not very into romances when it coems to animes.but THIS one , really blew my mind in every aspect.\\n\\n\r\nI will say just this, it is a shame that some  mediocre animes(not nesceserily mainstream) get all that hype  for no reason and such beautifull animes  like Toaru Hikuushi e no Koiuta  dont get the attention that deserve.My total score is a 8.5 which would easily be 9 with some more decent sound",
            "date": "2014-04-01T16:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 138225,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3389493.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Subxaero",
                "username": "Subxaero"
            },
            "url": "https://myanimelist.net/reviews.php?id=138225"
        },
        {
            "content": "Very Good: 8.\r\nStory- It's plot was totally unique, in the sense that it revolves around a moral lesson, where forgiving is divine, no other anime (that I know of) that does that kind of plot where a moral lesson take over as to what the situation is. Ok, so the plot specs was a bit too cheesy of sorts and often wasn't very clear as to why certain country of sort put a group of people in a flying island that seems to defy the laws of physics only to have it sacrifice to the so called \"End Of the Sky.\" \r\nFair 6.\r\nArt- I'd probablyfine the way it is since there isn't any fanservice for the pirreos to howl about which is one reason why I give this category a 6. But, the planes....oh the planes, the setting was suppose to be in the late 19th century so why would planes of 20th century designs be doing in that time period? Also, I can't help but notice a VTOL aircraft with such horrible design have to be an old model compare to an Macchi C.202 where Kal gets to pilot it on the last episode, there are also air crafts that were clearly of German design like the Bf 102 and the Stuka, clearly an amateur plane enthusiast will be able to tell that the VTOL aircraft that the Republic Of Ballesteros were using was a much more modern design.Frankly, I can say that this series creator Inumura, Koroku wasn't much of a techie, then again, I forgive him....just a little to give this category a fair rating.\\n\\n\r\nCharacter- Ok, so in this serial it was all about Kal and Claire, Kal, is basically what you might call as into this situation where he has fallen from grace after the wind revolution, in fact her predicament can be compared to the French Revolution, where the fate of the Dauphin was unclear, but in his case, it was the continuation as to what has happen to the Dauphin- which btw refers to him, where one would feel sorry for him that he has to go through such predicament that he develops hatred to the very person he blames the most who happens to be Clair aka Nina Viento, however the touching part that I like was when his mother before being sent to the gallows told him to forgive than to hate. I'm one of the few who was surprise that Nina and Clair are one and the same, I kinda like her sweet and kind personality, but there were time that I've wish that she could have use her authority as the governor of Isla instead of being a puppet of the four oligarchs, I also like the part where she regains her powers from being forgiven by Kal, but for me that's as far as I can say about her.\\n\\n\\n\r\nGood 7.\\n\\n\r\nSound- The rating is for the opening theme.\\n\\n\\n\r\nDecent 4.\\n\\n\r\nEnjoyment- I'd say that my rating for this category was for the moral lesson that this anime carry's, also, I based my ratings because of the apathy that I've have for the character's as we see into their back story about the fate that the have to undergo and that's as good as it gets. \\n\\n\r\nPoor 3.\\n\\n\r\nOverall- The story maybe good, but unfortunately, this anime has a lot of ill-fitting parts, in fact this anime focuses too much on the romance and slice of life, that it has neglected its adventure genre, now, in an aerial combat a pilot has to make himself a hard target, but in one scene where a group of student adopted a sitting duck in the sky tactic was pretty stupid to say the least, also giving the student a Lee Enfield rife instead of a Vickers Machine gun to defend themselves in an aerial attack goes to show you as to how stupid Inumura, Koroku is when it comes to the principals of aerial combat, it goes to show you that he is more of a novelist who isn't trying hard enough to make the anime's action element exciting. Also, his concept about the setting was too illogical to say the least when one might wonder as to why would a group of people set out in a flying island only to abandon it and sacrifice it to the \"End of the Sky,\" also why would a temporary settlement in the flying island have to be attacked when their just doing something stupid- I mean, what's in it for them? And last but not least, this anime may have ended in an open ending, but it wasn't just a typical open ending where the end is narrow, this anime has a very wide open ending and it was disappointing that it had to end that way, so overall even with a nice story, the ending was a disappointment.which is one reason why I give this anime's overall a 3.",
            "date": "2014-07-27T10:44:00+00:00",
            "helpful_count": 9,
            "mal_id": 153959,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=153959"
        },
        {
            "content": "Just finished watching the show and it left me with a bitter taste in my mouth and I just have to get this off my chest.\r\nRegret is one of the most powerful emotions there is.\r\nI hate writing long essays of review so expect this one to be short. (ironically didn't turn out to be quite short)\r\nSo, simply put, the show is kind of divided into several events where they basically transition from one genre to another. 1-6 there's mostly adventure with a bit of comedy, 7-11 action, drama and some romance, and finally the last two focus mainly on romance with a bit of drama.\r\nOverallthey pulled switching the atmosphere of the series quite well although I personally was offset by a sudden shift after the sixth episode, but I got used to it.\\n\\n\r\nThey deliver the story not in the first episode, but later in first half, so there's a nice feeling of backstory and retrospective of characters. The first thing you'll notice watching the anime is how there is tons of stuff happening. There is never a dull moment. The story is the main plot of the series as it should be. Without going into any more detail, I'll just drop my opinion here that they SHOULD HAVE made a 24-episode here not a 13. Definitely a lot of good material, and generally a really good anime.\\n\r\nNow you stop reading unless you watched the anime and you're wondering what it is that bothers me. Maybe it pissed you off as well.\\n\\n\\n\r\n*SPOILER*\\n\r\nShe didn't confess to him. She didn't, and I'm so pissed off since I was shipping them the entire time. First time I felt so passionate about anime's relationship so much lol.\\n\r\nIt's anime, not real life, don't get all smart now with me, young man/lady. I don't want to turn this into a debate, so lets move on.\\n\r\nJust to emphasize once again, it should have been a 24 episode long anime. OR, there should have been a 1-2-3 episode OVA of Kal-el and Ari's relationship. That would majorly improve the - kind of - cliffhanger ending regarding the relationship.\\n\r\nThere, I feel much better now.\\n\\n\r\nOverall a great anime, well worth watching even if you're mostly for romance, it's still very well worth it.",
            "date": "2015-02-02T07:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 179497,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4182277.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NiBer",
                "username": "NiBer"
            },
            "url": "https://myanimelist.net/reviews.php?id=179497"
        },
        {
            "content": "Look if you want something that will give you enjoyment for 5 hours this will do that, if you want to have the feels every couple episode this will do that, the world haven't seen anything like it that come to mind, you will see a couple thing coming but you will still have the feels when it happen\r\nStory been done a few times\r\nsound  music was lovely and battle sound were battle sounds\r\ncharacter side character are mostly basic with some exception main is pretty good main\r\nenjoyment  was lot found my self actual fill something\r\noverall 10/10",
            "date": "2017-08-03T04:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 254578,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5945497.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/snakelord63",
                "username": "snakelord63"
            },
            "url": "https://myanimelist.net/reviews.php?id=254578"
        },
        {
            "content": "It is in my opinion, one of the best tearjerkers after Clannad. Dont start that thing about other anime having better tearjerker moments than this one because this is purely in my personal opinion. A clear plot, a few twists and turns, but so far, a really good anime to watch and rewatch. This, however needs a season 2 simply because it lacks enough story to fill up all the details that it presented.\r\nGood, well rounded anime, it is a personal favorite and a must watch.",
            "date": "2015-06-24T01:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 191105,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4692115.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ISpyAGuitarist",
                "username": "ISpyAGuitarist"
            },
            "url": "https://myanimelist.net/reviews.php?id=191105"
        },
        {
            "content": "When I first watched this anime, the story immediately got my attention. Well, romance genres always gets my eyes. The ending was quite the hanger so I'm really expecting for a second season.\r\nBut I really think that they will make another season for this anime coz, it was really a hanger, and the scenes of the lovers was just not enough!",
            "date": "2014-04-19T20:33:00+00:00",
            "helpful_count": 5,
            "mal_id": 140555,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3711479.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheBlank",
                "username": "TheBlank"
            },
            "url": "https://myanimelist.net/reviews.php?id=140555"
        },
        {
            "content": "***spoiler free***\r\nStory 5/10\r\nThe story is told in a linear fashion with interesting backstories in between. There are nice slice of life and funny moments in preparation for what's to come. However, there are parts with rushed/cheesy romances, utter predictability (especially episode titles), and a few things left unexplained that can leave a sour feel throughout the series.\r\nArt 5/10\r\nIt isn't as crisp, clean and sharp as the other 2014 anime but the aircraft battles that take place look/feel intense as well as the detail of the aircraft itself. The art could've been a little darker since there were themes of hate and revenge.\r\nSound 7/10\r\nThe show haslovely orchestral music to fit nicely with each scene from the happy and playful moments to the sad and depressing ones. The same can be said about the voice acting as well. The characters sound quite believable in most situations when conveying their emotions and desires. Although at times it can be overdone to the point where reducing the volume is the best option.\\n\\n\r\nCharacters 3/10\\n\r\nThe main characters Claire &amp; Kal-el receive interesting/dark backstories to get the viewer sucked in. The way they're both setup is quite intriguing. In contrast to that, there were two problems in the series. First is that there are too many characters to be developed in just 13 episodes. Second, there are moments for certain characters that are made so blatantly obvious that when it becomes their time to shine, the emotional impact doesn't deliver what's intended because of the predictability in past episodes. Couple this with the beautiful music just adds to the confusion of how one should feel about the characters.\\n\\n\r\nEnjoyment 2/10\\n\r\nAs for me, I grew to hate this series. It started off very well but the way the characters were setup halfway in the anime was beyond predictable. I just couldn't buy what was being sold to me after that point. Also, hearing the characters scream was an ear sore. And the student's fighting gear against enemies was questionable. The only thing that kept me in was the music.\\n\\n\r\nOverall 4/10\\n\r\nIf you like people with dark pasts, intense aircraft battles, nice orchestral music, and romance twist, then give this one a shot. My only complaint would be to tone down the cheesiness of the romance and the predictability of what happens to certain characters. Also, you should read episode titles after you finish each episode so you don't get spoiled when watching. If you can get past those things, you should try this one.",
            "date": "2014-04-24T17:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 141179,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/130615.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/billybob300c",
                "username": "billybob300c"
            },
            "url": "https://myanimelist.net/reviews.php?id=141179"
        },
        {
            "content": "This is a review of the series. Or it's supposed to be one, but I almost never write reviews, and I see no reason to bore people with things many others have written, so I'll offer some other perspectives (just don't read if you're under 20). Simply said, it's a story about war, love and adventure. Undoubtedly it is very ambitious, with moods going from girly giddy to PTSD then back to boyhood wonder in a brisk pace, but 13 episodes are just that, only 13 episodes. You don't feel like you've tasted enough of the world and its people.  And I could seeall the cliches coming from 9 episodes away, so don't expect originality either.  The technical aspects are passable.\\n\\n\r\nHowever, don't rule out this series, because watching this anime can be good. I will be frank: anime has mostly become an exclusive wasteland for fetishists thanks to popular demand. Sometimes, it is even soul-destroying and only aggravating the emptiness felt by certain people who are deeply disillusioned with life. Maybe it has always been so, but I digress. Some writer once said a story will come to mean different things to different people. So does this series to me. By that I don't mean it's an awesome tearjerker (already done that to death), or a magical cure for depression (that's stupid). But it has actually made me think, and at some point I found my attention drifting away.\\n\\n\r\nFor a long time I have been alienated by fiction (that at least attempts to be emotional), anime or not. I am too old for high school idols or pretty-headed haremettes.  I see no point in trying out yet another gratuitously dystopian fantasy just to see which fictional character could outbastard other fictional bastards.  I am too aware to enjoy the kind of romances dominated by female interests, which believe in debasing men even if the vapid and vacillating women almost never deserve it, especially the subgenre of infidelity / divorce / \"empowerment\" fantasy that is mostly about feeding the infamous Rationalization Hamster. When I read about how 70% (or 90% in certain places) of US soldiers from Iraq face divorce (robbery), or how 1/4 of Britons commit infidelity, or how a female Facebook executive publicly encourages other females to sleep around with \"bad boys\" then snatch an obedient guy for marriage, I suppose I no longer have the energy to be fazed or sarcastic. It's like a broken record. But this anime struck a chord with me.\\n\\n\r\nI, and probably many other people, have more in common with the prince than I'd care to admit. Just that, we don't have a loving family to heal us, or a destination so noble like the End of the sky to inspire us, or a grand conflict to humble our self-centered indignation, or the chance to forge an unquestioning bond of love in the face of death, free of doubt and pride, with a person that deserves it. We don't have a wise mother to tell us that embracing our hatred against her killer, which is the world itself, would eventually destroy us, no matter how justified we might seem. Such simple, theatrical words that I used to dismiss. Now ... \\n\\n\r\nIt was something to ruminate on, and nice when it lasted.",
            "date": "2014-08-18T13:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 157045,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/marewmarew",
                "username": "marewmarew"
            },
            "url": "https://myanimelist.net/reviews.php?id=157045"
        },
        {
            "content": "(Spoiler free!)\r\nToaru Hikuushi e no Koiuta is set in a pre WW2 era where in essence, a bunch of explorers go on an expedition called the Isla project. flying to find the \"End of the Sky\" much like an expedition to find the edge of the world. From there, romance blooms among the pilots of the Isla project's trainee school through the hardships of battle and loss of friends along the journey. The story follows the main protagonist, Kal-El Albus, a former crown prince of an overthrown empire, and his journey through hatred and revenge, to eventually, forgiveness and romance. \r\nSounds like quite a lotto take in right? Yeah, that's kinda what I felt watching this anime. But despite being disoriented for quite a while, it slowly became quite an enjoyable ride for me after a few episodes\\n\\n\r\nStory: 7\\n\\n\r\nThe story line of the anime is simple and complex at the same time. As it is a romance anime after all, it involves people falling in love (duh). But the context of this romance anime can be confusing at times. Looking beyond that, Toaru Hikuushi e no Koiuta has a pretty engaging story overall, with much detail in the lives of the various characters portrayed. And the feels are also quite strong! Honestly, if I were a girl, I'd probably have cried quite a few times.\\n\\n\r\nThe only reason why it didn't get a higher score was because of its incredibly slow start. It took 2-3 episodes before we were fully filled in on what's really going on\\n\\n\r\nArt: 6\\n\\n\r\nToaru Hikuushi e no Koiuta is a romance anime after all, but due to the nature of the story, some degree of artwork is needed to portray action scenes fully, especially duing dogfights. It was... sufficient. Apart from that, characters were nicely drawn, but at times, slightly plain. Sufficient\\n\\n\r\nSound: 5\\n\\n\r\nProbably my only qualm of the anime. Openings and endings were fine, but music especially during intense moments was repreated. That same dissonant piano music seemed slightly too underwhelming for the scenes unfolding like dogfights in the sky.\\n\\n\r\nCharacter: 7\\n\\n\r\nThis anime doesn't spare on character development, and it's interesting to see most of the cast growing as the anime progresses. Toaru Hikuushi e no Koiuta also does a great job making the audience feel the struggle and greif that characters are put through. Creators also did a great job delving into the back story of most of the main characters.\\n\\n\r\nPerhaps exploring other supporting characters would've been even more awesome, but... seems too much to as for haha\\n\\n\r\nEnjoyment: 7\\n\\n\r\nOverall, it was a pretty touching series, pulling me back for yet another episode. The only qualm I have overall, would be the ending of the anime. It ran a little short, but still, sufficient to tell the story. \\n\\n\\n\r\nFinally:\\n\r\nToaru Hikuushi e no Koiuta was good. If you are new to the romance genre coming from shounen anime, it has a nice balance between action and drama. Although it didn't jerk any tears from me, it does have a touching and engaging story. My only advice to those wanting to watch Toaru Hikuushi e no Koiuta, is to get through the first few episodes, and let the rest of the story take you away",
            "date": "2014-12-24T07:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 174013,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BlastHell",
                "username": "BlastHell"
            },
            "url": "https://myanimelist.net/reviews.php?id=174013"
        },
        {
            "content": "Okay, if you are looking at my \"enjoyment\" score (10) and wondering why I gave the show a 5, you'll understand soon. This is a show that sells itself as a romantic story about a pilot and a girl in the midst of a gruesome war.  About the compassionate love between a soldier and a lady. I was expecting tragedy that tugs at my heartstrings and the realities of war's effect on people. This would have been great if the show was written with heart, but, sadly, it wasn't...\r\nI would not have enjoyed watching this show at all if it wasn't for my friendthat watched with me.  Because of the incredibly simple plot and terrible pacing, we were able to spend most of our time making fun of the terrible characters, making predictions on the \"plot twists\", and making really funny nicknames for each character.  I swear, we may have figured out a way to make any anime fun to watch no matter how terrible the show really is!!!\\n\\n\r\nWe would dub over scenes in real time as a way of explaining how unrealistic and predictable they were.  For example, while the characters were flying next to each other, they would actually just talk without any radio or normal communications device.  I mean, how can anyone hear one another with two gigantic gas engine propellers on either side of the plane running full throttle?? We would dub over, \"what did you say?!\" and \"I can't hear you with these gigantic engines running!! Try sign language!\" \\n\\n\r\nWe named this one really fat dude Porkins, and the super hot girl that somehow liked him (seriously weird romances) Gold Digger because the only way that relationship could make sense in our minds was if Porkins was filthy rich. We also predicted that Porkins was going to die in the most stupid way, too (like in Star Wars).  Turns out we were right!! the dude literally flew into enemy fire with a broken plane for no reason only after he ejected Gold Digger from his plane......WHY DIDN'T HE JUST EJECT BOTH OF THEM!!! AND WHY DID HE THINK THAT GOLD DIGGER WAS GOING TO BE JUST FINE??? seriously stupid writing, but we were laughing so hard that we had to pause the video for at least 5 minutes.\\n\\n\r\nNow, lets talk about pacing!  The director and writers of this show have no clue how to end an episode!!  For example, Porkins' death although hilarious was supposed to be a huge emotional war hero scene....you'd think the episode would end with his death to instill the emotions of the episode, but no!! NO!! why would they do that when they can cut to the rest of the pilots standing on the runway wondering where Porkins and Gold Digger are....and then end it with the rest of the planes landing without Porkins' plane....My friend and I made a game out of this after the 3rd episode since the first three episodes had terrible endings.  We would pick out which scene would be the end only to find out the show was going to make use of the last minute to show you something completely irrelevant to ruin the possible cliff hanger....of course this also gave us a lot of laughs, as well. \\n\\n\r\nIn the end, we ended up enjoying the show by turning it into a comedy when it was trying really really hard to be a serious war story.  If you find a show similar to this, take as many steps as possible to make fun of it so that you can actually enjoy it. Seriously, Porkins was hilarious!!",
            "date": "2015-03-30T08:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 184089,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2401229.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/zacho3to",
                "username": "zacho3to"
            },
            "url": "https://myanimelist.net/reviews.php?id=184089"
        }
    ]
]