[
    [
        {
            "content": "This is the second season of Saekano and like it should it starts of after the ending of the first one.\r\n  I liked the first season but to me it didn't seem to be anything special or worth remembering, i mean you had the best girl fight like you have in any harem show nowadays, but this second season just raised the bar so high that it kept me waiting and hoping that thursday would finally come so i could watch this show.\r\n  Story - 9\r\n-This story is very straightforward, you have the MC, Tomoya and his circle trying to makethis game happen. Althought they sure as hell struggle a lot in the meanwhile, making the actual completition of the game a lot more rewarding in general.\\n\r\n  Art - 10\\n\r\n-The art in saekano was just plain fenomenal, from the ecchi parts to the emocional parts, it was totally outstanding for the harem type of show.\\n\r\n  Sound - 8\\n\r\n-The sound was good throught the series, i've seen better and i've seen worse. Nothing to complain here althought near the end there were some really good songs in the emocional moments.\\n\r\n  Caracters - 9\\n\r\n-The main caracter oh well it's your harem protagonist, has all the girls but since he is an otaku doesn't really want any of them. That can sometimes get a bit anoying, but  he is the key caracter in the story after all. The girls on the other hand, might have \"cliched\" personalities like the childhood friend tsundere and so on but the anime actually jokes with that a lot and that makes it really entertaning. All of the girls have interesting aspects about them and make the story was more interesting overall. And yes this is the type of show where everyone fights about the best girl.\\n\r\n  Enjoyment and overall - 9\\n\r\n-This show for sure raised the bar and for sure is a must watch for those who enjoyed the first season, but speaking personally, mostly near the end, this series became something that i felt growing, the caracters, their struggles and everything arround them changed in this 23 episodes. I loved the ending and overall loved the series as a whole. This is not your average harem show with no plot at all, Saekano has a story and is really nicely executed.\\n\r\nThanks for reading this far, and if you just skipped to see the end, tldr it was an awesome show and you should give it a try for sure.",
            "date": "2017-06-22T10:48:00+00:00",
            "helpful_count": 118,
            "mal_id": 250665,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6102031.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ItsFilipe",
                "username": "ItsFilipe"
            },
            "url": "https://myanimelist.net/reviews.php?id=250665"
        },
        {
            "content": "Man, I can't believe I suffered through 4 episodes just to write a review but apparently you have to...thanks MAL\r\nWell, well, well wasn't this an unfortunate mistake. If there's one thing I hate, is anime series that are pretentious and lure you in with false promises of an enriching story (granted this was pretty much NOT that). The story continues off the 1st season where...oh who cares, the plot is in the description...I'm just here to tell you it's awful. Some find this show enjoyable but I'm not here to argue taste, you have yours and I have mine.\r\nThis show is as shallow as itgets from the plot to the characters to the melodrama. Shows like this try to give the impression that they try to build on the story and develop the characters but all they do is try to give random ecchi moments and who is going to sit on the MC's rod first...sounds like a masterpiece at work here. Why do these series keep pandering to the beta-male, where it's one bland, awful, dense mary-sue with the personally of chalk character get to have 5 beautiful girls fight for his attention? If the point is to make relatable characters, what's with all the heavily unrealistic situations? When will someone like the MC ever succeed in real life by being the way he is? I guess you have to pander to those with these traits and if being pathetic sells, I guess you have to cater towards your target market but I digress...\\n\\n\r\nThe female characters don't do much to the series...it's like the only time they feature is when they bicker amongst each other for the MCs approval. Their personalities fall into the common trope of: \\n\\n\r\nEriri - flat-chested tsundere with blonde pigtails and MC's childhood friend...I could reach into a bucket and pull out 10 of these\\n\\n\r\nUtaha - miss perfect, blessed with intelligence and beauty trying to give off an imposing figure of a lion with her cold attitude but is reduced to a kitten when the MC drops a compliment\\n\\n\r\nMichiru - basically there for incest fanservice, always very physical with the MC much to the despair of the others, often very flirty as well\\n\\n\r\nMegumi - the plain, soft spoken type, always tries to help others rather emotionless girl that opens up slowly with the help of her friends, some might say the perfect girlfriend \\n\\n\r\nAnd last but not least...the MC: Tomoya Aki...there has to be a reason why girls are attracted to him...is it his pasty skin? His bland appearance? His barely existent personality? His density or the fact that he's a hardcore geek that spends his money on games and anime? All these things make up the boy girls want...that's what they tell us so it must be true, right? \\n\\n\r\nEverything that takes place, each thing these girls achieve is just to please the MC in the end and try to earn his affection. They serve no other purpose other than being the MC's romantic interest, ending up in questionable situations and random ecchi moments to appease the fans and sell BDs. A true shame since many good characters in series like this just end up as sex objects and shipping fuel. \\n\\n\r\nThis show is a special kind of bad. I've known this since the first season but I stuck around like fly on shit seeing if it gets better but in the end you realize, like the fly, you're literally wasting time and being entertained by a turd.\\n\\n",
            "date": "2017-05-13T14:34:00+00:00",
            "helpful_count": 102,
            "mal_id": 247610,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6157577.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/harshtruth",
                "username": "harshtruth"
            },
            "url": "https://myanimelist.net/reviews.php?id=247610"
        },
        {
            "content": "After stumbling across this series and binge-watching the entirety of Season 1, with regard to this season, I think I was able to get more enjoyment overall from the show. I felt like this season there was more focus on the character dynamics between Tomoya, Megumi, Utaha and Eriri. As a result I felt like they were able to get much more character development than I felt they did in Season 1.\r\nI feel like Saenai Heroine no Sodatekata is one of the better anime in the Harem genre and it doesn't really have many of the failings one might find when watching anime with Haremwithin it. The only perceived negative I can give the show is maybe the way it handles the fan service and even then it doesn't bother me personally.\\n\r\nIf you watched season 1 of this anime and you are considering giving season 2 a go, I can recommend you do it. You will enjoy just as much, if not more than Season 1!\\n\\n\r\nI hope we can get a Third Season!",
            "date": "2017-06-22T10:51:00+00:00",
            "helpful_count": 49,
            "mal_id": 250667,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5992469.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BlackCicero",
                "username": "BlackCicero"
            },
            "url": "https://myanimelist.net/reviews.php?id=250667"
        },
        {
            "content": "The road for a ‘Creative’ is a long and difficult one.  The pressure of meeting deadlines, constantly improving yourself, and ultimately making something that you want is a struggle that many artists find themselves in as they try and share with the world the vision that they have.  And so we find ourselves with the second season of Saekano, as we see the conclusion of what the doujin circle ‘Blessing Software’ has to offer.\r\nStory:  Picking off from the first season, Saekano Flat (which I will refer to as ‘Flat’ for the rest of the review) continues the story of Tomoya Aki andthe rest of Blessing Software as they complete the destined galge that the group’s members have been tirelessly working on.  \\n\\n\r\nSimilar to its first season, Flat refines and solidifies the cast’s struggles and relationships with each other alongside the characters’ progress with the development of the game.  In particular, the show focuses heavily on two of the main female leads, Utaha and Eriri, as they come to terms with their lives as creators and what it is they want, as many of the show’s conflicts and problems are centered around these two and the kind of goals they have for themselves and with Tomoya.  As such, the story feels a lot more personal for these girls, and the screentime is used as such to dedicate moments and developments that center around them, thus giving the audience a better understanding of their characterization.  \\n\\n\r\nAn issue with the story however is how much of an imbalance there is with the characterization.  Personally, I feel like Eriri’s portion of the story is far stronger while Utaha’s feels muted in comparison.  Utaha’s struggles just don’t seem as impactful when compared to how the series builds up Eriri and the kinds of things she deals with later on in the series.  I chalk that up more on the series using Eriri as the series’ climax, but it still does feel unfair when looking at the two at face value.  \\n\\n\r\nAnother is how the rest of the main cast, Tomoya and Kato, have their problems mostly have their problems shoved to the side.  Tomoya kind of averts this problem by being a core aspect that influences the rest of the cast, and as such, gains growth and the ability to grow from that, but Kato mostly gets shoved to the side and only really gets to shine in 1-2 episodes as the main focus.  The way they present her is nice, but I honestly wished that they did more with her than just do what they did with her.\\n\\n\r\nWith all of these factors in play, the show ultimately culminates into an ending that I would largely describe as ‘fitting’ given the kinds of factors put in play.  It’s not the most dramatic ending, especially compared to some of the more high-tension scenes from previous episodes.  But it is what I feel like is a very fitting ending for the series and ends on a high note all things considering, as the show still retains its comedic charm despite all of the drama that had happened before.\\n\\n\r\nOverall, Flat was a solid second season that had many good and bittersweet aspects to it that culminated into a well-rounded show.  Indeed the imbalance of dedication and time spent on the characters made some seem more important than others, but its usage of the artist struggle and personal desire to excel contrasting the struggle of personal vs. professional life made up for a good portion of the mistakes that the show ended up making on its journey to the end.  (You know, despite it only having eleven episodes.  Eleven episodes for a cour is weird.)\\n\\n\r\nOverview:\\n\r\n+ Finished story (because many anime don’t actually do this.)\\n\r\n+ Drastic characterization (with consequences and bittersweet moments)\\n\r\n-  Imbalance with how drastic characterization is between characters\\n\\n\r\nCharacters: The cast itself doesn’t change much between seasons, so instead of a general rundown, I’m going to be talking more about the specifics on some of the cast shifts.  \\n\\n\r\nMost prominently for the series are Utaha and Eriri.  As mentioned before, these two are Flat’s centerpiece when compared to the one arc they each got in season one.  Compared to season one focusing more on them licking at old wounds, Flat shows the girls and their attempts at looking towards the future as the show asks the question: What happens once the game’s finished?  I praised the show before for given a realistic spin on the idealistic ‘harem’ scenario, as each of the girls have their own separate lives and personalities apart from their involvement with the game and Tomoya, and Flat gives further evidence for that fact as the story progresses.  You see these girls blossom by themselves as individual character, and it’s a really nice change of pace that in my opinion separates this show from other harem/drama shows, and as such, gives itself a positive identity.  \\n\\n\r\nThen there’s Tomoya.  If I really had to pin down what Tomoya does, it would be riding off of the ‘character development train’ that both Eriri and Utaha forge ahead on.  Most of Tomoya’s characterization and struggle comes off from those two girls as he sees the result of his actions and comes to terms with what has to be done with all of them.  While yes he has a few unsightly moments, it results in a lot of genuine growth that is again, something that’s a nice change of pace.  It sucks that it comes from a source that’s not him, but it doesn’t really hurt the series that much when you put it in context.\\n\\n\r\n Kato however doesn’t do all that much.  As mentioned before, she only has like…one, may one and a half episodes dedicated to her.  She mostly plays a background role to all of this rather than the ‘main heroine’ as the series (namely Tomoya) made her out to be.  The one episode she does get in the middle fixes several of the problems that we encounter, but doesn’t really justify her lack of involvement if you ask me.\\n\\n\r\nComparatively, the rest of the cast is hardly there.  Because the show is so heavily focused on our main 4 characters, everyone else is basically shoved to the side and if anything, act as a slight instigator to some sections of the plot.  It’s a shame too, because characters like the Hashima siblings and Michiru had potential; they just weren’t used much at all.  (They do point this out in the show, however it doesn’t rectify the problem.)\\n\\n\r\nOverview:\\n\r\n+ Heavy main characterization\\n\r\n-  Kato does very little (And that’s a bad thing if you ask me.)\\n\r\n-  The supporting cast basically does nothing.\\n\\n\r\nArt:  Produced by A-1, the art for Saekano is the same light and gentle artstyle that it had back in season one.  The red highlights on the eyebrows for the girls still bother me, but there really isn’t much different or bad in the way of the art department.  \\n\\n\r\nThere are also quite a number of camera shots that’re intentionally framed for fanservice (mostly involving Utaha actually) however.  I’d argue that it’s tasteful fanservice, since the circumstances that they come about could actually happen in real life to some degree.  They’re not really that common, and if noticed, don’t really impact the story or anything of that sort to any major degree.\\n\\n\r\nOverview:\\n\r\n+ Pretty much the same art as Season 1\\n\r\n+/- Fanservice shots (Some people still don’t like fanservice no matter what it is.)\\n\\n\r\nSound: The new OP and ED for Flat, “Stella Breeze” and “Sakura-iro Diary” both share a similar style as being bright and gentle pieces with a slight bit of energy and a hint of somberness to them.  Both of them are actually quite nice, and personally, I think that they’re a good reflection for the series that they’re a part of.  \\n\\n\r\nMy only complaint is how similar the two of them sound.  They both share such a similar tone in sound that I’d argue that you could switch the two around and you could achieve a similar effect in the series.  Overall though, really nice tracks, though I’d also argue that they’re not quite that memorable?  Yeah, I’ll go with that.\\n\\n\r\nOverview:\\n\r\n+ Good tracks that reflect the series\\n\r\n-\tSound very samey\\n\\n\r\nPersonal Enjoyment: With the plethora of harem/romance shows that I have haphazardly slapped onto my list, it becomes an increasingly difficult trial for me to find many harem shows that I would not only actually enjoy, but also find interesting due to how samey many of them feel while watching.  Saekano not only gives me that interesting harem story that I was looking for, but also speaks to me as a creator and gives me a way to relate to these characters.  So for that reason, Saekano is one of my all-time favorites in the category.  \\n\\n\r\nDid I like this series?\\n\\n\r\nI did.  I really did.  Despite it having a very, very bittersweet climax and resolution, I really enjoyed the characters and the story.  Not only that, but I like how Saekano itself acts as a bit of a parody of the harem genre because all of the characters know and avoid the general conventions of the genre while also proving itself to be more than just a show with several girls chasing after him.  The character interactions are also really, really fun to watch.  \\n\\n\r\nWhat didn’t I like about this series?\\n\\n\r\nPersonally, I just don’t like the climax.  Not for how it was presented or how it was written, but for how it hits me personally.  It’s very hard to make decisions like that, and as a fan of the series; it’s an understandably bittersweet moment to witness because if I may be honest, I like the entire main cast; maybe Kato more than anyone, but I still like everyone.\\n\\n\r\nWould I recommend this series?\\n\\n\r\nIf you watched Season one, watch Flat.  I promise you won’t regret it.  (Or maybe you will because you, like me, have personal attachment to these characters.  I don’t know.)  If you haven’t, I would suggest this show highly.  It’s has a lot of merit to it, and tells a complete story about the problems with personal life vs. professional life combined with the struggles with being a creator, a topic that not that many anime actually cover despite itself being an art medium.\\n",
            "date": "2017-06-22T12:41:00+00:00",
            "helpful_count": 28,
            "mal_id": 250678,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=250678"
        },
        {
            "content": "first, i will talk about the art. the art is amazing. how the animator draws the eye, the curve of the body, and the animation is remarkable. The characters's eye reminds me about Grisaia's art. Though the studio is different. Nice art, A-1 Pictures.\r\nabout music is still far compared to season 1, which gives the Icy Tail a chance for them to perform. But in season 2 they do not appear even once.\r\nAbout the character, the main character is too weak and can make the audience feel the anger is quite extraordinary. especially when he refused to come to pick up eriri when she wassick. but it turns out he came and decided to come. even if it sacrifices the games they have striven for.\\n\r\nabout other characters they are quite good and can offset the 'standard' character of an anime. there are some characters such as silent / moody (kasumi), tsundere stubborn (eriri), plain and kind (megumi), and jolly also aggressive (michiru).\\n\\n\r\nAbout the story, it's pretty good. about how Japanese creators are faced with a difficult choice, reaching any way to get to the top, overcoming how to deal with setbacks, and how to make decisions to develop.\\n\\n\r\nThen about how the main character creates a heroine of dreams, from the way they speak, behave, answer questions, respond to others, that's pretty impressive. to pick out clothes on heroine to become a real heroine.\\n\r\nBut still, season 1 is more fun. I feel this 2nd season is too explain a lot of less important things even can run from the main storyline. let alone the flow that makes the kasumi and eriri out of the group. although it was good enough for them, but I was a bit disappointed. but I can not reason much about it. because such a thing is needed for their creators to flourish.\\n\\n\r\nThe funny thing is that when both of them missed the train and the kasumi said that if he belonged to the main character and his life was in the grip of the main character, I was a little happy because it might just make them fail to join Akane and stay with the blessing software. but that would not be possible. is indeed a dilemma.\\n\\n\r\nthanks for reading my first review of MAL. enjoy!",
            "date": "2018-02-24T20:09:00+00:00",
            "helpful_count": 15,
            "mal_id": 272391,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6905523.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Heika-",
                "username": "Heika-"
            },
            "url": "https://myanimelist.net/reviews.php?id=272391"
        },
        {
            "content": "To keep it simple, I like this show. It's not one of those typical harem show that would've suffice the needs of all horny men as a fap material, and of those that like to be teased by an animated sexy and cute 2D girl where real sex never really happen in this show, despite how turned on the MC should've been in those situation. In this case, Saenai Heroine no sodatekata is one of those rare show where the MC lacks the libido, or aka, sexual lust for 3D women; even if they're a cute blonde loli tsundere whose reputation and status as acute or one of the beautiful girls in school are apparent and is accredited in a beauty contest (she's also half western and is rich as fuck) . Or, his own fucking sexy cousin, who would wear little clothing at home, even in the same room as the MC with no shame and tact. Or, a girl who's acclaimed to be one of the popular writer and perfect in aspects any male would want: beautiful, intelligent, graceful, cold, and composed. Or a girl with a dull personality, demeanor and manner of speech, but is apparently a main heroine to his ideal 2D girl's character.\\n\\n\r\nThe situation as a whole seem far fetched from reality, and it really is, considering that all of these successful (well two of them) girls flock over the MC like he's the only man there is for them to be with. In a situation like this we would be expecting a story or themes, just like in any harem anime, revolving around romance, jealousy, forbidden love, guilt and so on. But this anime doesn't only explores only that, it explored a sort of rivalry experience as the story do go on a route of creating a game, with the dull girl, Kato, as an ideal heroine, and to become one of the best game out there. The story is somewhat similar to bakuman and shirobako. Both anime explored the inner working of a team working on an anime, in this case, this anime explores the inner working and the experience of a team working on a visual novel, with an acclaimed light novel author as the lead of the script writing team (as she's the only one lol), and one of the ingenious blonde loli with great adroitness to drawing ability (and again, the only one working on it). The team is basically his harem, where their specialty are delegated to the right place on the team for creating a game. \\n\\n\r\nAdditionally, the dialogue may not be as great or rivaled the monogatari series. The dialogue is actually written in a very humorous and witty manner with its metaphors, subtle complains or insults, breaking the 4th wall and such. So this does make the entirety of the show not as boring as it seem. Although, in some part of the show I gotta admit, I almost fall asleep or have the inclination to skim over it.\\n\\n\r\nAnother quality of this anime that makes this show so great or fun to watch is basically, the character are cute, unique and likable. But ofc, this naturally boils down to your personal interests for a character, for a certain set of personality and appearances, though, some character may seem to be the cliche type, while some, like Katou, would be one of the unique ones in the show. \\n\\n\r\nAs such, give this anime a go even if you're not a harem fan. As i'm not a huge harem fan myself, it just seem like it's fine for me for an anime to be a harem show, when the MC is an otaku that have no sexual desire for an actual female in the real world, or is actually a pervert much like any other harem MC there is. And just to be warned, the fanservice is kinda heavy on this one, though they are very self aware on this one lmao. If you watch the episode 0 of season 1 or 2, you will see the 4th wall crumbling down as the character voiced their honest complain or statement about this anime. Oh and much like Oreimu, the anime also explored shit like people hating on Otaku culture and other such serious subjects that may come up in the story.",
            "date": "2017-05-15T01:51:00+00:00",
            "helpful_count": 18,
            "mal_id": 247721,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=247721"
        },
        {
            "content": "This review exists purely for the purpose of aiding those who watched episode 9 and are wondering why you feel the need to throw up at the nearest toilet seat. So if you arrived here after watching the particular episode, or is the unfortunate soul that decided to start watching this show, you have come to the right place. Now you may be wondering what exactly happened in episode 9 to force me to create a myanimelist account and write a review for the first time in my life, but I will get to that in a moment. Before we get to my most hatedmoment in anime history, I will expand upon the rest of the show first.\\n\\n\r\nEpisode 1~ 8\\n\\n\r\nStory : 6 Art : 8 Sound : 6 Character : 7 Enjoyment: 8 Overall : 7\\n\\n\r\nNow the story is nothing to write home about. It involves our good old protagonist Aki Tomoya who decides to actually finish his ambitious game with talents that go way over his head. He messes up a lot as usual and fixes the broken parts with the classic harem protagonist appeal. \\n\\n\r\nSo in order to justify my enjoyment, the art and characters have to carry the rest. Art is standard most of the time, but there are unique flare moments mixed in, which enhances the show immensely. The fact that it isn't completely covered with this style is far better in the theme of this show of ordinary (= boring) developments that lead to moments of beauty (= heroine).\\n\\n\r\nThe characters themselves are not out of the ball park either, but they make sense and are funny at times, which I believe to be the most important feature of any show driven by the characters and their interaction. Any action a character takes must make sense in the context of the character, which is established beforehand by the various interactions that the character makes with other characters. For instance, if character A has consistently avoided character B, we establish that A probably dislikes B. Now, any action A takes that involves interacting with B must have a solid reason. It could be a misunderstanding (A only avoided B because B had a cat with him always and A is deathly afraid of cats), a specific B-achievable goal (A needs B's help to do something), or even a deux ex machina (A gets hit by a car and loses all memory. Note that this kind of plot device is often referred to as garbage, complete bullshit, etc. But it's still better than nothing, because the writer is acknowledging that it wouldn't make any sense for A and B to interact for no reason).\\n\\n\r\nI have no comment to make about the sound design other than that it complements the show, but does nothing memorable.\\n\\n\r\nSo, ultimately, the rating resolves to overall 7, the closest it gets to my enjoyment rating while still considering other elements of the show.\\n\\n\r\nNow, you may be wondering, what went wrong for my previous rating of 7 to turn into 2 over the course of one episode. That's where you would be wrong. This swift downturn happened in the course of approximately 30 seconds.\\n\\n\r\nEpisode 9\\n\\n\r\nStory : 1 Art : 8 Sound : 6 Character : 2 Enjoyment : 2 Overall : 2\\n\\n\r\nNow, for those of you who are worried about possible spoilers, don't worry about it, I won't spoil anything so you can finally understand the feeling of your stomach turning inside out.\\n\\n\r\nTo summarize it briefly, imagine having your entire show built around a single thing, and then smash it on the ground and make the viewers watch the remains of what was the basis of the show just get flushed down the drain by the rain. The execution of this episode was exactly like that. You could have the exact same scenario happen without the characters adding the unnecessary drama. The entire \"turn\" happened only to create drama, which is the antithesis of the whole show.\\n\\n\r\nSo yes, that is why you are disgusted with this show all of a sudden.\\n\\n\r\nShould you watch this show? No. Should you feel bad about watching ep. 9? Yes.\\n\\n\r\nDo yourself a favor and just drop this show right now like me.",
            "date": "2017-06-09T04:50:00+00:00",
            "helpful_count": 13,
            "mal_id": 249561,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/iilxaeju",
                "username": "iilxaeju"
            },
            "url": "https://myanimelist.net/reviews.php?id=249561"
        },
        {
            "content": "maybe that makes this anime interesting is the story line, yes of course where the scene of eriri & utaha want to leave the group of game maker where the scene is in show that actually eriri & utaha not want to leave the group game maker where the scene that makes me touched why so long group walking must release two members that are so valuable. I think in addition to the side of the story I also want to review about the art project, which I think this part is difficult to do from this anime I judge from the making of theimage character 10/10 that makes this anime becomes more well again because this anime is made by studio that i like most. i will always wait whether saekano got seasson 3? and did the eriri and utaha accommodate the group making the Game?",
            "date": "2018-03-25T00:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 274952,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6966818.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shirokuza",
                "username": "Shirokuza"
            },
            "url": "https://myanimelist.net/reviews.php?id=274952"
        },
        {
            "content": "Saenai Heroine no Sodatekata was good... Saenai Heroine no Sodatekata ♭ was better.\r\nSaenai Heroine no Sodatekata's first season was something of a introduction to the dojin team of blessing software of Eriri, Utaha, Tomoya, Michiru and Megumi and finished once the entire team being recruited with half of their first game being done and it was a decent look at the visual novel industry by the eyes of fans turned creator-like anime. Saenai Heroine no Sodatekata ♭ progress further from this by going through the character arcs that was sorely needed from the first season.\r\nLet's start with Utaha Kasumigaoka where her arc has parallels toblessing software's game plotline to the situation of Utaha thinking of leaving blessing software due to her job being done thus she placed onto Tomoya's hands as a producer annnnnnnnd...her arc was saved by Megumi but nonetheless Utaha still had involvement after her arc ended was great as LA was already LA's best girl for this anime (something about her flirting and teasing and just her silver tongue just had something appealing for a character...like Hitagi Senjougahara without her killing yandere intent). Eriri's arc was more focused on her \"artist block\" and it helped her as a character as well as Tomoya as a producer for blessing software in trying to help Eriri get out of her funk. As much as Eriri's arc in the first season made her out to be a jealous tsundere spoiled childhood friend archetype this arc definitely helped albeit LA is slightly biased towards Eriri as a character due to LA's affiliation and liking to Utaha more, nonetheless Eriri's dilemma about her unable to make illustrations and the creative block she had was a good arc for her. Megumi's arc was short in a ways but nonetheless she had more intimate moments with Tomoya throughout this season but also Megumi showed one glaring problem with Tomoya to herself and that was Tomoya didn't ask for her help even though she clearly asked him several times leading to \"what is the point of thrusting Megumi into the world of otaku and visual novels, if your not gonna use her\" and thankfully was something Tomoya repaid and gave Megumi more development outside from her archetype...of having no archetype and being original and new. \\n\\n\r\nThe final arc introduced us to Akane Kosaka voiced by Hitomi Nabatame wanting to scout out Eriri and Utaha after blessing software finished their game and this leads to a crossroads for Tomoya and blessing software's future (as well as now not having anyone to lean on for help), though this final arc is centred around Tomoya losing two of his main developers but it also granted Tomoya to step up and be the producer even after they leave though trying to get back Megumi and LA actually doesn't blame Eriri and Utaha leaving to find bigger fish and their careers were on the line to go and do better things and LA doubt they would be spiteful to Tomoya considering all the effort he did to be a better producer in the long run to do so (and also their part of Tomoya's harem). However as LA says this, the final episode does kind of spit in LA's face at the aforementioned statement about Eriri and Utaha leaving but through a different cause and Utaha's spontaneity might have saved this finale but still the sentiments in LA statement rather stupid as a result and makes the finale look like a typical light novel ending.\\n\\n\r\nIn terms of animation done once again A1-Pictures, the animation was great from the character designs to backgrounding and even the coloration of the scene to make it look more striking is back from the first season as well as the self-aware camera during the fanservice moments...especially Utaha's *ahem* nonetheless, the animation was superb from A1-Pictures even with them cutting corners at times.\\n\\n\r\nGoing off on a little tangent as LA KNOWS someone might brings this up, but what's the difference between you favouring Saenai Heroine no Sodatekata over Shoujo-tachi wa Kouya wo Mezasu?, well that is actually quite easy, aside from both being the same scthick of characters with certain professions wanting to create a visual novel in high school, Saenai Heroine no Sodatekata had the edge with not only with his meta-humour and even using it's meta-humour to talk about visual novel and it's processes, it's characters also meant something to do or even outside of melodrama and their problems in creating something such as a visual novel. Shoujo-tachi wa Kouya wo Mezasu on the other hand used it's characters haphazardly to the point certain characters were used more as gimmick and their melodrama were more focused on a romantic-edge than a creative one. Saenai Heroine no Sodatekata also wins easily because of it's likable characters and atmosphere, Shoujo-tachi wa Kouya wo Mezasu only brought out it's melodrama for the sake of it.\\n\\n\r\nSaenai Heroine no Sodatekata ♭ is a definite watch for those Saenai Heroine no Sodatekata fans and probably even more to the harem member of your choice (sans Michiru..she's the shameless incest fanservice girl in this season with hardly a focus on her as her arc finished in the first season) with drama that means something in the long run both from a character perspective as well as the creative and character relations developing even further from it's predecessors. Saenai Heroine no Sodatekata ♭ may have it's problems (especially when it comes to which harem member you like the most and how that affects your alternate character implications to this second season) but this is a conflicted strong end to an anime series that liked to jab at character archetypes WITH a certain characters with no archetype.\\n\\n\r\nUtaha Kasumigaoka is still best girl of this anime AND for LA's Waifu of Spring 2017 because of this season though...",
            "date": "2017-06-24T04:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 250838,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=250838"
        },
        {
            "content": "Whaaaat? Are you telling me that Saekano has now an actual plot and that it's not just your average ecchi harem comedy anymore?\r\nYeah, you've read it right, the secon season of Saekano was a good surprise, the first episodes continued where the first season left and as it continued the characters have shown some development, especially the girls. Even Katou abandoned her flat self for some time, and this is huge. \r\nThis season is way better than the first one. Yeah, there are still those ecchi shoots and there's still lots of fanservice, but the story has its important role now. The last episodes reallygave a good twist to this series and I'm glad for that. \\n\r\nThe art and sound are still ok, as in the first season.\\n\r\nThe end was baffling though, but I'll be really looking forward to watching a third season. \\n\\n\r\nOne last thing: Katou best girl.",
            "date": "2017-06-22T11:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 250670,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5721761.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AhmedFisherman",
                "username": "AhmedFisherman"
            },
            "url": "https://myanimelist.net/reviews.php?id=250670"
        },
        {
            "content": "The best harem anime i have watch. At first, you will thought it is only mainstream harem anime, with bad romance and a lot of service. But trust me, it only for introduction. The main story appear in season 2. \r\nThe story is very well build, with a plot twist in climax part. But it is very important for characterization. Don't doubt about art and music, because it produced by A-! Pictures\r\nSo, if you'r looking harem anime, i absolutely recommended it. Although it is not the best, it is veeerrryyyy good romance comedy drama Anime.\r\n.\r\n.\r\n.\r\n.\r\nalso, i will tell you that 3 ship that sail inthe first season, two of them will sink :)",
            "date": "2017-06-24T04:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 250839,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5781429.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/wisnunugroho21",
                "username": "wisnunugroho21"
            },
            "url": "https://myanimelist.net/reviews.php?id=250839"
        },
        {
            "content": "Harem's aren't really my genre, because I guess guilty pleasure but for some reasons I find myself enjoying this season and so I'll tell you why, his is just a personal oppinion though.\r\nPlot\r\nWhile season 1 focuses on the Harem plot where girls just goes around with out otaku Tomoya, this season is quite different, for me aside from the harem it tells us how hard it is to create something, we can see the casts suffer from slumps and rejected ideas and although we've seen this in other animes I still find it well executed.\r\nThe Romance are stll there, nothing really new but I dowanna say that the they are really showing us flags on who will win and if you don't know who she is then ......A Coquina clutch for you.\\n\\n\r\nCharacters\\n\\n\r\nnow here's the heart of the sereis the casts, I can say that they are developed but I think they still need a room for improvement. \\n\\n\r\nTomoya- yes at first he's just your typical harem MC-kun who all of a sudden has his own harem, but in this seaon you''ll both love and hate him, although what he did is normal for me considering there is no such thing as a perfect character, I like tomoya is getting matured episode although it's rushed, and I like the fact that he is quick t orealize his mistakes and will try hard and will even support his cicle no matter what.\\n\\n\r\nMegumi- the main heroine, well I think for the characters here she has the most  obvious chaacter development, at the begining she just forced to join but in the end she ends up having the most passion and commitment in finishing the game, and the way how she steals the show everytime I find it unannoyin actually.\\n\\n\r\nUtaha and Eriri- since they're both rivals i think I should combine them, I still think they need room for development although they have quite matured since before they are just only after tomoya, I'm glad that they're starting to think what's next for them and they manaaged to make decisions based on what will happen to them.\\n\\n\r\nIori- Tying with Megumi is this guy, he also has an very obvious character development and I won't say it to avid spoilers but all I can say is that I really liked him in this epiosde...also....PLEASE PAIR HIM WITH EITHER ERIRI OR MICHIRU\\n\\n\r\nMichiru and Izumi- since they got the least screentime all i can say is that If there's a season 3 they could have much more screentime, despite being just there they are likable enough.\\n\\n\r\nSound and Animation: the animation is great and I like in season 1 I still like the character designs particularly Utaha and Kato, for sound It's nice I enjoyed the ending though\\n\\n\r\nOverall saekano is the sereis that looks bland is actually matued at least for me lol though a room for improvement is still needed...I highly reccomend it",
            "date": "2017-06-23T01:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 250731,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949977.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MetalTsundere",
                "username": "MetalTsundere"
            },
            "url": "https://myanimelist.net/reviews.php?id=250731"
        },
        {
            "content": "That ending kiled me ;-;\r\nThis long-awaited (for me) second season was into so much doubt within the comunity because of the filler moments in the fisrt one. However, this demonstrated that A-1 Pictures can make good anime once in a while.\r\nAs I haven't read any of the original light novel I'll be reviewing the series as it is by itself. A generic eviroment and setting with unique characters and weird but still natural development.\r\nIn the first season I just watched it because I was going into harem stuff. But the fact that the main heroine was Megumi since ever made me think harem anime aren'tall about a guy who bangs every girl with presence.\\n\\n\r\nThe story itself wasn't all that original nor ordinary. A guy who recruits talented classmates who also are in love with him just don't happen in real life. But this is not the case with Megumi, who started as just a passerby. In the first season the team build their relationships. But in this second season we see each one developing as if every one of them was the main character. We see them joy and then suffer, also how they overcome the difficulties. And in the end, they make some big decissions that gets the anime upside down. Although, I'd really like to see a third season because a spoiler someone told me from the light novel ;-;\\n\\n\r\nThe artstyle is just as generic as Gakusen Toshi Asterisk. But A-1 managed to add their little touch to some scenes, either making a shot with only one primal color, or just making fun of other works like the Monogatari Series. I found these eyecandy's quite enjoyable, and kept me from getting my eyes bored.\\n\\n\r\nThe background music wasn't really memorable, but it makes the anime flow naturally and the tracks chosed for almost every type of moment (either dramatic or comedic) really fit there. The OP was good, but I think the animation for that, even if it seems made by freelancer animators, was beautiful. Specially when they changed an element depending on its state in the story.\\n\\n\r\nAll the characters, except from Megumi and Akane, have a extremely generic surface. At the begining it was awful to see those stereotypes being reused once again, but then we fall back with they way they grow as individuals. I really like Megumi. She was weird in the first season, because of her forced lack of presence. But after the first season, her unnoticable personality came afloat. And everytime she appeared on screen, she seemed more open to others, and of course, to Tomoya. When I saw the last scenes of the last episode I really couldn't stop laughing. Megumi is my very favorite female character of this season.\\n\\n\r\nI give the anime an overall of 9 because some moments that felt off, some bad animated frames and the tipical A-1's bad 3D. But this is a really good anime that anyone can enjoy (if they watch the whole first season)",
            "date": "2017-06-22T19:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 250715,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4871999.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/linkuan",
                "username": "linkuan"
            },
            "url": "https://myanimelist.net/reviews.php?id=250715"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nIn Saenai Heroine no Sodatekata ♭, Utaha is a writer. Or, as she may say, a creator or creative. And I view myself in the same way.\r\nI started writing officially as a critic, reviewer, and essayist about three-and-a-half years ago now. I’ve written hundreds of pieces, thousands upon thousands of words. It’s technically not my career (as much as I dream it to be), but I see it as an extension of myself and not just any other fun aside of mine (because of the seriousness with which I pursue this field). Thus, I existwithin this quasi state of not quite a professional yet more than just a hobbyist. Either way, I’m a creator all the same.\\n\\n\r\nBeing a creator brings with it certain challenges and caveats that may not be immediately noticeable to somebody who is not. Sodatekata Flat (ditching the symbol from here on out since it’s a pain to copy-paste it constantly) understands this sentiment, presenting a sequel that surprises in its newfound direction.\\n\\n\r\nSTORY\\n\\n\r\nAs a sequel to the semi-popular first season of the Sodatekata anime, Sodatekata Flat brings the audience back to greet some familiar faces. Utaha, Eriri, Megumi, and Tomoya, the majority members of their doujin-circle company titled Blessing Software, continue work on the visual novel that they have worked tirelessly to complete. However, the anime has conflict on the horizon for this hodgepodge group.\\n\\n\r\nFor starters, this season is no longer an introduction but instead a continuation. So, to focus on the seriousness and the drama, Sodatekata Flat reels in a lot of its signature meta comedy. Not that it isn’t there of course. Indeed, it’s a motif that counts as one part of the foundation to the show. Characters still spout the occasional line, and they take part in those brief scenes that invoke the same sense of self-awareness just like the good old days.\\n\\n\r\nTake some dialogue from Utaha. After she and Tomoya finish watching a movie while on their “date,” she ribs the very anime she finds herself in: “The script was completely clichéd, but they’re able to get away with it because of the good art and performances.” Another (rather on-the-nose) example comes later on. A friend of Tomoya’s, frustrated by the fact that his immense luck sandwiches him between Utaha and Eriri, annoys the leading guy, leading him to remark how he now understands what a protagonist in a typical harem anime must endure from his fellow friends.\\n\\n\r\nTo reiterate, these and other comedic asides are not tossed out the window but rather reduced to give way for the all-important drama. With the extra room, said drama improves.\\n\\n\r\nTo elaborate, the first season juggled past events and current conflicts split between five girls. Sodatekata Flat instead trims the fat. It focuses on just the current conflicts split between only three girls now. Narrowing its reach in this fashion tightens the direction and execution of the drama, thereby giving it a flourish it has always wanted within this series.\\n\\n\r\nThis flourish comes through in a lot of key moments throughout the season. Utaha and Tomoya share an intimate scene together as they collaborate on the routes and writing for their game. Extra meta conversations and clever wordplay notwithstanding (e.g., “It’s already mixed in. A part of you is already inside what’s mine.”) With Eriri, their getaway of sorts gives them the chance to connect, to praise, and to apologize as a means to bolster their relationship. And a Good Will Hunting-esque moment between Tomoya (i.e., Robin Williams) and Kato (i.e., Matt Damon) occurs as he repeatedly lets her know that their fallout wasn’t her fault in the slightest.\\n\\n\r\nOn top of the drama, Sodatekata Flat also includes a couple of narrative choices that further keep the show in good graces. Icy Tail, the band from last season, make an appearance in this season to provide extra hands during the swift prototyping of their game. The title of Tomoya’s second game ties back to this anime for the ultimate-meta detail: “How to Raise a Boring Girlfriend.” The final episode includes a full-circle finish during the recreated date with Kato when they go back to the same mall visited in the first season.\\n\\n\r\nAbove anything else in the anime, it hones in on a somewhat niche theme to strengthen its backbone. The very first episode of this second season establishes the idea almost right away. It tells a tiny tale on the origin of Utaha and Eriri’s distaste yet appreciation for the other. The episode’s angle can be summarized as “separate the art and the artist.”\\n\\n\r\nWith this proverb in mind, Sodatekata Flat carries it along throughout the entire season, placing emphasis on the relationships between Tomoya and the three girls as they collectively finish their shared project. He challenges Utaha’s work despite the clear implications behind its construction. He respects Eriri’s artistic space to a detrimental degree twice over. He fails to recognize Kato’s contributions overall. In other words, separating the art and the artist isn’t such an easy task when those involved are the very people one holds most dear.\\n\\n\r\nRemnants of this theme exist in the last season too, especially with Utaha’s characterization. But, because of that tighter focus and because of the increased importance on the drama, it takes on a much greater role and purpose throughout this season.\\n\\n\r\nSodatekata Flat does trip up on a couple of specific details. Both the competition subplot with Rouge en Rouge and the eventual “evil” producer named Akane do not themselves earn too much in the way of involvement, context, and tension. They (understandably) take a backseat to the interpersonal drama of Tomoya and his group. However, while it may not seem like much, a lot of the drama stems so heavily from that subplot and this character. So, unfortunately, said drama doesn’t reach the pinnacle of its trajectory. To clarify, the events and outcomes are nice to see, but the foundation is less solid than it intends to be.\\n\\n\r\nPotential problems aside, Sodatekata Flat has a good story here. By delivering tighter drama and a centralized theme, the show pushes past its harem-comedy roots, giving the audience something interesting and different to behold when compared to its already well-liked predecessor.\\n\\n\r\nART & ANIMATION\\n\\n\r\nSodatekata Flat carries over the same artistic direction as it used in its first season.\\n\\n\r\nFor instance, some frames will still take on colorful gradients as a means to spice up the general look of the anime as Tomoya and the others talk with and amongst each other. It also brings back many a camera angle to play around with. From a low shot looking up at Utaha as she steps on and digs her foot into Tomoya (and by extension the audience) to a faraway capture of him and Kato within a recording room, the cinematography further ups the visual appeal.\\n\\n\r\nReturning also are the different risqué shots of the girls, like Utaha sprawled out on her bed in nothing but a bath robe or a centered shot of Kato whose loose shirt exposes the top of her breasts as she lifts herself up while laying on her stomach. This season clearly favors the drama more so than the comedy, so, while these shots are no doubt titillating, they are not as appropriate with Sodatekata Flat sinking its teeth into seriousness.\\n\\n\r\nNevertheless, the anime does even more to flair itself up. Certain comedic sequences will border the screen in manga panels. Very emotional moments throw floating paper into the air as a couple of characters cry together. Classic cherry-blossom petals signal the start of a new beginning as two other characters vow to not give up despite the recent difficulties life has thrown their way.\\n\\n\r\nMoving on, background art once again does not extend too far beyond Tomoya’s room and their school, but a cottage of sorts in the woods and locales within the city change up the environment when and where they can. The static setting does invite better actual animation, though. Utaha violently tapping her heel out of frustration, Eriri harshly slapping Tomoya with her twin-tail hair, and Megumi subtly jiggling her thigh with her phone as she sits and waits are just a few small examples that demonstrate the solid movement of the characters’ actions.\\n\\n\r\nAnd as one last carry over, the designs of said characters maintain their attractiveness. Utaha’s bodacious looks, Eriri’s slender figure, Megumi’s plain yet cute appearance. All their different outfits add variety, and their striking eyes greet the audience, too.\\n\\n\r\nYes, the artistic direction does stay the same. But, thankfully, that’s clearly a very good thing.\\n\\n\r\nCHARACTERS\\n\\n\r\nIn Sodatekata’s first season, the characters of the show brought with them a lot of personality and fun that equated to a stronger anime overall. In Sodatekata Flat, their characteristics have not left. But, much like the story and its focus on the drama, they earn more in the way of development as people rather than whatever comedy they create.\\n\\n\r\nNowhere does this increased focus apply more than with Utaha and Eriri. Both girls are experts in their respective fields of writing and drawing, and both girls still vie for Tomoya’s attention whenever and wherever they can. So, the show challenges these two details.\\n\\n\r\nFor Utaha, much of her character centers on what she describe as “a dour, vindictive, and awful woman.” Knowing of her impending separation due to graduation and light-novel business, she indirectly approaches Tomoya about his true feelings of her as she submits her writing for their game. Tomoya’s non-answer at first infuriates and then saddens Utaha, for not only does it denounce her skills but also it avoids giving her what she really wants: him. But they work through this hurdle. His words about wanting everyone to be happy in the end resonate with her, and her words on their combined creation touch him. The two grow closer as a result.\\n\\n\r\nFor Eriri, she does what she can to keep tabs on Utaha’s advances with Tomoya and builds a friendship with Megumi that stands as its own outlier of sorts among all the relationships present. Most importantly, she struggles artistically. As the deadline for their game creeps ever closer, she slows down and frets over the possibilities. So much so that she collapses from mental exhaustion – in wanting to create something brilliant and in needing Tomoya’s belief in her. She earns both (despite “losing” in the contest with Izumi). The two grow closer as a result.\\n\\n\r\nThat’s individually. Together, they grow closer, too. In the beginning, the anime depicts the multifaceted nature of their relationship. They bicker and quarrel over Tomoya, but they have a deep respect for their works. Eriri awes Utaha with her immaculate paintings, and Utaha forces tears out of Eriri as she reads her pristine passages.\\n\\n\r\nYet Eriri calls Utaha’s writing “calculated,” and Utaha calls Eriri’s drawing as fueled by nothing but “revenge.” Meaning, while they may hate each other, and they may simultaneously like each other’s works, they also have a deeper connection than they may not have ever realized in the purpose behind their drive.\\n\\n\r\nOver the first half of the season, they continue on their own paths. Utaha pens some of the final writing of their game as made by “Aki Utako,” taking part of her own penname and melding it with Tomoya’s real name as a fantasy-come-true for the passionate young woman (much to Eriri’s chagrin). But she also tells Tomoya that she wishes to work with Eriri again, for, despite their differences, she cannot ignore Eriri’s incredible, moving talent. As for Eriri, she finds a brand-new style that goes beyond her normal capabilities, and she finally has a stronger bond with Tomoya that she has also never had before. But she seems to hit a slump, for she has gone weeks now without drawing or painting anything.\\n\\n\r\nIt all culminates as the personal and the passion collide.\\n\\n\r\nUtaha is tasked with the unfortunate role of declining Tomoya’s invitation for his new game idea. Her heartfelt apologies give way to a set of flashback scenes. In said scenes, when pressed about her slump, Eriri yells at Utaha. Hard. She says how whatever she draws for their circle will not be personally beneficial anymore and that she already has Tomoya’s sympathy which means she really does not need anything else.\\n\\n\r\nThen in barges Akane Kosaka. She invites both Utaha and Eriri to work on a historic project she has lined up. They read the outline – and it floors them. Akane instructs them simply: die. Die for this project. Put everything they have and then some into this game to make it the best thing anybody has ever seen. She even goes so far as to belittle Utaha and Eriri. For the former, she’s only on as a babysitter of sorts, to keep watch over Eriri since she, not Utaha, is the only one who really must be onboard. For the latter, she not only berates her for her self-inflicted woes but also recreates her new incredible style, letting Eriri know quite harshly that she still has a long way to go.\\n\\n\r\nUtaha, having already voiced her opinion to Tomoya about following Eriri, leaves the final decision up to blonde illustrator as to whether they enlist themselves after hearing the proposition and that mean woman’s harsh words. In a gripping, dramatic moment, Eriri sacrifices the personal to pursue the passion in earnest. Akane’s insults get her completely out of her slump, but, in doing so, she has betrayed Tomoya once again. That, despite his compassion for her, she cannot be with him if she wants to attain higher heights. Utaha comforts her, detailing how this time she will not be alone, that she is complicit in this betrayal. For she, too, has something to prove to Akane: that underestimating her abilities will be the biggest mistake of that woman’s life.\\n\\n\r\nThis moment in Sodatekata Flat is arguably the most wonderful in the series to date. For three reasons. One, it strengthens the relationship between these two rivals into that of friendship when they have been honorary acquaintances at best for nearly two whole seasons. Two, it pushes them away from Tomoya, their anchor, as a means to demonstrate development of their characters. And three, it not only explores what a creator must forego in the pursuit of his or her passion but also ties back to the story’s “separate the art and the artist” theme by separating their own individual art and artistry in an introspective sense.\\n\\n\r\nAnd so, on amicable terms, Utaha and Eriri figuratively break up with Tomoya – but not outright or even forever. Eriri takes Tomoya’s glasses as a memento to keep on her new journey, and Utaha turns Mr. Ethical into Mr. Unethical, sharing their first kisses with each other. The wording and the ending even hint at their soon-to-be return. After all, there’s no reason why they can’t ever come back.\\n\\n\r\nIn other words, they don’t really, fully separate from Tomoya. That seems a little unfair insofar as it defeats the purpose of their development as characters. Yet that would also not make much sense since it has been established without a shadow of a doubt how important he is to them on every level imaginable. Plus, the anime’s skill in flipping this dramatic event into a comedic one without missing a beat – Utaha’s “I will give up on giving up” is seriously hilarious – stays true to their characters while still progressing them forward with and without their beloved.\\n\\n\r\nFor all intents and purposes, Sodatekata Flat is Utaha and Eriri’s story. What about Megumi, though? Yes, her lower presence in the anime fits her characterization quite well, but she doesn’t go without focus.\\n\\n\r\nIndeed, the anime spends a lot of time highlighting how Megumi isn’t as “boring” as she may appear. She demonstrates her passion when she runs off the train to get ready to work on their game for the whole weekend. She expresses concern for Eriri as she lives for a time away from home to work. She gets mad at Tomoya for not including her in any of the troubles encountered. She cries at his sincere approach in mending their relationship afterwards. She acts all cute at his place when cooking, bathing, and sleeping, something so uncharacteristic of her that she asks him to forget what she did that day. She suppresses laughter (as best she can) towards his “stylish” new glasses (that she herself picked out for him).\\n\\n\r\nComparatively, the first season somewhat casted her as the normal girl who accentuates the oddities of the others and supports everyone from the sidelines. In this season, Megumi very much becomes her own person. She evolves away from that flat personality and into a rounder character – all while still delivering on those passive-aggressive comments. To put it differently, she may be “boring,” but she is anything but.\\n\\n\r\nAnd what of Tomoya himself? Truth be told, he’s the weakest of the main four. With the conflict involved stemming from and pertaining to each of the girls, he doesn’t have much going for him throughout the season. Even so, as already gleaned, he plays the harem-protagonist role well, helping each girl as best he can and building his relationships in different directions. Moreover, they help him. Utaha, Eriri, and Megumi either give him the room he needs to blossom into a phenomenal creator or support him when he clearly needs it most. Thus, in this story that focuses on three other main characters first and primes him for the final leg of his arc later, Tomoya receives just enough relevant attention to make his presence worthwhile.\\n\\n\r\nOne last footnote (since it makes sense to call her that): Michiru. What a complete waste of a character – is what would be fair to say if the anime failed to address her at all. Barring a quick interlude at about the halfway mark of the season, she finally appears right at the end when the audience has most likely already written her off at this point in time. True to form, Utaha and Eriri throw meta comments her way about how she has been gone for the entire second half of the season and how she only now shows up in act three of the finale. It not only makes for a smart joke but also covers the show’s bases in the nick of time.\\n\\n\r\nDisregarding Michiru (which is what the anime would most likely want anyway), Utaha, Eriri, Megumi, and Tomoya clearly experience a lot within this season. Development of their characters, growth in their relationships, key moments to pinpoint, better writing overall. All while staying true to themselves. Altogether, they are arguably the best aspect of this whole second season.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\nFor some anime, voice acting dominates with pure, notable technique. Sodatekata Flat once again finds itself in this category for each of the four main characters this season. Ai Kayano as Utaha delivers sultry and angry tones when and where needed. Saori Oonishi as Eriri cutes and embarrasses her way to victory, and her need to say “Utaha Kasumigaoka!” when addressing or referring to her rival still brings a chuckle every time. Kiyono Yasuno as Megumi refrains from inflecting any emotion into the plain girl’s voice until absolutely necessary. And Yoshitsugu Matsuoka as Tomoya hollers, yelps, and cries like the best of them.\\n\\n\r\nThe VA performances take the crown, but some of the sound-effects within the anime also deserve a shoutout. From the weird bird noises Utaha and Eriri let loose as heard by Megumi and Tomoya from afar to a the fast forwarding of a tape as the afternoon blazes by, the show’s sound-effect game is on point for the majority of its run.\\n\\n\r\nUnfortunately, after the VA performances and some of those sound-effects, the quality of the audio cannot keep up (a hard task really). That is to say, much of what the audience hears does not usually go anywhere too interesting.\\n\\n\r\nThe original soundtrack sounds the best of what remains of the bunch. It has a slow, guitar track for those semi-tense times. Bass and snapping for when a lackadaisical groove is required. And a light yet “heavy” set of acoustic strings caress the rarer serene moments that dot the anime. Nothing here stands out in a major way, but these songs from the OST support Sodatekata Flat nevertheless.\\n\\n\r\nThat just leaves the opening track and the ending track. Much less impressive, this combo of music does not have too strong of a foothold.\\n\\n\r\nThe OP, “Stella Breeze,” takes on a more whimsical vibe with its dainty instrumentation and optimistic tone which somewhat clashes with the heavier drama of the season. Moreover, the vocalist can’t quite nail those nuanced notes when necessary. It’s at least a catchy song, especially in the second half, so it’s not a total loss on the show’s part.\\n\\n\r\nBy comparison, the (main) ED, “Sakura-iro Diary,” is even less daring. It does incorporate piano into the mix and extra vocalists to spice up the lyrical delivery. But still, its straightforward beat and simplistic nature create a rather mundane offering that is certainly not as intriguing as the content that precedes it.\\n\\n\r\nThankfully, those VA performances shine bright, so the grievances with the lagging music across the board do not damper the experience as much as they normally would.\\n\\n\r\nENJOYMENT\\n\\n\r\nAs a creator, this anime spoke to me on some level.\\n\\n\r\nI do not claim to harbor the same skills as Utaha or Eriri. People the world over do not admire my talents let alone hand me job offers that nobody in their right mind would refuse. However, as a writer myself, I understand the struggle.\\n\\n\r\nI’ve seen maybe one other anime tackle the woes of an artist, but seeing it here regardless let me relate to what they went through. I have written pieces that do not reach my own personal standards. I have been through slumps (i.e., writer’s block) that prevent me from doing what I love to do. I have foregone situations personal to me in pursuit of ever grander heights.\\n\\n\r\nAnd that’s why this whole outcome stings more than it probably should. Utaha is my favorite character in the show for the snide bombshell she is, so I obviously want her to win. Yet it’s obvious who is supposed to win in the end (she and Eriri say as much back in the first season).\\n\\n\r\nSo I (read: everyone) already knew it was coming. It didn’t lessen the blow any less, though. Seeing her leave the circle, pursuing another project without her beloved, put me in a conflicted mood for quite a while. It makes me sad to see friends and relationships and people split apart. Be they in real life or from so many episodes and hours of an anime.\\n\\n\r\nBut it was all amplified by the fact that I knew her choice was correct. Her staying and winning is the happily-ever-after route that just doesn’t make sense given the show’s aims. Indeed, while I am mostly ambivalent towards Eriri, her similar struggles made me sad to see her defeated, too, despite how much she did not want it to be so.\\n\\n\r\nThus, my first reaction was disappointment – in them for moving on and in the anime for not giving me that happy ending. But, again, after thinking on it more, that disappointment turned to acceptance. The creator in me knew it had to be this way. On a story level, a character level, and a realistic level. As they say, “the truth hurts,” and that just about sums it up.\\n\\n\r\nOr at least, it should, for part of me justifies their paths. They aren’t going anywhere, and it’s not like they can’t visit each other when they want. More importantly, reviewing this season so late benefits me nicely, replacing that acceptance with cautious optimism. A brand-new sequel-finale movie was announced just back in December of 2017, and, literally just the other day, phrasing about an “alternate route” have surfaced.\\n\\n\r\nWill any of this mean anything in the end? Who knows. Until then, Utaha and Eriri will be more absent from Tomoya’s life and from the story than how I would prefer. Which just makes me for sure invested in wanting to see how this tale will officially conclude.\\n\\n\r\nSaenai Heroine no Sodatekata ♭ demonstrates that a sequel can trounce its predecessor. The nice artistic direction and the passable music remain the same, but the better drama and the stronger character writing make for marked improvements that elevate the series to a higher level. No caveats attached.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, “separating the art from the artist,” the narrative’s tighter focus on drama and the different events throughout the season craft a tale that goes beyond its harem limitations\\n\\n\r\nArt & Animation: Good, tons of flair from the stylistic presentation and the varied cinematography back the attractive designs and the nice level of movement\\n\\n\r\nCharacters: Great, Utaha and Eriri sacrifice the personal for the passion as their defined arcs play out, Megumi grows into her own person, and they reciprocate Tomoya in turn\\n\\n\r\nMusic & Sound: Fine, wonderful VA performances make up for a weak OP-ED combo, the OST aids the drama well enough, and the occasional sound-effects are appreciated\\n\\n\r\nEnjoyment: Great, fun to see the characters back again, but, most importantly, it was a more impactful experience than thought possible, especially as a creator\\n\\n\r\nFinal Score: 8/10",
            "date": "2018-03-19T16:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 274319,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=274319"
        },
        {
            "content": "I am new to anime, but so far as i live i only interested in watching a Action, Sci-Fi, and genres related to that, i didnt watch any love=comedy or harem anime because its boring? really i cant stand watching an \"everyday life\" of someone, why dont u just do it in real life? but this one is an exception i dont know you all veteran think but this anime draw me to watch it from season1 to 2 and i hope it get season 3 as well as i dont want the story to be end so soon (23 eps included season 1 but,well)\\n\\n\r\nStory(9) :\\n\r\nThe story you could say in real life it was a normal one like, joining a club, and creating the game together. The differences is when the club(produciton house) is all girl and got only 1 boy and all the girl character has its own background story with out main character and try to show their appeal in their different ways\\n\\n\r\nArt(10) :\\n\r\nThe Art is amazing! The coloring and that building details, the light around the saenai world the style of clothing that is so variable and the background so-realistic make me realize that they do take this anime seriously, the character all was shining in the world of saenai that they create even the side character were all beautifull\\n\\n\r\nSound(8) :\\n\r\nwell for standarn sound for every sound in the saenai world are all good nothing missing its sound, GLISTENINGb by Megumi really fit for climax, it is good but other song didnt move me, only one song that move me.\\n\\n\r\nCharacter(8) :\\n\r\nI heard that the character are mocking of Tsundere, Yandere, Kuudere and somewhat like that??? Well if they are then maybe its basic personality, but in some way the character here are different and is unique compared to other anime with that personality, well who know? i didnt watch other anime about school romance, what i can say is they do really know how to create cute girl and appealing personality that can move your heart(mine)\\n\\n\r\nEnjoyment(9) :\\n\r\nLike i said before, well i didnt bored watch this series so i could say yes. I Really enjoy this series it well made\\n\\n\r\nOverall(9) :\\n\r\nWell i can say that this anime is worth to watch. They(One Main heroine) do sometimes critize about the anime itself witch is that the creator know that they was not perfect afterall that means they're humble and tries their best to create this anime. So if you havent watch this anime yet. Time to Order the Blu-Ray ^^",
            "date": "2017-06-24T14:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 250896,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6342048.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Strainn",
                "username": "Strainn"
            },
            "url": "https://myanimelist.net/reviews.php?id=250896"
        },
        {
            "content": "I have a hard time really coming to terms with the impact that this anime left on me after watching it. I've been gracious to a lot of anime over my time watching, but nothing has ever been the completely 10 out of 10 that Saekano Flat ended up being. The first season was good, and I expected more of the same...and got something a lot better. I don't really think I've ever watched something western or otherwise, whether is be a cartoon or live action product, that had a story that looked as good as it was told.\r\nI didn't know I had been cravinga ecchi harem that would subvert being over sexualized and comedic, but low and behold, watching Saekano showed me I truly was. The way these character's stories intertwined, the way it treats having a creative mind, and taking your abilities seriously...It worked so well together. Plus, on the romantic side of things, it's incredibly satisfying to see an anime where there are several women you could see the MC end up with and actually be completely fine with any choice.\\n\\n\r\nI have a hard time even thinking up the words to bring this program justice. That's why I will keep it brief. Watch Saekano Flat. Watch Saekano 1 as well. Open your mind to a story about friendship, coming to terms with your feelings, the uplifting nature of seeing others succeed, and being the best that you can possibly be in your field of choice.",
            "date": "2018-04-11T05:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 277728,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6350505.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cpman",
                "username": "Cpman"
            },
            "url": "https://myanimelist.net/reviews.php?id=277728"
        },
        {
            "content": "Alright I got suckered into it.\r\nI really loved this show even more than the first season. It repeated what it did well in the first season (analogies to the anime, light novel, and gaming industry) while also improving on what it lacked in the first season (the story is an allegory to the industry, but it also works well as its own standalone story). Two things I think came together to make this season a success:\r\nCharacter: I still can't get enough of Megumi Kano. After this, she's going on my character list, because I was enthralled by her. It could just be that she's acharacter I don't really see often. She's intentionally boring, but that also makes her outbursts and spurts of emotion that much more captivating. The minor shifts in how she acts absolutely contributed to her perception as a character, and they didn't need over-reactive animations to do it. Additionally, characters grow throughout this season and progress to new positions by the end of it. These changes weren't necessarily \"good\" for everyone involved, yet they were natural and almost sadly (in a good way) expected.\\n\\n\r\nThe Narrative: Each arc or sub-plot directly tied into something related to the industry. Past that, characters often have recurring roles related to these different industry happenings. Toyomo obviously represents the ideal consumer, the two artists represent the creators, and Megumi much more of the passing audience. Each of them has a different idea of what makes their products \"work\" yet it's hard to keep all their concepts together at one time. One might point out schedules as a good motivator, while passion seems to be more effective to another. I found myself touched at both what these characters had to go through as people, but also as producers who want to see a project come to fruition.\\n\\n\r\nFor me, this series was a hit outta the park.",
            "date": "2018-03-26T19:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 275256,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6874523.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AmericanSomnium",
                "username": "AmericanSomnium"
            },
            "url": "https://myanimelist.net/reviews.php?id=275256"
        },
        {
            "content": "Ok, so I've just ended the sequel of Saekano, and thought it might be cliche at one point it  does have some development of sorts, and here'show I rate it:\r\nGood 7, Story:\r\nIt may have it's share of cliche but, in this sequel it has a certain degree of development, where we see, the break up of the Blessing Software group, that starts when Utaha graduates and when a new girl, Izumi arrives as one girl leaves, what adds to my rating was seeing Eri leave the group and this is where Mr. Ethical starts to contemplate as he struggle to move on without the2 most valuable members of his group, not surprising since this anime story plot revolves around a philosophy theme, that things would not always stay the same whether you like it or not. \\n\\n\r\nfair 6, art:\\n\r\nOk so there were some indications of them girl looking very bitchy with their school uniforms, the characters maybe the same, but don be expecting to see some of Eri's panchira moments nor see anything else that would titillate your adrenaline.\\n\\n\\n\r\nMediocre 5,  Sound:\\n\\n\r\nOk so it was the same seiyuus who did the voices of them characters, so what? I don't both like closing and opening themes.\\n\\n\r\nVery Good 8 , characters:\\n\\n\r\nNow that we see some development , we can't ignore the other added characters in this sequel like the antagonist  Akane Kosaka who was instrumental of making both Eri and Utaha do more better, but there were times that the competitions for the Blessing Software group were annoying and overrated, but then again it does make their role good, also seeing the part where the relationship between the 2 girls and Mr.Ethical becomes more on a certain romantic degree, but it was Megumi who mad such impact in fact she is the only one who remain with Mr. Ethical all throughout despite of the fact that she just a mascot or just a model for Eri's illustrations, though I would have love to see some of that arc between her and Mr.Ethical develop into a more romantic sense. But then again being this boring girlfriend it was just enough that she has to keep him guessing so basically my score was for her alone. But it was quite unfair that Michru was push aside was given a very short supporting role, she could have added something if only original creator Misaki Kurehito did something about her character.\\n\\n\r\nfair 6, Enjoyment:\\n\\n\r\nFrankly, the whole nine yards of this sequel can be pretty boring at times , and there were times that just watching it can be a chore, but once I've got to the few last episode that is were  my interest peaked up.\\n\\n\r\nVery good 8, Overall:\\n\\n\r\nOk, so seeing the Blessing Software group break up before they can even continue making more success because of Utaha and Eri's plan to go to the other side for better challenges was disappointing , but it wasn't always that we get to see such disappointment of the part of Mr. Ethical when 2 of his most valuable assets go to the other side that has served as a rude awakening for him to let them go and move on so that he can do better, so basically  that was disappointingly very good, even though  both Utaha and Eri missed their train that was nothing more of a comedy gag, so don't expect an season 3 of this thing since it wouldn't be a good fit. \\n\\n\r\nPres.Thrump OUT!!!!",
            "date": "2017-07-08T12:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 252288,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=252288"
        },
        {
            "content": "(This review will contain spoilers so don't read it unless you've finished the anime)\r\nSaenai Heroine no Sodatekata (A.K.A Saekano), oh what a nice little series you have been. As soon as I heard there was going to be a second season, Saenai Heroine no Sodatekata Flat, I jumped for joy. More of Mr. Ethical and his harem mucking about just trying to make a dating sim, or so I thought. At first, most of us had thought that there would be your typical competition for the main protagonists, and there was, but we never would have thought that we would receive an ending like that.\r\nBeforewe get to that certain ending, let's start off with the story structure itself. It progressed rather nicely although I did get a little confused with the flashback of visiting Akane. It's not some fantasy with secret powers so there aren't really any plotholes or unexplainable things to talk about. Even though it took quite the serious turn, the story overall is rather plain as it is a typical \"harem\" anime, but what it lacks in story it makes up for it in character development. Now, I know what you're saying, \"But if the story isn't all that good, what's the point in having developed characters in such a boring environment? It's like buying a car only to have it sit in a garage.\" It only seems that way at first and I'll admit I got a little bored too, but once they started adding in parts where it's just Tomoya and one of the heroines it starts to get exciting and here's why:\\n\\n\r\n1) The relationships start to take more of intimate form. Ships that had set sail had now nearly reached new shores, especially with Utaha-senpai. \\n\r\n2) It foreshadowed the reason why Tomoya had held Eriri back from bringing out her full potential.\\n\r\n3) It's more of a preference, but it allowed us to see some of favorite ships sail strong.\\n\r\n4) The way you can see Katou's personality changing is cute and almost like watching a child grow up.\\n\\n\r\nThe art is rather pleasant and started to look more dramatic as the episodes progressed and lost the fan service touch in my opinion(not saying it was a bad thing). I feel the legs of the heroines were kind of plain and shave been done better, but I'm not one to judge because I can't draw limbs good.\\n\\n\r\nAnyways, back to the nearing end of the anime, I nearly started to cry. It made me feel like taking a dark path towards alcohol and becoming a NEET. I kept on hoping and praying that they wouldn't join Akane and I thought it would be cliché and they would stay with Blessing Software, but as soon as I saw that Eriri could draw again after being insulted, I knew it was over. I knew that they wouldn't stay with Tomoya forever. I knew that Blessing Software would never be the same again. It is quite the feels trip. I lost it when Eriri said that she wouldn't be able to draw anymore if she had stayed with Tomoya. It was like she had broken up with and would move on and bury him in the last.\\n\\n\r\nWhen you become a leader, you can't be too soft towards your partners or else they lose the reason to keep trying and improve. They'll lose the reason why they chose you. Tomoya had learned this the hard way and lost his two most important members of his Circle, but now that they're gone all he wants is to see them be the best they can now that they aren't being held back by him.",
            "date": "2017-06-30T17:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 251578,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MrFeelsTrain",
                "username": "MrFeelsTrain"
            },
            "url": "https://myanimelist.net/reviews.php?id=251578"
        },
        {
            "content": "Since this is my first review it's not going to be as polished or as detailed as others, but I had a strong urge to write a review after watching the latest episode.\r\nFirst of all, I'd like to point out that despite the cliche and typical character designs, there is still that hint of spice added in which I'll build on later.\r\nArt:\r\nI don't really see any differences in the art compared to last season. Same, clean and pretty art. Not spectacular but not bad at all. I don't really have an eye for art in anime but I feel like it's good.\r\nStory/Character:\r\nThe story continues offfrom the first season (obviously) but the tone has completely changed in my opinion. Despite all the fan service and light comedy, the story has become much more serious and built upon. Last season, everything was more casual and although there was character development throughout each episode, there is definitely more going on this season.\\n\\n\r\nWe already know that each heroine has feelings for the main character, but we didn't know how strong their emotions really were. In this season we see Eriri and Utaha thoroughly built upon. We see them cry, smile and their actions that they take in order to win over the protagonist. Each of these scenes tugs on my heart strings as if you are that character suffering. You start to sympathize and actually relate to them in contrast to the earlier season. \\n\\n\r\nHowever, despite their strong emotion and such. We really start to wonder how on earth the protagonist was capable to woo these girls. Each episode we see pathetic little Tomoya doing his thing. Unaware of these girls feelings. He lacks development and it's like he's only there for comedic relief. I honestly dislike the protagonist and wish he actually had some talent except his otaku passion. He continues to stress me out with his actions >:(\\n\\n\r\nAlso, the story constantly shifts from positive to negative. The changes are abrupt and sudden and the theme of the anime blurs. Happy??? or is this anime meant to be serious???. I don't really know but I'll keep watching it because I like the heroines hehe XD.\\n\\n\r\nSound:\\n\r\nSome nice music at certain bits that strengthen the scenes. The sound is just like most anime. Happy and upbeat at happy moments and vice versa.\\n\\n\r\nEnjoyment:\\n\r\nI wouldn't watch this on it's own. I'm currently watching while doing my assignments and it's alright. When some scenes pop up I'll watch for a bit. Ehhh, really a big dissapointment, I liked how they changed the tone of the anime but, not really working out.\\n\\n\r\nHard to believe but, if they just kept the easy going friendly harem route then it might actually be better than it is now.",
            "date": "2017-05-13T21:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 247626,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mustemploy",
                "username": "Mustemploy"
            },
            "url": "https://myanimelist.net/reviews.php?id=247626"
        }
    ],
    [
        {
            "content": "This is the second season of Saekano and like it should it starts of after the ending of the first one.\r\n  I liked the first season but to me it didn't seem to be anything special or worth remembering, i mean you had the best girl fight like you have in any harem show nowadays, but this second season just raised the bar so high that it kept me waiting and hoping that thursday would finally come so i could watch this show.\r\n  Story - 9\r\n-This story is very straightforward, you have the MC, Tomoya and his circle trying to makethis game happen. Althought they sure as hell struggle a lot in the meanwhile, making the actual completition of the game a lot more rewarding in general.\\n\r\n  Art - 10\\n\r\n-The art in saekano was just plain fenomenal, from the ecchi parts to the emocional parts, it was totally outstanding for the harem type of show.\\n\r\n  Sound - 8\\n\r\n-The sound was good throught the series, i've seen better and i've seen worse. Nothing to complain here althought near the end there were some really good songs in the emocional moments.\\n\r\n  Caracters - 9\\n\r\n-The main caracter oh well it's your harem protagonist, has all the girls but since he is an otaku doesn't really want any of them. That can sometimes get a bit anoying, but  he is the key caracter in the story after all. The girls on the other hand, might have \"cliched\" personalities like the childhood friend tsundere and so on but the anime actually jokes with that a lot and that makes it really entertaning. All of the girls have interesting aspects about them and make the story was more interesting overall. And yes this is the type of show where everyone fights about the best girl.\\n\r\n  Enjoyment and overall - 9\\n\r\n-This show for sure raised the bar and for sure is a must watch for those who enjoyed the first season, but speaking personally, mostly near the end, this series became something that i felt growing, the caracters, their struggles and everything arround them changed in this 23 episodes. I loved the ending and overall loved the series as a whole. This is not your average harem show with no plot at all, Saekano has a story and is really nicely executed.\\n\r\nThanks for reading this far, and if you just skipped to see the end, tldr it was an awesome show and you should give it a try for sure.",
            "date": "2017-06-22T10:48:00+00:00",
            "helpful_count": 118,
            "mal_id": 250665,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6102031.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ItsFilipe",
                "username": "ItsFilipe"
            },
            "url": "https://myanimelist.net/reviews.php?id=250665"
        },
        {
            "content": "Man, I can't believe I suffered through 4 episodes just to write a review but apparently you have to...thanks MAL\r\nWell, well, well wasn't this an unfortunate mistake. If there's one thing I hate, is anime series that are pretentious and lure you in with false promises of an enriching story (granted this was pretty much NOT that). The story continues off the 1st season where...oh who cares, the plot is in the description...I'm just here to tell you it's awful. Some find this show enjoyable but I'm not here to argue taste, you have yours and I have mine.\r\nThis show is as shallow as itgets from the plot to the characters to the melodrama. Shows like this try to give the impression that they try to build on the story and develop the characters but all they do is try to give random ecchi moments and who is going to sit on the MC's rod first...sounds like a masterpiece at work here. Why do these series keep pandering to the beta-male, where it's one bland, awful, dense mary-sue with the personally of chalk character get to have 5 beautiful girls fight for his attention? If the point is to make relatable characters, what's with all the heavily unrealistic situations? When will someone like the MC ever succeed in real life by being the way he is? I guess you have to pander to those with these traits and if being pathetic sells, I guess you have to cater towards your target market but I digress...\\n\\n\r\nThe female characters don't do much to the series...it's like the only time they feature is when they bicker amongst each other for the MCs approval. Their personalities fall into the common trope of: \\n\\n\r\nEriri - flat-chested tsundere with blonde pigtails and MC's childhood friend...I could reach into a bucket and pull out 10 of these\\n\\n\r\nUtaha - miss perfect, blessed with intelligence and beauty trying to give off an imposing figure of a lion with her cold attitude but is reduced to a kitten when the MC drops a compliment\\n\\n\r\nMichiru - basically there for incest fanservice, always very physical with the MC much to the despair of the others, often very flirty as well\\n\\n\r\nMegumi - the plain, soft spoken type, always tries to help others rather emotionless girl that opens up slowly with the help of her friends, some might say the perfect girlfriend \\n\\n\r\nAnd last but not least...the MC: Tomoya Aki...there has to be a reason why girls are attracted to him...is it his pasty skin? His bland appearance? His barely existent personality? His density or the fact that he's a hardcore geek that spends his money on games and anime? All these things make up the boy girls want...that's what they tell us so it must be true, right? \\n\\n\r\nEverything that takes place, each thing these girls achieve is just to please the MC in the end and try to earn his affection. They serve no other purpose other than being the MC's romantic interest, ending up in questionable situations and random ecchi moments to appease the fans and sell BDs. A true shame since many good characters in series like this just end up as sex objects and shipping fuel. \\n\\n\r\nThis show is a special kind of bad. I've known this since the first season but I stuck around like fly on shit seeing if it gets better but in the end you realize, like the fly, you're literally wasting time and being entertained by a turd.\\n\\n",
            "date": "2017-05-13T14:34:00+00:00",
            "helpful_count": 102,
            "mal_id": 247610,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6157577.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/harshtruth",
                "username": "harshtruth"
            },
            "url": "https://myanimelist.net/reviews.php?id=247610"
        },
        {
            "content": "After stumbling across this series and binge-watching the entirety of Season 1, with regard to this season, I think I was able to get more enjoyment overall from the show. I felt like this season there was more focus on the character dynamics between Tomoya, Megumi, Utaha and Eriri. As a result I felt like they were able to get much more character development than I felt they did in Season 1.\r\nI feel like Saenai Heroine no Sodatekata is one of the better anime in the Harem genre and it doesn't really have many of the failings one might find when watching anime with Haremwithin it. The only perceived negative I can give the show is maybe the way it handles the fan service and even then it doesn't bother me personally.\\n\r\nIf you watched season 1 of this anime and you are considering giving season 2 a go, I can recommend you do it. You will enjoy just as much, if not more than Season 1!\\n\\n\r\nI hope we can get a Third Season!",
            "date": "2017-06-22T10:51:00+00:00",
            "helpful_count": 49,
            "mal_id": 250667,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5992469.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BlackCicero",
                "username": "BlackCicero"
            },
            "url": "https://myanimelist.net/reviews.php?id=250667"
        },
        {
            "content": "The road for a ‘Creative’ is a long and difficult one.  The pressure of meeting deadlines, constantly improving yourself, and ultimately making something that you want is a struggle that many artists find themselves in as they try and share with the world the vision that they have.  And so we find ourselves with the second season of Saekano, as we see the conclusion of what the doujin circle ‘Blessing Software’ has to offer.\r\nStory:  Picking off from the first season, Saekano Flat (which I will refer to as ‘Flat’ for the rest of the review) continues the story of Tomoya Aki andthe rest of Blessing Software as they complete the destined galge that the group’s members have been tirelessly working on.  \\n\\n\r\nSimilar to its first season, Flat refines and solidifies the cast’s struggles and relationships with each other alongside the characters’ progress with the development of the game.  In particular, the show focuses heavily on two of the main female leads, Utaha and Eriri, as they come to terms with their lives as creators and what it is they want, as many of the show’s conflicts and problems are centered around these two and the kind of goals they have for themselves and with Tomoya.  As such, the story feels a lot more personal for these girls, and the screentime is used as such to dedicate moments and developments that center around them, thus giving the audience a better understanding of their characterization.  \\n\\n\r\nAn issue with the story however is how much of an imbalance there is with the characterization.  Personally, I feel like Eriri’s portion of the story is far stronger while Utaha’s feels muted in comparison.  Utaha’s struggles just don’t seem as impactful when compared to how the series builds up Eriri and the kinds of things she deals with later on in the series.  I chalk that up more on the series using Eriri as the series’ climax, but it still does feel unfair when looking at the two at face value.  \\n\\n\r\nAnother is how the rest of the main cast, Tomoya and Kato, have their problems mostly have their problems shoved to the side.  Tomoya kind of averts this problem by being a core aspect that influences the rest of the cast, and as such, gains growth and the ability to grow from that, but Kato mostly gets shoved to the side and only really gets to shine in 1-2 episodes as the main focus.  The way they present her is nice, but I honestly wished that they did more with her than just do what they did with her.\\n\\n\r\nWith all of these factors in play, the show ultimately culminates into an ending that I would largely describe as ‘fitting’ given the kinds of factors put in play.  It’s not the most dramatic ending, especially compared to some of the more high-tension scenes from previous episodes.  But it is what I feel like is a very fitting ending for the series and ends on a high note all things considering, as the show still retains its comedic charm despite all of the drama that had happened before.\\n\\n\r\nOverall, Flat was a solid second season that had many good and bittersweet aspects to it that culminated into a well-rounded show.  Indeed the imbalance of dedication and time spent on the characters made some seem more important than others, but its usage of the artist struggle and personal desire to excel contrasting the struggle of personal vs. professional life made up for a good portion of the mistakes that the show ended up making on its journey to the end.  (You know, despite it only having eleven episodes.  Eleven episodes for a cour is weird.)\\n\\n\r\nOverview:\\n\r\n+ Finished story (because many anime don’t actually do this.)\\n\r\n+ Drastic characterization (with consequences and bittersweet moments)\\n\r\n-  Imbalance with how drastic characterization is between characters\\n\\n\r\nCharacters: The cast itself doesn’t change much between seasons, so instead of a general rundown, I’m going to be talking more about the specifics on some of the cast shifts.  \\n\\n\r\nMost prominently for the series are Utaha and Eriri.  As mentioned before, these two are Flat’s centerpiece when compared to the one arc they each got in season one.  Compared to season one focusing more on them licking at old wounds, Flat shows the girls and their attempts at looking towards the future as the show asks the question: What happens once the game’s finished?  I praised the show before for given a realistic spin on the idealistic ‘harem’ scenario, as each of the girls have their own separate lives and personalities apart from their involvement with the game and Tomoya, and Flat gives further evidence for that fact as the story progresses.  You see these girls blossom by themselves as individual character, and it’s a really nice change of pace that in my opinion separates this show from other harem/drama shows, and as such, gives itself a positive identity.  \\n\\n\r\nThen there’s Tomoya.  If I really had to pin down what Tomoya does, it would be riding off of the ‘character development train’ that both Eriri and Utaha forge ahead on.  Most of Tomoya’s characterization and struggle comes off from those two girls as he sees the result of his actions and comes to terms with what has to be done with all of them.  While yes he has a few unsightly moments, it results in a lot of genuine growth that is again, something that’s a nice change of pace.  It sucks that it comes from a source that’s not him, but it doesn’t really hurt the series that much when you put it in context.\\n\\n\r\n Kato however doesn’t do all that much.  As mentioned before, she only has like…one, may one and a half episodes dedicated to her.  She mostly plays a background role to all of this rather than the ‘main heroine’ as the series (namely Tomoya) made her out to be.  The one episode she does get in the middle fixes several of the problems that we encounter, but doesn’t really justify her lack of involvement if you ask me.\\n\\n\r\nComparatively, the rest of the cast is hardly there.  Because the show is so heavily focused on our main 4 characters, everyone else is basically shoved to the side and if anything, act as a slight instigator to some sections of the plot.  It’s a shame too, because characters like the Hashima siblings and Michiru had potential; they just weren’t used much at all.  (They do point this out in the show, however it doesn’t rectify the problem.)\\n\\n\r\nOverview:\\n\r\n+ Heavy main characterization\\n\r\n-  Kato does very little (And that’s a bad thing if you ask me.)\\n\r\n-  The supporting cast basically does nothing.\\n\\n\r\nArt:  Produced by A-1, the art for Saekano is the same light and gentle artstyle that it had back in season one.  The red highlights on the eyebrows for the girls still bother me, but there really isn’t much different or bad in the way of the art department.  \\n\\n\r\nThere are also quite a number of camera shots that’re intentionally framed for fanservice (mostly involving Utaha actually) however.  I’d argue that it’s tasteful fanservice, since the circumstances that they come about could actually happen in real life to some degree.  They’re not really that common, and if noticed, don’t really impact the story or anything of that sort to any major degree.\\n\\n\r\nOverview:\\n\r\n+ Pretty much the same art as Season 1\\n\r\n+/- Fanservice shots (Some people still don’t like fanservice no matter what it is.)\\n\\n\r\nSound: The new OP and ED for Flat, “Stella Breeze” and “Sakura-iro Diary” both share a similar style as being bright and gentle pieces with a slight bit of energy and a hint of somberness to them.  Both of them are actually quite nice, and personally, I think that they’re a good reflection for the series that they’re a part of.  \\n\\n\r\nMy only complaint is how similar the two of them sound.  They both share such a similar tone in sound that I’d argue that you could switch the two around and you could achieve a similar effect in the series.  Overall though, really nice tracks, though I’d also argue that they’re not quite that memorable?  Yeah, I’ll go with that.\\n\\n\r\nOverview:\\n\r\n+ Good tracks that reflect the series\\n\r\n-\tSound very samey\\n\\n\r\nPersonal Enjoyment: With the plethora of harem/romance shows that I have haphazardly slapped onto my list, it becomes an increasingly difficult trial for me to find many harem shows that I would not only actually enjoy, but also find interesting due to how samey many of them feel while watching.  Saekano not only gives me that interesting harem story that I was looking for, but also speaks to me as a creator and gives me a way to relate to these characters.  So for that reason, Saekano is one of my all-time favorites in the category.  \\n\\n\r\nDid I like this series?\\n\\n\r\nI did.  I really did.  Despite it having a very, very bittersweet climax and resolution, I really enjoyed the characters and the story.  Not only that, but I like how Saekano itself acts as a bit of a parody of the harem genre because all of the characters know and avoid the general conventions of the genre while also proving itself to be more than just a show with several girls chasing after him.  The character interactions are also really, really fun to watch.  \\n\\n\r\nWhat didn’t I like about this series?\\n\\n\r\nPersonally, I just don’t like the climax.  Not for how it was presented or how it was written, but for how it hits me personally.  It’s very hard to make decisions like that, and as a fan of the series; it’s an understandably bittersweet moment to witness because if I may be honest, I like the entire main cast; maybe Kato more than anyone, but I still like everyone.\\n\\n\r\nWould I recommend this series?\\n\\n\r\nIf you watched Season one, watch Flat.  I promise you won’t regret it.  (Or maybe you will because you, like me, have personal attachment to these characters.  I don’t know.)  If you haven’t, I would suggest this show highly.  It’s has a lot of merit to it, and tells a complete story about the problems with personal life vs. professional life combined with the struggles with being a creator, a topic that not that many anime actually cover despite itself being an art medium.\\n",
            "date": "2017-06-22T12:41:00+00:00",
            "helpful_count": 28,
            "mal_id": 250678,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=250678"
        },
        {
            "content": "first, i will talk about the art. the art is amazing. how the animator draws the eye, the curve of the body, and the animation is remarkable. The characters's eye reminds me about Grisaia's art. Though the studio is different. Nice art, A-1 Pictures.\r\nabout music is still far compared to season 1, which gives the Icy Tail a chance for them to perform. But in season 2 they do not appear even once.\r\nAbout the character, the main character is too weak and can make the audience feel the anger is quite extraordinary. especially when he refused to come to pick up eriri when she wassick. but it turns out he came and decided to come. even if it sacrifices the games they have striven for.\\n\r\nabout other characters they are quite good and can offset the 'standard' character of an anime. there are some characters such as silent / moody (kasumi), tsundere stubborn (eriri), plain and kind (megumi), and jolly also aggressive (michiru).\\n\\n\r\nAbout the story, it's pretty good. about how Japanese creators are faced with a difficult choice, reaching any way to get to the top, overcoming how to deal with setbacks, and how to make decisions to develop.\\n\\n\r\nThen about how the main character creates a heroine of dreams, from the way they speak, behave, answer questions, respond to others, that's pretty impressive. to pick out clothes on heroine to become a real heroine.\\n\r\nBut still, season 1 is more fun. I feel this 2nd season is too explain a lot of less important things even can run from the main storyline. let alone the flow that makes the kasumi and eriri out of the group. although it was good enough for them, but I was a bit disappointed. but I can not reason much about it. because such a thing is needed for their creators to flourish.\\n\\n\r\nThe funny thing is that when both of them missed the train and the kasumi said that if he belonged to the main character and his life was in the grip of the main character, I was a little happy because it might just make them fail to join Akane and stay with the blessing software. but that would not be possible. is indeed a dilemma.\\n\\n\r\nthanks for reading my first review of MAL. enjoy!",
            "date": "2018-02-24T20:09:00+00:00",
            "helpful_count": 15,
            "mal_id": 272391,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6905523.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Heika-",
                "username": "Heika-"
            },
            "url": "https://myanimelist.net/reviews.php?id=272391"
        },
        {
            "content": "To keep it simple, I like this show. It's not one of those typical harem show that would've suffice the needs of all horny men as a fap material, and of those that like to be teased by an animated sexy and cute 2D girl where real sex never really happen in this show, despite how turned on the MC should've been in those situation. In this case, Saenai Heroine no sodatekata is one of those rare show where the MC lacks the libido, or aka, sexual lust for 3D women; even if they're a cute blonde loli tsundere whose reputation and status as acute or one of the beautiful girls in school are apparent and is accredited in a beauty contest (she's also half western and is rich as fuck) . Or, his own fucking sexy cousin, who would wear little clothing at home, even in the same room as the MC with no shame and tact. Or, a girl who's acclaimed to be one of the popular writer and perfect in aspects any male would want: beautiful, intelligent, graceful, cold, and composed. Or a girl with a dull personality, demeanor and manner of speech, but is apparently a main heroine to his ideal 2D girl's character.\\n\\n\r\nThe situation as a whole seem far fetched from reality, and it really is, considering that all of these successful (well two of them) girls flock over the MC like he's the only man there is for them to be with. In a situation like this we would be expecting a story or themes, just like in any harem anime, revolving around romance, jealousy, forbidden love, guilt and so on. But this anime doesn't only explores only that, it explored a sort of rivalry experience as the story do go on a route of creating a game, with the dull girl, Kato, as an ideal heroine, and to become one of the best game out there. The story is somewhat similar to bakuman and shirobako. Both anime explored the inner working of a team working on an anime, in this case, this anime explores the inner working and the experience of a team working on a visual novel, with an acclaimed light novel author as the lead of the script writing team (as she's the only one lol), and one of the ingenious blonde loli with great adroitness to drawing ability (and again, the only one working on it). The team is basically his harem, where their specialty are delegated to the right place on the team for creating a game. \\n\\n\r\nAdditionally, the dialogue may not be as great or rivaled the monogatari series. The dialogue is actually written in a very humorous and witty manner with its metaphors, subtle complains or insults, breaking the 4th wall and such. So this does make the entirety of the show not as boring as it seem. Although, in some part of the show I gotta admit, I almost fall asleep or have the inclination to skim over it.\\n\\n\r\nAnother quality of this anime that makes this show so great or fun to watch is basically, the character are cute, unique and likable. But ofc, this naturally boils down to your personal interests for a character, for a certain set of personality and appearances, though, some character may seem to be the cliche type, while some, like Katou, would be one of the unique ones in the show. \\n\\n\r\nAs such, give this anime a go even if you're not a harem fan. As i'm not a huge harem fan myself, it just seem like it's fine for me for an anime to be a harem show, when the MC is an otaku that have no sexual desire for an actual female in the real world, or is actually a pervert much like any other harem MC there is. And just to be warned, the fanservice is kinda heavy on this one, though they are very self aware on this one lmao. If you watch the episode 0 of season 1 or 2, you will see the 4th wall crumbling down as the character voiced their honest complain or statement about this anime. Oh and much like Oreimu, the anime also explored shit like people hating on Otaku culture and other such serious subjects that may come up in the story.",
            "date": "2017-05-15T01:51:00+00:00",
            "helpful_count": 18,
            "mal_id": 247721,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=247721"
        },
        {
            "content": "This review exists purely for the purpose of aiding those who watched episode 9 and are wondering why you feel the need to throw up at the nearest toilet seat. So if you arrived here after watching the particular episode, or is the unfortunate soul that decided to start watching this show, you have come to the right place. Now you may be wondering what exactly happened in episode 9 to force me to create a myanimelist account and write a review for the first time in my life, but I will get to that in a moment. Before we get to my most hatedmoment in anime history, I will expand upon the rest of the show first.\\n\\n\r\nEpisode 1~ 8\\n\\n\r\nStory : 6 Art : 8 Sound : 6 Character : 7 Enjoyment: 8 Overall : 7\\n\\n\r\nNow the story is nothing to write home about. It involves our good old protagonist Aki Tomoya who decides to actually finish his ambitious game with talents that go way over his head. He messes up a lot as usual and fixes the broken parts with the classic harem protagonist appeal. \\n\\n\r\nSo in order to justify my enjoyment, the art and characters have to carry the rest. Art is standard most of the time, but there are unique flare moments mixed in, which enhances the show immensely. The fact that it isn't completely covered with this style is far better in the theme of this show of ordinary (= boring) developments that lead to moments of beauty (= heroine).\\n\\n\r\nThe characters themselves are not out of the ball park either, but they make sense and are funny at times, which I believe to be the most important feature of any show driven by the characters and their interaction. Any action a character takes must make sense in the context of the character, which is established beforehand by the various interactions that the character makes with other characters. For instance, if character A has consistently avoided character B, we establish that A probably dislikes B. Now, any action A takes that involves interacting with B must have a solid reason. It could be a misunderstanding (A only avoided B because B had a cat with him always and A is deathly afraid of cats), a specific B-achievable goal (A needs B's help to do something), or even a deux ex machina (A gets hit by a car and loses all memory. Note that this kind of plot device is often referred to as garbage, complete bullshit, etc. But it's still better than nothing, because the writer is acknowledging that it wouldn't make any sense for A and B to interact for no reason).\\n\\n\r\nI have no comment to make about the sound design other than that it complements the show, but does nothing memorable.\\n\\n\r\nSo, ultimately, the rating resolves to overall 7, the closest it gets to my enjoyment rating while still considering other elements of the show.\\n\\n\r\nNow, you may be wondering, what went wrong for my previous rating of 7 to turn into 2 over the course of one episode. That's where you would be wrong. This swift downturn happened in the course of approximately 30 seconds.\\n\\n\r\nEpisode 9\\n\\n\r\nStory : 1 Art : 8 Sound : 6 Character : 2 Enjoyment : 2 Overall : 2\\n\\n\r\nNow, for those of you who are worried about possible spoilers, don't worry about it, I won't spoil anything so you can finally understand the feeling of your stomach turning inside out.\\n\\n\r\nTo summarize it briefly, imagine having your entire show built around a single thing, and then smash it on the ground and make the viewers watch the remains of what was the basis of the show just get flushed down the drain by the rain. The execution of this episode was exactly like that. You could have the exact same scenario happen without the characters adding the unnecessary drama. The entire \"turn\" happened only to create drama, which is the antithesis of the whole show.\\n\\n\r\nSo yes, that is why you are disgusted with this show all of a sudden.\\n\\n\r\nShould you watch this show? No. Should you feel bad about watching ep. 9? Yes.\\n\\n\r\nDo yourself a favor and just drop this show right now like me.",
            "date": "2017-06-09T04:50:00+00:00",
            "helpful_count": 13,
            "mal_id": 249561,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/iilxaeju",
                "username": "iilxaeju"
            },
            "url": "https://myanimelist.net/reviews.php?id=249561"
        },
        {
            "content": "maybe that makes this anime interesting is the story line, yes of course where the scene of eriri & utaha want to leave the group of game maker where the scene is in show that actually eriri & utaha not want to leave the group game maker where the scene that makes me touched why so long group walking must release two members that are so valuable. I think in addition to the side of the story I also want to review about the art project, which I think this part is difficult to do from this anime I judge from the making of theimage character 10/10 that makes this anime becomes more well again because this anime is made by studio that i like most. i will always wait whether saekano got seasson 3? and did the eriri and utaha accommodate the group making the Game?",
            "date": "2018-03-25T00:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 274952,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6966818.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shirokuza",
                "username": "Shirokuza"
            },
            "url": "https://myanimelist.net/reviews.php?id=274952"
        },
        {
            "content": "Saenai Heroine no Sodatekata was good... Saenai Heroine no Sodatekata ♭ was better.\r\nSaenai Heroine no Sodatekata's first season was something of a introduction to the dojin team of blessing software of Eriri, Utaha, Tomoya, Michiru and Megumi and finished once the entire team being recruited with half of their first game being done and it was a decent look at the visual novel industry by the eyes of fans turned creator-like anime. Saenai Heroine no Sodatekata ♭ progress further from this by going through the character arcs that was sorely needed from the first season.\r\nLet's start with Utaha Kasumigaoka where her arc has parallels toblessing software's game plotline to the situation of Utaha thinking of leaving blessing software due to her job being done thus she placed onto Tomoya's hands as a producer annnnnnnnd...her arc was saved by Megumi but nonetheless Utaha still had involvement after her arc ended was great as LA was already LA's best girl for this anime (something about her flirting and teasing and just her silver tongue just had something appealing for a character...like Hitagi Senjougahara without her killing yandere intent). Eriri's arc was more focused on her \"artist block\" and it helped her as a character as well as Tomoya as a producer for blessing software in trying to help Eriri get out of her funk. As much as Eriri's arc in the first season made her out to be a jealous tsundere spoiled childhood friend archetype this arc definitely helped albeit LA is slightly biased towards Eriri as a character due to LA's affiliation and liking to Utaha more, nonetheless Eriri's dilemma about her unable to make illustrations and the creative block she had was a good arc for her. Megumi's arc was short in a ways but nonetheless she had more intimate moments with Tomoya throughout this season but also Megumi showed one glaring problem with Tomoya to herself and that was Tomoya didn't ask for her help even though she clearly asked him several times leading to \"what is the point of thrusting Megumi into the world of otaku and visual novels, if your not gonna use her\" and thankfully was something Tomoya repaid and gave Megumi more development outside from her archetype...of having no archetype and being original and new. \\n\\n\r\nThe final arc introduced us to Akane Kosaka voiced by Hitomi Nabatame wanting to scout out Eriri and Utaha after blessing software finished their game and this leads to a crossroads for Tomoya and blessing software's future (as well as now not having anyone to lean on for help), though this final arc is centred around Tomoya losing two of his main developers but it also granted Tomoya to step up and be the producer even after they leave though trying to get back Megumi and LA actually doesn't blame Eriri and Utaha leaving to find bigger fish and their careers were on the line to go and do better things and LA doubt they would be spiteful to Tomoya considering all the effort he did to be a better producer in the long run to do so (and also their part of Tomoya's harem). However as LA says this, the final episode does kind of spit in LA's face at the aforementioned statement about Eriri and Utaha leaving but through a different cause and Utaha's spontaneity might have saved this finale but still the sentiments in LA statement rather stupid as a result and makes the finale look like a typical light novel ending.\\n\\n\r\nIn terms of animation done once again A1-Pictures, the animation was great from the character designs to backgrounding and even the coloration of the scene to make it look more striking is back from the first season as well as the self-aware camera during the fanservice moments...especially Utaha's *ahem* nonetheless, the animation was superb from A1-Pictures even with them cutting corners at times.\\n\\n\r\nGoing off on a little tangent as LA KNOWS someone might brings this up, but what's the difference between you favouring Saenai Heroine no Sodatekata over Shoujo-tachi wa Kouya wo Mezasu?, well that is actually quite easy, aside from both being the same scthick of characters with certain professions wanting to create a visual novel in high school, Saenai Heroine no Sodatekata had the edge with not only with his meta-humour and even using it's meta-humour to talk about visual novel and it's processes, it's characters also meant something to do or even outside of melodrama and their problems in creating something such as a visual novel. Shoujo-tachi wa Kouya wo Mezasu on the other hand used it's characters haphazardly to the point certain characters were used more as gimmick and their melodrama were more focused on a romantic-edge than a creative one. Saenai Heroine no Sodatekata also wins easily because of it's likable characters and atmosphere, Shoujo-tachi wa Kouya wo Mezasu only brought out it's melodrama for the sake of it.\\n\\n\r\nSaenai Heroine no Sodatekata ♭ is a definite watch for those Saenai Heroine no Sodatekata fans and probably even more to the harem member of your choice (sans Michiru..she's the shameless incest fanservice girl in this season with hardly a focus on her as her arc finished in the first season) with drama that means something in the long run both from a character perspective as well as the creative and character relations developing even further from it's predecessors. Saenai Heroine no Sodatekata ♭ may have it's problems (especially when it comes to which harem member you like the most and how that affects your alternate character implications to this second season) but this is a conflicted strong end to an anime series that liked to jab at character archetypes WITH a certain characters with no archetype.\\n\\n\r\nUtaha Kasumigaoka is still best girl of this anime AND for LA's Waifu of Spring 2017 because of this season though...",
            "date": "2017-06-24T04:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 250838,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=250838"
        },
        {
            "content": "Whaaaat? Are you telling me that Saekano has now an actual plot and that it's not just your average ecchi harem comedy anymore?\r\nYeah, you've read it right, the secon season of Saekano was a good surprise, the first episodes continued where the first season left and as it continued the characters have shown some development, especially the girls. Even Katou abandoned her flat self for some time, and this is huge. \r\nThis season is way better than the first one. Yeah, there are still those ecchi shoots and there's still lots of fanservice, but the story has its important role now. The last episodes reallygave a good twist to this series and I'm glad for that. \\n\r\nThe art and sound are still ok, as in the first season.\\n\r\nThe end was baffling though, but I'll be really looking forward to watching a third season. \\n\\n\r\nOne last thing: Katou best girl.",
            "date": "2017-06-22T11:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 250670,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5721761.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AhmedFisherman",
                "username": "AhmedFisherman"
            },
            "url": "https://myanimelist.net/reviews.php?id=250670"
        },
        {
            "content": "The best harem anime i have watch. At first, you will thought it is only mainstream harem anime, with bad romance and a lot of service. But trust me, it only for introduction. The main story appear in season 2. \r\nThe story is very well build, with a plot twist in climax part. But it is very important for characterization. Don't doubt about art and music, because it produced by A-! Pictures\r\nSo, if you'r looking harem anime, i absolutely recommended it. Although it is not the best, it is veeerrryyyy good romance comedy drama Anime.\r\n.\r\n.\r\n.\r\n.\r\nalso, i will tell you that 3 ship that sail inthe first season, two of them will sink :)",
            "date": "2017-06-24T04:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 250839,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5781429.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/wisnunugroho21",
                "username": "wisnunugroho21"
            },
            "url": "https://myanimelist.net/reviews.php?id=250839"
        },
        {
            "content": "Harem's aren't really my genre, because I guess guilty pleasure but for some reasons I find myself enjoying this season and so I'll tell you why, his is just a personal oppinion though.\r\nPlot\r\nWhile season 1 focuses on the Harem plot where girls just goes around with out otaku Tomoya, this season is quite different, for me aside from the harem it tells us how hard it is to create something, we can see the casts suffer from slumps and rejected ideas and although we've seen this in other animes I still find it well executed.\r\nThe Romance are stll there, nothing really new but I dowanna say that the they are really showing us flags on who will win and if you don't know who she is then ......A Coquina clutch for you.\\n\\n\r\nCharacters\\n\\n\r\nnow here's the heart of the sereis the casts, I can say that they are developed but I think they still need a room for improvement. \\n\\n\r\nTomoya- yes at first he's just your typical harem MC-kun who all of a sudden has his own harem, but in this seaon you''ll both love and hate him, although what he did is normal for me considering there is no such thing as a perfect character, I like tomoya is getting matured episode although it's rushed, and I like the fact that he is quick t orealize his mistakes and will try hard and will even support his cicle no matter what.\\n\\n\r\nMegumi- the main heroine, well I think for the characters here she has the most  obvious chaacter development, at the begining she just forced to join but in the end she ends up having the most passion and commitment in finishing the game, and the way how she steals the show everytime I find it unannoyin actually.\\n\\n\r\nUtaha and Eriri- since they're both rivals i think I should combine them, I still think they need room for development although they have quite matured since before they are just only after tomoya, I'm glad that they're starting to think what's next for them and they manaaged to make decisions based on what will happen to them.\\n\\n\r\nIori- Tying with Megumi is this guy, he also has an very obvious character development and I won't say it to avid spoilers but all I can say is that I really liked him in this epiosde...also....PLEASE PAIR HIM WITH EITHER ERIRI OR MICHIRU\\n\\n\r\nMichiru and Izumi- since they got the least screentime all i can say is that If there's a season 3 they could have much more screentime, despite being just there they are likable enough.\\n\\n\r\nSound and Animation: the animation is great and I like in season 1 I still like the character designs particularly Utaha and Kato, for sound It's nice I enjoyed the ending though\\n\\n\r\nOverall saekano is the sereis that looks bland is actually matued at least for me lol though a room for improvement is still needed...I highly reccomend it",
            "date": "2017-06-23T01:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 250731,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949977.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MetalTsundere",
                "username": "MetalTsundere"
            },
            "url": "https://myanimelist.net/reviews.php?id=250731"
        },
        {
            "content": "That ending kiled me ;-;\r\nThis long-awaited (for me) second season was into so much doubt within the comunity because of the filler moments in the fisrt one. However, this demonstrated that A-1 Pictures can make good anime once in a while.\r\nAs I haven't read any of the original light novel I'll be reviewing the series as it is by itself. A generic eviroment and setting with unique characters and weird but still natural development.\r\nIn the first season I just watched it because I was going into harem stuff. But the fact that the main heroine was Megumi since ever made me think harem anime aren'tall about a guy who bangs every girl with presence.\\n\\n\r\nThe story itself wasn't all that original nor ordinary. A guy who recruits talented classmates who also are in love with him just don't happen in real life. But this is not the case with Megumi, who started as just a passerby. In the first season the team build their relationships. But in this second season we see each one developing as if every one of them was the main character. We see them joy and then suffer, also how they overcome the difficulties. And in the end, they make some big decissions that gets the anime upside down. Although, I'd really like to see a third season because a spoiler someone told me from the light novel ;-;\\n\\n\r\nThe artstyle is just as generic as Gakusen Toshi Asterisk. But A-1 managed to add their little touch to some scenes, either making a shot with only one primal color, or just making fun of other works like the Monogatari Series. I found these eyecandy's quite enjoyable, and kept me from getting my eyes bored.\\n\\n\r\nThe background music wasn't really memorable, but it makes the anime flow naturally and the tracks chosed for almost every type of moment (either dramatic or comedic) really fit there. The OP was good, but I think the animation for that, even if it seems made by freelancer animators, was beautiful. Specially when they changed an element depending on its state in the story.\\n\\n\r\nAll the characters, except from Megumi and Akane, have a extremely generic surface. At the begining it was awful to see those stereotypes being reused once again, but then we fall back with they way they grow as individuals. I really like Megumi. She was weird in the first season, because of her forced lack of presence. But after the first season, her unnoticable personality came afloat. And everytime she appeared on screen, she seemed more open to others, and of course, to Tomoya. When I saw the last scenes of the last episode I really couldn't stop laughing. Megumi is my very favorite female character of this season.\\n\\n\r\nI give the anime an overall of 9 because some moments that felt off, some bad animated frames and the tipical A-1's bad 3D. But this is a really good anime that anyone can enjoy (if they watch the whole first season)",
            "date": "2017-06-22T19:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 250715,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4871999.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/linkuan",
                "username": "linkuan"
            },
            "url": "https://myanimelist.net/reviews.php?id=250715"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nIn Saenai Heroine no Sodatekata ♭, Utaha is a writer. Or, as she may say, a creator or creative. And I view myself in the same way.\r\nI started writing officially as a critic, reviewer, and essayist about three-and-a-half years ago now. I’ve written hundreds of pieces, thousands upon thousands of words. It’s technically not my career (as much as I dream it to be), but I see it as an extension of myself and not just any other fun aside of mine (because of the seriousness with which I pursue this field). Thus, I existwithin this quasi state of not quite a professional yet more than just a hobbyist. Either way, I’m a creator all the same.\\n\\n\r\nBeing a creator brings with it certain challenges and caveats that may not be immediately noticeable to somebody who is not. Sodatekata Flat (ditching the symbol from here on out since it’s a pain to copy-paste it constantly) understands this sentiment, presenting a sequel that surprises in its newfound direction.\\n\\n\r\nSTORY\\n\\n\r\nAs a sequel to the semi-popular first season of the Sodatekata anime, Sodatekata Flat brings the audience back to greet some familiar faces. Utaha, Eriri, Megumi, and Tomoya, the majority members of their doujin-circle company titled Blessing Software, continue work on the visual novel that they have worked tirelessly to complete. However, the anime has conflict on the horizon for this hodgepodge group.\\n\\n\r\nFor starters, this season is no longer an introduction but instead a continuation. So, to focus on the seriousness and the drama, Sodatekata Flat reels in a lot of its signature meta comedy. Not that it isn’t there of course. Indeed, it’s a motif that counts as one part of the foundation to the show. Characters still spout the occasional line, and they take part in those brief scenes that invoke the same sense of self-awareness just like the good old days.\\n\\n\r\nTake some dialogue from Utaha. After she and Tomoya finish watching a movie while on their “date,” she ribs the very anime she finds herself in: “The script was completely clichéd, but they’re able to get away with it because of the good art and performances.” Another (rather on-the-nose) example comes later on. A friend of Tomoya’s, frustrated by the fact that his immense luck sandwiches him between Utaha and Eriri, annoys the leading guy, leading him to remark how he now understands what a protagonist in a typical harem anime must endure from his fellow friends.\\n\\n\r\nTo reiterate, these and other comedic asides are not tossed out the window but rather reduced to give way for the all-important drama. With the extra room, said drama improves.\\n\\n\r\nTo elaborate, the first season juggled past events and current conflicts split between five girls. Sodatekata Flat instead trims the fat. It focuses on just the current conflicts split between only three girls now. Narrowing its reach in this fashion tightens the direction and execution of the drama, thereby giving it a flourish it has always wanted within this series.\\n\\n\r\nThis flourish comes through in a lot of key moments throughout the season. Utaha and Tomoya share an intimate scene together as they collaborate on the routes and writing for their game. Extra meta conversations and clever wordplay notwithstanding (e.g., “It’s already mixed in. A part of you is already inside what’s mine.”) With Eriri, their getaway of sorts gives them the chance to connect, to praise, and to apologize as a means to bolster their relationship. And a Good Will Hunting-esque moment between Tomoya (i.e., Robin Williams) and Kato (i.e., Matt Damon) occurs as he repeatedly lets her know that their fallout wasn’t her fault in the slightest.\\n\\n\r\nOn top of the drama, Sodatekata Flat also includes a couple of narrative choices that further keep the show in good graces. Icy Tail, the band from last season, make an appearance in this season to provide extra hands during the swift prototyping of their game. The title of Tomoya’s second game ties back to this anime for the ultimate-meta detail: “How to Raise a Boring Girlfriend.” The final episode includes a full-circle finish during the recreated date with Kato when they go back to the same mall visited in the first season.\\n\\n\r\nAbove anything else in the anime, it hones in on a somewhat niche theme to strengthen its backbone. The very first episode of this second season establishes the idea almost right away. It tells a tiny tale on the origin of Utaha and Eriri’s distaste yet appreciation for the other. The episode’s angle can be summarized as “separate the art and the artist.”\\n\\n\r\nWith this proverb in mind, Sodatekata Flat carries it along throughout the entire season, placing emphasis on the relationships between Tomoya and the three girls as they collectively finish their shared project. He challenges Utaha’s work despite the clear implications behind its construction. He respects Eriri’s artistic space to a detrimental degree twice over. He fails to recognize Kato’s contributions overall. In other words, separating the art and the artist isn’t such an easy task when those involved are the very people one holds most dear.\\n\\n\r\nRemnants of this theme exist in the last season too, especially with Utaha’s characterization. But, because of that tighter focus and because of the increased importance on the drama, it takes on a much greater role and purpose throughout this season.\\n\\n\r\nSodatekata Flat does trip up on a couple of specific details. Both the competition subplot with Rouge en Rouge and the eventual “evil” producer named Akane do not themselves earn too much in the way of involvement, context, and tension. They (understandably) take a backseat to the interpersonal drama of Tomoya and his group. However, while it may not seem like much, a lot of the drama stems so heavily from that subplot and this character. So, unfortunately, said drama doesn’t reach the pinnacle of its trajectory. To clarify, the events and outcomes are nice to see, but the foundation is less solid than it intends to be.\\n\\n\r\nPotential problems aside, Sodatekata Flat has a good story here. By delivering tighter drama and a centralized theme, the show pushes past its harem-comedy roots, giving the audience something interesting and different to behold when compared to its already well-liked predecessor.\\n\\n\r\nART & ANIMATION\\n\\n\r\nSodatekata Flat carries over the same artistic direction as it used in its first season.\\n\\n\r\nFor instance, some frames will still take on colorful gradients as a means to spice up the general look of the anime as Tomoya and the others talk with and amongst each other. It also brings back many a camera angle to play around with. From a low shot looking up at Utaha as she steps on and digs her foot into Tomoya (and by extension the audience) to a faraway capture of him and Kato within a recording room, the cinematography further ups the visual appeal.\\n\\n\r\nReturning also are the different risqué shots of the girls, like Utaha sprawled out on her bed in nothing but a bath robe or a centered shot of Kato whose loose shirt exposes the top of her breasts as she lifts herself up while laying on her stomach. This season clearly favors the drama more so than the comedy, so, while these shots are no doubt titillating, they are not as appropriate with Sodatekata Flat sinking its teeth into seriousness.\\n\\n\r\nNevertheless, the anime does even more to flair itself up. Certain comedic sequences will border the screen in manga panels. Very emotional moments throw floating paper into the air as a couple of characters cry together. Classic cherry-blossom petals signal the start of a new beginning as two other characters vow to not give up despite the recent difficulties life has thrown their way.\\n\\n\r\nMoving on, background art once again does not extend too far beyond Tomoya’s room and their school, but a cottage of sorts in the woods and locales within the city change up the environment when and where they can. The static setting does invite better actual animation, though. Utaha violently tapping her heel out of frustration, Eriri harshly slapping Tomoya with her twin-tail hair, and Megumi subtly jiggling her thigh with her phone as she sits and waits are just a few small examples that demonstrate the solid movement of the characters’ actions.\\n\\n\r\nAnd as one last carry over, the designs of said characters maintain their attractiveness. Utaha’s bodacious looks, Eriri’s slender figure, Megumi’s plain yet cute appearance. All their different outfits add variety, and their striking eyes greet the audience, too.\\n\\n\r\nYes, the artistic direction does stay the same. But, thankfully, that’s clearly a very good thing.\\n\\n\r\nCHARACTERS\\n\\n\r\nIn Sodatekata’s first season, the characters of the show brought with them a lot of personality and fun that equated to a stronger anime overall. In Sodatekata Flat, their characteristics have not left. But, much like the story and its focus on the drama, they earn more in the way of development as people rather than whatever comedy they create.\\n\\n\r\nNowhere does this increased focus apply more than with Utaha and Eriri. Both girls are experts in their respective fields of writing and drawing, and both girls still vie for Tomoya’s attention whenever and wherever they can. So, the show challenges these two details.\\n\\n\r\nFor Utaha, much of her character centers on what she describe as “a dour, vindictive, and awful woman.” Knowing of her impending separation due to graduation and light-novel business, she indirectly approaches Tomoya about his true feelings of her as she submits her writing for their game. Tomoya’s non-answer at first infuriates and then saddens Utaha, for not only does it denounce her skills but also it avoids giving her what she really wants: him. But they work through this hurdle. His words about wanting everyone to be happy in the end resonate with her, and her words on their combined creation touch him. The two grow closer as a result.\\n\\n\r\nFor Eriri, she does what she can to keep tabs on Utaha’s advances with Tomoya and builds a friendship with Megumi that stands as its own outlier of sorts among all the relationships present. Most importantly, she struggles artistically. As the deadline for their game creeps ever closer, she slows down and frets over the possibilities. So much so that she collapses from mental exhaustion – in wanting to create something brilliant and in needing Tomoya’s belief in her. She earns both (despite “losing” in the contest with Izumi). The two grow closer as a result.\\n\\n\r\nThat’s individually. Together, they grow closer, too. In the beginning, the anime depicts the multifaceted nature of their relationship. They bicker and quarrel over Tomoya, but they have a deep respect for their works. Eriri awes Utaha with her immaculate paintings, and Utaha forces tears out of Eriri as she reads her pristine passages.\\n\\n\r\nYet Eriri calls Utaha’s writing “calculated,” and Utaha calls Eriri’s drawing as fueled by nothing but “revenge.” Meaning, while they may hate each other, and they may simultaneously like each other’s works, they also have a deeper connection than they may not have ever realized in the purpose behind their drive.\\n\\n\r\nOver the first half of the season, they continue on their own paths. Utaha pens some of the final writing of their game as made by “Aki Utako,” taking part of her own penname and melding it with Tomoya’s real name as a fantasy-come-true for the passionate young woman (much to Eriri’s chagrin). But she also tells Tomoya that she wishes to work with Eriri again, for, despite their differences, she cannot ignore Eriri’s incredible, moving talent. As for Eriri, she finds a brand-new style that goes beyond her normal capabilities, and she finally has a stronger bond with Tomoya that she has also never had before. But she seems to hit a slump, for she has gone weeks now without drawing or painting anything.\\n\\n\r\nIt all culminates as the personal and the passion collide.\\n\\n\r\nUtaha is tasked with the unfortunate role of declining Tomoya’s invitation for his new game idea. Her heartfelt apologies give way to a set of flashback scenes. In said scenes, when pressed about her slump, Eriri yells at Utaha. Hard. She says how whatever she draws for their circle will not be personally beneficial anymore and that she already has Tomoya’s sympathy which means she really does not need anything else.\\n\\n\r\nThen in barges Akane Kosaka. She invites both Utaha and Eriri to work on a historic project she has lined up. They read the outline – and it floors them. Akane instructs them simply: die. Die for this project. Put everything they have and then some into this game to make it the best thing anybody has ever seen. She even goes so far as to belittle Utaha and Eriri. For the former, she’s only on as a babysitter of sorts, to keep watch over Eriri since she, not Utaha, is the only one who really must be onboard. For the latter, she not only berates her for her self-inflicted woes but also recreates her new incredible style, letting Eriri know quite harshly that she still has a long way to go.\\n\\n\r\nUtaha, having already voiced her opinion to Tomoya about following Eriri, leaves the final decision up to blonde illustrator as to whether they enlist themselves after hearing the proposition and that mean woman’s harsh words. In a gripping, dramatic moment, Eriri sacrifices the personal to pursue the passion in earnest. Akane’s insults get her completely out of her slump, but, in doing so, she has betrayed Tomoya once again. That, despite his compassion for her, she cannot be with him if she wants to attain higher heights. Utaha comforts her, detailing how this time she will not be alone, that she is complicit in this betrayal. For she, too, has something to prove to Akane: that underestimating her abilities will be the biggest mistake of that woman’s life.\\n\\n\r\nThis moment in Sodatekata Flat is arguably the most wonderful in the series to date. For three reasons. One, it strengthens the relationship between these two rivals into that of friendship when they have been honorary acquaintances at best for nearly two whole seasons. Two, it pushes them away from Tomoya, their anchor, as a means to demonstrate development of their characters. And three, it not only explores what a creator must forego in the pursuit of his or her passion but also ties back to the story’s “separate the art and the artist” theme by separating their own individual art and artistry in an introspective sense.\\n\\n\r\nAnd so, on amicable terms, Utaha and Eriri figuratively break up with Tomoya – but not outright or even forever. Eriri takes Tomoya’s glasses as a memento to keep on her new journey, and Utaha turns Mr. Ethical into Mr. Unethical, sharing their first kisses with each other. The wording and the ending even hint at their soon-to-be return. After all, there’s no reason why they can’t ever come back.\\n\\n\r\nIn other words, they don’t really, fully separate from Tomoya. That seems a little unfair insofar as it defeats the purpose of their development as characters. Yet that would also not make much sense since it has been established without a shadow of a doubt how important he is to them on every level imaginable. Plus, the anime’s skill in flipping this dramatic event into a comedic one without missing a beat – Utaha’s “I will give up on giving up” is seriously hilarious – stays true to their characters while still progressing them forward with and without their beloved.\\n\\n\r\nFor all intents and purposes, Sodatekata Flat is Utaha and Eriri’s story. What about Megumi, though? Yes, her lower presence in the anime fits her characterization quite well, but she doesn’t go without focus.\\n\\n\r\nIndeed, the anime spends a lot of time highlighting how Megumi isn’t as “boring” as she may appear. She demonstrates her passion when she runs off the train to get ready to work on their game for the whole weekend. She expresses concern for Eriri as she lives for a time away from home to work. She gets mad at Tomoya for not including her in any of the troubles encountered. She cries at his sincere approach in mending their relationship afterwards. She acts all cute at his place when cooking, bathing, and sleeping, something so uncharacteristic of her that she asks him to forget what she did that day. She suppresses laughter (as best she can) towards his “stylish” new glasses (that she herself picked out for him).\\n\\n\r\nComparatively, the first season somewhat casted her as the normal girl who accentuates the oddities of the others and supports everyone from the sidelines. In this season, Megumi very much becomes her own person. She evolves away from that flat personality and into a rounder character – all while still delivering on those passive-aggressive comments. To put it differently, she may be “boring,” but she is anything but.\\n\\n\r\nAnd what of Tomoya himself? Truth be told, he’s the weakest of the main four. With the conflict involved stemming from and pertaining to each of the girls, he doesn’t have much going for him throughout the season. Even so, as already gleaned, he plays the harem-protagonist role well, helping each girl as best he can and building his relationships in different directions. Moreover, they help him. Utaha, Eriri, and Megumi either give him the room he needs to blossom into a phenomenal creator or support him when he clearly needs it most. Thus, in this story that focuses on three other main characters first and primes him for the final leg of his arc later, Tomoya receives just enough relevant attention to make his presence worthwhile.\\n\\n\r\nOne last footnote (since it makes sense to call her that): Michiru. What a complete waste of a character – is what would be fair to say if the anime failed to address her at all. Barring a quick interlude at about the halfway mark of the season, she finally appears right at the end when the audience has most likely already written her off at this point in time. True to form, Utaha and Eriri throw meta comments her way about how she has been gone for the entire second half of the season and how she only now shows up in act three of the finale. It not only makes for a smart joke but also covers the show’s bases in the nick of time.\\n\\n\r\nDisregarding Michiru (which is what the anime would most likely want anyway), Utaha, Eriri, Megumi, and Tomoya clearly experience a lot within this season. Development of their characters, growth in their relationships, key moments to pinpoint, better writing overall. All while staying true to themselves. Altogether, they are arguably the best aspect of this whole second season.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\nFor some anime, voice acting dominates with pure, notable technique. Sodatekata Flat once again finds itself in this category for each of the four main characters this season. Ai Kayano as Utaha delivers sultry and angry tones when and where needed. Saori Oonishi as Eriri cutes and embarrasses her way to victory, and her need to say “Utaha Kasumigaoka!” when addressing or referring to her rival still brings a chuckle every time. Kiyono Yasuno as Megumi refrains from inflecting any emotion into the plain girl’s voice until absolutely necessary. And Yoshitsugu Matsuoka as Tomoya hollers, yelps, and cries like the best of them.\\n\\n\r\nThe VA performances take the crown, but some of the sound-effects within the anime also deserve a shoutout. From the weird bird noises Utaha and Eriri let loose as heard by Megumi and Tomoya from afar to a the fast forwarding of a tape as the afternoon blazes by, the show’s sound-effect game is on point for the majority of its run.\\n\\n\r\nUnfortunately, after the VA performances and some of those sound-effects, the quality of the audio cannot keep up (a hard task really). That is to say, much of what the audience hears does not usually go anywhere too interesting.\\n\\n\r\nThe original soundtrack sounds the best of what remains of the bunch. It has a slow, guitar track for those semi-tense times. Bass and snapping for when a lackadaisical groove is required. And a light yet “heavy” set of acoustic strings caress the rarer serene moments that dot the anime. Nothing here stands out in a major way, but these songs from the OST support Sodatekata Flat nevertheless.\\n\\n\r\nThat just leaves the opening track and the ending track. Much less impressive, this combo of music does not have too strong of a foothold.\\n\\n\r\nThe OP, “Stella Breeze,” takes on a more whimsical vibe with its dainty instrumentation and optimistic tone which somewhat clashes with the heavier drama of the season. Moreover, the vocalist can’t quite nail those nuanced notes when necessary. It’s at least a catchy song, especially in the second half, so it’s not a total loss on the show’s part.\\n\\n\r\nBy comparison, the (main) ED, “Sakura-iro Diary,” is even less daring. It does incorporate piano into the mix and extra vocalists to spice up the lyrical delivery. But still, its straightforward beat and simplistic nature create a rather mundane offering that is certainly not as intriguing as the content that precedes it.\\n\\n\r\nThankfully, those VA performances shine bright, so the grievances with the lagging music across the board do not damper the experience as much as they normally would.\\n\\n\r\nENJOYMENT\\n\\n\r\nAs a creator, this anime spoke to me on some level.\\n\\n\r\nI do not claim to harbor the same skills as Utaha or Eriri. People the world over do not admire my talents let alone hand me job offers that nobody in their right mind would refuse. However, as a writer myself, I understand the struggle.\\n\\n\r\nI’ve seen maybe one other anime tackle the woes of an artist, but seeing it here regardless let me relate to what they went through. I have written pieces that do not reach my own personal standards. I have been through slumps (i.e., writer’s block) that prevent me from doing what I love to do. I have foregone situations personal to me in pursuit of ever grander heights.\\n\\n\r\nAnd that’s why this whole outcome stings more than it probably should. Utaha is my favorite character in the show for the snide bombshell she is, so I obviously want her to win. Yet it’s obvious who is supposed to win in the end (she and Eriri say as much back in the first season).\\n\\n\r\nSo I (read: everyone) already knew it was coming. It didn’t lessen the blow any less, though. Seeing her leave the circle, pursuing another project without her beloved, put me in a conflicted mood for quite a while. It makes me sad to see friends and relationships and people split apart. Be they in real life or from so many episodes and hours of an anime.\\n\\n\r\nBut it was all amplified by the fact that I knew her choice was correct. Her staying and winning is the happily-ever-after route that just doesn’t make sense given the show’s aims. Indeed, while I am mostly ambivalent towards Eriri, her similar struggles made me sad to see her defeated, too, despite how much she did not want it to be so.\\n\\n\r\nThus, my first reaction was disappointment – in them for moving on and in the anime for not giving me that happy ending. But, again, after thinking on it more, that disappointment turned to acceptance. The creator in me knew it had to be this way. On a story level, a character level, and a realistic level. As they say, “the truth hurts,” and that just about sums it up.\\n\\n\r\nOr at least, it should, for part of me justifies their paths. They aren’t going anywhere, and it’s not like they can’t visit each other when they want. More importantly, reviewing this season so late benefits me nicely, replacing that acceptance with cautious optimism. A brand-new sequel-finale movie was announced just back in December of 2017, and, literally just the other day, phrasing about an “alternate route” have surfaced.\\n\\n\r\nWill any of this mean anything in the end? Who knows. Until then, Utaha and Eriri will be more absent from Tomoya’s life and from the story than how I would prefer. Which just makes me for sure invested in wanting to see how this tale will officially conclude.\\n\\n\r\nSaenai Heroine no Sodatekata ♭ demonstrates that a sequel can trounce its predecessor. The nice artistic direction and the passable music remain the same, but the better drama and the stronger character writing make for marked improvements that elevate the series to a higher level. No caveats attached.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, “separating the art from the artist,” the narrative’s tighter focus on drama and the different events throughout the season craft a tale that goes beyond its harem limitations\\n\\n\r\nArt & Animation: Good, tons of flair from the stylistic presentation and the varied cinematography back the attractive designs and the nice level of movement\\n\\n\r\nCharacters: Great, Utaha and Eriri sacrifice the personal for the passion as their defined arcs play out, Megumi grows into her own person, and they reciprocate Tomoya in turn\\n\\n\r\nMusic & Sound: Fine, wonderful VA performances make up for a weak OP-ED combo, the OST aids the drama well enough, and the occasional sound-effects are appreciated\\n\\n\r\nEnjoyment: Great, fun to see the characters back again, but, most importantly, it was a more impactful experience than thought possible, especially as a creator\\n\\n\r\nFinal Score: 8/10",
            "date": "2018-03-19T16:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 274319,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=274319"
        },
        {
            "content": "I am new to anime, but so far as i live i only interested in watching a Action, Sci-Fi, and genres related to that, i didnt watch any love=comedy or harem anime because its boring? really i cant stand watching an \"everyday life\" of someone, why dont u just do it in real life? but this one is an exception i dont know you all veteran think but this anime draw me to watch it from season1 to 2 and i hope it get season 3 as well as i dont want the story to be end so soon (23 eps included season 1 but,well)\\n\\n\r\nStory(9) :\\n\r\nThe story you could say in real life it was a normal one like, joining a club, and creating the game together. The differences is when the club(produciton house) is all girl and got only 1 boy and all the girl character has its own background story with out main character and try to show their appeal in their different ways\\n\\n\r\nArt(10) :\\n\r\nThe Art is amazing! The coloring and that building details, the light around the saenai world the style of clothing that is so variable and the background so-realistic make me realize that they do take this anime seriously, the character all was shining in the world of saenai that they create even the side character were all beautifull\\n\\n\r\nSound(8) :\\n\r\nwell for standarn sound for every sound in the saenai world are all good nothing missing its sound, GLISTENINGb by Megumi really fit for climax, it is good but other song didnt move me, only one song that move me.\\n\\n\r\nCharacter(8) :\\n\r\nI heard that the character are mocking of Tsundere, Yandere, Kuudere and somewhat like that??? Well if they are then maybe its basic personality, but in some way the character here are different and is unique compared to other anime with that personality, well who know? i didnt watch other anime about school romance, what i can say is they do really know how to create cute girl and appealing personality that can move your heart(mine)\\n\\n\r\nEnjoyment(9) :\\n\r\nLike i said before, well i didnt bored watch this series so i could say yes. I Really enjoy this series it well made\\n\\n\r\nOverall(9) :\\n\r\nWell i can say that this anime is worth to watch. They(One Main heroine) do sometimes critize about the anime itself witch is that the creator know that they was not perfect afterall that means they're humble and tries their best to create this anime. So if you havent watch this anime yet. Time to Order the Blu-Ray ^^",
            "date": "2017-06-24T14:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 250896,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6342048.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Strainn",
                "username": "Strainn"
            },
            "url": "https://myanimelist.net/reviews.php?id=250896"
        },
        {
            "content": "I have a hard time really coming to terms with the impact that this anime left on me after watching it. I've been gracious to a lot of anime over my time watching, but nothing has ever been the completely 10 out of 10 that Saekano Flat ended up being. The first season was good, and I expected more of the same...and got something a lot better. I don't really think I've ever watched something western or otherwise, whether is be a cartoon or live action product, that had a story that looked as good as it was told.\r\nI didn't know I had been cravinga ecchi harem that would subvert being over sexualized and comedic, but low and behold, watching Saekano showed me I truly was. The way these character's stories intertwined, the way it treats having a creative mind, and taking your abilities seriously...It worked so well together. Plus, on the romantic side of things, it's incredibly satisfying to see an anime where there are several women you could see the MC end up with and actually be completely fine with any choice.\\n\\n\r\nI have a hard time even thinking up the words to bring this program justice. That's why I will keep it brief. Watch Saekano Flat. Watch Saekano 1 as well. Open your mind to a story about friendship, coming to terms with your feelings, the uplifting nature of seeing others succeed, and being the best that you can possibly be in your field of choice.",
            "date": "2018-04-11T05:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 277728,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6350505.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cpman",
                "username": "Cpman"
            },
            "url": "https://myanimelist.net/reviews.php?id=277728"
        },
        {
            "content": "Alright I got suckered into it.\r\nI really loved this show even more than the first season. It repeated what it did well in the first season (analogies to the anime, light novel, and gaming industry) while also improving on what it lacked in the first season (the story is an allegory to the industry, but it also works well as its own standalone story). Two things I think came together to make this season a success:\r\nCharacter: I still can't get enough of Megumi Kano. After this, she's going on my character list, because I was enthralled by her. It could just be that she's acharacter I don't really see often. She's intentionally boring, but that also makes her outbursts and spurts of emotion that much more captivating. The minor shifts in how she acts absolutely contributed to her perception as a character, and they didn't need over-reactive animations to do it. Additionally, characters grow throughout this season and progress to new positions by the end of it. These changes weren't necessarily \"good\" for everyone involved, yet they were natural and almost sadly (in a good way) expected.\\n\\n\r\nThe Narrative: Each arc or sub-plot directly tied into something related to the industry. Past that, characters often have recurring roles related to these different industry happenings. Toyomo obviously represents the ideal consumer, the two artists represent the creators, and Megumi much more of the passing audience. Each of them has a different idea of what makes their products \"work\" yet it's hard to keep all their concepts together at one time. One might point out schedules as a good motivator, while passion seems to be more effective to another. I found myself touched at both what these characters had to go through as people, but also as producers who want to see a project come to fruition.\\n\\n\r\nFor me, this series was a hit outta the park.",
            "date": "2018-03-26T19:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 275256,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6874523.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AmericanSomnium",
                "username": "AmericanSomnium"
            },
            "url": "https://myanimelist.net/reviews.php?id=275256"
        },
        {
            "content": "Ok, so I've just ended the sequel of Saekano, and thought it might be cliche at one point it  does have some development of sorts, and here'show I rate it:\r\nGood 7, Story:\r\nIt may have it's share of cliche but, in this sequel it has a certain degree of development, where we see, the break up of the Blessing Software group, that starts when Utaha graduates and when a new girl, Izumi arrives as one girl leaves, what adds to my rating was seeing Eri leave the group and this is where Mr. Ethical starts to contemplate as he struggle to move on without the2 most valuable members of his group, not surprising since this anime story plot revolves around a philosophy theme, that things would not always stay the same whether you like it or not. \\n\\n\r\nfair 6, art:\\n\r\nOk so there were some indications of them girl looking very bitchy with their school uniforms, the characters maybe the same, but don be expecting to see some of Eri's panchira moments nor see anything else that would titillate your adrenaline.\\n\\n\\n\r\nMediocre 5,  Sound:\\n\\n\r\nOk so it was the same seiyuus who did the voices of them characters, so what? I don't both like closing and opening themes.\\n\\n\r\nVery Good 8 , characters:\\n\\n\r\nNow that we see some development , we can't ignore the other added characters in this sequel like the antagonist  Akane Kosaka who was instrumental of making both Eri and Utaha do more better, but there were times that the competitions for the Blessing Software group were annoying and overrated, but then again it does make their role good, also seeing the part where the relationship between the 2 girls and Mr.Ethical becomes more on a certain romantic degree, but it was Megumi who mad such impact in fact she is the only one who remain with Mr. Ethical all throughout despite of the fact that she just a mascot or just a model for Eri's illustrations, though I would have love to see some of that arc between her and Mr.Ethical develop into a more romantic sense. But then again being this boring girlfriend it was just enough that she has to keep him guessing so basically my score was for her alone. But it was quite unfair that Michru was push aside was given a very short supporting role, she could have added something if only original creator Misaki Kurehito did something about her character.\\n\\n\r\nfair 6, Enjoyment:\\n\\n\r\nFrankly, the whole nine yards of this sequel can be pretty boring at times , and there were times that just watching it can be a chore, but once I've got to the few last episode that is were  my interest peaked up.\\n\\n\r\nVery good 8, Overall:\\n\\n\r\nOk, so seeing the Blessing Software group break up before they can even continue making more success because of Utaha and Eri's plan to go to the other side for better challenges was disappointing , but it wasn't always that we get to see such disappointment of the part of Mr. Ethical when 2 of his most valuable assets go to the other side that has served as a rude awakening for him to let them go and move on so that he can do better, so basically  that was disappointingly very good, even though  both Utaha and Eri missed their train that was nothing more of a comedy gag, so don't expect an season 3 of this thing since it wouldn't be a good fit. \\n\\n\r\nPres.Thrump OUT!!!!",
            "date": "2017-07-08T12:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 252288,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=252288"
        },
        {
            "content": "(This review will contain spoilers so don't read it unless you've finished the anime)\r\nSaenai Heroine no Sodatekata (A.K.A Saekano), oh what a nice little series you have been. As soon as I heard there was going to be a second season, Saenai Heroine no Sodatekata Flat, I jumped for joy. More of Mr. Ethical and his harem mucking about just trying to make a dating sim, or so I thought. At first, most of us had thought that there would be your typical competition for the main protagonists, and there was, but we never would have thought that we would receive an ending like that.\r\nBeforewe get to that certain ending, let's start off with the story structure itself. It progressed rather nicely although I did get a little confused with the flashback of visiting Akane. It's not some fantasy with secret powers so there aren't really any plotholes or unexplainable things to talk about. Even though it took quite the serious turn, the story overall is rather plain as it is a typical \"harem\" anime, but what it lacks in story it makes up for it in character development. Now, I know what you're saying, \"But if the story isn't all that good, what's the point in having developed characters in such a boring environment? It's like buying a car only to have it sit in a garage.\" It only seems that way at first and I'll admit I got a little bored too, but once they started adding in parts where it's just Tomoya and one of the heroines it starts to get exciting and here's why:\\n\\n\r\n1) The relationships start to take more of intimate form. Ships that had set sail had now nearly reached new shores, especially with Utaha-senpai. \\n\r\n2) It foreshadowed the reason why Tomoya had held Eriri back from bringing out her full potential.\\n\r\n3) It's more of a preference, but it allowed us to see some of favorite ships sail strong.\\n\r\n4) The way you can see Katou's personality changing is cute and almost like watching a child grow up.\\n\\n\r\nThe art is rather pleasant and started to look more dramatic as the episodes progressed and lost the fan service touch in my opinion(not saying it was a bad thing). I feel the legs of the heroines were kind of plain and shave been done better, but I'm not one to judge because I can't draw limbs good.\\n\\n\r\nAnyways, back to the nearing end of the anime, I nearly started to cry. It made me feel like taking a dark path towards alcohol and becoming a NEET. I kept on hoping and praying that they wouldn't join Akane and I thought it would be cliché and they would stay with Blessing Software, but as soon as I saw that Eriri could draw again after being insulted, I knew it was over. I knew that they wouldn't stay with Tomoya forever. I knew that Blessing Software would never be the same again. It is quite the feels trip. I lost it when Eriri said that she wouldn't be able to draw anymore if she had stayed with Tomoya. It was like she had broken up with and would move on and bury him in the last.\\n\\n\r\nWhen you become a leader, you can't be too soft towards your partners or else they lose the reason to keep trying and improve. They'll lose the reason why they chose you. Tomoya had learned this the hard way and lost his two most important members of his Circle, but now that they're gone all he wants is to see them be the best they can now that they aren't being held back by him.",
            "date": "2017-06-30T17:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 251578,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MrFeelsTrain",
                "username": "MrFeelsTrain"
            },
            "url": "https://myanimelist.net/reviews.php?id=251578"
        },
        {
            "content": "Since this is my first review it's not going to be as polished or as detailed as others, but I had a strong urge to write a review after watching the latest episode.\r\nFirst of all, I'd like to point out that despite the cliche and typical character designs, there is still that hint of spice added in which I'll build on later.\r\nArt:\r\nI don't really see any differences in the art compared to last season. Same, clean and pretty art. Not spectacular but not bad at all. I don't really have an eye for art in anime but I feel like it's good.\r\nStory/Character:\r\nThe story continues offfrom the first season (obviously) but the tone has completely changed in my opinion. Despite all the fan service and light comedy, the story has become much more serious and built upon. Last season, everything was more casual and although there was character development throughout each episode, there is definitely more going on this season.\\n\\n\r\nWe already know that each heroine has feelings for the main character, but we didn't know how strong their emotions really were. In this season we see Eriri and Utaha thoroughly built upon. We see them cry, smile and their actions that they take in order to win over the protagonist. Each of these scenes tugs on my heart strings as if you are that character suffering. You start to sympathize and actually relate to them in contrast to the earlier season. \\n\\n\r\nHowever, despite their strong emotion and such. We really start to wonder how on earth the protagonist was capable to woo these girls. Each episode we see pathetic little Tomoya doing his thing. Unaware of these girls feelings. He lacks development and it's like he's only there for comedic relief. I honestly dislike the protagonist and wish he actually had some talent except his otaku passion. He continues to stress me out with his actions >:(\\n\\n\r\nAlso, the story constantly shifts from positive to negative. The changes are abrupt and sudden and the theme of the anime blurs. Happy??? or is this anime meant to be serious???. I don't really know but I'll keep watching it because I like the heroines hehe XD.\\n\\n\r\nSound:\\n\r\nSome nice music at certain bits that strengthen the scenes. The sound is just like most anime. Happy and upbeat at happy moments and vice versa.\\n\\n\r\nEnjoyment:\\n\r\nI wouldn't watch this on it's own. I'm currently watching while doing my assignments and it's alright. When some scenes pop up I'll watch for a bit. Ehhh, really a big dissapointment, I liked how they changed the tone of the anime but, not really working out.\\n\\n\r\nHard to believe but, if they just kept the easy going friendly harem route then it might actually be better than it is now.",
            "date": "2017-05-13T21:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 247626,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mustemploy",
                "username": "Mustemploy"
            },
            "url": "https://myanimelist.net/reviews.php?id=247626"
        }
    ],
    [
        {
            "content": "### Story (8.5/10)\r\nThe story was pretty entertaining, but I'm predisposed towards the slice-of-life genre, especially the niche of talented individuals working towards a goal. The fact that the MC, Tomoya-kun, has so many girls lusting after him is only semi-convincing, given his lack of talents or a particularly riveting personality (although he does have a certain passionate aura, he's still just a closet otaku). But what's even more annoying is Tomoya's complete inability to detect the subtle and not-so subtle cues from these girls who clearly consider him more than a friend. Tomoya is a massive otaku, and that he fails to realize that thesechicks are into despite the countless light novels, dating sims, and anime, is just hogwash. It's like he's long since given up on the hopes of being liked by \"3D\" girls, or just doesn't care enough, but that's still not an adequate explanation. Of course, that's my only major nitpick with the show's plot; for the most part, it's still very entertaining.\\n\\n\r\nI haven't watched enough anime to make any comparisons, but the cinematography stands out. This is a dialogue-heavy show, and the viewer is kept interested by employing a variety of camera angles -- the character's face is often eschewed for their stockings, feet, or chest regions.\\n\\n\r\n### Art (9.5/10)\\n\r\nThe art is amazing! The show is entertaining to watch in no small part due to its fantastic art style, with vivid colours and strong hues.\\n\\n\r\n### Sound (6/10)\\n\r\nThe soundtrack wasn't as noteworthy as the other aspects of the show. It's not bad by any means -- some of the OP/EDs are decent. It's just not remarkable.\\n\\n\r\n### Characters (7.5/10)\\n\r\nThe characters are well-developed, albeit trope-y. The show relies quite a bit on tropes, and it does border on the cliche at times, but the occasional meta-humour coupled with the sheer amount of tropery makes it mostly forgivable. \\n\\n\r\n### Enjoyment (9/10)\\n\r\nThis was a really enjoyable watch. After watching the first season, I expected the second to be an okay cash-in, but it exceeded my expectations. Personally, I'd recommend skipping Episode 0, the fanservice episode, because it was enough of a turn-off that I almost gave up on the show. But your mileage may vary.\\n\\n\r\n### Overall (8.5/10)\\n\r\nOverall, I'd give it an 8.5/10. I have biases both towards and against the show, so if I had to be more cautionary, I'd give it an 8.\\n",
            "date": "2019-04-03T13:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 305344,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2144071.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Xitakz",
                "username": "Xitakz"
            },
            "url": "https://myanimelist.net/reviews.php?id=305344"
        },
        {
            "content": "Saekano.. I can't say I had high hopes for season 2, but I was definitely hoping for at least an improvement from season 1. And boy was I disappointed. If anything it's a downgrade, which is frustrating considering so little romcoms get a season 2.\r\nFirst off, the show picks up after the events of season 1 which, is fine and all until the events unfold and you realize there's no development of any of the characters.\r\nTomoya Aki- The same seemingly passionate yet also dense, boring, pet MC who continues to rely on girls who only want one thing from him: his c o c k.\r\nEririSpencer Sawamura - The same overdramatic childhood friend who cries for her prince charming to worship and cater to only her...Despite not giving a hoot about his own aspirations.\\n\\n\r\nUtaha Kasumigaoka- The same \"older\" character on this show who also doesn't care about the MC's aspirations and is only good for......fanservice?\\n\\n\r\nAND the best girl on this show(not much of an accomplishment) Megumi Kato-\\n\r\n.............. not much to say about her, she's still the same emotionless 3rd choice who's only relevant when the other two girls aren't in the picture. \\n\\n\r\nSeason 2 is a repeat of season 1 which is a downgrade because it's like watching  an already average TV show for the second time.. You can't help but notice all the bad and overdramatic/lackluster plotlines. Add that to increasingly unlikable characters, an unhealthy amount of fanservice, flat out wasted screentime, and a random/rushed plotline 9 episodes in and you'll come to this conclusion: Saekano season 2 is horrible. On a positive note, the art is done well so at least they didn't cut the budget for the one thing they had going for them. It's a shame that the art was wasted on such a dumpster of a show though. \\n\\n\r\n**SPOILER***\\n\r\nIn case you're looking for a summary of the plot it's as follows: Tomoya wants to complete a project. Needs the \"prodigious minds\" of his two waifus to do so. They each claim their own work is more important yet simultaneously cry and moan that the MC is essential to each of their well-beings and ALREADY successful careers(WAIFU GOALS RIGHT????). The MC being the dog he is then helps each one until they're satisfied(thus consequently neglecting his own work). After being satisfied, they both leave the MC in the dust suddenly for a  once in a lifetime joint opportunity(funny way of saying thank you).  Option # 3 says some words and is there for the MC. Happy reunion a couple days later. Tomoya smiles at the sight of his dream crushed by his two girlf--- frien---acquaintan---..masters. And they all live happily ever aft...Zzz............\\n\\n\r\nConclusion: 3/10\\n\r\nActing job of Eriri Spencer as a damsel in distress: 9000/10",
            "date": "2018-08-19T17:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 286906,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 2,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ikkyx",
                "username": "ikkyx"
            },
            "url": "https://myanimelist.net/reviews.php?id=286906"
        },
        {
            "content": "How to Raise a Boring Girlfriend II is a series that had a lot of potential, but ultimately left me with an empty feeling in my heart. On one hand, it had one of the most original and dynamic anime heroines. The show handled the heavy parts well and provided balance with comedy. On the other hand, I feel like the creators could’ve explored certain plot points more. I'm aware that the trope-ish characters were meant to be two-dimensional, but I also feel that they deserved more development. Plus, I found the fanservice more bothersome than other ecchi shows with parody elements in them. It’sas if most the visuals budget went toward those scenes. Moreover, no satisfying conclusion was met with the story. I understand that this is common for anime (often for good reason), but I still consider open endings the cancer of this green earth. \\n\\n\r\nAll in all, though, Saenai Heroine no Sodatekata is pretty enjoyable.",
            "date": "2018-01-08T23:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 267997,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6656163.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TheSteelSamurai",
                "username": "TheSteelSamurai"
            },
            "url": "https://myanimelist.net/reviews.php?id=267997"
        },
        {
            "content": "Sozz, this anime's left me with a feeling I haven't felt in a long time, so to get it our of the way I might as well write a review... \r\n(please don't look at the score, MAL makes it mandatory to select a score when reviewing but honestly, I couldn't pick a score that could best encapsulate what I wanted to say about saekano .flat so please read before commenting. Thx)\r\nI'll be frank I enjoyed Saekano's first season,not because if its \"masterful\" story telling and what not but because of how self aware the show, the writers and to an extent even the characters themselves.Besides the constant references and indulgences to numerous well worn and tested troupes, the first season managed to deliver itself with a cheeky and sort of campy fashion that I personally really enjoyed. Therein lies my main gripe with the second season: the change in tone.\\n\r\nwhile the change of tone doesn't really seem to be a big deal in the first place, the \"more serious\" & \"dramatic\" tone the show takes on while simultaneously toning down its more playfully pseudo self-aware digs at itself left me feeling very sour. Having just come from a rewatch of the first season, i held the expectations that .flat was going to be more of the same. While the above might simply be a personal grievance, the change in tone does affect the overall presentation of the plot. While melodramatic confrontations aren't exclusive to the second season of Saekano, the expectations I held that the characters had/would have grown from their previous dramatic episodes (or more correctly characters arcs) from the first season left me a tad bit annoyed. You'd think that Eriri and Utaha would have straightened up their resolves so their personal problems with Tomoya wouldn't come to bite them in the ass in the future, but guess what, it does come back in the form of unnecessary melodrama. their respective arcs this season leave much to be desired and while it may be unfaithful as a direct adaptation, I'd rather have them cut out all together so .flat would have more episodes to cover the *spoilers* transition from the first generation of blessing software to the next one after both Eriri and Utaha leave. Besides that, it is made very very clear (heck its even brought over from the first season) that Kato is the main girl (or should I say heroine) of the show. That's fine and all at first, but the post winter comiket drama with kato didn't really work out because Kato for the most part played a supporting role. While this doesn't discount her claim of becoming gradually attached to blessing software, it does make her transition rather unnoticed. So when she does actually directly tell Tomoya (and the viewers) of her attachment to blessing software, it comes of (at least to me) as somewhat rushed, I mean they could have made her drop more heavier hints at the very least. What more, this further amplifies the problem of the characters \"telling but not showing\", this problem bit Eriri in the ass in the first season (her outburst at Tomoya not appreciating her efforts for her behind the scenes efforts) but it appears to not have been entirely fixed in .flat. While .flat attempts to tackle more \"serious\" themes such as creative differences, creative dissatisfaction, the way they dragged its delivery around has me prefer that they stuck to the meta humour of the first season\\n\\n\r\nI still have a bunch more complaints but this wouldn't be a review (i use that term very very lightly) I didn't touch on other aspects of the show, so lets get on with it.\\n\\n\r\nOne thing I'd like to quickly point out is the distinction between art style and animation. I appears to me at least that quite a number of reviews don't take these into account and unintentionally mush these two up into the clusterduck umbrella term \"art\". OK let's return to Saekano. The art style is bright and dynamic, with the colour pallet of the show utilising softer shades of light purple, beige and a myriad of other deeper colours for the backgrounds mainly and other uses. The character expressions are rich and do well to convey the moods of the various characters extremely well, notably Eriri's more comedic expression to express shock, annoyance and fluster. Character designs are appropriately distinct with (as the show itself notes) Eriri's short stature and yellow twintails, Utaha's busty and tall stature, Tomoya's nerdy casual attire and glasses along with Kato's medium height and lack of distinct features serving as good denominations towards their individual character archetypes. backgrounds for the most part are quite diverse and well detailed, with the exceptions of certain scenes bluring the background or having backgrounds lacking in sufficient outlines serving as minor annoyances. The animation is exceptionally smooth as is to be expected of A1, constant animation frame rates allow the for character movements to look buttery smooth, with little drop in quality bar certain scenes in the third last episode. The camera angles have a notable penchant for focusing on the lower portions (that is to say the scrumptious asses and thighs) of the female cast during more 'fanservicy' erotic scenes.\\n\\n\r\nPardon me, but I didn't really care for the sound at all. I'm neither a native speaker nor do I have any basic grasp of conversational Japanese but the sounds of the osts and the opening and ending themes weren't anything fantastic. If I had anything to complain about, it would be the inclusion of Michiru and Izumi, they practically disappear or sporadically pop up and .flat mainly revolves around the Kato, Eriri and utaha so their inclusion in the opening sequence is rather baffling. Voice acting suite their characters appropriately though it is endearingly hilarious to listen to  Matsuoka Yoshitsugu (Tomoya's seiyuu, he also voiced Kirito and Izumi from SAO and eromanga respectively) shriek.\\n\\n\r\nThe characters suite their archetypes rather well, with the exception of Iori and Akane getting on my nerves rather than leaving an ominous impression (maybe they were designed to be annoying but I digress). You'd think that the cast would have grown a tad bit from the drama in the first season and apparently they did, just not to the extent I would deem satisfactory. Tomoya is anobjectively a somewhat dolt, irresponsible and dense protagonist. Where it not for his passion, the other members of Blessing software or Deus Ex machina, the doujin project they embarked on should have rightfully crashed and burned on numerous occasions. i get that that's what his character type is supposed to be like and some might even find his flawed character to be an appeal but personally I got so annoyed at him being such a weak protagonist because he failed to change substantially. The fact that Utaha and Eriri left at the end because he didn't push them enough (even though his pushy attitude caused them a multitude of problems in the first season) just seemed so disrespectful. If one can learn anything of substantial value from Saekano, it's that miscommunication and keeping vital secrets in a collaborative effort will ultimately lead to failure and demise. with all that's said, the friendly banter and fawning over Tomoya between the cast members was mildly cute and enjoyable.\\n\\n\r\nA fair warning to viewers from the first season: do not expect it to be a one-to-one replica of the first season, it's more drama heavy. Maybe I went it with the wrong mindset, IDK, but something deep inside of me felt extremely uncomfortable with the way it ended. It clearly ends off at a point where the new arch of reforming blessing software begins, an uncannily disguised cliffhanger to lure viewers into purchasing the books. And they're not wrong to do it, that's what most modern anime are: glorified adverts to push book sales. Its just that the amalgamation or the flaws and changes from the first season left the me that waited with baited breathe for 2 years utterly disappointed, and if anything I wished I never watched it. It's far from being terrible or bad, but I'm just simply disappointed with the way it panned out. Not angry, happy or sad, just so so disappointed\\n\\n\r\nThx very much for reading. It's my first review and I have lots more to say and correct but my hands feel pretty numb at this point so I'll stop here.",
            "date": "2017-10-13T00:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 260642,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4750496.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/5syu",
                "username": "5syu"
            },
            "url": "https://myanimelist.net/reviews.php?id=260642"
        },
        {
            "content": "Aaah~ The second season of How to raise a boring girlfriend, plus flat. Where to begin?\r\nWell, first, just let me get this out of my chest: This was the A1 Pictures atempt to become Shaft and you can see that very clearly in the second episode. The scenary, the camera shots and cuts between dialogues, the change in colors just to make emphasis while they speak and the constant flip of the hair of one our heroines are pretty reminiscent of the Shaft formula. Not to mention som of the songs have the same feeling as the Ara**gi loose talks with anybody from the show.Now, while this could sound bad, it was kind of good, I really enjoy it (That's talking in Shaft terms). \\n\\n\r\nNow let's start with the review in general.\\n\r\n-Story: 7\\n\r\nWe follow our same protagonists in their adventure to make a game. Not change at all from the first one. \\n\\n\r\n-Art: 8\\n\r\nThe standard for A1, nothing too fancy, not so elaborate. Good. \\n\\n\r\n-Sound: 7\\n\r\nThis could be lower, just because I don't remember any great song or anything that makes me feel something for the show. It's just not there. \\n\\n\r\nCharacters: 9\\n\r\nThis is where the good stuff comes in, the thing that makes the series shine. It's characters. \\n\r\nWe have a good mixture of something for everybody, but some are very cliché cough*tsundere*cough so I just wanna talk about the ones that are great.\\n\r\nThis time we've seen a great deveploment in our main heroines, specially in Kato who simply took the cake, by being her. The \"most borring girl\" was the most interesting, frankly awesome deveploment for her. This alone make the whole show worth.\\n\r\nWhat about the other two? Well, Utaha-senpai was there for the fanservice and Eriri for the childhood friend paper who's depress because she can't paint anymore. They both have their problems too, but they didn't have as much impact as Kato did. \\n\\n\r\nEnjoyment: 8\\n\r\nEven though I've said some bad things of the show, there is a lot of good things that I don't explain because I'm too lazy and I like to say bad first so the good things can let you with a good feeling aferwards.\\n\\n\r\nOverall: 8\\n\r\nIt's a descent show. Nothing new. No mind-bending ending. No nothing. But you get an awesome character deveploment and that's what I think makes a  great show. \\n\\n\r\nSo if you have the time and want to, go watch the show.",
            "date": "2017-07-13T16:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 252758,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4863707.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TechnoGhost68",
                "username": "TechnoGhost68"
            },
            "url": "https://myanimelist.net/reviews.php?id=252758"
        },
        {
            "content": "I'm not used to write any reviews but after than one, something really broke me i had to do one.\r\nIt is a long time since i watched first season, but i do remember i really enjoyed while watching it. That's why i was really happy to start watching next one, but somewhere i feel like it went in a wrong way\r\nART: 9\r\nIf we were compering it to titles of eg. Makoto Shinkai like Kotonoha no Niwa or last big one like Kimi no Na wa, it wasn't special at all, but i think we can easly say comparing to modern animes, this anime sometimes hadreally beautiful scenes\\n\\n\r\nSound: 7\\n\r\n7 - good, i think its perfect word, it wasnt enything amusing, but it wasnt bad at all, it was just... good\\n\\n\r\nCharacter: 8\\n\r\nAnd here where the problem starts. We can clearly see the common types of character that usually are used in such genre and that's not a bad thing. I have to say that anime operate with those types really well. The problem is that i'm feeling like anime has a problem with their development. I feel like main hero's change at the end was too rushed, it's hard to say any difference in his character through whole anime and then on the end he has changed. About main 3 girls.... i feel like writer just changed his mind in the second half of second season. Because Utaha and Eriri as they were really interesting to that moment, later i felt like author just got rid of them and instead of them in the main plan came Megumi what was kind of shocking for me, because until then that character was kind of neutral for me (maybe its just me)\\n\\n\r\nStory: 7\\n\r\nThe hardest part for me. For sure anime tries to tell the story and move subjects which you won't see in many anime (i know maybe like 2 of them). It talks about eg. finding motivation, losing it, the reasons behind it or problems with starting as small team trying to make together something good, problems in team etc. At that part was really good..... BUT it was only 11 episodes and i feel like anime forgot about what genre is it. Especially about it's main one (even if i understand you can't blame it for not having something, it's just our way to classify it, but well... in this case it does includes it for sure) If you really hope for romance, dont watch it, because you will just get frustrated. Anime tried to build that thread but then it suddenly just dropped that for a sake of the subjects i was talking about. (not even saying that through whole anime, it had problem with it) (Well, it was maybe such problem for me because i love those kinds of anime, so i was really disappointed with it). And the last part - the ending..... right... the ending... the worst part. I'm probably the first person to hope for a good ending no matter where/what (like main character is),  but even if anime has ended with\\n\\n\r\nLITTLE SPOILER OF ENDING==================\\n\\n\r\n'everyone being happy'... i can't just look how fake it was. Probably it should be done in more episodes, it would be hard to solve, and probably not everyone would be happy, but i think no matter how big chance it was for them, not only they should talk with him or i should say tell him (because i think he would still agreed for their sake), but even if we go with route when they didn't tell him and did exact same thing as he did for Magumi, i don't think he would be so happy without even drop of being angry or frustrated. The most shocking part was how he and Megumi were so woesome in the first moment, but especially she (the person who didn't speak to Tomoya after his work with first game) forgave them so easly that betrayal (because it was exactly it). And then there comes back the romance part, what the hell was that...?! + Megumin happend to be main girl?! i think she was the last one to be her~\\n\r\nI don't remember what relations he had with Iori so i can't judge about that part when he helped him. But mainly that ending for me was just fake, nothing less, noting more.\\n\\n\r\ni really hope i won't see the scenario in the third season with his new team and then them, joing back to the studio after they will finish they work on that RPG game - as i love happy endings - for me that would be awful.\\n\\n\r\n=========================\\n\\n\r\nOverall: 8\\n\r\nBecause it was really enjoyable one, all flaws hurted me even more and with my really positive rating 8 is max i can give it, because i do feel like this anime wasted the romance it tried to connect to main idea. And with bad ending, probaby it's still pretty good score.",
            "date": "2017-07-07T18:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 252225,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/StarAlone",
                "username": "StarAlone"
            },
            "url": "https://myanimelist.net/reviews.php?id=252225"
        },
        {
            "content": "So this is the first review that I have written for any anime on this site. I found the anime to be incredibly enjoyable, more than I possibly thought it'd be. The story is rather typical and probably one of the lower points of the anime because of how common the \"We gotta make the deadline for X we've all been working on\". And this ties in with the characters in the show too, which are almost all also typical anime tropes. \r\nTomoya is an incredibly loud guy who loves his otaku culture above almost all else. \r\nEriri is the classic childhood friend who hasa history with the MC which almost all other girls don't. The tsundere.\\n\\n\r\nUtaha is the beautiful talented genius who fits the \"Ice Queen\" role of the show to everyone outside their friend group. Reminds me very much of Yukinon from Oregairu except with copious amounts of flirting. \\n\\n\r\nMichiru is a part of the MC's family who I really feel is just thrown in the mix with the other girls. Also pretty flirty, common for an anime in the harem genre. \\n\\n\r\nAnd now for the girl who I think single handedly saves the show for me. Katou.\\n\r\nMegumi is the most realistic girl out of all of the above. She is pretty quiet but is one of the most straightforward girls in all the anime I've watched. If she is pissed, she will tell MC. If she thinks he's fucking up, she will tell him without any of that dense beating around the bush bullshit that frustrates me to no end in most harem animes. I think she is the most \"human\" girl in the show, where it wouldn't be odd to meet someone like her. With her interest in MC, she doesn't act like Eriri or Utaha whenever she and MC have a nice touching moment. \\n\r\nThe characters are mostly nothing special save Megumi. She bumped my score from a 6 in character, to an 8.\\n\\n\r\nThe art style is great. A scene with Megumi in the middle of the season, really showed her expressions towards Tomoya and even though some may claim that Megumi lacks emotions, the art style and the way the animators show her face in crucial moments can shut down any of those claims. The specific scene in particular I mentioned above, sent chills down my spine after Megumi had a word with Tomoya. \\n\\n\r\nThe sound is average, they really have good atmosphere with the sound in the many close moments Tomoya has with all the main cast. Nothing exceptional but still nice.\\n\\n\r\nI enjoyed this anime heavily because it resonated with me personally, because of the main heroine and her relationship with Tomoya. I think this is a really good anime for one in the Harem genre and has many aspects of other good anime, like Oregairu. Definitely worth a watch. \\n",
            "date": "2017-06-18T16:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 250280,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5820429.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/generaldiscomfrt",
                "username": "generaldiscomfrt"
            },
            "url": "https://myanimelist.net/reviews.php?id=250280"
        },
        {
            "content": "i think, i hate  season 2 of this anime , but i will wait for season 3 , and If the animation is no season three , i will hate this anime forever......\r\nand this is the the best anime i ever watch....\r\ni will always wait for season 3........\r\nStory - 3\r\ni hate it , when i watch eps 9 and after that i lose my mood to watch eps 10-11 , but i still watched it until end....\r\nArt - 10\r\nToo perfect if that just for this suck anime....\r\nSound - 10\r\nperfect , good combine\r\ncharacter - 100\r\ntooo perfect just for this anime....\r\nEnjoyment - 6\r\ni can calm downwhen i watching it , i just want to know the end of this anime quickly....\\n\r\nOverall - 1\\n\r\nBecause the eps 9-11, i'm forget the story of this anime from eps 1 to 8\\n\\n\r\ni hope there will be season 3 of this anime...\\n\r\nthanks....\\n\\n\r\n#Saad",
            "date": "2017-06-27T12:21:00+00:00",
            "helpful_count": 0,
            "mal_id": 251231,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5128249.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 1,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Andhika_Ihsan",
                "username": "Andhika_Ihsan"
            },
            "url": "https://myanimelist.net/reviews.php?id=251231"
        },
        {
            "content": "After watching its two seasons, I can comfortable to say that it's pretty watchable. I actually quit this anime few years ago because  of fanservice and I find it pretty boring to watch. When I tried watch it again, I think that with its flaws and all, I think it's much better than any other trash anime out there. The fanservice didn't annoyed me as much as I did in other raunchy anime shows. The story was pretty decent and kept me engage enough in every episodes although there are times that I still feel like it's a bit slow and it still havethose cliche cut out scenes from any other romantic comedy anime. I can only see that who ever in charge of this production that they did care about presentation and the quality of art they are showing. There are slight moments (casual moments) where the characters do kind of stuffs and it make sense for their character to do it. I really do appreciate when shows do those kind of stuffs. There also fantastic moments where Megumi would act as the main heroine and she just look so beautiful and cute because of presentation and directing of that scenes. The major part that I didn't enjoy in this show is the characters. I feel like they mainly focus on only two characters and that didn't even make me like those characters at all. I guess in some way I can say that by knowing the backstories of those characters it kind a make senses where the direction of the story went. Still, I didn't really sympathize with those characters at all. I don't even feel anything or feel sad with them when they were going through something hard or just simply when they showed their emotions. I just give zero fucks about them. I care more about the characters that I like than watching them. There were also times that I just want to skip the scenes where those characters have their conversations. The cousin character was not explored very well. She's one of major characters in the story but I feel like she just one of side characters. I think the author self-aware about the weird dynamic inside their circle (Blessing Software). Their dynamic were never really that good and the characters reasons of joining the circle was never solid but the author took the advantage of that and made that something in the story. The one thing that really shined in the show is the character development of Megumi. The show perfectly illustrated the growing presences of Megumi as the story progress. She's actually favorite character in this show. If some people started this show and it felt like it's obnoxious to watch, I recommend them to not drop it yet. There still hidden gems in here that I really did enjoy watching and I hope they will also see and enjoy.",
            "date": "2017-07-23T15:30:00+00:00",
            "helpful_count": 0,
            "mal_id": 253598,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5376067.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/agoggeek",
                "username": "agoggeek"
            },
            "url": "https://myanimelist.net/reviews.php?id=253598"
        },
        {
            "content": "The first season was my 2nd most favourite slice of life/drama anime of all time (topped by Yahari) and I enjoyed the second season but the tone was very different from the first. It dragged the drama to the next episode and then the next and then the next until the last one. I loved many scenes in it especially with Kato, but the anime didn't go as I wished the first season would.\r\nFirst season gave me positive feelings and appreciation for every small thing, but the second season made me feel that watching it was a chore not fun anymore. It was depressing andthe icing on the cake was the NTR in the infamous episode 9. \\n\r\nThe art, sound, and direction (the movement of characters and background) were top notch just as the first season, but that can't help enjoying the anime. \\n\r\nI honestly would rather to have a boring ending than having what I had.\\n\r\nThis anime was the only anime I was anticipating since finishing the first season, but it turned out to be a huge disappointment. This is turning into a rant more than a review but I just had to drop the monkey off of my shoulder and just forget about it.\\n\r\nMay would like it but if you expect it to be like the first season I suggest reading the negative reviews first",
            "date": "2017-06-28T15:23:00+00:00",
            "helpful_count": 0,
            "mal_id": 251355,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5485046.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 2,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Gjrnm",
                "username": "Gjrnm"
            },
            "url": "https://myanimelist.net/reviews.php?id=251355"
        },
        {
            "content": "Saenai Heroine no Sodatekata flat or How to Raise a Boring Girlfriend -flat, whatever you want to call it, was in my own opinion a good season gone downhill. \r\nHow to Raise a Boring Girlfriend flat is a continuation of the 1st season going on with Tomoya and his band of girls making their doujin-game. Overall, the 1st episode or rather episode 0 was basically a fanservice beach chapter that didn't really set anything up for the show whatsoever, and was a complete waste of time, but after that the story in my own opinion got a lot better as the episodes progressed. However, mostof my problems with this show start around the episode 9 mark.\\n\\n\r\nIn the beginning half of the show they're continuing their game and trying to prep it for the Winter Comiket, and after episode 9-11 it makes all of this effort go to absolute waste. The last few episodes legitimately make all the episodes prior meaningless.\\n\\n\r\nI'll try not to spoil too much, but lets get into why I rated this the way I did, with story at a 6. My problem especially with this show is the 1st season did a very good job leading up to a second season and the second season started off very well, I don't usually enjoy harem/comedies that much but I did until the HUGE 180.\\n\\n\r\nIn the least spoiler way possible that I can make this, the episode 9-11 mark makes all of the prior character problems, drama, comiket, 1st season and up to this point completely useless because of the dense characters known as Eriri and Utaha quitting the Doujin team after making a fairly successful game.\\n\\n\r\nI wont go into details with the main reason they quit the Doujin team because thats going way to much into it, but I'll explain my biggest concerns with it since I'll be rating the characters and it basically links it up well.\\n\\n\r\nFor starters, the main character, Tomoya, I think gets wayyyyyyyy too much bullshit then he deserves, especially with Eriri and Utaha. There was one situation with Kato that completely made sense and was probably the only thing productive from the 2nd season. Tomoya gets ripped on his ability to perform as a Producer throughout this season and gets so much unneeded bullshit that its insane, they act like the 1st time game producer who hasn't made one game before is some sort of almighty god and because he makes one mistake it hinders the whole team, when it was only really the other characters making bullshit excuses for themselves throughout the show, Kato was the only character with definitive reason to have given him bullshit.\\n\\n\r\nEriri, had a LOT of spotlight in this season compared to the likes of Utaha, and I actually am quite pissed that they gave Eriri so much screentime after the stunt she pulls in episode 9 along with Utaha, they could have given more screen time for the cousin or Tomoya and Kato than make a whole melodrama episode bunch for Eriri who basically makes the whole dramatic episodes useless. Eriri had a \"slump\" for most of this season, and the person who honestly got her out of the \"slump\" Tomoya, inevitably gets to be blamed for the slump because she hasn't changed as a character and continuously makes herself look stupid because she never breaks out of her shell of blaming Tomoya or using Tomoya for some stupid fucking reason.\\n\\n\r\nUtaha, had a little less screen time, but it still was enough to make her character worse then it already was. I think Utaha was my 2nd favorite character at the start and shoved her way down. She inevitably gets her screen time helping Tomoya with doujin stuff or the last bit of drama scenes where just like Eriri, pin the blame on Tomoya and act like he's a shitty director/producer even though that was his first time making a visual novel/gal game. Cut the kid some slack, it was successful, and theres no reason to act like hes limiting you when its you limiting yourself, and that hasn't changed at all since the start of the series.\\n\\n\r\nSome other minor characters, like Iori, actually were better then the main characters themselves. While as depressing as it sounds, yes, the supporting cast in this show outside of the characters from Blessing Garden did more in this season then the last. Tomoya and Kato all and all were fine characters the entire season and inevitably learned from their mistakes, Iori actually helped with a lot of the issues in this series to help build plot and other characters were used as well, while the main cast either did nothing but stall more bullshit or add fanservice.\\n\\n\r\nMy characters I rate a 5 because this was one of the shows I was looking forward to this season and I inevitably was let down tremendously by the way things were handled. When only 1 main character actually goes through change and the side characters did more visible change then the main cast, it makes absolutely no reason for it not to be anything BUT mediocre.\\n\\n\r\nThe Art and Sound as always I think was pretty good. I liked the art of most scenes and the sound quality from voice actors was I think a plus. The OP kinda sucks and I skipped through most of it, however the emotion could be felt in this series and I like that.\\n\\n\r\nMy enjoyment level overall was good, I enjoyed the season, I might be a bit harsher then other people watching, and be expecting more from a harem trope series as is, but I felt something different then most other harem series with the creative aspect and most of my problems lie with how the creative side in this show gets entirely fucking ruined by the last 3 episodes and with one of the worst endings I've seen. \\n\\n\r\nOverall, if you watched the first season of How to Raise a Boring Girlfriend, by all means watch this season. I think most people would probably enjoy this season as is, and I would have too if not what I've said a shitload already, how they make the whole series for the most part irrelevant by the end. I think if the show gets another season or I randomly find the LNs and read them and get more clarification on this, my opinion could change, but as a way to end a season its either good or bad or potentially both.\\n\\n\r\nI hope this review isn't too long, but I hope its helpful and doesn't spoil most of the actual problems in the season. I might just be a nitpicker but this definitely was not my cup of tea. \\n\\n\r\n**STILL BETTER THEN EROMANGA-SENSEI***\\n\\n",
            "date": "2017-06-26T20:48:00+00:00",
            "helpful_count": 0,
            "mal_id": 251163,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5530842.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zurokyn",
                "username": "Zurokyn"
            },
            "url": "https://myanimelist.net/reviews.php?id=251163"
        }
    ]
]