[
    [
        {
            "content": "Once upon a time there was a series of light novels by Masashi Okita that played around with certain well known fairy tales. Due to a strange twist of fate (or a complete lack of ideas), the series was chosen to be adapted into anime form, and they all lived happily ever after.\r\nWell, not quite.\r\nDirected by Iwasaki Yoshiaki (Gokujou Seitokai, Wagaya no Oinari-sama, Gunbuster, Love Hina), Ookami-san to Shichinin no Nakamatachi (Ookami-san and her Seven Companions), follows the adventures of Ookami Ryouko and her colleagues from the Otogi Bank as they solve people's problems, right various wrongs, fight delinquents, and generally act as all roundbusybodies.\\n\\n\r\nNow where have I heard that before?\\n\\n\r\nThe main problem with Ookami-san is that it suffers from the same flaw that almost every novel adaptation has - an inherent lack of detail. That's not to say that the story doesn't work as there are plenty of things already in the tale that are interesting enough. The plot, however, is haphazard in its approach, and a number of points never get explained over the course of the series. Because of these two factors, the story never really reaches the level where the viewer can become engrossed, and in all honesty the only reason I finished it was because I was playing \"Spot the Fairy Tale\".\\n\\n\r\nAs I mentioned before, the franchise plays fast and loose with several well known fairy tales like Little Red Riding Hood (complete with wolf and hunter), Momotaro (with dumplings), The Hare and the Tortoise (which was changed to a turtle for some reason), Urashima Tarou, Snow White and the Seven Dwarfs, Hansel and Gretel, The Little Match Girl, Puss in Boots, and probably a bunch more. Unfortunately, there's a side effect to incorporating specific elements of other stories into your own and that's exactly what happens here.\\n\\n\r\nIf one is able to disregard the lack of focus and detail, there's still the creativity barrier to overcome and it's here where the everything falls down. While the story may have some interesting aspects, the usage of fairy tales places quite a heavy dampener on innovation and it shows in Ookami-san in many ways, from  relationships (Usami Mimi and Ryuuguu Otohime are inclined to hate each for example), to character design.\\n\\n\r\nIn all honesty, J.C. Staff have produced a fairly decent looking show for the most part. The animation is generally fluid throughout the series, but there are one or two telltale signs of corner cutting during the fight scenes. The backgrounds and settings are pretty standard fare for anyone familiar with high school anime, and while there are no real feats of originality, there are also very few major flaws. The real problem with the overall look of the show though, is the inherent lack of innovation I mentioned earlier.\\n\\n\r\nThis is where it all gets a bit tricky. On the surface the casual viewer may consider the design of certain characters to be quite original, for example Akai Ringo is supposed to be Little Red Riding Hood and this reference is prominent in her clothing throughout the series. Certain other characters follow this design pattern to highlight the fairy tale they are based on, while others are a bit more subtle with their reference. One of the main issues with this approach is that it impacts on the relationships between the characters, and the reason for it may not be obvious at first. Once the viewer understands the reference then everything becomes clear, however Ookami-san only really works on that basis.\\n\\n\r\nOne point in the show's favour is the sound quality, as the effects are fairly well realised and choreographed. Unfortunately the music isn't up to the same standards. That's not to say that it's bad, no, it's simply that it's all been done before.\\n\\n\r\nHere's what I mean. The OP, \"Ready, Go!\" by May'n is a boppy J-pop track that doesn't leave any impact whatsoever. The ED, \"Akazukin-chan Goyoujin\" (Careful Akazukin-chan), by OToGi 8, is a strange mixture of J-pop and chip tunes that is equally forgettable. The rest of the music throughout the series doesn't really add much to the atmosphere of a given scene, and the proof of this lies in the numerous occasions where no music is used as there is very little difference in terms of impact.\\n\\n\r\nOne of the main sound problems with Ookami-san though, is the narration. There are far too many occasions where the viewer will be trying to pay attention to what the characters are saying, only to have it drowned out by Arai Satomi pretending to be an old time storyteller. As for the acting itself, the seiyuu are generally pretty good, with Itou Shizuka and Itou Kanae playing the roles of Ryouko and Ringo with a degree of aplomb (one does have to wonder if the casting was purposeful though). Irino Miyu gives a respectable performance as the sociophobe and prospective beau Morino Ryoushi, especially when he switches between coward and manly mode.\\n\\n\r\nThe rest pf the cast deliver some good all round performances but, like the rest of the series, the lack of originality means that they simply can't sink their teeth into the roles. The prime example of this is the fact that Ryouko is, yet again, quite literally the \"sheep in wolf's clothing\".\\n\\n\r\nNow I will be honest here. I'm tired of the typical tsundere loli character and would personally like to see more variety in that department. Surprisingly, it seems as though Ookami-san has made some efforts to move away from the archetype. There are attempts to justify the persona of each character to a degree, and although the results are a bit of a mixed bag, the fact is that this makes the show more interesting than it would otherwise have been. The series takes great pains to delve into the personal history of its lead characters, and some of the resulting stories are handled rather well.\\n\\n\r\nBut that's all there is to it. Once their stories are told the characters go right back to how they were before, with the only real exceptions being Ryouko and Ryoushi. But that's not my main gripe where the characters are concerned, no, the real problem here is that there are no reasons or justifications, either in the story or otherwise, for the actions of Hitsujikai Shirou, and the lack of any information leaves the viewer wondering what the hell is going on.\\n\\n\r\nNow, while Ookami-san isn't a truly great show, it's not actually that bad on the whole. The series has a number of interesting aspects and relationships, and is entirely watchable as long as you aren't overly critical about it. Unfortunately there are occasions where there is simply too much going on at once, and the viewer may find themselves going back over certain scenes in order to fully understand what has occurred.\\n\\n\r\nOne thing I did like were the cameos from ToraDora! and Toaru Kagaku no Railgun as, while they may not be my favourite shows, it made the anime into something more of a visual game (spot the reference).\\n\\n\r\nIt's strange how many shows these days are adaptations of other media, and it does make one wonder if anime studios have hit a creative wall. Whatever the case may be, Ookami-san is a decent attempt at adapting a novel series, and while it does have its flaws, the show is entertaining enough for at least one viewing. Granted it may not be everyone's gingerbread house, but those that like school based romantic comedies won't find themselves too disappointed.\\n\\n\r\nNow can we please find a different character type as I'm tired of of all the tsundere lolis.\\n\\n",
            "date": "2010-09-17T17:03:00+00:00",
            "helpful_count": 350,
            "mal_id": 30578,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=30578"
        },
        {
            "content": "Foreword:\r\nDue to the lack of (In my opinion atleast) intelligent reviews for this anime thus far, I figured I would take the time to write one. I would like to note however, that this is only designed for users to see if they might be interested in spending their time watching this show. I have no idea how this show will end, as I am only a few episodes in, however, I will try to make this as helpful as possible. So, if the show magically starts being terrible don't come after me with flaming sporks. This is only a review for the first 3episodes (for now).If you think I didn't do a good job reviewing those episodes, then please, bring your spork army. On to the review!\\n\\n\\n\\n\\n\r\nThus far, Ookami-San is a rom com WITH A TWIST. *cue what a twist soundboard*. Like a standard romantic comedy, it has some interesting characters that slowly seem to bond from various events. Lame, I know. The way Ookami san does it is interesting however. A majority of the episodes are parody's  of classic fairytales. \\n\\n\r\nThe way its done is not only smooth, but exceptionally entertaining. It's to the point where if you know of the story, you can catch the references immediately and if you have never heard of the tale the show is still crisp and you won't be left confused for the most part. \\n\\n\r\nThe show is  full of plenty of colorful characters, from the main ones Ryoushi(Wimpy kid who has a crush on Ookami, I'm sure you can guess how character development will go with this one) and Ookami (Translate for epic giggles) to the typical lolis and ladies man. There really isn't a character that will make you go crazy for, but there is not any characters that will annoy you to the point you will  immediately drop the show, so I can't really complain. \\n\\n\r\nWhile not a huge deal, I'll toss this in here. The opening theme is decent. Not good, but not horrendous. I can stand watching it instead of ffing past it which is a pretty big deal for me atleast.\\n\\n\r\nOverall, the show is enjoyable and just that. This isn't an angel beats or code geass or whatever anime really tickled your peach in the past. Its just a show that is refreshing, humorous, and  darn entertaining. \\n\\n",
            "date": "2010-07-21T18:42:00+00:00",
            "helpful_count": 56,
            "mal_id": 28732,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/322758.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Clous",
                "username": "Clous"
            },
            "url": "https://myanimelist.net/reviews.php?id=28732"
        },
        {
            "content": "It could have been something decent, but instead Ookami-san to Shichinin no Nakamatachi reeks of mediocrity. The art work and animation was actually pretty and appealing, but the terrible story and cast of characters makes this series a pretty little scab you want to tear off. The rag tag bunch of characters have a very minor development and role so it'll feel as if most, if not all, of the characters are a side note. Even the story leaves you hanging till the last episode. At the end of the series, you will ask yourself, \"That's it? What the hell was I watching this for?\".I'm sorry to say this, but I felt as if the writer of the series did a half-assed job and produced a story about kids doing random things without any plot or motive. I say this series was a wild goose chase. I recommend it to those of you who have nothing to do and just want to kill time.",
            "date": "2011-08-07T13:32:00+00:00",
            "helpful_count": 56,
            "mal_id": 40943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/muckgaiver",
                "username": "muckgaiver"
            },
            "url": "https://myanimelist.net/reviews.php?id=40943"
        },
        {
            "content": "Ookami was one of the more popular series of the season. Why? Beats me... Was it because of J.C staff? Despite their many successes, I find Ookami to be an incredible bore.\r\nLet's start with this: I really hate the narrator. I feel that shows that uses narration heavily are due to the director's lack of ability to convey plot and emotions, and that can't be more true for this show. And I hate Satomi Arai.\r\nThere are only a few instances where I can follow the character's train of thought, though that wasn't suppose to be hard due to the incredibly simple storyline. The main antagonist isso one-dimensional, it feels like he's a last minute addition as a plot device. The climax of the story is just... Can you even call it a climax? I don't even feel the slightest sense of excitement during that. It feels like a cheap way to end the series, and it leaves so many questions but I couldn't really be bothered any more.\\n\\n\r\nThere's so little material for the main storyline that most of the series focuses on stories of the supporting characters... Which none was really interesting, but at least it's better than the main plot. I suppose Ryoko's tsundere personality is suppose to sell, but beyond that trait, her character got no depth at all. Ryoushi's really irritating as a main character. As a wimp he can't even go to GAR mode properly... You'd hope he'll actually grow up by the end of the series, but all he managed is to overwhelm the bad guys with the final blow like a typical Shounen protagonist.\\n\\n\r\nThe animation and songs were good. I wont expect any less from J.C staff though... Well... Let's just leave it at that.\\n\\n\r\nI think the only thing that this show gotta sell of is Ryoko's tsundere... But come on, really? This is a lame piece of work.\\n\\n\r\nPlot/Concept: Lame\\n\r\nStory Style: Booooooring\\n\r\nAudio/Visual: Great\\n\r\nValue: 3",
            "date": "2010-10-24T09:57:00+00:00",
            "helpful_count": 35,
            "mal_id": 31572,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/22253.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/du5k",
                "username": "du5k"
            },
            "url": "https://myanimelist.net/reviews.php?id=31572"
        },
        {
            "content": "Ookami-san to Shichinin no Nakama-tachi\r\nThe fact that this is a wasted potential is a shame, this could have been greater than what ended to be.\r\nStory\r\nThe story started very good i was really interested to follow it but then just started to be more of a comedy/parody without the romance that at some point you think will happen, never happens, and that was annoying, it was really interesting almost every job they did for people, so for me was good.\r\nArt & Sound\r\nBoth were like you think will be, good character design and colorful landscape. The sound was good, it was really enjoyable, the VA was good.\r\nCharacter\r\nThisis what the anime is, they really were very good and funny, there's a great variety of characters from fantasy books and you will recognize them, the ones that i liked were Ringo and Ryoushi who at first might seem like a wuss but he shows that he can be a badass for Ryouko and Ryouko was too tsundere for me, she hides her feelings for Ryoushi and never accepts them, not even when everyone sees it, and i hated that she didn't appreciated what Ryoushi did for her other and they have backstories and almost everyone were well developed deeply.\\n\\n\r\nEnjoyment\\n\r\nI could have enjoyed this more, but i couldn't because of that bad ending and Ryouko being how she was so overall was good.",
            "date": "2015-08-07T11:21:00+00:00",
            "helpful_count": 34,
            "mal_id": 195432,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195432"
        },
        {
            "content": "Translating a book into a movie or show is always a challenge for developers. Why? Because taking all the information contained in a book and trying to cram it into a 2 hour movie is near impossible. So why do developers constantly try and do what seems impossible? Well it is my opinion that books have an uncanny ability to truly capture a readers attention with the use of two things, characters and story. The attention to detail and the ability many authors have to flesh out a character or grab a readers attention with interesting plot twists is what has kept books from dyingout for so long. And so we come back to the question, why do developers try and do seems impossible? Maybe it is to try and reach a new demographic in a day and age where reading just isnt \"cool\" or \"in,\" or maybe developers would just like to create there own interpretation of the original work or maybe they just want to cash in on the success of the book. Whatever the case, developers have tried countless times to try and recreate the magic of a certain book in visual form, and the outcomes range the full spectrum of great and horrible. When it comes to anime, in my opinion, there is one thing that will truly define whether the developers rendition will succeed, time. \\n\\n\r\nOokami-san to Shichinin no Nakamatachi is based off the light novel of the same name and follows the adventures of Ookami, Ryoushi and the group they work for, Otogi Ginko (Otogi Bank). This anime's story really had everything going for it right from the start. While the story's structure is by the books, little details kept things fresh and exciting. With a change up of action and romance things were fast paced and while this is not unusual for an anime story line and maybe not original, I couldnt help but smile at parts or notice myself getting drawn in. And yet, this anime's biggest downfall is its story. Why you ask, after all my praise do I say that the story is this anime's achilles heal? It comes back to what I said in my opening comments, time was what brought this anime to its knees. \\n\\n\r\nWhat Ookami-san (abr. title) really needed was 24 episodes, maybe even 32. While the story and characters are all very enjoyable, because of this anime's short length, you only seem to graze the surface of everything. You never seem to get the chance to get deep into things, get under the character's skins and see what they see, essentially immerse yourself. Even the story, we only seem to be looking at the tip of the ice berg in the anime, and even the more interesting elements, such as the antagonist only seem to be an after thought, a \"reason\" given to the \"good\" guys to fight evil. I have not read the light novels, but I feel as though the story was not given enough thought. With what I saw at the start, there was more than enough material to really delve deep and grab the viewers attention, and yet instead we are side tracked with usual anime shit such as the usual \"moe moe\" we all seem to want. And while much of the story may seem cliche at times, there was a lot of squandered potential. By the end of the anime, most would have realized that there would be no \"real\" ending, and things would be left unattended. Which is unfortunate because like I said numerous times, Ookami-san had so much potential, so many more characters which could have been developed more, so much more story to be revealed, so much more plot. It all seemed so rushed. My feeling was the developers were trying to cram as much of the story in as possible, but by doing this they were unable to get to the essence of the plot, and unable to draw viewers in. \\n\\n\r\nOokami-san does have some solid strong points though. The animation was very well done, with fight scenes that were enjoyable and smooth. The art was also extremely pleasing, with very good character models and detailed backgrounds. The sound was done very well also, with great voice actors for the main characters, and sound quality that while not outstanding, surely stands above other series in the same genre. Really, by the end of this series, it was these qualities that kept me coming back and allowed me to finish the last few episodes. But anime is not all about the quality of its art or animation. \\n\\n\r\nAs I stated at the start of this review, Ookami-san's biggest weakness was its time management. This show desperately needed 24 episodes. What started out as a great show, by the end left a bad aftertaste, and not because the story or characters itself were bad, but because of squandered potential. It is not impossible to adapt a book into an anime, as there are many examples of great adaptations, but what needs to be addressed when attempting such a difficult task is time. What amount of time is needed to truly convey what the novels were trying to convey? How much time is needed to truly recreate the story? How much time is needed to delve into the necessary characters and develop them? And unfortunately with Ookami-san, the developers didnt seem to ask themselves these questions.",
            "date": "2010-09-16T21:51:00+00:00",
            "helpful_count": 27,
            "mal_id": 30557,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/270172.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/musashi7",
                "username": "musashi7"
            },
            "url": "https://myanimelist.net/reviews.php?id=30557"
        },
        {
            "content": "Just watched the second episode of the anime, and here is what I can say:\r\nWhat I like best about this anime is it's originality. It is an interesting idea of using the plots of the worldwide known tales and fables, even though it could sound like a re-post, there are many parodies of such. But here it adds additional shine and depth to the personalities of different characters and makes it easier to follow. Thanks to this, they don't even need to use a whole episode to introduce each character - it's not hard to remember everyone of them - and the whole team actstogether straight from the beginning, which doesn't happen often.\\n\\n\r\nThe eyesight-fearful \"Hunter\" is considered by me as a rather rare personality, and with his awesome, I could even say cute ending ~su, he truly is something worth of mentioning.\\n\\n\r\nThe second part of it's originality is difficult to get used to. The \"storyteller\" (those who have seen Railgun can say it's Kuroko, Misaka's roommate from the Railgun anime) tends to speak over the speeches of the main characters. I just can't get it over with, and so I watch the scene again, until I've heard both the storyteller and the characters talk (in my case I mean until I've read all the subtitles). And the main thing is, usually both of them are of none importance to me. While I've already noticed the things the storyteller explains, the main characters have a simple chat. So, don't get confused by overhearing something and move on. And remember the texts from Bakemonogatari, which are also not intended to be read properly.\\n\\n\r\nWhat comes to the real plot, it has nothing special. A team of students with different specializations solving things, with a little love-comedy in it, a strong girl on the outside but soft in the inside an so on. And it doesn't seem it'll get better than that.\\n\\n\r\nBut due to the great characters, I think I'll watch on. And this is not a bad anime, no. But quite far from a masterpiece. For those who want masterpieces, watch Beck and Phantom first.\\n\\n",
            "date": "2010-07-08T14:23:00+00:00",
            "helpful_count": 20,
            "mal_id": 28116,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Danim3",
                "username": "Danim3"
            },
            "url": "https://myanimelist.net/reviews.php?id=28116"
        },
        {
            "content": "(This review is only based on the first episode seeing as the series aired July 1st and today is July 4th.)\r\nThe underlying story is a time tried classic. Wimpy/shy/problematic guy confesses to overly strong/proud/manly girl and is initially rejected leading to the guy spending time trying to prove his worth.\r\nNow, beyond that we have the organization with the crazy/eccentric/cool people who do jobs to help other people which includes the main girl and soon after the guy who confessed to her.\r\nThough while we have these basic plot devices, the execution of the story is fairly unique with the first episode twisting a classic fairy taleto fit the settings as well as leave you laughing at it's execution and result.\\n\\n\r\nIs it an intellectual piece? No. Is it a landmark series? No. Is it another run of the mill anime? No. Will it leave an impression on you and the urge to watch the next episode? Yes.\\n\\n\r\nWhat do I think?  It's a good, solid series and worth the 23 minutes to at least watch the first episode.\\n\\n\r\nWhy do I say this?\\n\r\nThree words:  Kitten Knuckle Gloves.",
            "date": "2010-07-04T12:14:00+00:00",
            "helpful_count": 19,
            "mal_id": 27963,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/260423.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xbsquirrel",
                "username": "xbsquirrel"
            },
            "url": "https://myanimelist.net/reviews.php?id=27963"
        },
        {
            "content": "I began watching this series on a suggestion, I'd been complaining to a friend about the lack of well balanced and strong female lead characters. So he suggested I watch this because it was exactly what I was looking for, and I trusted that, he's hardly steered me wrong.\r\nI was severely disappointed to the point where I was just overall very sad and upset. Sounds silly but, I went in expecting a good solid story line which a cast full of characters that were different in their own way, and a strong female character that really made the series. What I was greeted with wasthe same every day crap I was trying to avoid, \"Women are weak and they need Men\".\\n\\n\r\nOokami got down played once again by the male lead, which was exactly what I was hoping to avoid. I've never given an anime this low of a rating before, if I wanted flesh bags wagged in my face this would be the perfect anime to do it. Yet when looking for something with a lot more weight and meaning it fell short on all accounts and was a huge disappointment!\\n\\n\r\nNot only that...seeing Ookami nearly hit the peak of a strong woman, only to be yanked back down by a man was too sad to watch. I tried to finish it but, I couldn't unfortunately. So I extend this warning, if you're looking for something that'll exhibit the true strength of a woman both physically and emotionally, you won't find it in this anime. If you're looking for fan service, then please, give it a shot, it'll be right up your alley.",
            "date": "2011-08-16T22:04:00+00:00",
            "helpful_count": 19,
            "mal_id": 41627,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/346026.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/rojocharmander",
                "username": "rojocharmander"
            },
            "url": "https://myanimelist.net/reviews.php?id=41627"
        },
        {
            "content": "If you want a short + straight answer, feel free to skim or just skip to the \"OVERALL\" part.  :)  My 2nd anime review: \r\nSTORY- 7\r\nOokami-san to Shichinin no Nakamatachi has a stable storyline, which really just involves a group of high school kids called the Otogi Bank who fulfill students' requests. And in exchange for helping them out, their client has to owe them some sort of favor. Not an entirely exciting, nor original concept, but I do enjoy how this anime have a bit of a fairytale-like theme to it.. --mixed in with romance, action, comedy, drama, and even anime references(such as Zero no Tsukaima & To Aru no Railgun). The story doesn't progress too much from there, and they continue on each & every episode about helping a new client. It also often focuses the episodes on telling us more of the characters' past.. or more development on the romance between Ryouko & Ryoushi.\\n\\n\r\nART- 9\\n\r\nThe animation is rather fantastic in this. I adore the cutesie looking character, despite the fact that they overdo it sometimes. Lots of pretty girls.. and several decent-looking guys. No complaints here.  \\n\\n\r\nSOUND- 8\\n\r\nMany famous + talented voice actrors/actresses we can recognize from here, like Irino Miyu (Syaoran-Tsubasa Chronicles), Itou Kanae (Amu-Shugo Chara!), Toyosaki Aki (Yui-K-On!), Kugimiya Rie (Shana & Taiga & Louise), Horie Yui (Yuuki- VK & Minori-Toradora!), and tons more.  They are very well-suited for their roles, so no complaints here, either.  I absolutely LOVE the narrator who's very much amusing through-out the series, giving us info. & random comments. ( I'm sure her voice will ring a bell, too.) The opening (sung by May'n-- also known as Sheryl from Macross Frontier) & ending themes are good, but nothing memorable, nor catchy.\\n\\n\r\nCHARACTER- 8\\n\r\nThere are a lot of development with the main characters and even the side characters' development.  Lots of the characters' type are cliche, and we've seen them one too many thems.  In this case, I don't mind because all the characters are entertaining.  I must say that our main guy, despite being that same-o \"plain\" guy-type, he has 1 original aspect: phobia at being looked/stared at.  With that, he is no longer that cliche \"nice\" & \"average\" guy.  All the characters are to a satisfactory level.  I like ALMOST all of them.  :]\\n\\n\r\nENJOYMENT- 8\\n\r\nI really did enjoyed watching this series. It was possibly my favorite 2010 Summer anime. I laughed, and I may even have cried..(or maybe not..my memories are kinda blurry) for this one certain scene. Each episode were amusing, and a few of the stories seriously touched my heart.\\n\\n\r\nOVERALL- 8\\n\r\nI think it is TRULY worth-watching.  Not the best series.. Actually, FAR from it (it is what to be expected from a 12-episodes anime). But it has some pretty darn good contents. Give it another season, and Ookami-san to Shichinin no Nakamatachi might turn into something BIGGER. I also will give it props for not turning this into another harem.. which is kinda surprising (considering how a HUGE majority of the characters are females). A few light fanservice here & there, but I won't label this series ecchi.  \\n\\n\r\nThank you for reading.  Hope it helps even if just the tiniest bit.  ^^",
            "date": "2010-09-24T23:36:00+00:00",
            "helpful_count": 17,
            "mal_id": 30771,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/47992.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/FeelingBlue",
                "username": "FeelingBlue"
            },
            "url": "https://myanimelist.net/reviews.php?id=30771"
        },
        {
            "content": "A high school rom-dram-com with potential ends up squandering most of it because of some all-too-common faults in the anime industry. I seem to be on a streak of reviewing anime that I think blew their chance, but here's why Ookami-San and Her Seven Companions missed its shot.\r\n-Story-\r\nSticking several fairy tale characters from various stories together is by no means an original premise ('Fables' comes to mind) but it can still be enjoyable to watch old characters in new ways. The story is mostly episodic, following the staff of the Otogi 'Favors' Bank from case to case as they work to sort out various problemsaround the school. However, it suffers from badly handled tone shifts between scenes covering main heroine Ryouko's relationship to the main antagonist, and the parts where it's the just the main cast solving problems (without spoiling too much, roughly halfway through the series we learn something about Ryouko's past that fundamentally increases the seriousness of the series- but the show still tries to revert to the same comedic tone shortly thereafter). Also, the story misses its chance for a conclusive ending both dramatically and romantically, punting on both accounts and settling for making the final episode effectively filler (I realize this is an adaptation of only part of a series of light novels, but unless a show has a guarantee of a second season, giving open-ended finales just screws the fans over. Come on, how often does a show that ended inconclusively in the hope of getting a second season ACTUALLY get a second season?). The episodes can be enjoyable, but botched tone shifts and the \"Maybe Ever After\" ending keep the story from being anything special.\\n\\n\r\n-Art-\\n\\n\r\nGo take a flying leap, narrator, Ryouko looks great without two cantaloupes strapped to her chest! VIVE LE PETITE MADEMOISELLES!!! Ahem... now that THAT'S out of the way on to more serious matters...\\n\\n\r\nThe art is bright and colorful, but it's nothing we haven't seen before. I'd say aesthetically it was pretty similar to Toradora! (J.C. Staff produced both shows, so that's not unthinkable). I can't think of much to say beyond how quality is good and the style fit the show. Character designs incorporate elements from the fairy tale character each cast member is based on, with varying degrees of subtlety, creating fine designs but nothing that will go on lists of 'Most Originality'. Ryouko was a little unique in that the fan-service focused largely on her legs ( not the most common part of the female form to center on ) but didn't subvert any tropes beyond that. Main male character Ryoushi has an entirely generic and forgettable look. Main antagonist has the 'white haired pretty boy' design that stopped being original sometime around when Griffith sacrificed the Band of the Hawk to gain demonic powers.\\n\\n\r\n-Sound-\\n\\n\r\nBrina Palencia seems have a certain knack for playing wolf-girls (she gives them a certain 'spice' you might say). Her performance in the English dub can cover a variety of emotions and tones well and is the best performance overall.  Narrator Luci Christian provides a great deal of comedy with her often sarcastic take on the on-screen events (\"Oh look! A fan-service shot!\") None of the other voice truly stood out, but I can't find faults with them either. The OP and ED are catchy, but nothing to go buy and download, and the OST is mood music without a standout track.\\n\\n\r\n-Characters-\\n\\n\r\nMale lead Ryoushi is a character I connected with very quickly, but largely due to personal reasons (I also spent a good chunk of my high school days as a shy, cowardly guy in hopeless pursuit of various serious, talented, energetic girls who weren't going to swoon for just any random bloke) not because his arc is overwhelmingly unique or well-done. His storyline is undermined by constant resets after each time he does something cool in order to maintain status quo. By the end of the series I was able to actually time these character resets (\"OK, he's going to do something cowardly in 3, 2, 1...\"). The \"Cowardly Push-Over Becomes A Heroic Badass And Saves The Day\" is a character arc I love, but the series was never willing to let him stay in Badass mode for long. Female lead Ryouko knows how to Tsundere with the best of them, as her alternating between bitter and sweet attitudes actually has some justification: she's struggling between her natural personality and the personality she developed in response to past events. I even thought there was bit of chemistry between her and Ryoushi that a proper ending could have exploited. Most of the supporting characters are serviceable but fairly forgettable, having one main personality trait that doesn't really develop (or again, just resets if it does).\\n\\n\r\n-Enjoyment-\\n\\n\r\nI enjoyed this series, but once I caught on to the dependable character resets and realized there wasn't going to be a proper ending I felt disappointed. It's the kind of disappointed you feel when you see something you think could have been very good trip and fall into mediocrity ( I need to review something I think did well soon, this trend of writing about anime that fumbled a good chance is getting depressing), not the kind of disappointment you feel when you watch something bad which you never thought had a shot to begin with.\\n\\n\r\n-Overall-\\n\\n\r\nAlas, comedy and chemistry between the main characters is squandered in the hope of getting a second season. A proper ending could have made this series endearing, but as it is it's just a bit above average. Doggone it anime industry.",
            "date": "2015-05-05T12:58:00+00:00",
            "helpful_count": 17,
            "mal_id": 187185,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4582226.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PowerUpOrDie",
                "username": "PowerUpOrDie"
            },
            "url": "https://myanimelist.net/reviews.php?id=187185"
        },
        {
            "content": "The wolf and her Seven companions.  First off, this title is completely misleading on the account that there are 8 people around her, not 7.  I understand that the guy comes in later, but he is technically one of her companions.  Anyway, with that little nitpick out of the way, onto the review.\r\nStory (7.21/10):  The story of Ookami-san to Shichinin to Nakama-tachi revolves around the high school lives of the Otogi Bank, a club in the school where the story is based in, where they accept the requests of people in the school, in order to get a payment of afavor in return.  Essentially, this club is the school mafia where you are expected to return the favor, or you will get possibly screwed later on.  Our main protagonist Ookami Ryouko is faced with the fact that someone out of nowhere confessed to her in the middle of the street, before finding out that he is a new member of her Otogi bank club.  \\n\\n\r\nFrom a story standpoint, the anime uses its base idea well, branching off several stories from the request/return policy of the Otogi bank as its base.  Every episode, or several episodes, consist of a separate story that has to do with this policy, each with their own story that in the end, reaps some character development that makes the show a bit better as a whole.  But with this idea, there are a few bugs in the mix.  \\n\\n\r\nOne thing that this series has a bit of a downfall in, is its use of time.  While for the most part, the story is well-written and executed rather well, staying true to its own plotline, the plot in certain episodes, diverge from what the main idea is.  In short, side stories.  Roughly a quarter of the series is essentially plot points that don't really have much to do with the main plot, and as such, play no real significance altogether.  Mostly, these episodes have to do with certain members within the Otogi bank and give them a little bit of backstory.  This is fine and all, but the actual impact altogether doesn't have as much due to the fact that these people who get an episode about themselves, are supporting characters compared to the actual main plot.  Still though, this problem is still quite minor due to the fact that those particular episodes do still have the charm that this series has.  \\n\\n\r\nAnother thing this series has a bit of problem with, is a lack of actual explanation.  There are moments in the series where backstories are explained, mostly about our lovely wolf girl, Ryouko.  What makes this particular thing a downfall, is the fact that when the characters talk about her backstory, there are always some holes.  A few things are mentioned, and you get the general idea of what happened, but the specifics aren't mentioned and a clear and concise story of what exactly happened is never really mentioned, different to most animes that have back stories, which usually end in a full telling of what happened.\\n\\n\r\nThe pacing of the series except for the one episode side stories, is rather decent.  It's pretty steady and there are no real faults in the pacing of the story. \\n\\n\r\nOverview\\n\r\n+  Entire story connects to the main key idea well\\n\r\n+  Good pacing throughout the anime\\n\r\n-   Missing back story areas\\n\r\n-   One-episode side stories that have little plot significance\\n\\n\r\nCharacters (7.89/10):  Take the big bad wolf, little red riding hood, a guy scared of attention, a bodiless narrator, and a whole slew of colorful and overused anime troupes.  This is basically the whole cast of this show.  \\n\\n\r\nOokami Ryouko.  With the word \"wolf\" literally as her name, she Ryouko exhibits a sort of tough aura, always stating that she can do things herself, telling the main guy to man up, and overall, is a rather badass female lead.  What is really likable is he fact that she has a very conflicting personality, having a hidden, inner personality that she never shows to people around her.  Quite frankly, she is the show's main focus and a reason why this show is relatively good in the first place.  She seems to be more of a real person than many other female characters in the \"tsundere\" category, and is overall, a very good character who is very befitting of a show like this.  \\n\\n\r\nMorino Ryoushi is the main male lead of the series.  As a timid person who shies away from attention, Morino is shown to be the main romantic lead, as he confesses his love for Ryouko in the very first episode, something that romance tagged animes pretty much never do.  What I like about him is the fact that throughout the series, you can see the growth in him, to the point that watching his actions from episode 1 to episode 12, are completely inverted and different.  Similar to Ryouko, his personality gets fleshed out as the series goes on, without the exception of a backstory.  \\n\\n\r\nAkai Ringo, or little red riding hood, is the final true main character of the series.  For the most part, she gets a bit of a supporting role, with the exception of her backstory episode, being Ryouko's friend, supporter, and companion for the majority of the series.  (Kind of ironic given their base character idea.)  Different though, is the fact that she has a heart of stone, being very conniving and tricky when the plot needs her to be.  She provides a lot of good support to Ryouko's role and character in the series.  \\n\\n\r\nA special character mention that NEEDS to be said, is the narrator.  Contrary to a lot of comedy series, this specific anime has a narrator to tell out the story in a storybook sense, staring pretty much every episode with \"Long, long ago...\" and pointing out the obvious, making her own remarks, as well as breaking the fourth wall to the extent that the characters might as well know that their own existence is an anime.  \\n\\n\r\nFor supporting cast, the anime consists of about 30 or so members, (you heard me, 30), each of them based on some sort of anime troupe from one place of the universe to the other.  (Maid, playboy, studious, sadistic villan, fanservice, etc.)  While for the most part, these supporting characters compliment the show well, some of them play no real purpose beyond a given episode or two.  Also, the fact that the supporting cast is so gigantic, it's to the point that remembering their names is an issue.  Without the handy narrator giving mention of their name every time they come on screen, you probably wouldn't know who they are, saying \"Hey, it's...that guy....yeah...\" Every now and then.  Another problem was the fact that there were some characters that had some decent significance in the plot, but they were either introduced too late or not given enough time to prove what they could offer to the show.\\n\\n\r\nOverview\\n\r\n+  Fleshed out main characters\\n\r\n+  Decent supporting characters\\n\r\n-   One note characters that show up at most with an episode, then a cameo\\n\r\n-   Too many people to remember  (It's like Angel Beats all over again.)\\n\\n\r\nArt and Sound (7.01/10 and 7.00/10):  For the most part, the animation is rather average.  It looks pleasing to the eye and there was no real jarring things to see, but nothing truly stood out for me as a scene or piece or artwork that was really astonishing.  The art was good, don't get me wrong, but it wasn't the best thing I've seen in recent years in terms of artwork.  Although, seeing Ryouko with wolf ears in the opening song was a nice little touch.\\n\\n\r\nFrom a music standpoint, nothing stood out either.  The tracks weren't terrible, they were rather good with the opening being a very nice and inspirational song and the ending being a happy-go-lucky electronic one, but nothing really stood out as memorable.  They were good enough to stick around and listen to, but it wasn't a god track that you would want to keep in your head forever and ever.  \\n\\n\r\nOverview\\n\r\n+  Decent looking art\\n\r\n+  Good soundtrack\\n\r\n-  Nothing stood out as \"memorable\"\\n\\n\r\nPersonal Enjoyment (7.45/10):  As a personal fan of animal-themed anime characters, and strong female leads as a whole, I found this series to be quite enjoyable due to the fact that Ryouko prove herself to be a great female lead for this show.  Her character, mixing in various other people that have interesting traits, made the show quite enjoyable.  \\n\\n\r\nA little complaint or wonderment I had throughout the whole series was if the school even had a legit uniform or dress code, seeing as how pretty much all of the characters never really follow a traditional school uniform that many other school-based anime do.  \\n\\n\r\nIn any case, I personally enjoyed this series.  It was a nice series to relax and enjoy some decent character development while watching a good comedy show.  I enjoyed the quirky characters, the storyline, and above all, the narrator, which made the series far better than what it could've been.  (Seriously, I shudder to think what this series would be like without the narrator.)  I would recommend this show to anyone who likes a comedy anime that has a balance of story-driven and plot-driven idea.  \\n\\n\r\nOverall Score: 7.48/10",
            "date": "2014-05-10T15:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 142921,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=142921"
        },
        {
            "content": "Wow. Just wow is all I have to say to this anime. It's heartwarming and very funny. I thought the idea of a bank that helps people with problems is such an unique idea and that's what I loved most about it.\r\nHowever there was many things missing that could have made it even better. For example, the allusion to the attempted rape of Ryouko could have been better shown if they didn't refer to just flashbacks. I had to look up what happened to Ryouko to understand what was going on between her and her ex-boyfriend. It's like they touched the surface of the importanteven in Ryouko's life when they should've dove deeper into her past.\\n\\n\r\nI didn't like the ending but it's not like it was bad for it ended on a good note.\\n\\n\r\nI personally like to dub it as the \"fruits basket ending\" syndrome where it ends on a good note but leaves the audience hanging with what they wanted to see.\\n\\n\r\nThe most disappointing part of this anime is that there's no sequel/OVA. There are hundred of fairy tails they could've put into the anime. For example, the Hansel and Gretel siblings? I would have liked to seen them being part of the plot instead of just being allowed to just a few lines.\\n\\n\r\nBottom line: It was a great anime but I was let down by the shortcomings of what they (the animation studio) could have done.\\n",
            "date": "2012-06-15T15:32:00+00:00",
            "helpful_count": 11,
            "mal_id": 63499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1179253.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ambie",
                "username": "ambie"
            },
            "url": "https://myanimelist.net/reviews.php?id=63499"
        },
        {
            "content": "Honestly this anime for me is like new age red ridding hood (i don't expect people who never heard of that story to understand...) but it is like this atleast for me because we got wolf ( who isn't that strong ) , got red ridding hood (even thought she is friends with the wolf) , and we got a hunter ( who is hunting the wolf but in a different way). So it makes this anime more interesting to watch if u know about Red Ridding Hod fairy tail!.\r\nStory: About story i can say few things ... Its warm , innoncent and funny. Warmbecause of friendship , innoncent because of not accepting feelings and funny because its romance comedy!. Anime is centered around so called \"Otogi Bank\" in which people work ( carries out what people asks them to do that u will find out on ur first episode...  ) but for doing so they ask a payment but that doesn't include money or anything valuable its more like request for request with the motto \" Helping each other\" ... And in that \"otogi bank\" we got our protoganists Wolf , Red ridding hood and Hunter who are the main characters of our story. Story goes on and many mysteries surounding The three characters are revealed which intrigues and makes u want for more. Many misunderstandings happens and many Lovely situations occurs as also Dangerous situations accompanies everything. Little love storie is involved i would call it \"innoncent\" love story because of not accepting her feelings even thought u can clearly see when she gets embarassed by simple things ... And also how could i forget about the Story Teller which is funny on some corners but sometimes gets on ur nerves ... its something new but what would u expect from fairy tailo recreation ? :). So with misunderstandings , love situations , and Danger on every corner we Have ookami-san anime which gets 9 marks from me...\\n\\n\r\nArt: Beutiful no ecchi finnaly ! :)\\n\\n\r\nSound: Just love the opening song!\\n\\n\r\nCharacters: All kinds of : Strange , Powerful , Scaredy cats , Lovable , Players , lolita and so on and on just u watch and see!.\\n\\n\r\nEnjoyment: I tell you one of the best summer animes ! \\n\\n\r\nOverall: Just watch and see because its a  great anime for romance/comedy lovers.",
            "date": "2010-09-12T13:08:00+00:00",
            "helpful_count": 11,
            "mal_id": 30437,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/126837.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Poeticas",
                "username": "Poeticas"
            },
            "url": "https://myanimelist.net/reviews.php?id=30437"
        },
        {
            "content": "Alluding to fairy tales has become pretty common in modern television, and of course, quite prominent in anime. In the best case, the use of fairy tales can be woven into the fabric of the story and become something special like Princess Tutu. Adversely, the use of fairy tales can be nothing more than a quick gimmick with no substance behind it. Unfortunately, Ookami-san to Shichinin no Nakamatachi (or Okami-San and Her Seven Companions) falls squarely into the latter of those possibilities.\r\nThe show fallows the exploits of the Otogi Bank, a club in Otogi High School which does favors for students in exchange for returningthe favor  later on. Among the members of the Bank is fierce and tough-as-nails Ryouko Ookami (the 'wolf' in the story as her name might indicate) and her best friend, and little red ridding hood lookalike, Ringo. Unknown to Ruouko she has a secret admirer in the painfully shy Ryoushi... unknown until he attempts to confess to her and subsequently joins the Otogi Bank. Ryoushi wants to get closer to Ryouko, but that is easier said than done as her past has lefter her with a scared and guarded heart.\\n\\n\r\nIf this is sounding like a typical rom-com with a tsudere at its core, it is because that is exactly what the show is. All the fairytale stuff is just kind of stapled on. The rest is the usual school-life anime fixings. From the cast of wacky archetypes, to silly episodic stories, to the tough girl and wimpy guy romance; it is all retread material dozens of other anime series also use.\\n\\n\r\nAdmittedly, the fairytale aspect does add a little extra flavor; seeing classic fairy tales being applied to situations and shenanigans the characters get themselves into has a certain novelty to it. Particularly amusing is the Turtle and Hare rivalry between Otohime and Mimi, along with a few other episodic spins on fairy tales, like the absolutely ridiculous take on Cinderella in the first episode. Not to say that the episodic stories are good, often they are rather hackney, but they can be fun. Another thing that adds some personality to the show is the narrator, who often makes snark comments; making fun of the characters and calling out tropes in the story. This shows that Ookami-san doesn't take itself too seriously, which is good, seeing how over-tread its material is. Still, when you have the narrator taking shot at the story, you know the story is in trouble.\\n\\n\r\nWhen the show gets dramatic, it gets mixed results, mostly underwhelming. While the silly stories in each episode can be funny and amusing, but are all rather weak dramatically. Attempts to appeal to your emotions, like Otsuu's (the maid in the Otogi Bank) need to repay favors or Ringo's relationship with an upperclassmen, ring hollow. Your never really invested with most of the cast to begin with, as they are mostly just background, and trying to make you sympathies with them with only a single episode focusing on them (if even that) feels very forced and ineffective. The only drama that does work is regarding Ryouko's past, and to a lesser extent her relationship with Ryoushi. Unlike a lot of tsuderes, Ryouko has a fairly viable reason for being so fiercely asocial; hiding past hurt behind a brave face. It is also cute to see her warm up and confide with Ryoushi and see him become more bold for her sake. Still, these development are pretty conventional and lack actual complexity, giving the show very little weight.\\n\\n\r\nVisually and musically, the show is rather uninspired. Character designs aren't bad by any means, just generic.  Ryouko's design may as well be a billboard with the words \"I'm a tsundere!\" written on it, not to say her flat-chested figure isn't cute. Ringo is looks like the token cute and mischievous munchkin that she is, and Ryoushi looks just as flat as most male ecchi protagonists. The animation is fine, and character designs stay on model most of the time (usually losing form a little in action sequences), but it feels flat because there is honestly no real inspiration behind it. The music follows suit. Bubbly electric pieces and a few orchestrated ones, the soundtrack isn't really bad, but exactly what you would expect from this type of show, and ultimately unmemorable. Only the cute opening and ending themes are even remotely memorable, and even then, still pretty generic.\\n\\n\r\nOokami-san to Shichinin no Nakamatachi is the kind of show that will fade to the back of your mind shortly after watching it. It really doesn't do anything with its fairytale premise. It is but a single high school rom-com in an ocean of high school rom-coms. The only real compliment that can really be given is that the show does not do anything tremendously wrong.",
            "date": "2012-06-04T00:40:00+00:00",
            "helpful_count": 11,
            "mal_id": 62609,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229558.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/NeverKnowsBest26",
                "username": "NeverKnowsBest26"
            },
            "url": "https://myanimelist.net/reviews.php?id=62609"
        },
        {
            "content": "And so it ends, another 12 episode series that could've made a perfectly good 20+ episode show. I fear this is becoming a trend in the world of animes; well, why not? 12 episode moe-ecchi fests are much cheaper to make than something with a complex plot or characters.\r\nBut Ookami-san is not one of those animes.\r\nI originally started watching this show because I heard about the fairytale references; I love twisted fairytales, so I gave the show a try. But what I found was much more potential than a few laughs, though you get a lot of those too.\r\nStory - 7\r\nThe plot is fairly simple;Ringo Akai and Ryouko Ookami work as part of the school club, Otagi Bank (i.e, translate all those names if you want a few giggles); a club that can solve any problem you bring them, and in return, you must pay them back in a favor, if/when they might need your help.\\n\\n\r\nBut after an incident where Ookami-san is saved by another student during a mission, the club owner realizes that their fieldworkers are shorthanded and recruits said student, Morino Ryoushi, to work alongside Ookami and Ringo.\\n\\n\r\nThe story sounds cliched... until you realize this show is parodying almost every single tsundere anime ever written. And both the characters and the narrator are well aware of it, which is gold to watch! The show pretty much hits every classic moe/tsundere anime reference, and while it milks them for all they're worth, it seems to be laughing behind their back at the same time. And then there are all the fairytale references; everything from the obvious Little Red Riding Hood to some sneaky little in-jokes (my personal favorite is the Puss-in-Boots characters,  humorously named Nekomiya, who un-intentionality ends all his sentences with \"nya\").\\n\\n\r\nOne of the most original parts of this anime is it has a narrator, who tells the story as though reading a book. She is a little annoying, talking over the show from time to time, but she mostly acts as the voice of the viewer and gets some of the best lines. I grew to like this over time. :)\\n\\n\r\nThe story is usually very episodic; each episode covers a new mission and usually a new person in need of a favor, with the exception of 10-11, which is the only two-parter. The end result of this is a VERY large cast for 12 episode anime, and it often feels like we never get to connect with the characters enough because of the setup. \\n\\n\r\nThat is one of the only reasons I rated the story low-ish; it's a great concept, but the length doesn't give the story enough room to grow, even though the show seems to try anyway, which makes the ending even more awkward. Makes me wonder if this wasn't originally intended to be +20 episodes...\\n\\n\r\nArt - 9\\n\\n\r\nThe art is probably the main reason people keep comparing this show to Toradora; the animation styles are almost identical, which is no surprise since they were made under the same studio. xD\\n\\n\r\nNevertheless, the animation is stylish, fluid, bright colored, always cutesy but somewhat deformed, which gives it a certain individuality. The characters are easy to tell apart and the backgrounds are actually very well designed. There are some obvious moe eyes going on here, but it's nothing to the level of Air TV or the like. No complaints!\\n\\n\r\nSound - 10\\n\\n\r\nThe score for this show is always on-par and always fun; the background music never seems to get repetitive either, like some shows do. The voicework is quite skilled, as expected from J.C group, and like the animation, the voices stand out from each other and are very memorable.\\n\\n\r\nThe best part of the sound in this show, however, is the OP/ED themes; they're so addictive! The opening, \"Ready! Go!\", is sung by May'n (who many may know from her work in Macross Frontier as Sheryl) and keeps the mood bouncy and fun, and the song itself makes a wonderfully catchy J-pop single. The ED, \"Little Red Riding Hood\" by OToGi8, has the potential to be annoying, but for some reason, kept me watching every time. I almost never skipped through either theme for the entire show; I loved them too much!\\n\\n\r\nCharacter - 10\\n\\n\r\nI personally think that if the story doesn't get you hooked on this, the motley crew of teenagers running it will. xD The characters here are so gripping and fun, it's harder not to like them, despite the plot flaws.\\n\\n\r\nThe main characters, Ookami-san, Ringo-chan, and Morino-kun, are the best developed in the show, as expected. \\n\\n\r\nOokami-san is, at her most basic, a moody tsundere with a bad temper and trouble expressing what she really thinks. But what I really enjoyed about her is that she is the way she is for a reason; her backstory is actually pretty tough, and you come to understand that her actions and will to fight are not simply meaningless character traits. I kinda felt that the creators didn't develop her character fully, but that may just be me.\\n\\n\r\nRingo is a loli-ish girl who is usually quite polite and thoughtful, but also quite devious. She's a rather enjoyable character with another surprising backstory, and as Ookami's best friend, nicely contrasts the \"attack first, talk later\" attitude that Ryouko often has. And for a cute little girl, she's really quite the manipulator! It's usually for the sake of my best friend and pushing her to be honest with her feelings toward Morino, but really... she's such a devil! ^-^ \\n\\n\r\nRyoushi is a shy boy with expert hunting skills. Out of everyone, I felt like his character stood out the most. There's just something really cute about a scopophobic having to fight alongside a girl like Ookami, and having a crush on her of all things. His devotion and fervor to Ookami may annoy some, but I found it refreshing in a land of cold-hearted, overtly pretty male leads in anime. He's a sweet kid with a lot heart, and brings some of the best humor into the show.\\n\\n\r\nThe rest of the cast, sadly, doesn't develop very much beyond their basic characteristics. They're fun, but as I mentioned above, it often feels like you never get to know them well enough. The only ones that maybe evolve beyond the secondary are Tarou and Otohime, both of whom are simply awesome both separately and as a couple!\\n\\n\r\nOverall- 8\\n\\n\r\nI started this show when it was only two episodes into the Japanese airing, and stayed all the way through. Despite the fact that I watching Kaichou wa Maid sama and second season of Kuroshitsuji weekly as well, this show really became the thing I looked forward to the most! It's a shame it ended so fast, the potential for a full length series was great and I had so much fun watching it, but they kinda hint to a second season, so... *fingers crossed*\\n\\n\r\nBut my overall feelings for Ookami-san are this: the story is simple and definitely shorthanded, but the characters are excellent and the concept is fun. So I would recommend it to anyone who likes humor and parody, as well as good dose of tsundere, or even if you've got 6 hours to kill; it may just surprise you how much you like it! ^-^  \\n\\n\\n",
            "date": "2010-09-17T14:47:00+00:00",
            "helpful_count": 10,
            "mal_id": 30576,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/208285.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PandoraxChan",
                "username": "PandoraxChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=30576"
        },
        {
            "content": "Ookami-san to Shichinin no Nakama-tachi is the kind of anime where you'll quite enjoy it in your free time, and probably this is what this anime meant to be. Honestly, this anime is average as its best but they really and seriously had a chance to make it decent and unfortunately they failed to deliver it to make it great. The concept is relative mainstream but consider it's 2010 anime, i am not sure it's bad idea at all, and the story...yup the weakest part of this anime. So let's begin with this review for every aspects:\r\n-Maybe i unintentionally to give some spoilers, so spoilersalert-\\n\\n\r\n(Story)= 5\\n\r\nWell like i said before, this is the most underwhelming part and aspect for this anime. Let's take a look from the main focus of this anime, there is a tsundere girl called Ookami Ryouko who have been trying for getting stronger and stronger so she can' protect herself without the helps from others because from what she experienced in her \"dark\" past, but guess what in highschool she then suddenly joined with this Bank Otogi without any explanations why she can joined. I mean, she tried to avoid any contacts from people (except Ringo who the only person she can trusts) but the way they never explained it bothered me a little. And then suddenly there is this \"stalker\" called Ryoushi-kun appears nowhere and confess if he loves her just because personally for me a weak reason why he can love her, and then he says will do anything to be in her side (a little bit cliche here). Well as you can see, there are a lot ordinary progress that happen toward the story, but the problem is actually: there is no actual or big progresses at all!!!! I mean, from episode 1-8, people are gonna expecting something bigger gonna happen that can influence both of them to be more closer or a big event who can drive the story to be more creative and awesome, and yes there are some small events happen there, but the impacts aren't that much from what we expect. I won't gonna spoiling more so that's the best i can tell to you about the summary of story in the anime.\\n\\n\r\n(Art)=8\\n\r\nThis is the best aspect of the anime for me. The animation is decent enough, and the quality isn't bad at all, i mean it's 2010 anime so with this animation they actually did a pretty good job for it. The character designs also aren't bad although some of them are pretty weird and mainstream, like this Ryoushi-kun is the type of main character that you'll forget easily, or Ookami herself who look like Aisaka Taiga 2.0 (with more height, but still no boobs lol), and the antagonist Hitsujikai who looks pretty edgy for me. But overall, this aspect is good.\\n\\n\r\n(Sound)=6\\n\r\nKinda meh except the voices acting especially the narrator who i like so much, but the music and soundtracks aren't going to be in my favorite and i am not bothering to skip every opening and ending for every episode of the anime.\\n\\n\r\n(Character)=6\\n\r\nI honestly not really like Ookami at all because actually i am tired of the tsundere character, and this girl is kind of the extreme one. Sometimes i just want her to stop, i mean seriously like stop for acting like a bitch and yes it annoys me a lot, and don't forget the mainstream part she always punches and blames main character even he does nothing, i am pretty sure no one likes this type of cliche right. And her character, yup so complicated, for comparison Aisaka Taiga is also an extreme tsundere but at least she tried to be honest about herself to the person she loves but this Ookami, no...she never even tried how to get close with the persons she cares instead everyone right there who always do it for her especially the main character, but guess what? he always ends up with a punch on his face smh. I know it's a 2010 anime, but even then i still can't stand with this tsundere heroine. And then the mc Ryoushi-kun, who actually has the character developments in this anime, but unfortunately like i said, he isn't so special and doesn't have any great appeal at all, you'll so easy to forget him anytime soon. And the antagonist of this anime is terrible, i don't get his motives at all because they all are so unclear, why he suddenly becomes the student council chairman in rival school? where he have been before? what his actual motive to do that? we'll never know because the anime failed to tell us clearly about it. Besides that, most of the side characters are pretty interesting and good, so this one really saves this aspect for me to this anime.\\n\\n\r\n(Enjoyment)=7\\n\r\nRegardless from the negative opinions i give towards this anime, i'll be honest if i actually enjoy it a lot because i just like the anime who using a school setting as their genre, and if you're like me so i am sure you'll like it too, at least to fill your free time.\\n\\n\r\n(Overall)=7\\n\r\nOokami-san to Shichinin no Nakama-tachi is an average anime, not great but also not really bad at all so if you like the anime with the tsundere heroine as its focus, and school setting with actions as its genre, i can recommend it to you but don't expect it too much for the progresses or anything, because that's the part where this anime failed to deliver..",
            "date": "2017-12-14T11:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 265203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3913183.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Crocospect22",
                "username": "Crocospect22"
            },
            "url": "https://myanimelist.net/reviews.php?id=265203"
        },
        {
            "content": "Oh look! Another moe-moe animu! Is it just another merchandise driven and annoying piece of crap or is it something actually pretty decent and enjoyable? Fortunately, Ookami-san is the latter, although I have some qualms with it.\r\nIn a nutshell, the plot is pretty simple. (Go read MAL's synopsis.)\r\nWe’ve heard the “We help people in an episodic fashioned!” plotline many times before. Wash, rinse, and repeat. Bakemonogatari, To Aru Kagaku no Railgun, and a lot more basically, but Ookami-san gets away with it, because its just so damn likable, despite the very derivative nature of it. Ookami-san is not trying to be the most unique ororiginal, its just one of those non-pretentious anime where you can sit back, relax, and watch the characters do some crazy stuff. And in that regard, Okami-san delivers in its fairy tale referencing glory. If the characters weren’t so enjoyable, this anime would have utterly failed.\\n\\n\r\nNow, the characters themselves are pretty much all moe/harem stereotypes that we’ve seen before, but with a slight tongue-in-cheek air about them. We have the socially inept guy, the classic tsundere, the meido girl, the mad scientist, the token loli, the obsessive lover, the list goes on and on. But somehow, I actually liked the characters and they’re quirks. They’re not too annoying or aggravating and I enjoyed all of the cliched situations the characters would find themselves in. From popularity contests, pool time, Meido dress up, fireworks, mock dates, you name it, this anime has it all. I know it sounds like played-out drivel, but Ookami-san’s self aware nature makes it all worthwhile. I mean, Ookami-san plays the genres tropes so straight that it has to be a homage or a parody, adding the fact that there is a narrator, who points out the cliches in the story also proves my point even further. Although, the narrator can get overbearing and unfunny at times, she does a great job of saying exactly what the audience would say of the cliched nonsense and for the most part, shes pretty hilarious.\\n\\n\r\nThe characterization for the male lead Ryoushi is very well done. He starts off as a  pitiful loser, but then becomes a stronger individual through his ambition and determination to protect Ryouko and love her. Which makes him the most layered and rounded character unfortunately, because everyone else just stays grounded in they’re archetypes with no real drive of their own. Sure, some of the cast receive episodes catered to them, but they never really add anything new to their stereotypes or even get anything important to the plot accomplished. Which will turn off people who have no tolerance for moe or harem, since Okami-san is very much one of those “otaku-centric” anime. I honestly didn’t mind it, but Ryouko’s character really pissed me off the most. Despite several of the hardships Ryoushi endure in order to prove himself to her, she stays seated in her tsundere bullshit. *Slight Spoiler* Instead of having her character develop and finally confess her love to Ryoushi, since its painfully obvious, you know what she says “I don’t dislike him” Are freaking kidding me? That’s all you have to say Ryouko after all of the events in episode eleven!?! Give me a break. This alone completely shattered anything I liked about Ryouko previously, and made her just another poorly written tsundere. The conclusion as a whole itself, is unsatisfactory as well. It just ends. No real resolve to anything or goal reached. Hopefully J.C. Staff will produce another season.\\n\\n\r\nThe production values for Ookami-san is excellent! Easily one of J.C. Staff’s best animated works. Filled with fluid, realistic, and fast paced movement with wonderfully fanciful, vibrant, and colorful artistry. Attractively cute moe character designs and highly detailed backgrounds. I was actually in shock by the pure effort that was put in the imagery. Ookami-san is in no way a bad looking anime. The music is pretty well done too. Even though Ready Go!; the opening theme, Is not May’n’s best performance, it fits with the upbeat and whimsical nature of the anime. The  ED is also pretty catchy too.\\n\\n\r\nAnother great aspect about the anime is in the voice work. The seiyuu voice all of the characters with such life and cooperation with one another. I especially like to point out Ryouko’s voice actress; Shizuka Itou. I’m so glad J.C. Staff used another seiyuu for one of their ‘premiere’ tsundere’s. Rie Kugumiya is over used, thank goodness Shizuka played Ryouko with such differentiation from Tiaga, Louise, and Shana. Ryouko is more brash and masculine than your average tsundere, so of course she’ll need a different voice and Shizuka definitely fitted the bill perfectly with her performance. Also, Satomi Arai as the narrator is freaking brilliant! ‘Nuff said. In fact, any fans of the To Aru series will definitely get a kick out of the voice work as many of the seiyuu from Raildex return here.\\n\\n\r\nOverall, Ookami-san is all out otaku pandering fest. You’ll love for all of the stereotypes and clichés or you’ll hate it for that same exact reason. It was a fun ride, but damaged by the lack of development, a terrible ending, and a lack of progression in the plot and characters. Its basically one of those ‘time-waster’ anime. Not excellent or riveting, but not disposable either.\\n\\n\r\nCopy & pasted from my Tumblr: http://chibimonogatari.tumblr.com/post/1144220277/ookamisanteenchibireview",
            "date": "2010-09-18T20:41:00+00:00",
            "helpful_count": 9,
            "mal_id": 30609,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/252934.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KrazyKobun",
                "username": "KrazyKobun"
            },
            "url": "https://myanimelist.net/reviews.php?id=30609"
        },
        {
            "content": "Too Long Don't wanna Read: Yea, Ookami-san to Shichinin no Nakamatachi isn't bad, but its not good either. \r\nREAL REVIEW:\r\nThe whole thought of an anime based on fairy tales intrigued me(which is why I watched the entire thing) yet fell short when they dropped the whole fairy tale thing near the end.\r\nThere are some logical fallacies like how the \"hunter\" in this story is in love with the \"wolf\" and not \"little red ridding hood\" - if I get my facts straight hunter kills wolf and saves granny-(not seen) and red ridding hood, but w/e.\r\nHansel and Gretal are seen at brief intervals during the animewith some-sort of incesty feelings towards one and another but they deny their incest so i guess its ok. \\n\\n\r\nThey do some referencing in the anime-notably ToraDora and some other anime.\\n\\n\r\nAgain these are just lentils compared to the real chunk in which we dive now.\\n\\n\r\nThe main characters work at a \"favor\" bank where they do favors for students expecting favors back. weirdly enough they seem to be spending favors faster than they could make em seen in a swimsuit ep(sigh) where they blow their savings on telling the students not to vote for their own bank employees. \\n\\n\r\nAnyhoo that being the setting the real dilemma is that something happened to Ookami(wolf) by a mysterious guy which turned her mentally into a man, being aloof in trait and does boxing, \\n\\n\r\nDue to that trait Morino(hunter) and Akai(Red Riddin) get attracted to her, where they get feelings of \"ooh she is strong\" and \"I want to protect you\" which seems to be the generic feelings these days of making girls strong yet need to be protected - because they are girls.\\n\\n\r\nAlso Morino is sociophobic which means he unable to look at people, reason for it- because he is a hunter and takes comfort in seeing and not being seen, which is weird because Snake in Metal Gear Solid takes this to an extreme and he himself is not sociophobic at the least. Anyway He confesses to Ookami because thats what sociophobes do, and tells her his confession to which he gets denyed but denial isn't something that bothers Morino because later he joins a team with Ookami and uses events and flag points to sway her to his favor. \\n\\n\r\nEnding goes something with enemy school de la ghetto decides that even though they got beaten by Morino and Ookami, they can take the entire bank, which starts with kidnapping Ookami. Ohoho but soon they realize that it was all masterminded by Ookami's past loved one, and as Morino and (past loved one) fight it out, (which oddly PLO had a knife yet never used because advantages are unfair) Ookami gets over the past trauma and Morino and Ookami both win, which is to say until the Bank decides to leave them alone and negotiate through IMs. \\n\\n\r\nLast Minute Notices:\\n\r\nNarrator talks over the people sometimes, which is annoying as hell. \\n\\n\r\nThis anime parody's scene shots which is funny till overused. \\n\\n\r\nMorino has a lisp and is very bipolar with his sociophobe so take it to account. \\n\\n\r\nOther than Ookami and Morino, all other characters are very minor, even the main bad guy.\\n\\n\r\nSo in the end this anime is like putting ketchup on potato chips, yes its something you might wanna try, but there are so many better things to eat, like potato chips in sandwiches. \\n\\n\\n\\n",
            "date": "2011-08-11T10:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 41273,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/535495.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AceStar",
                "username": "AceStar"
            },
            "url": "https://myanimelist.net/reviews.php?id=41273"
        },
        {
            "content": "I made an account just to review this show because thus far it has annoyed me so greatly I cannot stand it anymore. \r\nHere I am trying to enjoy this somewhat fun and interesting show with a basic plot and the narrator will not shut their god damned mouth. Can't go thirty seconds without them butting in and giving useless information or witty remarks on bust size or remarks on people personalities which are CLEARLY indicated through their actions. I DO NOT NEED A DAMN NARRATOR TO TELL ME A GUY IS A PLAYBOY WHEN he is BISHI and all over a girl he justmet. \\n\\n\r\nI DO NOT NEED A NARRATOR TO TELL ME THAT THE PEOPLE I AM SEEING ARE FROM 10 MINUTES PRIOR AND DELINQUENTS.\\n\\n\r\nI especially do not need a narrator talking OVER the characters and drowning them out. I'f I were japanese watching the original and not the subbed I would hardly know whats going on as the characters will jumble what the narrator is saying them likewise in reverse.\\n\\n\r\nIt was a TERRIBLE idea to have such a narrator.",
            "date": "2012-08-23T20:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 70715,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gezodiac",
                "username": "gezodiac"
            },
            "url": "https://myanimelist.net/reviews.php?id=70715"
        }
    ],
    [
        {
            "content": "Once upon a time there was a series of light novels by Masashi Okita that played around with certain well known fairy tales. Due to a strange twist of fate (or a complete lack of ideas), the series was chosen to be adapted into anime form, and they all lived happily ever after.\r\nWell, not quite.\r\nDirected by Iwasaki Yoshiaki (Gokujou Seitokai, Wagaya no Oinari-sama, Gunbuster, Love Hina), Ookami-san to Shichinin no Nakamatachi (Ookami-san and her Seven Companions), follows the adventures of Ookami Ryouko and her colleagues from the Otogi Bank as they solve people's problems, right various wrongs, fight delinquents, and generally act as all roundbusybodies.\\n\\n\r\nNow where have I heard that before?\\n\\n\r\nThe main problem with Ookami-san is that it suffers from the same flaw that almost every novel adaptation has - an inherent lack of detail. That's not to say that the story doesn't work as there are plenty of things already in the tale that are interesting enough. The plot, however, is haphazard in its approach, and a number of points never get explained over the course of the series. Because of these two factors, the story never really reaches the level where the viewer can become engrossed, and in all honesty the only reason I finished it was because I was playing \"Spot the Fairy Tale\".\\n\\n\r\nAs I mentioned before, the franchise plays fast and loose with several well known fairy tales like Little Red Riding Hood (complete with wolf and hunter), Momotaro (with dumplings), The Hare and the Tortoise (which was changed to a turtle for some reason), Urashima Tarou, Snow White and the Seven Dwarfs, Hansel and Gretel, The Little Match Girl, Puss in Boots, and probably a bunch more. Unfortunately, there's a side effect to incorporating specific elements of other stories into your own and that's exactly what happens here.\\n\\n\r\nIf one is able to disregard the lack of focus and detail, there's still the creativity barrier to overcome and it's here where the everything falls down. While the story may have some interesting aspects, the usage of fairy tales places quite a heavy dampener on innovation and it shows in Ookami-san in many ways, from  relationships (Usami Mimi and Ryuuguu Otohime are inclined to hate each for example), to character design.\\n\\n\r\nIn all honesty, J.C. Staff have produced a fairly decent looking show for the most part. The animation is generally fluid throughout the series, but there are one or two telltale signs of corner cutting during the fight scenes. The backgrounds and settings are pretty standard fare for anyone familiar with high school anime, and while there are no real feats of originality, there are also very few major flaws. The real problem with the overall look of the show though, is the inherent lack of innovation I mentioned earlier.\\n\\n\r\nThis is where it all gets a bit tricky. On the surface the casual viewer may consider the design of certain characters to be quite original, for example Akai Ringo is supposed to be Little Red Riding Hood and this reference is prominent in her clothing throughout the series. Certain other characters follow this design pattern to highlight the fairy tale they are based on, while others are a bit more subtle with their reference. One of the main issues with this approach is that it impacts on the relationships between the characters, and the reason for it may not be obvious at first. Once the viewer understands the reference then everything becomes clear, however Ookami-san only really works on that basis.\\n\\n\r\nOne point in the show's favour is the sound quality, as the effects are fairly well realised and choreographed. Unfortunately the music isn't up to the same standards. That's not to say that it's bad, no, it's simply that it's all been done before.\\n\\n\r\nHere's what I mean. The OP, \"Ready, Go!\" by May'n is a boppy J-pop track that doesn't leave any impact whatsoever. The ED, \"Akazukin-chan Goyoujin\" (Careful Akazukin-chan), by OToGi 8, is a strange mixture of J-pop and chip tunes that is equally forgettable. The rest of the music throughout the series doesn't really add much to the atmosphere of a given scene, and the proof of this lies in the numerous occasions where no music is used as there is very little difference in terms of impact.\\n\\n\r\nOne of the main sound problems with Ookami-san though, is the narration. There are far too many occasions where the viewer will be trying to pay attention to what the characters are saying, only to have it drowned out by Arai Satomi pretending to be an old time storyteller. As for the acting itself, the seiyuu are generally pretty good, with Itou Shizuka and Itou Kanae playing the roles of Ryouko and Ringo with a degree of aplomb (one does have to wonder if the casting was purposeful though). Irino Miyu gives a respectable performance as the sociophobe and prospective beau Morino Ryoushi, especially when he switches between coward and manly mode.\\n\\n\r\nThe rest pf the cast deliver some good all round performances but, like the rest of the series, the lack of originality means that they simply can't sink their teeth into the roles. The prime example of this is the fact that Ryouko is, yet again, quite literally the \"sheep in wolf's clothing\".\\n\\n\r\nNow I will be honest here. I'm tired of the typical tsundere loli character and would personally like to see more variety in that department. Surprisingly, it seems as though Ookami-san has made some efforts to move away from the archetype. There are attempts to justify the persona of each character to a degree, and although the results are a bit of a mixed bag, the fact is that this makes the show more interesting than it would otherwise have been. The series takes great pains to delve into the personal history of its lead characters, and some of the resulting stories are handled rather well.\\n\\n\r\nBut that's all there is to it. Once their stories are told the characters go right back to how they were before, with the only real exceptions being Ryouko and Ryoushi. But that's not my main gripe where the characters are concerned, no, the real problem here is that there are no reasons or justifications, either in the story or otherwise, for the actions of Hitsujikai Shirou, and the lack of any information leaves the viewer wondering what the hell is going on.\\n\\n\r\nNow, while Ookami-san isn't a truly great show, it's not actually that bad on the whole. The series has a number of interesting aspects and relationships, and is entirely watchable as long as you aren't overly critical about it. Unfortunately there are occasions where there is simply too much going on at once, and the viewer may find themselves going back over certain scenes in order to fully understand what has occurred.\\n\\n\r\nOne thing I did like were the cameos from ToraDora! and Toaru Kagaku no Railgun as, while they may not be my favourite shows, it made the anime into something more of a visual game (spot the reference).\\n\\n\r\nIt's strange how many shows these days are adaptations of other media, and it does make one wonder if anime studios have hit a creative wall. Whatever the case may be, Ookami-san is a decent attempt at adapting a novel series, and while it does have its flaws, the show is entertaining enough for at least one viewing. Granted it may not be everyone's gingerbread house, but those that like school based romantic comedies won't find themselves too disappointed.\\n\\n\r\nNow can we please find a different character type as I'm tired of of all the tsundere lolis.\\n\\n",
            "date": "2010-09-17T17:03:00+00:00",
            "helpful_count": 350,
            "mal_id": 30578,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=30578"
        },
        {
            "content": "Foreword:\r\nDue to the lack of (In my opinion atleast) intelligent reviews for this anime thus far, I figured I would take the time to write one. I would like to note however, that this is only designed for users to see if they might be interested in spending their time watching this show. I have no idea how this show will end, as I am only a few episodes in, however, I will try to make this as helpful as possible. So, if the show magically starts being terrible don't come after me with flaming sporks. This is only a review for the first 3episodes (for now).If you think I didn't do a good job reviewing those episodes, then please, bring your spork army. On to the review!\\n\\n\\n\\n\\n\r\nThus far, Ookami-San is a rom com WITH A TWIST. *cue what a twist soundboard*. Like a standard romantic comedy, it has some interesting characters that slowly seem to bond from various events. Lame, I know. The way Ookami san does it is interesting however. A majority of the episodes are parody's  of classic fairytales. \\n\\n\r\nThe way its done is not only smooth, but exceptionally entertaining. It's to the point where if you know of the story, you can catch the references immediately and if you have never heard of the tale the show is still crisp and you won't be left confused for the most part. \\n\\n\r\nThe show is  full of plenty of colorful characters, from the main ones Ryoushi(Wimpy kid who has a crush on Ookami, I'm sure you can guess how character development will go with this one) and Ookami (Translate for epic giggles) to the typical lolis and ladies man. There really isn't a character that will make you go crazy for, but there is not any characters that will annoy you to the point you will  immediately drop the show, so I can't really complain. \\n\\n\r\nWhile not a huge deal, I'll toss this in here. The opening theme is decent. Not good, but not horrendous. I can stand watching it instead of ffing past it which is a pretty big deal for me atleast.\\n\\n\r\nOverall, the show is enjoyable and just that. This isn't an angel beats or code geass or whatever anime really tickled your peach in the past. Its just a show that is refreshing, humorous, and  darn entertaining. \\n\\n",
            "date": "2010-07-21T18:42:00+00:00",
            "helpful_count": 56,
            "mal_id": 28732,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/322758.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Clous",
                "username": "Clous"
            },
            "url": "https://myanimelist.net/reviews.php?id=28732"
        },
        {
            "content": "It could have been something decent, but instead Ookami-san to Shichinin no Nakamatachi reeks of mediocrity. The art work and animation was actually pretty and appealing, but the terrible story and cast of characters makes this series a pretty little scab you want to tear off. The rag tag bunch of characters have a very minor development and role so it'll feel as if most, if not all, of the characters are a side note. Even the story leaves you hanging till the last episode. At the end of the series, you will ask yourself, \"That's it? What the hell was I watching this for?\".I'm sorry to say this, but I felt as if the writer of the series did a half-assed job and produced a story about kids doing random things without any plot or motive. I say this series was a wild goose chase. I recommend it to those of you who have nothing to do and just want to kill time.",
            "date": "2011-08-07T13:32:00+00:00",
            "helpful_count": 56,
            "mal_id": 40943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/muckgaiver",
                "username": "muckgaiver"
            },
            "url": "https://myanimelist.net/reviews.php?id=40943"
        },
        {
            "content": "Ookami was one of the more popular series of the season. Why? Beats me... Was it because of J.C staff? Despite their many successes, I find Ookami to be an incredible bore.\r\nLet's start with this: I really hate the narrator. I feel that shows that uses narration heavily are due to the director's lack of ability to convey plot and emotions, and that can't be more true for this show. And I hate Satomi Arai.\r\nThere are only a few instances where I can follow the character's train of thought, though that wasn't suppose to be hard due to the incredibly simple storyline. The main antagonist isso one-dimensional, it feels like he's a last minute addition as a plot device. The climax of the story is just... Can you even call it a climax? I don't even feel the slightest sense of excitement during that. It feels like a cheap way to end the series, and it leaves so many questions but I couldn't really be bothered any more.\\n\\n\r\nThere's so little material for the main storyline that most of the series focuses on stories of the supporting characters... Which none was really interesting, but at least it's better than the main plot. I suppose Ryoko's tsundere personality is suppose to sell, but beyond that trait, her character got no depth at all. Ryoushi's really irritating as a main character. As a wimp he can't even go to GAR mode properly... You'd hope he'll actually grow up by the end of the series, but all he managed is to overwhelm the bad guys with the final blow like a typical Shounen protagonist.\\n\\n\r\nThe animation and songs were good. I wont expect any less from J.C staff though... Well... Let's just leave it at that.\\n\\n\r\nI think the only thing that this show gotta sell of is Ryoko's tsundere... But come on, really? This is a lame piece of work.\\n\\n\r\nPlot/Concept: Lame\\n\r\nStory Style: Booooooring\\n\r\nAudio/Visual: Great\\n\r\nValue: 3",
            "date": "2010-10-24T09:57:00+00:00",
            "helpful_count": 35,
            "mal_id": 31572,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/22253.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/du5k",
                "username": "du5k"
            },
            "url": "https://myanimelist.net/reviews.php?id=31572"
        },
        {
            "content": "Ookami-san to Shichinin no Nakama-tachi\r\nThe fact that this is a wasted potential is a shame, this could have been greater than what ended to be.\r\nStory\r\nThe story started very good i was really interested to follow it but then just started to be more of a comedy/parody without the romance that at some point you think will happen, never happens, and that was annoying, it was really interesting almost every job they did for people, so for me was good.\r\nArt & Sound\r\nBoth were like you think will be, good character design and colorful landscape. The sound was good, it was really enjoyable, the VA was good.\r\nCharacter\r\nThisis what the anime is, they really were very good and funny, there's a great variety of characters from fantasy books and you will recognize them, the ones that i liked were Ringo and Ryoushi who at first might seem like a wuss but he shows that he can be a badass for Ryouko and Ryouko was too tsundere for me, she hides her feelings for Ryoushi and never accepts them, not even when everyone sees it, and i hated that she didn't appreciated what Ryoushi did for her other and they have backstories and almost everyone were well developed deeply.\\n\\n\r\nEnjoyment\\n\r\nI could have enjoyed this more, but i couldn't because of that bad ending and Ryouko being how she was so overall was good.",
            "date": "2015-08-07T11:21:00+00:00",
            "helpful_count": 34,
            "mal_id": 195432,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195432"
        },
        {
            "content": "Translating a book into a movie or show is always a challenge for developers. Why? Because taking all the information contained in a book and trying to cram it into a 2 hour movie is near impossible. So why do developers constantly try and do what seems impossible? Well it is my opinion that books have an uncanny ability to truly capture a readers attention with the use of two things, characters and story. The attention to detail and the ability many authors have to flesh out a character or grab a readers attention with interesting plot twists is what has kept books from dyingout for so long. And so we come back to the question, why do developers try and do seems impossible? Maybe it is to try and reach a new demographic in a day and age where reading just isnt \"cool\" or \"in,\" or maybe developers would just like to create there own interpretation of the original work or maybe they just want to cash in on the success of the book. Whatever the case, developers have tried countless times to try and recreate the magic of a certain book in visual form, and the outcomes range the full spectrum of great and horrible. When it comes to anime, in my opinion, there is one thing that will truly define whether the developers rendition will succeed, time. \\n\\n\r\nOokami-san to Shichinin no Nakamatachi is based off the light novel of the same name and follows the adventures of Ookami, Ryoushi and the group they work for, Otogi Ginko (Otogi Bank). This anime's story really had everything going for it right from the start. While the story's structure is by the books, little details kept things fresh and exciting. With a change up of action and romance things were fast paced and while this is not unusual for an anime story line and maybe not original, I couldnt help but smile at parts or notice myself getting drawn in. And yet, this anime's biggest downfall is its story. Why you ask, after all my praise do I say that the story is this anime's achilles heal? It comes back to what I said in my opening comments, time was what brought this anime to its knees. \\n\\n\r\nWhat Ookami-san (abr. title) really needed was 24 episodes, maybe even 32. While the story and characters are all very enjoyable, because of this anime's short length, you only seem to graze the surface of everything. You never seem to get the chance to get deep into things, get under the character's skins and see what they see, essentially immerse yourself. Even the story, we only seem to be looking at the tip of the ice berg in the anime, and even the more interesting elements, such as the antagonist only seem to be an after thought, a \"reason\" given to the \"good\" guys to fight evil. I have not read the light novels, but I feel as though the story was not given enough thought. With what I saw at the start, there was more than enough material to really delve deep and grab the viewers attention, and yet instead we are side tracked with usual anime shit such as the usual \"moe moe\" we all seem to want. And while much of the story may seem cliche at times, there was a lot of squandered potential. By the end of the anime, most would have realized that there would be no \"real\" ending, and things would be left unattended. Which is unfortunate because like I said numerous times, Ookami-san had so much potential, so many more characters which could have been developed more, so much more story to be revealed, so much more plot. It all seemed so rushed. My feeling was the developers were trying to cram as much of the story in as possible, but by doing this they were unable to get to the essence of the plot, and unable to draw viewers in. \\n\\n\r\nOokami-san does have some solid strong points though. The animation was very well done, with fight scenes that were enjoyable and smooth. The art was also extremely pleasing, with very good character models and detailed backgrounds. The sound was done very well also, with great voice actors for the main characters, and sound quality that while not outstanding, surely stands above other series in the same genre. Really, by the end of this series, it was these qualities that kept me coming back and allowed me to finish the last few episodes. But anime is not all about the quality of its art or animation. \\n\\n\r\nAs I stated at the start of this review, Ookami-san's biggest weakness was its time management. This show desperately needed 24 episodes. What started out as a great show, by the end left a bad aftertaste, and not because the story or characters itself were bad, but because of squandered potential. It is not impossible to adapt a book into an anime, as there are many examples of great adaptations, but what needs to be addressed when attempting such a difficult task is time. What amount of time is needed to truly convey what the novels were trying to convey? How much time is needed to truly recreate the story? How much time is needed to delve into the necessary characters and develop them? And unfortunately with Ookami-san, the developers didnt seem to ask themselves these questions.",
            "date": "2010-09-16T21:51:00+00:00",
            "helpful_count": 27,
            "mal_id": 30557,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/270172.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/musashi7",
                "username": "musashi7"
            },
            "url": "https://myanimelist.net/reviews.php?id=30557"
        },
        {
            "content": "Just watched the second episode of the anime, and here is what I can say:\r\nWhat I like best about this anime is it's originality. It is an interesting idea of using the plots of the worldwide known tales and fables, even though it could sound like a re-post, there are many parodies of such. But here it adds additional shine and depth to the personalities of different characters and makes it easier to follow. Thanks to this, they don't even need to use a whole episode to introduce each character - it's not hard to remember everyone of them - and the whole team actstogether straight from the beginning, which doesn't happen often.\\n\\n\r\nThe eyesight-fearful \"Hunter\" is considered by me as a rather rare personality, and with his awesome, I could even say cute ending ~su, he truly is something worth of mentioning.\\n\\n\r\nThe second part of it's originality is difficult to get used to. The \"storyteller\" (those who have seen Railgun can say it's Kuroko, Misaka's roommate from the Railgun anime) tends to speak over the speeches of the main characters. I just can't get it over with, and so I watch the scene again, until I've heard both the storyteller and the characters talk (in my case I mean until I've read all the subtitles). And the main thing is, usually both of them are of none importance to me. While I've already noticed the things the storyteller explains, the main characters have a simple chat. So, don't get confused by overhearing something and move on. And remember the texts from Bakemonogatari, which are also not intended to be read properly.\\n\\n\r\nWhat comes to the real plot, it has nothing special. A team of students with different specializations solving things, with a little love-comedy in it, a strong girl on the outside but soft in the inside an so on. And it doesn't seem it'll get better than that.\\n\\n\r\nBut due to the great characters, I think I'll watch on. And this is not a bad anime, no. But quite far from a masterpiece. For those who want masterpieces, watch Beck and Phantom first.\\n\\n",
            "date": "2010-07-08T14:23:00+00:00",
            "helpful_count": 20,
            "mal_id": 28116,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Danim3",
                "username": "Danim3"
            },
            "url": "https://myanimelist.net/reviews.php?id=28116"
        },
        {
            "content": "(This review is only based on the first episode seeing as the series aired July 1st and today is July 4th.)\r\nThe underlying story is a time tried classic. Wimpy/shy/problematic guy confesses to overly strong/proud/manly girl and is initially rejected leading to the guy spending time trying to prove his worth.\r\nNow, beyond that we have the organization with the crazy/eccentric/cool people who do jobs to help other people which includes the main girl and soon after the guy who confessed to her.\r\nThough while we have these basic plot devices, the execution of the story is fairly unique with the first episode twisting a classic fairy taleto fit the settings as well as leave you laughing at it's execution and result.\\n\\n\r\nIs it an intellectual piece? No. Is it a landmark series? No. Is it another run of the mill anime? No. Will it leave an impression on you and the urge to watch the next episode? Yes.\\n\\n\r\nWhat do I think?  It's a good, solid series and worth the 23 minutes to at least watch the first episode.\\n\\n\r\nWhy do I say this?\\n\r\nThree words:  Kitten Knuckle Gloves.",
            "date": "2010-07-04T12:14:00+00:00",
            "helpful_count": 19,
            "mal_id": 27963,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/260423.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xbsquirrel",
                "username": "xbsquirrel"
            },
            "url": "https://myanimelist.net/reviews.php?id=27963"
        },
        {
            "content": "I began watching this series on a suggestion, I'd been complaining to a friend about the lack of well balanced and strong female lead characters. So he suggested I watch this because it was exactly what I was looking for, and I trusted that, he's hardly steered me wrong.\r\nI was severely disappointed to the point where I was just overall very sad and upset. Sounds silly but, I went in expecting a good solid story line which a cast full of characters that were different in their own way, and a strong female character that really made the series. What I was greeted with wasthe same every day crap I was trying to avoid, \"Women are weak and they need Men\".\\n\\n\r\nOokami got down played once again by the male lead, which was exactly what I was hoping to avoid. I've never given an anime this low of a rating before, if I wanted flesh bags wagged in my face this would be the perfect anime to do it. Yet when looking for something with a lot more weight and meaning it fell short on all accounts and was a huge disappointment!\\n\\n\r\nNot only that...seeing Ookami nearly hit the peak of a strong woman, only to be yanked back down by a man was too sad to watch. I tried to finish it but, I couldn't unfortunately. So I extend this warning, if you're looking for something that'll exhibit the true strength of a woman both physically and emotionally, you won't find it in this anime. If you're looking for fan service, then please, give it a shot, it'll be right up your alley.",
            "date": "2011-08-16T22:04:00+00:00",
            "helpful_count": 19,
            "mal_id": 41627,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/346026.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/rojocharmander",
                "username": "rojocharmander"
            },
            "url": "https://myanimelist.net/reviews.php?id=41627"
        },
        {
            "content": "If you want a short + straight answer, feel free to skim or just skip to the \"OVERALL\" part.  :)  My 2nd anime review: \r\nSTORY- 7\r\nOokami-san to Shichinin no Nakamatachi has a stable storyline, which really just involves a group of high school kids called the Otogi Bank who fulfill students' requests. And in exchange for helping them out, their client has to owe them some sort of favor. Not an entirely exciting, nor original concept, but I do enjoy how this anime have a bit of a fairytale-like theme to it.. --mixed in with romance, action, comedy, drama, and even anime references(such as Zero no Tsukaima & To Aru no Railgun). The story doesn't progress too much from there, and they continue on each & every episode about helping a new client. It also often focuses the episodes on telling us more of the characters' past.. or more development on the romance between Ryouko & Ryoushi.\\n\\n\r\nART- 9\\n\r\nThe animation is rather fantastic in this. I adore the cutesie looking character, despite the fact that they overdo it sometimes. Lots of pretty girls.. and several decent-looking guys. No complaints here.  \\n\\n\r\nSOUND- 8\\n\r\nMany famous + talented voice actrors/actresses we can recognize from here, like Irino Miyu (Syaoran-Tsubasa Chronicles), Itou Kanae (Amu-Shugo Chara!), Toyosaki Aki (Yui-K-On!), Kugimiya Rie (Shana & Taiga & Louise), Horie Yui (Yuuki- VK & Minori-Toradora!), and tons more.  They are very well-suited for their roles, so no complaints here, either.  I absolutely LOVE the narrator who's very much amusing through-out the series, giving us info. & random comments. ( I'm sure her voice will ring a bell, too.) The opening (sung by May'n-- also known as Sheryl from Macross Frontier) & ending themes are good, but nothing memorable, nor catchy.\\n\\n\r\nCHARACTER- 8\\n\r\nThere are a lot of development with the main characters and even the side characters' development.  Lots of the characters' type are cliche, and we've seen them one too many thems.  In this case, I don't mind because all the characters are entertaining.  I must say that our main guy, despite being that same-o \"plain\" guy-type, he has 1 original aspect: phobia at being looked/stared at.  With that, he is no longer that cliche \"nice\" & \"average\" guy.  All the characters are to a satisfactory level.  I like ALMOST all of them.  :]\\n\\n\r\nENJOYMENT- 8\\n\r\nI really did enjoyed watching this series. It was possibly my favorite 2010 Summer anime. I laughed, and I may even have cried..(or maybe not..my memories are kinda blurry) for this one certain scene. Each episode were amusing, and a few of the stories seriously touched my heart.\\n\\n\r\nOVERALL- 8\\n\r\nI think it is TRULY worth-watching.  Not the best series.. Actually, FAR from it (it is what to be expected from a 12-episodes anime). But it has some pretty darn good contents. Give it another season, and Ookami-san to Shichinin no Nakamatachi might turn into something BIGGER. I also will give it props for not turning this into another harem.. which is kinda surprising (considering how a HUGE majority of the characters are females). A few light fanservice here & there, but I won't label this series ecchi.  \\n\\n\r\nThank you for reading.  Hope it helps even if just the tiniest bit.  ^^",
            "date": "2010-09-24T23:36:00+00:00",
            "helpful_count": 17,
            "mal_id": 30771,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/47992.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/FeelingBlue",
                "username": "FeelingBlue"
            },
            "url": "https://myanimelist.net/reviews.php?id=30771"
        },
        {
            "content": "A high school rom-dram-com with potential ends up squandering most of it because of some all-too-common faults in the anime industry. I seem to be on a streak of reviewing anime that I think blew their chance, but here's why Ookami-San and Her Seven Companions missed its shot.\r\n-Story-\r\nSticking several fairy tale characters from various stories together is by no means an original premise ('Fables' comes to mind) but it can still be enjoyable to watch old characters in new ways. The story is mostly episodic, following the staff of the Otogi 'Favors' Bank from case to case as they work to sort out various problemsaround the school. However, it suffers from badly handled tone shifts between scenes covering main heroine Ryouko's relationship to the main antagonist, and the parts where it's the just the main cast solving problems (without spoiling too much, roughly halfway through the series we learn something about Ryouko's past that fundamentally increases the seriousness of the series- but the show still tries to revert to the same comedic tone shortly thereafter). Also, the story misses its chance for a conclusive ending both dramatically and romantically, punting on both accounts and settling for making the final episode effectively filler (I realize this is an adaptation of only part of a series of light novels, but unless a show has a guarantee of a second season, giving open-ended finales just screws the fans over. Come on, how often does a show that ended inconclusively in the hope of getting a second season ACTUALLY get a second season?). The episodes can be enjoyable, but botched tone shifts and the \"Maybe Ever After\" ending keep the story from being anything special.\\n\\n\r\n-Art-\\n\\n\r\nGo take a flying leap, narrator, Ryouko looks great without two cantaloupes strapped to her chest! VIVE LE PETITE MADEMOISELLES!!! Ahem... now that THAT'S out of the way on to more serious matters...\\n\\n\r\nThe art is bright and colorful, but it's nothing we haven't seen before. I'd say aesthetically it was pretty similar to Toradora! (J.C. Staff produced both shows, so that's not unthinkable). I can't think of much to say beyond how quality is good and the style fit the show. Character designs incorporate elements from the fairy tale character each cast member is based on, with varying degrees of subtlety, creating fine designs but nothing that will go on lists of 'Most Originality'. Ryouko was a little unique in that the fan-service focused largely on her legs ( not the most common part of the female form to center on ) but didn't subvert any tropes beyond that. Main male character Ryoushi has an entirely generic and forgettable look. Main antagonist has the 'white haired pretty boy' design that stopped being original sometime around when Griffith sacrificed the Band of the Hawk to gain demonic powers.\\n\\n\r\n-Sound-\\n\\n\r\nBrina Palencia seems have a certain knack for playing wolf-girls (she gives them a certain 'spice' you might say). Her performance in the English dub can cover a variety of emotions and tones well and is the best performance overall.  Narrator Luci Christian provides a great deal of comedy with her often sarcastic take on the on-screen events (\"Oh look! A fan-service shot!\") None of the other voice truly stood out, but I can't find faults with them either. The OP and ED are catchy, but nothing to go buy and download, and the OST is mood music without a standout track.\\n\\n\r\n-Characters-\\n\\n\r\nMale lead Ryoushi is a character I connected with very quickly, but largely due to personal reasons (I also spent a good chunk of my high school days as a shy, cowardly guy in hopeless pursuit of various serious, talented, energetic girls who weren't going to swoon for just any random bloke) not because his arc is overwhelmingly unique or well-done. His storyline is undermined by constant resets after each time he does something cool in order to maintain status quo. By the end of the series I was able to actually time these character resets (\"OK, he's going to do something cowardly in 3, 2, 1...\"). The \"Cowardly Push-Over Becomes A Heroic Badass And Saves The Day\" is a character arc I love, but the series was never willing to let him stay in Badass mode for long. Female lead Ryouko knows how to Tsundere with the best of them, as her alternating between bitter and sweet attitudes actually has some justification: she's struggling between her natural personality and the personality she developed in response to past events. I even thought there was bit of chemistry between her and Ryoushi that a proper ending could have exploited. Most of the supporting characters are serviceable but fairly forgettable, having one main personality trait that doesn't really develop (or again, just resets if it does).\\n\\n\r\n-Enjoyment-\\n\\n\r\nI enjoyed this series, but once I caught on to the dependable character resets and realized there wasn't going to be a proper ending I felt disappointed. It's the kind of disappointed you feel when you see something you think could have been very good trip and fall into mediocrity ( I need to review something I think did well soon, this trend of writing about anime that fumbled a good chance is getting depressing), not the kind of disappointment you feel when you watch something bad which you never thought had a shot to begin with.\\n\\n\r\n-Overall-\\n\\n\r\nAlas, comedy and chemistry between the main characters is squandered in the hope of getting a second season. A proper ending could have made this series endearing, but as it is it's just a bit above average. Doggone it anime industry.",
            "date": "2015-05-05T12:58:00+00:00",
            "helpful_count": 17,
            "mal_id": 187185,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4582226.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PowerUpOrDie",
                "username": "PowerUpOrDie"
            },
            "url": "https://myanimelist.net/reviews.php?id=187185"
        },
        {
            "content": "The wolf and her Seven companions.  First off, this title is completely misleading on the account that there are 8 people around her, not 7.  I understand that the guy comes in later, but he is technically one of her companions.  Anyway, with that little nitpick out of the way, onto the review.\r\nStory (7.21/10):  The story of Ookami-san to Shichinin to Nakama-tachi revolves around the high school lives of the Otogi Bank, a club in the school where the story is based in, where they accept the requests of people in the school, in order to get a payment of afavor in return.  Essentially, this club is the school mafia where you are expected to return the favor, or you will get possibly screwed later on.  Our main protagonist Ookami Ryouko is faced with the fact that someone out of nowhere confessed to her in the middle of the street, before finding out that he is a new member of her Otogi bank club.  \\n\\n\r\nFrom a story standpoint, the anime uses its base idea well, branching off several stories from the request/return policy of the Otogi bank as its base.  Every episode, or several episodes, consist of a separate story that has to do with this policy, each with their own story that in the end, reaps some character development that makes the show a bit better as a whole.  But with this idea, there are a few bugs in the mix.  \\n\\n\r\nOne thing that this series has a bit of a downfall in, is its use of time.  While for the most part, the story is well-written and executed rather well, staying true to its own plotline, the plot in certain episodes, diverge from what the main idea is.  In short, side stories.  Roughly a quarter of the series is essentially plot points that don't really have much to do with the main plot, and as such, play no real significance altogether.  Mostly, these episodes have to do with certain members within the Otogi bank and give them a little bit of backstory.  This is fine and all, but the actual impact altogether doesn't have as much due to the fact that these people who get an episode about themselves, are supporting characters compared to the actual main plot.  Still though, this problem is still quite minor due to the fact that those particular episodes do still have the charm that this series has.  \\n\\n\r\nAnother thing this series has a bit of problem with, is a lack of actual explanation.  There are moments in the series where backstories are explained, mostly about our lovely wolf girl, Ryouko.  What makes this particular thing a downfall, is the fact that when the characters talk about her backstory, there are always some holes.  A few things are mentioned, and you get the general idea of what happened, but the specifics aren't mentioned and a clear and concise story of what exactly happened is never really mentioned, different to most animes that have back stories, which usually end in a full telling of what happened.\\n\\n\r\nThe pacing of the series except for the one episode side stories, is rather decent.  It's pretty steady and there are no real faults in the pacing of the story. \\n\\n\r\nOverview\\n\r\n+  Entire story connects to the main key idea well\\n\r\n+  Good pacing throughout the anime\\n\r\n-   Missing back story areas\\n\r\n-   One-episode side stories that have little plot significance\\n\\n\r\nCharacters (7.89/10):  Take the big bad wolf, little red riding hood, a guy scared of attention, a bodiless narrator, and a whole slew of colorful and overused anime troupes.  This is basically the whole cast of this show.  \\n\\n\r\nOokami Ryouko.  With the word \"wolf\" literally as her name, she Ryouko exhibits a sort of tough aura, always stating that she can do things herself, telling the main guy to man up, and overall, is a rather badass female lead.  What is really likable is he fact that she has a very conflicting personality, having a hidden, inner personality that she never shows to people around her.  Quite frankly, she is the show's main focus and a reason why this show is relatively good in the first place.  She seems to be more of a real person than many other female characters in the \"tsundere\" category, and is overall, a very good character who is very befitting of a show like this.  \\n\\n\r\nMorino Ryoushi is the main male lead of the series.  As a timid person who shies away from attention, Morino is shown to be the main romantic lead, as he confesses his love for Ryouko in the very first episode, something that romance tagged animes pretty much never do.  What I like about him is the fact that throughout the series, you can see the growth in him, to the point that watching his actions from episode 1 to episode 12, are completely inverted and different.  Similar to Ryouko, his personality gets fleshed out as the series goes on, without the exception of a backstory.  \\n\\n\r\nAkai Ringo, or little red riding hood, is the final true main character of the series.  For the most part, she gets a bit of a supporting role, with the exception of her backstory episode, being Ryouko's friend, supporter, and companion for the majority of the series.  (Kind of ironic given their base character idea.)  Different though, is the fact that she has a heart of stone, being very conniving and tricky when the plot needs her to be.  She provides a lot of good support to Ryouko's role and character in the series.  \\n\\n\r\nA special character mention that NEEDS to be said, is the narrator.  Contrary to a lot of comedy series, this specific anime has a narrator to tell out the story in a storybook sense, staring pretty much every episode with \"Long, long ago...\" and pointing out the obvious, making her own remarks, as well as breaking the fourth wall to the extent that the characters might as well know that their own existence is an anime.  \\n\\n\r\nFor supporting cast, the anime consists of about 30 or so members, (you heard me, 30), each of them based on some sort of anime troupe from one place of the universe to the other.  (Maid, playboy, studious, sadistic villan, fanservice, etc.)  While for the most part, these supporting characters compliment the show well, some of them play no real purpose beyond a given episode or two.  Also, the fact that the supporting cast is so gigantic, it's to the point that remembering their names is an issue.  Without the handy narrator giving mention of their name every time they come on screen, you probably wouldn't know who they are, saying \"Hey, it's...that guy....yeah...\" Every now and then.  Another problem was the fact that there were some characters that had some decent significance in the plot, but they were either introduced too late or not given enough time to prove what they could offer to the show.\\n\\n\r\nOverview\\n\r\n+  Fleshed out main characters\\n\r\n+  Decent supporting characters\\n\r\n-   One note characters that show up at most with an episode, then a cameo\\n\r\n-   Too many people to remember  (It's like Angel Beats all over again.)\\n\\n\r\nArt and Sound (7.01/10 and 7.00/10):  For the most part, the animation is rather average.  It looks pleasing to the eye and there was no real jarring things to see, but nothing truly stood out for me as a scene or piece or artwork that was really astonishing.  The art was good, don't get me wrong, but it wasn't the best thing I've seen in recent years in terms of artwork.  Although, seeing Ryouko with wolf ears in the opening song was a nice little touch.\\n\\n\r\nFrom a music standpoint, nothing stood out either.  The tracks weren't terrible, they were rather good with the opening being a very nice and inspirational song and the ending being a happy-go-lucky electronic one, but nothing really stood out as memorable.  They were good enough to stick around and listen to, but it wasn't a god track that you would want to keep in your head forever and ever.  \\n\\n\r\nOverview\\n\r\n+  Decent looking art\\n\r\n+  Good soundtrack\\n\r\n-  Nothing stood out as \"memorable\"\\n\\n\r\nPersonal Enjoyment (7.45/10):  As a personal fan of animal-themed anime characters, and strong female leads as a whole, I found this series to be quite enjoyable due to the fact that Ryouko prove herself to be a great female lead for this show.  Her character, mixing in various other people that have interesting traits, made the show quite enjoyable.  \\n\\n\r\nA little complaint or wonderment I had throughout the whole series was if the school even had a legit uniform or dress code, seeing as how pretty much all of the characters never really follow a traditional school uniform that many other school-based anime do.  \\n\\n\r\nIn any case, I personally enjoyed this series.  It was a nice series to relax and enjoy some decent character development while watching a good comedy show.  I enjoyed the quirky characters, the storyline, and above all, the narrator, which made the series far better than what it could've been.  (Seriously, I shudder to think what this series would be like without the narrator.)  I would recommend this show to anyone who likes a comedy anime that has a balance of story-driven and plot-driven idea.  \\n\\n\r\nOverall Score: 7.48/10",
            "date": "2014-05-10T15:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 142921,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=142921"
        },
        {
            "content": "Wow. Just wow is all I have to say to this anime. It's heartwarming and very funny. I thought the idea of a bank that helps people with problems is such an unique idea and that's what I loved most about it.\r\nHowever there was many things missing that could have made it even better. For example, the allusion to the attempted rape of Ryouko could have been better shown if they didn't refer to just flashbacks. I had to look up what happened to Ryouko to understand what was going on between her and her ex-boyfriend. It's like they touched the surface of the importanteven in Ryouko's life when they should've dove deeper into her past.\\n\\n\r\nI didn't like the ending but it's not like it was bad for it ended on a good note.\\n\\n\r\nI personally like to dub it as the \"fruits basket ending\" syndrome where it ends on a good note but leaves the audience hanging with what they wanted to see.\\n\\n\r\nThe most disappointing part of this anime is that there's no sequel/OVA. There are hundred of fairy tails they could've put into the anime. For example, the Hansel and Gretel siblings? I would have liked to seen them being part of the plot instead of just being allowed to just a few lines.\\n\\n\r\nBottom line: It was a great anime but I was let down by the shortcomings of what they (the animation studio) could have done.\\n",
            "date": "2012-06-15T15:32:00+00:00",
            "helpful_count": 11,
            "mal_id": 63499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1179253.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ambie",
                "username": "ambie"
            },
            "url": "https://myanimelist.net/reviews.php?id=63499"
        },
        {
            "content": "Honestly this anime for me is like new age red ridding hood (i don't expect people who never heard of that story to understand...) but it is like this atleast for me because we got wolf ( who isn't that strong ) , got red ridding hood (even thought she is friends with the wolf) , and we got a hunter ( who is hunting the wolf but in a different way). So it makes this anime more interesting to watch if u know about Red Ridding Hod fairy tail!.\r\nStory: About story i can say few things ... Its warm , innoncent and funny. Warmbecause of friendship , innoncent because of not accepting feelings and funny because its romance comedy!. Anime is centered around so called \"Otogi Bank\" in which people work ( carries out what people asks them to do that u will find out on ur first episode...  ) but for doing so they ask a payment but that doesn't include money or anything valuable its more like request for request with the motto \" Helping each other\" ... And in that \"otogi bank\" we got our protoganists Wolf , Red ridding hood and Hunter who are the main characters of our story. Story goes on and many mysteries surounding The three characters are revealed which intrigues and makes u want for more. Many misunderstandings happens and many Lovely situations occurs as also Dangerous situations accompanies everything. Little love storie is involved i would call it \"innoncent\" love story because of not accepting her feelings even thought u can clearly see when she gets embarassed by simple things ... And also how could i forget about the Story Teller which is funny on some corners but sometimes gets on ur nerves ... its something new but what would u expect from fairy tailo recreation ? :). So with misunderstandings , love situations , and Danger on every corner we Have ookami-san anime which gets 9 marks from me...\\n\\n\r\nArt: Beutiful no ecchi finnaly ! :)\\n\\n\r\nSound: Just love the opening song!\\n\\n\r\nCharacters: All kinds of : Strange , Powerful , Scaredy cats , Lovable , Players , lolita and so on and on just u watch and see!.\\n\\n\r\nEnjoyment: I tell you one of the best summer animes ! \\n\\n\r\nOverall: Just watch and see because its a  great anime for romance/comedy lovers.",
            "date": "2010-09-12T13:08:00+00:00",
            "helpful_count": 11,
            "mal_id": 30437,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/126837.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Poeticas",
                "username": "Poeticas"
            },
            "url": "https://myanimelist.net/reviews.php?id=30437"
        },
        {
            "content": "Alluding to fairy tales has become pretty common in modern television, and of course, quite prominent in anime. In the best case, the use of fairy tales can be woven into the fabric of the story and become something special like Princess Tutu. Adversely, the use of fairy tales can be nothing more than a quick gimmick with no substance behind it. Unfortunately, Ookami-san to Shichinin no Nakamatachi (or Okami-San and Her Seven Companions) falls squarely into the latter of those possibilities.\r\nThe show fallows the exploits of the Otogi Bank, a club in Otogi High School which does favors for students in exchange for returningthe favor  later on. Among the members of the Bank is fierce and tough-as-nails Ryouko Ookami (the 'wolf' in the story as her name might indicate) and her best friend, and little red ridding hood lookalike, Ringo. Unknown to Ruouko she has a secret admirer in the painfully shy Ryoushi... unknown until he attempts to confess to her and subsequently joins the Otogi Bank. Ryoushi wants to get closer to Ryouko, but that is easier said than done as her past has lefter her with a scared and guarded heart.\\n\\n\r\nIf this is sounding like a typical rom-com with a tsudere at its core, it is because that is exactly what the show is. All the fairytale stuff is just kind of stapled on. The rest is the usual school-life anime fixings. From the cast of wacky archetypes, to silly episodic stories, to the tough girl and wimpy guy romance; it is all retread material dozens of other anime series also use.\\n\\n\r\nAdmittedly, the fairytale aspect does add a little extra flavor; seeing classic fairy tales being applied to situations and shenanigans the characters get themselves into has a certain novelty to it. Particularly amusing is the Turtle and Hare rivalry between Otohime and Mimi, along with a few other episodic spins on fairy tales, like the absolutely ridiculous take on Cinderella in the first episode. Not to say that the episodic stories are good, often they are rather hackney, but they can be fun. Another thing that adds some personality to the show is the narrator, who often makes snark comments; making fun of the characters and calling out tropes in the story. This shows that Ookami-san doesn't take itself too seriously, which is good, seeing how over-tread its material is. Still, when you have the narrator taking shot at the story, you know the story is in trouble.\\n\\n\r\nWhen the show gets dramatic, it gets mixed results, mostly underwhelming. While the silly stories in each episode can be funny and amusing, but are all rather weak dramatically. Attempts to appeal to your emotions, like Otsuu's (the maid in the Otogi Bank) need to repay favors or Ringo's relationship with an upperclassmen, ring hollow. Your never really invested with most of the cast to begin with, as they are mostly just background, and trying to make you sympathies with them with only a single episode focusing on them (if even that) feels very forced and ineffective. The only drama that does work is regarding Ryouko's past, and to a lesser extent her relationship with Ryoushi. Unlike a lot of tsuderes, Ryouko has a fairly viable reason for being so fiercely asocial; hiding past hurt behind a brave face. It is also cute to see her warm up and confide with Ryoushi and see him become more bold for her sake. Still, these development are pretty conventional and lack actual complexity, giving the show very little weight.\\n\\n\r\nVisually and musically, the show is rather uninspired. Character designs aren't bad by any means, just generic.  Ryouko's design may as well be a billboard with the words \"I'm a tsundere!\" written on it, not to say her flat-chested figure isn't cute. Ringo is looks like the token cute and mischievous munchkin that she is, and Ryoushi looks just as flat as most male ecchi protagonists. The animation is fine, and character designs stay on model most of the time (usually losing form a little in action sequences), but it feels flat because there is honestly no real inspiration behind it. The music follows suit. Bubbly electric pieces and a few orchestrated ones, the soundtrack isn't really bad, but exactly what you would expect from this type of show, and ultimately unmemorable. Only the cute opening and ending themes are even remotely memorable, and even then, still pretty generic.\\n\\n\r\nOokami-san to Shichinin no Nakamatachi is the kind of show that will fade to the back of your mind shortly after watching it. It really doesn't do anything with its fairytale premise. It is but a single high school rom-com in an ocean of high school rom-coms. The only real compliment that can really be given is that the show does not do anything tremendously wrong.",
            "date": "2012-06-04T00:40:00+00:00",
            "helpful_count": 11,
            "mal_id": 62609,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229558.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/NeverKnowsBest26",
                "username": "NeverKnowsBest26"
            },
            "url": "https://myanimelist.net/reviews.php?id=62609"
        },
        {
            "content": "And so it ends, another 12 episode series that could've made a perfectly good 20+ episode show. I fear this is becoming a trend in the world of animes; well, why not? 12 episode moe-ecchi fests are much cheaper to make than something with a complex plot or characters.\r\nBut Ookami-san is not one of those animes.\r\nI originally started watching this show because I heard about the fairytale references; I love twisted fairytales, so I gave the show a try. But what I found was much more potential than a few laughs, though you get a lot of those too.\r\nStory - 7\r\nThe plot is fairly simple;Ringo Akai and Ryouko Ookami work as part of the school club, Otagi Bank (i.e, translate all those names if you want a few giggles); a club that can solve any problem you bring them, and in return, you must pay them back in a favor, if/when they might need your help.\\n\\n\r\nBut after an incident where Ookami-san is saved by another student during a mission, the club owner realizes that their fieldworkers are shorthanded and recruits said student, Morino Ryoushi, to work alongside Ookami and Ringo.\\n\\n\r\nThe story sounds cliched... until you realize this show is parodying almost every single tsundere anime ever written. And both the characters and the narrator are well aware of it, which is gold to watch! The show pretty much hits every classic moe/tsundere anime reference, and while it milks them for all they're worth, it seems to be laughing behind their back at the same time. And then there are all the fairytale references; everything from the obvious Little Red Riding Hood to some sneaky little in-jokes (my personal favorite is the Puss-in-Boots characters,  humorously named Nekomiya, who un-intentionality ends all his sentences with \"nya\").\\n\\n\r\nOne of the most original parts of this anime is it has a narrator, who tells the story as though reading a book. She is a little annoying, talking over the show from time to time, but she mostly acts as the voice of the viewer and gets some of the best lines. I grew to like this over time. :)\\n\\n\r\nThe story is usually very episodic; each episode covers a new mission and usually a new person in need of a favor, with the exception of 10-11, which is the only two-parter. The end result of this is a VERY large cast for 12 episode anime, and it often feels like we never get to connect with the characters enough because of the setup. \\n\\n\r\nThat is one of the only reasons I rated the story low-ish; it's a great concept, but the length doesn't give the story enough room to grow, even though the show seems to try anyway, which makes the ending even more awkward. Makes me wonder if this wasn't originally intended to be +20 episodes...\\n\\n\r\nArt - 9\\n\\n\r\nThe art is probably the main reason people keep comparing this show to Toradora; the animation styles are almost identical, which is no surprise since they were made under the same studio. xD\\n\\n\r\nNevertheless, the animation is stylish, fluid, bright colored, always cutesy but somewhat deformed, which gives it a certain individuality. The characters are easy to tell apart and the backgrounds are actually very well designed. There are some obvious moe eyes going on here, but it's nothing to the level of Air TV or the like. No complaints!\\n\\n\r\nSound - 10\\n\\n\r\nThe score for this show is always on-par and always fun; the background music never seems to get repetitive either, like some shows do. The voicework is quite skilled, as expected from J.C group, and like the animation, the voices stand out from each other and are very memorable.\\n\\n\r\nThe best part of the sound in this show, however, is the OP/ED themes; they're so addictive! The opening, \"Ready! Go!\", is sung by May'n (who many may know from her work in Macross Frontier as Sheryl) and keeps the mood bouncy and fun, and the song itself makes a wonderfully catchy J-pop single. The ED, \"Little Red Riding Hood\" by OToGi8, has the potential to be annoying, but for some reason, kept me watching every time. I almost never skipped through either theme for the entire show; I loved them too much!\\n\\n\r\nCharacter - 10\\n\\n\r\nI personally think that if the story doesn't get you hooked on this, the motley crew of teenagers running it will. xD The characters here are so gripping and fun, it's harder not to like them, despite the plot flaws.\\n\\n\r\nThe main characters, Ookami-san, Ringo-chan, and Morino-kun, are the best developed in the show, as expected. \\n\\n\r\nOokami-san is, at her most basic, a moody tsundere with a bad temper and trouble expressing what she really thinks. But what I really enjoyed about her is that she is the way she is for a reason; her backstory is actually pretty tough, and you come to understand that her actions and will to fight are not simply meaningless character traits. I kinda felt that the creators didn't develop her character fully, but that may just be me.\\n\\n\r\nRingo is a loli-ish girl who is usually quite polite and thoughtful, but also quite devious. She's a rather enjoyable character with another surprising backstory, and as Ookami's best friend, nicely contrasts the \"attack first, talk later\" attitude that Ryouko often has. And for a cute little girl, she's really quite the manipulator! It's usually for the sake of my best friend and pushing her to be honest with her feelings toward Morino, but really... she's such a devil! ^-^ \\n\\n\r\nRyoushi is a shy boy with expert hunting skills. Out of everyone, I felt like his character stood out the most. There's just something really cute about a scopophobic having to fight alongside a girl like Ookami, and having a crush on her of all things. His devotion and fervor to Ookami may annoy some, but I found it refreshing in a land of cold-hearted, overtly pretty male leads in anime. He's a sweet kid with a lot heart, and brings some of the best humor into the show.\\n\\n\r\nThe rest of the cast, sadly, doesn't develop very much beyond their basic characteristics. They're fun, but as I mentioned above, it often feels like you never get to know them well enough. The only ones that maybe evolve beyond the secondary are Tarou and Otohime, both of whom are simply awesome both separately and as a couple!\\n\\n\r\nOverall- 8\\n\\n\r\nI started this show when it was only two episodes into the Japanese airing, and stayed all the way through. Despite the fact that I watching Kaichou wa Maid sama and second season of Kuroshitsuji weekly as well, this show really became the thing I looked forward to the most! It's a shame it ended so fast, the potential for a full length series was great and I had so much fun watching it, but they kinda hint to a second season, so... *fingers crossed*\\n\\n\r\nBut my overall feelings for Ookami-san are this: the story is simple and definitely shorthanded, but the characters are excellent and the concept is fun. So I would recommend it to anyone who likes humor and parody, as well as good dose of tsundere, or even if you've got 6 hours to kill; it may just surprise you how much you like it! ^-^  \\n\\n\\n",
            "date": "2010-09-17T14:47:00+00:00",
            "helpful_count": 10,
            "mal_id": 30576,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/208285.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PandoraxChan",
                "username": "PandoraxChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=30576"
        },
        {
            "content": "Ookami-san to Shichinin no Nakama-tachi is the kind of anime where you'll quite enjoy it in your free time, and probably this is what this anime meant to be. Honestly, this anime is average as its best but they really and seriously had a chance to make it decent and unfortunately they failed to deliver it to make it great. The concept is relative mainstream but consider it's 2010 anime, i am not sure it's bad idea at all, and the story...yup the weakest part of this anime. So let's begin with this review for every aspects:\r\n-Maybe i unintentionally to give some spoilers, so spoilersalert-\\n\\n\r\n(Story)= 5\\n\r\nWell like i said before, this is the most underwhelming part and aspect for this anime. Let's take a look from the main focus of this anime, there is a tsundere girl called Ookami Ryouko who have been trying for getting stronger and stronger so she can' protect herself without the helps from others because from what she experienced in her \"dark\" past, but guess what in highschool she then suddenly joined with this Bank Otogi without any explanations why she can joined. I mean, she tried to avoid any contacts from people (except Ringo who the only person she can trusts) but the way they never explained it bothered me a little. And then suddenly there is this \"stalker\" called Ryoushi-kun appears nowhere and confess if he loves her just because personally for me a weak reason why he can love her, and then he says will do anything to be in her side (a little bit cliche here). Well as you can see, there are a lot ordinary progress that happen toward the story, but the problem is actually: there is no actual or big progresses at all!!!! I mean, from episode 1-8, people are gonna expecting something bigger gonna happen that can influence both of them to be more closer or a big event who can drive the story to be more creative and awesome, and yes there are some small events happen there, but the impacts aren't that much from what we expect. I won't gonna spoiling more so that's the best i can tell to you about the summary of story in the anime.\\n\\n\r\n(Art)=8\\n\r\nThis is the best aspect of the anime for me. The animation is decent enough, and the quality isn't bad at all, i mean it's 2010 anime so with this animation they actually did a pretty good job for it. The character designs also aren't bad although some of them are pretty weird and mainstream, like this Ryoushi-kun is the type of main character that you'll forget easily, or Ookami herself who look like Aisaka Taiga 2.0 (with more height, but still no boobs lol), and the antagonist Hitsujikai who looks pretty edgy for me. But overall, this aspect is good.\\n\\n\r\n(Sound)=6\\n\r\nKinda meh except the voices acting especially the narrator who i like so much, but the music and soundtracks aren't going to be in my favorite and i am not bothering to skip every opening and ending for every episode of the anime.\\n\\n\r\n(Character)=6\\n\r\nI honestly not really like Ookami at all because actually i am tired of the tsundere character, and this girl is kind of the extreme one. Sometimes i just want her to stop, i mean seriously like stop for acting like a bitch and yes it annoys me a lot, and don't forget the mainstream part she always punches and blames main character even he does nothing, i am pretty sure no one likes this type of cliche right. And her character, yup so complicated, for comparison Aisaka Taiga is also an extreme tsundere but at least she tried to be honest about herself to the person she loves but this Ookami, no...she never even tried how to get close with the persons she cares instead everyone right there who always do it for her especially the main character, but guess what? he always ends up with a punch on his face smh. I know it's a 2010 anime, but even then i still can't stand with this tsundere heroine. And then the mc Ryoushi-kun, who actually has the character developments in this anime, but unfortunately like i said, he isn't so special and doesn't have any great appeal at all, you'll so easy to forget him anytime soon. And the antagonist of this anime is terrible, i don't get his motives at all because they all are so unclear, why he suddenly becomes the student council chairman in rival school? where he have been before? what his actual motive to do that? we'll never know because the anime failed to tell us clearly about it. Besides that, most of the side characters are pretty interesting and good, so this one really saves this aspect for me to this anime.\\n\\n\r\n(Enjoyment)=7\\n\r\nRegardless from the negative opinions i give towards this anime, i'll be honest if i actually enjoy it a lot because i just like the anime who using a school setting as their genre, and if you're like me so i am sure you'll like it too, at least to fill your free time.\\n\\n\r\n(Overall)=7\\n\r\nOokami-san to Shichinin no Nakama-tachi is an average anime, not great but also not really bad at all so if you like the anime with the tsundere heroine as its focus, and school setting with actions as its genre, i can recommend it to you but don't expect it too much for the progresses or anything, because that's the part where this anime failed to deliver..",
            "date": "2017-12-14T11:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 265203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3913183.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Crocospect22",
                "username": "Crocospect22"
            },
            "url": "https://myanimelist.net/reviews.php?id=265203"
        },
        {
            "content": "Oh look! Another moe-moe animu! Is it just another merchandise driven and annoying piece of crap or is it something actually pretty decent and enjoyable? Fortunately, Ookami-san is the latter, although I have some qualms with it.\r\nIn a nutshell, the plot is pretty simple. (Go read MAL's synopsis.)\r\nWe’ve heard the “We help people in an episodic fashioned!” plotline many times before. Wash, rinse, and repeat. Bakemonogatari, To Aru Kagaku no Railgun, and a lot more basically, but Ookami-san gets away with it, because its just so damn likable, despite the very derivative nature of it. Ookami-san is not trying to be the most unique ororiginal, its just one of those non-pretentious anime where you can sit back, relax, and watch the characters do some crazy stuff. And in that regard, Okami-san delivers in its fairy tale referencing glory. If the characters weren’t so enjoyable, this anime would have utterly failed.\\n\\n\r\nNow, the characters themselves are pretty much all moe/harem stereotypes that we’ve seen before, but with a slight tongue-in-cheek air about them. We have the socially inept guy, the classic tsundere, the meido girl, the mad scientist, the token loli, the obsessive lover, the list goes on and on. But somehow, I actually liked the characters and they’re quirks. They’re not too annoying or aggravating and I enjoyed all of the cliched situations the characters would find themselves in. From popularity contests, pool time, Meido dress up, fireworks, mock dates, you name it, this anime has it all. I know it sounds like played-out drivel, but Ookami-san’s self aware nature makes it all worthwhile. I mean, Ookami-san plays the genres tropes so straight that it has to be a homage or a parody, adding the fact that there is a narrator, who points out the cliches in the story also proves my point even further. Although, the narrator can get overbearing and unfunny at times, she does a great job of saying exactly what the audience would say of the cliched nonsense and for the most part, shes pretty hilarious.\\n\\n\r\nThe characterization for the male lead Ryoushi is very well done. He starts off as a  pitiful loser, but then becomes a stronger individual through his ambition and determination to protect Ryouko and love her. Which makes him the most layered and rounded character unfortunately, because everyone else just stays grounded in they’re archetypes with no real drive of their own. Sure, some of the cast receive episodes catered to them, but they never really add anything new to their stereotypes or even get anything important to the plot accomplished. Which will turn off people who have no tolerance for moe or harem, since Okami-san is very much one of those “otaku-centric” anime. I honestly didn’t mind it, but Ryouko’s character really pissed me off the most. Despite several of the hardships Ryoushi endure in order to prove himself to her, she stays seated in her tsundere bullshit. *Slight Spoiler* Instead of having her character develop and finally confess her love to Ryoushi, since its painfully obvious, you know what she says “I don’t dislike him” Are freaking kidding me? That’s all you have to say Ryouko after all of the events in episode eleven!?! Give me a break. This alone completely shattered anything I liked about Ryouko previously, and made her just another poorly written tsundere. The conclusion as a whole itself, is unsatisfactory as well. It just ends. No real resolve to anything or goal reached. Hopefully J.C. Staff will produce another season.\\n\\n\r\nThe production values for Ookami-san is excellent! Easily one of J.C. Staff’s best animated works. Filled with fluid, realistic, and fast paced movement with wonderfully fanciful, vibrant, and colorful artistry. Attractively cute moe character designs and highly detailed backgrounds. I was actually in shock by the pure effort that was put in the imagery. Ookami-san is in no way a bad looking anime. The music is pretty well done too. Even though Ready Go!; the opening theme, Is not May’n’s best performance, it fits with the upbeat and whimsical nature of the anime. The  ED is also pretty catchy too.\\n\\n\r\nAnother great aspect about the anime is in the voice work. The seiyuu voice all of the characters with such life and cooperation with one another. I especially like to point out Ryouko’s voice actress; Shizuka Itou. I’m so glad J.C. Staff used another seiyuu for one of their ‘premiere’ tsundere’s. Rie Kugumiya is over used, thank goodness Shizuka played Ryouko with such differentiation from Tiaga, Louise, and Shana. Ryouko is more brash and masculine than your average tsundere, so of course she’ll need a different voice and Shizuka definitely fitted the bill perfectly with her performance. Also, Satomi Arai as the narrator is freaking brilliant! ‘Nuff said. In fact, any fans of the To Aru series will definitely get a kick out of the voice work as many of the seiyuu from Raildex return here.\\n\\n\r\nOverall, Ookami-san is all out otaku pandering fest. You’ll love for all of the stereotypes and clichés or you’ll hate it for that same exact reason. It was a fun ride, but damaged by the lack of development, a terrible ending, and a lack of progression in the plot and characters. Its basically one of those ‘time-waster’ anime. Not excellent or riveting, but not disposable either.\\n\\n\r\nCopy & pasted from my Tumblr: http://chibimonogatari.tumblr.com/post/1144220277/ookamisanteenchibireview",
            "date": "2010-09-18T20:41:00+00:00",
            "helpful_count": 9,
            "mal_id": 30609,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/252934.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KrazyKobun",
                "username": "KrazyKobun"
            },
            "url": "https://myanimelist.net/reviews.php?id=30609"
        },
        {
            "content": "Too Long Don't wanna Read: Yea, Ookami-san to Shichinin no Nakamatachi isn't bad, but its not good either. \r\nREAL REVIEW:\r\nThe whole thought of an anime based on fairy tales intrigued me(which is why I watched the entire thing) yet fell short when they dropped the whole fairy tale thing near the end.\r\nThere are some logical fallacies like how the \"hunter\" in this story is in love with the \"wolf\" and not \"little red ridding hood\" - if I get my facts straight hunter kills wolf and saves granny-(not seen) and red ridding hood, but w/e.\r\nHansel and Gretal are seen at brief intervals during the animewith some-sort of incesty feelings towards one and another but they deny their incest so i guess its ok. \\n\\n\r\nThey do some referencing in the anime-notably ToraDora and some other anime.\\n\\n\r\nAgain these are just lentils compared to the real chunk in which we dive now.\\n\\n\r\nThe main characters work at a \"favor\" bank where they do favors for students expecting favors back. weirdly enough they seem to be spending favors faster than they could make em seen in a swimsuit ep(sigh) where they blow their savings on telling the students not to vote for their own bank employees. \\n\\n\r\nAnyhoo that being the setting the real dilemma is that something happened to Ookami(wolf) by a mysterious guy which turned her mentally into a man, being aloof in trait and does boxing, \\n\\n\r\nDue to that trait Morino(hunter) and Akai(Red Riddin) get attracted to her, where they get feelings of \"ooh she is strong\" and \"I want to protect you\" which seems to be the generic feelings these days of making girls strong yet need to be protected - because they are girls.\\n\\n\r\nAlso Morino is sociophobic which means he unable to look at people, reason for it- because he is a hunter and takes comfort in seeing and not being seen, which is weird because Snake in Metal Gear Solid takes this to an extreme and he himself is not sociophobic at the least. Anyway He confesses to Ookami because thats what sociophobes do, and tells her his confession to which he gets denyed but denial isn't something that bothers Morino because later he joins a team with Ookami and uses events and flag points to sway her to his favor. \\n\\n\r\nEnding goes something with enemy school de la ghetto decides that even though they got beaten by Morino and Ookami, they can take the entire bank, which starts with kidnapping Ookami. Ohoho but soon they realize that it was all masterminded by Ookami's past loved one, and as Morino and (past loved one) fight it out, (which oddly PLO had a knife yet never used because advantages are unfair) Ookami gets over the past trauma and Morino and Ookami both win, which is to say until the Bank decides to leave them alone and negotiate through IMs. \\n\\n\r\nLast Minute Notices:\\n\r\nNarrator talks over the people sometimes, which is annoying as hell. \\n\\n\r\nThis anime parody's scene shots which is funny till overused. \\n\\n\r\nMorino has a lisp and is very bipolar with his sociophobe so take it to account. \\n\\n\r\nOther than Ookami and Morino, all other characters are very minor, even the main bad guy.\\n\\n\r\nSo in the end this anime is like putting ketchup on potato chips, yes its something you might wanna try, but there are so many better things to eat, like potato chips in sandwiches. \\n\\n\\n\\n",
            "date": "2011-08-11T10:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 41273,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/535495.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AceStar",
                "username": "AceStar"
            },
            "url": "https://myanimelist.net/reviews.php?id=41273"
        },
        {
            "content": "I made an account just to review this show because thus far it has annoyed me so greatly I cannot stand it anymore. \r\nHere I am trying to enjoy this somewhat fun and interesting show with a basic plot and the narrator will not shut their god damned mouth. Can't go thirty seconds without them butting in and giving useless information or witty remarks on bust size or remarks on people personalities which are CLEARLY indicated through their actions. I DO NOT NEED A DAMN NARRATOR TO TELL ME A GUY IS A PLAYBOY WHEN he is BISHI and all over a girl he justmet. \\n\\n\r\nI DO NOT NEED A NARRATOR TO TELL ME THAT THE PEOPLE I AM SEEING ARE FROM 10 MINUTES PRIOR AND DELINQUENTS.\\n\\n\r\nI especially do not need a narrator talking OVER the characters and drowning them out. I'f I were japanese watching the original and not the subbed I would hardly know whats going on as the characters will jumble what the narrator is saying them likewise in reverse.\\n\\n\r\nIt was a TERRIBLE idea to have such a narrator.",
            "date": "2012-08-23T20:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 70715,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gezodiac",
                "username": "gezodiac"
            },
            "url": "https://myanimelist.net/reviews.php?id=70715"
        }
    ],
    [
        {
            "content": "Alright Everyone, I'm not a big reviewer unless I honestly feel the need to explain a show. ookami-san is one of those cases. The designers came up with a good premise and did their absolute to shove as many anime stereotypes in as they could. The moe, the tsundere, the shy, prettyboy, crazy, etc...Unfortunatly while this made the characters overall quite loveable it shoves down said aspects down your throat. 90% of the show feels like filler, and when they try to do any actuall plot work it is rushed, cliche, and very forcefull. The ending doesn't completely flow either and no real resolution ismade. It's obvious the creaters were banking on making a second season. My opinion for any of you reading this. If your looking for a show to half watch half play your gameboy go for it. The characters are overused you'll be able to figue out what's going on. If you want a show that has great plot, purpose, great characters, and a desire to teach you somthing. Go watch an old season of Gundam. -_-",
            "date": "2010-10-10T21:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 31279,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70047.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Blixus",
                "username": "Blixus"
            },
            "url": "https://myanimelist.net/reviews.php?id=31279"
        },
        {
            "content": "I liked this anime a lot. Although the end was really obvious and cliche. You can watch it if you have nothing else to watch or just like a hobby. The characters are awesome. Nothing pretty special. But you can enjoy them too. I don't know if it's funny or not since I don't laugh easily with animes. Not even with Ookami-san. But you can enjoy the anime a lot. There aren't a lot of episode as you can see. The art is beautiful. It reminded of Toradora! But they aren't even similir if you think so. Well, I recommend it to everyone who doesn'thave anything to watch. Just that :D",
            "date": "2010-12-19T17:56:00+00:00",
            "helpful_count": 7,
            "mal_id": 32884,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/287062.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/rainsmew",
                "username": "rainsmew"
            },
            "url": "https://myanimelist.net/reviews.php?id=32884"
        },
        {
            "content": "Here goes my first ever review! ^_^ for Ookami-san to Shinchin no Nakamatachi, or just, Ookami-san\r\nSTORY\r\nI'll try to be as spoiler-free as possible. The main female protagonist is Ookami Ryouko. She works for the Otogi Bank, which helps people, but in return, those people should help them if the need arises. The main male protagonist is Morino Ryoushi. A scopophobic (afraid of being stared at) boy who falls for Ookami. The story revolves around the two as their relationship deepens, as the Otogi Bank encounters various requests. It may sound simple, but the twist is that, some of the request are parodies of fairy tales.It may sound like a whack idea, but they made it work.\\n\\n\r\nART\\n\r\nFight scenes are awesome to look at. Scenery is cool too.I honestly couldn't find anything wrong the art itself. It's still up to today's standards, and if you've watched other J.C. staff works, you might feel at home here.\\n\\n\r\nSOUND\\n\r\nThe OP theme \"Ready, Go\" by May'n is fine. It doesn't suit the story as much, but it goes well it anyway. The ED theme is also pleasant in its own way. In terms of voices, my only complaint was that the narrator would sometimes overlap the characters, making the scene confusing at times.\\n\\n\r\nCHARACTER\\n\r\nBasically, you only need to focus on Ookami-san and her seven companions, because there's not much character development. It's not as bad as it sounds, really. Ookami's character is great. There's something about her that makes her cool and adorable at the same time. Ryoushi's character is your not-so-regular hero, but, he is also pleasing to watch.\\n\\n\r\nENJOYMENT \\n\r\nI enjoyed it a lot ^_^ It's one of those short but sweet anime that makes you want more of it. \\n\\n\r\nOVERALL\\n\r\nI highly recommend this one to those who want a light, funny, and sweet anime in their memories. If not, then I still recommend it to anybody ^_^",
            "date": "2010-10-09T22:45:00+00:00",
            "helpful_count": 7,
            "mal_id": 31248,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/393777.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Leap250",
                "username": "Leap250"
            },
            "url": "https://myanimelist.net/reviews.php?id=31248"
        },
        {
            "content": "I like it, it’s so cute! The stories all have a fairy tale to go with the story. It has the story of little red and the tortoise and the hare. All of the stories are pretty twisted tales and rather creative. There is sadly a couple that I’m not sure where they came from, though they still hold the fairy tale style. \r\nI do have a small bone to pick. Barely any of the episodes have anything to do with the main story plot, bringing more of the story by week feel to the show. It makes me a little sad that we don’tget much of the story line. What it is replaced with though is us learning more about the characters so it doesn’t feel much like filler. Things only really pick up at around episode 10 but by then, it was pretty much over with. It gets rather serious then, and actually rather romantic. Sadly, it doesn’t stay for two long.\\n\\n\r\nRyoshi Morino is a really sweet and shy guy, though who needs to just toughen up a little. It would be easier if he did. Otherwise, I think it works out rather nicely. He is strong when he actually puts his mind to it as seen in episode 2. He does become sort of other people’s punching bags at times to though which doesn’t help make his character any easier to read. \\n\\n\r\nRyoko is really interesting with these dual personalities she shows. They show up really early which is surprising. I would have thought that it would of happened way later. Not that I am really complaining. It just made the character a bit easier to actually feel more for her. \\n\\n\r\nAkai is another interesting character, always smiling but ends up pushing Ryoko into a lot of different things including dates. She is like a little terror but is a true friend to her in every way, even taking care of her by cooking and cleaning. \\n\\n\r\nThe animation is pretty nicely done, only one or two flaws but nothing that serious. There are times where characters end up looking a bit rough and runny egg like. The story artwork does jump around just a tad and it’s a little hard to sometimes understand. They did pretty well with how the designed the characters, making them fit the role they were supposed to fit almost perfectly. \\n\\n\r\nThe English voices are pretty nice and I love the comedy that the narrator brings up every once in a while. She actually becomes part of the story in herself with the antics. I am talking about her in the voices because that’s all we hear of her. The old women voice is perfect for the fairy tail feel… a twisted fairy tail style! Most of the other characters work rather nice. The music is very good, capturing the feeling of some scenes. \\n\\n\r\nJust to let you know, you should keep watching all the way threw the credits on most of them because they have little extra things happening. \\n",
            "date": "2012-09-06T19:14:00+00:00",
            "helpful_count": 7,
            "mal_id": 71729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=71729"
        },
        {
            "content": "Ookami-san To Shichinin No Nakama-tachi was an all around average series.  It had some interesting elements, such as the revamped story book characters and the overall plot was good however it often missed on its pacing, progression, and overall wow factor. \r\nThe art was Good throughout featuring unique looking characters and the scenery and backgrounds were clean as well.  The characters themselves being based on fairy tale characters was a unique concept though this could of been expanded on throughout the show and made into a more interesting feature. \r\nThis series features a narrator which to be blunt was the most annoying thingI have yet to incounter in any anime.  Not only was the narrator there for comic relief mostly, but in addition to the inaffective jokes, she would talk over the characters conversations often at crucial plot points.  The narrator became even more agrivating as the series went on and she began to repeat character introductions.  Furthermore when the transition from the anime talking to the narrator butting in happened it often caused the sound quality to lowered, and the volumn would fluctuate on the transition.  This series would of been better off without this feature.\\n\\n\r\nThe character progression focused mostly on Ryoushi and Ryouko who grew as the story moved forward.  The side characters changed little and though I was mostly watching for the story between the two characters it seemed the others around them went through a lot as well but hardly changed.  It made the story feel closed off and distanced the Ryoushi and Ryouko from the rest of their group.\\n\\n\r\nFinally the pacing of the story was not great.  It seems to me first of all that episode 12 should of came before episode 10 and 11, from a climatic standpoint.  Furthermore the progression of Ryoushi was all over the place as in some episodes he would do better with his phobia but then the very next he would seem much worse.  I more or less like pacing that has a grand cressendo with a nice neat finish, which this series did not have in my opinion at all.\\n\\n\r\nHowever, despite the many set backs I did ultimately get caught up in the love story, laugh with the puns and comedy, and feel the struggles of the hero and heroine as they made their way through their ordeals.  So as entertainment goes this anime series did its job for me there, though I will probably not recommend it unless it seems to fit an individuals personality or anime likes.\\n\\n\r\nOverall Rating 5/10\\n\\n\r\n@GameJok3r\\n\r\nhttp://animejok3r.tumblr.com",
            "date": "2011-09-15T15:02:00+00:00",
            "helpful_count": 7,
            "mal_id": 43453,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/532191.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/gamejok3r",
                "username": "gamejok3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=43453"
        },
        {
            "content": "Ōkami-san to Shichinin no Nakamatachi is about a strange club, the Otogi Bank, made up of high school students who do favors for other students, their \"clients,\" in return for their help in the future. It's a simple episodic anime with a decently large cast of likable, if not the most original, characters. Our male protagonist, Ryoushi, actually doesn't have anything to do with this organization at the beginning of the story. He does, however, have a crush on our female lead Ōkami. While Ryoushi has some extreme troubles with shyness, he manages to protect Ōkami from some attackers, and somehow manages to confess toher within the day. Ōkami refuses his confession, but her best friend Ringo tracks Ryoushi down and convinces him to join them at Otogi Bank.\\n\\n\r\nFrom here the anime takes no delays in getting right to the first of many one episode stories that the show's structure is built on. Normally I would consider this kind of storytelling to be boring and unengaging, but Ōkami-san manages to be, at the very least, more entertaining with this layout than I expected. Its most unique factor is the fact that all of the stories are based (very loosely) on one fairy tale or another. Some are more obvious than others, but the first episode makes the intentions of the show very clear with its obvious parody of the well-known Cinderella story. From there on out the plots of each episode are more or less inspired by various familiar fairy tales. This aspect was very hit-and-miss for me; some of the episodes, such as episode three's The Tortoise and the Hare theme, felt unique and relevant, while others like Snow White often seemed superficial at best. Regardless, an effort was definitely made each time, and I can at least appreciate that.\\n\\n\r\nAside from the situations, the characters themselves were also a mixed bag of generic, boring, and pleasant surprises. Most of the usual archetypes are there and not too different from what a typical anime viewer is used to by now. Most of the characters do have some sort of interesting backstory or developments that separate them somewhat from the caricatures you are used to, but this itself even has flaws. The histories of the characters who are looked into are typically brought about suddenly and without much fanfare, usually delving deep enough to be engaging but not enough to be meaningful or make me feel anything most of the time. Then there is Ōkami's backstory which, without spoiling anything, is interesting but is never really explained for what seems to be the sake of keeping the show's content acceptable for the target audience - a disappointment, to say the least. The gist of it can be gathered, but the clear avoidance of certain topics makes me want more.\\n\\n\r\nOn the other hand are the background characters, who receive almost no development whatsoever and stay ambiguously strange and unappealing for the entirety of the series. The poster girl for this flaw is Majo, the crazy scientist. I would say more, but there is quite literally nothing else I can say about her despite Majo appearing in every episode and apparently being an active member of Otogi Bank. Other characters, like the President of the club and his cousin, follow a similar pattern, and it is sad when the one episode side characters have more personality than recurring characters that the viewer is supposed to feel something for.\\n\\n\r\nOn a similar note, there is an overarching plot that is slowly expanded upon until the last few episodes, but its ending was significantly anticlimactic, making me wonder how badly J.C. Staff wants a second season after teasing us with an arc like that.\\n\\n\r\nThe comedy is nothing to write home about. Near the beginning of the series it is typically almost embarrassing; half the time I wasn't really able to tell if what was happening was supposed to be funny or not. Somehow this does improve over time and Ōkami-san finds its groove, but that might be a result of the show becoming a tad more serious and the joke scenes becoming clearly different from the more serious ones. Overall, though, comedy is most definitely not one of Ōkami-san's draws or strong suits.\\n\\n\r\nI also have a love/hate relationship with the art and the music. The BGM is all well and nice, just about always fitting of the atmosphere and the scenes, but nothing ever stood out to me. The character designs are very familiar to anyone with any recent anime experience, so much so that you might be right to call it plagiarizing if fans weren't so forgiving. However, I feel as if this is, for the most part, J.C. Staff's fault; the illustrations related to the original light novels are nicely stylized and appealing, while the adaptation's versions of these characters aren't so interesting, so I can't help but feel disappointed in that regard.\\n\\n\r\nOverall, while Ōkami-san to Shichinin no Nakamatachi was quite a rollercoaster ride of surprises and disappointments, I did at the very least look forward to what it had to offer each week. In the end though, I can't shake a sweeping feeling of mediocrity.",
            "date": "2011-07-15T04:28:00+00:00",
            "helpful_count": 7,
            "mal_id": 39194,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/283217.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NavyCherub",
                "username": "NavyCherub"
            },
            "url": "https://myanimelist.net/reviews.php?id=39194"
        },
        {
            "content": "I think this anime was like (too simple). The story is too simple and as well as the story. The main wasn't enjoyable at all. He was a serious bleep and the girl was nearly like a boy. But then, what made me rate this anime 6. Well it is because it had a happy ending. Well happy? but a bit sad. And why?( no spoilers). But the anime was like lacking of story and creation of characters. \r\nBut that is my opinion, I am so sorry if I destroyed the enjoyment of the anime. But that is my opinion. \r\nBut yeah please have agood anime months (PEACE).",
            "date": "2019-01-15T03:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 299087,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7589619.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DarkandDark2004",
                "username": "DarkandDark2004"
            },
            "url": "https://myanimelist.net/reviews.php?id=299087"
        },
        {
            "content": "When I watched this anime I thought that I might get a decent love story... but the love story sucked. But the jokes were pretty funny and the fight scenes were pretty enjoying.\r\nThe Characters are all pretty boring except Ringo and the club president. They are awesome! \r\nThe main character Ryouko is afraid of attention witch is pretty funny at times :)\r\nThe main thing I hated about this anime was the damn narrator voiced by Arai Satomi... I wouldn't have anything against her because I love the voice she is making, but she narrates while the other characters are talking. And she keeps telling uswhat the characters are thinking and I think that is unnecessary at times.\\n\\n\r\nThe love story was just boring it was like \"I love you\" and that was it almost... that was the only thing I got from it.\\n\\n\r\nBut like I said the fight scenes is both good and funny.\\n\\n\r\nSPOILER WARNING!!!\\n\\n\r\nThis might be a spoiler so I’ll try to make it short. There is a reason why Ookami is the way she is. And that reason is the bad guy. I didn’t really get if they actually defeated him because Ryouko was getting his as handed to him, and then he threw one punch at the bad guy… and that was it! Did they defeat him with that or is he coming back… come on! >< \\n",
            "date": "2010-11-15T03:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 32067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mogge3",
                "username": "mogge3"
            },
            "url": "https://myanimelist.net/reviews.php?id=32067"
        },
        {
            "content": "Is this show funny? No\r\nHow's the story? Nonexistent\r\nHow are the characters? Meh\r\nOokami san has a lot of potential but has major flaws.  Every episode is basically filler but it TRIES to have some real plot deep down.  To me, this show is supposed to be focused on comedy but it falls flat on its face.  There's supposed to be some romance going on between the two main leads but that barely goes anywhere.  Why? I have no fucking clue.  The characters are pretty one dimensional and forgettable.  They try to make Ookami san this tough character but it turnsout she's weak on the inside and wants someone to support her.  At first this sends a strong message that you can't take on everything by yourself and that you need people that you can rely on but somehow they use this to make our supposedly strong female lead to look weak.  She can be completely overly emotional and she was scared shitless when she was captured by those gang members.  Fear is fine but if you're gonna make her out to be this strong independent woman then you can't make her have this scared little pussy side as well, they play against each other.\\n\\n\r\nNow before I get people hating me let me say something good about this show.  The art isn't bad and if the entire anime was based off of ookami san and her friends battling that other school, this would've been an amazing anime.  Those last two episodes where everyone was getting kidnapped and there was this whole school war were really interesting and I wanted to see more of that.  BUT NO, they save everybody, do absolutely NOTHING about the big bad guy in charge and then go back to the same old bullshit.\\n\\n\r\nNow this is the BIGGEST problem this show has.  THE NARRATOR WON'T SHUT THE FUCK UP!!!!  Jesus it's like she likes the sound of her own goddamn voice.  This would only be slightly annoying if she said things that were important BUT NO.  This bitch does nothing but say shit that has no meaning or purpose.  Matter fact, most of the stuff she says is obvious shit that a two year old could figure out on its own.  She also talks over the characters when they're talking so most of the time I miss a good chunk of their conversations.  I don't know who's idea this was but GET RID OF HER.  She's not funny and she's not entertaining.",
            "date": "2015-05-27T20:35:00+00:00",
            "helpful_count": 6,
            "mal_id": 188987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4636554.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Firebolt13",
                "username": "Firebolt13"
            },
            "url": "https://myanimelist.net/reviews.php?id=188987"
        },
        {
            "content": "What is so enjoyable about Ookami-san is that it seems to almost make that attempt to relate to teenage lives (with the anime spin on that of course) but still remains comedic throughout the series. All of the characters add so much to this story, no matter how questionable they may be. Its rare to me to see such in depth character analysis within such a small span of time done well. The way that is done well is by giving each character some realm of like-ability, but then also never strays away from the main character and trying to build your attachment to Ookami.Sound has the lowest score because to me sound isn't the best use of a score system in most anime because many use the same or similar sounds and in this case the sounds are good, but nothing special. When it comes to my overall opinion the biggest factors to me come from character and story. Mostly because those will directly influence my enjoyment. The story takes the turns it directly needs to and still gives that level of peril that you need to make a story work; without having the type of story climax involving EVERYTHING bad happening. Stories that can do that succesfully to me are special, but the overall is an eight because I feel that the story takes a turn for the (rather) dark too quickly and into a place that could have been set up a bit better. All in all it's a great series and one of the few that I know I will watch again and indefinitely one of my favorites.",
            "date": "2014-04-02T08:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 138319,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RedDawnFury",
                "username": "RedDawnFury"
            },
            "url": "https://myanimelist.net/reviews.php?id=138319"
        },
        {
            "content": "(This is a spoiler-free review adapted for this site)\r\n[Synopsis]: Ookami Ryouko, a tomboyish high school girl, is a member of the Otagi Bank – an organization on campus that helps other students with their various problems in exchange for their own assistance at a later date. After confessing his love to Ryouko, the scopophobic Morino Ryoushi (Irino, Miyu) is recruited as the 8th member of the Otagi Bank by Ryouko’s closest friend Akai Ringo (Itou, Kanae), The story’s narrator (Arai, Satomi) often badmouths the characters and interjects her own thoughts as the show progresses, sometimes causing the characters to break the 4th wall. Ryoushi triesto get closer Ryouko as he, along with the rest of the Otagi Bank, helps other students through their dilemmas.\\n\\n\r\n[Characters]:\\n\\n\r\nThe characters in Ookami-san are a good place to start because I think they are one of the show’s strongest points. While the show’s title speaks to only Ryouko’s seven friends in the Otagi Bank, the cast is much larger than this – mostly comprised of other students from Otagi High but not exclusively.\\n\\n\r\nThe eponymous Ookami Ryouko is fierce and somewhat cold to others at face-value however it is quickly elaborated upon that this is an attitude she has adopted and that she is actually more shy and caring underneath her exterior. This is the primary trait that leads Morino Ryoushi to fall in love with her and the integrity of this demeanor makes up a good amount of the show’s drama as Ryouko’s past is explored and her current lifestyle disrupted. I love her character design and, as many would point out, she is highly reminiscent of Taiga Aisaka from Toradora! (along with the fact that they are both tsundere).\\n\\n\r\nOn the topic of her design and of her name – Ookami-san does something quite interesting concerning the characterization of its cast. Many of the characters both inside and outside of the Otagi bank have light references to fairy tales and the like most prevalently featured being references to Aesop’s Fables). Because of this, along with its energetic, fourth-wall-breaking narrator, the show is often mislabeled as a parody of sorts however I would say that the references are not made to such a degree that anyone would miss anything about the show if they were not familiar with the source materials; the character references are a bonus. A few examples of this are Ookami’s wolf-like persona and occasional pointed tooth, Akai Ringo’s red hair and outfit reference Little Red Riding Hood (she is also a reference to the apple in Snow White), and Hitsujikai Shirou is a reference to The Boy Who Cried Wolf – insinuating that he lies. There are some interesting parallels the show draws with these references however they are of no ultimately great import to the show and make up only a small amount of the characterization – the show takes these characters and traits and makes them its own.\\n\\n\r\nTo quickly go over Ryoushi, he is a shy and timid character, mostly due to his scopophobia however when the stakes are high or when Ryouko needs his help he steps up to the plate and becomes an immensely more enjoyable character. His scopophobia is more present in the first half of the show than the later half and part of this is brushed off as development however it appears quite randomly as a gag and I think was one of the few comedic elements that could have been executed better within the show.\\n\\n\r\nThe other characters, and there are many, are all very interesting – each with their own distinct personalities, designs, and sometimes references that make the large cast and their interactions with each other quite pleasurable.\\n\\n\r\n[Art/Animation]:\\n\\n\r\nI was very pleased with the art and animation of Ookami-san as I felt it exemplified the things that J.C. Staff does best. The animation itself was very reminiscent of other J.C. projects such as Toradora!, Toaru Majutsu no Index, and Shigofumi which I am a complete sucker for. The fight scenes, and there are a surprising number of them given the show’s premise, are very well done and are good action for a show that otherwise busies itself with comedy and drama. There are more of these scenes at the beginning than at the end however there is a good final fight in relation to this and so the action element of the show never feels to be completely missing.\\n\\n\r\nThere is also a lot of interesting work being done with the character designs as many of their elements go hand-in-hand with their the characters story-tale references. Additionally, I like that Morimo’s design is rather bland in comparison to some of the more outlandishly designed characters like Majolica le Fay – this approach makes him feel like a bit more of an outsider in comparison to the rest of the Otagi Bank and serves as a stark contrast for when he gets fired up, revealing his oft hidden eye(s). Along with the actual characterization of the cast of Ookami-san, I would say their designs are its other strong point as I really enjoyed them.\\n\\n\r\n[Story]:\\n\\n\r\nThe primary story, which involves Ookami Ryouko’s past as well as her current relationship with Ryoushi makes up about half the show whereas the other half follows the premise quite closely in that the Otagi Bank addresses the needs of other students or the members of the bank themselves. Because of this the ‘story’ is not really the meat of the show but rather an interesting yet irregularly recurring feature. The show focuses primarily on Ryoushi and Ryouko’s dynamic, often comically, and then on the activities of the Otagi Bank and its members. The show does arrive at a climax of sorts in relation to the ‘main story-line’ however does not truly resolve everything and as there is no secondary installment into the series the show is left a bit open-ended which somewhat hurts it.\\n\\n\r\n[Music]:\\n\\n\r\nThe music was not a negative aspect of the show as it did not actively detract from anything however I would also say it was not a plus as it felt extremely background oriented and didn't attempt to ever win out over the action or the drama. This is not a good or bad thing, it is simply an approach – one which worked perfectly fine for this show. Nothing much to make note of in this category; there is nothing here that would cause me to recommend the show based on its soundtrack.\\n\\n\r\n[Final Thoughts and Rating]: \\n\\n\r\nOokami-san is a really fun show with a lot of stuff going on inside of it but the main story leaves something to be desired. Not because its presentation was lackluster but because it fails to resolve what it brings up and because I wish there was more of it – the show simply wasn't long enough for it to do everything it wanted/needed to which is always an unfortunate shortcoming.\\n\\n\r\nI would best sum up the show as something that doesn't overly commit to any of its genres but does well enough in each of them to be enjoyable respectively.\\n\\n\r\nRating: 6\\n\\n\r\nI gave Ookami-san a 6 because, while it was a really fun show in its characterization and its aesthetics, the comedy was only mediocre and there wasn't enough of the decent drama that the show had to have felt committal.\\n\\n\r\n[Recommendations]:\\n\\n\r\nI would recommend Ookami-san to fans of J.C. Staff first and foremost. If you enjoyed some of their other big titles at least in part for their animation, then this show is another good place to enjoy a similar style. People that enjoy references to fairy tales or perhaps the most avid fans of Into the Woods would get a kick out of the playful character and plot allusions brought up in the show. Ookami-san has a few good, short bursts of action and has decent comedy but nothing excellent in that regard. The drama, while intermittent, feels pretty real when it shows up and Ryouko’s trauma is very well presented.",
            "date": "2015-05-18T14:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 188159,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3661737.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Cauthan",
                "username": "Cauthan"
            },
            "url": "https://myanimelist.net/reviews.php?id=188159"
        },
        {
            "content": "How do I say this, this anime could only be described as \"meh\". Everything just wasn't great. The story was all over the place, and when there was advancement in the plot, it just led to nothing. Its like it shows you a plot, and then out of nowhere they go HEY, just joking, its not really important. And even in the end all it did was left you hanging, there was no closure what so ever. The only reason I even stayed was cause Ookami reminded me of Aisaka Taiga. That is it. Nothing else.",
            "date": "2015-02-16T16:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 180577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4384547.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OneSpeed",
                "username": "OneSpeed"
            },
            "url": "https://myanimelist.net/reviews.php?id=180577"
        },
        {
            "content": "TIP: KEEP WATCHING AFTER THE ENDING MUSIC, THEIR IS MORE IN THE EPISODE AND SOMETIMES WILL CONFUSE YOU IF YOU DON'T WATCH IT, AND THEN THEY'LL BRING IT UP IN THE NEXT EPISODE!!!Ok so I am horrible at writing reviews. I honestly am, but for Ookami-san to Shichinin no Nakama-tachi it was love at first sight! The story, art, sound, character, enjoyment, and overall is a 10, 100% amazing. The only tiny little down part is there is a narrator sometimes, and she could be a tad annoying. Nonetheless, it's my new favorite anime, I finished in a day. It's only 12 episodes sadly, andI thought there was more. I Wasn't paying attention to the amount of episodes. The less the episodes the better the anime plot! But still, I honestly feel like crying, because it gives you feels (sometimes) it gives you drama, romance, and comedy! Each character has his/her unique trait related to their creative arc. I honestly believe you MUST watch this, or forever hold your piece. I have no idea how this anime isn't as well known, and want more people to watch it. It certainly keeps you in your seat!",
            "date": "2014-03-24T16:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 136813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3577795.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/YasmeenClannad",
                "username": "YasmeenClannad"
            },
            "url": "https://myanimelist.net/reviews.php?id=136813"
        },
        {
            "content": "\"We will do anything to protect the millet dumplings!\"\r\nOokami San is one of those anime that are hard to find. It had a wonderful set of characters and a unique plot to boost it's appeal, although the plot was kinda rushed. It also showed how a Tsundere is REALLY done. I first watched this anime a year ago (when I started out anime) and rewatched it just today, and so have a review ready.\r\nStory: 8/10\r\nThe story was quite unique in it's own sense. First the positives, a lot of plot was covered in just 12 episodes and the benefit was that not a minute waswasted in filler episodes. Though like most modern high school anime a pool episode was a must, but thankfully Ookamisan snuck up a small plot point there as well. The biggest problem I faced with the anime was that the plot was rushed up in many places. Thankfully I already watched this before so I could understand stuff more once I rewatched it but at first glance the plot went too fast. Too many things were covered at once, now this wasn't necessarily a bad thing because no time was wasted but I'm sure it would have been better if this was stretched out to 24 episodes.\\n\\n\r\nArt: 8/10\\n\\n\r\nThe art was amazing to watch. One thing I love to see in the art of most animes is the eye designs, and Ookami San excelled in that field as well. The way the eyes were designed left me in awe as emotions were seen even more easily and characters looked even more attractive. Unfortunately e backgrounds felt a bit washed out (maybe because I watched it in 480p?) and felt a little but sub-par. Otherwise it was great.\\n\\n\r\nSound: 7/10\\n\\n\r\nThe way the Seiyuus portrayed their respective characters was flawless and has me giving them a salute. Morino's VA sounded excellent as he captured both the Morino archetypes (weak and manly) while Ringo and Ryouko's VAs did a really good job as well. I expected a little bit better from Inou Katae but maybe it was because she's one of my favorite Seiyuus.  But why an 8? It's because apart from the Seiyuus the sound was a mess. With a mediocre OP (that too which is only memorable by the intro, The vocals were lame at best) while the ED was forgettable. This is a problem some anime face sometimes, excellent VAs, but mediocre sound track. And Ookami San was no exception.\\n\\n\r\nCharacter: 9/10\\n\\n\r\nThe best part about the anime, with a unique arsenal of characters, no wonder I loved the show when I first watched it my early days of watching anime (as in last October in 2016). Even now I feel it had a better MC than most other romances. First off, Morino was the one to confess first, he was the one who harbored feelings. Pretty rare to see that happen in the dense-MC filled romance anime genre. Plus, even though they made him look like a weakling at times, there was a really good reason for him to be strong. Apart from that, he developed wonderfully along with Ryouko. Coming to Ryouko, she much like JC Staff's more popular sibling ToraDora's Tsundere Taiga, excellently displayed how to do a Tsundere character. Ryouko unlike most other TsunDeres of the '10s and newer, rarely ever hit Morino, apart from that she still showed here tsun and dere sides perfectly and balanced it as well. I applaud the author for writing such good characters. Development was a lot between these two, while for the rest of the cast, let's say they did their job s supporting characters well. Although I would have loved it if they developed as well (apart from Ringo's arc) but they did their job very well as a supporting cast.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nOne of the biggest reasons I made this my first ever rewatched anime is because it has a lot of rewatch potential. I loved it when I started out anime and still love it today. It had it's share of fun, seriousness and heartwarming romance up it's sleeve, which is precisely why I thoroughly enjoyed Ookamisan and her seven companions, TWICE.\\n\\n\r\nOverall: 8.2 (Averaged)\\n\\n\r\nIn the end, Ookami San had it's set of positives and negatives. It had a wonderful cast, excellent Seiyuus and also had it's share of problems being a rushed-y plot and mediocre sound track, but once you finish the anime you'll be satisfied with what you watched. That's what makes this anime such a joy to watch. And who knows? Like me, you might come back again to rewatch it later on.\\n\\n\r\nP.S: Back to Tsunderes huh. Ryouko totally is my all-time favorite Tsundere, officially dethroning Taiga from the rank. And that's saying something since I'm such a big Tsundere fan (and sometimes it's biggest critic).",
            "date": "2017-12-13T00:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 265091,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=265091"
        },
        {
            "content": "Here in 2010, the anime world has reached a point of knowing what panders to anime fans. What is the right way to pander? Well, Studio J.C. Staff seems to know of a formula containing of cute girls, school, a school club, a few pretty boys, and a cast of trope characters. Ookami-San and Her Seven Companions is the culmination of how to make an average anime. Is this anime average though? Well, given the tough task of trying to get something special out of this anime was none other than the Love Hina director Yoshiaki Iwasaki.\r\nThis story is a comedy parody of sort focusedaround a tom-boy like character in Ookami Ryouko. It follows her and her friends around their adventures surrounding their sort-of club called the Otogoi Bank. This club is tasked with solving any and all problems ranging from love life to thug life. Of course, most of the members are female and a couple of pretty boys as well. There is even a cheeky narrator breaking the fourth wall occasionally and pointing out certain aspects about the characters such as flaws in their personalities and the boob sizes of the girls.\\n\\n\r\nThere is of course a self-insert character that confesses his love for Ookami and blindly follows the adventures and becomes the main secondary character within the Otogi Bank. Sad to say, most of the characters and points within this show is pretty shallow. There are a few highlights such as the importance of friendship and believing in yourself, but they do not outshine how bland the show is. This is not a show about any real character development, but more of something filled with an occasional gimmick and something to get a few chuckles out of the viewer every now and again.\\n\\n\r\nThe characters art, backgrounds, tone of the anime are nothing real special by any means, but there is not anything to complain about either. Ookami herself as the main focus and whenever the show dives away from the self-insert character is another one of the higher points. She has three main friends and when the shows decides to focus on how they help Ookami and progress any sort of character development or push the story is alright. For some reason, the show likes diving into backstories with as little information as possible to try to get some feeling out of the viewer such as Ookami’s own past with sexual abuse. Things like this remains a mystery without a resolve. Much of the show when it does have something to make this show deeper and better is mostly ignored or is confusing such as Ookami’s struggle with femininity.\\n\\n\r\nBasically, when Ookami-San and Her Seven Companions is done and over with, this show is not terrible nor do the flaws kill the show completely. However, this is ultimately incredibly average and is not worth watching. Too many questions linger without resolve, Ookami is as confusing a character as ever, and a few of the episodes could basically not exist. Just skip this one and save some precious time to watch something more worthwhile.",
            "date": "2017-10-23T18:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 261538,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1217989.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BowlingJD",
                "username": "BowlingJD"
            },
            "url": "https://myanimelist.net/reviews.php?id=261538"
        },
        {
            "content": "Truth be told, the only hook I was given while being dragged in to watching this anime was that the male protagonist speaks like a Prinny.  After finally finding some time, I sat down and watched the whole series.\r\nNow the start looked very promising.  We are introduced to our bumbling male lead and the apple of his eye, the titular Ookami-san.  A few episodes later introduces the rest of the members of the Otogi Bank before seguing in to an ominous shadow.  Now at this point, the story gets switches rapidly between the ominous Onigashi thread, the characters and reinserting somelight-heartedness back in to the mix for variety.  It isn't that horrible a mess but I find the pacing off.  That aside it even leaves the main conflict between our leads and their antagonists unsatisfactorily resolved.  A real shame but it may have more to do with the short nature of series (ie it is only 12 episodes long).\\n\\n\r\nThe animation however is constant in quality despite the number of action scenes worked in.  Funnily enough, it also runs the gamut in terms of variety, showing off serious situations and slapstick comedy with equal attention to both without taking anything away from the scenes.  Solid showing.\\n\\n\r\nProps as well to the sound, and one of the few times a voice actor really does make the show better for me.  More specifically, the lemony narrator as voiced by Satomi Arai.  That's not to say the sound falls short in the other departments.  The background music shows variety to accompany the various scenes and supplements the art well.  Especially when some damn heroic stunts need to pulled off and succeed, set to the tune of the opening no less.  What mars this good sound direction are the sound effects.  There is one grating flaw and it is that damn meow sound effect used by the Neko Knuckles.  Of course that's some would no doubt find it funny that a punch is masked or glossed over by it but it really really bothers me.\\n\\n\r\nIn terms of character I say the effort put in is adequate.  Here as well, variety is a watchword.  We are treated to our expected stereotypical characters and then there are those that evolve as the show runs its course.  Mostly its our male lead, which I find pleasingly not stuck with his neuroses and weaknesses and who moves forward.\\n\\n\r\nWhich brings me to the end of my musings.  I'm a sucker for lemony narration though and this one is really well done, which is why I was laughing most of the time when it was twisting well known fairy tales with the fight scenes alleviating the boredom when humour could not.  I can't say Ookami-san is a bad anime though but it wouldn't be the first thing I recommend this season.  Give it a try and see for yourself.",
            "date": "2010-09-21T07:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 30687,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/109544.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Thaiberium",
                "username": "Thaiberium"
            },
            "url": "https://myanimelist.net/reviews.php?id=30687"
        },
        {
            "content": "----Might Contain Spoilers and Angry Rants----\r\nThose who really like this anime please leave.\r\nFirst of all, it is my fault. My fault that I watched this anime while setting my mind that I would take this anime's plot seriously.And Because of that, I am depressing myself over the fact that this anime sucks in so many ways. The typical tsundere loli? The typical passive protagonist? Here are the reasons why I', frustrated after finishing this anime.\r\n1.What annoyed me the most is the narrator. Yeah. The narrator. She constantly interrupts the scene and leave me frustrated enough to slam my head onto the keyboard. I can't payattention to what the characters are saying because of this stupid shit narrating that interrupts even at an important points.\\n\\n\r\n2.Development. There are not even a tiny bit of development between the characters. Oh yeah. there is. Ryoushi and Ryouka are a little bit closer than before. Ryouka finally acknowledges that Ryoushi is a man capable of protecting her. About the other characters? They are as the same as when you're first introduced to them.\\n\\n\r\n3. The plot. there are no closure to this anime. Well not that I expected a full closure but at least you could give a gist of what will happen at the end of the story. But NO. Fuck that. Lets leave all the audience wondering what will happen to them, even after this anime end in this season. Even the fight between Ryoushi and Hitsujikai Shirou is barely started, and yet unfortunately its at the 11th episode already, almost the end of the season.\\n\\n\r\nahhhh..lets stop this. I'm sorry guys. I know that this anime shouldn't be taken seriously.Even the producer of this anime didn't take this seriously. We should actually watch this anime and laugh by its comedy, but I can't. I'm annoyed with the narrator, the plot goes into drain, and the characters didn't even develop a bit, whats left? An eye candy art? Yeah that's forgivable. The art is still good enough for me. Reminding me of Toradora. Maybe it can be repaired with a 2nd season. But no. This kind of shit should be stopped.\\n\\n\r\nFor those who want to watch this, set your mind right. If you want to indulge yourself into a serious anime with a deep storyline, avoid this. but if you just want to laugh your ass off and watch a light anime, without questioning the plot and how the producer put a closure to this anime, maybe this is the one for you.\\n\\n\r\nOh, and I gave this anime a 6 right. That is only because of the art, and apparently I had a good laugh in some moments.",
            "date": "2013-01-25T14:46:00+00:00",
            "helpful_count": 4,
            "mal_id": 84817,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1949374.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 2,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/shiki00",
                "username": "shiki00"
            },
            "url": "https://myanimelist.net/reviews.php?id=84817"
        },
        {
            "content": "well this being my first review,i decided to write because of the anime itself, though it may seem uninteresting,believe me it has it's charms\r\nthe protagonist portrayed as a shy boy-would fight for ookami-san without thinking if what attracted me to the show, the art is gr8 , the story line is no doubt great as it does not let the show go into boring territory,lack of fillers makes it worth it totally, to me who downloads and watches the shows it was totally worth watching,it has really good fighting sequences and a sure fill of comedy, specifically i found the narrator a little annoying butwithout her..nah...it won't be fun...  Finally to all those who are delaying watching this plz just \"Go For It\"  ya the no progerss of the main couple would be a disappointment",
            "date": "2014-04-22T23:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 140987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3674285.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/alpha23",
                "username": "alpha23"
            },
            "url": "https://myanimelist.net/reviews.php?id=140987"
        },
        {
            "content": "This anime is short and sweet. Something to pass the time with and it' s rather enjoyable. It provides decent action, comedy. and romance., although it could have been better. The main thing that I disliked about this anime was the narrator that would not shut up! Even while characters are speaking, it gets annoying fast. Sometimes the narrator would make a funny comment but it was just pointless in having a narrator at all. Overall it's a good anime and I recommend it if you don't have anything else better to watch.",
            "date": "2015-01-21T11:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 178686,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4182867.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hi_Im_Tab",
                "username": "Hi_Im_Tab"
            },
            "url": "https://myanimelist.net/reviews.php?id=178686"
        },
        {
            "content": "My review for Ookami-san to Shichinin no Nakama-tachi\r\n=====================================\r\nSimply a Rom-Com-Drama Slice of life anime, This season has been done as a \"day-to-day\" adventure, Where each episode is it's own adventure for our cast. \r\nStory : 7/10 :\r\n Partially romance between our main male and female protagonists, Our main protagonists works at \"Otagi-Bank\" basically I club in school that helps people our in return for favours (I help you, you help me), So each episode is more or less and episode about that, A little more serious than Sket Club but that's essentially what it is. \r\nArt : 8/10 :\r\nThe animation was done well, up tostandard no reason to complain. ( 9 & 10 scores reserved for distinguishable animation styles that work. Basically a style that is easily recognized as a particular studios work.) \\n\\n\r\nSound : 10/10 :\\n\r\nThe voice acting has been done well and the voices fits their personality and looks (Japanese Dub). \\n\r\nSound effects have been done up to standard. \\n\\n\r\nI'm not one to actually listen to the opening or closing so I won't be rating that since honestly that (to me at least), doesnt make or break an anime, \\n\\n\r\nCharacter : 6/10 :\\n\r\nThough I really enjoy this anime, other than our 2 main protagonists the rest of the cast don't really develop, they are introduced we learn about their pasts and that's about it. \\n\\n\r\nThough in most \"day-to-day\" type animes that's usually what happens, and we learn more about the characters in the long run after multiple seasons. (example: Sergeant Keroro, Hayate the Combat Butler)\\n\\n\r\nThough the cast is full mix of characters that we are used to seeing, they are quite underdeveloped,\\n\\n\r\nEnjoyment : 8/10 :\\n\r\nI personally enjoyed this anime for the most part trying my best to not get bothered by the really annoying narrator, The reason's the narrator is annoying is the interruptions and the overlapping of speech, \\n\r\nIt's like your watching this anime with a friend who already watched it and they can't stop explaining about this and that. \\n\\n\r\nFrom time to time they will break the fourth wall as comedic relief and in moderation that's fine, But when the narrator has to explain everything again and again as if the viewer can't add 2+2 by themselves. \\n\\n\r\nThough either way I personally enjoyed the anime and if it was any less than it is, I would have probably dropped this because of the narrator. \\n\\n\r\n==============================================\\n\r\nI hope you found my review helpful\\n\r\nIf not, Please send me a message as to what I can do to improve my reviews.\\n\r\nLike what I should add, what I should removed, What information do you want to see in a review.\\n\r\n==============================================\\n\r\nAnd If you have the time please check out my list if you have something to recommend to me, Always looking for another friendly recommendation. \\n\\n\\n",
            "date": "2015-05-24T12:46:00+00:00",
            "helpful_count": 4,
            "mal_id": 188719,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4478941.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DjKagamine",
                "username": "DjKagamine"
            },
            "url": "https://myanimelist.net/reviews.php?id=188719"
        }
    ],
    [
        {
            "content": "Even though the series is very short and the plot/story isn't very complex at all, it is interesting enough to keep you wanting to watch more.\r\nWhile I originally watched this assuming it was more focused on romance, the comedy kept me laughing each time.  There is some romance, but not enough to really enjoy beyond the comedy of the romance itself.",
            "date": "2011-09-26T18:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 44241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/307981.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ragesugar",
                "username": "ragesugar"
            },
            "url": "https://myanimelist.net/reviews.php?id=44241"
        },
        {
            "content": "This show doesn't quite give what you'd expect if you were going in to find a good story because frankly, the main overarching story does not get resolved at all and you are pretty much left with guessing what actually is happening. The motives of the main villain is never explored and nothing is actually resolved with the conflict as both sides are exactly where they start out at by the end of it. That would what you'd expect out a terrible show but there is still a bit there if you are really digging which people take the chance to cling onto. However, ifyou are watching for the story, this might be one of the worst show you could watch as it will leave you wondering why did any of it even happen once you finish it. \\n\\n\r\nThe general tone of the show regarding Art, Sound and Characters are what you'd expect and overall quite generic. The tsundere female MC, the shy but nice male MC, the cute and protective friend of female MC and a cast of somewhat generic anime tropes as background characters. All this glued together with references to popular fairy tales. All of this makes for an average school anime with a slight twist. 6/10 material right there, 5/10 for the terrible story right? \\n\\n\r\nAll except for how much enjoyment I got out of the parody elements of the show. The whole show makes a lot more sense if you don't take it at face value and just feel how well the tropes are played. The evil school with the evil people are evil because the show needs conflict, they even tell you this in one of the episodes. The whole plot is a cheesy mess just because it's not important. The character dialog is often covered up by the 4th-wall breaking narrator because it's not important. It's all just there because it has to be. It is only uses it as a way to put the characters in situations where you can get their interactions. \\n\\n\r\nThe show was quite an enjoyable sitcom and the tropes played are enjoyable if you aren't super serious about it. The way the characters play off each other in situations are both fun and funny. That is what made the anime worth watching. It knows why a lot of comedies like this are funny and it makes a joke of the other aspects of some shows like this. \\n\\n\r\nOne thing that this show does however seems to be that it is way too subtle with some of these parody elements. I feel like there is a joke there about why the kids never go to the adults but the reasoning is just be the kids don't want to worry the adults which is a joke in itself but they could have done a lot more to emphasize it. Thing like this could be played a lot more openly. This makes it harder to tell when the show is actually joking or just bad. This doesn't bother me too much but I can see a lot of people missing it as a joke, if it was intended as one. I don't claim that all the terrible plot holes and bad writing are just for comedic effect but the show was genuinely enjoyable to me and I over look all that just because of it.\\n\\n\r\nNot the best anime but if you can enjoy it as a parody, the comedy is fun and enjoyable.",
            "date": "2016-03-02T22:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 212135,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5196167.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Majorohminus",
                "username": "Majorohminus"
            },
            "url": "https://myanimelist.net/reviews.php?id=212135"
        },
        {
            "content": "It's definitely nice! I absolutely fell in love with the characters! They're impressively made in my opinion. xD\r\nJust wondering though.. There's one blond girl in the image on the myanimelist thing.. But there's a blonde guy in the anime.\r\nHowever the blonde guy isn't in that image on this page. \r\nIs there some kinda connection?",
            "date": "2010-07-03T21:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 27933,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RedRaine",
                "username": "RedRaine"
            },
            "url": "https://myanimelist.net/reviews.php?id=27933"
        },
        {
            "content": "Ookami-san to Shichinin no Nakamatachi is the daily lives-day anime that contains elements of comedy, romance, and action.\r\nthe highlights of this anime is: anime uses the general idea of the various fairy tale, which is then made ​​in a story by including the role Ookami and her friends in the story of the fairy tale it is. in other words, its creates a unique a unique and interesting story, because we like watching a fairy tale with a Different  \"version\" and adapted to our daily lives are now ...\r\nthe character depiction is quite unique, and fits with the story, so as to produce agood story, even though the hero has a weak character (typically, weak-looking hero is not liked by the audience).\\n\\n\r\nthe lack of this anime is.perhaps the narrative may be somewhat exaggerated, and sometimes make comments that do not need.\\n\\n\r\nbut after all,the unique of the stories and the fresh parody makes the viewer Enjoy this anime.",
            "date": "2012-04-16T23:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 59019,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1230421.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kururugikai",
                "username": "kururugikai"
            },
            "url": "https://myanimelist.net/reviews.php?id=59019"
        },
        {
            "content": "I've seen a fair amount of negativity about this anime so I decided to try it out and I was looking for some slice of life animes.  Yes I am that one guy that likes slice of life romance cliches.  \r\nTo be honest, it wasnt THAT bad.  The show had some promising characters and the mc shows development in throughout the show.  He starts from being a pussy that I initially disliked to becoming a more, well thought out character.  The female mc of this story is your tsundere badass.  The show depicts her as strong on the outsidebut she is actually terribly weak emotionally and our mc provides support for her throughout the show.  \\n\\n\r\nThe show tries to take on serious topics, which I didn't think was appropriate.  They should have fleshed out the romance a bit more.  The slice of life comedy vibe this show gives off was not optimal for the very heavy subjects that were forcefully shoved into there.\\n\\n\r\nThe romance and comedy here and there made it a fun show.  And what's surprising is that this show didn't show much skin.  I think what everyone is bitching about is the ending of the show, as it ends, you feel a sense of emptiness as it leaves you to cling......\\n\\n\r\nFeeling sadness I searched around for an ending.  The LN for ookami shichinin has ended but no translation were found wherever I looked.  So if you're expecting this anime to give you romantic closure this wouldn't be the right anime for you.  If you like a short and sweet romance, slice of life, drama anime this could be a fine watch FOR SOME.\\n\\n\r\nI guess the verdict of the show was: \"You were okay, time to move onto the next show.\" If you're the kind of person to expect a romantic closure this isn't for you.  This is just a quick grab for short bits of romance and comedy.",
            "date": "2016-06-14T23:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 220792,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5348731.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Arsuwo",
                "username": "Arsuwo"
            },
            "url": "https://myanimelist.net/reviews.php?id=220792"
        },
        {
            "content": "I just rewatched this anime after 8 years. Straight to the point, I'd recommend this anime if you like cheap and satirical comedy with a simple story. The anime isn't great, but it's enjoyable, even more if you are just watching it as a stress reliever and not as some deep and meaningful piece.\r\nNow, the flaws. The thing that disappointed me the most was how the character development is discarded so easily after the key episodes. For example, the protagonist surpass his fear for the sake of Ookami, but sometimes he suddenly come back with his phobia just for the sake of a joke andthat type of thing gets tiring after happening so many times.\\n\r\nAnother thing that I would consider a flaw is how there's almost no progress in the romance. It sure has its nice moments, but almost every interaction between Ookami and Ryoshi ends with him complimenting her and getting beaten just for the sake of maintaining the yandere-like behavior.\\n\r\nAlso, there's almost no explanation about the main story. It feels incomplete, because even after the introduction of the Hitsujikai character as a trigger for Ookami backstory and the progress of a more meaningful story, the anime just goes on without explaining much and ends without answering any of the viewer questions.\\n\r\nEven with all these imperfections, I loved the satirical jokes using anime cliches and the heartwarming episodes, like Ringo's one.\\n\\n\r\nThis review probably has a lot of flaws, I'm sorry. This is my first review and english isn't my first language. Thanks for reading! I hope my review was useful.\\n\\n\r\n(∩✧Ѡ✧)⊃━☆ﾟ.* MAJO BEST GIRL",
            "date": "2019-02-02T17:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 300734,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6556584.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Alumnum",
                "username": "Alumnum"
            },
            "url": "https://myanimelist.net/reviews.php?id=300734"
        },
        {
            "content": "Ookami-san to Shichinin no Nakama-tachi is an overall okay anime, not the greatest but not the worst. Long review ahead and is generally spoiler free. \r\nStory \r\nThe story is like your standard highschool romance comedy. But unlike most highschool romance comedies, there is an actual villain - Hitsujikai. His and Ookami Ryouko's past is what makes the show more interesting. Each episode has underlying fairy tale references which are interesting and well executed.\r\nThe story does have flaws too. Some of the episodes are quite strong. For example, my favourite episode - Episode 9 where Shirayuki-senpai and Akai Ringo's past is shown is one of thestrong points in the story. It adds to Ringo's character and makes her more developed and takes away the impression that she is just Ookami Ryouko's sidekick. \\n\\n\r\nWhile there are good episodes, there are some episodes that serve no purpose and are a waste of time. Episode 8 was probably one of the worst episodes in my opinion. The two characters - the butler and Chutaro Nezumi were annoying (Chutaro being your stereotypical rich brat and the butler with his weird and crass jokes -__- ) and the whole episode was pointless and I see it as wasted twenty minutes and money to make one dumb episode.\\n\\n\r\nThe ending in my opinion was rather unsatisfying. (No spoilers)\\n\\n\r\nArt\\n\\n\r\nThe art was okay, not too shabby. I liked the character designs. If you have noticed, the show has references to fairy tales and Japanese folk tales. You can tell from the design of the character. However, I find Morino Ryoushi's design rather bland in comparison to crazier characters such as Majolica le Fay. The animation was consistent throughout. \\n\\n\r\nSound \\n\\n\r\nThe voice actors did a good job with the voicing of the characters and conveyed the emotions of the characters well. The background music consisted of the continuous re-use of the opening, this irritated me. The show is reliant on the narrator. Although it is good to have a narrator who could help make things clearer for the viewer and help them understand the story better, the narration is too much for me because they should give the viewers some space to think instead of having the narrator's voice going on and on.\\n\\n\r\nCharacter\\n\\n\r\nThe main characters are reasonably well developed. \\n\\n\r\nOokami Ryouko is a strong, manly girl with a tsundere attitude. However, she goes beyond the one-sided tsundere. She has a hidden self that no one really knows and is much softer on the inside. Ookami seems real and I can somewhat reach out to her. I find her relateable, compared to other anime heroines. \\n\\n\r\nThe male lead, Morino Ryoushi was probably one of the more dynamic characters. From a quiet boy with a scopophobia (anxiety disorder that is characterized by the fear of being looked at), he transforms into a braver person who is able to stand up for his friends due to his crush on Ookami Ryouko. Both of them make a decent couple in my opinion. \\n\\n\r\nAkai Ringo is Ookami Ryouko's best friend. She seems to be a happy-go-lucky loli character. However, she is not a typical loli and is rather tricky. Kudos to breaking the stereotype!\\n\\n\r\nThe supporting cast had a lot of people. Other than the ones part of the Otogi Bank such as Alice and Majolica, the side characters are less memorable and do not leave any impression on me. Some of the characters were plain awful such as the butler or the rich kid from Episode 8. I wished it cut down on fan-service and maybe reduce the number of side characters. As the saying goes, \"Too many cooks spoil the broth\".  \\n\\n\r\nEnjoyment\\n\\n\r\nOokami-san to Shichinin no Nakama-tachi is not particularly memorable but I would gladly rewatch it just for the laughs. I like the animation and characters the most. Perhaps the show would be better if the plot was improved. \\n\\n\\n\r\nIn conclusion, I'll give the show a 7/10. It is not too bad and I recommend it to teenagers. It is light-hearted and sadly, has untapped potential. Although I expected slightly more from the show, I enjoyed watching it overall. \\n\\n\r\nI hope you find my first review useful and have a nice day.",
            "date": "2016-05-25T19:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 219316,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5431233.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fullmetalxsoul",
                "username": "fullmetalxsoul"
            },
            "url": "https://myanimelist.net/reviews.php?id=219316"
        },
        {
            "content": "Okami-san\r\nEmbodying the fairy tales of yore, Okami-San is a fun, hilarious, romantic romp. (Warning, there is a spoiler at the end of the story panel)\r\nStory \r\n The story centers upon a modern day club, The Otogi High School Bank, which does essentially any requested favor which in return earns the club a favor that can be cashed in at any time. This club plot seems quite over-used but Okami-san offers a unique story line where many episodes are re-telling of classic fairy tales, such as Cinderella, but with a memorable Okami-san twist. Many are quite noticeable and others are more subtle. The Romance between themain characters starts off with one sided love but both begin realizing their feelings as the show progresses. The ending although a cliffhanger, was great where it left off being a true Tsundere ending, with Ryōko not being able to express her romantic feelings.\\n\\n\r\nCharacters \\n\\n\r\n All characters within Okami-San are quite pleasant; the side characters are lovable and the main antagonist is delightfully evil. Much like the plot, all characters are based on fairytale characters.\\n\\n\r\nRyōko Ōkami is the “Main character” within Okami-San. Beginning as a simple Tsundere, scary and tough on the outside and sweet and kind on the inside, but is later learned she has had a tough last couple of years. She originally sees Ryōshi as a weakling but later develops romantic feelings for Ryōshi.\\n\\n\r\nRyōshi is actually the “real” main character with many segments focusing on him. Ryōshi is a shy boy suffering from Ophthalmophobia, a fear of people staring at him. Ryōshi also is able to blend into the environment for he has a bland appearance. Incidentally he is deeply in love with Ryōko doing everything is his power to protect her.\\n\\n\r\nArt \\n\\n\r\nThe Backgrounds are pleasant and the character designs are almost standard, however the character design also portrays the personality of a character. Such as Ryōshi, whose eyes are rarely shown showing his ability to blend into the environment. Many other character designs portray the fairytale character the character is based off of.\\n\\n\r\nSound\\n\\n\r\nQuite standard, although the narrator’s voice frequently cuts off many of the important details due to loudness (This may be only my copy)\\n\\n\r\nOverall\\n\r\nOkami-san is an adorable comedy that is well worth the watch\\n",
            "date": "2013-12-09T18:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 123219,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3092475.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Gerutoast",
                "username": "Gerutoast"
            },
            "url": "https://myanimelist.net/reviews.php?id=123219"
        },
        {
            "content": "The narration over the characters talking was horrible. The random adventurers and tasks they take on are very bland while none of them seem very connected or help build the character. The relationships never really develop beyond anything promising and you feel like there is no accomplishment in finishing the anime beside for the fact that its finally over. we all lived happily ever after.....lame!!!!!",
            "date": "2013-06-04T16:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 99805,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/319864.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dem0nflare",
                "username": "Dem0nflare"
            },
            "url": "https://myanimelist.net/reviews.php?id=99805"
        },
        {
            "content": "Ookami-san to Shichinin no Nakamatachi (Okami-san and Her Seven Companions) was a cute fairy tale like story that follows the adventures of Ryōko Ōkami and her colleagues from the Otogi Bank as they solve problems, right various wrongs, and fight delinquents (its basically the story of Little Red Riding Hood gone rogue). How’s that for a fairy tale?\r\nOkami-san and Her Seven Companions didn’t really grab my attention at first but I stuck with it and it actually turned out to be pretty good in my opinion, but there were a lot of holes in the story because of the lack of details and it leftme with a few unanswered questions. The story revolves mostly around Okami, Ringo and Ryoushi and their love-hate romance. The story has some dark moments but for the most part its pretty funny and really strange. Towards the end of the series Okami’s feelings towards Ryoushi start to become clear but what happens between them is unknown because the series ends with sort of a cliffhanger.\\n\\n\r\nOver all I enjoyed the anime.Though, it would have been better if it was a little longer and if the anime was planned out a little better (I feel as if it were rushed). \\n\\n\r\nSo if you love/ loved fairy tales and you wanna try something different anime wise or if you just need an anime to make you smile/laugh and kill some time I would definitely recommend it! (Note: make sure you remember what name goes with which character or else it will get very confusing.)",
            "date": "2012-11-22T02:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 78127,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1798013.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DeadmanAnarchy",
                "username": "DeadmanAnarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=78127"
        },
        {
            "content": "Hello, and welcome to the Fullmetal Narcissist anime review! I’m your host, Naru the Narcissist, and... You know what? People make mistakes for a reason. It’s not just so we can learn from them, but so that we can teach other people about them, too. And today, I’ve decided to educate all of you about a mistake that I made recently, and on that note, this is my review of Okami-san and her Seven Companions.\r\nRyoko Okami is a sixteen year old student, who goes to the very prestigious Otogi High School. She has a strong sense of justice, and is always ready and willing tothrow her all into a fight in order to protect herself and others. This admirable toughness, along with her generosity and benevolence towards those weaker than her, serve her very well in the Otogi Bank, a school club that does favors for people in exchange for returned favors down the road.\\n\\n\r\nShe often works with her best friend and room mate, Akai Ringo, a girl who’s sweet and charming on the outside but cunning and manipulative on the inside. Together, this team of Wolf and Red strike terror into the hearts of the wicked... All of whom look like stereotypical anime punks.\\n\\n\r\nOne day, as they’re walking home from a mission, a mysterious boy from their class follows them, and proclaims his love for Ryoko! His name is Morino Ryoushi, a boy who’s bold in tongue but shy at heart, who gets terrified whenever somebody stares at him. But only if they think the word ‘staaaaaaaare’ while they’re doing it. With his ability to seemlessly blend into a crowd, he gets recruited into Otogi Bank, and now, the three have to continue working together! Well, that’s the set-up... I’ll save the plot for later, because hoo boy.\\n\\n\r\nFor now, Okami-san was produced by JC Staff, the people who produced Index and Toradora, and to say that it’s a step down would be putting it nicely. For those who don't remember it, the animation in Toradora could occasionally look cheap and clunky, like a sketchy pen-and-ink design that isn’t quite finished. There are quite a few shows that default to this style once or twice in order to stretch their budgets, like Samurai Seven and Welcome to the NHK. It’s ugly, but taken in small doses, it’s not the worst thing in the world. Well, Okami-san is presented entirely in this style, from beginning to end, and it’s incredibly difficult to get used to. The backgrounds and landscapes are amazing, but in regards to the characters... It’s like K-ON, but a few drafts shy of the final draft.\\n\\n\r\nThe dub isn’t terrible either, but we are unfortunately dealing with a Jamie Marchi script, and like usual, I can tell it’s her within the first half of episode one. Have you ever had a weird aunt who tries to look cool by saying all the hip slangy stuff that she thinks your generation will be able to relate to, even though she just comes off as ironically charming at best? That’s Jamie Marchi. Thankfully, she shares duties with Chuck Huber, so it’s not as bad as it could have been.\\n\\n\r\nJoel McDonald plays Ryoushi as earnestly as possible, doing a great job in making him likeable. Monica Rial seems to have a great understanding of her character, as she’s able to play every shade of her personality believably. Oddly enough, the one who falls flat is Brina Palencia, who would normally be one of my favorites. I’m going to chalk this up to bad casting, because she never really seems to own this particular character.\\n\\n\r\nThe most depressing part of the dub is Luci Christian, whom I have come to consider the queen of voice acting. Whom I would sell a kidney to meet in person. She plays the part of the narrator, who’s job extends far past the intros and outros that you’d expect her to voice. No, she’s present through the entire show, talking our ear off the whole time. She dumps exposition on us, makes rude comments about the characters and their bodies, she drowns out the dialogue, and basically struggles to find some sort of a point for her own existence. Luci tries to make this character interesting, but even with her behind the wheel, I haven’t heard narration this pointless, cruel and infuriating since Pitch Perfect.\\n\\n\r\nSo, I didn’t want to go into the plot earlier, and for my reason? Well, the plot of this show is an extensive point of discussion all it’s own. This is the basic plot, in a nutshell... Ryoko is only pretending to be strong, but she’s actually scared and girl on the inside, and it’s Ryoushi’s job to warm her icy heart and turn her back to her normal girly self, so that he can be strong for her instead.\\n\\n\r\nThe term ‘sexist’ gets thrown around a lot, but when the plot of an anime boils directly down to ‘woman not really strong, let man be strong for you,’ that’s a pretty big red flag, particularly when it has to remind you over and over again that the main character isn’t actually strong. Yeah, I’m sorry, was she just duking it out in a street fight with several armed older men? Was she just putting on a brave face while a much larger group of them took her down and attempted to violate her? And she’s not strong because she’s afraid and only pretending to be strong? Because she likes puppies and girly novels? Do I even have to point out the layers of bullshit at play here?\\n\\n\r\nSorry, but fearless bravery isn’t real bravery, it’s just stupid recklessness. Being scared but doing the right thing anyway is true courage. The Olson Twins’ made for TV Halloween movie taught me that when I was a child, and this show still has a tough time understanding it.\\n\\n\r\nOh wait, there’s an explanation for it. She pretends to be tough because she got violated by somebody in middle school, but when she tried to report it, nobody believed her, and everybody started to hate her for lying. There’s a certain nuance to that... She’s scared and distrustful because she was violated and never vindicated for it, but she acts tough because she doesn’t want it to happen again. Her best friend wants to set her up with a good man so she can slowly undo the damage that was done to her. Makes sense, right?\\n\\n\r\nWell, ignoring the troubling implications that this idea makes in regards to the creator’s opinions towards women, I have to ask... Why am I supposed to want to see this change happen? What do I, as the viewer, get out of it?\\n\\n\r\nOkay, for the sake of comparison, let’s talk about Batman for a moment. Yes, I know, they have nothing in common... Ryoko became a kick-ass vigilante because something traumatic happened to her in the past, while Bruce Wayne became a kick-ass vigilante because... Okay, maybe they’re not that different. Well, Batman’s backstory is so well known that every single incarnation of his story has explored it at some point... Except for Brave and the Bold during daytime hours, because we must censor to protect the children... and it ties in perfectly with the development that happens down the road.\\n\\n\r\nNow, I’m not the first person to suggest this, but it would be very healthy for Bruce Wayne to just get over his parents’ death and give up the crime fighting. He could put aside his cape and cowl, and just live life as the wealthy philanthropist playboy he was born to be. find a good woman, start a family, and live the American dream.\\n\\n\r\nSo, if it would be in his best interest, why doesn’t it happen? Because if it did, nobody would care anymore. The fanbase would die off, and the only readers left would be the ones holding onto the hope that it’s just some sick dream created by The Mad Hatter.\\n\\n\r\nSimilarly, seeing Ryoko giving up on her quest for justice would take away what is, frankly, the only interesting thing about her. Without it, she’s just another generic Tsundere, like Naru from Love Hina. She is not my namesake. And yet, her best friends... And some viewers as well... want to see this development happen. Apparently it’s okay for a grown man in a black suit to dedicate his life to being strong and kicking ass, but a teenaged high school girl? Work through that shit!\\n\\n\r\nAnd here’s my biggest problem with this show. Bigger than my problem with the narrator, or with Marchi’s writing. Remember Ryoko’s best friend, Ringo? These two didn’t meet until a year after Ryoko’s assault. The person Ringo met is, through and through, the very damaged tomboy she’s trying to change. I’m sorry, but if you think that friendship is trying to change somebody into a better person that you think they can become, you’re not a very good friend.\\n\\n\r\nBack in March, I wrote a review on my blog about a little anime called Oreimo, a title that is more or less the shortened version of ‘My Little Sister Can’t Possibly be this Cute.’ Guess what it’s about. But despite all of it’s shortcomings, I praised Oreimo for having a cast of characters that make the effort to try and understand and accept each other for who they are. At least, in the first season.\\n\\n\r\nAnd now, you expect me to be entertained by some bullshit series where an awesome character’s best friend wants to hook her up with a man so she’ll be more ladylike? And you’re going to look me in the eye and tell me that Okami-san is popular, but Oreimo is despised by people? Are you fucking kidding me? Oreimo’s writing was great until the 2013 revival, but Okamisan’s writing was bad right out of the gate!\\n\\n\r\nFor the first six episodes or so, I didn’t mind this show. The chauvinism goes pretty deep, but it was kind of funny a few times, it was mostly harmless, and the annoying narrator was at least making one or two good jokes.\\n\\n\r\nIt was at about the halfway point that the low quality of the writing really started to overpower what little good there may have been. It tries to do both comedy and drama, but it never succeeds in creating a balance between the two. It can actually be pretty damn jarring at times. To summarize, Okami-san tries to go to some really serious places while struggling to take itself seriously. They even manage to work ecchi undertones into a CPR scene, for Christ’s sake! After seeing what Ouran High School Host Club was capable of, no anime should ever have an excuse to blend comedy and drama this poorly!\\n\\n\r\nThere are too many characters, and the ones that we get to spend time with normally only get a single episode dedicated to them before they fade back into the background. The narrator wears out her welcome fast, and doesn’t tell nearly enough funny jokes to justify her presence.\\n\\n\r\nAnd if that’s not bad enough, this show actually seems to be terrified of itself. We never see the Otogi Bank actually pursuing a debt, because it’s terrified of making the characters look unlikeable. The constant fairy tale references never really amount to anything, because it’s terrified of not being taken seriously. We never find out exactly what happened to Ryoko in middle school, because it’s terrified of upsetting the audience. We never see Ryoushi asking her out on an actual date, because it’s terrified of exploring how such an exaggerated character would react to normal social interactions. The narrator won’t shut the hell up, because it’s scared that the writing won’t hold up on it’s own.\\n\\n\r\nThe writing in general, is really, really bad. It constantly alternates between being insultingly stupid and just plain boring. The amnesia storyline alone is an episode painful enough to skip. The episode where a butler tries to find a bride for his ward is even worse, as he uses it as an excuse to make shallow, despicable remarks about the entire female cast before revealing that he didn’t need to be there in the first place. At no point do the characters ever act like real people.\\n\\n\r\nAnd the ending... You know what? Throw up a spoiler tag, because I really fucking need to address this. At the end of the series, a rival school... The respective hell to their heaven... kidnaps several main characters, and just to make things more personal, Ryoko is kidnapped and held hostage by the very man who allegedly did something violation-y to her. I won’t tell you how this is resolved, but I’ll sure as hell tell you how it isn’t resolved. Despite the clear cases of assault and abduction... and others, I’m sure... Nobody calls the cops. Who definitely exist in this universe. Would it be anticlimactic, like the end of Monty Python and the holy Grail? No, because Ryoko is being held captive by the very man who got away cleanly with something vague to her. Yeah, it doesn’t take Dick Tracey to look at this scenario and start wondering if she’d been telling the truth back then.\\n\\n\r\nFor the non-spoiler version... The main villain, who is introduced with a promising bang, ultimately fades out with an anticlimactic whimper, promising revenge for a sequel series that will hopefully never come. Hell, that’s pretty much how the series ends as a whole… Nothing is resolved, and early implications about the village being part of a social experiment filled with fairy tale references amounts to absolutely nothing. I know it’s easy to say that someone couldn’t write their way out of a paper bag, but it really does seem like somebody deliberately was trying to do just that... And failing miserably at it.\\n\\n\r\nStrictly speaking, Okami-san isn’t the worst anime I’ve ever seen. It’s not even on my bottom ten. But you know what? I still hate it. I don’t even hate the anime I once gave 0/10, but I hate this anime. And trust me, there’s a very, very small list of anime that I flat-out hate. It’s bad enough that it’s stupid, full of shit, and blatantly sexist, but the way it approaches the subject of rape just tips the scales entirely against it.\\n\\n\r\nI haven’t seen every anime, so I could be wrong about this, but outside of hentai, rape is a subject that doesn’t exist in the medium. It can be joked about, or threatened, but it doesn’t actually happen, and it doesn’t get dealt with. This is one of the reasons that Now and Then, Here and There is such a rare gem… Any anime that introduces a plot point about one of it’s characters being raped, and actually explores the repercussions and recovery of the attack, can easily be considered a ground breaking series. What frustrates me the most about Okami-san is that by introducing the rape implications in a lazy attempt to explain Ryoko’s character, they actually come really close to pulling this off… Only to pussy out at every turn. They vaguely introduce the subject when needed, then drop it cold and try to make us forget about it until the next time it’s needed. I know it isn’t fair of me to whole-heartedly condemn this series because of what I wanted it to be, rather than what it was, but what it was was no peach, okay?\\n\\n\r\nOkami-san and her Seven Companions was dubbed by Funimation, and can be viewed for free on Netflix. You can also find a lot of other anime on Netflix that don’t suck, so don’t even bother with this festering field full of fairy tale feces. It isn’t well written, it isn’t well produced... It just isn’t well. I gave it a four out of ten the first time I watched it, but now that I’ve watched it twice, I think it’s much more appropriate to give this series a 2/10.  \\n\\n",
            "date": "2014-06-05T07:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 145957,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=145957"
        },
        {
            "content": "It seems like everything that turns out to be adaptated into anime get a whole better and nicer to see. Some of the most famous characters created by the Grimm Brothers star on this outstanding masterpiece, produced by JC Staff. Couldn't expect less from them, awesome job!\r\n{STORY - 8/10}\r\nAs any fairy tale, it all began with the classic line \"Once upon a time\". Otogibanashi is the place and this time is close to ours, but the stories may differ a bit from the original ones... Despite the good share of parodies, which are the strongest point from this show, it ended focusing on a lovestory between Ryouko and Ryoushi.\\n\\n\r\nFilled with references, every episode feature a small and modified retelling from known tales, so it's obvious that most of them bring up one or two new, secondary characters that steal the scene for a few moments.\\n\\n\r\nIt's a romance like any other, with this small differential of parodying many fairy tales, something that makes this anime unique and fairly improves the plot.\\n\\n\r\n{ART - 8/10}\\n\\n\r\nNo complaints, it's pretty good and combat scenes are fluid and well animated. Characters outfits are common in most cases and overall scenario's design is satisfying.\\n\\n\r\n{SOUND - 9/10}\\n\\n\r\nWe have a pretty good cast of voices and songs used don't let you down at all! First, \"Ready Go!\" , performed by Yukino Nakashima and played at openings, fast and cheering, is pretty nice to hear and suits well with the active thematic from it's backgroung animation. At the end of any episode, \"Akazukin-chan goyoujin\", sung by OtoGI8, takes the spot with its nice retro video-game style sounds and lovely lyrics. Despite the small lack of background songs, effects created for battle sequences are great and really make up for it!\\n\\n\r\n{CHARACTER - 10/10}\\n\\n\r\nIt's impossible not being amazed with such authentic representations from both visual and personality on most characters, like Ringo, who is small and sweet, hiding a suspicious and manipulating behavior, parodying Little Red Riding Hood. Other \"companions\" at Otogi Bank, a small association that helps students from Otogibanashi Academy in return of \"favors\", are also parodies from both western and eastern tales' protagonists.\\n\\n\r\nProtagonist Ryoushi, shy and isolated from his classmates, gets involved with brave and strong Ryouko, intentionally named as \"Ookami\", supposed to take part as the \"Wolf\", from Little Red Riding Hood. Side by side with the manly girl that has caught his eyes, Ryoushi tries to leave his humilliating attitude behind. At the same time, Ryouko is the one not being sincere with her own feelings and burries them under a brave and rather bully personality...\\n\\n\r\n{ENJOYMENT 10/10}\\n\\n\r\nSuch originallity on choosing a theme like this to parody deserves a special attention and watching it was worthy. Seeing all those adaptations and a short crossover with other animes produced by JC Staff has proven to be a great experience and it could not be more enjoyable... Only if there were a possible second season...\\n\\n\r\n{OVERALL - 9/10}\\n\\n\r\nRyouko's past haunts her and even made she transfer to another school. Hiding a tender behavior under her violent attitude is the best way to avoid relations and repeat the same mistakes. However, an unexpected encounter with coward Ryoushi would change everything for good. Will he be able to reach Ryouko's heart and protect her from anything? A totally messed up fairy tale is about to begin...",
            "date": "2014-01-13T18:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 128689,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=128689"
        },
        {
            "content": "A very enjoyable anime in my opinion, i really liked the characters personalities and back stories, i thought it would be a very tame anime but a couple of the back stories were quite brutal. THIS ANIME NEEDS A SECOND SEASON! The ending wasn't horrible however it  wasn't really an ending, at least i don't feel that it was to the anime, more like to the arc of the plot where Ookami finally starts giving in to her feelings. Id really like another season so that (A.) the two main protagonists can fall in love or whatever the fuck and (B.) So that theycan explain in detail what the horrible thing was that happened to Ookami instead of half assing the explanation. All in all the only thing i hate about the anime is that i cant watch more episode yet.\\n\\n\r\nOn a side note. The 3 main female characters from ToraDora make an appearance thought that was really cool",
            "date": "2013-01-18T03:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 84025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/293532.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ZackyJG",
                "username": "ZackyJG"
            },
            "url": "https://myanimelist.net/reviews.php?id=84025"
        },
        {
            "content": "This anime is awsome! I enjoyed watching it. The characters are well devaleped and the little story that you think is just to keep you entertaed is more devaluped. I expected to be more childish were every one is always happy but the truth is it kepps you wanting to see it more it makes you keep woundering so thats really good. Aswell its fuuny. (There is going to be a sesone 2)",
            "date": "2012-08-26T14:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 70915,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1457225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jnonymous",
                "username": "Jnonymous"
            },
            "url": "https://myanimelist.net/reviews.php?id=70915"
        },
        {
            "content": "Ookami-san to Shichinin no Nakama-tachi is an anime that had some potential, but ended up going nowhere after being dragged down by a variety of factors.\r\nFirst up is the narration aspect.  Clearly intended to be a comedic device, the narration was funny, I guess, in a forced way. However, it clashes with the fact that this anime was supposed to be a RomCom, dragging down some of the show's few potentially impactful serious scenes with random comedy that falls flat. Also, the narration comes in randomly over top of the regular lines, making it so that they can't be heard. While the lines thatget blocked out are never all that important, it still detracts from the experience. This sort of comedy narration might work in a pure comedy, but it just annoys here.\\n\\n\r\nSecond, the story ends up going nowhere. While watching the final episode, I felt like I must have missed an episode and skipped to an extra. Major plot points are left completely unresolved. Throughout the show, sometimes the episodes progress the plot, and other times they don't, making pacing rather erratic. The romance aspect never really went anywhere either.\\n\\n\r\nThird, the characters had some potential, but never really coalesced into anything. They felt vague - like faceless ghosts that are in a human shape, but have no clear identity. For example, Ookami is actually a half-decent character concept, if not entirely original. She's the reason I wanted to watch this show in the first place. But the show can't seem solidify her character. There's nothing wrong with having a character who appears strong but hides some weaknesses, but it never really felt believable. Sometimes she'd be the strong Ookami, and then other times she would be the damsel in distress. Somehow, those two aspects were never really pulled together to create a believable character who has both strengths and weaknesses. The same could be said for Ryoushi. Most of the time, he's a weakling, but then he becomes a powerhouse out of the blue, and those two aspects never feel justified.\\n\\n\r\nThere were some moments I really enjoyed, but they were few and far between. Those moments are why I feel that this could have been a good show, especially romance-wise, but in the end it just came across as a total mess with a bunch of corny 'hero saves the damsel in the distress' scenes, among other overused tropes. A greater focus on the primary plot points, some better character development, and balancing the serious plot and romance aspects with the comedy more tactfully are what this show really needed to shine.",
            "date": "2017-05-31T16:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 249004,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5281009.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nocturnia",
                "username": "Nocturnia"
            },
            "url": "https://myanimelist.net/reviews.php?id=249004"
        },
        {
            "content": "Ookami-san, for those of you who might not know, OSN is a parody, which means there is a narrator that tells the story and snops in whenever he pleases, which means it's very anoying most of time (no offense inttended fto parody lovers); thankfully, OSN is not gendered as a Parody only, so that is some good news. Basically the story plot is a very common one: girl is tough, not so tough guy likes her, she doesn't (innicially) like him back. So, what's so good about this after all? Besides the art, it's the comedic moments that surround some unique characters. Wacthing OSN won'tmatter if the plot is a common one, or if it is a parody, because the characters are so well built that you forget everything else, you'll only want to know what'll happen next and how they'll react. There is a promised laugh every episode.\\n\r\nIt is a refreashing anime that'll make you laugh at strange situations and characters. Once you see it, it'll become unforgetable.",
            "date": "2014-01-10T18:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 128239,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1392591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tsumiru",
                "username": "Tsumiru"
            },
            "url": "https://myanimelist.net/reviews.php?id=128239"
        },
        {
            "content": "A pretty great show, it was a new twist on some old folk tale stories.  The characters were cute and fun, though the main couple didn't progress very far at all.  Other than that it was a very fun show to watch :)",
            "date": "2010-09-16T16:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 30548,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60006.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hitokiri_Ace",
                "username": "Hitokiri_Ace"
            },
            "url": "https://myanimelist.net/reviews.php?id=30548"
        },
        {
            "content": "This is my first review, and really I have no idea why I chose this anime to be my first one to review but it's happening.\r\nWell, where do I begin. Ookami-san focuses on a \"bank\" that helps people with their issues. This is a pretty interesting concept that is sure to grab people's interests, me included. Ok, I admit. I barely skimmed the synopsis before I started watching the show. Due to this, I somehow thought that \"helping with their issues\" meant this was going to be a quiet, soul searching type of anime. And yes, this was completely my fault. Yes, this show hasit's serious points and there are some attempts at being deep throughout the plot. But if you're looking for a phycological, deep anime then please don't look to Ookami-San to fulfill that. If you're looking to turn your brain and watch a rom-com with decent humor that's pretty fun to watch, THEN look to Ookami-San. \\n\\n\r\nStory: There really isn't much of a plot in this anime. It's in that weird in-between area that can't be classed as episodic but doesn't have much of a continuous plot either. I feel like if you sat someone down who's never seen the show before and had them watch a random episode in the middle of the series they'd probably be ok. In a way, this reminds me of The Melancholy of Haruhi Suzumiya. It centers around a bunch of weird kids running around doing weird things in a weird club. There are background stories for some of the supporting characters and that add a touch of seriousness, but a lot of times it's random, forced and feels weird. Ookami's relationship with Shiro is explained as well as the trauma behind it- but the thing is, it never feels finished. Close to the end, it's kind of just dropped and it's pretty frustrating. It just doesn't feel finished or satisfying. The love stories in the show are really nothing to write home about, with one frustratingly slow (It's not like I care what you're doing b-b-baka!) and one between a borderline stalker and a lady's man that's just plain bizarre. Don't expect the ending to wrap anything up either- this is one of those shows that just kind of ends with no real conclusion. \\n\\n\r\nArt: The art is ok. It's nothing special but it's not bad either. Some of the character designs could get on your nerves, like the eleven year old kid the resembles a mouse that comes in for one episode. That one made my eyes hurt. \\n\\n\r\nSound: I have to admit, the opening and ending songs for the show were both extremely catchy and could become addictive. I loved them both. \\n\\n\r\nCharacters: Oh boy, here's where the fun begins. This anime has nearly any archetype you could think of. We've got your Tsundere as the main character- and boy does she stay true to that title. I know a lot of you are die-hard Tsundere funs, but personally I found nothing endearing about a \"tough but actually not\" girl that beat the crap out of poor Ryoushi. The other characters included a maid girl, a snarkly loli, a super eccentric wizard girl, a business-type with little to no emotion, a stalker/obsessive girl, a lady's man, a level-headed guy with a permanent good mood that has his kinks (in this case that includes cross-dressing and disguises) and of course your clumsy, weak love interest that has his manly moments in the name of love. As I stated before, there was some minor development for some characters but there was a lot of wasted potential due to the giant cast and small number of episodes. Another thing people seem to complain about is the narrator. It's true that the \"captain obvious\" moments can leave you rolling your eyes. It's a little much for a serious where there isn't so much going on that things need to be explained constantly. She can be funny though- take her for what she is. Overall, while the characters were likable and very hard to hate, they weren't exactly memorable. Be prepared to see characters that come in for one episode and then are never mentioned again. That includes our lovely poor girl that comes in in the last episode and is for some reason a major plot device- what the heck was that? \\n\\n\r\nEnjoyment: This is a fun show to watch as long as you don't take it to seriously. As long as you take it for what it is, you should enjoy the series. I'm not saying you should put it on the top of your priority list- but maybe consider it for a rainy day with nothing to do. \\n\\n\r\nOverall- 7/10.",
            "date": "2013-12-25T20:58:00+00:00",
            "helpful_count": 0,
            "mal_id": 125625,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2652467.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CronaTheWeapon",
                "username": "CronaTheWeapon"
            },
            "url": "https://myanimelist.net/reviews.php?id=125625"
        },
        {
            "content": "This show had great potential but the studio just destroyed any possibility of that. The writers for the show managed to cram eleven books into twelve episodes. The whole show suffered because of this. For whatever reason they seemed to think that the story wouldn't be good enough to have a chance at a second season, and they guaranteed that by using all the material and giving a poor delivery.",
            "date": "2015-07-12T15:12:00+00:00",
            "helpful_count": 0,
            "mal_id": 193230,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/903BO",
                "username": "903BO"
            },
            "url": "https://myanimelist.net/reviews.php?id=193230"
        }
    ]
]