[
    [
        {
            "content": "Its really hard to tell where GONZO is going with Druaga. The first episode of Druaga is the funniest (and probably the best) first episode of any anime I have seen. It starts off with an RPG-style party (a sword user, an archer, etc) with the aim of climbing the Tower of Druaga to defeat the evil Lord Druaga There was me thinking 'Oh no, the lame shounen of this season', however that all changed quickly. The rest of the episode is about the protagonist's (Jil) journey to climb to the top, and the comic manor it all happened. The not-so-slapstick comedy in this animehas been somewhat refreshing and different to anything I've seen before, which is the reason for the 10 for enjoyment.\\n\\n\r\n However, this actually turned out to be a dream, and from episode 2, it became more serious. The rest of the series continues the party's journey to the top, with less jokes along the way, but ones that will make you uncontrollably laugh nevertheless. Sometimes there are really hilarious episodes, and sometimes more sober-sided ones, which is why I can't really tell where this series is going and why I have given a 7 for story (sometimes the serious episodes aren't that interesting).\\n\\n\r\nThe art is average for this day and age, and likewise with the music (though the opening is very misleading as it shows the characters in modern school uniform, when this is set in medieval-ish times - though this raises the theory that these people could be playing an RPG all this time, like .hack, as it is very game-like with the parties, monsters, maps/levels and the different classes). I do however, like the characters in Druaga; there are no lame characters (the shy one, the overly-clever one) and its epically good there's no 'the-useless-one' of the party; they all seem to have a purpose.\\n\\n\r\nAll in all, a very amusing, but peculiar, anime which is showing good potential. I just hope it doesn't end with the 'power of love' saving the world.",
            "date": "2008-06-02T03:56:00+00:00",
            "helpful_count": 129,
            "mal_id": 5156,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1078.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Puvi2Groovy",
                "username": "Puvi2Groovy"
            },
            "url": "https://myanimelist.net/reviews.php?id=5156"
        },
        {
            "content": "It would appear GONZO seem to think they can use their unique release format to gloss over the fact this series is riddled with flaws.  There are three experiences to be had from Druaga, a hilarious comedy one, a somewhat below average action one and a dire fantasy one.  It is literally a lottery as to which genre will be dominant in each episode.\r\nThe storyline couldn't possibly be any more generic; explore dungeon, defeat evil boss, find legendary treasure etc., its not even well executed.  When its not being generic, it's being downright predictable, major plot points are seen coming a mileoff.  The pacing is atrocious, the characters will spend multiple episodes in floors relatively close to each other then magically be much further in the dungeon just so the series can finish within the episode count.  Much of which is taken up by almost filler like pointless episodes that do nothing to progress what little plot there is (episode 6 in particular).  GONZO have tried to justify this shambles by confirming a second series to continue the storyline, but such a weak reason doesn't excuse this mess.  A real shame after a genuinely fantastic opening episode, that made it look like the series wiould break a lot of these clich&eacute;s, sadly it fails.  If the storyline can't even meet its own expectations, what chance does the viewer have?\\n\\n\r\nAnimation is top notch, nice to see GONZO are still capable of doing something right.  Very impressive scenery and backgrounds throughout the series, with some solid, likeable character designs.  The enemies are also (for the most part) very well designed.  \\n\\n\r\nThe audio is another highlight, very nice opening and ending themes that fit the series well enough.  The background music is good enough and usually appropriate to whatever is going on.  Voice acting is another strong point, with an impressive display from the seiyuu's.\\n\\n\r\nCharacter wise, Druaga once again fails to live up to its own expectations,  the cast is initially nothing short of excellent; likeable characters with interesting personalities, unfortunately there is next to no character development in he entire series, kind of to be expected when there are more characters than episodes though.  Once again the excuse &quot;it'll be fixed in the next series&quot; isn't valid in an analysis of this series.  As a result of little character development, it is hard for the viewer to get attached to the characters and the dramatic scenes lose much of their impact.\\n\\n\r\nDruaga remains an enjoyable enough experience despite these flaws, thanks mostly to comedy episodes, but it can be a genuine atruggle to get through some of other episodes. The comedy episodes if reviewed individually would get nines and tens, whilst the rest of the series would get between four and seven.  It keeps the viewers attention with the promise of better future episodes, which is sort of admirable.  It'd be a lot better if it were a 26 episode series, that'd allow fleshing of the plot and characters as well as removing the rushed feel to the series. Worth a watch regardless.",
            "date": "2008-06-22T02:40:00+00:00",
            "helpful_count": 54,
            "mal_id": 5690,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65203.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zeinzu-sama",
                "username": "Zeinzu-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=5690"
        },
        {
            "content": "Tower of Druaga is perhaps the finest example in years of a non-comedic series taking on all the trappings of fantasy cliché and making proper use of them, and, as such, turned out to be pleasantly surprising.\r\nThe series is based on an old and at the time successful arcade game in which you play a valiant knight entering a leveled tower to slay the evil overlord and rescue the princess. What made the game popular were the various almost random actions you had to perform in order to be able to ascend to the next level. The original game had a number of sequels, ofcourse all involving some even greater evil and an expanded tower.\\n\r\nThe background explains why the series plays out in an enormous tower of multiple levels, each with their own hazards and enemies. As a fantasy series, this is as clichéd as it gets; as a series bearing the Druaga name, this is proper. \\n\r\nUsing this all too familiar fantasy theme has its uses. There really is no need to have to introduce much of the world, background story, and characters: everyone watching the series immediately knows he's in fantasy video game-territory, where everything and everyone has a standard role to play. Within the first few episodes all major characters are introduced, with the main roles being those of the somewhat naive young man who wants to fight for justice and peace, the girl with clerical powers and a dark secret, and of course the more experienced powerful adventurer with his own share of secrets. The cast is filled out with the usual bunch of rugged fighters, silent rogues, and whining but powerful mages, all planning to ascend to the top of the tower, slay the evil monster, and gain the heroes' reward. Of course, the animation and design of the characters is geared to making sure there are no doubts to their roles, as is the vocal cast, which includes some high-profile names but takes absolutely no chances: everyone sounds as their archetype should.\\n\\n\r\nThe first half of the series is used to pound every single trite and generic characteristic of standard fantasy series, from Wizardry to whichever animation of the Tales-video games, into the viewers perception. Expediently enough, it does this by making the episodes comical, even farcical at times. The first episode shows the main character's own vision of his heroics in the most generic manner possible, for instance, while later on the inherent greed of all adventurers is relied upon to have them unite against a common enemy. It is in this half that the series also pays its homage to the roots of the Druaga franchise, as not only are there a few instances wherein the drawing style switches to the top view, 2d, 8 bit look of the original game, but the game itself appears as well, and has a functional role too.\\n\\n\r\nBut I started this review by stating that Tower of Druaga is not a comedy series. This is because, halfway through, it suddenly takes a turn for the dramatic. Usually, this would mean the end of any interest the series would hold, as far too many broken romcoms and action comedies testify to, but in the case of Tower of Druaga, the first, somewhat comical, half turns out to be used to make the viewer comfortable with the generic setting and characters. It makes no sense for the viewer to expect some sort of realism in the setting, and he also has come to expect some sort of volta stemming from the characters' unspoken but clearly known backgrounds. \\n\r\nThe effect is that the viewer does not have to be disappointed by this generic plot twisting or the reactions of the characters to it, as it was already clear that nothing overly original would happen. It is, in fact, this basis in generality that makes the drama fairly strong. As each and every character acts according to its archetypal fashion, a plot point that is as archetypal can be convincingly raised as a source of dramatic tension: for instance, if all characters have their own motives, and if only one reward can be gained from slaying the big evil, what would this imply for intra-party integrity and inter-party rivalry? The friction resulting from the fact that, while slaying the big bad would be beneficial for everyone, only one brave adventurer can become the true is convincingly exploited. \\n\r\nGranted, the drama and tension aren't very evolved or deep, and the fact remains that almost any single happening can be predicted. The way it was portrayed, however, was, to me at least, thoroughly enjoyable, even if entirely forgettable. What makes me shirk from giving the story an extra point for the way it is handled, however, is the simple fact that Tower of Druaga - the Aegis of Uruk is an unfinished series, with a sequel in the making, and I fear that many of the more interesting points will in the end be strung out and hung out to wither. \\n\\n\r\nAs for the art, in general it is pretty good, with clear lines and a strong design treading the middle ground between expected fantasy trappings and some more inspired vistas. A definite plus is the use of the graphics of the original game at times, and a definite minus would be the use of CG for the main monster, but that's just my personal hatred towards CG animation speaking. As said, the voice acting, though relatively high profile, was as generic as possible, ranging from the heroic to the positively annoying. Music is utterly forgettable.\\n\r\nThe characters, as said, are as generic as they come. I didn't expect more, and I didn't get more. I have never understood why character development and connection with characters is such a dearly held item in reviews, as characters should portray their roles within a certain story (background in general is irrelevant) and should be convincing and consistent in their roles, whether or not the role is likable or not. In the case of Tower of Druaga, the roles aren't meant to be developed, or to offer some insights, or to portray either 'real' humans or ideals. They're consistent, clear-cut, and utterly generic, and this serves the series well. Just don't expect to be blown away by either their lines or their expressions.",
            "date": "2008-08-28T06:43:00+00:00",
            "helpful_count": 48,
            "mal_id": 7526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/40245.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/santetjan",
                "username": "santetjan"
            },
            "url": "https://myanimelist.net/reviews.php?id=7526"
        },
        {
            "content": "This is my first review, so hold up on the critics. :P\r\n60 years after King Gilgamesh defeated the evil god Druaga, the tower that Druaga once resided in returns. The story follows rookie climber Jil, who got kicked out of his brother Neeba's team after failing miserably. Refusing to give up, he decides to look for new teams mates to again climb the tower to defeat Druaga and claim the prize for doing so, an artefact said to be able to grant any wish, the Blue Crystal Rod.\r\nSTORY:\r\nMaking use of a legendary name of \"Tower of Druaga\", fans from that age and generation will bevery interested in watching it. They will be sorely disappointed. The references to the game are so lousily done, it made this almost a parody of it, which I highly doubt that was the intended motive. Even the overall plot hardly has a flow, just mearly the climbing of the tower, facing various obstacles along the way, which are hardly entertaining, might I add.\\n\\n\r\nART:\\n\r\nFor all of Gonzo's inability to make a decent plot, their animation quality never ceases to amaze me. It's very pleasing to the eye. Now if only the anime was any better. -_-\\n\\n\r\nSOUND:\\n\r\nGood opening song, voice actors pretty decent. Not much more I could say, really...\\n\\n\r\nCHARACTER:\\n\r\nWHAT character development? There are few different groups of people in the anime: Jil's party of 5, Neeba's of 4, the main people of the Uruk army and some bad guy. With only 12 episodes, what are the chances many of them will be developed? That's what first came to mind, but guess what. NONE of them are developed. Except the occasional minutes/seconds of background story, we still know next to nothing about most of the characters!\\n\\n\r\nENJOYMENT:\\n\r\nThose that know me know I'm hardly a shounen fan, yet, this is possibly among the worst shounen anime I have even watched. Fillers in Naruto are more enjoyable than this.\\n\\n\r\nOVERALL\\n\r\nFrankly, if i could turn back time, I would have NEVER gone anywhere near this anime. With a decent first episode, I would have thought it would be pretty good along the way, only for it to drop further into mediocrity, right down to plain lousy.",
            "date": "2008-06-20T19:13:00+00:00",
            "helpful_count": 48,
            "mal_id": 5656,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/28159.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/HalRyder",
                "username": "HalRyder"
            },
            "url": "https://myanimelist.net/reviews.php?id=5656"
        },
        {
            "content": "I am sorry to say that this anime has been quite confusing, and I couldn't predict anything. Not like I must have control to enjoy something, but without having some solid ground, you don't know where GONZO's gonna throw you next. The series started out brilliantly, but as it went on, it felt like GONZO split up its team into sections. \"OK, you make episode 4, and I'll make episode 5, and...\" yeah, you get it. You can feel the disconnection between episodes, and GONZO is having a hard time finding the fine balance between comedy and serious plot movement that makes sense. However, itwasn't horrible and not worth watching at all, and it seems GONZO's gonna try this again with a new season next year.\\n\\n\r\nSTORY: 6/10\\n\\n\r\nNot the most inventive thing you've ever heard of. A guy wants to be the hero, his old team rejects him, he finds a new team, and whoopee you can guess from there. Although the story has a nice twist at the end, it hardly makes up for the stereotypical plotline. What makes things even worse is that the plot is executed by underdeveloped characters that you have a hard time connecting with, and part of that is the tiny 12 episodes that GONZO attemted to cram their huge ideas into. If they had about 26 episodes for this anime instead of 12, I bet we would see some huge improvements.\\n\\n\r\nART: 8/10\\n\\n\r\nThe art was actually pretty good. I really enjoyed the occasional 3D moment, it really fleshed out the anime more. The character designs were unique as well (in terms of looks, not emotions) so not much else to say here.\\n\\n\r\nSOUND: 7/10\\n\\n\r\nNothing fabulous. OP and ED were ok, and no in-anime music struck me as amazing. it just... it fit what it was going with, like anime music and sound should.\\n\\n\r\nCHARACTER: 6/10\\n\\n\r\nHere's the one I wanted to talk about. I can see that these characters have a lot of great emotions and ideas packed into them, but 12 episodes is simply not enough for such a complicated web of people. I didn't know much about any character at the end, and I felt almost like they didn't earn what they got. Instead, it felt like GONZO was pushing the characters to the end so that it could meet this 12 episode limit. It just feels like something is missing, and that probably has to do with the confusion of where this series is actually going. The characters rarely start an episode where they ended previously, and... well, I blame it on the 12 episode limit again...\\n\\n\r\nENJOYMENT: 7/10 \\n\\n\r\nNot much to say here. Let me put it this way: I always watch 4 anime episodes a night, sometimes 5, and I always watch them in order of worst to last. Druaga was almost always one of the first ones. It's hard to enjoy it when you don't know where its going, or what the characters really think. I am very confused right now about Kaaya's stand on things, but hopefully we'll learn more next season.\\n\\n\r\nOVERALL: 7/10\\n\\n\r\nI've been beating on this anime a lot, because I feel that Druaga is lacking something. I couldn't connect with the characters very well, the plot was cliche, it just wasn't there. It's still an enjoyable anime, though, and I suggest viewing the first few episodes and seeing how you like it.",
            "date": "2008-06-26T11:46:00+00:00",
            "helpful_count": 24,
            "mal_id": 5822,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64068.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/theeggman85",
                "username": "theeggman85"
            },
            "url": "https://myanimelist.net/reviews.php?id=5822"
        },
        {
            "content": "I'll  make a short review for your convenience (if you haven't seen this anime yet).\r\nTower of Druaga ~The Aegis of Uruk~ is an adaptation of an old namco game with the same name. This anime is just like any other typical adventure anime engulfed with wacky antics that will leave an impression to you. \r\nThe story is somewhat generic. Basically it includes a group of climbers with the desire to obtain the Blue crystal rod (an item which is said to grant its bearers wish). It can be obtained after defeating Druaga who is located on top of the tower that is  namedafter the evil lord Druaga himself. Certain plot twists were also present which sets this anime apart from most adventure anime titles. The animation company &quot;Gonzo&quot; is the one who's responsible for this one. I personally disliked Gonzo before but I have to say that their work on this one is pretty good. From the first episode to the last, the animation got better. The background animation is decent and 3D animations were also present. The BGMs used in this one is unappealing. The only thing I liked about the music in this anime is the performance of the uprising band Muramasa with their opening song Swinging. The characters are also typical, it features some of the so-called classes which includes an Archer, a shielder, a healer and etc which can be found in most RPG's or MMORPG's of today. The characters are interesting, interesting to the fact that almost all of them have different intentions and reasons for climbing the tower however they share only one thought and that is to defeat Druaga.\\n\\n\r\nI enjoyed this anime, almost every episode will make you smile and these interesting characters will do the honors of doing so. Overall this anime is good for all ages, it's an adventure of 2008 that you should not miss.\\n\\n",
            "date": "2008-06-26T09:48:00+00:00",
            "helpful_count": 14,
            "mal_id": 5821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20621.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/cafekun",
                "username": "cafekun"
            },
            "url": "https://myanimelist.net/reviews.php?id=5821"
        },
        {
            "content": "What is THIS THING?\r\nNothing to do here!\r\nIm going to sleep!\r\nI cant understand what is this!\r\nIts enough internet for today!\r\nThis is a very funny anime!\r\nI cant stop laughing and crying!\r\n...",
            "date": "2015-04-25T12:59:00+00:00",
            "helpful_count": 11,
            "mal_id": 186442,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4559840.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NaoriU",
                "username": "NaoriU"
            },
            "url": "https://myanimelist.net/reviews.php?id=186442"
        },
        {
            "content": "Entertainment is not a difficult subject to write about since no matter what incarnation of it, either it be a music, a book, a movie or an anime, the main propose is to entertain. In that regard it can only either achieve it or fail, but in between those two there is what we call mainstream (don’t mix it up with ordinary or average), and there have been very few installments that represent the niche as well as Druaga.\r\nTwo things will remain constant in this review, first alphanumerical scorings will mean very little since we can only strictly classify an anime by its intrinsic values,when we are either flaming an abysmal show, or praising another gorgeous one. And second, people that tend to strive by exaggerating problems instead of praising achievements and balancing mistakes will most likely disagree with me. But anyway, these people tend to make their minds on a subject before hitting the issue so their thoughts are biased from start, and no matter how long of a rant or praise I write I will never make them happy, and I wouldn’t be paying justice to Druaga with neither approaches.\\n\\n\\n\r\n----------------------------------\\n\r\nStory\\n\r\n----------------------------------\\n\\n\\n\r\nThe strength of the story here doesn’t come from intricate plot or interesting twists, instead it have its strongest suit on the development, which is only a pretty way to say it is predictive and not as well explained as one would hope, but still manages to stand on its own legs and doesn’t let down. Some parts of the lore and the most part of the back stories of the characters are simply not explained at all, but since we are dealing with some pretty standard territory (fantasy, dragons, ghosts, magic, so far not vampires…) even if some plot holes are present, the omission of explanations actually helps what could very well turn out to be a dragged mess of unneeded monologues.\\n\\n\r\nThe first episode is simply wonderful and kicks in with a really good pace that puts you into the mood to take whatever it might hold ahead, and actually manages to keep this feeling going for the majority of the time, only dropping the ball slightly by the end running away from its uniqueness’s to the more safe surroundings of your everyday shounen, complete with insane amounts of mainly screens and girly tears. It is aggravating but bearable since even in its worse moments it stays solid, and on the other rare occasions where it is simply bad, you always manage to find other redeeming factors on the scene, either it be the unusual and fresh homage to the source material spread throughout the series, or the humor that frequently comes off on the precise moments.\\n\\n\r\nThat aside, one of the small touches I like the most is the fact that they strayed away from the usual “average high school boy” as a main protagonist, while still referring to that demographic trough the intro. It was a really smart move to make the plot feel a little bit fresher, while still ticking the pre-requirements to get founding for the show. If only they would stick to this kind of creativity throughout the whole thing, the story would’ve been much better, but I don’t like criticizing something based on my failed expectations so it’s a moot point.\\n\\n\\n\r\n----------------------------------\\n\r\nArt / Animation & Sound\\n\r\n----------------------------------\\n\\n\\n\r\nThe static art is good, characters are vivid and well designed and the colors albeit a bit too bright for a dungeon environment are good, but as soon as motion occurs it is uneven at best. This doesn’t deserve to be dragged much longer, but I have to point out you will spot a few sequences of animation with  less frames then would be required to look good, luckily  those were not frequent enough to leave a bad impression of the otherwise competent art and animation direction. Just as the 2D counterpart, the CGI is well executed but animated unevenly. It was also not bad enough to become intrusive, but at this day and age we have come to expect more value per screen time then what is delivered here.\\n\\n\r\nSoundtrack is really subpar. It’s not technically at a fault and more often than not it fits the scene, but battles lack punch, drama lacks emotion and overall it lacks quality to make an impact worth noticing at any given moment. The intro selection is fitting for the unique choice but nothing else, and sound effects are not as bad as the rest, holding their own ground fairly well. Voice actors do a decent job, and at least during a few lines when both the plot and the soundtrack help they do a great one, but this is not common enough to worth praising on any specific role.\\n\\n\r\nWithout taking into consideration the lack of vibe the sound department provides, the visuals are pleasing while never achieving moments of complete gloriousness (possible exception for the outtakes of the tower itself) and in fact the irregular nature of the art here, hurts more than simply the lack of quality which gladly is far less common.\\n\\n\\n\r\n----------------------------------\\n\r\nCharacters\\n\r\n----------------------------------\\n\\n\\n\r\nLasting impressions after the credits roll are usually a safe indication of how good characters are, but here this might not be failproof. This is because the development of the main characters is incomprehensible from time to time, and you might just as well get attached to someone just to find out later he became something else. This is a bit more subtle on the female cast but ridiculously evident with the main character, he goes from good-for-nothing to dependable to demigod and then back to screaming teenager without any trouble or rational explanation, and in the meanwhile people around him act as if he had a giant poster written “main character” floating above his head and this was only natural. Romance development and drama climax also suffer from this, and they never truly deliver due to lack of proper trailing.\\n\\n\r\nSide roles are not particularly flashed out here, and it is for good measure since the few attempts to bring them out shows how silly and underdeveloped they are, but with a main cast of roughly 10 characters we still get plenty meat on the bone with episodes focusing on specific characters and such. The main gripe thought is that there is no clear enemy, and instead they just go around facing random “evil” that pops up, most of them nameless, until they reach yet another boss that is not developed as a character at all. Instead of having opposing motivation, the enemies are just there to be slashed, and this gets old eventually even if it is yet another trait of the original material they derive from.\\n\\n\r\nJust as with the story, where at the same time it’s neither the main focus nor the outcast, the characters face a well rounded tour, going from spotlight to backstage in a blink of an eye. You never get too much or too little of them, and by the end the mileage gained is quite good. Though it could be a bit better if they would settle for either comic or dramatic mood with some plot developments, because with so many stories I felt it lacked time to fulfill both goals to the fullest. Rest assured, there isn’t many unlikeable characters to begin with and the side cast is pretty weak, but the main ones all have some redeeming traits and unless you try really hard to hate them, you will be able to get attached to them soon enough.\\n\\n\\n\r\n----------------------------------\\n\r\nEnjoyment & Value\\n\r\n----------------------------------\\n\\n\\n\r\nSo, what makes a mainstream anime? Average sound, average music, average animation, average art… these are scrutinizing about subjects one anime belonging to this category don’t need, instead what characterize a mainstream anime is how well it manages to differentiate itself from the horde of similar ones, and how effectively the fun factor can avoid the hindering all the technical shortcomings might incidentally bring to the table, and taking all of this into consideration Druaga is a proud member of this group.\\n\\n\r\nWith its dose of uniqueness both on visuals and direction it manages to remain with a fresh feeling during the entire show, and with somewhat likable characters and good pace, it also achieves a decent level of lasting impression. The technical aspects might not be as sharp as one could expect since the bar these days is set so extraordinarily high, but it also goes miles away from being simply ordinary or mediocre.\\n\\n\r\nOverall it is an easy recommendation for anyone that likes the genre, perhaps not a “no brainer” for anyone else, but it definitely delivers into all aspects one would expect while at the same time bringing a healthy dosage of extravagances.",
            "date": "2009-09-24T07:58:00+00:00",
            "helpful_count": 8,
            "mal_id": 19066,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/199926.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/711",
                "username": "711"
            },
            "url": "https://myanimelist.net/reviews.php?id=19066"
        },
        {
            "content": "Av: Interesting looking box art there\r\nNK: Ah, right.  New anime I got a couple weeks back.  It’s called “Tower of Druaga - The Aegis of Uruk.”\r\nAv: That’s a mouthful.  Wait, “Tower of Druaga?”  I’ve heard that somewhere before…\r\nNK: Tower of Druaga is an old video game by Namco.  I played it a bit when I was a kid.  That’s the reason I took a look at the anime.\r\nAv: How’s the anime?\r\nNK: Pretty good.  Sure, it doesn’t follow the plot of the game, putting the events of the game at 80 years in the past, but it still hasreferences to a lot of the game.  King Gilgamesh, all the monsters.  Heck, the main group actually goes to the old tower during one episode.\\n\\n\r\nAv: Sounds…interesting.  What did they do there?\\n\r\nNK: It’s actually an important plot point as to why they were there, so I won’t divulge all the details.  Basically, Jil charges into the tower to find something, when it turns out he has to be controlled by someone outside.  Hilarity, and the most direct reference to Tower of Druaga, ensues.\\n\\n\r\nAv: I take it that’s your favorite episode?\\n\r\nNK: No.  Episode 5 is.  The party comes across a fork in the road, one side saying “shortcut.”  They decide to take the shortcut, which turns out to be covered in traps.\\n\\n\r\nAv: That doesn’t sound good…\\n\r\nNK: The traps are hilarious, though.  They change the entire party magically whenever someone steps on one.  For example, at the beginning of the episode, everything turns 8-bit.  It’s great.\\n\\n\r\nAv: Right.  What about the characters?\\n\r\nNK: I like most of the characters in the series.  The main party is easy to get attached to, though some are your stereotypical heroes.  Jil, for example, is your typical, likeable goof, though he does get pretty serious when he needs to.  Kaaya is, well, there’s a lot of important details to her.  She’s an oracle, a user of defensive magic…she comes across as cute an naive at first, but...well...that’s all I’ll say about her.  Ahmey is a very serious character among all of the chaos in the party, so she stays pretty quiet until there’s trouble.  Melt is from a noble family, so he’s really picky and complains about a lot of stuff.  Plus, he uses his magic with rods that he swings like golf clubs.  His assistant, Coopa, is the craziest of the group, being about 12 years old, though she acts much more mature than Melt.  It‘s funny watching them argue.  I really can’t go into too much detail about the party, though I will say it’s one of my favorite casts of characters.\\n\\n\r\nAv: Figures as much.  Take it Coopa’s your favorite?  You do tend to like the younger characters.\\n\r\nNK: Actually, no.  Melt is my favorite character in the series.  The introduction to him casts him in a bad light, seeing as how he’s completely drunk, but he’s actually a likeable character once you reach the end of the series.\\n\\n\r\nAv: You watch it in Japanese, as usual?\\n\r\nNK: I actually watched it in English, though I did watch the first few episodes in Japanese.  Part of the reason I bought the series was the voice actors in it.  Jil is played by Todd Haberkorn, who also played Hikaru in Ouran and Watanuki in xxxHolic. He does a good job playing the goofy hero.  Melt is voiced by Chuck Huber, the same guy who voiced Hiei *snicker*.  It’s a pretty interesting voice cast.  Oh, just warning you now, Coopa’s played by Monica Rial.\\n\\n\r\nAv: Oh, joy…\\n\r\nNK: It really isn’t that bad.  Though she does sound a lot like Renge.\\n\\n\r\nAv: That’s what I was afraid of.  So, I take it I should watch this?\\n\r\nNK: Definitely.  Even if you haven’t played Tower of Druaga before, I’m pretty sure you’ll enjoy it.  Oh, before I forget, this is the first season.  There’s a second season I’ve yet to watch subtitled “The Sword of Uruk.”  The ending is pretty weird because of that, just warning you.\\n\\n\r\nAv: You’ll be getting that one too, huh?\\n\r\nNK: Yep.  Though it comes out in February…It’s going to be a long wait.",
            "date": "2009-12-17T07:09:00+00:00",
            "helpful_count": 8,
            "mal_id": 21447,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/227213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NinjaKirby1322",
                "username": "NinjaKirby1322"
            },
            "url": "https://myanimelist.net/reviews.php?id=21447"
        },
        {
            "content": "This spring season completely changed my opinions toward Gonzo. Blassreiter is already a very solid series and I have always been a CG-hater. Druaga, on the other hand, came as a wonderful surprise. \r\nDruaga is not a masterpiece by any means, otherwise I wouldn't give it an 8 only. But it does have the potential to become a masterpiece. I was rather disappointed after the first episode because it was not funny at all (the Urua episode was much better IMO). In the next 11 episodes, I did see some interesting ideas and the writer did not drop them either. Unfortunately he didn't go onand explore them. Of course, one may argue that Druaga is a comedy anime in nature, and I'm perfectly fine with it. All I'm saying is that Druaga could be much better if the writers were more serious about these ideas.\\n\\n\r\nBut I'm not trying to bash the show here. What makes Druaga so wonderful is its good characterization and a full-of-imagination worldsetting. The worldsetting incorporates all the wonderful elements of RPG such as cute low level monsters, various skills, different classes of characters, team play, boss run etc. It also leaves all the boring parts out, such as walking from point A to B, like what they did in that more-boring-than-Bohr's-atomic-model Guardian of the Spirits. The little cute monsters and all that are what makes RPG interesting in the old days. \\n\\n\r\nThe chacterization is above the average too, even though it suffers a little bit from the plot. It has everything I could ask for. The characters are realistic, they have depth, and they have some lovable elements. Rarely seen in the anime industry, the writer clearly demosntrated that he received some professional training in writing. Druaga introduced a huge set of characters. Fortunately the writer didn't divide the screen time evenly to each character (see Rahxephon). What he did, like any other trained writer is supposed to do, is to focus most of the show on the main characters: namely Kaaya, Niba, and Jil. None of them are annoying, and all of them have some mysteries surrounding their past. The mysteries kept them interesting to watch throughout the season. My favourite character is Jil, not because he is the protagonist but because he is the only one who showed some character change in this season. From a rather naive hero wannabe to a person who desires to become a shield for his friends, the change was done smoothly and genuiely with considerable amount of introspection, another important piece in good characterization. The last episode says it all:&quot;They are not heroes but people who fight for their dreams.&quot; A normal person growing up is always the best. The puppy love between Kaaya is cute too and it's very likely that the focus of the show is going to be shifted toward this relationship in the next season. As for the side characters, as long as they are not annoying, that's enough for me, and that's exactly what the writer has done.\\n\\n\r\nSeason 1 has been a great journey and ended at a cliffhanger. Without a question, season 2 is going to be my most anticipated series next year.\\n\\n\r\nPS I hope someone could organize a petition. The rating system should really include more important things such as world setting, theme, theme delivery etc. Who cares about animation...?",
            "date": "2008-06-24T18:52:00+00:00",
            "helpful_count": 8,
            "mal_id": 5771,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/33389.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/az_0k",
                "username": "az_0k"
            },
            "url": "https://myanimelist.net/reviews.php?id=5771"
        },
        {
            "content": "Tower Of Druaga (Druaga No Tou) is one of several anime adapted from games. \r\nStory & Characters: The story in Aegis of Uruk is definitely the shows weakest aspect. The plot tells a rather generic mmo rpg story (there's some evil entety in a tower that people climb to defeat monsters and gain treasure and so on...), with the main character being Jil, a boy who aims to reach the top of the Tower of Druaga adn defeat the evil god who the tower is named after. He teams up with other \"climbers, all with different goals, and heads to the top, racing against otherteams of climbers, facing many dangers and meeting many people. Throughout the story we're shown hints that there is some hidden plot working behind the scenes as well. Still there's a bucket full of plot holes and annoyances through the series that can be quite glaring at some points. The characters are a cast filled with some of the usual tropes and e few rarer, with different short backstories. The characters are enjoyable enough, but doesn't go far beyond that.\\n\r\nArt & Sound: The art is not the best, but it isn't bad either, and manages to make things look interesting enough, without going above and beyond. The sound are ok.\\n\r\nOverall: I enjoyed the show, but it's not among my favorites. It has a lot of problems, but still remains better than many newer shows, having a personality of it's own.\\n\r\nEnjoy!",
            "date": "2018-12-19T00:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 296131,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7250351.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ThorNN-heim7",
                "username": "ThorNN-heim7"
            },
            "url": "https://myanimelist.net/reviews.php?id=296131"
        },
        {
            "content": "Tower of Druaga...I cannot adequately explain why you were so enjoyable for a series which balanced comedy and drama so badly...this review may be very short. The story is about a rag tag group of people aiming to climb the Tower of Druaga and claim the glory that comes with reaching and defeating the demon, Druaga, at the top. Jil is our main character, a young kid who is deceptively strong and he is joined by other party members representing stereotypes from RPG games. By all accounts this series isn't perfect, it's a balancing act between serious story and comedy and it tries to hitboth, it can however be very serious at moments and very funny at moments. Whats great about this series is the unique quirks and twists it provides the viewer, from pop culture references reflecting RPG's and other similar adventure series', to representing different fandoms as well as recycling a very cliche story into something legitimately enjoyable.\\n\\n\r\nThe story follows along Jil's adventure with his crew of 'climbers' as they progress through the levels of the tower and encounter beasts, personal battles and betrayals and along the way they keep a sort of episode by episode shift between comedy and serious story and character development. As you watch this series you never can tell what will happen in the next episode, your guess is usually as good as the characters but this is also a feather in Druaga's cap as it delivers on both front, though isn't quite good at mixing the two together.\\n\\n\r\nThe characters were some of my favorites I've ever watched and one in particular left a bit of an impact on me and now resides in my list of favorite characters of all time. The shows episodes are told almost episodically and its only in a couple of episodes where moments from previous episodes are even brought up. That being said this series warms up to a fantastic end and second season which I almost instantaneously began watching.\\n\\n\r\nThe art is enjoyable though not particularly awe inspiring and a bit of CG is used which isnt particularly exciting. The opening and closing songs are fantastic and are complimented by great alternative world style video clips (featuring the main characters as if they were ordinary people) though the background music in the show wast very pronounced.\\n\\n\r\nIn all honesty I may have marked Druaga up a bit in the wake of watching this show but as I think more about it I want to stick by it. Think rationally this series earns an 8, but personally this show is one I will probably come back and watch with delight.\\n\\n\r\nFirst review complete!\\n",
            "date": "2013-02-22T03:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 87547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1921336.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Animelting",
                "username": "Animelting"
            },
            "url": "https://myanimelist.net/reviews.php?id=87547"
        },
        {
            "content": "Well it started out really great! It parodied the whole shounen genre and it was really funny, end of the episode it went 180. It didn't go bad, not really, I still had high hopes though. I thought that since it was aware of the tropes of a shounen then maybe it could break away from them. Too much hope it seems. Well watch the first episode. Everything else is just meh. \r\nIf you have watched shounen before, then you've watched this show. Something like Rage of Bahamut is a better fantasy (as bad  as the game that show is based on, the animewas superb). The characters here enter stereotypes the moment the 2nd episode hits and even if there are a few curve balls here and there that might keep you engaged, you can just watch something else. \\n\\n\r\nWatch HxH or Rage of Bahamut, Log Horizon and World Trigger (WT is a bit slow but with 50+ characters, that's quite understandable). But this is for someone to watch if you absolutely have nothing else in your life.",
            "date": "2017-11-27T23:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 264098,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/nokinoks",
                "username": "nokinoks"
            },
            "url": "https://myanimelist.net/reviews.php?id=264098"
        },
        {
            "content": "GONZO sure started off very nicely with this release. The first episode was hilarious and had so little; yet so much to do with what has later to come.\r\nTruly; it made me want to look at episode 2 with more heart and NEED of this Anime.\r\nHowever, the more the episodes went on, the more disappointing it'll become.\r\nI don't know what GONZO was trying to do; but a lot of stuff later in the series starts to get quite confusing and doesn't really add up to anything.\r\nI see this happen in a lot of Anime; they try to complicate their stories more by confusing the viewer.But the only thing they are doing is putting unnecessary effort into unnecessary scenes. If only they'd put in more thought to the story and followed up from where they started, it would've been better.\\n\\n\r\nHowever, it is what it is, so lets keep it that way. The Anime as it is, isn't flawless, by far. But it is enjoyable, however.\\n\\n\r\nThe characters are just like the story; not that big a deal. Quite typical for Anime, and sort of predictable. The story was unpredictable; due to it being confusing. But the characters, not as much. \\n\\n\r\nThe best part of this Anime is it's continual feel. At one point it is mystical and fantasy-based. At the other point it tends more towards action or drama. Some scenes really look like RPG's, while other scenes tend more towards a different type of action.\\n\\n\r\nAll in all, the Tower of Druaga - The Aegis of Uruk, has a lot to offer. Maybe a bit too much; seeing how it's better to stick to one vibe in stead of many.\\n\\n\r\nHowever, let's skip complaining and enjoy the show. Since it still was quite enjoyable and has nearly flawless animation. The sounds were pretty good and there is a certain amount of development in between. So yes, it is definitely enjoyable if you look beside the flaws that is the story.\\n\\n\r\nThere will be a second season of this Anime; let's just hope GONZO makes up for it; so it'll become just like this one, but then without flaws.\\n",
            "date": "2008-12-22T04:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 10562,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/30528.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Elydan",
                "username": "Elydan"
            },
            "url": "https://myanimelist.net/reviews.php?id=10562"
        },
        {
            "content": "Welcome to my candid review. This is an adventure anime with elements of fantasy and tinged roughly equally with moments of light humor and dark violence. The first episode focuses only on humor and is NOT like the remainder of the anime, which is actually much more serious.\r\nThere isn't much complexity to this anime. It's fairly straightforward, blunt in its character design and writing, with standard-fare switch ups between serious and lighthearted episodes, young characters, as well as delivering a measured rather than ambitious plot, overall making it a simple anime that would fit kids well. The catch to this anime is that for allits simple design, it has enough violence to coat it in mature tones as well. \\n\\n\r\nThe anime is at a crossroad between many different styles. Due to its lack of specific style  it will probably deliver moments that you absolutely have no interest in, but other moments that will tug you along just enough to keep watching.\\n\\n\r\nIt's a nice anime, nothing amazing. If you find yourself not liking it, don't force yourself to continue watching. Just note that the anime doesn't really settle in until after episode 3.",
            "date": "2016-04-29T13:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 217441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Ilike69",
                "username": "Ilike69"
            },
            "url": "https://myanimelist.net/reviews.php?id=217441"
        },
        {
            "content": "I found the first season of Druaga to be a solid entry across the board. I was never overwhelmingly surprised nor bored with the series, and enjoyed a marginally original take on a fantasy anime.\r\nStory follows young protagonist on an exceedingly standard quest for heroic glory. Along the way we meet a few few extra party members next to a few standard entries; none too tired to be irksome or annoying if you're willing to roll with some standard fantasy fanfare. The series does actually make a point of being slightly lethal which does prevent it from falling into the vacuum of awful cliche. \r\nAgood series to watch over the course of a week that keeps things interesting enough to keep you wanting to see the end result. \\n\\n\r\nParticular note goes out to the opening for juxtaposing all the characters into a modern setting, which might have served as a great filler episode.",
            "date": "2015-03-15T01:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 182371,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3400497.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/wkoppin10",
                "username": "wkoppin10"
            },
            "url": "https://myanimelist.net/reviews.php?id=182371"
        },
        {
            "content": "Tower of Druaga - Going into this show i wasn't sure what was going on based on the first episode but at the start of the second episode things quickly started to improve. You follow Jil as he tries to climb the Tower of Druaga to make a name for himself as a hero. Hes not your typical annoying male lead character and while he wants to save everyone as many leads do he comes across as believable and genuine. In fact all the characters are not your average band of cookie cutter party members and all have their own reasons for climbing the towerand their own distinct personalities.\\n\\n\r\nThe animation is of a good level throughout and while they may use some CG here and there such as the large army of Uruk it actually meshes pretty well and isn't your typical rubbish Gonzo CG. The show as a nice mix of comedy,storytelling and action so theres something for everybody. Most of the earlier episodes have a more lighthearted feel to them but at the same time foreshadowing something that isn't quite right with the legend of the tower. You will be surprised as the show reaches its last few episodes and not everything and everyone is as clear cut as they appear to be.\\n\\n\r\nThe silliness in the earlier episodes may put you off in your looking for a dead serious fantasy story but you can rest assured that this show does actually go somewhere and more of the shows time is spend fleshing out both the character relationships and their motivation. We really don't learn too much about the characters past apart from Jil and Nebaa but they try to fit in some time here and there for a few of the supporting cast. Being only a 12 episode series i guess this cannot be avoided but they do a good enough job of it for me to care about all the party members.\\n\\n\r\nAnyone looking for a good fantasy RPG style show should definitely check this out. I was very surprised at how good the show turned out after the confusing first episode. Also you can join me into looking forward to a second season coming out sometime in 09.",
            "date": "2008-07-03T07:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 5984,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/30898.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Phantom",
                "username": "Phantom"
            },
            "url": "https://myanimelist.net/reviews.php?id=5984"
        },
        {
            "content": "TToD takes the generically vacuous premise of an 80's arcade game and attempts to make a good story with it. They partially succeeded. The narrative (discounting the dangerously misleading but brilliantly satirical first episode) starts out very light and often humorously, making for easy, pleasant watching in bulk when you're hungover or otherwise unable to cope with fast dialogue, complicated plots and frenetic action. For the amount of characters included they did a fair job of establishing them in this chunk and making all of them passable in their own ways. It's in the second half that things start to get more serious, with agood amount of mysteries to be uncovered and some interesting turns that venture beyond the conventions of most aventure-fantasy stories.\\n\\n\r\nThere are very basic things which drag this show down, however. While episodes 2-6 do manage to have a fun, adventurey feel and establish the characters, they're not complimented by much memorable humour, which I feel is something they could have done with. The second half sees more in the way of depth and seriousness, but it doesn't accompany this with any good action, with the rare battle sequences feeling unfortunately boring, and the drama involved wasn't all that poignant. The latter defect probably wasn't helped at all by what another reviewer rightfully pointed out as the very emotionless face-animation which detracts from both the humour of the lighter scenes and the intensity of the more dramatic ones. The soundtrack is pretty decent but it didn't really manage to 'make' any scenes like it can in other shows, partially as there weren't enough tracks to begin with. The universe of TToD itself is supposed to be fairly generic, so you can't expect any saving graces from there like you would be able to with, say, Log Horizon.\\n\\n\r\nAll of this being said, I definitely like the way the storyline culminated in the last few episodes, setting us up for a conclusion of the adventure in Sword of URUK which I was quite eager to experience. TToD is no top tier must-watch anime, yet despite its defects it was an enjoyable watch and deserves its share of credit.\\n\\n\r\n5/10",
            "date": "2015-03-26T04:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 183439,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3829377.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Renegatz",
                "username": "Renegatz"
            },
            "url": "https://myanimelist.net/reviews.php?id=183439"
        },
        {
            "content": "At first, i steered clear from any GONZO-affiliated show, but i decided to give Druaga a try. Well, i was, surprised in some ways, disappointed in others. (Which describes most GONZO shows anyways.)\r\nStory - 6.5/10 (D)\r\nWell, it's about a young hero who wants to rid the world of the evil Druaga, at the top of the Tower of Druaga. Sounds cliche? It somewhat is, but the first episode might be a miss for most, because it's mostly a \"I had a really sweet dream\" episode. Though i did like the funny parts, definetly episode 5, with the whole RPG-look, sex changes and the Roper Dancereally made me laugh, in a good way. You can enjoy Druaga, though it does randomly change from plot-focused, to comedy relief each episode.\\n\\n\r\nAnimation - 9.0/10 (A-)\\n\r\nWell, at least Gonzo is rich, enough to make Tower of Druaga a great animation piece. I really enjoyed how they took every scene into great detail. Though the show was somewhat not plot-focused, it had top-quality animation for each episode.\\n\\n\r\nSound - 7.8/10 (C+)\\n\r\nWell, typical RPG-like background music wasn't at all worth remembering, though the &quot;Funny&quot; episodes tend to have more upbeat, cheery music. The opening &quot;Swirling&quot; really stunned me. For an RPG-based show like Druaga, &quot;Swirling&quot; felt more for a show like &quot;Katekyo HItman Reborn&quot; or &quot;Gintama&quot; maybe, but it was a hit for me. The Ending, &quot;Touchousha-tachi&quot; by KENN (Who's also Jil's voice actor, fyi.) is a good mix of feelings jam-packed into 1:30, pretty good stuff.\\n\\n\r\nCharacters - 8.4/10 (B)\\n\r\nA great ensemble for Druaga. We have the wannabe hero Jil, then we have his older brother Neeba, who in a way cares about him though (to me) he's just a plain mean older brother. We have Fatina: a ditzy, Paris Hilton clone who wants to get to the Tower to claim her &quot;reward&quot;, we have Kally: a stealthy individual with a keen sense of direction. Next is Jil's team: Kaaya, a charming young woman with a strange, unknown power who is drawn to Jil's bravery. Ahmey, the &quot;Clare&quot; of this show (Clare=Claymore) who fights to somehow talk to her dead love, through the means of the Blue Rod. We have Melt and Coopa (No, not the Mario-kind of Koopa): A Mage with a presigious background and a willing servant to him. They provide the most comedy-relief in the show. Overall, this is a good kind of cast for an RPG-based anime.\\n\\n\r\nEnjoyment - 8.2/10 (B-)\\n\r\nI fairly enjoyed Druaga, with some complaints about story pacing and easy boss battles (the One-Winged Dragon for example) being too easy. If you have some spare time, Druaga shouldn't disappoint (For only 12 episodes). You'll laugh, scratch your head and cry during the short span of 12 episodes.\\n\\n\r\nOverall Averaged: 7.9/10 (C+)",
            "date": "2009-01-12T22:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 11413,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56526.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/webkid94",
                "username": "webkid94"
            },
            "url": "https://myanimelist.net/reviews.php?id=11413"
        },
        {
            "content": "Tower of Druaga is a wolf in sheep's clothing. There are a lot of fast twists and curves which can and probably leave a more critical viewer saying wtf. If you can get over the small amount of build up there than you'll be able to like Tower of Druaga.\r\nStory: Tower, fight up the tower= Dungeon Crawler? No don't worry about that. With only 12 episodes the show moves pretty fast and is excuted well. Though it doesn't score much points on originality I give it an eight because the development was good, nothing felt forced.\r\nArt: The monster designs were pretty good and I alsoliked the way that the Climbers had light armor compared to the Uruk Army who wore heavy plate. It gives a sense of their weight and job. (Fighting style)\\n\\n\r\nSound: Nothing really that was great or horrible. Opening was okay, nothing special. Warning: Had a hard time finding videos that were of decent quality for some episodes.\\n\\n\r\nCharacter: Teenager who wants to become a hero: check\\n\r\nPossible girlfriend: check\\n\r\nMore experienced person: check\\n\r\nComic relief: double check\\n\r\nRival team: Double check\\n\r\nOther miscellaneous characters: Multiple checks\\n\r\nEvil Overlord type boss: Check\\n\r\nApparitions that only one person can see: Double check\\n\r\nSmal animal that doubles as food and a pet: Check(Where did it go anyways?)\\n\\n\r\nSame old-same old. This won't hurt the anime in any way but I always hope for some sort of breakthrough.\\n\\n\r\nEnjoyment: I like anime and Tower of Druaga is no different. I might be crtisizing anime in my review but in enjoyment there are never any problems unless it burns my eyes out in a bad way.\\n\\n\r\nOverall: By the end of this anime you'll be on one of two sides. One you can say, &quot;What the hell just happened?!&quot;, and give it a bad score because things were a little too incomprehensible for your tastes. Or option two is that you find things still unbelievable but you notice there'll be a season two and hope that the next season sheds some light on what's going on. I'm option 2.\\n\\n\r\nLast Notes/Rant: Don't mind the first episode too much. It is kind of annoying but you should see it because it sets up the &quot;hero's&quot; character. After that it'll steadily get better, the last episodes were great to say the least. You can find Tower of Druaga at megavideo, but there are some that have much better quality than others. Look for alone****  *=numbers. One of his is in spanish (like episode 5), but the rest of are in english and of decent quality, especially the later episodes. Darn the 72 minute block thing, I really hate it. \\n",
            "date": "2008-11-26T16:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 9867,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/16253.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mouser888",
                "username": "Mouser888"
            },
            "url": "https://myanimelist.net/reviews.php?id=9867"
        }
    ],
    [
        {
            "content": "Its really hard to tell where GONZO is going with Druaga. The first episode of Druaga is the funniest (and probably the best) first episode of any anime I have seen. It starts off with an RPG-style party (a sword user, an archer, etc) with the aim of climbing the Tower of Druaga to defeat the evil Lord Druaga There was me thinking 'Oh no, the lame shounen of this season', however that all changed quickly. The rest of the episode is about the protagonist's (Jil) journey to climb to the top, and the comic manor it all happened. The not-so-slapstick comedy in this animehas been somewhat refreshing and different to anything I've seen before, which is the reason for the 10 for enjoyment.\\n\\n\r\n However, this actually turned out to be a dream, and from episode 2, it became more serious. The rest of the series continues the party's journey to the top, with less jokes along the way, but ones that will make you uncontrollably laugh nevertheless. Sometimes there are really hilarious episodes, and sometimes more sober-sided ones, which is why I can't really tell where this series is going and why I have given a 7 for story (sometimes the serious episodes aren't that interesting).\\n\\n\r\nThe art is average for this day and age, and likewise with the music (though the opening is very misleading as it shows the characters in modern school uniform, when this is set in medieval-ish times - though this raises the theory that these people could be playing an RPG all this time, like .hack, as it is very game-like with the parties, monsters, maps/levels and the different classes). I do however, like the characters in Druaga; there are no lame characters (the shy one, the overly-clever one) and its epically good there's no 'the-useless-one' of the party; they all seem to have a purpose.\\n\\n\r\nAll in all, a very amusing, but peculiar, anime which is showing good potential. I just hope it doesn't end with the 'power of love' saving the world.",
            "date": "2008-06-02T03:56:00+00:00",
            "helpful_count": 129,
            "mal_id": 5156,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1078.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Puvi2Groovy",
                "username": "Puvi2Groovy"
            },
            "url": "https://myanimelist.net/reviews.php?id=5156"
        },
        {
            "content": "It would appear GONZO seem to think they can use their unique release format to gloss over the fact this series is riddled with flaws.  There are three experiences to be had from Druaga, a hilarious comedy one, a somewhat below average action one and a dire fantasy one.  It is literally a lottery as to which genre will be dominant in each episode.\r\nThe storyline couldn't possibly be any more generic; explore dungeon, defeat evil boss, find legendary treasure etc., its not even well executed.  When its not being generic, it's being downright predictable, major plot points are seen coming a mileoff.  The pacing is atrocious, the characters will spend multiple episodes in floors relatively close to each other then magically be much further in the dungeon just so the series can finish within the episode count.  Much of which is taken up by almost filler like pointless episodes that do nothing to progress what little plot there is (episode 6 in particular).  GONZO have tried to justify this shambles by confirming a second series to continue the storyline, but such a weak reason doesn't excuse this mess.  A real shame after a genuinely fantastic opening episode, that made it look like the series wiould break a lot of these clich&eacute;s, sadly it fails.  If the storyline can't even meet its own expectations, what chance does the viewer have?\\n\\n\r\nAnimation is top notch, nice to see GONZO are still capable of doing something right.  Very impressive scenery and backgrounds throughout the series, with some solid, likeable character designs.  The enemies are also (for the most part) very well designed.  \\n\\n\r\nThe audio is another highlight, very nice opening and ending themes that fit the series well enough.  The background music is good enough and usually appropriate to whatever is going on.  Voice acting is another strong point, with an impressive display from the seiyuu's.\\n\\n\r\nCharacter wise, Druaga once again fails to live up to its own expectations,  the cast is initially nothing short of excellent; likeable characters with interesting personalities, unfortunately there is next to no character development in he entire series, kind of to be expected when there are more characters than episodes though.  Once again the excuse &quot;it'll be fixed in the next series&quot; isn't valid in an analysis of this series.  As a result of little character development, it is hard for the viewer to get attached to the characters and the dramatic scenes lose much of their impact.\\n\\n\r\nDruaga remains an enjoyable enough experience despite these flaws, thanks mostly to comedy episodes, but it can be a genuine atruggle to get through some of other episodes. The comedy episodes if reviewed individually would get nines and tens, whilst the rest of the series would get between four and seven.  It keeps the viewers attention with the promise of better future episodes, which is sort of admirable.  It'd be a lot better if it were a 26 episode series, that'd allow fleshing of the plot and characters as well as removing the rushed feel to the series. Worth a watch regardless.",
            "date": "2008-06-22T02:40:00+00:00",
            "helpful_count": 54,
            "mal_id": 5690,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65203.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zeinzu-sama",
                "username": "Zeinzu-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=5690"
        },
        {
            "content": "Tower of Druaga is perhaps the finest example in years of a non-comedic series taking on all the trappings of fantasy cliché and making proper use of them, and, as such, turned out to be pleasantly surprising.\r\nThe series is based on an old and at the time successful arcade game in which you play a valiant knight entering a leveled tower to slay the evil overlord and rescue the princess. What made the game popular were the various almost random actions you had to perform in order to be able to ascend to the next level. The original game had a number of sequels, ofcourse all involving some even greater evil and an expanded tower.\\n\r\nThe background explains why the series plays out in an enormous tower of multiple levels, each with their own hazards and enemies. As a fantasy series, this is as clichéd as it gets; as a series bearing the Druaga name, this is proper. \\n\r\nUsing this all too familiar fantasy theme has its uses. There really is no need to have to introduce much of the world, background story, and characters: everyone watching the series immediately knows he's in fantasy video game-territory, where everything and everyone has a standard role to play. Within the first few episodes all major characters are introduced, with the main roles being those of the somewhat naive young man who wants to fight for justice and peace, the girl with clerical powers and a dark secret, and of course the more experienced powerful adventurer with his own share of secrets. The cast is filled out with the usual bunch of rugged fighters, silent rogues, and whining but powerful mages, all planning to ascend to the top of the tower, slay the evil monster, and gain the heroes' reward. Of course, the animation and design of the characters is geared to making sure there are no doubts to their roles, as is the vocal cast, which includes some high-profile names but takes absolutely no chances: everyone sounds as their archetype should.\\n\\n\r\nThe first half of the series is used to pound every single trite and generic characteristic of standard fantasy series, from Wizardry to whichever animation of the Tales-video games, into the viewers perception. Expediently enough, it does this by making the episodes comical, even farcical at times. The first episode shows the main character's own vision of his heroics in the most generic manner possible, for instance, while later on the inherent greed of all adventurers is relied upon to have them unite against a common enemy. It is in this half that the series also pays its homage to the roots of the Druaga franchise, as not only are there a few instances wherein the drawing style switches to the top view, 2d, 8 bit look of the original game, but the game itself appears as well, and has a functional role too.\\n\\n\r\nBut I started this review by stating that Tower of Druaga is not a comedy series. This is because, halfway through, it suddenly takes a turn for the dramatic. Usually, this would mean the end of any interest the series would hold, as far too many broken romcoms and action comedies testify to, but in the case of Tower of Druaga, the first, somewhat comical, half turns out to be used to make the viewer comfortable with the generic setting and characters. It makes no sense for the viewer to expect some sort of realism in the setting, and he also has come to expect some sort of volta stemming from the characters' unspoken but clearly known backgrounds. \\n\r\nThe effect is that the viewer does not have to be disappointed by this generic plot twisting or the reactions of the characters to it, as it was already clear that nothing overly original would happen. It is, in fact, this basis in generality that makes the drama fairly strong. As each and every character acts according to its archetypal fashion, a plot point that is as archetypal can be convincingly raised as a source of dramatic tension: for instance, if all characters have their own motives, and if only one reward can be gained from slaying the big evil, what would this imply for intra-party integrity and inter-party rivalry? The friction resulting from the fact that, while slaying the big bad would be beneficial for everyone, only one brave adventurer can become the true is convincingly exploited. \\n\r\nGranted, the drama and tension aren't very evolved or deep, and the fact remains that almost any single happening can be predicted. The way it was portrayed, however, was, to me at least, thoroughly enjoyable, even if entirely forgettable. What makes me shirk from giving the story an extra point for the way it is handled, however, is the simple fact that Tower of Druaga - the Aegis of Uruk is an unfinished series, with a sequel in the making, and I fear that many of the more interesting points will in the end be strung out and hung out to wither. \\n\\n\r\nAs for the art, in general it is pretty good, with clear lines and a strong design treading the middle ground between expected fantasy trappings and some more inspired vistas. A definite plus is the use of the graphics of the original game at times, and a definite minus would be the use of CG for the main monster, but that's just my personal hatred towards CG animation speaking. As said, the voice acting, though relatively high profile, was as generic as possible, ranging from the heroic to the positively annoying. Music is utterly forgettable.\\n\r\nThe characters, as said, are as generic as they come. I didn't expect more, and I didn't get more. I have never understood why character development and connection with characters is such a dearly held item in reviews, as characters should portray their roles within a certain story (background in general is irrelevant) and should be convincing and consistent in their roles, whether or not the role is likable or not. In the case of Tower of Druaga, the roles aren't meant to be developed, or to offer some insights, or to portray either 'real' humans or ideals. They're consistent, clear-cut, and utterly generic, and this serves the series well. Just don't expect to be blown away by either their lines or their expressions.",
            "date": "2008-08-28T06:43:00+00:00",
            "helpful_count": 48,
            "mal_id": 7526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/40245.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/santetjan",
                "username": "santetjan"
            },
            "url": "https://myanimelist.net/reviews.php?id=7526"
        },
        {
            "content": "This is my first review, so hold up on the critics. :P\r\n60 years after King Gilgamesh defeated the evil god Druaga, the tower that Druaga once resided in returns. The story follows rookie climber Jil, who got kicked out of his brother Neeba's team after failing miserably. Refusing to give up, he decides to look for new teams mates to again climb the tower to defeat Druaga and claim the prize for doing so, an artefact said to be able to grant any wish, the Blue Crystal Rod.\r\nSTORY:\r\nMaking use of a legendary name of \"Tower of Druaga\", fans from that age and generation will bevery interested in watching it. They will be sorely disappointed. The references to the game are so lousily done, it made this almost a parody of it, which I highly doubt that was the intended motive. Even the overall plot hardly has a flow, just mearly the climbing of the tower, facing various obstacles along the way, which are hardly entertaining, might I add.\\n\\n\r\nART:\\n\r\nFor all of Gonzo's inability to make a decent plot, their animation quality never ceases to amaze me. It's very pleasing to the eye. Now if only the anime was any better. -_-\\n\\n\r\nSOUND:\\n\r\nGood opening song, voice actors pretty decent. Not much more I could say, really...\\n\\n\r\nCHARACTER:\\n\r\nWHAT character development? There are few different groups of people in the anime: Jil's party of 5, Neeba's of 4, the main people of the Uruk army and some bad guy. With only 12 episodes, what are the chances many of them will be developed? That's what first came to mind, but guess what. NONE of them are developed. Except the occasional minutes/seconds of background story, we still know next to nothing about most of the characters!\\n\\n\r\nENJOYMENT:\\n\r\nThose that know me know I'm hardly a shounen fan, yet, this is possibly among the worst shounen anime I have even watched. Fillers in Naruto are more enjoyable than this.\\n\\n\r\nOVERALL\\n\r\nFrankly, if i could turn back time, I would have NEVER gone anywhere near this anime. With a decent first episode, I would have thought it would be pretty good along the way, only for it to drop further into mediocrity, right down to plain lousy.",
            "date": "2008-06-20T19:13:00+00:00",
            "helpful_count": 48,
            "mal_id": 5656,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/28159.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/HalRyder",
                "username": "HalRyder"
            },
            "url": "https://myanimelist.net/reviews.php?id=5656"
        },
        {
            "content": "I am sorry to say that this anime has been quite confusing, and I couldn't predict anything. Not like I must have control to enjoy something, but without having some solid ground, you don't know where GONZO's gonna throw you next. The series started out brilliantly, but as it went on, it felt like GONZO split up its team into sections. \"OK, you make episode 4, and I'll make episode 5, and...\" yeah, you get it. You can feel the disconnection between episodes, and GONZO is having a hard time finding the fine balance between comedy and serious plot movement that makes sense. However, itwasn't horrible and not worth watching at all, and it seems GONZO's gonna try this again with a new season next year.\\n\\n\r\nSTORY: 6/10\\n\\n\r\nNot the most inventive thing you've ever heard of. A guy wants to be the hero, his old team rejects him, he finds a new team, and whoopee you can guess from there. Although the story has a nice twist at the end, it hardly makes up for the stereotypical plotline. What makes things even worse is that the plot is executed by underdeveloped characters that you have a hard time connecting with, and part of that is the tiny 12 episodes that GONZO attemted to cram their huge ideas into. If they had about 26 episodes for this anime instead of 12, I bet we would see some huge improvements.\\n\\n\r\nART: 8/10\\n\\n\r\nThe art was actually pretty good. I really enjoyed the occasional 3D moment, it really fleshed out the anime more. The character designs were unique as well (in terms of looks, not emotions) so not much else to say here.\\n\\n\r\nSOUND: 7/10\\n\\n\r\nNothing fabulous. OP and ED were ok, and no in-anime music struck me as amazing. it just... it fit what it was going with, like anime music and sound should.\\n\\n\r\nCHARACTER: 6/10\\n\\n\r\nHere's the one I wanted to talk about. I can see that these characters have a lot of great emotions and ideas packed into them, but 12 episodes is simply not enough for such a complicated web of people. I didn't know much about any character at the end, and I felt almost like they didn't earn what they got. Instead, it felt like GONZO was pushing the characters to the end so that it could meet this 12 episode limit. It just feels like something is missing, and that probably has to do with the confusion of where this series is actually going. The characters rarely start an episode where they ended previously, and... well, I blame it on the 12 episode limit again...\\n\\n\r\nENJOYMENT: 7/10 \\n\\n\r\nNot much to say here. Let me put it this way: I always watch 4 anime episodes a night, sometimes 5, and I always watch them in order of worst to last. Druaga was almost always one of the first ones. It's hard to enjoy it when you don't know where its going, or what the characters really think. I am very confused right now about Kaaya's stand on things, but hopefully we'll learn more next season.\\n\\n\r\nOVERALL: 7/10\\n\\n\r\nI've been beating on this anime a lot, because I feel that Druaga is lacking something. I couldn't connect with the characters very well, the plot was cliche, it just wasn't there. It's still an enjoyable anime, though, and I suggest viewing the first few episodes and seeing how you like it.",
            "date": "2008-06-26T11:46:00+00:00",
            "helpful_count": 24,
            "mal_id": 5822,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64068.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/theeggman85",
                "username": "theeggman85"
            },
            "url": "https://myanimelist.net/reviews.php?id=5822"
        },
        {
            "content": "I'll  make a short review for your convenience (if you haven't seen this anime yet).\r\nTower of Druaga ~The Aegis of Uruk~ is an adaptation of an old namco game with the same name. This anime is just like any other typical adventure anime engulfed with wacky antics that will leave an impression to you. \r\nThe story is somewhat generic. Basically it includes a group of climbers with the desire to obtain the Blue crystal rod (an item which is said to grant its bearers wish). It can be obtained after defeating Druaga who is located on top of the tower that is  namedafter the evil lord Druaga himself. Certain plot twists were also present which sets this anime apart from most adventure anime titles. The animation company &quot;Gonzo&quot; is the one who's responsible for this one. I personally disliked Gonzo before but I have to say that their work on this one is pretty good. From the first episode to the last, the animation got better. The background animation is decent and 3D animations were also present. The BGMs used in this one is unappealing. The only thing I liked about the music in this anime is the performance of the uprising band Muramasa with their opening song Swinging. The characters are also typical, it features some of the so-called classes which includes an Archer, a shielder, a healer and etc which can be found in most RPG's or MMORPG's of today. The characters are interesting, interesting to the fact that almost all of them have different intentions and reasons for climbing the tower however they share only one thought and that is to defeat Druaga.\\n\\n\r\nI enjoyed this anime, almost every episode will make you smile and these interesting characters will do the honors of doing so. Overall this anime is good for all ages, it's an adventure of 2008 that you should not miss.\\n\\n",
            "date": "2008-06-26T09:48:00+00:00",
            "helpful_count": 14,
            "mal_id": 5821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20621.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/cafekun",
                "username": "cafekun"
            },
            "url": "https://myanimelist.net/reviews.php?id=5821"
        },
        {
            "content": "What is THIS THING?\r\nNothing to do here!\r\nIm going to sleep!\r\nI cant understand what is this!\r\nIts enough internet for today!\r\nThis is a very funny anime!\r\nI cant stop laughing and crying!\r\n...",
            "date": "2015-04-25T12:59:00+00:00",
            "helpful_count": 11,
            "mal_id": 186442,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4559840.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NaoriU",
                "username": "NaoriU"
            },
            "url": "https://myanimelist.net/reviews.php?id=186442"
        },
        {
            "content": "Entertainment is not a difficult subject to write about since no matter what incarnation of it, either it be a music, a book, a movie or an anime, the main propose is to entertain. In that regard it can only either achieve it or fail, but in between those two there is what we call mainstream (don’t mix it up with ordinary or average), and there have been very few installments that represent the niche as well as Druaga.\r\nTwo things will remain constant in this review, first alphanumerical scorings will mean very little since we can only strictly classify an anime by its intrinsic values,when we are either flaming an abysmal show, or praising another gorgeous one. And second, people that tend to strive by exaggerating problems instead of praising achievements and balancing mistakes will most likely disagree with me. But anyway, these people tend to make their minds on a subject before hitting the issue so their thoughts are biased from start, and no matter how long of a rant or praise I write I will never make them happy, and I wouldn’t be paying justice to Druaga with neither approaches.\\n\\n\\n\r\n----------------------------------\\n\r\nStory\\n\r\n----------------------------------\\n\\n\\n\r\nThe strength of the story here doesn’t come from intricate plot or interesting twists, instead it have its strongest suit on the development, which is only a pretty way to say it is predictive and not as well explained as one would hope, but still manages to stand on its own legs and doesn’t let down. Some parts of the lore and the most part of the back stories of the characters are simply not explained at all, but since we are dealing with some pretty standard territory (fantasy, dragons, ghosts, magic, so far not vampires…) even if some plot holes are present, the omission of explanations actually helps what could very well turn out to be a dragged mess of unneeded monologues.\\n\\n\r\nThe first episode is simply wonderful and kicks in with a really good pace that puts you into the mood to take whatever it might hold ahead, and actually manages to keep this feeling going for the majority of the time, only dropping the ball slightly by the end running away from its uniqueness’s to the more safe surroundings of your everyday shounen, complete with insane amounts of mainly screens and girly tears. It is aggravating but bearable since even in its worse moments it stays solid, and on the other rare occasions where it is simply bad, you always manage to find other redeeming factors on the scene, either it be the unusual and fresh homage to the source material spread throughout the series, or the humor that frequently comes off on the precise moments.\\n\\n\r\nThat aside, one of the small touches I like the most is the fact that they strayed away from the usual “average high school boy” as a main protagonist, while still referring to that demographic trough the intro. It was a really smart move to make the plot feel a little bit fresher, while still ticking the pre-requirements to get founding for the show. If only they would stick to this kind of creativity throughout the whole thing, the story would’ve been much better, but I don’t like criticizing something based on my failed expectations so it’s a moot point.\\n\\n\\n\r\n----------------------------------\\n\r\nArt / Animation & Sound\\n\r\n----------------------------------\\n\\n\\n\r\nThe static art is good, characters are vivid and well designed and the colors albeit a bit too bright for a dungeon environment are good, but as soon as motion occurs it is uneven at best. This doesn’t deserve to be dragged much longer, but I have to point out you will spot a few sequences of animation with  less frames then would be required to look good, luckily  those were not frequent enough to leave a bad impression of the otherwise competent art and animation direction. Just as the 2D counterpart, the CGI is well executed but animated unevenly. It was also not bad enough to become intrusive, but at this day and age we have come to expect more value per screen time then what is delivered here.\\n\\n\r\nSoundtrack is really subpar. It’s not technically at a fault and more often than not it fits the scene, but battles lack punch, drama lacks emotion and overall it lacks quality to make an impact worth noticing at any given moment. The intro selection is fitting for the unique choice but nothing else, and sound effects are not as bad as the rest, holding their own ground fairly well. Voice actors do a decent job, and at least during a few lines when both the plot and the soundtrack help they do a great one, but this is not common enough to worth praising on any specific role.\\n\\n\r\nWithout taking into consideration the lack of vibe the sound department provides, the visuals are pleasing while never achieving moments of complete gloriousness (possible exception for the outtakes of the tower itself) and in fact the irregular nature of the art here, hurts more than simply the lack of quality which gladly is far less common.\\n\\n\\n\r\n----------------------------------\\n\r\nCharacters\\n\r\n----------------------------------\\n\\n\\n\r\nLasting impressions after the credits roll are usually a safe indication of how good characters are, but here this might not be failproof. This is because the development of the main characters is incomprehensible from time to time, and you might just as well get attached to someone just to find out later he became something else. This is a bit more subtle on the female cast but ridiculously evident with the main character, he goes from good-for-nothing to dependable to demigod and then back to screaming teenager without any trouble or rational explanation, and in the meanwhile people around him act as if he had a giant poster written “main character” floating above his head and this was only natural. Romance development and drama climax also suffer from this, and they never truly deliver due to lack of proper trailing.\\n\\n\r\nSide roles are not particularly flashed out here, and it is for good measure since the few attempts to bring them out shows how silly and underdeveloped they are, but with a main cast of roughly 10 characters we still get plenty meat on the bone with episodes focusing on specific characters and such. The main gripe thought is that there is no clear enemy, and instead they just go around facing random “evil” that pops up, most of them nameless, until they reach yet another boss that is not developed as a character at all. Instead of having opposing motivation, the enemies are just there to be slashed, and this gets old eventually even if it is yet another trait of the original material they derive from.\\n\\n\r\nJust as with the story, where at the same time it’s neither the main focus nor the outcast, the characters face a well rounded tour, going from spotlight to backstage in a blink of an eye. You never get too much or too little of them, and by the end the mileage gained is quite good. Though it could be a bit better if they would settle for either comic or dramatic mood with some plot developments, because with so many stories I felt it lacked time to fulfill both goals to the fullest. Rest assured, there isn’t many unlikeable characters to begin with and the side cast is pretty weak, but the main ones all have some redeeming traits and unless you try really hard to hate them, you will be able to get attached to them soon enough.\\n\\n\\n\r\n----------------------------------\\n\r\nEnjoyment & Value\\n\r\n----------------------------------\\n\\n\\n\r\nSo, what makes a mainstream anime? Average sound, average music, average animation, average art… these are scrutinizing about subjects one anime belonging to this category don’t need, instead what characterize a mainstream anime is how well it manages to differentiate itself from the horde of similar ones, and how effectively the fun factor can avoid the hindering all the technical shortcomings might incidentally bring to the table, and taking all of this into consideration Druaga is a proud member of this group.\\n\\n\r\nWith its dose of uniqueness both on visuals and direction it manages to remain with a fresh feeling during the entire show, and with somewhat likable characters and good pace, it also achieves a decent level of lasting impression. The technical aspects might not be as sharp as one could expect since the bar these days is set so extraordinarily high, but it also goes miles away from being simply ordinary or mediocre.\\n\\n\r\nOverall it is an easy recommendation for anyone that likes the genre, perhaps not a “no brainer” for anyone else, but it definitely delivers into all aspects one would expect while at the same time bringing a healthy dosage of extravagances.",
            "date": "2009-09-24T07:58:00+00:00",
            "helpful_count": 8,
            "mal_id": 19066,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/199926.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/711",
                "username": "711"
            },
            "url": "https://myanimelist.net/reviews.php?id=19066"
        },
        {
            "content": "Av: Interesting looking box art there\r\nNK: Ah, right.  New anime I got a couple weeks back.  It’s called “Tower of Druaga - The Aegis of Uruk.”\r\nAv: That’s a mouthful.  Wait, “Tower of Druaga?”  I’ve heard that somewhere before…\r\nNK: Tower of Druaga is an old video game by Namco.  I played it a bit when I was a kid.  That’s the reason I took a look at the anime.\r\nAv: How’s the anime?\r\nNK: Pretty good.  Sure, it doesn’t follow the plot of the game, putting the events of the game at 80 years in the past, but it still hasreferences to a lot of the game.  King Gilgamesh, all the monsters.  Heck, the main group actually goes to the old tower during one episode.\\n\\n\r\nAv: Sounds…interesting.  What did they do there?\\n\r\nNK: It’s actually an important plot point as to why they were there, so I won’t divulge all the details.  Basically, Jil charges into the tower to find something, when it turns out he has to be controlled by someone outside.  Hilarity, and the most direct reference to Tower of Druaga, ensues.\\n\\n\r\nAv: I take it that’s your favorite episode?\\n\r\nNK: No.  Episode 5 is.  The party comes across a fork in the road, one side saying “shortcut.”  They decide to take the shortcut, which turns out to be covered in traps.\\n\\n\r\nAv: That doesn’t sound good…\\n\r\nNK: The traps are hilarious, though.  They change the entire party magically whenever someone steps on one.  For example, at the beginning of the episode, everything turns 8-bit.  It’s great.\\n\\n\r\nAv: Right.  What about the characters?\\n\r\nNK: I like most of the characters in the series.  The main party is easy to get attached to, though some are your stereotypical heroes.  Jil, for example, is your typical, likeable goof, though he does get pretty serious when he needs to.  Kaaya is, well, there’s a lot of important details to her.  She’s an oracle, a user of defensive magic…she comes across as cute an naive at first, but...well...that’s all I’ll say about her.  Ahmey is a very serious character among all of the chaos in the party, so she stays pretty quiet until there’s trouble.  Melt is from a noble family, so he’s really picky and complains about a lot of stuff.  Plus, he uses his magic with rods that he swings like golf clubs.  His assistant, Coopa, is the craziest of the group, being about 12 years old, though she acts much more mature than Melt.  It‘s funny watching them argue.  I really can’t go into too much detail about the party, though I will say it’s one of my favorite casts of characters.\\n\\n\r\nAv: Figures as much.  Take it Coopa’s your favorite?  You do tend to like the younger characters.\\n\r\nNK: Actually, no.  Melt is my favorite character in the series.  The introduction to him casts him in a bad light, seeing as how he’s completely drunk, but he’s actually a likeable character once you reach the end of the series.\\n\\n\r\nAv: You watch it in Japanese, as usual?\\n\r\nNK: I actually watched it in English, though I did watch the first few episodes in Japanese.  Part of the reason I bought the series was the voice actors in it.  Jil is played by Todd Haberkorn, who also played Hikaru in Ouran and Watanuki in xxxHolic. He does a good job playing the goofy hero.  Melt is voiced by Chuck Huber, the same guy who voiced Hiei *snicker*.  It’s a pretty interesting voice cast.  Oh, just warning you now, Coopa’s played by Monica Rial.\\n\\n\r\nAv: Oh, joy…\\n\r\nNK: It really isn’t that bad.  Though she does sound a lot like Renge.\\n\\n\r\nAv: That’s what I was afraid of.  So, I take it I should watch this?\\n\r\nNK: Definitely.  Even if you haven’t played Tower of Druaga before, I’m pretty sure you’ll enjoy it.  Oh, before I forget, this is the first season.  There’s a second season I’ve yet to watch subtitled “The Sword of Uruk.”  The ending is pretty weird because of that, just warning you.\\n\\n\r\nAv: You’ll be getting that one too, huh?\\n\r\nNK: Yep.  Though it comes out in February…It’s going to be a long wait.",
            "date": "2009-12-17T07:09:00+00:00",
            "helpful_count": 8,
            "mal_id": 21447,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/227213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NinjaKirby1322",
                "username": "NinjaKirby1322"
            },
            "url": "https://myanimelist.net/reviews.php?id=21447"
        },
        {
            "content": "This spring season completely changed my opinions toward Gonzo. Blassreiter is already a very solid series and I have always been a CG-hater. Druaga, on the other hand, came as a wonderful surprise. \r\nDruaga is not a masterpiece by any means, otherwise I wouldn't give it an 8 only. But it does have the potential to become a masterpiece. I was rather disappointed after the first episode because it was not funny at all (the Urua episode was much better IMO). In the next 11 episodes, I did see some interesting ideas and the writer did not drop them either. Unfortunately he didn't go onand explore them. Of course, one may argue that Druaga is a comedy anime in nature, and I'm perfectly fine with it. All I'm saying is that Druaga could be much better if the writers were more serious about these ideas.\\n\\n\r\nBut I'm not trying to bash the show here. What makes Druaga so wonderful is its good characterization and a full-of-imagination worldsetting. The worldsetting incorporates all the wonderful elements of RPG such as cute low level monsters, various skills, different classes of characters, team play, boss run etc. It also leaves all the boring parts out, such as walking from point A to B, like what they did in that more-boring-than-Bohr's-atomic-model Guardian of the Spirits. The little cute monsters and all that are what makes RPG interesting in the old days. \\n\\n\r\nThe chacterization is above the average too, even though it suffers a little bit from the plot. It has everything I could ask for. The characters are realistic, they have depth, and they have some lovable elements. Rarely seen in the anime industry, the writer clearly demosntrated that he received some professional training in writing. Druaga introduced a huge set of characters. Fortunately the writer didn't divide the screen time evenly to each character (see Rahxephon). What he did, like any other trained writer is supposed to do, is to focus most of the show on the main characters: namely Kaaya, Niba, and Jil. None of them are annoying, and all of them have some mysteries surrounding their past. The mysteries kept them interesting to watch throughout the season. My favourite character is Jil, not because he is the protagonist but because he is the only one who showed some character change in this season. From a rather naive hero wannabe to a person who desires to become a shield for his friends, the change was done smoothly and genuiely with considerable amount of introspection, another important piece in good characterization. The last episode says it all:&quot;They are not heroes but people who fight for their dreams.&quot; A normal person growing up is always the best. The puppy love between Kaaya is cute too and it's very likely that the focus of the show is going to be shifted toward this relationship in the next season. As for the side characters, as long as they are not annoying, that's enough for me, and that's exactly what the writer has done.\\n\\n\r\nSeason 1 has been a great journey and ended at a cliffhanger. Without a question, season 2 is going to be my most anticipated series next year.\\n\\n\r\nPS I hope someone could organize a petition. The rating system should really include more important things such as world setting, theme, theme delivery etc. Who cares about animation...?",
            "date": "2008-06-24T18:52:00+00:00",
            "helpful_count": 8,
            "mal_id": 5771,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/33389.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/az_0k",
                "username": "az_0k"
            },
            "url": "https://myanimelist.net/reviews.php?id=5771"
        },
        {
            "content": "Tower Of Druaga (Druaga No Tou) is one of several anime adapted from games. \r\nStory & Characters: The story in Aegis of Uruk is definitely the shows weakest aspect. The plot tells a rather generic mmo rpg story (there's some evil entety in a tower that people climb to defeat monsters and gain treasure and so on...), with the main character being Jil, a boy who aims to reach the top of the Tower of Druaga adn defeat the evil god who the tower is named after. He teams up with other \"climbers, all with different goals, and heads to the top, racing against otherteams of climbers, facing many dangers and meeting many people. Throughout the story we're shown hints that there is some hidden plot working behind the scenes as well. Still there's a bucket full of plot holes and annoyances through the series that can be quite glaring at some points. The characters are a cast filled with some of the usual tropes and e few rarer, with different short backstories. The characters are enjoyable enough, but doesn't go far beyond that.\\n\r\nArt & Sound: The art is not the best, but it isn't bad either, and manages to make things look interesting enough, without going above and beyond. The sound are ok.\\n\r\nOverall: I enjoyed the show, but it's not among my favorites. It has a lot of problems, but still remains better than many newer shows, having a personality of it's own.\\n\r\nEnjoy!",
            "date": "2018-12-19T00:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 296131,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7250351.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ThorNN-heim7",
                "username": "ThorNN-heim7"
            },
            "url": "https://myanimelist.net/reviews.php?id=296131"
        },
        {
            "content": "Tower of Druaga...I cannot adequately explain why you were so enjoyable for a series which balanced comedy and drama so badly...this review may be very short. The story is about a rag tag group of people aiming to climb the Tower of Druaga and claim the glory that comes with reaching and defeating the demon, Druaga, at the top. Jil is our main character, a young kid who is deceptively strong and he is joined by other party members representing stereotypes from RPG games. By all accounts this series isn't perfect, it's a balancing act between serious story and comedy and it tries to hitboth, it can however be very serious at moments and very funny at moments. Whats great about this series is the unique quirks and twists it provides the viewer, from pop culture references reflecting RPG's and other similar adventure series', to representing different fandoms as well as recycling a very cliche story into something legitimately enjoyable.\\n\\n\r\nThe story follows along Jil's adventure with his crew of 'climbers' as they progress through the levels of the tower and encounter beasts, personal battles and betrayals and along the way they keep a sort of episode by episode shift between comedy and serious story and character development. As you watch this series you never can tell what will happen in the next episode, your guess is usually as good as the characters but this is also a feather in Druaga's cap as it delivers on both front, though isn't quite good at mixing the two together.\\n\\n\r\nThe characters were some of my favorites I've ever watched and one in particular left a bit of an impact on me and now resides in my list of favorite characters of all time. The shows episodes are told almost episodically and its only in a couple of episodes where moments from previous episodes are even brought up. That being said this series warms up to a fantastic end and second season which I almost instantaneously began watching.\\n\\n\r\nThe art is enjoyable though not particularly awe inspiring and a bit of CG is used which isnt particularly exciting. The opening and closing songs are fantastic and are complimented by great alternative world style video clips (featuring the main characters as if they were ordinary people) though the background music in the show wast very pronounced.\\n\\n\r\nIn all honesty I may have marked Druaga up a bit in the wake of watching this show but as I think more about it I want to stick by it. Think rationally this series earns an 8, but personally this show is one I will probably come back and watch with delight.\\n\\n\r\nFirst review complete!\\n",
            "date": "2013-02-22T03:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 87547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1921336.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Animelting",
                "username": "Animelting"
            },
            "url": "https://myanimelist.net/reviews.php?id=87547"
        },
        {
            "content": "Well it started out really great! It parodied the whole shounen genre and it was really funny, end of the episode it went 180. It didn't go bad, not really, I still had high hopes though. I thought that since it was aware of the tropes of a shounen then maybe it could break away from them. Too much hope it seems. Well watch the first episode. Everything else is just meh. \r\nIf you have watched shounen before, then you've watched this show. Something like Rage of Bahamut is a better fantasy (as bad  as the game that show is based on, the animewas superb). The characters here enter stereotypes the moment the 2nd episode hits and even if there are a few curve balls here and there that might keep you engaged, you can just watch something else. \\n\\n\r\nWatch HxH or Rage of Bahamut, Log Horizon and World Trigger (WT is a bit slow but with 50+ characters, that's quite understandable). But this is for someone to watch if you absolutely have nothing else in your life.",
            "date": "2017-11-27T23:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 264098,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/nokinoks",
                "username": "nokinoks"
            },
            "url": "https://myanimelist.net/reviews.php?id=264098"
        },
        {
            "content": "GONZO sure started off very nicely with this release. The first episode was hilarious and had so little; yet so much to do with what has later to come.\r\nTruly; it made me want to look at episode 2 with more heart and NEED of this Anime.\r\nHowever, the more the episodes went on, the more disappointing it'll become.\r\nI don't know what GONZO was trying to do; but a lot of stuff later in the series starts to get quite confusing and doesn't really add up to anything.\r\nI see this happen in a lot of Anime; they try to complicate their stories more by confusing the viewer.But the only thing they are doing is putting unnecessary effort into unnecessary scenes. If only they'd put in more thought to the story and followed up from where they started, it would've been better.\\n\\n\r\nHowever, it is what it is, so lets keep it that way. The Anime as it is, isn't flawless, by far. But it is enjoyable, however.\\n\\n\r\nThe characters are just like the story; not that big a deal. Quite typical for Anime, and sort of predictable. The story was unpredictable; due to it being confusing. But the characters, not as much. \\n\\n\r\nThe best part of this Anime is it's continual feel. At one point it is mystical and fantasy-based. At the other point it tends more towards action or drama. Some scenes really look like RPG's, while other scenes tend more towards a different type of action.\\n\\n\r\nAll in all, the Tower of Druaga - The Aegis of Uruk, has a lot to offer. Maybe a bit too much; seeing how it's better to stick to one vibe in stead of many.\\n\\n\r\nHowever, let's skip complaining and enjoy the show. Since it still was quite enjoyable and has nearly flawless animation. The sounds were pretty good and there is a certain amount of development in between. So yes, it is definitely enjoyable if you look beside the flaws that is the story.\\n\\n\r\nThere will be a second season of this Anime; let's just hope GONZO makes up for it; so it'll become just like this one, but then without flaws.\\n",
            "date": "2008-12-22T04:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 10562,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/30528.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Elydan",
                "username": "Elydan"
            },
            "url": "https://myanimelist.net/reviews.php?id=10562"
        },
        {
            "content": "Welcome to my candid review. This is an adventure anime with elements of fantasy and tinged roughly equally with moments of light humor and dark violence. The first episode focuses only on humor and is NOT like the remainder of the anime, which is actually much more serious.\r\nThere isn't much complexity to this anime. It's fairly straightforward, blunt in its character design and writing, with standard-fare switch ups between serious and lighthearted episodes, young characters, as well as delivering a measured rather than ambitious plot, overall making it a simple anime that would fit kids well. The catch to this anime is that for allits simple design, it has enough violence to coat it in mature tones as well. \\n\\n\r\nThe anime is at a crossroad between many different styles. Due to its lack of specific style  it will probably deliver moments that you absolutely have no interest in, but other moments that will tug you along just enough to keep watching.\\n\\n\r\nIt's a nice anime, nothing amazing. If you find yourself not liking it, don't force yourself to continue watching. Just note that the anime doesn't really settle in until after episode 3.",
            "date": "2016-04-29T13:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 217441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Ilike69",
                "username": "Ilike69"
            },
            "url": "https://myanimelist.net/reviews.php?id=217441"
        },
        {
            "content": "I found the first season of Druaga to be a solid entry across the board. I was never overwhelmingly surprised nor bored with the series, and enjoyed a marginally original take on a fantasy anime.\r\nStory follows young protagonist on an exceedingly standard quest for heroic glory. Along the way we meet a few few extra party members next to a few standard entries; none too tired to be irksome or annoying if you're willing to roll with some standard fantasy fanfare. The series does actually make a point of being slightly lethal which does prevent it from falling into the vacuum of awful cliche. \r\nAgood series to watch over the course of a week that keeps things interesting enough to keep you wanting to see the end result. \\n\\n\r\nParticular note goes out to the opening for juxtaposing all the characters into a modern setting, which might have served as a great filler episode.",
            "date": "2015-03-15T01:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 182371,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3400497.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/wkoppin10",
                "username": "wkoppin10"
            },
            "url": "https://myanimelist.net/reviews.php?id=182371"
        },
        {
            "content": "Tower of Druaga - Going into this show i wasn't sure what was going on based on the first episode but at the start of the second episode things quickly started to improve. You follow Jil as he tries to climb the Tower of Druaga to make a name for himself as a hero. Hes not your typical annoying male lead character and while he wants to save everyone as many leads do he comes across as believable and genuine. In fact all the characters are not your average band of cookie cutter party members and all have their own reasons for climbing the towerand their own distinct personalities.\\n\\n\r\nThe animation is of a good level throughout and while they may use some CG here and there such as the large army of Uruk it actually meshes pretty well and isn't your typical rubbish Gonzo CG. The show as a nice mix of comedy,storytelling and action so theres something for everybody. Most of the earlier episodes have a more lighthearted feel to them but at the same time foreshadowing something that isn't quite right with the legend of the tower. You will be surprised as the show reaches its last few episodes and not everything and everyone is as clear cut as they appear to be.\\n\\n\r\nThe silliness in the earlier episodes may put you off in your looking for a dead serious fantasy story but you can rest assured that this show does actually go somewhere and more of the shows time is spend fleshing out both the character relationships and their motivation. We really don't learn too much about the characters past apart from Jil and Nebaa but they try to fit in some time here and there for a few of the supporting cast. Being only a 12 episode series i guess this cannot be avoided but they do a good enough job of it for me to care about all the party members.\\n\\n\r\nAnyone looking for a good fantasy RPG style show should definitely check this out. I was very surprised at how good the show turned out after the confusing first episode. Also you can join me into looking forward to a second season coming out sometime in 09.",
            "date": "2008-07-03T07:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 5984,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/30898.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Phantom",
                "username": "Phantom"
            },
            "url": "https://myanimelist.net/reviews.php?id=5984"
        },
        {
            "content": "TToD takes the generically vacuous premise of an 80's arcade game and attempts to make a good story with it. They partially succeeded. The narrative (discounting the dangerously misleading but brilliantly satirical first episode) starts out very light and often humorously, making for easy, pleasant watching in bulk when you're hungover or otherwise unable to cope with fast dialogue, complicated plots and frenetic action. For the amount of characters included they did a fair job of establishing them in this chunk and making all of them passable in their own ways. It's in the second half that things start to get more serious, with agood amount of mysteries to be uncovered and some interesting turns that venture beyond the conventions of most aventure-fantasy stories.\\n\\n\r\nThere are very basic things which drag this show down, however. While episodes 2-6 do manage to have a fun, adventurey feel and establish the characters, they're not complimented by much memorable humour, which I feel is something they could have done with. The second half sees more in the way of depth and seriousness, but it doesn't accompany this with any good action, with the rare battle sequences feeling unfortunately boring, and the drama involved wasn't all that poignant. The latter defect probably wasn't helped at all by what another reviewer rightfully pointed out as the very emotionless face-animation which detracts from both the humour of the lighter scenes and the intensity of the more dramatic ones. The soundtrack is pretty decent but it didn't really manage to 'make' any scenes like it can in other shows, partially as there weren't enough tracks to begin with. The universe of TToD itself is supposed to be fairly generic, so you can't expect any saving graces from there like you would be able to with, say, Log Horizon.\\n\\n\r\nAll of this being said, I definitely like the way the storyline culminated in the last few episodes, setting us up for a conclusion of the adventure in Sword of URUK which I was quite eager to experience. TToD is no top tier must-watch anime, yet despite its defects it was an enjoyable watch and deserves its share of credit.\\n\\n\r\n5/10",
            "date": "2015-03-26T04:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 183439,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3829377.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Renegatz",
                "username": "Renegatz"
            },
            "url": "https://myanimelist.net/reviews.php?id=183439"
        },
        {
            "content": "At first, i steered clear from any GONZO-affiliated show, but i decided to give Druaga a try. Well, i was, surprised in some ways, disappointed in others. (Which describes most GONZO shows anyways.)\r\nStory - 6.5/10 (D)\r\nWell, it's about a young hero who wants to rid the world of the evil Druaga, at the top of the Tower of Druaga. Sounds cliche? It somewhat is, but the first episode might be a miss for most, because it's mostly a \"I had a really sweet dream\" episode. Though i did like the funny parts, definetly episode 5, with the whole RPG-look, sex changes and the Roper Dancereally made me laugh, in a good way. You can enjoy Druaga, though it does randomly change from plot-focused, to comedy relief each episode.\\n\\n\r\nAnimation - 9.0/10 (A-)\\n\r\nWell, at least Gonzo is rich, enough to make Tower of Druaga a great animation piece. I really enjoyed how they took every scene into great detail. Though the show was somewhat not plot-focused, it had top-quality animation for each episode.\\n\\n\r\nSound - 7.8/10 (C+)\\n\r\nWell, typical RPG-like background music wasn't at all worth remembering, though the &quot;Funny&quot; episodes tend to have more upbeat, cheery music. The opening &quot;Swirling&quot; really stunned me. For an RPG-based show like Druaga, &quot;Swirling&quot; felt more for a show like &quot;Katekyo HItman Reborn&quot; or &quot;Gintama&quot; maybe, but it was a hit for me. The Ending, &quot;Touchousha-tachi&quot; by KENN (Who's also Jil's voice actor, fyi.) is a good mix of feelings jam-packed into 1:30, pretty good stuff.\\n\\n\r\nCharacters - 8.4/10 (B)\\n\r\nA great ensemble for Druaga. We have the wannabe hero Jil, then we have his older brother Neeba, who in a way cares about him though (to me) he's just a plain mean older brother. We have Fatina: a ditzy, Paris Hilton clone who wants to get to the Tower to claim her &quot;reward&quot;, we have Kally: a stealthy individual with a keen sense of direction. Next is Jil's team: Kaaya, a charming young woman with a strange, unknown power who is drawn to Jil's bravery. Ahmey, the &quot;Clare&quot; of this show (Clare=Claymore) who fights to somehow talk to her dead love, through the means of the Blue Rod. We have Melt and Coopa (No, not the Mario-kind of Koopa): A Mage with a presigious background and a willing servant to him. They provide the most comedy-relief in the show. Overall, this is a good kind of cast for an RPG-based anime.\\n\\n\r\nEnjoyment - 8.2/10 (B-)\\n\r\nI fairly enjoyed Druaga, with some complaints about story pacing and easy boss battles (the One-Winged Dragon for example) being too easy. If you have some spare time, Druaga shouldn't disappoint (For only 12 episodes). You'll laugh, scratch your head and cry during the short span of 12 episodes.\\n\\n\r\nOverall Averaged: 7.9/10 (C+)",
            "date": "2009-01-12T22:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 11413,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56526.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/webkid94",
                "username": "webkid94"
            },
            "url": "https://myanimelist.net/reviews.php?id=11413"
        },
        {
            "content": "Tower of Druaga is a wolf in sheep's clothing. There are a lot of fast twists and curves which can and probably leave a more critical viewer saying wtf. If you can get over the small amount of build up there than you'll be able to like Tower of Druaga.\r\nStory: Tower, fight up the tower= Dungeon Crawler? No don't worry about that. With only 12 episodes the show moves pretty fast and is excuted well. Though it doesn't score much points on originality I give it an eight because the development was good, nothing felt forced.\r\nArt: The monster designs were pretty good and I alsoliked the way that the Climbers had light armor compared to the Uruk Army who wore heavy plate. It gives a sense of their weight and job. (Fighting style)\\n\\n\r\nSound: Nothing really that was great or horrible. Opening was okay, nothing special. Warning: Had a hard time finding videos that were of decent quality for some episodes.\\n\\n\r\nCharacter: Teenager who wants to become a hero: check\\n\r\nPossible girlfriend: check\\n\r\nMore experienced person: check\\n\r\nComic relief: double check\\n\r\nRival team: Double check\\n\r\nOther miscellaneous characters: Multiple checks\\n\r\nEvil Overlord type boss: Check\\n\r\nApparitions that only one person can see: Double check\\n\r\nSmal animal that doubles as food and a pet: Check(Where did it go anyways?)\\n\\n\r\nSame old-same old. This won't hurt the anime in any way but I always hope for some sort of breakthrough.\\n\\n\r\nEnjoyment: I like anime and Tower of Druaga is no different. I might be crtisizing anime in my review but in enjoyment there are never any problems unless it burns my eyes out in a bad way.\\n\\n\r\nOverall: By the end of this anime you'll be on one of two sides. One you can say, &quot;What the hell just happened?!&quot;, and give it a bad score because things were a little too incomprehensible for your tastes. Or option two is that you find things still unbelievable but you notice there'll be a season two and hope that the next season sheds some light on what's going on. I'm option 2.\\n\\n\r\nLast Notes/Rant: Don't mind the first episode too much. It is kind of annoying but you should see it because it sets up the &quot;hero's&quot; character. After that it'll steadily get better, the last episodes were great to say the least. You can find Tower of Druaga at megavideo, but there are some that have much better quality than others. Look for alone****  *=numbers. One of his is in spanish (like episode 5), but the rest of are in english and of decent quality, especially the later episodes. Darn the 72 minute block thing, I really hate it. \\n",
            "date": "2008-11-26T16:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 9867,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/16253.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mouser888",
                "username": "Mouser888"
            },
            "url": "https://myanimelist.net/reviews.php?id=9867"
        }
    ],
    [
        {
            "content": "LOL this anime is hilarious\r\nevery episode is jam packed with funny material. it has all the elements that i enjoy, the hot mage chick ^^, fighting, and a whole lot of hilarious content. the story of this anime isnt all that new (oh no this evil guy is destroying our villages and causing havoc, then a hero comes along and all that jazz)  but since this anime is based off a game the makers really put that in the anime to make it funny\r\n It is a must if u watch lots of anime ^^",
            "date": "2009-09-04T09:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 18381,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/224579.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mumen_",
                "username": "Mumen_"
            },
            "url": "https://myanimelist.net/reviews.php?id=18381"
        },
        {
            "content": "I enjoyed all the twist and turns that they put the main protagonist Jil through. There was always something hidden just out of reach or a new discovery about the characters that got you to connect with them more and more as the story played out. Most of all I liked the whole tale being told around a seemingly undependable, useless figure that acts so sure of himself but has absolutely no real goal for himself. It's always \"just keep going,\" but to actually have there be much more to him then he or anyone else can even tell. That type of plot development isan old one but it never seems to get old.",
            "date": "2016-03-25T16:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 214109,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5002173.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/EternalAnimeGuru",
                "username": "EternalAnimeGuru"
            },
            "url": "https://myanimelist.net/reviews.php?id=214109"
        },
        {
            "content": "The bit where the main party hits the corridor of traps is one of the funniest things I've seen. As the name may imply this anime is based on the long running series of Druaga games by Namco. I have to say that while generally enjoyable anime based on video games is often pretty hit or miss. On the one hand you have awesome stuff like the Streetfighter movie and on the other hand you have stuff like Ragnarok - which wasnt as rubbish as people said, but it certainly wasnt awesome. This anime is certainly up there on the same level as the Streetfightermovie.\\n\\n\r\nThe animation in this is lovely looking and is enhanced even further by being in HD (I have to say Ive now got used to HD anime, I really like the crispness). But it's really the story and characters that form the appeal. The characters all feel \"real\", while there is no huge attempt at in-depth characterisation none of the characters presented feel two-dimensional; which can be a problem with genre pieces of this nature.\\n\\n\r\nAs well as excellent animation and appealing characters this show also has an engaging storyline which draws the viewer in while providing an excellent mix of action and comedy with the odd bit of drama thrown in for good measure. It also has a nicely done romance story which isnt shoved in the viewers face but grows at a nice pace. I should warn potential viewers that this series does contain one of the dirtiest cliff-hangers ever as well as a plethora of unfinished plot-lines. Of course the sequel is already half-way through broadcasting so you wont have to suffer the terrible wait that I did before finding resolution.\\n\\n\r\nAlso I have to say that the Tower and the world itself would make an excellent setting for a tabletop RPG.",
            "date": "2010-01-04T21:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 22052,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/277180.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Uthred",
                "username": "Uthred"
            },
            "url": "https://myanimelist.net/reviews.php?id=22052"
        },
        {
            "content": "This is a review for the german Users around here^^\r\nTower of Druaga,  beginnt mit einer sehr lustigen aber auch verwirrenden ersten Episode wo man erst am Ende wirklich versteht was passiert ist. Nach der ersten Episode entwickelt sich die Story erfreulich gut, allerdings wurde, meiner Meinung nach, viel Potential der durchaus interessanten Idee nicht genuzt, vieles ist vorhersehbar und an machmal hatte ich das Gefühl dass irgendetwas fehlt, insgesamt aber gut.\r\nMein persönlicher Favorit in der Serie sind die Characktere, ich hab es selten erlebt das mir Characktere richtig ans Herz gewachsen sind, und darum finde ich es schade das die Entwicklung mancher Nebencharakctere aufder strecke blieb, wohingegen die Entwicklung des Haupcharackters wirklich gelungen ist.  \\n\r\nEin weiter großer Pluspunkt der Serie ist der das sie einfach urkomisch ist und das Fantasy Genre manchmal schön auf die Shippe nimmt, das entspannt. Die Story wird dadurch aber nicht negativ beeinflusst und das ganze passt gut ins Gesamtbild.\\n\r\nEs gibt im Anime verteilt CG-Effekte die allerdings nicht berrauschend sind, auch ist der gesamte Stil des Animes nicht mehr als Durschnitt, die Characktere sind gut Animiert und gezeichnet, allerdings ist das nicht von anderen Personen oder Statisten zu sagen. \\n\\n\r\nAbschließend kann man sagen das Druaga ein wirkliches Fest für Fantasy Fans  die mal was anderes abseits des typischen Fantasy Animes sehen wollen und auch diejenigen die etwas zum lachen brauchen. \\n\r\nIch persönlich freue mich jedenfalls schon auf die Fortsetzung\\n",
            "date": "2009-03-15T06:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 13189,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/110568.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DarkPaladin118",
                "username": "DarkPaladin118"
            },
            "url": "https://myanimelist.net/reviews.php?id=13189"
        },
        {
            "content": "Druaga (I like to shorten names) is a show based on a video. When a show is based off a video game it's a hit or miss. This show is a hit. Druaga uses a type of concept that I desperately enjoy. Taking an aspect of herosim that's forgotten then dealing with it. Basically this show deals with the concept of the aftermath of the journey. After the hero return what happens to him and the world. It's a great anime so just watch it, right now stop reading and start watching already. You got a listening problem kid! Just get to watching . ..",
            "date": "2008-07-07T21:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 6101,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/74159.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dick75",
                "username": "Dick75"
            },
            "url": "https://myanimelist.net/reviews.php?id=6101"
        },
        {
            "content": "Tower of Druaga - the Aegis of Uruk is a medieval based adventure/fantasy anime , so U will see many fights , magic and different kind of monsters.\r\nThe story is not very innovative and it goes like this : In a far and distant land there is a kingdom called Uruk. The capital lies under a big tower , where the strongest enemy , Druaga , lives  . The king of Uruk , Gilgamesh , is a legendary hero who defeated Druaga 80 years ago . But for some reason Druaga is back to life and someone has to kill him again. For thatreason many fighters, called Climbers, are gathering in the capital and are waiting for the \"Summer of Anu\" , because the monsters get weaker , to start climbing the tower and reach the top floor, where Druaga lives (and of  course, our main characters are also climbers). The  reason they want to kill Druaga is the legendary treasure blue Crystal Rod, which can fulfill any wish. The summer has finally come and each party has started their journey to the top floor .....\\n\\n\\n\r\nThe main and supporting characters are divided into different parties and each one of them has their own reason for joining the party . Through the series , parts of the main and supporting characters lives (and their reason for joining the parties) will be revealed , but some of them will be left unveiled.\\n\r\nJil, the main character , is an inexperienced adventurer  , who joined the party to help Kaaya in her goal to get the blue Crystal Rod in order to \"cure her brother\" (of course that's a lie), but also to kill Drauga and save the people from the monsters . \\n\r\nKaaya, on the other hand , is a mysterious person , who doesn't want to reveal things from her past and has a hidden goal from which no one in her party knows. \\n\r\nOne more interesting character is Neeba . He's the older brother of Jill , but they are not in good relationship . He even fired Jill from his party. He, like Kaaya, has a hidden goal , and it'll play a vital role in the last fight against Druaga. Apart from Jill and Neeba's parties , some other parties will also get their \"time\" in the story and play their role in the fight to the top floor. \\n\\n\\n\r\nThe animation is average , typical for this kind of anime . The only change is that, from time to time , you get to see some computer animated enemies (3D) . The sound is also average , with many medieval themes, which can get a bit annoying after hearing them for 100th time . \\n\\n\\n\r\nIn conclusion , this is a good anime  , so I gave him 8/10 . Although it could be much better , and the story could be more innovative , it wasn't boring at all , so I enjoyed watching it. Since it's a two-season anime , there was no final ending , so some important questions are left unanswered. \\n\\n",
            "date": "2009-07-19T07:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 16941,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/67642.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/gravedigger",
                "username": "gravedigger"
            },
            "url": "https://myanimelist.net/reviews.php?id=16941"
        },
        {
            "content": "Honestly a pathetic anime. I rarely finish anime with , weak and EXTREMELY naive main characters but i decided to go with this one since I saw it had a sequel. If it looks bad now maybe it'll get better later...NOPE not at all. After the second episode i had to force myself to watch the rest based on the chance that I may be missing a good anime. I have now come to regret that decision. To me the premise of the premise of the entire show is flawed. If there was anything good about this anime, it was the first episode. I cansee this anime is tagged as a comedy...dont even bother to look for it after the first episode. Honestly of all the anime rated above a 7.00 on my animelist... if i had the power to erase one anime from existence, this anime would be it.",
            "date": "2014-10-25T23:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 166215,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4061859.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Darc-Charlie",
                "username": "Darc-Charlie"
            },
            "url": "https://myanimelist.net/reviews.php?id=166215"
        }
    ]
]