[
    [
        {
            "content": "The good: You don't need to watch the first season to follow the story. \r\nThe bad: The anime started with a score of 8.74 and ended with a 7.10.  If you watched the first season, you would feel a bit disappointed. Unlike the first season, this anime doesn't entertain because the story is weird and the pacing is average. For me, this anime is just an alternative story from the main series. \r\nDanmachi Sword Oratoria centers the story in Aiz Wallenstein, the sword princess. Sadly, even if Aiz is the main character, there isn't too much information about her past just some sporadic scenesand the plot centers on her desire of getting stronger. During her adventure into the dungeons, she fought with a person that could know more about her past, and she decides to go into the lower dungeon levels to find the truth. The plot has pacing problems and lacks more information to keep us entertained. \\n\\n\r\nWhile this anime follows the main idea of the Danmachi series, I feel that something is missing. Perhaps some characters aren't well developed and annoying to the point that we could get bored of them. The introduction of some characters is forced or useless, and there isn't enough time to develop their personalities fluently. Maybe the novel is different.  \\n\\n\r\nThe art is standard. Honestly, I was expecting to be better than the first season, but I can say, it is the same. \\n\\n\r\nAbout the songs, the OP is nice, and the ED is passable. The sound mix is good and focuses on the fights details. \\n\\n\r\nFinally, nothing is concluded, and nothing about Aiz is told, so in other words, the story failed to deliver any reasonable conclusion, it ends abruptly. It was just a promotion for the novel, buy it to find the truth.\\n\\n\r\nMaybe you will enjoy it more if you haven't watched the first season. If you are a fan of the first season, do not expect too much from this or you will get upset, it is just a spin-off.\\n\\n\\n",
            "date": "2017-06-30T18:00:00+00:00",
            "helpful_count": 140,
            "mal_id": 251584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6017253.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Pipe",
                "username": "Pipe"
            },
            "url": "https://myanimelist.net/reviews.php?id=251584"
        },
        {
            "content": "Producer 1: I'm hearing a lot of good reviews from fans about Danmachi, maybe we should think about a sequel?\r\nProducer 2: There isn't enough material for a full season, how about a spinoff?\r\nProducer 1: Aiz is really popular with fans, and we don't get to see much of her in the main series. We could make a spinoff series all about her!\r\nProducer 2: That's a great idea! And then instead of the spinoff actually being about Aiz, it could focus on some wimpy girl nobody cares about! We'll make Aiz an overpowered plot device instead! \r\nProducer 1: Uhh...\r\nProducer 2: Don't worry, the plot will berushed and won't make any sense either.\\n\\n\r\nProducer 1: ...",
            "date": "2017-07-03T00:26:00+00:00",
            "helpful_count": 48,
            "mal_id": 251809,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/madmaster5000",
                "username": "madmaster5000"
            },
            "url": "https://myanimelist.net/reviews.php?id=251809"
        },
        {
            "content": "Sword Oratoria... the spinoff, not second season, of the beloved DanMachi series. This time around, we're going to see the same story from Ais WallenWhatsit's point of view, at least, that's what I thought was going to happen...\r\nStory: In the first, or at least first few episodes, it should be clear that this is in fact the same story of DanMachi. However, instead of focusing on The Misadventures of Bell Cranel, we get to see a different side of things. This spinoff focuses mainly on the cast of the Loki Familia. Yes, the Loki Familia, not just Ais, which is very important to know.Originality: 0/1. I mean, come on now. It's like the author suddenly had second thoughts about the original story and how basic it was, so he created this spinoff to add a deeper meaning to everything, just centered around Ais' character. \\n\r\n      Potential: 2/2 Although reusing the same story, I'd say this had a lot of potential. It's kind of an interesting thing to see the same events occur from another character's perspective; especially the one (Ais) who has the biggest influence over our DanMachi protagonist. \\n\r\n      Execution: 3/7 :\\n\r\n-One of the biggest problems I think this show had was pacing. The first few episodes were a complete drag, and I felt like I was forcing my way through them. The only highlights of the first couple episodes were the moments when Ais came into contact with Bell. Having a slow introduction can really put a damper on the overall feeling of a series, especially one that only spans twelve episodes. I honestly didn't even somewhat enjoy an episode until we got to episode four. 3/12 is a fourth of the series. Not a very good start. \\n\r\n-I'd say this show really missed it's chance to focus on Ais as the main character. Hopping from her to Lefiya as a protagonist really put a damper on the story. Ais is a big part of the story, but the amount of screen time she missed out on was a sin. \\n\r\n-Another problem I had with this series that is a recurring issue from the original was the excessive amounts of fanservice shoved in my face. If Hestia wasn't your cup of tea, then Lefiya might make you drop the series all together. Her \"fantasies\" that I'm sure were supposed to be comedic were way over-the-top and completely unnecessary. \\n\r\n- The final episode made zero sense if you have any recollection of the original series and the order events played out. I'm not going to spoil anything, but there was an event that should have happened but didn't which was somewhat aggravating.\\n\r\n+ Even amidst all of these negatives, there were some positives. The moments that Ais came into to contact with Bell were just precious, as we got to see a different side to Ais than even Bell got to see. This was exactly what I was hoping for from the series, and I was just a bit sad there wasn't more of it.\\n\r\n+ The moments the series actually chose to intertwine Ais and the overall story were done pretty well. The motivation for Ais to become stronger is revealed. Best of all, we get to actually see the Sword Princess struggle with some of her battles. \\n\r\nStory overall score: 5/10. Although it wasn't very original, I'd say it had a lot of potential. It just chose to execute it in a way that wasn't exceedingly interesting. \\n\\n\r\nArt:\\n\r\n     Animation: 2/5. A pretty obvious step down from the original series. The fight scenes seemed far less intense. Their movements were sometimes rough. I mean, seriously. If the best animated scene from the series was taken directly from the original series, we have a problem. \\n\r\n      Art: 3/5 A serious downgrade, once again, from it's predecessor. The setting and scenery were fine. Nothing spectacular. In the scenes with less action the characters were occasionally drawn very sloppily, and it was pretty noticeable Nothing great overall, which is a shame because the first season had fairly decent art and animation. \\n\r\nArt score overall: 5/10 Obvious short cuts were taken, but some scenes were pleasing to look at. \\n\\n\r\nSound:\\n\r\n     Opening: 1/3. It's a pretty skip-able opening. Nothing spectacular, certainly nothing I'd want to listen to on it's own. It wasn't an opening that got me excited to watch the episode at all, although I guess it was an okay opening for a fantasy genre show. \\n\r\n     Ending: 0/2. This ending was just bad. Not only was it entirely skip-able, but it didn't even make me want to watch the next episode or convey the tone or mood of the show accurately at all. \\n\r\n      OST: 2/3. The original soundtrack wasn't anything particularly special. It had common fantasy instrumentals (you know the ones). There was one track that caught my attention, surprisingly, although it still wasn't anything I'd listen to out of context. The rest of the soundtrack did a decent job of conveying setting and the mood and/or tone of the occurring events. Not a lot of complaints here.\\n\r\n      Voice: 1/2 The voice actors of the main characters were pretty meh. Lefiya's voice was rather annoying and didn't really portray emotions well at all. Ais' actor was alright, but I feel like she didn't really conform to the character well enough. Side character voices were decent all around. I'm a fan of Bete's VA, and Finn's wasn't too shabby, either. \\n\r\nSound score overall: 4/10. Nothing spectacular at all, not that I really expected much. The OST was by far the best part for me. \\n\\n\r\nCharacter: Oh my, here we go. Buckle in, boys and girls, we're going on a bumpy ride. \\n\r\n     Design: 2/2. Not really any complaints here. Their designs are typical fantasy setting, and they're easy to tell apart. \\n\r\n     Enjoyable: 1/3. I did not really care for most of the members of the Loki Familia. I did enjoy watching Ais, Finn, and Bete, but that's unfortunately it. Lefiya might be one of the most annoying characters I have ever come across. I had to stop myself from rolling my eyes whenever she came on screen. No, that's not an exaggeration. She was that bad. At least the moments with Bell and Ais were fun to rewatch, as were the moments when Ais was fighting. Otherwise, the remaining characters were mostly boring. Although, I have to give it up to that perverted Goddess, Loki. I did enjoy the scenes where she actual showed that she was a pretty cunning woman. \\n\r\n      Development: 1/5. \\n\r\nShall we break down why?\\n\r\n-Lefiya: Oh, hello there Bell 2.0. Lefiya is literally the \"Can I copy your homework?\" meme. I mean, not that another Bell would be particularly terrible, but she was just so much worse. Honestly, combine Bell and Hestia and add in zero character development and an exceedingly annoying personality and voice. There. That's Lefiya. Perhaps the worst choice of a main character they possibly could have picked. I can't even remember if she was in the first season or not. Not to mention the most annoying aspect of her: It's stated that she's already has the power of a Level 3 Adventurer, but she's /too scared to do anything/ on the battlefield.\\n\r\n-Ais: The only reason this got a measly point. I was so glad Ais got at least a tiny bit of character development. Like I've stated previously, the amount of screen time she got was a sin considering I thought this entire season was going to be following her story. But we got her motivation to become stronger, we saw some fights where she did struggle and wasn't some OP God being, and best of all we get to see that she seems almost somewhat envious of Bell (who is developing so quickly). We see the reason as to why she agreed to train him in the first place, and that he's actually motivating her at the same time. Still no drastic changes in character, but it was a start.\\n\r\n-The rest of the cast: Not really any development here. Tiona and Tione were pretty static the entire way through. Although Bete, Finn, and Riveria were enjoyable to watch, they didn't change much, either. I will mention Filvis,though. As a new character introduced in this series, I found her pretty interesting and she did get some development. Still, not much.\\n\r\nOverall character score: 4/10. Even though they have decent designs, over half of the characters were not even enjoyable to watch, and this series was seriously lacking in the character development department \\n\\n\r\nEnjoyment: 5.5/10. Despite there being countless flaws to this spinoff, I did kind of enjoy it. If I hadn't watched the original series I definitely would not have enjoyed it as much as I did. \\n\\n\r\nOverall: 5/10. Although this series can be watched on it's own, if you haven't seen DanMachi, you'll probably enjoy this even less than I did. If you didn't like the original season, definitely steer clear. However, if you're an avid fan of DanMachi and are eagerly awaiting a true second season, I'd say you should watch it. It gives a different perspective and a deeper story to the events that occurred in the first season. I haven't read the Manga, so I'm not sure if the storyline here will be necessary to know if we ever do get a true second season, but if you're a fan of Ais WallenWhatsit, you'd probably enjoy this show at least as much as I did. Keep in mind that the latter six episodes are much better than the first six. Or, more enjoyable, at least. \\n\\n\r\nThanks for reading~\\n",
            "date": "2017-07-01T08:11:00+00:00",
            "helpful_count": 45,
            "mal_id": 251644,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6352101.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/FullmetalFate10",
                "username": "FullmetalFate10"
            },
            "url": "https://myanimelist.net/reviews.php?id=251644"
        },
        {
            "content": "Honestly I really like Danmachi season 1 featuring Belle. Im pretty sure all of you did. But this is my personal opinion and I really dislike lefiya, just overall the way she acts the useless ways she is portrayed kinda pisses me off. When i first saw the release date for the new Danmachi I was really excited for a season 2 of one off my favorite fantasy animes, but when i realized that this was from the point of view of Ais I was kind of dissapointed. Im pretty sure alot you wanted to see a development in a season 2 where we areable to see Bell the main hero to progress further, but even with that in mind i was fine with having a season 2. But after watching the first episode and encountering one of the \"main\" characters Lefiya I immediately started to realize how FUCKING ANNOYING she was. The story was alright and the fact we got to see Dan machi from Ais's view was ok, but the characters really threw me off this season.",
            "date": "2017-05-09T10:59:00+00:00",
            "helpful_count": 45,
            "mal_id": 247290,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6230659.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Melvinthenigga",
                "username": "Melvinthenigga"
            },
            "url": "https://myanimelist.net/reviews.php?id=247290"
        },
        {
            "content": "if you liked Danmanchi you probably still won't like this. The story isn't important because it's the same thing every episode. the main character gets herself stuck in a precarious situation and gets saved by the amazing Aiz Wallenstein. the main because so indebted and obsessed with Aiz she follows her around everywhere she goes and buys her stuff regardless of how rare or expensive because the sword princess is that important. the plot armour is tolerable at least as we get into fights the viewer doesn't really care about each episode.\r\nthe art is ok. I mean it has to be if it's mostly fighting.\r\nthesound is also ok  but nothing to praise.\\n\\n\r\nthe characters are either garbage or annoying. we have the great Aiz Wallenstein the girl with no personality yet everyone loves her. she is only good for fighting as she throws herself into fights even when told not to. we have our main character Lefiya which follows Aiz around like a lost puppy as she is weak and hopeless on the battlefield but don't worry like previous main character bell she has something special about her and has a ton of untapped potential.  who cares about the rest of the characters, they're side characters they can't be much better.\\n\\n\r\noverall i give this show a 3/10. crap characters, crap story but good fight scenes (that's all it has going for it). things look like they might change pace next episode but they probably won't. unless you're a completionist or someone who just a good fight skip it. and danmachi fans unless you like Aiz (i don't know why you would) you're not going to learn anything you care about.",
            "date": "2017-05-14T12:17:00+00:00",
            "helpful_count": 31,
            "mal_id": 247662,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5049264.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/BlueEclispe",
                "username": "BlueEclispe"
            },
            "url": "https://myanimelist.net/reviews.php?id=247662"
        },
        {
            "content": "Is a spinoff of Danmachi with an alternative view focusing on Aiz, one of (for LA at least) the least interesting harem members to be given a spinoff series a good idea?.\r\n...Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria is an interesting yet odd spinoff from the many many MANY sequels and spinoffs anime to come out of Spring 2017. LA wasn't exactly clamoring for a spinoff based on Aiz as LA is one of those fans of Danmachi wanting just more from Bell and Hestia than to Aiz though this spinoff looking at an alternative view ofhow events occurred in the original is a nice touch in a ways.\\n\\n\r\n<LA breathes in>...Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria's characterization is focused towards Aiz as well as Lefiya Viridis voiced by Juri Kimura a fangirl of Aiz, though Lefiya is more as a similar Bell but with a similar motive of wanting to protect others by leveling up in this case trying to catch up to Aiz as well as worshiping her. Aiz on the other hand has character development in terms of her backstory and how this links to the major villain of this spinoff. This at least is interesting and gives us depth to one of the least interesting harem member of Danmachi. Aside from that, other characters are typical supporting characters with some personality to them as well as fleshing out the Loki Familia as a Guild from Bete Loga voiced by Nobuhiko Okamoto the hair-tempered berserker, Tiona Hiryute voiced by Rie Murakawa and Tione Hiryute voiced by Minami Takahashi, Riveria Ljos Alf voiced by Ayako Kawasumi and Loki voiced by Yurika Kubo the perverted leader of the Familia, which by the end of it, the majority of the supporting characters got fleshed out better than Lefiya did, especially showing us that Bete isn't the asshole jerk character or showing the Hiryute twins and especially Riveria a glass cannon badass mage and LA's favourite character in Sword Oratoria. \\n\\n\r\nNow because this spinoff is having plot beats following the original, this spinoff does have some new material, that one being an interesting plotline that involves Aiz and the major villain, her plans and is probably the only interesting plotline to all the new things Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria does as it integrates both the Gods and behind the scene dealings to connecting to Aiz's past and her dilemma about being a powerful swordswomen and what her connection to this plotline has on her. The rest of the plot elements especially the slice of life are kinda a bore to constant running gag annoyance with fanservice moments any chance it gets and is just a guise for the build up and hinting to the plans of the major villain is focusing on, something even it's original somehow did quite well (albeit the original's major villain never springs into action or goes anywhere as it's a more focused look at Bell's progression to be a better adventurer, where in this spinoff, the major villain is a HUGE focus and takes a somewhat more serious take compared to the original). \\n\\n\r\nProbably one of the biggest gripes Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria does is on Lefiya as a character, at first she's the fangirl wanting to be like Aiz and is a shy one at that, but by the end of the anime, she becomes a vindictive psycho lesbian wanting Aiz all to herself (slight exaggeration but the anime frames Lefiya like this and it crosses the line out of comedic effect) and sees Bell as competition. Either way, Lefiya's portrayal at first was pretty good and especially when revealed she like Bell is a pretty powerful magic user under that timid nature, but due to her static nature and never evolving or developing outside of these traits, she becomes a character LA would not root for or care one iota about. The only other character annoyance comes from Loki who does the entire yuri groping thing to Aiz or any big-breasted woman -sigh-. The only other lacking aspect Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria doesn't have compared to the original is the aforementioned slice of life moments that feels more like build up than progressing with the plot, to it's defense due to this plot simultaneously coinciding with it's original, it's kinda hard to add good flow to the plot when it needs to abide by it's original series but then LA can counter it by saying it turns into chess piece story telling with \"some\" substance to it and by LA sees by this later down the anime aside from a few new character development from Filvis Challia voiced by Hisako Kanemoto and Lulune Louie voiced by Hikaru Akao and a bit of world-building through Loki, it's chess piece storytelling using the original series as it's crux and the major villain egging Aiz on to be stronger or go here or there doesn't help.\\n\\n\r\nIn terms of animation by JC Staff, the animation overall is ok enough though there are some dips in quality at times and although the anime is rehashing moments from it's original, LA is glad they just didn't copy and pasted it just like that and given us differing perspective of certain events. The battles once again are a standout but again also takes dips in quality at times to. The character designs are polished to a certain level of detail and has the detail to be similar to it's original, typical of a spinoff in a ways, LA isn't complaining. Overall, the animation is ok enough for LA to neither rage or a praiseworthy mention about.\\n\\n\r\nIn terms of voice acting, the voice acting is typical fare only with the hugely expanded voice cast. Saori Oonishi as the stoic emotionless Aiz is meh in LA's opinion but she \"tries\". Juri Kimura, well LA is gonna compare her to Satomi Arai as Kuroko and say that she's not as bad, but she can get annoying when in obsessive fangirl mode and here's the thing, LA actually enjoyed Satomi Arai as Kuroko even at her worst of times, Juri Kimura as Lefiya has her annoying moments but LA is more or less projecting with this criticism. But once again, like the animation it's ok enough for LA to neither rage (a bit) or praise about. LA's favourite voice actors would go to Rie Murakawa and Minami Takahashi as the Hiryute twins AS well as Ayako Kawasumi as Riveria.\\n\\n\r\nSo Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria has a few problems with it's plot beats, some character annoyances and annoying fanserviced slice of life moments but does that mean even with it's saving graces of an interesting yet serious plotline and alternative look at similar events from the original means it's a good spinoff???...for that LA says that this spinoff is an interesting case of trying to be like it's original while at the same time whistling to a different tune, Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria is that it's not great but it's not bad either as it expands the world building of Danmachi, however if comparing to it's original, it feels a bit of a step back from it's original series, not from it's differing atmosphere and characters as even atmosphere had times where it fitted into the serious nature of the major plotline of the major villain of this spinoff and certain outside of Lefiya like Filvis, Bete and Riveria got their limelight moments but because it's trying to emulate it's original while doing something completely different instead and it does work to an extent but it's blunt execution of chess piece storytelling deterred LA from liking this spinoff as much as LA wanted to.\\n\\n\r\nDungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria, your not a bad or horrible of a spinoff but your definitely one of the more unremarkable spinoffs LA has seen.",
            "date": "2017-07-01T05:14:00+00:00",
            "helpful_count": 17,
            "mal_id": 251628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=251628"
        },
        {
            "content": "DanMach Gaiden - Sword Oratoria is a japanese anime produced by studio J.C. Staff and is based on a Light Novel of the same title.\r\nThis is a side story of the original DanMachi, and this review will contain comparisons from the original show, meaning that I presume the reader has watched it.\r\nStory: 5\r\nThe story revolves around... What does the story really revolve around? Our original thoughts about the show was that it would be about Aiz and see things from her perspective, but this is not true for the most part. \r\nWe instead follow an array of characters through an array of events, and someof them are the exact same events and frames that were used in the original. \\n\r\nThe show can basically be summarized into 5 points:\\n\r\n\"The main plot\" being something mysterious with wild plant monsters.\\n\r\nAiz' backstory or something similar.\\n\r\nLefiya getting stronger mentally.\\n\r\nShared frames to original to show where the show is on the timeline.\\n\r\nFanservice.\\n\r\nThe first 3 are obviously the main plot, while the second 2 are pretty much filler material.\\n\r\nNothing stands out as exceptional, and quite a bit of it is low quality.\\n\\n\r\nArt+Animation 5\\n\r\nThe animation in this show is pretty generic, ranging from character design to monsters and ambience. While it's not terrible in any way, it's definitely not good, and this is year 2017 - if the animation is bad, other parts DEFINITELY have to make up for it. Onihei is a decent example for this.\\n\r\nIf anything, the art has declined from the original, pointing at a question: Is the budget for this show lower than for the original one?\\n\\n\r\nSound: 5\\n\r\nThe sound is pretty similar to the art/animation. There are no impressive OSTs, and the OP/ED are both quite bland. There is nothing wrong with character voices, the characters are just not interesting enough to really be able to call it more than decent.\\n\r\nI have to lower the score a bit more due to how badly composed the OSTs are, especially in and between fight scenes.\\n\\n\r\nCharacter: 4\\n\r\nHere's a core problem of the show. The original story had most of our current \"main crew\" as situational SUPPORT characters who showed up in a couple episodes. The only above average characters we currently have are Aiz and Loki, but since they don't receive the screentime of a \"real MC\", they don't pave the path for this show either.\\n\r\nThe design for our \"main crew\" is very fitting for the word support characters. Lefiya (MC?) is a completely useless character who will probably save the day in a future episode, the problem is that: Bell Cranel from S1 had the vibes and screentime of a REAL MC even if he wasn't too great. Lefiya does NOT have any of these traits, and feels more like a target for future plot armor. \\n\\n\r\nEnjoyment: 5\\n\r\nI would originally have posted a worse score here, but the last part of Ep4 caught me slightly by surprise, I will have to keep looking and see if they progress it into something good.\\n\r\n1 good or interesting scene is not enough to instantly sway me on my score, especially since EVERY SINGLE SCENE prior to this has been low in quality.\\n\\n\r\nOverall: 6.8\\n\r\nAlthough the overall score definitely does not add up to the other numbers, this is the \"value\" of this show if compared to other scores on MAL.\\n\r\nThe show definitely beats everything around 5-6.5, which means that giving it a ranking according to my scores for its' attributes would be unfair. It would also be unfair to give this show higher rankings for its' content than it deserves, thus I only raised the overall ranking.\\n\\n\r\nIs it worth a watch? I don't know yet. \\n\r\nShould I watch this if I haven't watched the original? - I believe the original beats this in quality, so watch that INSTEAD.\\n\r\nWill update this review at 8/12 episodes.\\n",
            "date": "2017-05-10T05:08:00+00:00",
            "helpful_count": 15,
            "mal_id": 247347,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5913422.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tyiriel",
                "username": "Tyiriel"
            },
            "url": "https://myanimelist.net/reviews.php?id=247347"
        },
        {
            "content": "Better wait for the return of Belle and company. \r\nAiz is a boring character to be the main in a complete season. \r\nIt doesn't matter the amount of fanservice that is forced upon the viewer, it won't compensate the lack of character development and plot. \r\nThe Loki Familia are a really boring cast to root for, since they're supposed to be one of the strongest Families in the series, there's no hardships for them to endure.\r\nThe only glimpses of hope for this side story, are the scarce moments when it entwines with the main story, but since this moments where already shown in the firstseason they don't have the same impact as the first time. \\n\r\nIf you like the first season, YOU WON'T ENJOY THIS BORING SIDE STORY. \\n",
            "date": "2017-05-28T00:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 248699,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3488541.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/DaRoF",
                "username": "DaRoF"
            },
            "url": "https://myanimelist.net/reviews.php?id=248699"
        },
        {
            "content": "I originally didn't want to watch this series after I realized it wasn't actually the second season of one of my favourite fantasy animes. But I gave it a chance, and I'm sure glad I did. Let me quickly tell you why.\r\nThis anime follows Ais' story, which goes on in the same time period as the first DanMachi series. It isn't a retelling of the first DanMachi and it isn't the continuation. It's something new (story-wise) but familiar (setting-wise/the big picture). It ended up providing valuable information to flesh out some characters that weren't explored too in-depth in the first DanMachi, and giving a newviewpoint on the same oncoming disaster that was hinted at in the first DanMachi. Even if you had regarded this anime as a stand-alone, it is really good and really interesting. \\n\\n\r\nLike in the first DanMachi, this anime has a well developed plot—good pacing, good foreshadowing, and it effectively shares information (about events, characters, etc) without it seeming fake or boring. In this way, characters are developed naturally. And about the art—of course, it is a favourite aspect of mine (I love DanMachi art). \\n\\n\r\nOverall, it was really fun to see Ais' perspective and to learn about where she came from and to watch her develop. She became more than that beautiful human doll I was introduced to in the first DanMachi.\\n\\n\r\nIn essence, I recommend watching this show—especially if you liked the first DanMachi. Even as a stand-alone (like I said) it's a great show.",
            "date": "2017-07-05T08:37:00+00:00",
            "helpful_count": 6,
            "mal_id": 252013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5721303.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Annanyanya",
                "username": "Annanyanya"
            },
            "url": "https://myanimelist.net/reviews.php?id=252013"
        },
        {
            "content": "TL;DR Section at the end of the review. This review may or may not contain minor spoilers.\r\nI'd like to preface this review with saying I general don't review sequels or side stories, because you'll find me usually saying it was as enjoyable, slightly less enjoyable, or slightly more enjoyable than the first or original story. This show has forced me to turn it into an exception.\r\nDungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria (which is a goddamn mouthful), better known as DanMachi: Sword Oratoria, is a spin-off side-story that shows the main story but from a different perspective. Who's perspective?The Loki Familia's, but more importantly from Ais' perspective.\\n\\n\r\nThe entire idea of the show started out well, being able to see things from how Ais saw them, but it very quickly degraded into watching Lefiya be the worst tsunyuri girl ever, every episode. For one reason or another, they thought Lefiya's \"I have great potential but currently am fucking useless\" mixed with \"I love and look up to the girl that's my senior/hero\" was going to end up with a good character. They could not have done worse with her. The constant naivete coming from Lefiya, the constant whining, the constant not being able to do anything remotely useful (until the very end), and the constant frustration that she gave me as a viewer was just horrendous. She alone destroyed the fun that this show could've given me.\\n\\n\r\nOn the topic of characters other than Lefiya who is probably one of the worst this year alone, every other character has the emotion or depth of a fucking brick, which is painfully tough and flat as an airway run strip. Ais continually acts like a robot whilst showing very little emotion, the twins are just there to be supporting characters and don't ever break that trend, Bete is an angry dick, and the three seniors are all very stiff. Loki probably portrays the most emotion, going from trying to cop a feel on anybody, to somewhat serious on certain matters. The best part of this show was seeing Bell and Hestia, which is just painfully ironic in this scenario.\\n\\n\r\nThe story revolves around Ais and the Loki Familia and how Ais goes from being mistaken as her mother to some darker things that may bring the world to ruin. Or something like that. The story in all actuality was less important than they made the character interactions out to be, and those as previously mentioned was like watching paint dry for 12 weeks. Other than some new characters that you can only see through Ais's perspective, Sword Oratoria was made out to be far darker than the original story from Bell. This didn't play out well because the original story did well as a lighthearted fantasy/adventure show. The story was like watching an extremely convoluted game of Clue with DanMachi characters, and then some fighting instead of guessing who the killer is.\\n\\n\r\nOne of the redeeming features of Sword Oratoria was that the art and animation were at least somewhat pleasing to look at in some situations. Some fight scenes were nicely done, some nice screenshots to be taken, but it never went up and beyond the \"average\" level that it had maintained through 12 episodes. The soundtrack was so laughably forgettable that I can't even really make a remark on it anymore in terms of whether it was good or not. \\n\\n\r\nTL;DR: DanMachi: Sword Oratoria is a waste of 12 episodes that could've been put towards making a second season instead. All you'll get from this is how much you realize Bell and Hestia were the best part of DanMachi, and how the characters in this are painful to watch. I would not recommend this unless you really don't mind how awful the character and story are.\\n\\n\\n\\n",
            "date": "2017-07-01T16:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 251690,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5078535.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/deathline",
                "username": "deathline"
            },
            "url": "https://myanimelist.net/reviews.php?id=251690"
        },
        {
            "content": "This is my first review and I'll keep it simple.\r\nThis anime is a chore to watch. The only reason I find myself watching this anime is in the hope that I'll find a scene with Bell from a different perspective.\r\nThe art work is much the same as the first season and the sound is fine as well. However, what really ruins this anime is the story and the characters. The story so far is lacklustre and cliché, the usual; some bad guy doing something bad. But the characters are incredibly annoying. The main character Lefiya is constantly whining and following Ais around like a lapdog, she continues wanting to become stronger, to not to let her group down but every episode she is constantly screwing up and being saved. The rest of the characters have little depth and Ais is much the same in the first season however she gets much more screen time but still lacks any development.\\n\\n\r\nTo summarise, DO NOT WATCH THIS ANIME. It's a waste of time, extremely hard to enjoy and lacks the charm of the first season. Even if the anime succeeds in gaining a third season, as this is a prequel, I doubt it will impact your understanding or enjoyment of the next season.\\n",
            "date": "2017-06-03T06:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 249179,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/jab1907",
                "username": "jab1907"
            },
            "url": "https://myanimelist.net/reviews.php?id=249179"
        },
        {
            "content": "This is a alternate story line, I repeat this is not a season 2 of the show. Although season 2 will be coming out soon. Don't expect this to be as comical as the first season either, it has a more serious tone to it (should've read the genres).\r\nThis is backstory for the \"Sword Princess\" or better known as Ais, it offers her day to day interactions with her familia and how she also meets Bell in her point of view and what she thinks of him. The story also revolves around another character not given a lot of screen time in the main series,Lafiya, to me personally comes off as annoying and useless, she also has a lesbian side to her when she talks to or about Ais she seems a little too fond of her. This season was meant to capitalize on the character development needed for many of the supporting characters from the first season, Ais is a quiet person who doesn't talk much, and is bad at expressing her feelings through words and often , comes off as dull for the most part. Lafiya was barely even mentioned, and her interactions did seem pretty random but this side story really helped explain the trouble that seemed to revolve around Ais. It also makes you appreciate the side characters much more.\\n\\n\r\nStory: 7 The story was weak compared to the main stories, it was a little all over the place, but it did offer explanations the main story didn't and had a nice pacing\\n\\n\r\nArt: 8 Well done like the first season\\n\\n\r\nSound: 7 I watched the dub and very much enjoyed the voice actors chosen, the music was also pretty good\\n\\n\r\nCharacter: 8 This side story offered a lot of character development that the main story didn't, and offered a new perspective of the importance of the supporting characters\\n\\n\r\nEnjoyment: 3 I knew this wasn't a season 2 of the show but I was expecting it to have the comedic side which is what made me really enjoy the first season, and I thought I would see Bell a lot more too, the show was too serious for my taste, and even in the parts that were supposed to be funny I didn't even laugh all that much\\n\\n\r\nOverall 6.6 but we'll round it to a 7",
            "date": "2018-05-20T08:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 280996,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5380347.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/STROKEMEFASTR",
                "username": "STROKEMEFASTR"
            },
            "url": "https://myanimelist.net/reviews.php?id=280996"
        },
        {
            "content": "So i started this series not all that excited after seeing the first one. While i thought the first one was fun and all it just couldn't get my attention that much.  But overall i did enjoy the first season and gave it a pretty good review besides the fact of it having an OP character and almost up to terms of what could be called a harem \r\nThis is kind of the same season kind of holds the same opinion as the first one. \r\nWhile in my opinion overall better than the first season it was kind of hard to keep my attention.It doesn't really suffer from the same problems as the first and i'll get into the problems in a minute.\\n\\n\r\n~~ Spoilers ~~\\n\\n\r\nGonna try to keep away from the actual story\\n\\n\r\nLefiya: First let me start out by saying that for some weird and unknown reason instead of having the entire story be focused on Ais and herself. The story decided to add a new character named Lefiya. She is a very not needed character. Because she is in this we now have two main character Ais and Lefiya. \\n\\n\r\n Lefiya isn't a bad character in my opinion. But she is more of a side character that is in the main character group. All throughout the entire series she has a crush on Ais. This in it's self isn't bad idea but the way they did it was not good. A lot of the time she can come off as annoying as she fantasizes over the two of them going out. Overall she doesn't add anything to the plot and takes up space that we the audience would rather be spent on Ais.\\n\\n\r\nAis: Had really always been the most interesting character from the start. So when i found out she had her own season with her as the main character in the story. Too the stories credit it does give a good story and everything too Ais. I wish that the story focused more on her. But overall it was fun.\\n\\n\\n\r\nSomething that always bugged me in the first season it had always bugged me that Bell ( MC ) Is super powerful and has these amazing skills never before seen. The entire time i was wanting him to not reach his goal of reaching the power level of Ais. I felt like it would be more interesting for Bell too find out that not everything can happen like he wants. Thankfully in this it kind of elevated my frustration with that. It shows that Ais is still more powerful and is likely to get more powerful and stay like that.\\n\\n\r\nSomething else that bugged me of the first season was that there was signs of it becoming a harem. Harems are a cancer to stories and annoying. Through out the first season it at times seemed like Ais would be in the Harem. But in this Ais doesn't even seem interested in him. She seem's more interested in being more powerful and spending time with her friends. \\n\\n\\n\r\n~~ SPOILERS OVER~~\\n\\n\\n\r\nIn the end this was something i enjoyed more than the original  even with it's flaws. Would recommend watching the first season first than this but it's not needed.",
            "date": "2017-09-22T21:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 258331,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=258331"
        },
        {
            "content": "Ah, Danmachi.  With the harem/fantasy show’s legacy leaving behind such wonderful memes about its busty loli goddess heroine like the famous boob ribbon and ‘Hestia is Bestia’, it’s no wonder the show had a tough time having a complete positive footing in the anime community due to various aspects about it like its multitude of female characters wishing to breed like rabbits with its main protagonist.  So how can you make a show like that into something that’s similar, but objectively better in comparison?  Well, for starters you could follow the source material.\r\nStory: Sword Oratoria is the Danmachi story shown from adifferent perspective.  Instead of following the adventures of the Hestia Familia with Bell and his journey to become adventurer that he wanted to be, we follow the story of the Loki Familia and its sword princess, Ais Wallenstein, as she and those in her familia unravel the truth of strange going-ons in the dungeon and uncover a darker plot happening in the town or Oratoria.\\n\\n\r\nIn contrast, the story of Sword Oratoria is a more serious take on the fantasy dungeon story of Danmachi, as it features an overarching mystery plot that those in the Loki Familia attempt to uncover as stronger and more bizarre monsters appear both in the town and in the dungeon.  As such, the plot feels a lot more serious and more involved, as the story shifts from a generally lighthearted adventure involving a boy climbing his way to the top, to that of a slightly darker story featuring a girl coming to terms with some of her demons from the past.  The overall plot just feels better written due to the fact that it feels like there’re consequences and that there truly are stakes to be had.\\n\\n\r\nIf that were the case, then we’d have no problems.  Unfortunately, the story falls flat on delivering that darker and weightier atmosphere that the story at first glance seems to promise.  A lot of the heavier and more gruesome moments from the manga are absent, and instead we’re treated to the fangirling delusions of an elf mage desperately trying to monopolize the full attention of the sword princess.  While the story is objectively better from a tone standpoint, the actual content of the series is littered with random moments of our new character Lefiya attempting to be what appears to be a shoddier attempt at being another Bell.  This results in a lot of tonal shifts that draw away from the impact of the main plot, thus not only making things a lot less dire, but also making the new character we’re supposed to support, a lot less appealing to the audience.\\n\\n\r\nThe ending is a culmination final standing point for progression to the next point of the series.  It’s an ‘ending point’ that only finishes the first part of the story that seems to be real final stakes moment, but doesn’t really feel that way when you look at everything before it.  Arguably it’s not a terrible ending, but when put alongside the journey to get to that point, things could be better.\\n\\n\r\nOverall, Sword Oratoria, while considered to be a better story due to the show’s more serious atmosphere involving character exploration and some disturbing aspects about the dungeon that weren’t mentioned before, still falls in its own pitfalls and makes unnecessary sacrifices that resulted in the show feeling less impactful and slightly more irritating to watch.  Simply put, if we cut out all of the fluff involving Lefiya’s obsession over Ais, this would’ve turned out a lot better.\\n\\n\r\nOverview:\\n\r\n+ Different and better viewpoint of the Danmachi story\\n\r\n-  Sacrificed emotional weight for less important fluff aspects\\n\r\n-  Changes from source material suffered\\n\\n\r\nCharacters:  Instead of Hestia, Bell, and the rest of their familia, we’re treated instead to Loki and the expansive (and well equipped) myriad of misfits that she has managed to raise and grow.  \\n\\n\r\nOf course, if you’re talking about someone in the Loki familia, you have to talk about Ais Wallenstein, the mysterious female swordsman that Bell idolizes after she saved his ass.  Several times.  While shown to be a cool and collected girl in the original Danmachi, Ais’s character really shines through in Sword Oratoria as its main focal point.  We’re given a look into her past and her own internal struggle, pushing her away from the idealized sword princess that everyone treats her as, and instead as someone who feels more human and wants to improve based on her current state when we’re introduced to a different side of her character.  We also get to see her interactions and opinions about Bell in a different light, and it’s really refreshing to see who I thought initially was a boring character become something that had more to her with each passing episode.  \\n\\n\r\nThen…Lefiya…  I’ll be honest; I don’t like this girl.  Lefiya is what I would describe to be everything that’s mostly wrong with this adaptation.  The show initially treats us to her as a compatriot of Ais, as the two of them are in the same familia and are often put on the same team together.  Her entire character can be described as a low level mage who looks up to Ais and wants to be looked at and praised by the sword princess.  However, what sets her apart from a certain rabbit boy is the fact that the show goes so far with her wish that it becomes uncomfortable.  When she’s not busy getting her ass saved by everyone around her, Lefiya spends a good portion of her screentime fantasizing about spending time with Ais to almost disturbing levels. It takes away any potential screentime to be dedicated to the main plot, and it detracts any likeable characteristics that this girl may have had in the first place because obsessive jealousy is not a cute characteristic.  \\n\\n\r\nAside from these two, the rest of the screentime is split amongst more commonly known members in the Loki Familia including Loki herself, some new additions to the cast, and a couple other known characters in the series that don’t get as much as a role since they’re not all that important to the story of Sword Oratoria.  In terms of development, the majority of it is dedicated to either exploring the inner workings of the Loki Familia itself and how its members interact with one another, and some of the stories of the new additions to the cast that we’re given.  I lot of it really is more akin to world building, but that really doesn’t serve as much of a problem since it only furthers expand the world and the kinds of people within the world of Danmachi, which is always a nice little extra to have.\\n\\n\r\nOverview:\\n\r\n+ Ais’s spotlight develops her well\\n\r\n+ Side cast aids in providing more of the world to the audience\\n\r\n-  Lefiya’s apparent obsessive personality.\\n\\n\r\nArt:  Made by J.C. Staff, the art for Sword Oratoria is the same quality as the original Danmachi.  The colors and animation is clear, colorful, and evokes a bright adventurous feel, the action is fluid enough for it to seem like a good enough fight scene/rpg battle for those in the viewing audience, and things are pretty consistent throughout.  It’s standard fare, nothing too amazing or anything worth getting excited over.\\n\\n\r\nSound:  Similarly, the soundtrack isn’t something that’s worth really writing home about.  The OP is cheerful and adventurous sounding, but nothing that memorable or special.  Its ED ‘Day by Day’ on the other hand is a more laid back piece that completely contrasts the supposed more serious nature of the show.  It’s a decent piece, and worth a listen to, but not really something that I’d personally give too much thought on.  \\n\\n\r\nPersonal Enjoyment:  A lot of things I’ve heard from the grapevine about Sword Oratoria is the fact that it was collectively renowned as a spin-off that is superior to the main story.  Poking through it, it certainly was of better quality at least story-wise, as had a much more involved story with aspects that the original was simply lacking.  This adaptation however wasn’t dressed to impress.  While maintaining a slightly more serious tone, Sword Oratoria always felt like it was missing something, and the struggles with the characters in their fights felt too easy when compared to the scale of the creatures they had to fight.  (This ain’t some tiny Minotaur anymore.)  Needless to say, while I really hoped the adaptation met the expectations of the original, it’s unfortunate that things didn’t really turn out that way in the end.\\n\\n\r\nDid I like this series?\\n\\n\r\nDespite that, I did enjoy the series…relatively.  Aside from the depth with Ais’s character, I really liked what they did with Bell and how they showed parts of his journey in the original story from Ais’s perspective.  It’s strange to say, but I actually liked and felt a lot more involved with Bell’s story when the camera wasn’t focused on him.  \\n\\n\r\nWhat didn’t I like about this series?\\n\\n\r\nLefiya.  Lefiya wasn’t like this in the manga, so the upped ante with her admiration for Ais to an almost disturbing, creepy, and downright mean-spirited nature towards anyone foreign who’d want to so much as talk to the sword princess was definitely not an aspect that I was a fan of.\\n\\n\r\nWould I recommend this series?\\n\\n\r\nIf you’re an anime Danmachi fan who chooses not to touch or read any of the source material, than this is probably the show for you.  The contrasts between the source material and this adaptation would make anyone who came from the manga side definitely unhappy.  Despite that, the series still keeps many of the story’s aspects intact, and is still what I would think to be a much better version of the story simply because the core aspects of it are centered more on a centralized story and characters, rather than just one character like the original. \\n",
            "date": "2017-07-01T14:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 251678,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=251678"
        },
        {
            "content": "Premise and intro \r\nDungeon Ni Deai Sword Oratoria is a spin off anime that is adapted from the manga of the same name and tells the story of the original story that is shown through the eyes of the Sword princess Ains Wallenstein, her comrade and fellow familia member Lefiya and her fellow familia members. While largely following the events of the main anime series this anime also adds in events that Ains and her friends faced in that time frame. \r\nStory overview \r\nThe overall storyline for Dungeon ni Deai Sword Oratoria largely follows the events of the anime that this anime was spin offfrom but tells the events of that story through the eyes of Ains and Lefiya and other members of their familia. While largely following the original storyline this anime also adds in several events and story arcs that are unique to Ains and Lefiya. In common with modern anime storytelling methods the overall plot of the series includes a number of sub plots and arcs that are intermingled with the main storyline. The Main focus for the series’ main storyline is on two points which is the evolution of Ain’s personality so that she becomes more human and less cold and for Lefiya it’s to master her fear while also developing her skills as a mage. \\n\\n\r\nAins \\n\\n\r\nAins Wallenstein voiced by veteran seiyuu Saori Oonishi of Clockwork Planet and Denpa Kyoushi fame is one of the main characters of the series and is one of the two heroines in this series. An adventurer of some renown within the world Ains is known as the sword princess to her both her fans and to her fellow familia members for the simple fact that she is both beautiful in appearance and deadly with her blade. Notably Ains develops two different personalities as the series progresses which also serves as one of the main points of the series story. In the beginning of the series Ains was a quiet person that while skilled in combat and having a determination to both win battles and glory for her familia did not interact much with her familia and its members. Though clearly idolized by the younger members of the familia and respected by the more veteran members Ains at this point seems to be content with being quiet and as such she was hard to approach by anyone and not someone that many within the familia got to know well though not from a lack of trying. As a result of putting up walls around herself Ains can be somewhat naive with her manners and how she reacts to situations such as her struggle to apologize to Bell during her arc. \\n\\n\r\nAs the series progresses however and as a result of interacting more with her friends and fellow familia members especially Lefiya and the twins Ain’s personality starts to change as she starts to open up her personality. Though she doesn’t exactly become more talkative Ains becomes more sensitive to the feelings of others and more understanding of the people around her. More importantly she also began to be more trusting and willing to place her trust in her allies and friends in the familia as well. I felt that Ain’s development from a beautiful but unapproachable warrior to one that was obviously more happy and positive and trusting was done pretty well and it was nice seeing Ains be able to interact more with her fellow familia members. After all, in such a group if you are unable to trust someone with your back in combat then that person is a liability no matter how powerful they are on their own. One of the main plots for the series overall storyline is related to Ains past which I felt was quite interesting and helped determine why Ains personality was like that to begin with. It also explained why Ains is so determined to become strong as well. The character of Ains and her subsequent development as a character in the series I felt was done pretty well and it was nice that Ains at the end was able to have more trust in her allies and friends and that she is now approachable by her fellow familia members. Saori Oonishi I felt did a pretty good job portraying the character of Ains. \\n\\n\r\nLefiya\\n\\n\r\n Lefiya voiced by veteran seiyuu Juri Kimura of Seiren fame is one of the main characters of the series and is one of the two heroines for the series. A young elven mage of the Loki Familia and a second-class adventurer that due to her immense magical ability is being tapped to replace her master Riveria one day. Personality wise Lefiya is a positive, cheerful and innocent person that in the beginning of the series was a bit of a klutz and as a result got scared rather easily. However, despite that Lefiya perseveres in her attempts to be strong as her main motivation for being in the familia is to be near her idol Ains which she idolizes and views as something akin to a hero figure in her life. \\n\\n\r\nAlthough relatively weak and easy to get scared in the beginning of the series as the series goes on Lefiya like Ains starts to develop into a better person and character after finding the reason and determination that she needed in order to motivate her and start her drive to become strong. As a result of this development Leafiya becomes braver, more determined and more willing to take a stand to protect not just herself but also her friends and allies as well. Lefiya’s most prominent personality trait is arguably her earnest and determined nature and the fact that she is always willing to believe in the best of people. As a result of this Lefiya is one that doesn’t give up easily and once she set on doing something she’s determined to finish it no matter what. The friendship that Lefiya managed to forge with Filvis is a great example of this personality trait of hers. \\n\\n\r\nAs a character Lefiya was very similar to the original anime’s main character Bell in that both were pretty weak to start with but both began to get stronger as they found the reason and motivation that they needed to become strong. While in Bell’s case it was to help repay the kindness that his patron god Hestia gave him for Lefiya it was her determination to be of use to both her hero Ains but also to the familia and her friends that support her. while Lefiya’s personality improved significantly over the series this wasn’t the only thing that improved as Lefiya’s ability and her true ability also manifested as a result of these changes. While she may have been weak in the beginning and vulnerable to fear and pressure the Leafiya that stood in the latter part of the series was anything but weak as by mastering her fear and learning new spells from her friends and allies have really made her a force to be reckoned with.  I felt that as a character Lefiya was developed pretty well and that her seiyuu Juri Kimura really did a great job voicing her. \\n\\n\r\nRiveria \\n\\n\r\nRiveria voiced by veteran seiyuu Ayako Kawasumi of Fate stay night fame is one of the main support characters of the series and one of Ains and Lefiya’s main allies in the familia. A veteran mage that heads the mage division within the familia and charged with training them Riveria is also a member of the familia’s upper command echelon being old friends with Finn and Gareth. A calm and composed woman that’s also wise and perceptive Riveria serves as the voice of reason and logic within the guild and helps tamper the tendency of her familia members from going wild. Being both a veteran mage and a member of the command echelon Riveria is both a powerful mage and adapt at reading the battlefield and as a result often acts as the second in command to the guild when Finn is otherwise engaged. As a result of her skills Riveria is powerful combatant and seems particularly adept at casting large scale AOE attacks that are both large in scale and powerful to a fault. As a result of being a founding member of the familia alongside that of Finn and Gareth Riveria is someone that is familiar with both Ains past and Lefiya’s struggles which actually enable her to support both when they need help. As the series progresses and as both Ains and Lefiya change and improve both their personalities and their skills Riveria is there to support them and guide them along the correct path. Though only a support character I felt that Rivera had an important role in ensuring that both Ains and Lefiya were able to find their motivations and reasons for getting stronger and guide them so that it helps them the most. I felt that her seiyuu Ayako Kawasumi really did a great job portraying the character of Riveria. \\n\\n\r\nRevis \\n\\n\r\nRevis voiced by veteran seiyuu Sayaka Ohara of Fairy tail and Aldnoah Zero fame is one of the support characters in the series and serves as one of the main villains in the series. A powerful adventurer that Ains and the familia meet during their investigation into strange events on one of the lower floors of the dungeons that lay beneath the town in which they reside Revis is someone that was deeply connected with Ains past and is an important part of that particular sub plot for the series. A formidable swordswoman that is extremely powerful and able to go toe to toe with Ains and still win Revis is a pretty mysterious person who seems to know a great deal about Ains family and seems to perceive Ains as her mother for some reason. While a formidable fighter Revis’s personality is hard to determine due to her mysterious nature but it can be seen that she is a quiet and determined person who is also highly motivated for her own goals. At the same time, it can be seen that she isn’t loyal to anyone but herself and will think nothing off turning against her own allies if the situation turns against them. While Sayaka Ohara did an excellent job in portraying Revis I feel that this character could have been expanded upon a lot more though her role in the series I felt was pretty clear cut in that she served mainly to motivate Ains to get stronger. \\n\\n\\n\r\nFilvis \\n\\n\r\nFilvis Challia voiced by veteran seiyuu Hisako Kanemoto of Unlimited Fafnir fame is one of the main support characters of the series and one of Lefiya’s main allies in the series. An elven magic swordswoman with a somewhat icy disposition at first Filvis is somewhat different from the other allies that Lefiya meets in the series as Filvis is from a different familia and they only met by chance when their familia’s cooperated for a mission. In the beginner of the series Filvis was a bit of an enigma to both her familia members and her god that she protects. In the beginning of the series Filvis was shown to be very dutiful to her patron and at the same time very loyal. However, at the same time it’s also shown that she is very quiet to the point of being antisocial. As the series progresses it become clear that this was tied to a terrible battle in the past where out of all her friends and comrades that were dispatched to hunt down a nasty cult she alone survived. As a result of this event Filvis’s which was positive and determined back then changed to one that was downcast, quiet and unwilling to make friends or allies and also resulting in her putting up walls around herself to protect herself from her perception that she brings ruin to everyone that tries to be nice to her. \\n\\n\r\nFilvis’s past and her redemption forms part of Lefiya’s plot line and was one story arc that I really liked as in addition to seeing how determined Lefiya is to help a person that she just met I also came to understand and sympathize with the reason that caused Filvis turn into such a downcast and unsociable person.  And in the end, I was that that Filvis was able to take out the monster that was the cause of her trauma and also at the same time be able to strike up a friendship with Lefiya and also help her train and become a better person as well. Filvis’s new personality which is much more positive and cheerful and more importantly talkative was nice to see. She also looks so cute when she’s embarrassed when she’s around Lefiya as well. I felt that Filvis was a pretty well-developed character that was similar to Ains and Leafiya in that she too had something that she to overcome in order to be strong but in her case, it was also to recover from her trauma as well. I felt that Hisako Kanemoto really did a great job portraying her. \\n\\n\r\nArms and animation \\n\\n\r\nIn regard to the art that was used for this series I felt that the character designs for the new characters were pretty well done. Although we already seen Ains and Bete in the original anime I felt that the character designs for new characters like Lefiya and Filvis was pretty well done. The environments that were shown in the series I felt were also pretty well done. One aspect of art that I particularly liked in this series was the design of the monsters that the cast faced with the major ones looking pretty cool and scary in equal measure. In regard to the animation I felt that overall animation was pretty good but it’s in combat scenes that the series shines at. I felt that the combat scenes were done pretty well in the series especially the last climatic battle. \\n\\n\r\nVoice acting \\n\\n\r\nVoice acting for the series I felt was pretty well done and I felt that each of the characters in the series was portrayed reasonably well by their respective seiyuu’s and voice actors. Particular praise however I felt should go to Saori Oonishi, Juri Kimura and Hisako Kanemoto who voiced the characters of Ains, Lefiya and Filvis respectfully as I felt that they did an excellent job portraying their respective characters. Sayaka Ohara and Ai Kayano who voiced the characters of Revis and Andromeda respectfully also I felt did a great job in voicing their characters though I felt that Revis should have had a larger role in the series. \\n\\n\r\nMusic \\n\\n\r\nThe music for the series I felt was pretty good with the scene music being appropriate for each of the scenes that required it. The opening theme for the series which was Re- Illusion was sung by veteran singer Yuka Iguchi and was actually quite catchy and conveyed the sense of happiness like meeting some old friends that you haven’t seen in some time. The ending theme for the series was day by day which was sung by Kano and had a positive and upbeat tune to it that seems to covey the thought that each day is an adventure and that you should always look forward to the next day and what that brings to you. \\n\\n\r\nOverall conclusion \\n\r\nIn overall Dungeon Ni Deai was an interesting anime that’s a bit different to what I seen and reviewed before. This comes from the fact that Dungeon Ni Deali is a spin off from an existing anime and takes place in the setting that was established by it rather than featuring a new setting entirely. The strong points that makes Dungeon Ni Deali Sword Oratoria such an interesting anime I felt was its strong story that focused on finding three things which is finding the motivation to improve oneself, finding a place to belong and finding a reason to get stronger, strong characters that were well developed, strong combat scenes and excellent voice acting and animation.  \\n\\n\r\nThe overall story for the show I felt was one of the highlights of the show that when combined with character development really helped in establishing the series two main characters Ains and Leafiya as characters that have evolved as the series progressed becoming not just stronger on a martial level but also in terms of personality and motivation as well. The overall theme for the main story I felt was one that focused developing the characters of Ains and Lefiya by putting not just them but also their fellow familia members into a fight against a shadowy enemy that seems to know Ains on a personal level yet is powerful and well connected enough to also pose a threat to the familia even when they have a core of veterans in their ranks. In line with modern animes the overall plot of the series featured a number of sub plots that I felt did a great job of not just showing the overall threat to the familia but also to Ains and Lefiya herself as well. Of the sub plots I felt that Ains personal quest of fighting against someone that is both more powerful that she is and yet also possesses information on the mysterious past of Ains herself was pretty interesting. Another arc that I felt was done pretty well in this series was Lefiya’s arc in which she was able to break Filvis out of her shell through her persistence and save her from the nightmare that’s been hanging over her like a shroud. Although the main focus of the story was focused on the main characters of Ains and Lefiya and their quest to become not just stronger but also more motivated to both fight and find a place where they can be of help it’s important to note that the members of the Loki familia are also featured in the main plot. These characters though we seen glimpses of them before in the original anime were featured much more heavily in this one and it was nice to see them also fleshed out as well. Watching them care about Ains and Leafiya really reminds you that a familia is very much like a large family as well. \\n\\n\r\nOne of the main highlights of this show was the characters but more specifically their development as both a person and also as a member of the Loki Familia. The main characters in this series which in this case was Ains and Lefiya I felt were actually pretty well designed and over the series developed into not just powerful combatants but also characters who had managed to find both the motivation that they needed to become strong but also a place and a purpose to their life that was missing before. Back in her base form that was shown in the original anime that this was spin off from Ains while a fearsome fighter was a rather quiet person that while certainly trusted and idolized by members of her own familia seemed to be someone that did not return this trust. Ains was someone that seemed to be someone that lived only for battle and viewed things like friendships and interaction with humans as something secondary to her. This series though did much to dispel that impression of Ains by showing not just what caused Ains personality to be so icy but also started her on the path of recovery where not just her relations with her friends and familia is better but also where her personality also changes to be more human of someone her age. The character of Lefiya though is slightly different to Ains in that while she was certainly in the original anime her role in it was relatively minor. As a result, it can be said that Lefiya is a character that this show actually introduced as a new character. In a way Lefiya’s default personally serves as a direct contrast to Ains as unlike her Lefiya was a talkative, positive and friendly person that while shy still cared about Ains and her fellow familia members. The development of both characters I felt was done pretty well and it was nice that in the end Ains had become more talkative and more considerate of other people’s feelings while Leafiya become braver and more willing to stand her ground and protect her friends.  Im also glad that in the end both managed to find both the motivation that they needed to get stronger while at the same time a place where both can belong and be of use to someone. \\n\\n\r\nSpin off anime’s though relatively common usually do not feature the original characters of the anime that spawned it as part of the main plat though there are exceptions to this role.  In this case the featuring of two of the main characters from the original anime as support characters though it made sense from a storyteller’s point of view was somewhat risky as it risked taking the attention away from the main characters. Though in this case because this anime’s main plot essentially told the story of the original anime though through the eyes of Ains and Lefiya this worry was largely unwarranted. In fact the presence of characters like Bell and Hestia only served as another point of motivation for Ains to become stronger. \\n\\n\r\nDungeon Ni Deal had always been famed for the fact that it had some pretty good combat scenes that pitted either lone adventurers or small groups against powerful groups of monsters which though something often seen in fantasy anime is also a sight to see. The combat scenes in this series I felt still managed to do a good job of showing that adventurers even lone ones can still fight on toe to toe with fearsome creatures and opponents. And that with courage and determination even faced with a powerful enemy that was powerful enough to be overwhelming even a small party would be able to triumph if they fight smart that was best shown in the climactic battle in the end of the series.  In particular I really liked the battles that Ains fought against Revis because just as the battle is about who has the most martial might it’s also about who has the motivation to win as well.  \\n\\n\r\nIn the end while Dungeon Ni Deai did have an interesting storyline and combat scenes that tied well with Ain’s past and her bloodline I felt that its main strength and what really made it stand out to me was its strong character development. Both Ains and Lefiya though featured in the original anime that spawned this was then very basic characters that well designed and acted was very bare and had no unique personality or backstory that made them stand out. In this anime, however as a result of both becoming main characters of their own right this was remedied and their development as characters served as the main plot. In this I felt this was where the anime really shined and seeing the journey that both went on and see them get stronger and find the motivation and reason that they want to become strong was what I felt this anime did best. Though Ains may have been as clueless as a ghost in the beginning and Lefiya may have got scared way too easily by the end they were anything but and this was the best reward for me I think.  \\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-07-01T10:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 251658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=251658"
        },
        {
            "content": "Personally, I was kind of scared of what they'd do with this second season after having watched the first, and absolutely loved it, and heard that they weren't going to continue with Bell but look at Ais' perspective but I started watching anyway and it started off not looking great. I wasn't really finding what I enjoyed so much about the first season, the \"shonen\" that I've been looking for during all these years of anime watching where the noble main despite having nearly been killed stands up as a shield to protect his nakama (friend ^^) and nearly kills himself in the process likeyou find in some of the big anime like One Piece and Gintama (only certain episodes of Gintama and yes, I have simple tastes when it comes to anime, please don't judge me :D). Anyway, the character they seemed to be focusing on at the start, which wasn't Ais, just made me want to hit my head against a wall. But I endured, seeing a few bits of the intrigue from season 1 develop was making my curiosity grow and after about episode 3 I started to really enjoy it, but not for the same reasons as season 1. The unfolding of the plot that had been put forward in Bell's season who had unravelled very little was what got me into it so much, and the characters also became a lot more enjoyable. \\n\r\nSo there you go, basically, it started off very shaky but after 2-3 episodes, I was fully into it. I think that the shaky start was probably because I was partially expecting to be dissatisfied with it so I recommend that if you enjoyed season 1, go into season 2 with an open mind and once you’re through episode 2, you should be hooked.\\n",
            "date": "2017-06-03T10:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 249193,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6065939.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sarutochi",
                "username": "Sarutochi"
            },
            "url": "https://myanimelist.net/reviews.php?id=249193"
        },
        {
            "content": "I would like to state in my review more reasons why the anime is worth watching because, from what I see until now, it is a bit underrated and very criticized. \r\nI started watching Sword Oratoria after I saw the original DanMachi, and to my surprise the stories aren't related at all, even though you might see the two story lines intertwining here and there. This anime is focused not only on Ais but the whole Loki Familia, it has many new characters and it provides a different point of view on an adventurer's life. \r\nThe plot is pretty good, it has a lot ofmysteries in it and it's quite unpredictable, since at this point I can't really figure out how the whole thing is going to end and who's on the good side, and who's with the bad guys. It also has plenty of action, to be honest I wouldn't mind more fighting scenes but it's not boring + if there's no action, it means you get some fanservice. \\n\\n\r\nThe animation style is pretty similar to the original DanMachi. If you liked that one, you'll like this one too. In my opinion the animation is simple, there's nothing special or unique about it that could draw your attention. It's not bad either but it could be better.\\n\\n\r\nThe sound is ok, like I mentioned about the animation too, it's plain, not special, nor annoying.\\n\\n\r\nThe worst part about this anime is that the characters (up to this point) do not show any evolution. In the 1st one you could have seen Bell growing and becoming stronger but here there's nothing. No one really improves, they just reveal stuff about each other and about their past and what made them become who they really are. However, it's interesting to see things from Ais' point of view, personally I find her quite interesting and there are some things from the original series that make more sense now, after understanding how she thinks and how the Loki Familia works together. Plus, I have the impression that the antagonist in this anime might be constructed better than the main character and we don't get to see this often.\\n\\n\r\nOverall it is an enjoyable anime. I will definitely continue watching it until it ends. It isn't as good as the first one but it has enough good points that make it worth watching!\\n",
            "date": "2017-05-30T14:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 248905,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5451611.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yisengal",
                "username": "Yisengal"
            },
            "url": "https://myanimelist.net/reviews.php?id=248905"
        },
        {
            "content": "Never forget your roots as they say and its very clear Sword Oratoria has not forgotten its.\r\nThis show was very slow to start with a character that i detested in the beginning but its one of those that takes those preconceived notions and does a complete 180. By about episode six or seven this show goes from a slow side story of Danmachi to damn whirlwind of fight scenes and good character moments. We get some great scenes of characters old and new and by the end i have a show here that initially i would've given a five or six now i'm gonna givean eight.\\n\r\nLefiya redeems herself in my eyes and becomes a lead i can enjoy watching. And i do love how for a few episodes they do take the perspective away from her and more onto Aiz showing that this spinoff is not specifically about Lefiya. It's about Loki Familia as a whole and developing many of them. That is an aspect that i love so much.\\n\r\nAlso FUCKING DRAGONS ON FLOOR 58 DAMN I BETTER SEE BELL FIGHT THOSE ONE DAY CUZ FUCK THAT WAS SWEET\\n\r\nAnyway 8/10 for this one.\\n\r\nThe latter half blew away my expectations. \\n\r\nI love this series with a passion and i'm gonna grab the next novels of Sword Oratoria when i get the chance.",
            "date": "2018-02-17T00:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 271700,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3792031.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/matthew0282",
                "username": "matthew0282"
            },
            "url": "https://myanimelist.net/reviews.php?id=271700"
        },
        {
            "content": "I watched this spin-off after completing DanMachi, and I dare to say, I enjoyed Sword Oratoria slightly more than the original. I did not read the Sword Oratoria manga or light novels prior to the series, but I am currently reading the manga.\r\nBefore people start cursing me inside their heads for my opinion, let me explain why.\r\nSword Oratoria had a beautiful story line. The story itself is far more developed than season 1 of DanMachi, and while I adored both plots, Sword Oratoria displayed to its viewers the cruel reality and wickedness of the Dungeon by constantly challenging Ais Wallenstein. The anime reminds us thatwhile the Dungeon gives opportunity to fame and prestige, adventurers will be pursuited by anguish and pain, as well as unspeakable evil and corruption that is left out of the season 1 anime. The consequences and seemingly insurmountable trials in the fantasy world is what captivates me and told me to continue. \\n\\n\r\nThrough this story, we even see development in DanMachi's \"stagnant\" character, Ais. We see insecurities in this idolized protagonist, and being “imperfect” ultimately renders her human. Her flaws, once revealed, explains more of her character, her background, and her actions in DanMachi. \\n\\n\r\nUnfortunately, people overlook the story and focus on one character: Lefiya. Lefiya is simply irritating and other than apologizing for what she couldn’t have done and telling herself she wants to do more, her fear gets the best of her many times in the show. The problem with Lefiya is that she isn’t challenged enough, and when she barely is challenged, she gives herself up to panic. Her infatuation with Ais doesn’t aid Lefiya character development as Omori has clearly illustrated that Ais is interested in Bell. Lefiya’s imagination is downright creepy when you take that fact in mind. \\n\\n\r\nThat being said, the cast of Sword Oratoria is very likeable. Since the majority of the cast had appeared in DanMachi a few times, seeing them is delightful and it’s enough to familiarize you to the spin-off. When you see the spin-off’s characters in DanMachi, you’re already intimidated by the fact that they’re perfect. In Sword Oratoria, the creators explicitly emphasize their empathetic and caring side as well as their closeness with Ais. I loved Bete, Finn, and Riveria because they complement and look after Ais when she’s faced with her shortcomings. \\n\\n\r\nWhile the ED is a little off in terms of the tone it brings to the anime, the OP is the pop song that somehow is compatible to the spin-off’s medieval fantasy world, possessing the rhythm and notes that introduces the anime itself. I loved every character’s voice and it matches so well with their respective personalities, and that adds to the likability of the cast. When Sword Oratoria and DanMachi share the same scenes, the spin-off’s voices are much more matured and consistent for their characters. The OST is deliberately composed to evoke the feeling of watching DanMachi, and along with a sense of mysteriousness and fantasy, you can hear familiar tunes in the background. In the OST “Determination to fight,” you can hear “Argonaut” from DanMachi where Bell fights the Minotaur. The OST really reflects the aura of the Loki Familia and their situations, like in the piano song for Ais played in the first episode where it reflects her dispiritedness. \\n\\n\r\nOne downfall of Sword Oratoria is the art. While it’s still good, it is noticeably a step down from the DanMachi we knew in Bell’s adventures. The manga had better action scenes than the anime itself, and it is disappointing how they chose to adapt the anime in terms of art itself. The thrill of action is lost when I watch Sword Oratoria. Nevertheless, for its story, characters, and sound, you should give Sword Oratoria a chance.",
            "date": "2018-01-09T21:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 268078,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6878141.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rheatifa",
                "username": "rheatifa"
            },
            "url": "https://myanimelist.net/reviews.php?id=268078"
        },
        {
            "content": "SPOILER FREE\r\nThere honestly wasn't much very interesting about this series. I haven't read the manga, but the whole thing just comes off as sloppily structured. There isn't even a definitive main character. You'd think it'd be Azi, but the show spends an abnormal amount of time focusing on a new character, Lefiya and her fangirl crushing on Azi. Lefiya is an incompetent mage who is very cutesy and very quickly got annoying for me. For being such a huge focus, she rarely drove the plot of mainly just tagged along with the team, needing to be saved constantly. \r\nNow you can say that Bell neededto be saved a lot too, but he was also the main driving force of the plot and always got better after each mistake. Lefiya doesn't get better until very late in the 12 episode show. The main plot isn't even about her. Honestly, I didn't understand most of the plot. It was some conspiracy about the Gods we had a lot of exposition for, but that was never resolved. \\n\\n\r\nHonestly, most of this anime feels like just set up for what happens in the manga. We learn a bit about Azi and see things connected to her past, but it's never explained and only touched upon in the last episode, because the rest of the time is spent with plots that have no weight to them and that I wasn't really interested in. \\n\\n\r\nThat being said, I did enjoy the members of the Loki familia and some of the new characters were enjoyable as well. The art and animation quality were pretty typical of an anime and as with the last Danmachi series I liked the character designs.",
            "date": "2017-09-14T06:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 257488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4785185.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Inspector-Spinda",
                "username": "Inspector-Spinda"
            },
            "url": "https://myanimelist.net/reviews.php?id=257488"
        }
    ],
    [
        {
            "content": "The good: You don't need to watch the first season to follow the story. \r\nThe bad: The anime started with a score of 8.74 and ended with a 7.10.  If you watched the first season, you would feel a bit disappointed. Unlike the first season, this anime doesn't entertain because the story is weird and the pacing is average. For me, this anime is just an alternative story from the main series. \r\nDanmachi Sword Oratoria centers the story in Aiz Wallenstein, the sword princess. Sadly, even if Aiz is the main character, there isn't too much information about her past just some sporadic scenesand the plot centers on her desire of getting stronger. During her adventure into the dungeons, she fought with a person that could know more about her past, and she decides to go into the lower dungeon levels to find the truth. The plot has pacing problems and lacks more information to keep us entertained. \\n\\n\r\nWhile this anime follows the main idea of the Danmachi series, I feel that something is missing. Perhaps some characters aren't well developed and annoying to the point that we could get bored of them. The introduction of some characters is forced or useless, and there isn't enough time to develop their personalities fluently. Maybe the novel is different.  \\n\\n\r\nThe art is standard. Honestly, I was expecting to be better than the first season, but I can say, it is the same. \\n\\n\r\nAbout the songs, the OP is nice, and the ED is passable. The sound mix is good and focuses on the fights details. \\n\\n\r\nFinally, nothing is concluded, and nothing about Aiz is told, so in other words, the story failed to deliver any reasonable conclusion, it ends abruptly. It was just a promotion for the novel, buy it to find the truth.\\n\\n\r\nMaybe you will enjoy it more if you haven't watched the first season. If you are a fan of the first season, do not expect too much from this or you will get upset, it is just a spin-off.\\n\\n\\n",
            "date": "2017-06-30T18:00:00+00:00",
            "helpful_count": 140,
            "mal_id": 251584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6017253.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Pipe",
                "username": "Pipe"
            },
            "url": "https://myanimelist.net/reviews.php?id=251584"
        },
        {
            "content": "Producer 1: I'm hearing a lot of good reviews from fans about Danmachi, maybe we should think about a sequel?\r\nProducer 2: There isn't enough material for a full season, how about a spinoff?\r\nProducer 1: Aiz is really popular with fans, and we don't get to see much of her in the main series. We could make a spinoff series all about her!\r\nProducer 2: That's a great idea! And then instead of the spinoff actually being about Aiz, it could focus on some wimpy girl nobody cares about! We'll make Aiz an overpowered plot device instead! \r\nProducer 1: Uhh...\r\nProducer 2: Don't worry, the plot will berushed and won't make any sense either.\\n\\n\r\nProducer 1: ...",
            "date": "2017-07-03T00:26:00+00:00",
            "helpful_count": 48,
            "mal_id": 251809,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/madmaster5000",
                "username": "madmaster5000"
            },
            "url": "https://myanimelist.net/reviews.php?id=251809"
        },
        {
            "content": "Sword Oratoria... the spinoff, not second season, of the beloved DanMachi series. This time around, we're going to see the same story from Ais WallenWhatsit's point of view, at least, that's what I thought was going to happen...\r\nStory: In the first, or at least first few episodes, it should be clear that this is in fact the same story of DanMachi. However, instead of focusing on The Misadventures of Bell Cranel, we get to see a different side of things. This spinoff focuses mainly on the cast of the Loki Familia. Yes, the Loki Familia, not just Ais, which is very important to know.Originality: 0/1. I mean, come on now. It's like the author suddenly had second thoughts about the original story and how basic it was, so he created this spinoff to add a deeper meaning to everything, just centered around Ais' character. \\n\r\n      Potential: 2/2 Although reusing the same story, I'd say this had a lot of potential. It's kind of an interesting thing to see the same events occur from another character's perspective; especially the one (Ais) who has the biggest influence over our DanMachi protagonist. \\n\r\n      Execution: 3/7 :\\n\r\n-One of the biggest problems I think this show had was pacing. The first few episodes were a complete drag, and I felt like I was forcing my way through them. The only highlights of the first couple episodes were the moments when Ais came into contact with Bell. Having a slow introduction can really put a damper on the overall feeling of a series, especially one that only spans twelve episodes. I honestly didn't even somewhat enjoy an episode until we got to episode four. 3/12 is a fourth of the series. Not a very good start. \\n\r\n-I'd say this show really missed it's chance to focus on Ais as the main character. Hopping from her to Lefiya as a protagonist really put a damper on the story. Ais is a big part of the story, but the amount of screen time she missed out on was a sin. \\n\r\n-Another problem I had with this series that is a recurring issue from the original was the excessive amounts of fanservice shoved in my face. If Hestia wasn't your cup of tea, then Lefiya might make you drop the series all together. Her \"fantasies\" that I'm sure were supposed to be comedic were way over-the-top and completely unnecessary. \\n\r\n- The final episode made zero sense if you have any recollection of the original series and the order events played out. I'm not going to spoil anything, but there was an event that should have happened but didn't which was somewhat aggravating.\\n\r\n+ Even amidst all of these negatives, there were some positives. The moments that Ais came into to contact with Bell were just precious, as we got to see a different side to Ais than even Bell got to see. This was exactly what I was hoping for from the series, and I was just a bit sad there wasn't more of it.\\n\r\n+ The moments the series actually chose to intertwine Ais and the overall story were done pretty well. The motivation for Ais to become stronger is revealed. Best of all, we get to actually see the Sword Princess struggle with some of her battles. \\n\r\nStory overall score: 5/10. Although it wasn't very original, I'd say it had a lot of potential. It just chose to execute it in a way that wasn't exceedingly interesting. \\n\\n\r\nArt:\\n\r\n     Animation: 2/5. A pretty obvious step down from the original series. The fight scenes seemed far less intense. Their movements were sometimes rough. I mean, seriously. If the best animated scene from the series was taken directly from the original series, we have a problem. \\n\r\n      Art: 3/5 A serious downgrade, once again, from it's predecessor. The setting and scenery were fine. Nothing spectacular. In the scenes with less action the characters were occasionally drawn very sloppily, and it was pretty noticeable Nothing great overall, which is a shame because the first season had fairly decent art and animation. \\n\r\nArt score overall: 5/10 Obvious short cuts were taken, but some scenes were pleasing to look at. \\n\\n\r\nSound:\\n\r\n     Opening: 1/3. It's a pretty skip-able opening. Nothing spectacular, certainly nothing I'd want to listen to on it's own. It wasn't an opening that got me excited to watch the episode at all, although I guess it was an okay opening for a fantasy genre show. \\n\r\n     Ending: 0/2. This ending was just bad. Not only was it entirely skip-able, but it didn't even make me want to watch the next episode or convey the tone or mood of the show accurately at all. \\n\r\n      OST: 2/3. The original soundtrack wasn't anything particularly special. It had common fantasy instrumentals (you know the ones). There was one track that caught my attention, surprisingly, although it still wasn't anything I'd listen to out of context. The rest of the soundtrack did a decent job of conveying setting and the mood and/or tone of the occurring events. Not a lot of complaints here.\\n\r\n      Voice: 1/2 The voice actors of the main characters were pretty meh. Lefiya's voice was rather annoying and didn't really portray emotions well at all. Ais' actor was alright, but I feel like she didn't really conform to the character well enough. Side character voices were decent all around. I'm a fan of Bete's VA, and Finn's wasn't too shabby, either. \\n\r\nSound score overall: 4/10. Nothing spectacular at all, not that I really expected much. The OST was by far the best part for me. \\n\\n\r\nCharacter: Oh my, here we go. Buckle in, boys and girls, we're going on a bumpy ride. \\n\r\n     Design: 2/2. Not really any complaints here. Their designs are typical fantasy setting, and they're easy to tell apart. \\n\r\n     Enjoyable: 1/3. I did not really care for most of the members of the Loki Familia. I did enjoy watching Ais, Finn, and Bete, but that's unfortunately it. Lefiya might be one of the most annoying characters I have ever come across. I had to stop myself from rolling my eyes whenever she came on screen. No, that's not an exaggeration. She was that bad. At least the moments with Bell and Ais were fun to rewatch, as were the moments when Ais was fighting. Otherwise, the remaining characters were mostly boring. Although, I have to give it up to that perverted Goddess, Loki. I did enjoy the scenes where she actual showed that she was a pretty cunning woman. \\n\r\n      Development: 1/5. \\n\r\nShall we break down why?\\n\r\n-Lefiya: Oh, hello there Bell 2.0. Lefiya is literally the \"Can I copy your homework?\" meme. I mean, not that another Bell would be particularly terrible, but she was just so much worse. Honestly, combine Bell and Hestia and add in zero character development and an exceedingly annoying personality and voice. There. That's Lefiya. Perhaps the worst choice of a main character they possibly could have picked. I can't even remember if she was in the first season or not. Not to mention the most annoying aspect of her: It's stated that she's already has the power of a Level 3 Adventurer, but she's /too scared to do anything/ on the battlefield.\\n\r\n-Ais: The only reason this got a measly point. I was so glad Ais got at least a tiny bit of character development. Like I've stated previously, the amount of screen time she got was a sin considering I thought this entire season was going to be following her story. But we got her motivation to become stronger, we saw some fights where she did struggle and wasn't some OP God being, and best of all we get to see that she seems almost somewhat envious of Bell (who is developing so quickly). We see the reason as to why she agreed to train him in the first place, and that he's actually motivating her at the same time. Still no drastic changes in character, but it was a start.\\n\r\n-The rest of the cast: Not really any development here. Tiona and Tione were pretty static the entire way through. Although Bete, Finn, and Riveria were enjoyable to watch, they didn't change much, either. I will mention Filvis,though. As a new character introduced in this series, I found her pretty interesting and she did get some development. Still, not much.\\n\r\nOverall character score: 4/10. Even though they have decent designs, over half of the characters were not even enjoyable to watch, and this series was seriously lacking in the character development department \\n\\n\r\nEnjoyment: 5.5/10. Despite there being countless flaws to this spinoff, I did kind of enjoy it. If I hadn't watched the original series I definitely would not have enjoyed it as much as I did. \\n\\n\r\nOverall: 5/10. Although this series can be watched on it's own, if you haven't seen DanMachi, you'll probably enjoy this even less than I did. If you didn't like the original season, definitely steer clear. However, if you're an avid fan of DanMachi and are eagerly awaiting a true second season, I'd say you should watch it. It gives a different perspective and a deeper story to the events that occurred in the first season. I haven't read the Manga, so I'm not sure if the storyline here will be necessary to know if we ever do get a true second season, but if you're a fan of Ais WallenWhatsit, you'd probably enjoy this show at least as much as I did. Keep in mind that the latter six episodes are much better than the first six. Or, more enjoyable, at least. \\n\\n\r\nThanks for reading~\\n",
            "date": "2017-07-01T08:11:00+00:00",
            "helpful_count": 45,
            "mal_id": 251644,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6352101.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/FullmetalFate10",
                "username": "FullmetalFate10"
            },
            "url": "https://myanimelist.net/reviews.php?id=251644"
        },
        {
            "content": "Honestly I really like Danmachi season 1 featuring Belle. Im pretty sure all of you did. But this is my personal opinion and I really dislike lefiya, just overall the way she acts the useless ways she is portrayed kinda pisses me off. When i first saw the release date for the new Danmachi I was really excited for a season 2 of one off my favorite fantasy animes, but when i realized that this was from the point of view of Ais I was kind of dissapointed. Im pretty sure alot you wanted to see a development in a season 2 where we areable to see Bell the main hero to progress further, but even with that in mind i was fine with having a season 2. But after watching the first episode and encountering one of the \"main\" characters Lefiya I immediately started to realize how FUCKING ANNOYING she was. The story was alright and the fact we got to see Dan machi from Ais's view was ok, but the characters really threw me off this season.",
            "date": "2017-05-09T10:59:00+00:00",
            "helpful_count": 45,
            "mal_id": 247290,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6230659.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Melvinthenigga",
                "username": "Melvinthenigga"
            },
            "url": "https://myanimelist.net/reviews.php?id=247290"
        },
        {
            "content": "if you liked Danmanchi you probably still won't like this. The story isn't important because it's the same thing every episode. the main character gets herself stuck in a precarious situation and gets saved by the amazing Aiz Wallenstein. the main because so indebted and obsessed with Aiz she follows her around everywhere she goes and buys her stuff regardless of how rare or expensive because the sword princess is that important. the plot armour is tolerable at least as we get into fights the viewer doesn't really care about each episode.\r\nthe art is ok. I mean it has to be if it's mostly fighting.\r\nthesound is also ok  but nothing to praise.\\n\\n\r\nthe characters are either garbage or annoying. we have the great Aiz Wallenstein the girl with no personality yet everyone loves her. she is only good for fighting as she throws herself into fights even when told not to. we have our main character Lefiya which follows Aiz around like a lost puppy as she is weak and hopeless on the battlefield but don't worry like previous main character bell she has something special about her and has a ton of untapped potential.  who cares about the rest of the characters, they're side characters they can't be much better.\\n\\n\r\noverall i give this show a 3/10. crap characters, crap story but good fight scenes (that's all it has going for it). things look like they might change pace next episode but they probably won't. unless you're a completionist or someone who just a good fight skip it. and danmachi fans unless you like Aiz (i don't know why you would) you're not going to learn anything you care about.",
            "date": "2017-05-14T12:17:00+00:00",
            "helpful_count": 31,
            "mal_id": 247662,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5049264.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/BlueEclispe",
                "username": "BlueEclispe"
            },
            "url": "https://myanimelist.net/reviews.php?id=247662"
        },
        {
            "content": "Is a spinoff of Danmachi with an alternative view focusing on Aiz, one of (for LA at least) the least interesting harem members to be given a spinoff series a good idea?.\r\n...Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria is an interesting yet odd spinoff from the many many MANY sequels and spinoffs anime to come out of Spring 2017. LA wasn't exactly clamoring for a spinoff based on Aiz as LA is one of those fans of Danmachi wanting just more from Bell and Hestia than to Aiz though this spinoff looking at an alternative view ofhow events occurred in the original is a nice touch in a ways.\\n\\n\r\n<LA breathes in>...Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria's characterization is focused towards Aiz as well as Lefiya Viridis voiced by Juri Kimura a fangirl of Aiz, though Lefiya is more as a similar Bell but with a similar motive of wanting to protect others by leveling up in this case trying to catch up to Aiz as well as worshiping her. Aiz on the other hand has character development in terms of her backstory and how this links to the major villain of this spinoff. This at least is interesting and gives us depth to one of the least interesting harem member of Danmachi. Aside from that, other characters are typical supporting characters with some personality to them as well as fleshing out the Loki Familia as a Guild from Bete Loga voiced by Nobuhiko Okamoto the hair-tempered berserker, Tiona Hiryute voiced by Rie Murakawa and Tione Hiryute voiced by Minami Takahashi, Riveria Ljos Alf voiced by Ayako Kawasumi and Loki voiced by Yurika Kubo the perverted leader of the Familia, which by the end of it, the majority of the supporting characters got fleshed out better than Lefiya did, especially showing us that Bete isn't the asshole jerk character or showing the Hiryute twins and especially Riveria a glass cannon badass mage and LA's favourite character in Sword Oratoria. \\n\\n\r\nNow because this spinoff is having plot beats following the original, this spinoff does have some new material, that one being an interesting plotline that involves Aiz and the major villain, her plans and is probably the only interesting plotline to all the new things Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria does as it integrates both the Gods and behind the scene dealings to connecting to Aiz's past and her dilemma about being a powerful swordswomen and what her connection to this plotline has on her. The rest of the plot elements especially the slice of life are kinda a bore to constant running gag annoyance with fanservice moments any chance it gets and is just a guise for the build up and hinting to the plans of the major villain is focusing on, something even it's original somehow did quite well (albeit the original's major villain never springs into action or goes anywhere as it's a more focused look at Bell's progression to be a better adventurer, where in this spinoff, the major villain is a HUGE focus and takes a somewhat more serious take compared to the original). \\n\\n\r\nProbably one of the biggest gripes Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria does is on Lefiya as a character, at first she's the fangirl wanting to be like Aiz and is a shy one at that, but by the end of the anime, she becomes a vindictive psycho lesbian wanting Aiz all to herself (slight exaggeration but the anime frames Lefiya like this and it crosses the line out of comedic effect) and sees Bell as competition. Either way, Lefiya's portrayal at first was pretty good and especially when revealed she like Bell is a pretty powerful magic user under that timid nature, but due to her static nature and never evolving or developing outside of these traits, she becomes a character LA would not root for or care one iota about. The only other character annoyance comes from Loki who does the entire yuri groping thing to Aiz or any big-breasted woman -sigh-. The only other lacking aspect Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria doesn't have compared to the original is the aforementioned slice of life moments that feels more like build up than progressing with the plot, to it's defense due to this plot simultaneously coinciding with it's original, it's kinda hard to add good flow to the plot when it needs to abide by it's original series but then LA can counter it by saying it turns into chess piece story telling with \"some\" substance to it and by LA sees by this later down the anime aside from a few new character development from Filvis Challia voiced by Hisako Kanemoto and Lulune Louie voiced by Hikaru Akao and a bit of world-building through Loki, it's chess piece storytelling using the original series as it's crux and the major villain egging Aiz on to be stronger or go here or there doesn't help.\\n\\n\r\nIn terms of animation by JC Staff, the animation overall is ok enough though there are some dips in quality at times and although the anime is rehashing moments from it's original, LA is glad they just didn't copy and pasted it just like that and given us differing perspective of certain events. The battles once again are a standout but again also takes dips in quality at times to. The character designs are polished to a certain level of detail and has the detail to be similar to it's original, typical of a spinoff in a ways, LA isn't complaining. Overall, the animation is ok enough for LA to neither rage or a praiseworthy mention about.\\n\\n\r\nIn terms of voice acting, the voice acting is typical fare only with the hugely expanded voice cast. Saori Oonishi as the stoic emotionless Aiz is meh in LA's opinion but she \"tries\". Juri Kimura, well LA is gonna compare her to Satomi Arai as Kuroko and say that she's not as bad, but she can get annoying when in obsessive fangirl mode and here's the thing, LA actually enjoyed Satomi Arai as Kuroko even at her worst of times, Juri Kimura as Lefiya has her annoying moments but LA is more or less projecting with this criticism. But once again, like the animation it's ok enough for LA to neither rage (a bit) or praise about. LA's favourite voice actors would go to Rie Murakawa and Minami Takahashi as the Hiryute twins AS well as Ayako Kawasumi as Riveria.\\n\\n\r\nSo Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria has a few problems with it's plot beats, some character annoyances and annoying fanserviced slice of life moments but does that mean even with it's saving graces of an interesting yet serious plotline and alternative look at similar events from the original means it's a good spinoff???...for that LA says that this spinoff is an interesting case of trying to be like it's original while at the same time whistling to a different tune, Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria is that it's not great but it's not bad either as it expands the world building of Danmachi, however if comparing to it's original, it feels a bit of a step back from it's original series, not from it's differing atmosphere and characters as even atmosphere had times where it fitted into the serious nature of the major plotline of the major villain of this spinoff and certain outside of Lefiya like Filvis, Bete and Riveria got their limelight moments but because it's trying to emulate it's original while doing something completely different instead and it does work to an extent but it's blunt execution of chess piece storytelling deterred LA from liking this spinoff as much as LA wanted to.\\n\\n\r\nDungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria, your not a bad or horrible of a spinoff but your definitely one of the more unremarkable spinoffs LA has seen.",
            "date": "2017-07-01T05:14:00+00:00",
            "helpful_count": 17,
            "mal_id": 251628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=251628"
        },
        {
            "content": "DanMach Gaiden - Sword Oratoria is a japanese anime produced by studio J.C. Staff and is based on a Light Novel of the same title.\r\nThis is a side story of the original DanMachi, and this review will contain comparisons from the original show, meaning that I presume the reader has watched it.\r\nStory: 5\r\nThe story revolves around... What does the story really revolve around? Our original thoughts about the show was that it would be about Aiz and see things from her perspective, but this is not true for the most part. \r\nWe instead follow an array of characters through an array of events, and someof them are the exact same events and frames that were used in the original. \\n\r\nThe show can basically be summarized into 5 points:\\n\r\n\"The main plot\" being something mysterious with wild plant monsters.\\n\r\nAiz' backstory or something similar.\\n\r\nLefiya getting stronger mentally.\\n\r\nShared frames to original to show where the show is on the timeline.\\n\r\nFanservice.\\n\r\nThe first 3 are obviously the main plot, while the second 2 are pretty much filler material.\\n\r\nNothing stands out as exceptional, and quite a bit of it is low quality.\\n\\n\r\nArt+Animation 5\\n\r\nThe animation in this show is pretty generic, ranging from character design to monsters and ambience. While it's not terrible in any way, it's definitely not good, and this is year 2017 - if the animation is bad, other parts DEFINITELY have to make up for it. Onihei is a decent example for this.\\n\r\nIf anything, the art has declined from the original, pointing at a question: Is the budget for this show lower than for the original one?\\n\\n\r\nSound: 5\\n\r\nThe sound is pretty similar to the art/animation. There are no impressive OSTs, and the OP/ED are both quite bland. There is nothing wrong with character voices, the characters are just not interesting enough to really be able to call it more than decent.\\n\r\nI have to lower the score a bit more due to how badly composed the OSTs are, especially in and between fight scenes.\\n\\n\r\nCharacter: 4\\n\r\nHere's a core problem of the show. The original story had most of our current \"main crew\" as situational SUPPORT characters who showed up in a couple episodes. The only above average characters we currently have are Aiz and Loki, but since they don't receive the screentime of a \"real MC\", they don't pave the path for this show either.\\n\r\nThe design for our \"main crew\" is very fitting for the word support characters. Lefiya (MC?) is a completely useless character who will probably save the day in a future episode, the problem is that: Bell Cranel from S1 had the vibes and screentime of a REAL MC even if he wasn't too great. Lefiya does NOT have any of these traits, and feels more like a target for future plot armor. \\n\\n\r\nEnjoyment: 5\\n\r\nI would originally have posted a worse score here, but the last part of Ep4 caught me slightly by surprise, I will have to keep looking and see if they progress it into something good.\\n\r\n1 good or interesting scene is not enough to instantly sway me on my score, especially since EVERY SINGLE SCENE prior to this has been low in quality.\\n\\n\r\nOverall: 6.8\\n\r\nAlthough the overall score definitely does not add up to the other numbers, this is the \"value\" of this show if compared to other scores on MAL.\\n\r\nThe show definitely beats everything around 5-6.5, which means that giving it a ranking according to my scores for its' attributes would be unfair. It would also be unfair to give this show higher rankings for its' content than it deserves, thus I only raised the overall ranking.\\n\\n\r\nIs it worth a watch? I don't know yet. \\n\r\nShould I watch this if I haven't watched the original? - I believe the original beats this in quality, so watch that INSTEAD.\\n\r\nWill update this review at 8/12 episodes.\\n",
            "date": "2017-05-10T05:08:00+00:00",
            "helpful_count": 15,
            "mal_id": 247347,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5913422.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tyiriel",
                "username": "Tyiriel"
            },
            "url": "https://myanimelist.net/reviews.php?id=247347"
        },
        {
            "content": "Better wait for the return of Belle and company. \r\nAiz is a boring character to be the main in a complete season. \r\nIt doesn't matter the amount of fanservice that is forced upon the viewer, it won't compensate the lack of character development and plot. \r\nThe Loki Familia are a really boring cast to root for, since they're supposed to be one of the strongest Families in the series, there's no hardships for them to endure.\r\nThe only glimpses of hope for this side story, are the scarce moments when it entwines with the main story, but since this moments where already shown in the firstseason they don't have the same impact as the first time. \\n\r\nIf you like the first season, YOU WON'T ENJOY THIS BORING SIDE STORY. \\n",
            "date": "2017-05-28T00:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 248699,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3488541.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/DaRoF",
                "username": "DaRoF"
            },
            "url": "https://myanimelist.net/reviews.php?id=248699"
        },
        {
            "content": "I originally didn't want to watch this series after I realized it wasn't actually the second season of one of my favourite fantasy animes. But I gave it a chance, and I'm sure glad I did. Let me quickly tell you why.\r\nThis anime follows Ais' story, which goes on in the same time period as the first DanMachi series. It isn't a retelling of the first DanMachi and it isn't the continuation. It's something new (story-wise) but familiar (setting-wise/the big picture). It ended up providing valuable information to flesh out some characters that weren't explored too in-depth in the first DanMachi, and giving a newviewpoint on the same oncoming disaster that was hinted at in the first DanMachi. Even if you had regarded this anime as a stand-alone, it is really good and really interesting. \\n\\n\r\nLike in the first DanMachi, this anime has a well developed plot—good pacing, good foreshadowing, and it effectively shares information (about events, characters, etc) without it seeming fake or boring. In this way, characters are developed naturally. And about the art—of course, it is a favourite aspect of mine (I love DanMachi art). \\n\\n\r\nOverall, it was really fun to see Ais' perspective and to learn about where she came from and to watch her develop. She became more than that beautiful human doll I was introduced to in the first DanMachi.\\n\\n\r\nIn essence, I recommend watching this show—especially if you liked the first DanMachi. Even as a stand-alone (like I said) it's a great show.",
            "date": "2017-07-05T08:37:00+00:00",
            "helpful_count": 6,
            "mal_id": 252013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5721303.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Annanyanya",
                "username": "Annanyanya"
            },
            "url": "https://myanimelist.net/reviews.php?id=252013"
        },
        {
            "content": "TL;DR Section at the end of the review. This review may or may not contain minor spoilers.\r\nI'd like to preface this review with saying I general don't review sequels or side stories, because you'll find me usually saying it was as enjoyable, slightly less enjoyable, or slightly more enjoyable than the first or original story. This show has forced me to turn it into an exception.\r\nDungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria (which is a goddamn mouthful), better known as DanMachi: Sword Oratoria, is a spin-off side-story that shows the main story but from a different perspective. Who's perspective?The Loki Familia's, but more importantly from Ais' perspective.\\n\\n\r\nThe entire idea of the show started out well, being able to see things from how Ais saw them, but it very quickly degraded into watching Lefiya be the worst tsunyuri girl ever, every episode. For one reason or another, they thought Lefiya's \"I have great potential but currently am fucking useless\" mixed with \"I love and look up to the girl that's my senior/hero\" was going to end up with a good character. They could not have done worse with her. The constant naivete coming from Lefiya, the constant whining, the constant not being able to do anything remotely useful (until the very end), and the constant frustration that she gave me as a viewer was just horrendous. She alone destroyed the fun that this show could've given me.\\n\\n\r\nOn the topic of characters other than Lefiya who is probably one of the worst this year alone, every other character has the emotion or depth of a fucking brick, which is painfully tough and flat as an airway run strip. Ais continually acts like a robot whilst showing very little emotion, the twins are just there to be supporting characters and don't ever break that trend, Bete is an angry dick, and the three seniors are all very stiff. Loki probably portrays the most emotion, going from trying to cop a feel on anybody, to somewhat serious on certain matters. The best part of this show was seeing Bell and Hestia, which is just painfully ironic in this scenario.\\n\\n\r\nThe story revolves around Ais and the Loki Familia and how Ais goes from being mistaken as her mother to some darker things that may bring the world to ruin. Or something like that. The story in all actuality was less important than they made the character interactions out to be, and those as previously mentioned was like watching paint dry for 12 weeks. Other than some new characters that you can only see through Ais's perspective, Sword Oratoria was made out to be far darker than the original story from Bell. This didn't play out well because the original story did well as a lighthearted fantasy/adventure show. The story was like watching an extremely convoluted game of Clue with DanMachi characters, and then some fighting instead of guessing who the killer is.\\n\\n\r\nOne of the redeeming features of Sword Oratoria was that the art and animation were at least somewhat pleasing to look at in some situations. Some fight scenes were nicely done, some nice screenshots to be taken, but it never went up and beyond the \"average\" level that it had maintained through 12 episodes. The soundtrack was so laughably forgettable that I can't even really make a remark on it anymore in terms of whether it was good or not. \\n\\n\r\nTL;DR: DanMachi: Sword Oratoria is a waste of 12 episodes that could've been put towards making a second season instead. All you'll get from this is how much you realize Bell and Hestia were the best part of DanMachi, and how the characters in this are painful to watch. I would not recommend this unless you really don't mind how awful the character and story are.\\n\\n\\n\\n",
            "date": "2017-07-01T16:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 251690,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5078535.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/deathline",
                "username": "deathline"
            },
            "url": "https://myanimelist.net/reviews.php?id=251690"
        },
        {
            "content": "This is my first review and I'll keep it simple.\r\nThis anime is a chore to watch. The only reason I find myself watching this anime is in the hope that I'll find a scene with Bell from a different perspective.\r\nThe art work is much the same as the first season and the sound is fine as well. However, what really ruins this anime is the story and the characters. The story so far is lacklustre and cliché, the usual; some bad guy doing something bad. But the characters are incredibly annoying. The main character Lefiya is constantly whining and following Ais around like a lapdog, she continues wanting to become stronger, to not to let her group down but every episode she is constantly screwing up and being saved. The rest of the characters have little depth and Ais is much the same in the first season however she gets much more screen time but still lacks any development.\\n\\n\r\nTo summarise, DO NOT WATCH THIS ANIME. It's a waste of time, extremely hard to enjoy and lacks the charm of the first season. Even if the anime succeeds in gaining a third season, as this is a prequel, I doubt it will impact your understanding or enjoyment of the next season.\\n",
            "date": "2017-06-03T06:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 249179,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/jab1907",
                "username": "jab1907"
            },
            "url": "https://myanimelist.net/reviews.php?id=249179"
        },
        {
            "content": "This is a alternate story line, I repeat this is not a season 2 of the show. Although season 2 will be coming out soon. Don't expect this to be as comical as the first season either, it has a more serious tone to it (should've read the genres).\r\nThis is backstory for the \"Sword Princess\" or better known as Ais, it offers her day to day interactions with her familia and how she also meets Bell in her point of view and what she thinks of him. The story also revolves around another character not given a lot of screen time in the main series,Lafiya, to me personally comes off as annoying and useless, she also has a lesbian side to her when she talks to or about Ais she seems a little too fond of her. This season was meant to capitalize on the character development needed for many of the supporting characters from the first season, Ais is a quiet person who doesn't talk much, and is bad at expressing her feelings through words and often , comes off as dull for the most part. Lafiya was barely even mentioned, and her interactions did seem pretty random but this side story really helped explain the trouble that seemed to revolve around Ais. It also makes you appreciate the side characters much more.\\n\\n\r\nStory: 7 The story was weak compared to the main stories, it was a little all over the place, but it did offer explanations the main story didn't and had a nice pacing\\n\\n\r\nArt: 8 Well done like the first season\\n\\n\r\nSound: 7 I watched the dub and very much enjoyed the voice actors chosen, the music was also pretty good\\n\\n\r\nCharacter: 8 This side story offered a lot of character development that the main story didn't, and offered a new perspective of the importance of the supporting characters\\n\\n\r\nEnjoyment: 3 I knew this wasn't a season 2 of the show but I was expecting it to have the comedic side which is what made me really enjoy the first season, and I thought I would see Bell a lot more too, the show was too serious for my taste, and even in the parts that were supposed to be funny I didn't even laugh all that much\\n\\n\r\nOverall 6.6 but we'll round it to a 7",
            "date": "2018-05-20T08:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 280996,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5380347.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/STROKEMEFASTR",
                "username": "STROKEMEFASTR"
            },
            "url": "https://myanimelist.net/reviews.php?id=280996"
        },
        {
            "content": "So i started this series not all that excited after seeing the first one. While i thought the first one was fun and all it just couldn't get my attention that much.  But overall i did enjoy the first season and gave it a pretty good review besides the fact of it having an OP character and almost up to terms of what could be called a harem \r\nThis is kind of the same season kind of holds the same opinion as the first one. \r\nWhile in my opinion overall better than the first season it was kind of hard to keep my attention.It doesn't really suffer from the same problems as the first and i'll get into the problems in a minute.\\n\\n\r\n~~ Spoilers ~~\\n\\n\r\nGonna try to keep away from the actual story\\n\\n\r\nLefiya: First let me start out by saying that for some weird and unknown reason instead of having the entire story be focused on Ais and herself. The story decided to add a new character named Lefiya. She is a very not needed character. Because she is in this we now have two main character Ais and Lefiya. \\n\\n\r\n Lefiya isn't a bad character in my opinion. But she is more of a side character that is in the main character group. All throughout the entire series she has a crush on Ais. This in it's self isn't bad idea but the way they did it was not good. A lot of the time she can come off as annoying as she fantasizes over the two of them going out. Overall she doesn't add anything to the plot and takes up space that we the audience would rather be spent on Ais.\\n\\n\r\nAis: Had really always been the most interesting character from the start. So when i found out she had her own season with her as the main character in the story. Too the stories credit it does give a good story and everything too Ais. I wish that the story focused more on her. But overall it was fun.\\n\\n\\n\r\nSomething that always bugged me in the first season it had always bugged me that Bell ( MC ) Is super powerful and has these amazing skills never before seen. The entire time i was wanting him to not reach his goal of reaching the power level of Ais. I felt like it would be more interesting for Bell too find out that not everything can happen like he wants. Thankfully in this it kind of elevated my frustration with that. It shows that Ais is still more powerful and is likely to get more powerful and stay like that.\\n\\n\r\nSomething else that bugged me of the first season was that there was signs of it becoming a harem. Harems are a cancer to stories and annoying. Through out the first season it at times seemed like Ais would be in the Harem. But in this Ais doesn't even seem interested in him. She seem's more interested in being more powerful and spending time with her friends. \\n\\n\\n\r\n~~ SPOILERS OVER~~\\n\\n\\n\r\nIn the end this was something i enjoyed more than the original  even with it's flaws. Would recommend watching the first season first than this but it's not needed.",
            "date": "2017-09-22T21:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 258331,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=258331"
        },
        {
            "content": "Ah, Danmachi.  With the harem/fantasy show’s legacy leaving behind such wonderful memes about its busty loli goddess heroine like the famous boob ribbon and ‘Hestia is Bestia’, it’s no wonder the show had a tough time having a complete positive footing in the anime community due to various aspects about it like its multitude of female characters wishing to breed like rabbits with its main protagonist.  So how can you make a show like that into something that’s similar, but objectively better in comparison?  Well, for starters you could follow the source material.\r\nStory: Sword Oratoria is the Danmachi story shown from adifferent perspective.  Instead of following the adventures of the Hestia Familia with Bell and his journey to become adventurer that he wanted to be, we follow the story of the Loki Familia and its sword princess, Ais Wallenstein, as she and those in her familia unravel the truth of strange going-ons in the dungeon and uncover a darker plot happening in the town or Oratoria.\\n\\n\r\nIn contrast, the story of Sword Oratoria is a more serious take on the fantasy dungeon story of Danmachi, as it features an overarching mystery plot that those in the Loki Familia attempt to uncover as stronger and more bizarre monsters appear both in the town and in the dungeon.  As such, the plot feels a lot more serious and more involved, as the story shifts from a generally lighthearted adventure involving a boy climbing his way to the top, to that of a slightly darker story featuring a girl coming to terms with some of her demons from the past.  The overall plot just feels better written due to the fact that it feels like there’re consequences and that there truly are stakes to be had.\\n\\n\r\nIf that were the case, then we’d have no problems.  Unfortunately, the story falls flat on delivering that darker and weightier atmosphere that the story at first glance seems to promise.  A lot of the heavier and more gruesome moments from the manga are absent, and instead we’re treated to the fangirling delusions of an elf mage desperately trying to monopolize the full attention of the sword princess.  While the story is objectively better from a tone standpoint, the actual content of the series is littered with random moments of our new character Lefiya attempting to be what appears to be a shoddier attempt at being another Bell.  This results in a lot of tonal shifts that draw away from the impact of the main plot, thus not only making things a lot less dire, but also making the new character we’re supposed to support, a lot less appealing to the audience.\\n\\n\r\nThe ending is a culmination final standing point for progression to the next point of the series.  It’s an ‘ending point’ that only finishes the first part of the story that seems to be real final stakes moment, but doesn’t really feel that way when you look at everything before it.  Arguably it’s not a terrible ending, but when put alongside the journey to get to that point, things could be better.\\n\\n\r\nOverall, Sword Oratoria, while considered to be a better story due to the show’s more serious atmosphere involving character exploration and some disturbing aspects about the dungeon that weren’t mentioned before, still falls in its own pitfalls and makes unnecessary sacrifices that resulted in the show feeling less impactful and slightly more irritating to watch.  Simply put, if we cut out all of the fluff involving Lefiya’s obsession over Ais, this would’ve turned out a lot better.\\n\\n\r\nOverview:\\n\r\n+ Different and better viewpoint of the Danmachi story\\n\r\n-  Sacrificed emotional weight for less important fluff aspects\\n\r\n-  Changes from source material suffered\\n\\n\r\nCharacters:  Instead of Hestia, Bell, and the rest of their familia, we’re treated instead to Loki and the expansive (and well equipped) myriad of misfits that she has managed to raise and grow.  \\n\\n\r\nOf course, if you’re talking about someone in the Loki familia, you have to talk about Ais Wallenstein, the mysterious female swordsman that Bell idolizes after she saved his ass.  Several times.  While shown to be a cool and collected girl in the original Danmachi, Ais’s character really shines through in Sword Oratoria as its main focal point.  We’re given a look into her past and her own internal struggle, pushing her away from the idealized sword princess that everyone treats her as, and instead as someone who feels more human and wants to improve based on her current state when we’re introduced to a different side of her character.  We also get to see her interactions and opinions about Bell in a different light, and it’s really refreshing to see who I thought initially was a boring character become something that had more to her with each passing episode.  \\n\\n\r\nThen…Lefiya…  I’ll be honest; I don’t like this girl.  Lefiya is what I would describe to be everything that’s mostly wrong with this adaptation.  The show initially treats us to her as a compatriot of Ais, as the two of them are in the same familia and are often put on the same team together.  Her entire character can be described as a low level mage who looks up to Ais and wants to be looked at and praised by the sword princess.  However, what sets her apart from a certain rabbit boy is the fact that the show goes so far with her wish that it becomes uncomfortable.  When she’s not busy getting her ass saved by everyone around her, Lefiya spends a good portion of her screentime fantasizing about spending time with Ais to almost disturbing levels. It takes away any potential screentime to be dedicated to the main plot, and it detracts any likeable characteristics that this girl may have had in the first place because obsessive jealousy is not a cute characteristic.  \\n\\n\r\nAside from these two, the rest of the screentime is split amongst more commonly known members in the Loki Familia including Loki herself, some new additions to the cast, and a couple other known characters in the series that don’t get as much as a role since they’re not all that important to the story of Sword Oratoria.  In terms of development, the majority of it is dedicated to either exploring the inner workings of the Loki Familia itself and how its members interact with one another, and some of the stories of the new additions to the cast that we’re given.  I lot of it really is more akin to world building, but that really doesn’t serve as much of a problem since it only furthers expand the world and the kinds of people within the world of Danmachi, which is always a nice little extra to have.\\n\\n\r\nOverview:\\n\r\n+ Ais’s spotlight develops her well\\n\r\n+ Side cast aids in providing more of the world to the audience\\n\r\n-  Lefiya’s apparent obsessive personality.\\n\\n\r\nArt:  Made by J.C. Staff, the art for Sword Oratoria is the same quality as the original Danmachi.  The colors and animation is clear, colorful, and evokes a bright adventurous feel, the action is fluid enough for it to seem like a good enough fight scene/rpg battle for those in the viewing audience, and things are pretty consistent throughout.  It’s standard fare, nothing too amazing or anything worth getting excited over.\\n\\n\r\nSound:  Similarly, the soundtrack isn’t something that’s worth really writing home about.  The OP is cheerful and adventurous sounding, but nothing that memorable or special.  Its ED ‘Day by Day’ on the other hand is a more laid back piece that completely contrasts the supposed more serious nature of the show.  It’s a decent piece, and worth a listen to, but not really something that I’d personally give too much thought on.  \\n\\n\r\nPersonal Enjoyment:  A lot of things I’ve heard from the grapevine about Sword Oratoria is the fact that it was collectively renowned as a spin-off that is superior to the main story.  Poking through it, it certainly was of better quality at least story-wise, as had a much more involved story with aspects that the original was simply lacking.  This adaptation however wasn’t dressed to impress.  While maintaining a slightly more serious tone, Sword Oratoria always felt like it was missing something, and the struggles with the characters in their fights felt too easy when compared to the scale of the creatures they had to fight.  (This ain’t some tiny Minotaur anymore.)  Needless to say, while I really hoped the adaptation met the expectations of the original, it’s unfortunate that things didn’t really turn out that way in the end.\\n\\n\r\nDid I like this series?\\n\\n\r\nDespite that, I did enjoy the series…relatively.  Aside from the depth with Ais’s character, I really liked what they did with Bell and how they showed parts of his journey in the original story from Ais’s perspective.  It’s strange to say, but I actually liked and felt a lot more involved with Bell’s story when the camera wasn’t focused on him.  \\n\\n\r\nWhat didn’t I like about this series?\\n\\n\r\nLefiya.  Lefiya wasn’t like this in the manga, so the upped ante with her admiration for Ais to an almost disturbing, creepy, and downright mean-spirited nature towards anyone foreign who’d want to so much as talk to the sword princess was definitely not an aspect that I was a fan of.\\n\\n\r\nWould I recommend this series?\\n\\n\r\nIf you’re an anime Danmachi fan who chooses not to touch or read any of the source material, than this is probably the show for you.  The contrasts between the source material and this adaptation would make anyone who came from the manga side definitely unhappy.  Despite that, the series still keeps many of the story’s aspects intact, and is still what I would think to be a much better version of the story simply because the core aspects of it are centered more on a centralized story and characters, rather than just one character like the original. \\n",
            "date": "2017-07-01T14:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 251678,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=251678"
        },
        {
            "content": "Premise and intro \r\nDungeon Ni Deai Sword Oratoria is a spin off anime that is adapted from the manga of the same name and tells the story of the original story that is shown through the eyes of the Sword princess Ains Wallenstein, her comrade and fellow familia member Lefiya and her fellow familia members. While largely following the events of the main anime series this anime also adds in events that Ains and her friends faced in that time frame. \r\nStory overview \r\nThe overall storyline for Dungeon ni Deai Sword Oratoria largely follows the events of the anime that this anime was spin offfrom but tells the events of that story through the eyes of Ains and Lefiya and other members of their familia. While largely following the original storyline this anime also adds in several events and story arcs that are unique to Ains and Lefiya. In common with modern anime storytelling methods the overall plot of the series includes a number of sub plots and arcs that are intermingled with the main storyline. The Main focus for the series’ main storyline is on two points which is the evolution of Ain’s personality so that she becomes more human and less cold and for Lefiya it’s to master her fear while also developing her skills as a mage. \\n\\n\r\nAins \\n\\n\r\nAins Wallenstein voiced by veteran seiyuu Saori Oonishi of Clockwork Planet and Denpa Kyoushi fame is one of the main characters of the series and is one of the two heroines in this series. An adventurer of some renown within the world Ains is known as the sword princess to her both her fans and to her fellow familia members for the simple fact that she is both beautiful in appearance and deadly with her blade. Notably Ains develops two different personalities as the series progresses which also serves as one of the main points of the series story. In the beginning of the series Ains was a quiet person that while skilled in combat and having a determination to both win battles and glory for her familia did not interact much with her familia and its members. Though clearly idolized by the younger members of the familia and respected by the more veteran members Ains at this point seems to be content with being quiet and as such she was hard to approach by anyone and not someone that many within the familia got to know well though not from a lack of trying. As a result of putting up walls around herself Ains can be somewhat naive with her manners and how she reacts to situations such as her struggle to apologize to Bell during her arc. \\n\\n\r\nAs the series progresses however and as a result of interacting more with her friends and fellow familia members especially Lefiya and the twins Ain’s personality starts to change as she starts to open up her personality. Though she doesn’t exactly become more talkative Ains becomes more sensitive to the feelings of others and more understanding of the people around her. More importantly she also began to be more trusting and willing to place her trust in her allies and friends in the familia as well. I felt that Ain’s development from a beautiful but unapproachable warrior to one that was obviously more happy and positive and trusting was done pretty well and it was nice seeing Ains be able to interact more with her fellow familia members. After all, in such a group if you are unable to trust someone with your back in combat then that person is a liability no matter how powerful they are on their own. One of the main plots for the series overall storyline is related to Ains past which I felt was quite interesting and helped determine why Ains personality was like that to begin with. It also explained why Ains is so determined to become strong as well. The character of Ains and her subsequent development as a character in the series I felt was done pretty well and it was nice that Ains at the end was able to have more trust in her allies and friends and that she is now approachable by her fellow familia members. Saori Oonishi I felt did a pretty good job portraying the character of Ains. \\n\\n\r\nLefiya\\n\\n\r\n Lefiya voiced by veteran seiyuu Juri Kimura of Seiren fame is one of the main characters of the series and is one of the two heroines for the series. A young elven mage of the Loki Familia and a second-class adventurer that due to her immense magical ability is being tapped to replace her master Riveria one day. Personality wise Lefiya is a positive, cheerful and innocent person that in the beginning of the series was a bit of a klutz and as a result got scared rather easily. However, despite that Lefiya perseveres in her attempts to be strong as her main motivation for being in the familia is to be near her idol Ains which she idolizes and views as something akin to a hero figure in her life. \\n\\n\r\nAlthough relatively weak and easy to get scared in the beginning of the series as the series goes on Lefiya like Ains starts to develop into a better person and character after finding the reason and determination that she needed in order to motivate her and start her drive to become strong. As a result of this development Leafiya becomes braver, more determined and more willing to take a stand to protect not just herself but also her friends and allies as well. Lefiya’s most prominent personality trait is arguably her earnest and determined nature and the fact that she is always willing to believe in the best of people. As a result of this Lefiya is one that doesn’t give up easily and once she set on doing something she’s determined to finish it no matter what. The friendship that Lefiya managed to forge with Filvis is a great example of this personality trait of hers. \\n\\n\r\nAs a character Lefiya was very similar to the original anime’s main character Bell in that both were pretty weak to start with but both began to get stronger as they found the reason and motivation that they needed to become strong. While in Bell’s case it was to help repay the kindness that his patron god Hestia gave him for Lefiya it was her determination to be of use to both her hero Ains but also to the familia and her friends that support her. while Lefiya’s personality improved significantly over the series this wasn’t the only thing that improved as Lefiya’s ability and her true ability also manifested as a result of these changes. While she may have been weak in the beginning and vulnerable to fear and pressure the Leafiya that stood in the latter part of the series was anything but weak as by mastering her fear and learning new spells from her friends and allies have really made her a force to be reckoned with.  I felt that as a character Lefiya was developed pretty well and that her seiyuu Juri Kimura really did a great job voicing her. \\n\\n\r\nRiveria \\n\\n\r\nRiveria voiced by veteran seiyuu Ayako Kawasumi of Fate stay night fame is one of the main support characters of the series and one of Ains and Lefiya’s main allies in the familia. A veteran mage that heads the mage division within the familia and charged with training them Riveria is also a member of the familia’s upper command echelon being old friends with Finn and Gareth. A calm and composed woman that’s also wise and perceptive Riveria serves as the voice of reason and logic within the guild and helps tamper the tendency of her familia members from going wild. Being both a veteran mage and a member of the command echelon Riveria is both a powerful mage and adapt at reading the battlefield and as a result often acts as the second in command to the guild when Finn is otherwise engaged. As a result of her skills Riveria is powerful combatant and seems particularly adept at casting large scale AOE attacks that are both large in scale and powerful to a fault. As a result of being a founding member of the familia alongside that of Finn and Gareth Riveria is someone that is familiar with both Ains past and Lefiya’s struggles which actually enable her to support both when they need help. As the series progresses and as both Ains and Lefiya change and improve both their personalities and their skills Riveria is there to support them and guide them along the correct path. Though only a support character I felt that Rivera had an important role in ensuring that both Ains and Lefiya were able to find their motivations and reasons for getting stronger and guide them so that it helps them the most. I felt that her seiyuu Ayako Kawasumi really did a great job portraying the character of Riveria. \\n\\n\r\nRevis \\n\\n\r\nRevis voiced by veteran seiyuu Sayaka Ohara of Fairy tail and Aldnoah Zero fame is one of the support characters in the series and serves as one of the main villains in the series. A powerful adventurer that Ains and the familia meet during their investigation into strange events on one of the lower floors of the dungeons that lay beneath the town in which they reside Revis is someone that was deeply connected with Ains past and is an important part of that particular sub plot for the series. A formidable swordswoman that is extremely powerful and able to go toe to toe with Ains and still win Revis is a pretty mysterious person who seems to know a great deal about Ains family and seems to perceive Ains as her mother for some reason. While a formidable fighter Revis’s personality is hard to determine due to her mysterious nature but it can be seen that she is a quiet and determined person who is also highly motivated for her own goals. At the same time, it can be seen that she isn’t loyal to anyone but herself and will think nothing off turning against her own allies if the situation turns against them. While Sayaka Ohara did an excellent job in portraying Revis I feel that this character could have been expanded upon a lot more though her role in the series I felt was pretty clear cut in that she served mainly to motivate Ains to get stronger. \\n\\n\\n\r\nFilvis \\n\\n\r\nFilvis Challia voiced by veteran seiyuu Hisako Kanemoto of Unlimited Fafnir fame is one of the main support characters of the series and one of Lefiya’s main allies in the series. An elven magic swordswoman with a somewhat icy disposition at first Filvis is somewhat different from the other allies that Lefiya meets in the series as Filvis is from a different familia and they only met by chance when their familia’s cooperated for a mission. In the beginner of the series Filvis was a bit of an enigma to both her familia members and her god that she protects. In the beginning of the series Filvis was shown to be very dutiful to her patron and at the same time very loyal. However, at the same time it’s also shown that she is very quiet to the point of being antisocial. As the series progresses it become clear that this was tied to a terrible battle in the past where out of all her friends and comrades that were dispatched to hunt down a nasty cult she alone survived. As a result of this event Filvis’s which was positive and determined back then changed to one that was downcast, quiet and unwilling to make friends or allies and also resulting in her putting up walls around herself to protect herself from her perception that she brings ruin to everyone that tries to be nice to her. \\n\\n\r\nFilvis’s past and her redemption forms part of Lefiya’s plot line and was one story arc that I really liked as in addition to seeing how determined Lefiya is to help a person that she just met I also came to understand and sympathize with the reason that caused Filvis turn into such a downcast and unsociable person.  And in the end, I was that that Filvis was able to take out the monster that was the cause of her trauma and also at the same time be able to strike up a friendship with Lefiya and also help her train and become a better person as well. Filvis’s new personality which is much more positive and cheerful and more importantly talkative was nice to see. She also looks so cute when she’s embarrassed when she’s around Lefiya as well. I felt that Filvis was a pretty well-developed character that was similar to Ains and Leafiya in that she too had something that she to overcome in order to be strong but in her case, it was also to recover from her trauma as well. I felt that Hisako Kanemoto really did a great job portraying her. \\n\\n\r\nArms and animation \\n\\n\r\nIn regard to the art that was used for this series I felt that the character designs for the new characters were pretty well done. Although we already seen Ains and Bete in the original anime I felt that the character designs for new characters like Lefiya and Filvis was pretty well done. The environments that were shown in the series I felt were also pretty well done. One aspect of art that I particularly liked in this series was the design of the monsters that the cast faced with the major ones looking pretty cool and scary in equal measure. In regard to the animation I felt that overall animation was pretty good but it’s in combat scenes that the series shines at. I felt that the combat scenes were done pretty well in the series especially the last climatic battle. \\n\\n\r\nVoice acting \\n\\n\r\nVoice acting for the series I felt was pretty well done and I felt that each of the characters in the series was portrayed reasonably well by their respective seiyuu’s and voice actors. Particular praise however I felt should go to Saori Oonishi, Juri Kimura and Hisako Kanemoto who voiced the characters of Ains, Lefiya and Filvis respectfully as I felt that they did an excellent job portraying their respective characters. Sayaka Ohara and Ai Kayano who voiced the characters of Revis and Andromeda respectfully also I felt did a great job in voicing their characters though I felt that Revis should have had a larger role in the series. \\n\\n\r\nMusic \\n\\n\r\nThe music for the series I felt was pretty good with the scene music being appropriate for each of the scenes that required it. The opening theme for the series which was Re- Illusion was sung by veteran singer Yuka Iguchi and was actually quite catchy and conveyed the sense of happiness like meeting some old friends that you haven’t seen in some time. The ending theme for the series was day by day which was sung by Kano and had a positive and upbeat tune to it that seems to covey the thought that each day is an adventure and that you should always look forward to the next day and what that brings to you. \\n\\n\r\nOverall conclusion \\n\r\nIn overall Dungeon Ni Deai was an interesting anime that’s a bit different to what I seen and reviewed before. This comes from the fact that Dungeon Ni Deali is a spin off from an existing anime and takes place in the setting that was established by it rather than featuring a new setting entirely. The strong points that makes Dungeon Ni Deali Sword Oratoria such an interesting anime I felt was its strong story that focused on finding three things which is finding the motivation to improve oneself, finding a place to belong and finding a reason to get stronger, strong characters that were well developed, strong combat scenes and excellent voice acting and animation.  \\n\\n\r\nThe overall story for the show I felt was one of the highlights of the show that when combined with character development really helped in establishing the series two main characters Ains and Leafiya as characters that have evolved as the series progressed becoming not just stronger on a martial level but also in terms of personality and motivation as well. The overall theme for the main story I felt was one that focused developing the characters of Ains and Lefiya by putting not just them but also their fellow familia members into a fight against a shadowy enemy that seems to know Ains on a personal level yet is powerful and well connected enough to also pose a threat to the familia even when they have a core of veterans in their ranks. In line with modern animes the overall plot of the series featured a number of sub plots that I felt did a great job of not just showing the overall threat to the familia but also to Ains and Lefiya herself as well. Of the sub plots I felt that Ains personal quest of fighting against someone that is both more powerful that she is and yet also possesses information on the mysterious past of Ains herself was pretty interesting. Another arc that I felt was done pretty well in this series was Lefiya’s arc in which she was able to break Filvis out of her shell through her persistence and save her from the nightmare that’s been hanging over her like a shroud. Although the main focus of the story was focused on the main characters of Ains and Lefiya and their quest to become not just stronger but also more motivated to both fight and find a place where they can be of help it’s important to note that the members of the Loki familia are also featured in the main plot. These characters though we seen glimpses of them before in the original anime were featured much more heavily in this one and it was nice to see them also fleshed out as well. Watching them care about Ains and Leafiya really reminds you that a familia is very much like a large family as well. \\n\\n\r\nOne of the main highlights of this show was the characters but more specifically their development as both a person and also as a member of the Loki Familia. The main characters in this series which in this case was Ains and Lefiya I felt were actually pretty well designed and over the series developed into not just powerful combatants but also characters who had managed to find both the motivation that they needed to become strong but also a place and a purpose to their life that was missing before. Back in her base form that was shown in the original anime that this was spin off from Ains while a fearsome fighter was a rather quiet person that while certainly trusted and idolized by members of her own familia seemed to be someone that did not return this trust. Ains was someone that seemed to be someone that lived only for battle and viewed things like friendships and interaction with humans as something secondary to her. This series though did much to dispel that impression of Ains by showing not just what caused Ains personality to be so icy but also started her on the path of recovery where not just her relations with her friends and familia is better but also where her personality also changes to be more human of someone her age. The character of Lefiya though is slightly different to Ains in that while she was certainly in the original anime her role in it was relatively minor. As a result, it can be said that Lefiya is a character that this show actually introduced as a new character. In a way Lefiya’s default personally serves as a direct contrast to Ains as unlike her Lefiya was a talkative, positive and friendly person that while shy still cared about Ains and her fellow familia members. The development of both characters I felt was done pretty well and it was nice that in the end Ains had become more talkative and more considerate of other people’s feelings while Leafiya become braver and more willing to stand her ground and protect her friends.  Im also glad that in the end both managed to find both the motivation that they needed to get stronger while at the same time a place where both can belong and be of use to someone. \\n\\n\r\nSpin off anime’s though relatively common usually do not feature the original characters of the anime that spawned it as part of the main plat though there are exceptions to this role.  In this case the featuring of two of the main characters from the original anime as support characters though it made sense from a storyteller’s point of view was somewhat risky as it risked taking the attention away from the main characters. Though in this case because this anime’s main plot essentially told the story of the original anime though through the eyes of Ains and Lefiya this worry was largely unwarranted. In fact the presence of characters like Bell and Hestia only served as another point of motivation for Ains to become stronger. \\n\\n\r\nDungeon Ni Deal had always been famed for the fact that it had some pretty good combat scenes that pitted either lone adventurers or small groups against powerful groups of monsters which though something often seen in fantasy anime is also a sight to see. The combat scenes in this series I felt still managed to do a good job of showing that adventurers even lone ones can still fight on toe to toe with fearsome creatures and opponents. And that with courage and determination even faced with a powerful enemy that was powerful enough to be overwhelming even a small party would be able to triumph if they fight smart that was best shown in the climactic battle in the end of the series.  In particular I really liked the battles that Ains fought against Revis because just as the battle is about who has the most martial might it’s also about who has the motivation to win as well.  \\n\\n\r\nIn the end while Dungeon Ni Deai did have an interesting storyline and combat scenes that tied well with Ain’s past and her bloodline I felt that its main strength and what really made it stand out to me was its strong character development. Both Ains and Lefiya though featured in the original anime that spawned this was then very basic characters that well designed and acted was very bare and had no unique personality or backstory that made them stand out. In this anime, however as a result of both becoming main characters of their own right this was remedied and their development as characters served as the main plot. In this I felt this was where the anime really shined and seeing the journey that both went on and see them get stronger and find the motivation and reason that they want to become strong was what I felt this anime did best. Though Ains may have been as clueless as a ghost in the beginning and Lefiya may have got scared way too easily by the end they were anything but and this was the best reward for me I think.  \\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-07-01T10:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 251658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=251658"
        },
        {
            "content": "Personally, I was kind of scared of what they'd do with this second season after having watched the first, and absolutely loved it, and heard that they weren't going to continue with Bell but look at Ais' perspective but I started watching anyway and it started off not looking great. I wasn't really finding what I enjoyed so much about the first season, the \"shonen\" that I've been looking for during all these years of anime watching where the noble main despite having nearly been killed stands up as a shield to protect his nakama (friend ^^) and nearly kills himself in the process likeyou find in some of the big anime like One Piece and Gintama (only certain episodes of Gintama and yes, I have simple tastes when it comes to anime, please don't judge me :D). Anyway, the character they seemed to be focusing on at the start, which wasn't Ais, just made me want to hit my head against a wall. But I endured, seeing a few bits of the intrigue from season 1 develop was making my curiosity grow and after about episode 3 I started to really enjoy it, but not for the same reasons as season 1. The unfolding of the plot that had been put forward in Bell's season who had unravelled very little was what got me into it so much, and the characters also became a lot more enjoyable. \\n\r\nSo there you go, basically, it started off very shaky but after 2-3 episodes, I was fully into it. I think that the shaky start was probably because I was partially expecting to be dissatisfied with it so I recommend that if you enjoyed season 1, go into season 2 with an open mind and once you’re through episode 2, you should be hooked.\\n",
            "date": "2017-06-03T10:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 249193,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6065939.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sarutochi",
                "username": "Sarutochi"
            },
            "url": "https://myanimelist.net/reviews.php?id=249193"
        },
        {
            "content": "I would like to state in my review more reasons why the anime is worth watching because, from what I see until now, it is a bit underrated and very criticized. \r\nI started watching Sword Oratoria after I saw the original DanMachi, and to my surprise the stories aren't related at all, even though you might see the two story lines intertwining here and there. This anime is focused not only on Ais but the whole Loki Familia, it has many new characters and it provides a different point of view on an adventurer's life. \r\nThe plot is pretty good, it has a lot ofmysteries in it and it's quite unpredictable, since at this point I can't really figure out how the whole thing is going to end and who's on the good side, and who's with the bad guys. It also has plenty of action, to be honest I wouldn't mind more fighting scenes but it's not boring + if there's no action, it means you get some fanservice. \\n\\n\r\nThe animation style is pretty similar to the original DanMachi. If you liked that one, you'll like this one too. In my opinion the animation is simple, there's nothing special or unique about it that could draw your attention. It's not bad either but it could be better.\\n\\n\r\nThe sound is ok, like I mentioned about the animation too, it's plain, not special, nor annoying.\\n\\n\r\nThe worst part about this anime is that the characters (up to this point) do not show any evolution. In the 1st one you could have seen Bell growing and becoming stronger but here there's nothing. No one really improves, they just reveal stuff about each other and about their past and what made them become who they really are. However, it's interesting to see things from Ais' point of view, personally I find her quite interesting and there are some things from the original series that make more sense now, after understanding how she thinks and how the Loki Familia works together. Plus, I have the impression that the antagonist in this anime might be constructed better than the main character and we don't get to see this often.\\n\\n\r\nOverall it is an enjoyable anime. I will definitely continue watching it until it ends. It isn't as good as the first one but it has enough good points that make it worth watching!\\n",
            "date": "2017-05-30T14:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 248905,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5451611.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yisengal",
                "username": "Yisengal"
            },
            "url": "https://myanimelist.net/reviews.php?id=248905"
        },
        {
            "content": "Never forget your roots as they say and its very clear Sword Oratoria has not forgotten its.\r\nThis show was very slow to start with a character that i detested in the beginning but its one of those that takes those preconceived notions and does a complete 180. By about episode six or seven this show goes from a slow side story of Danmachi to damn whirlwind of fight scenes and good character moments. We get some great scenes of characters old and new and by the end i have a show here that initially i would've given a five or six now i'm gonna givean eight.\\n\r\nLefiya redeems herself in my eyes and becomes a lead i can enjoy watching. And i do love how for a few episodes they do take the perspective away from her and more onto Aiz showing that this spinoff is not specifically about Lefiya. It's about Loki Familia as a whole and developing many of them. That is an aspect that i love so much.\\n\r\nAlso FUCKING DRAGONS ON FLOOR 58 DAMN I BETTER SEE BELL FIGHT THOSE ONE DAY CUZ FUCK THAT WAS SWEET\\n\r\nAnyway 8/10 for this one.\\n\r\nThe latter half blew away my expectations. \\n\r\nI love this series with a passion and i'm gonna grab the next novels of Sword Oratoria when i get the chance.",
            "date": "2018-02-17T00:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 271700,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3792031.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/matthew0282",
                "username": "matthew0282"
            },
            "url": "https://myanimelist.net/reviews.php?id=271700"
        },
        {
            "content": "I watched this spin-off after completing DanMachi, and I dare to say, I enjoyed Sword Oratoria slightly more than the original. I did not read the Sword Oratoria manga or light novels prior to the series, but I am currently reading the manga.\r\nBefore people start cursing me inside their heads for my opinion, let me explain why.\r\nSword Oratoria had a beautiful story line. The story itself is far more developed than season 1 of DanMachi, and while I adored both plots, Sword Oratoria displayed to its viewers the cruel reality and wickedness of the Dungeon by constantly challenging Ais Wallenstein. The anime reminds us thatwhile the Dungeon gives opportunity to fame and prestige, adventurers will be pursuited by anguish and pain, as well as unspeakable evil and corruption that is left out of the season 1 anime. The consequences and seemingly insurmountable trials in the fantasy world is what captivates me and told me to continue. \\n\\n\r\nThrough this story, we even see development in DanMachi's \"stagnant\" character, Ais. We see insecurities in this idolized protagonist, and being “imperfect” ultimately renders her human. Her flaws, once revealed, explains more of her character, her background, and her actions in DanMachi. \\n\\n\r\nUnfortunately, people overlook the story and focus on one character: Lefiya. Lefiya is simply irritating and other than apologizing for what she couldn’t have done and telling herself she wants to do more, her fear gets the best of her many times in the show. The problem with Lefiya is that she isn’t challenged enough, and when she barely is challenged, she gives herself up to panic. Her infatuation with Ais doesn’t aid Lefiya character development as Omori has clearly illustrated that Ais is interested in Bell. Lefiya’s imagination is downright creepy when you take that fact in mind. \\n\\n\r\nThat being said, the cast of Sword Oratoria is very likeable. Since the majority of the cast had appeared in DanMachi a few times, seeing them is delightful and it’s enough to familiarize you to the spin-off. When you see the spin-off’s characters in DanMachi, you’re already intimidated by the fact that they’re perfect. In Sword Oratoria, the creators explicitly emphasize their empathetic and caring side as well as their closeness with Ais. I loved Bete, Finn, and Riveria because they complement and look after Ais when she’s faced with her shortcomings. \\n\\n\r\nWhile the ED is a little off in terms of the tone it brings to the anime, the OP is the pop song that somehow is compatible to the spin-off’s medieval fantasy world, possessing the rhythm and notes that introduces the anime itself. I loved every character’s voice and it matches so well with their respective personalities, and that adds to the likability of the cast. When Sword Oratoria and DanMachi share the same scenes, the spin-off’s voices are much more matured and consistent for their characters. The OST is deliberately composed to evoke the feeling of watching DanMachi, and along with a sense of mysteriousness and fantasy, you can hear familiar tunes in the background. In the OST “Determination to fight,” you can hear “Argonaut” from DanMachi where Bell fights the Minotaur. The OST really reflects the aura of the Loki Familia and their situations, like in the piano song for Ais played in the first episode where it reflects her dispiritedness. \\n\\n\r\nOne downfall of Sword Oratoria is the art. While it’s still good, it is noticeably a step down from the DanMachi we knew in Bell’s adventures. The manga had better action scenes than the anime itself, and it is disappointing how they chose to adapt the anime in terms of art itself. The thrill of action is lost when I watch Sword Oratoria. Nevertheless, for its story, characters, and sound, you should give Sword Oratoria a chance.",
            "date": "2018-01-09T21:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 268078,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6878141.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rheatifa",
                "username": "rheatifa"
            },
            "url": "https://myanimelist.net/reviews.php?id=268078"
        },
        {
            "content": "SPOILER FREE\r\nThere honestly wasn't much very interesting about this series. I haven't read the manga, but the whole thing just comes off as sloppily structured. There isn't even a definitive main character. You'd think it'd be Azi, but the show spends an abnormal amount of time focusing on a new character, Lefiya and her fangirl crushing on Azi. Lefiya is an incompetent mage who is very cutesy and very quickly got annoying for me. For being such a huge focus, she rarely drove the plot of mainly just tagged along with the team, needing to be saved constantly. \r\nNow you can say that Bell neededto be saved a lot too, but he was also the main driving force of the plot and always got better after each mistake. Lefiya doesn't get better until very late in the 12 episode show. The main plot isn't even about her. Honestly, I didn't understand most of the plot. It was some conspiracy about the Gods we had a lot of exposition for, but that was never resolved. \\n\\n\r\nHonestly, most of this anime feels like just set up for what happens in the manga. We learn a bit about Azi and see things connected to her past, but it's never explained and only touched upon in the last episode, because the rest of the time is spent with plots that have no weight to them and that I wasn't really interested in. \\n\\n\r\nThat being said, I did enjoy the members of the Loki familia and some of the new characters were enjoyable as well. The art and animation quality were pretty typical of an anime and as with the last Danmachi series I liked the character designs.",
            "date": "2017-09-14T06:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 257488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4785185.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Inspector-Spinda",
                "username": "Inspector-Spinda"
            },
            "url": "https://myanimelist.net/reviews.php?id=257488"
        }
    ],
    [
        {
            "content": "I've already seen the manga and the first anime before that one, and it made feel secure about the quality of the next one. So the result is: \"IT WAS FANTASTIC\" not only the story connects to the main story in a beautiful way, but it also gives it's own rhythm to follow so you don't bored over some scenes that you've seen in the first anime. It sure fills the gaps and holes left in the first one, but also gives some insights for new characters to discover and love too.\r\n    The development ofthe story and the heroes within it is so smooth and easy to follow. the art and soundtrack gave the best feelings you'll never have in other animes of course. \\n\\n\r\n    All in all this anime makes me more excited about things that will come, and i can't wait to see where the story will unfold.",
            "date": "2017-08-12T17:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 255287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5691705.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/HaroldUlric",
                "username": "HaroldUlric"
            },
            "url": "https://myanimelist.net/reviews.php?id=255287"
        },
        {
            "content": "short : anime with main character ,with   no background story or details about it , its just a shadow of the parent story feelsbadman \r\nCan't understand anything  of it if u dont wach original anime parent story \r\nAlso i need to write more to this ( cause bad review lengh policy rules)  but its nothing else to say , i did enjoy it , definitelly not to wach it again thou ,\r\nAnd no im not disapointed bcs its a spin off or alternative or  w/e its type , im disapointed on the lack of interest the producers put in thisseries , althou the concept comes from 2016 when all anime has this weird hero special abilities and magics same pattern  no originality type of setting ,that actually bores u if u wach over 24 anime each of 4 airing anime seasons \\n\r\nAlso dont make the mistake of thinking to wach this without the parent storry , u will not understand it at all,the story setting i mean",
            "date": "2017-07-26T19:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 253897,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1298811.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mr_Jhin",
                "username": "Mr_Jhin"
            },
            "url": "https://myanimelist.net/reviews.php?id=253897"
        },
        {
            "content": "An adequate time waister, not too much more.\r\nStory- If you've seen the original \"Is it wrong to try to pick up girls in a dungeon?\" You can expect a very similar premise in this take of the show. A vague evil villain behind the scenes causing mayhem leading up the release of their master plan. Nothing much to go off of here. While these events take place, unbeknownst to our hero, Ais Wallenstein and her \"raid party\" set off to run their expeditions into the city's dungeon and dive into deeper and deeper levels. It is quite difficult to nail down the cohesive narrative throughoutthis story, since there doesn't seem to be much of one. I mean you can get a gist of what is going on at a given point in time yet the show has difficulty weaving together the personal story of our protagonist with the many events which take place throughout it's world. A few less fan service scenes and girl on girl unrequited romances could have helped, but I digress. You are left with a few curiosities come the end yet few if any questions are answered. Not the greatest story to come around in recent memory.\\n\\n\r\nArt- Colorful and vibrant with consistency in character modeling. It has a professionalism to it. Some well animated and fun to watch fight scenes. Not something that really stands out but a solid job here.\\n\\n\r\nSound- Not much to say really. OP is forgettable, though the end song is quite nice. Action scenes sound fine with hard hitting sound effects and your typical fantasy music to accompany it. Though nothing stands out as bad, there are many things that don't stand out at all. I was never consciously thinking about the music or sound while watching, lets leave it at that.\\n\\n\r\nCharacters- Well, with Bell Cranel being the preceding protagonist along with his big ti... I mean Goddess sidekick, the show's main character's didn't have all too much to live up to. Ais Wallenstein is the short spoken and stoic lead who we follow along our journey. The direction can veer off and follow the stories of some of the other characters at times but for the most part Ais is front and center. I come out split on this. On the one hand it is refreshing to see a character who has a brevity to them, and at the same time it is expected to have a character emote and become \"human\" for the audience once in a while so they can empathize. While Ais does have development and a backstory to follow she seems to have only three ways to express herself; happy face, serious face, blank face. And only two of those faces help us! In all seriousness you will be invested enough in her struggle and growth to follow along her story but don't expect any Oscar nominations here. To talk about the side characters, one that really left a bad taste in my mouth was Lefiya. A new recruit to Ais' familia, Lefiya ends up becoming essentially an over obsessive pet to Ais, with nothing to her character but to gain Ais' admiration and eventual affection. There's this kind of yaoi thing going on there... Not much else to say about the rest of the cast disappointingly.\\n\\n\r\nEnjoyment- Look, with all the bad said, you can't watch the show and not have some fun. Its a fantasy world archetyping off of video game RPGs with overpowered characters and cute girl fan service. I'd be lying if I said I didn't air in to watch the show each weekly new episode. You can have some fun here just don't go in expecting anime of the year.\\n\\n\r\n6.5/10 Go watch if you have nothing better to do or if you're a sucker for everything fantasy/RPG.",
            "date": "2017-07-11T22:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 252613,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6209218.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/dannyboy765",
                "username": "dannyboy765"
            },
            "url": "https://myanimelist.net/reviews.php?id=252613"
        },
        {
            "content": "Warning possible Spoilers\r\nNow the main problem I had with Danmachi was Aiz Wallenstein she was a badass, but was very bland so seeing a side series being made for her was actually something good for her character, but that wasn't all I got from this side story.\r\nSword Oratoria is about events during the main Danmachi series except it's being seen by Aiz's perspective and just like Bell she has her own set of adventures.\r\nNow I was actually surprised there was story created for Aiz and the Loki familia because even though Bell had his own problems to deal with it seems that Aiz had evenmore difficult problems to overcome and I really enjoyed how deep the story went in some ways because we get to see some of Aiz's origins and her family which is why she is linked to this new threat of monsters that have appeared out of nowhere and why these new villains are so interested in her.\\n\r\nWe also get to see more of the Loki familia and how their reputation affects the other familia's as well as other adventurers along with what they get up to on their adventures and when they are enjoying their free time not fighting monsters.\\n\r\nIt was also nice to see the moments that were in the main series like Bell fighting the Minotaur or Bell practising with Aiz from Aiz's perspective as we really get to see what she thinks about Bell and the whole situation that is going on around her.\\n\\n\r\nNow even though we see most of the characters in the Loki familia in the main series seeing them as main characters was for the most part actually enjoyable because some of these characters are actually really likeable. \\n\r\nAiz does get a lot of character development from start to finish of this series, she does start out bland and only cares about ranking up, but she does slowly start being more open to her teammates and eventually comes to realise that she isn't alone when they are fighting monsters or level bosses in the Dungeons, we even get to see her do a cute expression which was really surprising to see.\\n\r\nLefiya who is the other main character and is an elf mage that hopes to succeed Riveria however Lefiya is annoying as hell, she has a crush on Aiz and hopes to eventually catch up to her much like Bell is trying to do and she just constantly whines about everything making her very unlikable, luckily there are a few moments where she does help out, but that doesn't happen until the last episode.\\n\r\nTiona and Tione are both twin sister's except the only difference is their bust size, these two were pretty much my favourite characters of the show because even though they are sisters their pretty different, Tiona is actually a lot more hyper and active compared to her sister whereas Tione is a bit of a Tsundere sometimes especially when it comes to people either staring at her breasts or whenever another woman flirts with her crush Finn, I really enjoyed these two in the show and luckily they do get quite a bit of screentime compared to other characters.\\n\r\nLoki is the goddess of her familia and she is pretty much a lunatic as she is always running around trying to cop a feel with the other female members of her familia especially Aiz and getting drunk however when the time calls for it she can be serious especially when the matter concerns everyone in her familia or Orario itself.\\n\r\nBete is a werewolf of the Loki familia and despite acting like an asshole most of the time he can be a badass when it comes to fighting against monsters.\\n\r\nThen we have some of the other lv 6 characters in the Loki familia who are Finn, Gareth and Riveria and each of these characters may not done much throughout the series, but when the battles get tough they turn into badasses and completely overwhelm their opponents. \\n\r\nYou also get to see some of the characters from the main series and it always felt good seeing them even though their not main characters of this story.\\n\\n\r\nNow the artstyle compared to the main series isn't done as well which makes sense since this is a side story, but there were some parts that looked good like some of the new monsters that appeared hell we finally got dragons and there were a few new locations as well, but overall the artstyle didn't look as good as the main series.\\n\\n\r\nThe battles were pretty good and intense at times, we really got to see the power of the Loki familia's and boy are they not to be messed with, the final battle as well was done brilliantly I was really on edge even though I knew these characters would survive it still felt very hectic to watch.\\n\\n\r\nThere were some moments of fanservice a couple mainly either the girls having a shower or relaxing in a hot spring, but nothing too excessive just the kind that gives you a little taste, also there was some comedy in here too and it was actually funny sometimes especially when either Loki or the sisters got up to something, but I think Loki was the biggest source of comedy in the series with her constant addiction for trying to molest the girls.\\n\\n\r\nOverall this wasn't a bad side story and it nicely expands the characters and world of Danmachi which is what I wanted from this side series, so if you're looking for extra character development for the Loki familia's and Aiz then you might enjoy this if you can put up with Lefiya's annoyance.\\n",
            "date": "2017-07-10T10:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 252475,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=252475"
        },
        {
            "content": "I enjoyed Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka Gaiden: Sword Oratoria!\r\nKeywords: Fantasy, Action, Adventure, Magic, Fanservice\r\nThis story mainly focuses on the thoughts and growth of 2 female character (Ains & Lefiya) in Loki Familia (kinda like a powerhouse guild). There're lots of strong characters in the story displaying good fighting scenes. There's also a good balance of male and female characters. However, with female characters being the main leads, you can expect lots of fanservice (mostly boobs). Overall, it teaches you to overcome your limitations.\r\nPROS\r\n+ Nice fight scenes (mostly monsters)\r\n+ The goddess (Though useless but intuitive leader type) \r\n+ Nice charactersgrowth development and interactions\\n\r\n+ Lots of strong characters\\n\r\n+ Comical scenes of Lefiya's delusions\\n\\n\r\nCONS\\n\r\n- Shallow representation of friendship btw Lefiya & Filvis\\n\r\n- Not enough side characters backstory and development\\n\r\n- Cliffhanger ending\\n\\n\\n\r\nThough not all, it was able to answer some question marks from \"Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka\".",
            "date": "2018-11-29T19:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 294949,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4620524.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Macoron",
                "username": "Macoron"
            },
            "url": "https://myanimelist.net/reviews.php?id=294949"
        },
        {
            "content": "This is not a good anime, I do not think the parent story is actually good but it's quite entertaining and is what it stated on the first episode, an underdog story. \r\nThis has no clear focus, despite 12 episodes, i can't tell u anything about the \"main protagonist\" I take that word lightly beside the stuff in the 1st season of the parent story even then they barely had further growth.  We do not know the characters weaknesses, strengths, them acting like a team, they do not feel like friends just associates. I do not know about the light novel but this isstraight up trash character and story wise.\\n\\n\r\nArt itself not bad, but nothing great, It had some decent art design and some fair sound design. \\n\\n\r\njust watch the parent story, this does not do anything to improve or expand the source material. Also has no of the most pathetic characters I know fucken Lefiya the voice actresses I got no idea who told her to what she did, also such a crap script. The fact this got 7.1 is embarrassing and shows how half these people cannot judge a show, but just see pretty images and design animated sequence and consider it 7/10. \\n\\n\r\nMy overall grading is 4/10, whereas my enjoyment 3/10. I did not think Bell is a well-written character but after watching these u basically beg for him to come back.",
            "date": "2017-09-09T21:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 257217,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Nerd_Zone1",
                "username": "Nerd_Zone1"
            },
            "url": "https://myanimelist.net/reviews.php?id=257217"
        },
        {
            "content": "So this is just a spin off series and not season 2, don't expect anything good. The Story and the Characters were both terrible. Cringy as hell and didn't make a lot of sense. The Art was pretty good with pretty good fight scenes, but the poor characters ruin the fights with too much nonsense. The Sound was pretty damn good at the fight scenes cuz Danmachi does one hella of a job with the music. THHE MC IS SUPER FREAKING ANNOYING AND STUPID I HATED HER. Overall I'll give it a 5/10. Only reason someone would watch this is if they either loved Danmachior they wanted a bigger picture cuz don't come here for any character development.",
            "date": "2017-08-09T20:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 255089,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955529.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SKXeno",
                "username": "SKXeno"
            },
            "url": "https://myanimelist.net/reviews.php?id=255089"
        },
        {
            "content": "It's not the kind of anime where we'll have a lesson to carry for life (though most of the animes actually don't give this kind of feeling to be carried in my opinion), but it's actually a very enjoyable one. \r\nI'm sorry to tell this to all of you fans of the original story, but are you guys blind or something? What we've got from story in the whole 1st season? Bell Crannel defeating a minotaur, Bell Crannel getting one more loli to the harem, Bell Crannel facing some random monsters with the Cheatsgornaut, and a mysterious witch or something like this, that seems tobe about to give her virginity to him (but never actually revealed), and that's about it.\\n\\n\\n\r\nMeanwhile, in Sword Oratoria, plot already begins to be developed from episode 4 forward. And even though some episodes were weaker, and some stronger than episode 4 itself in the series, it still didn't disappoint me at all, cause by little it can be, every episode from 4 onwards adds something to the plot. And the mystery instigates you to continue watching it. A mysterious Tamer girl, calling Ais by the name of Aria. Who, or what's is Aria, after all? What's the so spoken of mystery that's hidden on Floor 59? These inputs, in my opinion, were things that turned this series far more interesting than Bell's. \\n\\n\\n\r\nI just hope this ending doesn't disappoint me, because running to one episode only with the seemingly many things yet to be explained appears to trigger some kind of let-down feeling inside of me. But even if the end is disappointing, it still won't carry away the exciting feeling I had throughout the series, with the development brought episode by episode after episode 4 (feeling that I didn't have while watching Danmachi 1). Give it a shot, anyways! I bet you won't regret!\\n\\n\r\n    EDIT: I've just finished Episode 12 now, and like I was expecting already, it wasn't a clarifying ending, but at least it was somehow concluded, and some details added more trama and mistery to the story. Unfortunately, I believe we will never have a second season following this storyline, which is really sad, 'cause it'd be really fantastic, as more things could be revealed. It wasn't, of course, a fully satisfying ending, but I enjoyed it quite a lot, it had a good final battle, presenting some minor, small flaws here and there, but those yet can't take away the quality to it, so I maintain my 8/10! We gotta analyze that it is a 12-episode running, so it's not like every single detail the story has to give can be transpassed in one single season. Again, I really don't feel like we'll get a second season, which is quite depressing, but to me it was a very well builted and scalated season to the anime, and perhaps the best one so far in 2017. \\n\\n",
            "date": "2017-06-29T22:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 251472,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6227650.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RulezAPower",
                "username": "RulezAPower"
            },
            "url": "https://myanimelist.net/reviews.php?id=251472"
        },
        {
            "content": "I'm currently watching this about 10/11 episodes in, I can't really remember at the time of writing this what episode number I've most recently watched is but I  do remember each of the episodes so just take my word for it that it's near the end of season.\r\nLet me first start off by saying that I am a huge fan of the original Dan Machi anime, as it was my first in terms of starting to watch anime. Of course that may result in some nostalgic bias but I think that allows me to be just as critical, especially for this spin off.\r\nStory\r\nTo beginwith, the story. Before the series started, when I heard that Dan Machi was returning I was so excited. Not knowing the nature of the series and just instinctively expecting just a second season, I was looking forward to a reminder of why I loved the first instalment. I was very disappointed. It's important to know that is not a continuation of where season 1 left off, and in fact offers nothing on top of what happened last time in my opinion at least. I feel like the season 1 story wasn't by any means outstanding in it's story, but the simple idea of a guy trying to become stronger even if that was surpass someone and being so good at it is just a no brainer. \\n\\n\r\nThis spin off does not follow that, yet I suppose I guess that seemless role has been given to other characters. This series is basically just a viewpoint from outside the POV of the main character, Bell, from the last season. It's sort of as if in a game where you're third person behind you're character you have the ability to go into a sort of camera free-mode and fly around to anywhere in the map to see what the antagonists or allies are currently doing at the time you have paused, and it's like that for the progression of this spin off. Yet in this series, it doesn't deliver any thing I was looking forward to. We were introduced to basically an entirely new story, because in season 1 there was no real evidence of what is happening in this spin off having an affect on the story so it makes me think even more that this was a pointless addition to the Dan Machi story. Sure, it gave some kind of insight into the thoughts of other characters during the main characters adventures/events but they felt so irrelevant and not even believable that at times I assumed that the writers were held at gunpoint to give these people a backstory or motive. For example, one of main characters present and important to the MC in the first series Ais Wallenstein is now being presented as having internal troubles with wanting to become stronger and although I find this a admirable motive especially alongside Bell, it just feels so out of character when she then later in a more recent episode is, at least my view, been made out to be as if she has to contend with Bell? In their training(to keep it brief and non spoilery), I get the assumption that she is about to scream at Bell and force him to give up his secret to becoming so powerful, yet in the original series we're led to believe she's just a naive fighter who is seeing something in her time with Bell which I find much more enjoyable. It's just not what I was expecting, especially when I had high hopes this was a second season. \\n\\n\r\nTo put it simply for the story, they've tried to expand the universe or depth of  characters we sometimes see in the main series as side characters and give some kind of reason for problems occurring yet they don't even seem to have had any affect whatsoever when looking back over, so it felt almost pointless.\\n\\n\r\nArt\\n\r\nIn terms of art, there really isn't much to say, yet once again I must refer back to the first or orignal Dan Machi season. Some of the fight scenes were definitely spectacle, and the animation combined with radiant colours during  them made them all visual pleasures. I would reference some of the scenes yet of course that would be spoilers in a sense, but I must say they were very memorable for me especially when considering it was my first anime, and I was enraptured by the sleek and smooth movement on screen. It definitely felt like there were more frames per second per say, as moments felt much more cinematic and higher quality if that makes sense. This is important when comparing it to Sword Oratorio.\\n\\n\r\nThis spin off can only really be described as lack lustre. I am not sure if this is because I am already holding the grudge of it not being a second season and am naturally pessimistic, or that perhaps it is actually just at a lower quality, but it must be said that the cinematic spark from last time was not present. Whatever fight scenes there were did not feel as vibrant or 60 FPS as before, and can be probably be portrayed as if they didn't have as much of a budget to fund the flashy things with. Of course this is understandable for a spin off, but then one has to wonder why you would attempt to replicate the series which I'd say was popular because of the inclusion of such animation and visuals in general. You couldn't really feel the emphasis of blows or movement, and so you couldn't exactly get riled up within a battle. That's all there really is to be said about art.\\n\\n\r\nSound\\n\r\nSound played an important part in, once again, the original series. Battles were made that much more emotional and dramatic with the effort of the score in the background. Most notably, the \"Argonaut/Eiyuu Ganbou\" piece that can be found on Youtube is one the most memorable and tense pieces of art I've actually recognised and felt something from when watching anime. My watch list ain't exactly full of work of arts, yet if it's only Dan Machi that made me realise that then perhaps the answer is clear that it's a fantastic piece of music, just in that one scene at the very least. In terms of diegetic sound effects, blows and clashes of weaponry are again very emphasised, and all adds together to amount to an immersive experience and all feels very weighty behind each act.\\n\\n\r\nThe spin off again feels lack lustre. It just doesn't seem to have the same hit or feeling, and I'd say is possibly because of the lack of important or engagement in the majority of fight scenes because you don't really have any reason to rally for the protagonists present since you don't care or understand for their motives, thus even if there was an amazing score occurring during one scene - I most likely missed it because the action on screen did not warrant it and there was no intensity behind the event for the music to be even be engrossing. All of this is most likely down to lack of funding or similar care that was given to the original series, yet with this being an amateur review and not really taking the time out of my very vacant schedule to go check if that was the case and it then turning out the team behind this gave it their all with the same resources available from last time - I would be very angry, as this is a pitiful excuse compared to the prior.\\n\\n\r\nCharacter\\n\r\nI think this makes up for a lot of the series, as there is an overwhelming lack of it. One part of why many people loved the original was because of the child-like ambition of Bell, the MC, the admirable but cheeky Hestia, and so on and so forth. Yet this time round, those characters from the main cast around Bell were not present at all or at the same quality. Instead, we are given other  side characters who we don't really care about and have no character development besides some first-look quirks from their limited screen time from last time, and even now with more screen time they are not being fleshed out at all. It seems the only motives we learn about are Ais, the new antagonists, other people I don't care about, and god awful Lefiya.\\n\\n\r\nLefiya is the bane of Dan Machi's existence, and is hands down the worst character to have come out of this series. I'm sure in the manga and other materials she is well motivated and much more likeable, but in this case she is a sorry excuse for a replacement for Bell. We are supposed to believe that she is someone who was always in the background and never covered in the original, yet her affect on the story is so minor that you would have never eve known she was there in the first place. I am not sure if we are supposed to be rooting for her the same way as Bell before, because she just seems so incapable and annoying that it begs the question why she is even in the Loki Familiar(circle of characters basically) in the first place. Her inability to do anything does not make her a subject of pity or compassion, it just makes me think why this is the person that I need to be following when she has some kind of fantasy to impress Ais yet does it with such nativity and obliviousness it's not even funny. She just never seems to get a chance to amount to anything, and still feels like a side character with too much screen time. Her affect on the story just makes me so frustrated because she is almost the exact opposite of Bell, and I sure hope she was not given to us as someone to be a rival to Bell because I just want to see someone shout to her our pathetic she really is, lol. She really is a horrible character, and words from my naive mind cannot possibly describe my detest for her so I can only insist you find someone who really has the comprehension to do so.\\n\\n\r\nEnjoyment\\n\r\nFor enjoyment, it does not have by any means the same spark as the original. To cover what I've said previously, it just feels watered down and at an intentionally lower quality in everything - thus I just can't really feel engaged with what is happening. It's watchable at a stretch, as there is not much reason to keep coming back each week and the only reason I did was to hope the main cast would make an appearance or there would be spectacle that was being saved up until the end, as if there was a budget was gonna be blown on a single scene. As of 10 or so eps in out of 12, there has not been. *SPOILERS* I cannot continue without saying my main reason for continuing to watch, and that was hopefully to rewatch a paramount scene in the previous/original series. The minotaur scene is by far a pinnacle moment that is the most memorable by I'm sure many fans, as everything I've referenced to prior with art, character, sound and so on is combined into a scene that even non watchers can appreciate. I just believe it is so well done, but that can not be reinforced or compared to anything that someone else may say is an even better scene from an entirely different anime series because I'm still quite relatively new to the anime scene - the passion in that single scene and the victory by the end of it is something that happens seemingly so fast but makes you want to rewatch because of the emotion that enraptures the screen. It's the cliche of beating the enemy that had beat you down once before, and had overcame the obstacles that prevented you from beating him in the first place, yet it's done in a way that can be admired by I'm sure many people as well as myself. \\n\\n\r\nNow let me compare that to the relative rehash of Sword Oratoria. Imagine if someone recreated a favourite scene of yours from any anime but with lego, that's what it felt like in comparison. Again, let me remind that this series is basically a view on the same timeline as the original series but that included a different interpretation or sort of behind the scenes of the actual MC Bell but instead with Ais or Lefiya as MCs instead. In this minotaur scene, Bell fights the minotaur while Ais and her group watch on dismay as this supposed rookie is showing true promise and talent despite them all knowing about him previously for being weak and laughable when he was victim to another minotaur which spurred the story on in the first place. Now that we have the view of Ais of that same battle, I was looking forward to this scene being a redeeming factor. It didn't really even have to do much, as I would probably would have accepted if they just did a copy and paste of the scene from the original and plugged it into this spin off yet this time around all they've really done is made it feel saturated and so much not like the same. There are times where they cut from the action and not build anything up for when the camera returns to them, so it feels so less energetic. It's nowhere near dynamic or dramatic, because they've paced it so strangely by focusing on the onlookers besides the actual action. Maybe it's just because of the context that this is not Bell we are now following but Ais and I'm so used to the scene but this is a huge disappointment and does not offer a sign of good things to come for the remaining episodes of the series or in fact redeem anything that had happened for the 10-odd episodes prior.\\n\\n\r\nOverall\\n\r\nTo conclude, it's just a let down. That it. If they had perhaps released information about the nature of the series before it had aired, then there would be so much hype which was only going to be shot down. If people had known this was a spin off, and made it clear there would be no Bell, and possibly given clues as to if this was just a taster until the actual season 2 which will come whenever (I hope) then maybe I would have seen it differently. I just think this was a poor choice to go, and I'm sure manga readers may have got some kind of pleasure behind this story and Lefiya too but for someone like me it just felt irrelevant and forced within the context I had already known. At least on the bright side it means that things can only go up from here and that season 2 will either just be better than this or just as good as the original. In terms of recommendations, obviously I wouldn't suggest you start the entire series on this and by no means should you go out of your way just to see this because with the original in mind - this just does not amount to it, is very forgettable and you're probably better off not watching it at all and just wait for season 2 with the rest of us.",
            "date": "2017-06-17T13:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 250135,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6194076.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TrapsterJ1",
                "username": "TrapsterJ1"
            },
            "url": "https://myanimelist.net/reviews.php?id=250135"
        },
        {
            "content": "We can summarize this spin off of danmachi with one word: Cancer. It has given me cancer to see this garbage of adaptation.\r\nThe main reason for my discontent can be divided into 4 parts:\r\n1- Protagonist and usurper: The story is supposed to focus on Aiz Wallenstein, on how the world looks before his eyes, but all we see is Lefiya, the elf that lesbian with sister complex that do nothing but suck Camera in each shot as if she were the protagonist and not so Lefiya is not the protagonist, Lefiya is a secondary character, a comic relief that should not even appear has robbedthe protagonist protagonist heroine in his own series. Aiz Wallenstein appeared in danmachi as a character without personality or feelings and stayed like this throughout the series, we hardly see her smile between plane and plane of Lefiya.\\n\r\nIn the manga, which is centered on Aiz we see a woman obsessed with power due to the death of her parents, it is clear that in her desire for revenge fell into madness and lost her feelings becoming a killing machine until she met To bell, something that in the adaptation is not appreciated by any part. I've come to hate that damned elf because he not only brings nothing to the plot but constantly interrupts it. I do not know what the director was thinking.\\n\\n\r\n2- Loki's family: this is an interesting part because of how many people is that family? In the manga it is clear that they are many but they are recognizable and you get an idea of ​​their number, but in the anime that is not clear because in a moment you can see the 8 protagonists, in the following scene they are surrounded by a crowd And in the next shot they are back to being the 8 single ones who are those people who were eating with them? Loki's family is like a metal bar in the sun dilates and contracts with convenience and above all whenever the rest of the family appear are totally different people than we have seen until a moment what happens with That family Are you casting members and recruiting new ones like going to the supermarket?\\n\r\nThe other reason for my anger is the lack of chemistry between them, there is no indication of the supposed closeness between people who are supposed to be living under one roof. Riveria is supposed to play the role of mother and sister for Aiz and that can be seen in the manga when he gives advice to surround Bell or when he mocks her for letting the albino escape, they are touching scenes that reveal that Aiz does not Is alone despite having lost her parents and has people who love her and care about her, but in the adaptation Riveria does everything possible to avoid a situation of familiarity, it is more can be appreciated that every time she appears In scene tries to escape of her releasing some serious and cold phrase, there is no interaction neither with Aiz nor with the pallum nor with the dwarf, it gives the impression that Riveria hates the Loki family and only protects them because it seems that its goddess well Has been ordered, that is appreciated in the first minute where green worms are destroying the alleged family and she is left with folded arms, more is sent to Lefiya, a useless elf, to solve the situation but seeing that she can not Ede takes care of all the worms herself in a second what did it cost him to do that from the beginning?\\n\r\nBut the Loki family is not the only one who suffers this change, so do the Hermes where they eliminate to eliminate the majority of its members, which coincidentally, die in the manga, here do not even show them and above all At the end Hermes leaves saying that he has lost members of his family, to which members he refers? Because they have entered 5 to the dungeon and 5 were the ones that left who are supposed to have lost?\\n\\n\r\n3- Cut and recycled scenes: This part goes back to the beginnings, to chapter one, where it most hurt to see how the first chapters of the manga explaining what the Loki family conforms to, what they are Doing in the dungeon at that time and their interaction between them is a form of presentation but as we assume we all have the two sleeves and the novel we know as they are but what if I have not seen anything like that? And if it is the first series of danmachi I see? Not only will not I understand a shit, but the way they are introduced to the characters will give me everything that happens to them throughout the series.\\n\r\nThe initial battle against the monsters takes place outdoors in a glass floor, the Loki family faces a varied army of monsters. In the anime no, we put them in a corridor and that only minotauros burst and we complained about the bullfights?\\n\r\nThe appearance of the new species in the manga catches them all by surprise while in anime they appear as if nothing coming out of the cave saying \"hello whats\" and above all they have skipped the battle of Aiz against the final boss has been skipped because yes , There was an end boss leading these worms and for some reason I do not know we skipped that epic scene, then everyone gives importance to the fact that green worms have appeared as if it were something to worry about, when they have been charged at all in the First minute and without effort.\\n\r\nThen to recycle scenes of the Danmachi anime as reminding us that this is a Spin off over and over again, that can be noticed in the battle of Bell and the minotaur, it is supposed that that battle must be seen from the perspective of the Loki family and Not in a cut and paste, is that we have literally returned to show the same battle of the child and the bull.\\n\r\nThe elimination of so many scenes damages not only the characters but the pace of adaptation and above all to their quality.\\n\r\nThe biggest problem with this adaptation was trying to put 75 volumes of 50 pages each in only 12 episodes what could go wrong? Perfectly could animate only one part and leave the other as a possible sequel, do not call me crazy, but I think a series of quality with sequels produces more benefits than this.\\n\\n\r\n4. The enemies: If you have read the manga you will notice that the enemies that Aiz faces are charismatic people, with their own thoughts and ideologies and above all have personality along with a particular way of doing things. Here they miss all this, show Revis as a flat villain who tries to catch Aiz for convenience of the script because in the manga at least has a reason for their actions. Olivas Act is stripped of personality, charisma, intelligence and everything that could be considered interesting in a character of its caliber reducing it to be an enemy even flatter than Revis that on top behaves like a stereotyped villain of the 90s, da Shame others from the moment he leaves and by how he performs things seems that man suffers a severe mental retardation, in the anime Olivas Act is not an antagonist, he is a madman who has escaped from the asylum, is not dangerous is just idiot , But the protagonists refer to him as someone who can beat them but does not do anything what is supposed to be dangerous? And above all besides eliminating the epic scene of fight against Bete, the werewolf, also eliminate his army, where are the suicidal members of Evilus? Did they suppress them only because they exploit themselves in Al Qaeda terrorist plan? Because if not, I can not find another reason.\\n\\n\r\nThis adaptation is the worst they could have done to the series, when people read the manga will enter a totally new world where almost nothing that was shown will be the same. I have taken a tremendous disappointment because I expected more of something that had potential. I do not recommend this anime to anyone at all because it could not be more generic and unbearable and I do not say it just to see the disgusting face of Lefiya every minute.\\n\\n\r\nThanks to google translation to allow me rewrite this review.",
            "date": "2017-08-05T17:10:00+00:00",
            "helpful_count": 0,
            "mal_id": 254775,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6415138.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Nazar91",
                "username": "Nazar91"
            },
            "url": "https://myanimelist.net/reviews.php?id=254775"
        },
        {
            "content": "my review pretty much reinforces what i see most people on here feel. I really enjoyed danmachi with bell and i was excited to hear about sword oratoria, while it wasn't a new season it was said to be from Aiz's point of view. I fully believe going into it thinking that was one of the reasons I didn't enjoy it as much. While some of the moments with Aiz were enjoyable (for me at least), they were few and far between. Instead this story focuses on Lefiya, a girl in her familia who is obsessed with her and frankly, is down right annoying. \r\nSwordOratoria is worth the watch is you're interested in learning more about the Danmachi setting but before you start be warned, this isn't \"The Ais Show\" most fans were hoping for.",
            "date": "2017-06-18T20:18:00+00:00",
            "helpful_count": 0,
            "mal_id": 250302,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/537829.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GregRocks",
                "username": "GregRocks"
            },
            "url": "https://myanimelist.net/reviews.php?id=250302"
        },
        {
            "content": "The anime is basically a sidestory to the original anime and it's nice to see the other side. That being said, this feels incredibly rushed without much effort on the storyline - basically like all the videogames made for disney movies. \r\nalthough the worst part is the character known as Lefiya. Her voice is sooooo high pitched - enough to give you a headache. And for some reason the story revolves more around her, than on Ais Wallenstein or Bell. And for some reason she can't shut up! Ever! Oh, and she is lesbian and in love with Ais for some ridiculous reason because whynot? Without her this would've been watchable. I've never written a review in my life, but this Lefiya is probably one of the worst designed characters you will ever come across. I don't know how old she is supposed to be,, probably somewhere around 13-16 but she reminds me of Ilya from Fate/Prisma Ilya (approximately a 10-year old) without the satire. Seriously, I've never written a review just because I didn't bother, but this character pisses me off beyond belief. \\n\\n\r\nWhy shouldn't I watch this anime?\\n\r\nYou shouldn't watch this if you value character depth or a great story line. \\n\r\nYou shouldn't watch this if you expect it to be a sequel.\\n\r\nAlso turn the volume down so you don't get a headache. \\n\\n\r\nWhy should i watch this anime?\\n\r\nYou should only watch this anime if you are really curious about the vague link between Ais' life and the original story. The link only get more vague as you watch this though. The only reason I'm watching it is because there are (luckily) more characters than Lefiya present.",
            "date": "2017-06-12T23:57:00+00:00",
            "helpful_count": 0,
            "mal_id": 249796,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 1,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/magnusjun",
                "username": "magnusjun"
            },
            "url": "https://myanimelist.net/reviews.php?id=249796"
        },
        {
            "content": "Even though this is running parallel with the first season i still like it. We get a little bit more bacstory about Aiz, but i still miss Bell. The new main, Lefiya, is utter garbage. She is annoying as fuck, and in general just feels like a filler character. \r\nThis season has the same art as the previous one, and personally i think that is a good thing. Nice intense fightscenes and some pretty good animation in general. \r\nThe sound is nothing special, i dont really notice it much to be honest.\r\nThe story had a good concept, but is not really reaching it's potential. Theintroduction of Lefiya feels like a handicap to the story, and there isn't really that much progress in general.\\n\\n\r\nOverall if you liked season 1, this is still allright, bu t not nearly as good. \\n",
            "date": "2017-06-10T14:29:00+00:00",
            "helpful_count": 0,
            "mal_id": 249648,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5606309.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Aagaard221",
                "username": "Aagaard221"
            },
            "url": "https://myanimelist.net/reviews.php?id=249648"
        }
    ]
]