[
    [
        {
            "content": "Kimi ga Aruji de Shitsuji ga Ore de also known as They Are My Noble Masters is an anime originally based from an adult visual novel game for PC. It was later released for the PS2 with the adult contents taken out. Finally, the anime version was released in early January of 2008.\r\nThey Are My Noble Masters (anime version at least) is safe to watch by any age group and both genders. In fact, I recommend anyone to watch it on their spare time. But ecchi-oriented viewers should be warned, the anime itself is pretty \"innocent\" so one might get disappointed if raising the ecchistandard too high. With that said, the anime is still very entertaining and should be watched.\\n\\n\r\nStory:\\n\r\nAt first, this may seem like another ordinary maid/butler/master series with random events to fill up each episode. But in actuality this anime has a deeper story to it as first hinted on episode 1. \\n\\n\r\nArt:\\n\r\nBoth the artwork of the anime (characters, settings, etc) should not be disappointing to most viewers ... afterall if the artwork is terrible, I doubt the visual novel will be very good selling.\\n\\n\r\nSound:\\n\r\nThe only department that's a bit lacking in my opinion. There just wasn't any theme song that is particularly outstanding that I can recall (sadly the OP and ED were so-so as well) ... NOT terrible, they are just okay (they do fit some scene occasionally).\\n\\n\r\nCharacter:\\n\r\nAnother one of the strong point of the anime. Through each little event in the series, character relationships are developed and over time one will come to understand the characters more and more ...in the end, one will have a good understanding of each uniquely developed character.\\n\\n\r\nJust to name an example:\\n\\n\r\nWhy Shinra is attached to Miyu but not Yume was explained half way through the story. Later on they were able to talk things through and strengthen the bonds between them. \\n\\n\\n\r\nEnjoyment etc\\n\r\nI definitely enjoyed the anime a lot more than I first expected. The fact that they have the right voice actor animating a particular role just made it even more entertaining (watch and you'll know what I mean). This will be glaringly obvious to anyone who have watched G Gundam.",
            "date": "2008-08-27T14:46:00+00:00",
            "helpful_count": 117,
            "mal_id": 7487,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=7487"
        },
        {
            "content": "They are my Noble Masters is ecchi harem with a great story. That pretty much sums it up and if any of you out there have watched a lot of harem, you'll know it's a rare thing when it has a story at all. What was great about this anime is that the story doesn't apologize for itself - it is what it is. The eldest sister, Shinra, is a weird cross between a tsundere and a deredere with potent perverted instincs. She's so unique, that she alone is worth watching this series.\r\nBut the supporting cast minus maybe one or two characters are all well-developedand you find you know them intimiately by the end of the series, which is another rare thing. The theme of this story is essentially this trio of rich sisters who lost their parents, taking on delinquents or orphans like them to become their butlers and make them a part of their family. And what's great is that this anime never loses that theme, not for a moment. Most anime will introduce a theme and then forget it two episode in in order to dispense with the cliched nuances of harem anime. So, by remembering the theme, this anime accomplishes so much. I wanted 30 more episodes of this anime simply for that reason. It was refreshing and I fell in love with the people.\\n\\n\r\nThere were some minor problems. The relationship between Shinra and Ren could have been developed more, but the animators chose to put it off most of the time in order to stuff each episode with Shinra basically molesting her chief maid and her lolita-looking younger sister. It wasn't bad (it was very good, if you get me. hehe), but romantics might be a little disppointed until the last episode. Also, as mentioned before, this series was just too short, but it's because it was so good. So it's a win/lose proposition.\\n\\n\r\nI would recommend this to any guy. (I just don't see how girls could enjoy this.) It's certainly among the best out there and considering it was released in 2008, I'll have my fingers crossed for a second season.",
            "date": "2008-10-11T23:26:00+00:00",
            "helpful_count": 72,
            "mal_id": 8614,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85600.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mcjazzman32",
                "username": "mcjazzman32"
            },
            "url": "https://myanimelist.net/reviews.php?id=8614"
        },
        {
            "content": "They Are My Noble Masters is a Harem, Ecchi, Romance, Comedy that pays more attention to its extremely ecchi fanservice rather than the actual romance or comedy.\r\nThe series is about a brother and sister (Ren and Mihato) who ran away from home in order to start a new life together and after a turn of events, they end up working for a famous, rich Kuonji family consisting of 3 sisters (Shinra, Miyu and Yume). Surprisingly this anime has an underlining story to it but for the most part it is full of random mini stories/adventures that have little relation with each other. Each episode spendsit&rsquo;s time either focusing on a specific character or theme, usually involving Ren getting to know one of the girls, so the series never gets entirely boring and it becomes slightly dramatic later on.\\n\\n\r\nThere are plenty of characters in this short series and each with their own unique personality. Nevertheless only a few of them seem to get plenty of attention, while the rest barely get any screen time. But at least they all get their own moment to shine.\\n\\n\r\nI must say that the quality of the animation is somewhat good with a lustrous colour palette, for the nicely drawn backgrounds and characters. But most of the effort seems to go towards the fanservice, which is a good thing I suppose. The music can only be described as very upbeat and even though it&rsquo;s good, there&rsquo;s nothing special about it.\\n\\n\r\nOverall They Are My Noble Masters proved to be a very enjoyable ecchi, comedy with quite a few parodies for the hardcore anime fan to enjoy. There&rsquo;s plenty of tasteful fanservice and adult humour for any guy to enjoy as well but sometimes it does feel a bit excessive. At least this anime has creative ways of censoring nudity XD. In the end this series did prove to be somewhat dull compared to its superior counterpart (Hayate no Gotoku) but if you just feel like watching something entertaining and extremely ecchi then be sure to check this out.\\n\\n\r\n^_^",
            "date": "2008-04-01T04:35:00+00:00",
            "helpful_count": 61,
            "mal_id": 3525,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=3525"
        },
        {
            "content": "KimiAru\r\nKimiAru was very good to my surprise and not because of the story or the art but because of the enjoyment you get from this, it really attracts you with the characters and the comedy is just as good as the parodies.\r\nStory\r\nA simple story, two siblings ran out from their house because their father was abusive, they try to get jobs but they fail, one day he saw a blonde girl that was going to faint, he catchs her and brings her to her house and it happens to be a mansion, her sister convince them to give them a job and from there startswhat is a simple but good story.\\n\\n\r\nArt & Animation\\n\r\nThe art style was very good for being an anime aired on 2008, the animation is just as good, the character design is good and the art from the background was really good too.\\n\\n\r\nSound\\n\r\nThe sound and background music was very good, the voice acting was very good too and the OP and ED were good.\\n\\n\r\nCharacter\\n\r\nThis is one of the strong points of KimiAru, all of them are really great, they weren't cliche and they all have their back story that makes them even more likeable, Ren is really relatable and you can't choose who you want to see him with, because all the girls are really great and Tajiri was freaking hilarious, i really liked Natose she was kind even if she didn't look like it the first time you see her and Kuki Ageha was great\\n\\n\r\nEnjoyment\\n\r\nThe comedy and the parodies makes this even more enjoyable, it was great and the ecchi elements too, after completing this i wanted more and i saw the alternate story MajiKoi where the only character that appears again is Kuki Ageha she is such a Badass.",
            "date": "2015-08-05T14:37:00+00:00",
            "helpful_count": 22,
            "mal_id": 195249,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195249"
        },
        {
            "content": "Note: I may have been comparing this too much with Hayate no Gotoku. This review is from a man who has watched it first, I would probably have given this a higher rating if I had watched this first.\r\nStory: Your basic maid/butler story. Ren and Mihato have ran from their home and looking for a job, and all of a sudden, they find themselves working as butler/maid for the ultra-rich Kuonji family. Based on an Eroge, it contains scenes that shows relationships between Ren and all those sisters. I like how they gave enough attention to all of the chars.\r\n7/10\r\nArt: Not very good, and thescenes where they &quot;tried&quot; to make comedic moments were sometimes not-so-well drawn. Despite that, I think they've found amusing ways to censor nudity^^ Average drawing+ good ways to censoring = Not the best, but not the worst either.\\n\r\n7/10\\n\\n\r\nSound: Definitely not good. The seiyuu cast usually lacks emotions. You all know the scenes where something strange happens and a character changes their voice to mark some entertaining remark. Well, it just doesn't happen right in this anime. This may just be because I'm watching Lucky Star again (which has an awesome seiyuu cast,) but they really aren't the best. Background music was average. OP wasn't that bad, but I certainly didn't wait for it to finish. The ED wasn't so bad too, mainly because I listened to it every episode (due to various reasons &gt;_&gt; guess why ^^)\\n\r\n5/10\\n\\n\r\nCharacters: The Kuonji family were unique in my opinion, and they really provided me a reason to watch this anime (other than ecchi.) What I didn't like was that the others didn't have good backgrounds. Ren's background is the same as Hayate's, Mihato acts too much like Maria-san (calm looking but can be very dangerous,) and also the cooking scenes where she cuts various animals and we see blood is too much like psycho Kaede (Shuffle!)\\n\r\n8/10\\n\\n\r\nEnjoyment: As a healthy young man, I enjoyed watching the ecchi moments. I didn't realise that I like this anime until it finished (which really left an empty hole in my heart.) I think I liked watching one episode a day, it was about the right amount for my daily ecchi needs.\\n\r\n9/10\\n\\n\r\nOverall: Please, do not ask me how I got 8 for overall while I have two 7s and a 5. Lets call it being a man. Ecchi gave me enough reason to watch, the Kounji sisters made it interesting enough, and the end made me want for more (and made me want for its eroge - not translated yet unfortunately.) My advice would be to watch this before Hayate no Gotoku or other animes that have very powerful seiyuu cast.\\n\r\n8/10",
            "date": "2008-05-14T13:18:00+00:00",
            "helpful_count": 10,
            "mal_id": 4723,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4005.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DaBigD",
                "username": "DaBigD"
            },
            "url": "https://myanimelist.net/reviews.php?id=4723"
        },
        {
            "content": "If you are looking for the usual\r\nharem/shonen romance/ecchi anime, this ain't it.\r\nBut it was a good weird and spontaneous romance\r\nstory.\r\nOne, there are only sporadic content of ecchi in there.\r\nSave for Shinra Kuonji's occasional tease and some other\r\ngimmicks, not much ecchi content. And that is not necessarily a \r\nbad thing. It allows the story to expand beyond the scope\r\nof the visual novel.\r\nBut, the producer could have done better. The storyline was not\r\nplanned out, and was very sporadic, with too many filler episodes\r\nfor a short series. What drives the story forward? It should be Ren's \r\nrelationship with the other girls. But, little progression is made at theemotional\\n\r\nor psychological level. There is a huge social gap between both sides. \\n\r\nThe character planning could have been better, but since this came\\n\r\nfrom a visual novel, you could not have expected anything but one male\\n\r\ncharacter along with a huge ensemble cast of girls. \\n\\n\r\nArtwork is pretty well done, and there was no action, no pan shots, no \\n\r\nheroic shots. But it was well done for this genre. The animation studio\\n\r\ndid a nice job touching up this anime. The characters look like repeats from\\n\r\nother series except for Shinra. She seems to be fresh design, and I think that\\n\r\ndesign will be used in the future for other independent female designs.\\n\\n\r\nTo conclude, good anime to watch on the plane, or something. Don't waste your\\n\r\nprime time or money on this",
            "date": "2009-01-18T23:12:00+00:00",
            "helpful_count": 9,
            "mal_id": 11675,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/136638.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zhang1222",
                "username": "Zhang1222"
            },
            "url": "https://myanimelist.net/reviews.php?id=11675"
        },
        {
            "content": "Honestly I didn't think this was going to be that great of a story but it turned out to be simply amazing.\r\nUnlike many other harem anime this one has immense character development. From the start of the anime the protagonist even states that everyone in this house is \"so strange, and unique\". Everyone compliments one another and for a bunch of insanely rich girls they are actually very thoughtful and kind.\r\nI honestly thought this was going to turn out to be one of those anime where the rich girls enslave the protagonist and make him work hard and over time warm up to him. Itactually turned out that they were all generous, and loving from the start which was a nice change of pace.\\n\\n\\n\r\nI recommend this to anyone who is interested in it.",
            "date": "2011-04-17T13:40:00+00:00",
            "helpful_count": 6,
            "mal_id": 36170,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=36170"
        },
        {
            "content": "Kimi ga Aruji de Shitsuji ga Ore de is hard to descibe. The closest thing this can be described to is Shuffle! It has a solid story, the art is good (with the exception of crowds) Some nice character progression through the story. The voice acting is exceptional. But what makes this anime truely brillant is the references to other shows. Its hard to quote due to spoilers. If you consider yourself a fan of anime then this is a must. A few references include Guren lagann, Shuffle and Fruits basket. And these are only a few, there are several per an episode. And thegood thing is it never feels forced. \\n\\n\r\nI feel this is a must watch as it is consistently funny, and ebraces the rest of the industry",
            "date": "2008-04-06T04:38:00+00:00",
            "helpful_count": 6,
            "mal_id": 3672,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48086.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VanKrackin",
                "username": "VanKrackin"
            },
            "url": "https://myanimelist.net/reviews.php?id=3672"
        },
        {
            "content": "Review #3: Kimiaru/They Are My Noble Masters\r\nStory 6/10 -- The story for this anime is very underdeveloped. There isn't much of a plot or long story, and it's more of a daily event anime that relies on comedy rather then actual story. The past is mainly focused on or hinted in this series, but the future seems rather uncertain. The story could of created more intrigue, as there was a few exciting events in this anime, however since this is based off an eroge, it seemed to me like it was struggling in choosing a genre to focus on in the storyline. \r\nArt 7/10 --Not Sure how the art compares to other animes from 2008, but to me it seemed average and i noticed a few mistakes here and there. The mansion has a beautiful exterior, and the city landscape was nice however. The character art is average, but there is some uniqueness with the style.\\n\\n\r\nSound 7/10 -- No Complaints for me about the sound. The acting is normal, OP is decent, and background is fine.\\n\\n\r\nCharacter 8/10 -- The Reason im giving character an 8 is because I liked the style the characters had in this series. Each character has there own funny quirk/personality that make them likable, and the backgrounds and pasts of each character blend in rather well. The macho butler is funny when he has screen time, and i support the little side romances this anime had on the side.\\n\\n\r\nEnjoyment 7/10 -- For an anime that came out a decade ago, I was pretty content when I first watched the series. There was some decent comedy, and the relationships between the character were nice to watch. The head butler makes things interesting with his awesome action moves, and the random comedic stints were done alright for an anime of this time. I liked Rin's character, but was annoyed with a few of his decisions. \\n\\n\r\nOverall 7/10 -- The anime lacks a solid story, but the characters mixed in with the daily life comedy is a pleasant substitute for that. Art and Sound is average, but this anime is a solid 7, and its based off a visual novel eroge. Time is an important motif in this anime, and the past haunts all these characters, but they overcome it as a rich household family of maids, butlers, and ladies. \\n\\n\r\n~Castawayz",
            "date": "2018-02-16T17:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 271656,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4700148.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Castawayz",
                "username": "Castawayz"
            },
            "url": "https://myanimelist.net/reviews.php?id=271656"
        },
        {
            "content": "I didn't really want this to be my first anime review, but I somehow had a hidden urge to write this.\r\nI hated this anime. with a firey burning passion in the first 4 episodes.\r\nMainly because that sister (sort of-ish) rape scene disturbed the hell out of me and pretty much spoiled the entire anime for me.\r\nThe it was if the anime suddenly found out it deeply offended me after a few episodes and suddenly made direct anime refrences to all of my favorite animes. (as opposed to all those other anime refrence-ing animes, to which I couldn't make heads or tails of.) They made refrenceto Rozen Maiden, Sailor Moon, Haruhi, Fruits Basket, Sayonara Zestobu Sensei, all of my beloved animes. \\n\\n\r\nIt got less creepy as time went on though, which I'm grateful for.",
            "date": "2008-05-10T21:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 4647,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/37117.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tweetlepie",
                "username": "tweetlepie"
            },
            "url": "https://myanimelist.net/reviews.php?id=4647"
        },
        {
            "content": "As usual, forgive my english. Being french makes my english sucky sometimes.\r\nBTW: SPOILERS this review might contain.\r\nBeing a butler is no easy job... all the cleaning, the washing, the exigencies of your masters and... the hilariousness that you can get.\r\nKimi ga Aruji de Shitsuji ga Ore de, also known as They are my Noble Masters (let's just call it TAMNM), is truly a good show for the target audience and the genres it wanted to touch. Me, mecha/sci-fi fan walked on this anime with this mind set: I want a mindless show that will entertain me, without being annoying. TAMNM did it perfectly!! Never hadI so much fun watching a mindless \"harem/romance/parody\" anime. Now let's get to the review please.\\n\\n\r\nStory: huh... none. Read the synopsis and you pretty much get the story. This show never tried to force you a story. You can of course see that the story follows a path of going to point A to point B. It also makes sense, but it's not one continuous story. The setup for Ren and Mihato is very well done. Instead of having them just appearing out of nowhere in this crazy mansion, they give almost a complete episode before they actually start working as butler and maid. Having Ren being beaten up by his father and running away from home later was a good sad atmosphere at the beginning of the show. For the most part, this is an episodic show. Nothing that makes it stand out, but it makes sense. 7/10\\n\\n\\n\r\nArt: The animation is nothing that stands out, but the character designs are very good. Really too much to say, it's just good art in general. 8/10\\n\\n\\n\r\nSound: Meh... generic soundtrack. It has a weird, but funny, mix of music that ranges from Classic music to almost Heavy Rock. Nothing impressive and the OP/ED were just not good. 6/10\\n\\n\\n\r\nCharacters: This is where TAMNM did his job flawlessly. A lot of ground to cover in this section. Prepare yourself.\\n\\n\r\nRen: He is your anti-lead for a romance/harem/slice of life anime. First of all, he's hot-blooded which makes him absurdly epic sometimes. He's a man of decision. He's willing to become a better butler for the sake of never had to go back to home again. Of course, he gets embarrased over some things, but he eventually gets over that and that makes him stand out of the bunch of pussies in other animes *cough* Aono Tsukune*cough* *cough*Rito Yuuki*cough* *cough*Shinji Ikari*cough*. Thumbs up Ren, you were awesome.\\n\\n\r\nShinra-sama: The first child in the Kuonji family. She's incredibly colorful. Charismatic, beautiful and mysteriously attractive. She's so awesome. She loves to tease the people that she loves and you can definitely see that in the anime. The things that she does are ridiculously funny and when she gets serious, it is at least credible. Of course, they are two parts in the anime that I think she didn't make the right decision, but at least at the end *SPOILER* she kisses Ren with one of the most intense and straight forward kiss ever. *END OF SPOILER* That character did her job with a perfect score.\\n\\n\r\nMihato: Crazy sister, but funny crazy sister. The fact that she admits having a brother complex right from the start makes all her actions believable. She really loves her brother as much as he loves her. That's another thing that stands out in this anime. They show you their very deep love for each other, but without having to go in an incest route. She's willing to let him go, but she gets depressed when she cannot spare some moments with him and that is understandable. But she never gets in the way for character developments making her a very likeable character.\\n\\n\r\nNatose: God, I love her. She is so likeable, always trying to do her best, supporting Ren in his work, giving him advice, etc. She's a perfect balance of hilarious moment and also serious moment (and that's the moment you don't F with her). The fact that she likes Ren, but only as brother, makes that show a \"different\" experience compared to the traditional harem show. That character is up there. Her backstory was also kinda sad, being the only survivor of a tsunami and seeing all her family dying without being able to do anything was touching. \\n\\n\r\nMiyu: The second sister of the Kuonji family. At the first, I thought she was going to be the generic girl that looks like a little kid, but in fact is an genius and annoys everybody with her boastfulness. I was completely wrong. She's a grown up adult, but has her cute moments. The fact that her own sister calls her loli is hilarious, when she's probably the most mature character in the show. She likes Ren, but never to the point of love, which breaks yet again the traditional harem route. She doesn't have any shame and the moment when she's getting almost molested by Shinra makes her hilarious and like the others, a very likeable character.\\n\\n\r\nYume: The third and last sister of the Kuonji family and probably the most invisible out of the three. She sees herself as an invisible person that doesn't have a strong character, which is kinda true. But she is a fluffy person and when she is in the screen, she does have a presence and you like her. She doesn't stand out, but she's not annoying and you feel good for her at the end.\\n\\n\r\nBenisu: That's the Tsundere of the show. She's looking down upon Ren, but eventually likes him. Her backstory is probably the main reason why she acts the way she does. That character was funny and interesting at times, but she also got in my nerves at some points. I just want to mention that her voice is done by someone who does a lot of hentai and it shows in episode 12... In the end she was just a good character.\\n\\n\r\nAgeha: I LOVE HER TO DEATH!! Again, first impression is never the right one. I thought she was going to be the generic evil bitch, but it turns out very differently. She is, along with Shinra, the only character that develops an affection to the point of love over Ren. Instead of being evil, she's the hot-blooded female of the show. Very strong, very strict, but she is able to acknowledge the efforts of people around her and giving rewards for that. I was happy that she got an arc devoted only to her and Ren and I was also happy that she takes a backseat for the rest of the series while still being around sometimes. That way, she doesn't get in the way for the other characters to develop. She said that she will never give up on Ren, but they didn't make this the focus, parting away again from the traditional harem show.\\n\\n\r\nColonel: That guy was so epic. The head butler of the family and you can see why. Handsome, useful, polite, strong and for the most part, hilarious. His voice sounds so good and he's such a good butler. Nothing much to say about him other that he was instantly loveable character.\\n\\n\r\nNow for the others.\\n\\n\r\nChiharu: That \"guy\" is the biggest trap in anime ever. He sounds like a girl, he looks like a girl and he has the hairs of a girl. He's just missing some tits and has a d**k in the way.\\n\\n\r\nDe Niro: An extra bonus. He's not useful to this series, but he's funny for the most part.\\n\\n\r\nAnastasia: Punish me more.\\n\\n\r\nKojuurou: That guy was ridiculously hilarious and he's voice by one the greatest seiyuu ever (Nobuyuki Hiyama)\\n\\n\r\nIwao: A sorry father. He's a total douchebag, because he cannot express himself correctly. He, fortunately, redeems himself at the end.\\n\\n\r\nIn the end, the cast of characters deserves a 10/10. They really did make the show for me.\\n\\n\\n\r\nEnjoyment: I loved that show. It was so mindlessly entertaining!! The biggest thing that I loved about this anime was the fact that they never wasted time. The show moves at a fast paced, which gives the chance to see more and more as the show progress. I was also pleased that it was only 13 episodes. Otherwise, fillers this anime would have been full off. This anime beats Sekirei in my terms of a show that was mindlessly entertaining. I also watched this anime with the mind-set that it was going to put mindless. After watching all those serious shows (Legend of the Galactic Heroes for example) it was very refreshing. Good job TAMNM!! 9/10\\n\\n\\n\r\nOther: I would like to mention the multiple references to other anime this show has made (G Gundam, Gaogaigar, Initial D, Prince of Tennis, Sayonara Zetsubou Sensei and others). The hilarious jokes of G Gundam with Gaogaigar are well placed, because of Tomokazu Seki (Domon Kasshu), Yousuke Akimoto (Master Asia) and Nobuyuki Hiyama (Viral / Gai Shishio). This three combinations of hot-blooded seiyuus was a great add to this series. I also enjoyed the fact that if you ay very carefully, there is only two characters that are in LOVE with Ren and that is Shinra and Ageha. The others certainly like him, but not to the degree of love. To wrap things up, I would like to give congratulations to Shizuka Itou (Shinra) and Rie Tanaka (Ageha) for providing great performance.\\n\\n\\n\r\nOverall: Everybody who's tired to watch shows that needs you to keep your brain open, go watch this show on auto-pilot mode. This is without a doubt a show that I will rematch when I will feel the need to relax. I really recommend it to everybody that has an interest for a stupid-but-yet-great anime. \\n\r\nIn the end 8/10 (but if I go with what my heart thinks, 9/10)\\n",
            "date": "2010-07-18T06:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 28558,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/204131.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Duskrados",
                "username": "Duskrados"
            },
            "url": "https://myanimelist.net/reviews.php?id=28558"
        },
        {
            "content": "Kimi ga Aruji de Shitsuji ga Ore de is one of the many animes that has potential to be a rewatchable anime.\r\n~Story\r\nThe Story for me was very entertaining and very romantic (In a harem sort of way).\r\nBut good things always come to an end, it was way to short to end so suddenly. But its DEFINITELY a story worth telling.\r\n~Art\r\nThe art was superb I would give it 5 thumbs up (...if I had five thumbs that is). The background was superb and the character designs are very amazing to begin with. Different character designs that truly blend with their characteristics and traits.\r\n~Sound\r\nThe Sound was goodnothing that special. But the ending of the story had a great sound effect though. The Opening theme really suits the anime well.\\n\\n\r\n~Character\\n\r\nThe Characters had all their screen times except... it was too short. Not really much of a Character development though.\\n\\n\r\n~Enjoyment & Overall\\n\r\nI was Definitely and positively sure that I made the right decision... On making this one of my Favorite Animes.",
            "date": "2009-04-29T04:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 14609,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/174067.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/eX",
                "username": "eX"
            },
            "url": "https://myanimelist.net/reviews.php?id=14609"
        },
        {
            "content": "It's not a typical harem anime; it relies heavily on the ecchi and story aspect to be successful. The overall feel of the ending is rather pleasant but nothing to really write home about.\r\nStory: 7\r\nIt has a story... per se. Each episode revolves around or focuses on a character within the household and nicely incorporates the remaining cast into each episode as it goes along. Some might find this technique appealing and fresh but it sacrifices time for development of characters that aren't pertinent to the story and are giving TV-time to \"be fair.\" However, the story boils down to Ren's interactions with the restof the people within the house (mostly the girls) and the outcome of each relationship.\\n\\n\r\nArt: 8\\n\r\nI enjoyed it. There were some scenes which were really gorgeous and stylized, but there were others that were very \"meh.\"\\n\\n\r\nSound: 9\\n\r\nThe voice acting was really spectacular. A lot of good, varying octaves and distinct voices for each character allow for each character's individual personality to be showcased.\\n\\n\r\nCharacter: 8\\n\r\nSuffers a little bit due to the inclusion of having EVERY remotely relevant character have a episode devoted to them. But the characters are awesome where it's needed the most: namely the ones that receive more screen time.\\n\\n\r\nEnjoyment: 8\\n\r\nI liked it. I would've liked to have seen a little more romance, though. \\n\\n\r\nOverall: 8\\n\r\nNot entirely harem, so if you're looking for a true-blooded harem anime, look elsewhere. This series focuses on the importance of family and does a good job at it while adding in some pretty hilarious moments; ecchi too. A solid choice of viewing for any comedy, romance, or harem lover.\\n",
            "date": "2009-10-26T00:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 20007,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243290.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Saintly",
                "username": "Saintly"
            },
            "url": "https://myanimelist.net/reviews.php?id=20007"
        },
        {
            "content": "Kimi ga Aruji de Shitsuji ga Ore de is your typical harem comedy which there are so many of these days. Going through the checklist:\r\nTheme is about the importance of family and friends. Check\r\nAll the girls are in love with the male protagonist: Check\r\nMost of the girls have large breasts which you see quite often: Check\r\nCharacters are harem stereotypes: Check\r\nMale protagonist walks in to bath while girl is naked: Check\r\nMale protagonist gets beaten up by girls: Check\r\nLots of references to other anime: Check\r\nCheesy OP: Check\r\nI could go on.\r\nI am being a little unfair. I do enjoy a half decent harem comedy now and again mainlybecause they easy to watch and you don't really have to think. Its like channel hopping and finding a trashy programme that you won't admit to anyone that you like.\\n\\n\r\nKimi ga Aruji de Shitsuji ga Ore de fits the bill perfectly and is one of the better ones around. I'm never going to give it a high mark. When I give an anime a 7 it means I enjoyed it but it is not anything out of the ordinary.\\n\\n\r\nKimi ga Aruji de Shitsuji ga Ore de has a lot going for it. The characters are likable, the story is easy to follow and the artwork is easy on the eye. However, it is not a profound piece of work.\\n\\n\r\nI would easily recommend Kimi ga Aruji de Shitsuji ga Ore de if you just want to see some fun  lightweight entertainment which doesn't work the brain and has some cheap laughs.",
            "date": "2012-09-14T10:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 72323,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1270179.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Paulwillson26",
                "username": "Paulwillson26"
            },
            "url": "https://myanimelist.net/reviews.php?id=72323"
        },
        {
            "content": "\"A maid is a mythical being that all of us have heard about, but have never seen\" - ZUN\r\nBut what about butlers?\r\nKimi ga Aruji de Shitsuji ga Ore de or They are my noble Masters in English is based on an adult visual novel adaptation with it's underpants bleached and taking the more \"parody\" comedy route a la Hayate the Combat Butler. \r\nSo how is the comedy?, well since it's a parody anime there tends to be lots of anime references here and there, from D.Gray Man to Haruhi and you can take that with a grain of salt as to whether it was funnyor not, but since LA watched many anime to get the references, the anime jabbing fun at the characters with the parody references can be rather funny...at times, as for character jabbing it's typical from your \"bleached underpanted adult visual novel adaptation\" with the main protagonist get rag-dolled and punched around.\\n\\n\r\nIn terms of characters, they are your typical butlers and maids in anime, as in their almost inhuman like due to their strength and capabilities to do whatever they're masters wanted, this especially goes to the main protagonist Ren Uesugi voiced by Tomokazu Seki and Mihato Uesugi Ren's older sister voiced by Hitomi and Yasushi \"Colonel\" Tajiri voiced by Yousuke Akimoto, but in terms of character development we do get some character arcs/episodes that give the main cast a bit of depth and why their behavior and personality are what they are, such character examples being Benisu voiced by Hyosei (her personality and how she got employed to the Kuonji's), Yume Kuonji voiced by Asuka Minamori (her \"identity crisis\" by that her not having an identity from the wacky characters in the cast), Mihato and Ren's family issues (With Ren the main protagonist getting his own separate character development of trying to be the best butler and learning from his mistakes) and the odd one enough of Ageha Kuki voiced by Rie Tanaka who had a cameo in Maji de Watashi ni Koi Shinasai! but got an entire 3 episode arc about her backstory and relationship with her own butler Kojuuro Takeda voiced by Nobuyuki Hiyama in this anime, nonetheless the character development is properly focused on the characters that needed it with some minor characters like the Colonel and De Niro (Miyu's sentient robot) just being \"support\" characters.\\n\\n\r\nNow this is a parody anime with the focus on characters rather than the plot and LA can get behind this as the plot revolves on the characters so character development and it's comedy is key and for a typical butler anime then it succeeded in the basics.\\n\\n\r\nThe fanservice however is rampant with characters mainly Shinra and Miyu being either full naked or half naked (top only) but as LA said, this is an anime with bleached underpants, thus the fanservice levels doesn't getting any higher than full nudity, if your squeamish about that stuff, then best not touch this anime. \\n\\n\r\nIn terms of animation by A.C.G.T, the animation is decent enough from the character designs to background set pieces, but it doesn't get any better than that except for all the parody anime gags that this anime in which the detail NEEDS to go up (eg. Jojo & Akagi detailed faces to the anime references in general have higher detail). Overall, the animation is nothing to gush about, it's just \"decent\".\\n\\n\r\nIn terms of voice acting, there tends to be some squeak here and there (Yume's voice actor Asuka Minamori to Mihato Uesugi voice actor Hitomi), but the voice acting is pretty decent with plenty of shouting attacks to ojouness from Shizuka Ito and Yuko Gotou and LA's bias comes in this anime but once again Shizuka Ito was LA's favourite voice actor in this series. \\n\\n\r\nThe ending finally addresses the two characters LA wanted to get developed, Ren and Shinra with their family issues (which was both hinted at multiple times) and like the other more focused character development arcs, this takes centre stage as well bringing in more depth to the two and utilizing both of Ren and Shinra's same issues and drama's together, however Shinra's resolution was handled a bit janky compared to Ren's, nonetheless the ending was \"ok\" enough as Ren and Shinra's major plotlines gets resolved.\\n\\n\r\n Kimi ga Aruji de Shitsuji ga Ore de is your typical butler parody anime with strong character development outside of the anime references gags and character jabbing. As for LA, LA thought it was actually a slow paced anime (to get things set up obviously) at first but it got better once the character development episodes/arcs entered, the fanservice slightly surprised and unfazed LA throughout. Once the anime really got into the meat of the character development arcs they gave the characters depth outside of their stereotypical archetypes and gave some pretty well drama throughout the cast as well. \\n\\n\r\nYou thought it was Shinra Uesugi voiced by Shizuka Ito would be LA's favourite character, but it was me Miyu Uesugi voiced by Yuko Gotou! (Seriously, LA has no idea why, Shizuka Ito being an ojou with the character design typical of Shizuka Ito...Shinra SHOULD BE LA's favourite character in this series, yet Miyu took LA's 1st, Shinra warmed up to LA by the final 3 episodes but still Shinra takes an easy 2nd, with Benisu as a 3rd favourite). \\n\\n\r\nIf STILL the full nudity fanservice gets you squeamish then LA would recommend Hayate the Combat Butler instead, but if your ok with the fanservice LA mentioned before, then Kimi ga Aruji de Shitsuji ga Ore de is a good choice. \\n\\n\r\nKimi ga Aruji de Shitsuji ga Ore de maybe a parody at first but dig deep into the wacky main cast and you'll get more than a parody, you'll get an anime still wanting to tell the main cast's story with all the drama and character backstories it gives...comedy and all.",
            "date": "2016-05-24T16:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 219256,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=219256"
        },
        {
            "content": "They Are My Noble Masters Review: By The-Headstrong\r\nImagine this! Two people run away from home to escape an abusive father. These two people are brother and sister,their names are Ren Useugi and Mihato Useugi, and they have nowhere to go. So guess what! They run to the city to find work! Their young dreams of freedom flowing in their minds, they search all around the city for any source of jobs that provide a place to stay. While searching for work, a middle school looking girl is talking to her miniature egg-shaped robot. She has a large sun hat on top of her head andshe takes it off, suddenly she begins to faint! The brother catches her in mid-fall, and asks where she lives. She gives the directions to her house, and they arrive at a Mansion! Their lives will forever be changed by this event!\\n\\n\r\nThey find out that the girl is in fact not a middle schooler, but a 20 year old who looks like one. She is also the sister to one of Japans greatest orchestra conductors, Shinra Kuonji, and her name is Miyu Kuonji. Ren's sister, being the observant one, notices all the servants working in the house, and suggests to her brother that they should try to get a living in job at the mansion. After an event (No spoilers for you!) they become servants in training!\\n\\n\r\nThe anime goes on to how Ren handles the curious events that unfold at the Kuonji household, such as a game of Capture the Flag to, or training to become a better butler (of which some training methods would be thought to be harsh by human standards).\\n\\n\r\nAlso on a side note, this anime is moderately ecchi, with few episodes being innocent while others not quite so. Comedy is present throughout the anime. Basically this anime is a Romantic-Comedy, so if you enjoy those, you will definitely enjoy this anime  \\n\\n\r\nThe Kounji Sisters:\\n\\n\r\nShinra Kuonji- Eldest sister, one of Japan's famous orchestra conductors, and has a love for cute things, of which she often teases her younger sister Miyu and Ren the main character.\\n\\n\r\nMiyu Kuonji- Middle sister, very intelligent, and is often declaring herself to be the classy one, Miyu does not like how Shinra sometimes almost molests her everyday or so.\\n\\n\r\nYume Kuonji- Youngest sister, still attends high school, she is the shy and easily embarrassed one of the sisters, but she has a love for manga, and hopes to write a successful one of her own.\\n\\n\r\nThe Servants of the house are as followed:\\n\\n\r\nBenisu- head maid of the Kuonji  Mansion, also is often seen with a lesbian like love for Shinra.\\n\\n\r\nNatose- personal attendant of the youngest of the Kuonji sisters, Yume, she has a dog-like feel to her.\\n\\n\r\nColonel- Head butler, and former special ops officer, seems to have almost superhuman abilities and powers.\\n\\n\r\nDe Niro- the egg-shaped robot who serves as Miyu's personal attendant.\\n\\n\r\nChiharu Kiyohara- the cliche female looking male character that is often not included in half the episodes and has little time or importance in the anime\\n\\n\r\nOther Characters who serve actual purposes:\\n\\n\r\nAgeha Kuki- One of Yume's friends and another rich girl, she has a scar on her face, and falls in love with Ren, often gives food out as a reward for good deeds\\n\\n\r\nKojūrō Takeda- Ageha's personal butler, who is basically a masochist for Ageha's punches.   \\n\\n\\n\r\nThe Story is actually good for an ecchi anime, the art is great, sound is almost perfect, the characters are diverse and exceptional, enjoyment was really good. My overall grade would be a 9.5/10",
            "date": "2012-06-24T12:30:00+00:00",
            "helpful_count": 0,
            "mal_id": 64307,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1291161.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/The-Headstrong",
                "username": "The-Headstrong"
            },
            "url": "https://myanimelist.net/reviews.php?id=64307"
        }
    ],
    [
        {
            "content": "Kimi ga Aruji de Shitsuji ga Ore de also known as They Are My Noble Masters is an anime originally based from an adult visual novel game for PC. It was later released for the PS2 with the adult contents taken out. Finally, the anime version was released in early January of 2008.\r\nThey Are My Noble Masters (anime version at least) is safe to watch by any age group and both genders. In fact, I recommend anyone to watch it on their spare time. But ecchi-oriented viewers should be warned, the anime itself is pretty \"innocent\" so one might get disappointed if raising the ecchistandard too high. With that said, the anime is still very entertaining and should be watched.\\n\\n\r\nStory:\\n\r\nAt first, this may seem like another ordinary maid/butler/master series with random events to fill up each episode. But in actuality this anime has a deeper story to it as first hinted on episode 1. \\n\\n\r\nArt:\\n\r\nBoth the artwork of the anime (characters, settings, etc) should not be disappointing to most viewers ... afterall if the artwork is terrible, I doubt the visual novel will be very good selling.\\n\\n\r\nSound:\\n\r\nThe only department that's a bit lacking in my opinion. There just wasn't any theme song that is particularly outstanding that I can recall (sadly the OP and ED were so-so as well) ... NOT terrible, they are just okay (they do fit some scene occasionally).\\n\\n\r\nCharacter:\\n\r\nAnother one of the strong point of the anime. Through each little event in the series, character relationships are developed and over time one will come to understand the characters more and more ...in the end, one will have a good understanding of each uniquely developed character.\\n\\n\r\nJust to name an example:\\n\\n\r\nWhy Shinra is attached to Miyu but not Yume was explained half way through the story. Later on they were able to talk things through and strengthen the bonds between them. \\n\\n\\n\r\nEnjoyment etc\\n\r\nI definitely enjoyed the anime a lot more than I first expected. The fact that they have the right voice actor animating a particular role just made it even more entertaining (watch and you'll know what I mean). This will be glaringly obvious to anyone who have watched G Gundam.",
            "date": "2008-08-27T14:46:00+00:00",
            "helpful_count": 117,
            "mal_id": 7487,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=7487"
        },
        {
            "content": "They are my Noble Masters is ecchi harem with a great story. That pretty much sums it up and if any of you out there have watched a lot of harem, you'll know it's a rare thing when it has a story at all. What was great about this anime is that the story doesn't apologize for itself - it is what it is. The eldest sister, Shinra, is a weird cross between a tsundere and a deredere with potent perverted instincs. She's so unique, that she alone is worth watching this series.\r\nBut the supporting cast minus maybe one or two characters are all well-developedand you find you know them intimiately by the end of the series, which is another rare thing. The theme of this story is essentially this trio of rich sisters who lost their parents, taking on delinquents or orphans like them to become their butlers and make them a part of their family. And what's great is that this anime never loses that theme, not for a moment. Most anime will introduce a theme and then forget it two episode in in order to dispense with the cliched nuances of harem anime. So, by remembering the theme, this anime accomplishes so much. I wanted 30 more episodes of this anime simply for that reason. It was refreshing and I fell in love with the people.\\n\\n\r\nThere were some minor problems. The relationship between Shinra and Ren could have been developed more, but the animators chose to put it off most of the time in order to stuff each episode with Shinra basically molesting her chief maid and her lolita-looking younger sister. It wasn't bad (it was very good, if you get me. hehe), but romantics might be a little disppointed until the last episode. Also, as mentioned before, this series was just too short, but it's because it was so good. So it's a win/lose proposition.\\n\\n\r\nI would recommend this to any guy. (I just don't see how girls could enjoy this.) It's certainly among the best out there and considering it was released in 2008, I'll have my fingers crossed for a second season.",
            "date": "2008-10-11T23:26:00+00:00",
            "helpful_count": 72,
            "mal_id": 8614,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85600.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mcjazzman32",
                "username": "mcjazzman32"
            },
            "url": "https://myanimelist.net/reviews.php?id=8614"
        },
        {
            "content": "They Are My Noble Masters is a Harem, Ecchi, Romance, Comedy that pays more attention to its extremely ecchi fanservice rather than the actual romance or comedy.\r\nThe series is about a brother and sister (Ren and Mihato) who ran away from home in order to start a new life together and after a turn of events, they end up working for a famous, rich Kuonji family consisting of 3 sisters (Shinra, Miyu and Yume). Surprisingly this anime has an underlining story to it but for the most part it is full of random mini stories/adventures that have little relation with each other. Each episode spendsit&rsquo;s time either focusing on a specific character or theme, usually involving Ren getting to know one of the girls, so the series never gets entirely boring and it becomes slightly dramatic later on.\\n\\n\r\nThere are plenty of characters in this short series and each with their own unique personality. Nevertheless only a few of them seem to get plenty of attention, while the rest barely get any screen time. But at least they all get their own moment to shine.\\n\\n\r\nI must say that the quality of the animation is somewhat good with a lustrous colour palette, for the nicely drawn backgrounds and characters. But most of the effort seems to go towards the fanservice, which is a good thing I suppose. The music can only be described as very upbeat and even though it&rsquo;s good, there&rsquo;s nothing special about it.\\n\\n\r\nOverall They Are My Noble Masters proved to be a very enjoyable ecchi, comedy with quite a few parodies for the hardcore anime fan to enjoy. There&rsquo;s plenty of tasteful fanservice and adult humour for any guy to enjoy as well but sometimes it does feel a bit excessive. At least this anime has creative ways of censoring nudity XD. In the end this series did prove to be somewhat dull compared to its superior counterpart (Hayate no Gotoku) but if you just feel like watching something entertaining and extremely ecchi then be sure to check this out.\\n\\n\r\n^_^",
            "date": "2008-04-01T04:35:00+00:00",
            "helpful_count": 61,
            "mal_id": 3525,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=3525"
        },
        {
            "content": "KimiAru\r\nKimiAru was very good to my surprise and not because of the story or the art but because of the enjoyment you get from this, it really attracts you with the characters and the comedy is just as good as the parodies.\r\nStory\r\nA simple story, two siblings ran out from their house because their father was abusive, they try to get jobs but they fail, one day he saw a blonde girl that was going to faint, he catchs her and brings her to her house and it happens to be a mansion, her sister convince them to give them a job and from there startswhat is a simple but good story.\\n\\n\r\nArt & Animation\\n\r\nThe art style was very good for being an anime aired on 2008, the animation is just as good, the character design is good and the art from the background was really good too.\\n\\n\r\nSound\\n\r\nThe sound and background music was very good, the voice acting was very good too and the OP and ED were good.\\n\\n\r\nCharacter\\n\r\nThis is one of the strong points of KimiAru, all of them are really great, they weren't cliche and they all have their back story that makes them even more likeable, Ren is really relatable and you can't choose who you want to see him with, because all the girls are really great and Tajiri was freaking hilarious, i really liked Natose she was kind even if she didn't look like it the first time you see her and Kuki Ageha was great\\n\\n\r\nEnjoyment\\n\r\nThe comedy and the parodies makes this even more enjoyable, it was great and the ecchi elements too, after completing this i wanted more and i saw the alternate story MajiKoi where the only character that appears again is Kuki Ageha she is such a Badass.",
            "date": "2015-08-05T14:37:00+00:00",
            "helpful_count": 22,
            "mal_id": 195249,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195249"
        },
        {
            "content": "Note: I may have been comparing this too much with Hayate no Gotoku. This review is from a man who has watched it first, I would probably have given this a higher rating if I had watched this first.\r\nStory: Your basic maid/butler story. Ren and Mihato have ran from their home and looking for a job, and all of a sudden, they find themselves working as butler/maid for the ultra-rich Kuonji family. Based on an Eroge, it contains scenes that shows relationships between Ren and all those sisters. I like how they gave enough attention to all of the chars.\r\n7/10\r\nArt: Not very good, and thescenes where they &quot;tried&quot; to make comedic moments were sometimes not-so-well drawn. Despite that, I think they've found amusing ways to censor nudity^^ Average drawing+ good ways to censoring = Not the best, but not the worst either.\\n\r\n7/10\\n\\n\r\nSound: Definitely not good. The seiyuu cast usually lacks emotions. You all know the scenes where something strange happens and a character changes their voice to mark some entertaining remark. Well, it just doesn't happen right in this anime. This may just be because I'm watching Lucky Star again (which has an awesome seiyuu cast,) but they really aren't the best. Background music was average. OP wasn't that bad, but I certainly didn't wait for it to finish. The ED wasn't so bad too, mainly because I listened to it every episode (due to various reasons &gt;_&gt; guess why ^^)\\n\r\n5/10\\n\\n\r\nCharacters: The Kuonji family were unique in my opinion, and they really provided me a reason to watch this anime (other than ecchi.) What I didn't like was that the others didn't have good backgrounds. Ren's background is the same as Hayate's, Mihato acts too much like Maria-san (calm looking but can be very dangerous,) and also the cooking scenes where she cuts various animals and we see blood is too much like psycho Kaede (Shuffle!)\\n\r\n8/10\\n\\n\r\nEnjoyment: As a healthy young man, I enjoyed watching the ecchi moments. I didn't realise that I like this anime until it finished (which really left an empty hole in my heart.) I think I liked watching one episode a day, it was about the right amount for my daily ecchi needs.\\n\r\n9/10\\n\\n\r\nOverall: Please, do not ask me how I got 8 for overall while I have two 7s and a 5. Lets call it being a man. Ecchi gave me enough reason to watch, the Kounji sisters made it interesting enough, and the end made me want for more (and made me want for its eroge - not translated yet unfortunately.) My advice would be to watch this before Hayate no Gotoku or other animes that have very powerful seiyuu cast.\\n\r\n8/10",
            "date": "2008-05-14T13:18:00+00:00",
            "helpful_count": 10,
            "mal_id": 4723,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4005.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DaBigD",
                "username": "DaBigD"
            },
            "url": "https://myanimelist.net/reviews.php?id=4723"
        },
        {
            "content": "If you are looking for the usual\r\nharem/shonen romance/ecchi anime, this ain't it.\r\nBut it was a good weird and spontaneous romance\r\nstory.\r\nOne, there are only sporadic content of ecchi in there.\r\nSave for Shinra Kuonji's occasional tease and some other\r\ngimmicks, not much ecchi content. And that is not necessarily a \r\nbad thing. It allows the story to expand beyond the scope\r\nof the visual novel.\r\nBut, the producer could have done better. The storyline was not\r\nplanned out, and was very sporadic, with too many filler episodes\r\nfor a short series. What drives the story forward? It should be Ren's \r\nrelationship with the other girls. But, little progression is made at theemotional\\n\r\nor psychological level. There is a huge social gap between both sides. \\n\r\nThe character planning could have been better, but since this came\\n\r\nfrom a visual novel, you could not have expected anything but one male\\n\r\ncharacter along with a huge ensemble cast of girls. \\n\\n\r\nArtwork is pretty well done, and there was no action, no pan shots, no \\n\r\nheroic shots. But it was well done for this genre. The animation studio\\n\r\ndid a nice job touching up this anime. The characters look like repeats from\\n\r\nother series except for Shinra. She seems to be fresh design, and I think that\\n\r\ndesign will be used in the future for other independent female designs.\\n\\n\r\nTo conclude, good anime to watch on the plane, or something. Don't waste your\\n\r\nprime time or money on this",
            "date": "2009-01-18T23:12:00+00:00",
            "helpful_count": 9,
            "mal_id": 11675,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/136638.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zhang1222",
                "username": "Zhang1222"
            },
            "url": "https://myanimelist.net/reviews.php?id=11675"
        },
        {
            "content": "Honestly I didn't think this was going to be that great of a story but it turned out to be simply amazing.\r\nUnlike many other harem anime this one has immense character development. From the start of the anime the protagonist even states that everyone in this house is \"so strange, and unique\". Everyone compliments one another and for a bunch of insanely rich girls they are actually very thoughtful and kind.\r\nI honestly thought this was going to turn out to be one of those anime where the rich girls enslave the protagonist and make him work hard and over time warm up to him. Itactually turned out that they were all generous, and loving from the start which was a nice change of pace.\\n\\n\\n\r\nI recommend this to anyone who is interested in it.",
            "date": "2011-04-17T13:40:00+00:00",
            "helpful_count": 6,
            "mal_id": 36170,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=36170"
        },
        {
            "content": "Kimi ga Aruji de Shitsuji ga Ore de is hard to descibe. The closest thing this can be described to is Shuffle! It has a solid story, the art is good (with the exception of crowds) Some nice character progression through the story. The voice acting is exceptional. But what makes this anime truely brillant is the references to other shows. Its hard to quote due to spoilers. If you consider yourself a fan of anime then this is a must. A few references include Guren lagann, Shuffle and Fruits basket. And these are only a few, there are several per an episode. And thegood thing is it never feels forced. \\n\\n\r\nI feel this is a must watch as it is consistently funny, and ebraces the rest of the industry",
            "date": "2008-04-06T04:38:00+00:00",
            "helpful_count": 6,
            "mal_id": 3672,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48086.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VanKrackin",
                "username": "VanKrackin"
            },
            "url": "https://myanimelist.net/reviews.php?id=3672"
        },
        {
            "content": "Review #3: Kimiaru/They Are My Noble Masters\r\nStory 6/10 -- The story for this anime is very underdeveloped. There isn't much of a plot or long story, and it's more of a daily event anime that relies on comedy rather then actual story. The past is mainly focused on or hinted in this series, but the future seems rather uncertain. The story could of created more intrigue, as there was a few exciting events in this anime, however since this is based off an eroge, it seemed to me like it was struggling in choosing a genre to focus on in the storyline. \r\nArt 7/10 --Not Sure how the art compares to other animes from 2008, but to me it seemed average and i noticed a few mistakes here and there. The mansion has a beautiful exterior, and the city landscape was nice however. The character art is average, but there is some uniqueness with the style.\\n\\n\r\nSound 7/10 -- No Complaints for me about the sound. The acting is normal, OP is decent, and background is fine.\\n\\n\r\nCharacter 8/10 -- The Reason im giving character an 8 is because I liked the style the characters had in this series. Each character has there own funny quirk/personality that make them likable, and the backgrounds and pasts of each character blend in rather well. The macho butler is funny when he has screen time, and i support the little side romances this anime had on the side.\\n\\n\r\nEnjoyment 7/10 -- For an anime that came out a decade ago, I was pretty content when I first watched the series. There was some decent comedy, and the relationships between the character were nice to watch. The head butler makes things interesting with his awesome action moves, and the random comedic stints were done alright for an anime of this time. I liked Rin's character, but was annoyed with a few of his decisions. \\n\\n\r\nOverall 7/10 -- The anime lacks a solid story, but the characters mixed in with the daily life comedy is a pleasant substitute for that. Art and Sound is average, but this anime is a solid 7, and its based off a visual novel eroge. Time is an important motif in this anime, and the past haunts all these characters, but they overcome it as a rich household family of maids, butlers, and ladies. \\n\\n\r\n~Castawayz",
            "date": "2018-02-16T17:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 271656,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4700148.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Castawayz",
                "username": "Castawayz"
            },
            "url": "https://myanimelist.net/reviews.php?id=271656"
        },
        {
            "content": "I didn't really want this to be my first anime review, but I somehow had a hidden urge to write this.\r\nI hated this anime. with a firey burning passion in the first 4 episodes.\r\nMainly because that sister (sort of-ish) rape scene disturbed the hell out of me and pretty much spoiled the entire anime for me.\r\nThe it was if the anime suddenly found out it deeply offended me after a few episodes and suddenly made direct anime refrences to all of my favorite animes. (as opposed to all those other anime refrence-ing animes, to which I couldn't make heads or tails of.) They made refrenceto Rozen Maiden, Sailor Moon, Haruhi, Fruits Basket, Sayonara Zestobu Sensei, all of my beloved animes. \\n\\n\r\nIt got less creepy as time went on though, which I'm grateful for.",
            "date": "2008-05-10T21:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 4647,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/37117.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tweetlepie",
                "username": "tweetlepie"
            },
            "url": "https://myanimelist.net/reviews.php?id=4647"
        },
        {
            "content": "As usual, forgive my english. Being french makes my english sucky sometimes.\r\nBTW: SPOILERS this review might contain.\r\nBeing a butler is no easy job... all the cleaning, the washing, the exigencies of your masters and... the hilariousness that you can get.\r\nKimi ga Aruji de Shitsuji ga Ore de, also known as They are my Noble Masters (let's just call it TAMNM), is truly a good show for the target audience and the genres it wanted to touch. Me, mecha/sci-fi fan walked on this anime with this mind set: I want a mindless show that will entertain me, without being annoying. TAMNM did it perfectly!! Never hadI so much fun watching a mindless \"harem/romance/parody\" anime. Now let's get to the review please.\\n\\n\r\nStory: huh... none. Read the synopsis and you pretty much get the story. This show never tried to force you a story. You can of course see that the story follows a path of going to point A to point B. It also makes sense, but it's not one continuous story. The setup for Ren and Mihato is very well done. Instead of having them just appearing out of nowhere in this crazy mansion, they give almost a complete episode before they actually start working as butler and maid. Having Ren being beaten up by his father and running away from home later was a good sad atmosphere at the beginning of the show. For the most part, this is an episodic show. Nothing that makes it stand out, but it makes sense. 7/10\\n\\n\\n\r\nArt: The animation is nothing that stands out, but the character designs are very good. Really too much to say, it's just good art in general. 8/10\\n\\n\\n\r\nSound: Meh... generic soundtrack. It has a weird, but funny, mix of music that ranges from Classic music to almost Heavy Rock. Nothing impressive and the OP/ED were just not good. 6/10\\n\\n\\n\r\nCharacters: This is where TAMNM did his job flawlessly. A lot of ground to cover in this section. Prepare yourself.\\n\\n\r\nRen: He is your anti-lead for a romance/harem/slice of life anime. First of all, he's hot-blooded which makes him absurdly epic sometimes. He's a man of decision. He's willing to become a better butler for the sake of never had to go back to home again. Of course, he gets embarrased over some things, but he eventually gets over that and that makes him stand out of the bunch of pussies in other animes *cough* Aono Tsukune*cough* *cough*Rito Yuuki*cough* *cough*Shinji Ikari*cough*. Thumbs up Ren, you were awesome.\\n\\n\r\nShinra-sama: The first child in the Kuonji family. She's incredibly colorful. Charismatic, beautiful and mysteriously attractive. She's so awesome. She loves to tease the people that she loves and you can definitely see that in the anime. The things that she does are ridiculously funny and when she gets serious, it is at least credible. Of course, they are two parts in the anime that I think she didn't make the right decision, but at least at the end *SPOILER* she kisses Ren with one of the most intense and straight forward kiss ever. *END OF SPOILER* That character did her job with a perfect score.\\n\\n\r\nMihato: Crazy sister, but funny crazy sister. The fact that she admits having a brother complex right from the start makes all her actions believable. She really loves her brother as much as he loves her. That's another thing that stands out in this anime. They show you their very deep love for each other, but without having to go in an incest route. She's willing to let him go, but she gets depressed when she cannot spare some moments with him and that is understandable. But she never gets in the way for character developments making her a very likeable character.\\n\\n\r\nNatose: God, I love her. She is so likeable, always trying to do her best, supporting Ren in his work, giving him advice, etc. She's a perfect balance of hilarious moment and also serious moment (and that's the moment you don't F with her). The fact that she likes Ren, but only as brother, makes that show a \"different\" experience compared to the traditional harem show. That character is up there. Her backstory was also kinda sad, being the only survivor of a tsunami and seeing all her family dying without being able to do anything was touching. \\n\\n\r\nMiyu: The second sister of the Kuonji family. At the first, I thought she was going to be the generic girl that looks like a little kid, but in fact is an genius and annoys everybody with her boastfulness. I was completely wrong. She's a grown up adult, but has her cute moments. The fact that her own sister calls her loli is hilarious, when she's probably the most mature character in the show. She likes Ren, but never to the point of love, which breaks yet again the traditional harem route. She doesn't have any shame and the moment when she's getting almost molested by Shinra makes her hilarious and like the others, a very likeable character.\\n\\n\r\nYume: The third and last sister of the Kuonji family and probably the most invisible out of the three. She sees herself as an invisible person that doesn't have a strong character, which is kinda true. But she is a fluffy person and when she is in the screen, she does have a presence and you like her. She doesn't stand out, but she's not annoying and you feel good for her at the end.\\n\\n\r\nBenisu: That's the Tsundere of the show. She's looking down upon Ren, but eventually likes him. Her backstory is probably the main reason why she acts the way she does. That character was funny and interesting at times, but she also got in my nerves at some points. I just want to mention that her voice is done by someone who does a lot of hentai and it shows in episode 12... In the end she was just a good character.\\n\\n\r\nAgeha: I LOVE HER TO DEATH!! Again, first impression is never the right one. I thought she was going to be the generic evil bitch, but it turns out very differently. She is, along with Shinra, the only character that develops an affection to the point of love over Ren. Instead of being evil, she's the hot-blooded female of the show. Very strong, very strict, but she is able to acknowledge the efforts of people around her and giving rewards for that. I was happy that she got an arc devoted only to her and Ren and I was also happy that she takes a backseat for the rest of the series while still being around sometimes. That way, she doesn't get in the way for the other characters to develop. She said that she will never give up on Ren, but they didn't make this the focus, parting away again from the traditional harem show.\\n\\n\r\nColonel: That guy was so epic. The head butler of the family and you can see why. Handsome, useful, polite, strong and for the most part, hilarious. His voice sounds so good and he's such a good butler. Nothing much to say about him other that he was instantly loveable character.\\n\\n\r\nNow for the others.\\n\\n\r\nChiharu: That \"guy\" is the biggest trap in anime ever. He sounds like a girl, he looks like a girl and he has the hairs of a girl. He's just missing some tits and has a d**k in the way.\\n\\n\r\nDe Niro: An extra bonus. He's not useful to this series, but he's funny for the most part.\\n\\n\r\nAnastasia: Punish me more.\\n\\n\r\nKojuurou: That guy was ridiculously hilarious and he's voice by one the greatest seiyuu ever (Nobuyuki Hiyama)\\n\\n\r\nIwao: A sorry father. He's a total douchebag, because he cannot express himself correctly. He, fortunately, redeems himself at the end.\\n\\n\r\nIn the end, the cast of characters deserves a 10/10. They really did make the show for me.\\n\\n\\n\r\nEnjoyment: I loved that show. It was so mindlessly entertaining!! The biggest thing that I loved about this anime was the fact that they never wasted time. The show moves at a fast paced, which gives the chance to see more and more as the show progress. I was also pleased that it was only 13 episodes. Otherwise, fillers this anime would have been full off. This anime beats Sekirei in my terms of a show that was mindlessly entertaining. I also watched this anime with the mind-set that it was going to put mindless. After watching all those serious shows (Legend of the Galactic Heroes for example) it was very refreshing. Good job TAMNM!! 9/10\\n\\n\\n\r\nOther: I would like to mention the multiple references to other anime this show has made (G Gundam, Gaogaigar, Initial D, Prince of Tennis, Sayonara Zetsubou Sensei and others). The hilarious jokes of G Gundam with Gaogaigar are well placed, because of Tomokazu Seki (Domon Kasshu), Yousuke Akimoto (Master Asia) and Nobuyuki Hiyama (Viral / Gai Shishio). This three combinations of hot-blooded seiyuus was a great add to this series. I also enjoyed the fact that if you ay very carefully, there is only two characters that are in LOVE with Ren and that is Shinra and Ageha. The others certainly like him, but not to the degree of love. To wrap things up, I would like to give congratulations to Shizuka Itou (Shinra) and Rie Tanaka (Ageha) for providing great performance.\\n\\n\\n\r\nOverall: Everybody who's tired to watch shows that needs you to keep your brain open, go watch this show on auto-pilot mode. This is without a doubt a show that I will rematch when I will feel the need to relax. I really recommend it to everybody that has an interest for a stupid-but-yet-great anime. \\n\r\nIn the end 8/10 (but if I go with what my heart thinks, 9/10)\\n",
            "date": "2010-07-18T06:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 28558,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/204131.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Duskrados",
                "username": "Duskrados"
            },
            "url": "https://myanimelist.net/reviews.php?id=28558"
        },
        {
            "content": "Kimi ga Aruji de Shitsuji ga Ore de is one of the many animes that has potential to be a rewatchable anime.\r\n~Story\r\nThe Story for me was very entertaining and very romantic (In a harem sort of way).\r\nBut good things always come to an end, it was way to short to end so suddenly. But its DEFINITELY a story worth telling.\r\n~Art\r\nThe art was superb I would give it 5 thumbs up (...if I had five thumbs that is). The background was superb and the character designs are very amazing to begin with. Different character designs that truly blend with their characteristics and traits.\r\n~Sound\r\nThe Sound was goodnothing that special. But the ending of the story had a great sound effect though. The Opening theme really suits the anime well.\\n\\n\r\n~Character\\n\r\nThe Characters had all their screen times except... it was too short. Not really much of a Character development though.\\n\\n\r\n~Enjoyment & Overall\\n\r\nI was Definitely and positively sure that I made the right decision... On making this one of my Favorite Animes.",
            "date": "2009-04-29T04:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 14609,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/174067.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/eX",
                "username": "eX"
            },
            "url": "https://myanimelist.net/reviews.php?id=14609"
        },
        {
            "content": "It's not a typical harem anime; it relies heavily on the ecchi and story aspect to be successful. The overall feel of the ending is rather pleasant but nothing to really write home about.\r\nStory: 7\r\nIt has a story... per se. Each episode revolves around or focuses on a character within the household and nicely incorporates the remaining cast into each episode as it goes along. Some might find this technique appealing and fresh but it sacrifices time for development of characters that aren't pertinent to the story and are giving TV-time to \"be fair.\" However, the story boils down to Ren's interactions with the restof the people within the house (mostly the girls) and the outcome of each relationship.\\n\\n\r\nArt: 8\\n\r\nI enjoyed it. There were some scenes which were really gorgeous and stylized, but there were others that were very \"meh.\"\\n\\n\r\nSound: 9\\n\r\nThe voice acting was really spectacular. A lot of good, varying octaves and distinct voices for each character allow for each character's individual personality to be showcased.\\n\\n\r\nCharacter: 8\\n\r\nSuffers a little bit due to the inclusion of having EVERY remotely relevant character have a episode devoted to them. But the characters are awesome where it's needed the most: namely the ones that receive more screen time.\\n\\n\r\nEnjoyment: 8\\n\r\nI liked it. I would've liked to have seen a little more romance, though. \\n\\n\r\nOverall: 8\\n\r\nNot entirely harem, so if you're looking for a true-blooded harem anime, look elsewhere. This series focuses on the importance of family and does a good job at it while adding in some pretty hilarious moments; ecchi too. A solid choice of viewing for any comedy, romance, or harem lover.\\n",
            "date": "2009-10-26T00:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 20007,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243290.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Saintly",
                "username": "Saintly"
            },
            "url": "https://myanimelist.net/reviews.php?id=20007"
        },
        {
            "content": "Kimi ga Aruji de Shitsuji ga Ore de is your typical harem comedy which there are so many of these days. Going through the checklist:\r\nTheme is about the importance of family and friends. Check\r\nAll the girls are in love with the male protagonist: Check\r\nMost of the girls have large breasts which you see quite often: Check\r\nCharacters are harem stereotypes: Check\r\nMale protagonist walks in to bath while girl is naked: Check\r\nMale protagonist gets beaten up by girls: Check\r\nLots of references to other anime: Check\r\nCheesy OP: Check\r\nI could go on.\r\nI am being a little unfair. I do enjoy a half decent harem comedy now and again mainlybecause they easy to watch and you don't really have to think. Its like channel hopping and finding a trashy programme that you won't admit to anyone that you like.\\n\\n\r\nKimi ga Aruji de Shitsuji ga Ore de fits the bill perfectly and is one of the better ones around. I'm never going to give it a high mark. When I give an anime a 7 it means I enjoyed it but it is not anything out of the ordinary.\\n\\n\r\nKimi ga Aruji de Shitsuji ga Ore de has a lot going for it. The characters are likable, the story is easy to follow and the artwork is easy on the eye. However, it is not a profound piece of work.\\n\\n\r\nI would easily recommend Kimi ga Aruji de Shitsuji ga Ore de if you just want to see some fun  lightweight entertainment which doesn't work the brain and has some cheap laughs.",
            "date": "2012-09-14T10:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 72323,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1270179.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Paulwillson26",
                "username": "Paulwillson26"
            },
            "url": "https://myanimelist.net/reviews.php?id=72323"
        },
        {
            "content": "\"A maid is a mythical being that all of us have heard about, but have never seen\" - ZUN\r\nBut what about butlers?\r\nKimi ga Aruji de Shitsuji ga Ore de or They are my noble Masters in English is based on an adult visual novel adaptation with it's underpants bleached and taking the more \"parody\" comedy route a la Hayate the Combat Butler. \r\nSo how is the comedy?, well since it's a parody anime there tends to be lots of anime references here and there, from D.Gray Man to Haruhi and you can take that with a grain of salt as to whether it was funnyor not, but since LA watched many anime to get the references, the anime jabbing fun at the characters with the parody references can be rather funny...at times, as for character jabbing it's typical from your \"bleached underpanted adult visual novel adaptation\" with the main protagonist get rag-dolled and punched around.\\n\\n\r\nIn terms of characters, they are your typical butlers and maids in anime, as in their almost inhuman like due to their strength and capabilities to do whatever they're masters wanted, this especially goes to the main protagonist Ren Uesugi voiced by Tomokazu Seki and Mihato Uesugi Ren's older sister voiced by Hitomi and Yasushi \"Colonel\" Tajiri voiced by Yousuke Akimoto, but in terms of character development we do get some character arcs/episodes that give the main cast a bit of depth and why their behavior and personality are what they are, such character examples being Benisu voiced by Hyosei (her personality and how she got employed to the Kuonji's), Yume Kuonji voiced by Asuka Minamori (her \"identity crisis\" by that her not having an identity from the wacky characters in the cast), Mihato and Ren's family issues (With Ren the main protagonist getting his own separate character development of trying to be the best butler and learning from his mistakes) and the odd one enough of Ageha Kuki voiced by Rie Tanaka who had a cameo in Maji de Watashi ni Koi Shinasai! but got an entire 3 episode arc about her backstory and relationship with her own butler Kojuuro Takeda voiced by Nobuyuki Hiyama in this anime, nonetheless the character development is properly focused on the characters that needed it with some minor characters like the Colonel and De Niro (Miyu's sentient robot) just being \"support\" characters.\\n\\n\r\nNow this is a parody anime with the focus on characters rather than the plot and LA can get behind this as the plot revolves on the characters so character development and it's comedy is key and for a typical butler anime then it succeeded in the basics.\\n\\n\r\nThe fanservice however is rampant with characters mainly Shinra and Miyu being either full naked or half naked (top only) but as LA said, this is an anime with bleached underpants, thus the fanservice levels doesn't getting any higher than full nudity, if your squeamish about that stuff, then best not touch this anime. \\n\\n\r\nIn terms of animation by A.C.G.T, the animation is decent enough from the character designs to background set pieces, but it doesn't get any better than that except for all the parody anime gags that this anime in which the detail NEEDS to go up (eg. Jojo & Akagi detailed faces to the anime references in general have higher detail). Overall, the animation is nothing to gush about, it's just \"decent\".\\n\\n\r\nIn terms of voice acting, there tends to be some squeak here and there (Yume's voice actor Asuka Minamori to Mihato Uesugi voice actor Hitomi), but the voice acting is pretty decent with plenty of shouting attacks to ojouness from Shizuka Ito and Yuko Gotou and LA's bias comes in this anime but once again Shizuka Ito was LA's favourite voice actor in this series. \\n\\n\r\nThe ending finally addresses the two characters LA wanted to get developed, Ren and Shinra with their family issues (which was both hinted at multiple times) and like the other more focused character development arcs, this takes centre stage as well bringing in more depth to the two and utilizing both of Ren and Shinra's same issues and drama's together, however Shinra's resolution was handled a bit janky compared to Ren's, nonetheless the ending was \"ok\" enough as Ren and Shinra's major plotlines gets resolved.\\n\\n\r\n Kimi ga Aruji de Shitsuji ga Ore de is your typical butler parody anime with strong character development outside of the anime references gags and character jabbing. As for LA, LA thought it was actually a slow paced anime (to get things set up obviously) at first but it got better once the character development episodes/arcs entered, the fanservice slightly surprised and unfazed LA throughout. Once the anime really got into the meat of the character development arcs they gave the characters depth outside of their stereotypical archetypes and gave some pretty well drama throughout the cast as well. \\n\\n\r\nYou thought it was Shinra Uesugi voiced by Shizuka Ito would be LA's favourite character, but it was me Miyu Uesugi voiced by Yuko Gotou! (Seriously, LA has no idea why, Shizuka Ito being an ojou with the character design typical of Shizuka Ito...Shinra SHOULD BE LA's favourite character in this series, yet Miyu took LA's 1st, Shinra warmed up to LA by the final 3 episodes but still Shinra takes an easy 2nd, with Benisu as a 3rd favourite). \\n\\n\r\nIf STILL the full nudity fanservice gets you squeamish then LA would recommend Hayate the Combat Butler instead, but if your ok with the fanservice LA mentioned before, then Kimi ga Aruji de Shitsuji ga Ore de is a good choice. \\n\\n\r\nKimi ga Aruji de Shitsuji ga Ore de maybe a parody at first but dig deep into the wacky main cast and you'll get more than a parody, you'll get an anime still wanting to tell the main cast's story with all the drama and character backstories it gives...comedy and all.",
            "date": "2016-05-24T16:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 219256,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=219256"
        },
        {
            "content": "They Are My Noble Masters Review: By The-Headstrong\r\nImagine this! Two people run away from home to escape an abusive father. These two people are brother and sister,their names are Ren Useugi and Mihato Useugi, and they have nowhere to go. So guess what! They run to the city to find work! Their young dreams of freedom flowing in their minds, they search all around the city for any source of jobs that provide a place to stay. While searching for work, a middle school looking girl is talking to her miniature egg-shaped robot. She has a large sun hat on top of her head andshe takes it off, suddenly she begins to faint! The brother catches her in mid-fall, and asks where she lives. She gives the directions to her house, and they arrive at a Mansion! Their lives will forever be changed by this event!\\n\\n\r\nThey find out that the girl is in fact not a middle schooler, but a 20 year old who looks like one. She is also the sister to one of Japans greatest orchestra conductors, Shinra Kuonji, and her name is Miyu Kuonji. Ren's sister, being the observant one, notices all the servants working in the house, and suggests to her brother that they should try to get a living in job at the mansion. After an event (No spoilers for you!) they become servants in training!\\n\\n\r\nThe anime goes on to how Ren handles the curious events that unfold at the Kuonji household, such as a game of Capture the Flag to, or training to become a better butler (of which some training methods would be thought to be harsh by human standards).\\n\\n\r\nAlso on a side note, this anime is moderately ecchi, with few episodes being innocent while others not quite so. Comedy is present throughout the anime. Basically this anime is a Romantic-Comedy, so if you enjoy those, you will definitely enjoy this anime  \\n\\n\r\nThe Kounji Sisters:\\n\\n\r\nShinra Kuonji- Eldest sister, one of Japan's famous orchestra conductors, and has a love for cute things, of which she often teases her younger sister Miyu and Ren the main character.\\n\\n\r\nMiyu Kuonji- Middle sister, very intelligent, and is often declaring herself to be the classy one, Miyu does not like how Shinra sometimes almost molests her everyday or so.\\n\\n\r\nYume Kuonji- Youngest sister, still attends high school, she is the shy and easily embarrassed one of the sisters, but she has a love for manga, and hopes to write a successful one of her own.\\n\\n\r\nThe Servants of the house are as followed:\\n\\n\r\nBenisu- head maid of the Kuonji  Mansion, also is often seen with a lesbian like love for Shinra.\\n\\n\r\nNatose- personal attendant of the youngest of the Kuonji sisters, Yume, she has a dog-like feel to her.\\n\\n\r\nColonel- Head butler, and former special ops officer, seems to have almost superhuman abilities and powers.\\n\\n\r\nDe Niro- the egg-shaped robot who serves as Miyu's personal attendant.\\n\\n\r\nChiharu Kiyohara- the cliche female looking male character that is often not included in half the episodes and has little time or importance in the anime\\n\\n\r\nOther Characters who serve actual purposes:\\n\\n\r\nAgeha Kuki- One of Yume's friends and another rich girl, she has a scar on her face, and falls in love with Ren, often gives food out as a reward for good deeds\\n\\n\r\nKojūrō Takeda- Ageha's personal butler, who is basically a masochist for Ageha's punches.   \\n\\n\\n\r\nThe Story is actually good for an ecchi anime, the art is great, sound is almost perfect, the characters are diverse and exceptional, enjoyment was really good. My overall grade would be a 9.5/10",
            "date": "2012-06-24T12:30:00+00:00",
            "helpful_count": 0,
            "mal_id": 64307,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1291161.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/The-Headstrong",
                "username": "The-Headstrong"
            },
            "url": "https://myanimelist.net/reviews.php?id=64307"
        }
    ]
]