[
    [
        {
            "content": "Typically shounen style action series are not usually my thing.  I find them to be completely silly and juvenile and cater to a demographic that I am just not a part of.  The posturing and trash talking, the ridiculous reversals of fortune, and the long drawn out nature of the fighting usually cause me to lose interest.  Honestly I am surprised this appeals so much to teenage males, who typically have the attention span of a goldfish.  However, initially Needless seemed to be different, and appeared as more of a parody and comedy with an extremely enjoyable female lead.  Eventuallythough it loses its way and falls victim to the things that doom many of its brother anime; trying to be and do too much instead of sticking with what was working.\\n\\n\r\nThe plot, initially is about as basic and nondescript as they come.  Needless is set in a post apocalyptic world in which a new race of super powered humans have emerged, possessing fragments of power that give them mastery over a certain skill such as fire, gravity, and magnetism.  These fragments apparently have all come from a common source, a god-like being known as the Second.  These altered humans are known as Needless.  But there is a hard and fast rule however, while some fragments are more powerful than others each Needless can only possess one.  It all sounds like it an interesting take on the superpowers genre, and it a lot of ways it is though the way that the powers are used begins to get annoying after while (more on that later).  All is not well in the world of the Needless though as they are threatened by the extremely powerful Adam Arclight and his followers in which they face extinction from his scheming.  Only the mysterious Adam Blade and his band of resistance fighters stand in the way.\\n\\n\r\nNeedless is chalk full of slapstick comedy, action, blood and death, explosions, fan service, and machoism.  Fans of these are likely to find plenty to like.  The real problem with the series as a whole is the pacing of its storyline.  Things move along quickly in the first 1/3 of the series.  Perhaps a bit too quickly, which may have lead to the problems it suffers from for most of the middle and late portions of the anime.  The heroes find themselves trapped in a room where they must do battle with Arclight's strongest followers.  The battles are action packed but they drag out...forever.  The story comes to a crawl and these battles seemingly go on forever as almost half the anime is taken up by this one fight and set in this same room.   The shocking plot revelation made during this arc is obvious to anyone with any degree of sophistication.  Once our heroes finally manage to get out the rest of the series is almost completely taken up with flashbacks, plot building, and adding a conspiracy arc.  While this made Needless' story infinitely better and more complex it again felt to me like a complete reversal once again in the theme.  To me it was like the director couldn’t make up his mind.  Did he want to create an echii action parody, a straight shounen fighting anime, or a complex story about genetic research and political intrigue?  \\n\\n\r\nA small rant is in order on the battles.  I know that it is a staple of this kind of series to yell out and name all of your attack moves and special abilities, but really is it that hard to come up with some names that make some sense?  After hearing \"Little Boy\" or \"Dean Drive Fox Hound\" uttered for the billionth time I just wanted to shove a pair of scissors into my ears.  And seriously what the hell does Dean Drive Fox Hound supposed to fucking mean anyway?  It’s nonsense!\\n\\n\r\nThe real tragedy is that what they were doing at the start was working.  The best part of Needless is the characters, in particular Eve Neuschwanstein (try saying that ten times fast).  She’s got all the body measurements to make her a fan favorite, but she has a hilarious and quirky personality to go along with it to make her memorable.  She stupid, can’t remember anyone’s name which leads her to \"shorten\" people’s names into nonsensical words.  She has a really cool special ability called Doppelganger, which allows her to change herself into basically anything of the same mass as she is.  Unfortunately as the series progresses she tends to disappear more than a main character should from the action, thus taking away a lot of the appeal for the show for me since I really enjoyed her.  Also her Doppelganger ability is used in ways over the course of the series that seem to be inconsistent with what the ability should really be able to do.\\n\\n\r\nAs for the other leads, Adam Blade and Cruz Schild the results are not as good.  Blade is a silly and typical shounen male with an over-the-top character design complete with an unoriginal and clichéd personality (basically think TTGL's Kamina).  Unless you love 12 pack abs and these kinds of stereotypes or this is the first anime you have ever seen, then you’re unlikely to be impressed by him.  That being said he does have his moments of comedy gold and he is not completely without merits.  Cruz is also a typical anime boy who reminds me of another TTGL character, Simon (the young version) in both looks and personality.  Though he seems to have more sense than most of his shounen brethren, and stays out of trouble for the most part and leaves the fighting to those with powers.  His greatest attribute is that he’s probably the only person in the show with a brain.\\n\\n\r\nThe rest supporting cast is a mix of some very entertaining and memorable characters and more shounen stereotypes.  With the exception of Disc, the rest of Blade's team of resistance fighters is uninspired.  The ones who really shine are among Arclight's subordinates.  This starts and ends with the Pretty Girl Squad of Mio, Setsuna, and Kushinashi.  I found their antics to be the most amusing of any of the characters in the series.  They are probably the objects of the most fan service, next to Eve, but for the most part it’s all pretty funny and just doesn’t feel as pointless as it usually is in other shows.\\n\\n\r\nArtistically Needless is an uneven experience.  The animation of the fights, action, and special effects are all topnotch.  The service is well done, at least amongst the females, and they are cute and not too ridiculously proportioned.  However the men are awful.  I am on record as being a firm hater of bishies and effeminate men.  While the men in Needless are certainly manly, they basically look like bishies on steroids.  The fact that all of them looked pretty much the same (does anyone in the future wear shirts?) and the silly looking cartoonish muscles and impossible body builds took away from the art overall.\\n\\n\r\nThe absolute worst thing about this series is the music.  The first OP \"Modern Strange Cowboy\" is without a doubt the silliest song I have ever heard and the worst example of Engrish lyrics gone wild.  The second OP is not near as bad but still not that good and both the ED themes are average at best.  Also the commercial break teaser halfway through is laugh out loud silly with the retarded sounding \"Needless\" being overacted by various male cast members.  The acting overall is decent, but again the male voice actors over play their parts so much that they just sound silly.\\n\\n\r\nOverall my final opinion on Needless mixed.  I did enjoy many aspects of it, but it had more potential than it delivered.  The schizophrenic direction and pacing are too much for me to ignore.  Your enjoyment of Needless is likely to depend on your own personal tastes.  If you love shounen action then you might want to give this a chance.  I found it to be an average series at best.\\n",
            "date": "2009-12-19T15:11:00+00:00",
            "helpful_count": 151,
            "mal_id": 21526,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 2,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=21526"
        },
        {
            "content": "Needless is not for everyone, but it is a fantastic show as long as you watch it for what it is and are able to enjoy it for what it is. Still, while it was still airing I got the feeling that most people had misconceptions.\r\nFirst of all, Needless is not a shounen. Needless is a shounen-parody. Or actually if I stick to proper genres I would agree that it's a seinen, and the reason why it is \"full of shounen clichés\" is because it makes fun of those classic elements by overacting them till they reach grotesque levels. It's important to understand that thatis the basis of the show.\\n\\n\r\nMuscular machos? Naturally. Battles that last for eternity? Most of the anime is set in a single room. Fighters with named attacks or techniques? In Needless they not only shout them all the time, they also write them on the screen with huge flippin' letters to make sure you remember!\\n\\n\r\nI admit though that throughout the anime adaptation there are points when the show turns into the very thing it pokes fun of, but I'll get back to that later.\\n\\n\r\nThe second popular misconception is that Needless is a Tengen Toppa Gurren Lagann ripoff. Which would be hard considering that the Needless manga started years before TTGL. I won't stick my head into the sand and deny the similarities, I compare Needless to TTGL in this review on a few occasions myself, but while TTGL builds a strong coming of age story over the top of making fun of old school mecha anime, Needless stays in the sandbox where it feels safe but pushes its limits further there.\\n\\n\r\nAs you can kinda expect from this type of show, the story is almost non-existent. A mash of dozens of old concepts thrown into a bowl to create a frame for the action, humor and nonstop manliness. What comes as a result is somewhat interesting, but it's kept on minimal complexity so it doesn't get in the way of the \"important\" elements of the show. On the other hand, the author had some fun with the character's special attacks and you can find quite a few references there. Naturally I'm not talking about \"Mio-chan hip attack\", but things like \"Little Boy\", Dean Drive\" or \"Agnischwattas\". I won't call it deep but it's still a bit more layered than people would think.\\n\\n\r\nWhen it comes to characters, Needless has a huge list of archetypes, and this is also the point where TTGL fans start coughing blood. The \"main\" hero who likes to solve every situation with his fists (Blade/Kamina), the main heroine who's also a little ruff around the edges but makes up with bust size for lack of braincells (Eve/Yoko), a useless wingman for comic relief (Uchida/Kittan) and the timid kid who grows into a man (or not) (Cruz/Simon). The difference is that Needless really goes beyond the limits and centers the characters around their most basic trait, pushing that one aspect as far as possible. It also adds things like pedophile priests, bold old scientists and most importantly an army of lolis ranging from lesbians to androids. And yet, despite being this bottomless pool of one-dimensional fan service sources, there is not a single character in the show who is unlikable and every viewer can find one or two who they truly love. Even the one who was annoying in the anime gets cool later on in the manga. This palette of characters is what really makes or breaks Needless.\\n\\n\r\nThe graphics are hardly anything special: the character designs are a nice recreation of the manga, while the animation is mostly fluid but not really homogeneous. The music on the other hand is quite worthy of praise. I would be the last person you could call a metal-fan, but the hard hitting power metal BGM of the show is just amazing. Taken from e-Zuka's \"I got you under my skin\", from \"Raging Flames\" to \"Elephant's Scream\" every track is a perfect match to its respective scenes and gives them the necessary boost.\\n\\n\r\nI think that just proves that Madhouse was the right studio for this show. With that said however, it also entails the consequence that Madhouse fans are all too familiar with: abrupt original ending. This case is not nearly as bad as for instance with Claymore, but the changes at the end, along with the severely toned down gore (compared to the manga), resulted in the anime sometimes coming through as more of a shounen than a seinen.\\n\\n\r\nSo after all that, what makes this mixed bag of shallow elements so special in the end? The entertainment value. The indescribable energy that flows from every scene and gets multiplied by the music to the point that you clench your fist, jump out of your chair and yell \"F**K YEAH!\". The bursts of laughter you get every time said scene gets interrupted for a second with a crazy one-liner. The brainless fun you get from the painful lack of logic in the show. And I think that's the keyword, Needless is brainless fun. If you are looking for something more or different, Needless is probably not for you. But for what it is, Needless is perfect.",
            "date": "2010-08-29T06:34:00+00:00",
            "helpful_count": 137,
            "mal_id": 30067,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/87618.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kvakond",
                "username": "Kvakond"
            },
            "url": "https://myanimelist.net/reviews.php?id=30067"
        },
        {
            "content": "NEEDLESS to say....\r\nWhile Needless bears many similarities to a previous anime, Tengen Toppa Gurren Lagann, I feel that these comparisons are unfair and often lead to many people rating this series down. Comparing one's work of art with the Mona Lisa is an unfair one, after all.\r\nNeedless begins off on a very good note, full of high-octane energy and very manly characters. While it is admittedly similar to Gurren Lagann, it really stands in a class of its own. The story... what story? Fans of this series aren't really interested in the story, or at least in my point of view. Its a generic settingwith generic characters. A badass hero, a moe heroine, a kid, an old guy. The characters don't exactly set themselves apart either, with very unoriginal backgrounds.\\n\\n\r\nNow that the bad parts are out of the way, let's talk about the good. Where do I start? Needless is full of incredibly good stuff, with fantastic art (although there are some dips in quality here and there, but little enough to ignore). The music, is brilliant. While pretty much unnoticible in most parts of the show, it is when the action kicks off that the music really gets going. Heavy metal riffs with fast beats really serve to get your heart racing during the epic battle scenes. The visuals are good, with a suitable style for a show of its type. They really don't spare on the blood either, which is a good thing (for most people, I trust).\\n\\n\r\nUltimately, NEEDLESS is a series that really focuses on what its good at, and cuts away pretty much else. And what its good at, is providing ENJOYMENT. Yes, the slapstick humour, funny (though not very interesting) characters, the epic battle scenes and heavy metal guitar all combine together to provide an extremely enjoyable series. If you want to have a good time, and aren't really interested in heavy plots, emotional baggage, and complex character development, then NEEDLESS is for you!",
            "date": "2009-10-10T10:54:00+00:00",
            "helpful_count": 102,
            "mal_id": 19550,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/userimages/244728.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/bob1191",
                "username": "bob1191"
            },
            "url": "https://myanimelist.net/reviews.php?id=19550"
        },
        {
            "content": "NOTE: I have not read the manga, so manga readers can go to the manga page for this show and talk about it there. This review is for the anime only.\r\nAlthough I've only seen 3 episodes at this point, I think I've seen enough to write a fair review. I'll update it later of course to reflect the future scope of the story, because at this time it's still not completely clear what's really going on. Besides the fact that we know Simeon is evil, what the Needless are, and that they are after Adam Blade.\r\nSTORY: 7 (Good)\r\nThe story so far is typical of ashounen, with nothing really outstanding to set it apart from the rest. It's not overly simple though, so I believe it's worthy of being called \"Good\".\\n\\n\r\nThe evil organization, Simeon, is out to exterminate the Needless, which are a sort of \"super-human\" who possess varying abilities (usually one per Needless). One of the main characters, Adam Blade, possesses the strange ability to copy the powers of other Needless he comes in contact with (think Sharingan), and use them all at his leisure. Eve has the Doppleganger ability, and can take the form of others using either a picture, description, or by coming in contact with them. So far, we don't know much about Cruz (such as whether or not he may be a Needless but just doesn't know it yet), so for now, he plays the part of the currently-weak, developing character that might turn out to be more useful later on.\\n\\n\r\nThrow in a couple of thought-provoking elements such as the Black Spot and Adam Arclight, and the stage is set for (potentially) a moderately interesting shounen.\\n\\n\r\nART: 8 (Very Good)\\n\\n\r\nWhile the art isn't really top-notch, it's well done, and there's not much to complain about. Some found that in episode 2 the special attacks were rather bland, due to reused animation and the fact that each character took longer to \"call out\" their attack rather than to actually do it... But I found this little problem less obvious in episode 3. It seems like they cleaned up their act a bit. Episode 3 bumped up my judgement to \"Very Good\".\\n\\n\r\nSOUND: 10 (Outstanding)\\n\\n\r\nLet's face it, the OP rocks. I like the rock music played throughout other parts of the show as well. It's nice. I'm a bit WTF'd by the ED though, I actually find myself skipping past it every time due to it making my IQ take a temporary plunge, but I won't take points away for that... It's at the end anyway.\\n\\n\r\nCHARACTER: 7 (Good)\\n\\n\r\nIt's about what I'd expect from a show of its genre. Each character has room to grow, so it has potential. I liked Adam right off the bat, and Eve is definitely doing a good job of keeping the show fun. I'm not partial to Cruz at all but maybe that will change. As I said, they have room to grow, but by the same token, they're nothing special at the moment.\\n\\n\r\nENJOYMENT: 9 (Great)\\n\\n\r\nAt the end of the day, I enjoy watching this show. This is not the kind of show I have to force myself to get to watching, unlike some other shows I'm watching at the moment (*cough* Haruhi S2 Endless Eight *cough*). Seeing Adam kick some ass, I'll admit, is mindless, plain-old fun. And you're always curious as to what Eve will do that episode. Curiosity is a big part of what keeps me coming back for more.\\n\\n\r\nOVERALL: 7 (Good)\\n\\n\r\nThis show has room to grow, and for those of you who judged it after episode 2, at least give it one more. Episode 2 didn't sit well with me either particularly, but I found the third episode redeemed everything a little. And after all, who knows where it's really going yet?\\n\\n\r\nI'll keep watching it for sure. I vastly prefer shows that are more thought-provoking, have deep stories, and well developed characters, but to be honest, this show is just fun in it's own way. Sometimes it's good to throw away the rules and rock out to some over-the-top action.\\n\\n\r\nGo watch the OP. I bet that'll have some of you at least trying it out.",
            "date": "2009-07-21T15:32:00+00:00",
            "helpful_count": 43,
            "mal_id": 17013,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9135.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/brass2themax",
                "username": "brass2themax"
            },
            "url": "https://myanimelist.net/reviews.php?id=17013"
        },
        {
            "content": "I feel this show hasn't been getting the love it deserves and I think the only way to rectify this is with a semi thought out and heartfelt review so here I go\r\n(it's the first one I ever wrote so be gentle)\r\nStory\r\nOkay now get this\r\nit's about bad ass muscle-bound lolicon loving mutant Priest dude\r\nwho lives in Japan after several countries decided to bomb them for some reason and so everyone got super powers.\r\nHe fights an evil organisation filled with other muscle-bound mutant dudes \r\nand some hot 6 year olds girls who also have superpowers\r\nthis organisation also has a bunch of bad ass robots that huntpeople down.\\n\\n\r\nThis priest right lives with a hot 14 year old chick who doesn't wear underwear and the bad guy from Mega man, one day on a typical days jogging for the bad ass priest he come across this green haired pussy kid who's being chased by one of the bad ass robots I mentioned earlier,so for some reason he decides to help out the loser and kicks the bad ass robots ass, the kid realising that this priest is totally awesome (something green haired kid could never hope to be)\\n\r\ndecides to go live with the bad ass priest the hot 14 year old chick and the bad guy from mega man.\\n\\n\r\nThen uh a bunch of cool an funny stuff happens  \\n\\n\r\nArt\\n\r\nI can't really say much about this since I don't know too much about it.\\n\\n\r\nBut it has really bright outlandish colours that look lovely and capture your eyes.\\n\r\nIt has lovely character designs the characters look pretty distinct in their appearance so you can easily tell who is who though the rare few do look similar.\\n\\n\r\nThe settings and background art look very appealing, \\n\r\nand animation for the characters is fluid and well just great making many of \\n\r\nthe fight scenes look amazing.\\n\\n\r\nAnimated by the people who made Death note it's about that level I would say.\\n\\n\r\nSound\\n\\n\r\nThe soundtrack is filled with rock and roll type stuff which gets you pretty pumped up which is a must for this kinda show.\\n\\n\r\nThe opening number \\n\r\nSpace cowboy is probably of the coolest and I guess GARest openings your likely to hear.\\n\\n\r\nIt surprisingly features a couple of classical sounding pieces as well which seems a little weird  for the show but does not at all feel out of place.\\n\\n\r\nCharacters\\n\\n\r\nLets see you got\\n\\n\r\nBad ass awesome priest with lolicon fetish\\n\r\nBad ass awesome hot chick with big rack\\n\r\nGreen haired pussy kid (you can ignore him)\\n\r\nDr dude from Mega man\\n\r\nand group of other mostly bad ass characters \\n\r\nwho would take forever to mention,\\n\r\nmost of the characters are cool and awesome basically. \\n\\n\r\nEnjoyment\\n\\n\r\nIf I could give a million points for this I would\\n\r\nbefore warned though \\n\r\nonly awesome people who like awesome things will like this\\n\r\nSo watch it now\\n\r\nor else\\n\\n\r\nbtw\\n\\n\r\nshow = awesome\\n\\n\\n\\n",
            "date": "2009-10-30T10:45:00+00:00",
            "helpful_count": 26,
            "mal_id": 20112,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/209745.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/unellmay",
                "username": "unellmay"
            },
            "url": "https://myanimelist.net/reviews.php?id=20112"
        },
        {
            "content": "When I first watched Needless, I thought the first few seconds in \"Blah blah blah, story line, narrating, etc...\" But then out of nowhere, \"WE'RE MODERN STRANGE COWBOYS!\" The moment I heard this song, I knew I may just have found my new favorite anime. Which leads me to say this, the music and overall sound in this series is BEYOND AMAZING! Sound (10)\r\nAs for that \"Blah blah blah, story line, narrating, etc...\" it is pretty much the gist of the entire story. I suppose settings after World War III are pretty common and that the series is kind of like a mix of Scryedand Gurren Lagann, but I thought it had a little bit of Ikkitousen/DBZ/shonen-ish in general in the mix too. A bunch of fighting, ecchi, etc... I would definitely recommend those kind of series to anyone who may have liked this show as well. (Even if some of the mainstream shonen have extreme negative criticism from some audiences.) To summarize, even if Needless is doing what has already been done, It's doing it RIGHT. Story (10)\\n\\n\r\nHaving said that just now, I want my readers to know this. This series is NOT, I repeat, NOT the new Gurren Lagann. No, if anything, Gurren Lagann is the new NEEDLESS. The Needless manga started in 2004 and I know this is the anime page, but you have to understand that these concepts all first started here. Mostly, the art and character designs. (And characters in general.) We've got a pretty nice cast, a shota for all the fans of that out there, manly man for all the people who want their fill of \"WHO THE HELL DO YOU THINK I AM?!\" and the girl who is pretty much the ecchi fan service until all the other girls show up. All of the characters are pretty unique in my opinion and all have their moment to shine. They're a group to be remembered, not just some random set of people that are like filler characters from Bleach or Naruto. Art/Animation (10) Characters (10)\\n\\n\r\nHowever, the most important factor of this show, which I think really will determine whether or not you can go through with it entirely... Is the \"Enjoyment\" factor. I could say \"Hey, I watch this show, and I love it!\" But it's WAY more than that. I am over here, singing the OP each and every time I watch this, like some kind of weeaboo, raving with my friends at how awesome every single moment of this anime is. We'll be over here screaming \"I'VE MEMORIZED IT!\" \"LITTLE BOY!!!\" \"EVE CANNON!\" and it's just the most amazing experience I've ever had in my entire life. Seriously, if I had to say what my feelings were for Needless in a single sentence, it would be something like this.\\n\\n\r\n\"My Need for NEEDLESS is highest on my list of necessary necessities.\"\\n\\n\r\nI'm sad just at the thought that this series has to end. My overall rating of this series and enjoyment is a 10/10 and if you can watch this, pushing aside just the minor little similiarties and \"shonen-aspect\" that this show gives off, you'll be able to let loose and enjoy this as much as I do.\\n\\n\r\nBE SANITY!!! (Lol, Ayako, and their subbing errors. This was my first review by the way.)",
            "date": "2009-10-12T07:48:00+00:00",
            "helpful_count": 20,
            "mal_id": 19607,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/57671.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Panty",
                "username": "Panty"
            },
            "url": "https://myanimelist.net/reviews.php?id=19607"
        },
        {
            "content": "There are probably a ton of things that could be said about Needless, but in the spirit of this series we will just narrow it down to something simple. Needless! is a show you will either like for what it is, or hate it for the very same reasons.\r\nNeedless is a pretty simple show with an equally simple concept. Have a mix of characters with noticeable personalities brawl it out in a span of 24 episodes, accompanied by some great art, fanservice, GAR, gore, comedy and a fast phased metal soundtrack that won't fail to get your blood pumping. \r\nIn a future where Tokyo hasbeen bombed and 'black spots', areas in which people with mysterious abilities roam, exist there is an evil company surrounded with secrets that has settled in the center of the Black Spot and eliminates all opposition. However, a small group of people decide to stand up against this company. Now the plot is in place we are only missing the 'Fight' and 'Finish him!' lines and the person they belong to. Ah well.\\n\\n\r\nEnter Adam Blade, our very manly main lead. Accompanying him are his sexy sidekick Eve, a kid with no combat abilities, an old geezer, a cool Shinigami girl with a giant sword, a loli half human-half cyborg and a girl with a split personality. On the evil company side we have the usual ultimate evil in human form, Adam Arclight, a mysterious guy warped in bandages, a magician kid and an evil queen type woman with a huge rack. Crew set? Let's Brawl.\\n\\n\r\nQuiz time. The question is: \"What makes a show with such a simple concept so popular?\" Maybe it are the characters. After all, who expects a priest that turns out to be an insane 12 pack abs devil priest with a lolicon fetish that prefers storing grenades over holy texts in his bible and has some wisdom like this: \"If someone hits you on the left cheek...DO A PILE DRIVER WITH YOUR OTHER!!\" ? Or a sexy girl that can transform any part of her body and comes up with the most unique nicknames since she cannot remember people's real names? Or a crazy maid that takes the meaning of split personality to a brand new level?\\n\\n\r\nIt could as well be the art. It is good to great to stunning at times. Animation is smooth, characters look realistic enough. For Needless, that is. The creators probably also knew they did a nice job with the art, as they even included two moments in the series where the art is a..different kind of stunning. The soundtrack could be the secret behind the series' success as well. It always seems to come with the right tune at the right moment, something that makes the fights so much more epic and enjoyable to watch. If not that then it probably is the comedy. It is well done and fits the tone of the show, yet does not fail to give you a good laugh every now and then. \\n\\n\r\nNeedless is a show that may prove either enjoyable or not for the reasons above, but especially on the person watching it. Simple as that. If you are still not sure on what to expect, watch the first opening/ending or simply lock the door to your room, dig up your headphones and marathon the thing. Although the title may be misleading, this show could very well be something that makes a nice addition to your list.",
            "date": "2010-01-13T03:46:00+00:00",
            "helpful_count": 17,
            "mal_id": 22363,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/152508.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stigs",
                "username": "Stigs"
            },
            "url": "https://myanimelist.net/reviews.php?id=22363"
        },
        {
            "content": "NEEDLESS was one of the first anime I started watching as it was airing, when I first got into streaming new shows via fansubs.  The shininess of watching brand-new shows hours after airing in Japan still hadn't worn off for me, so that may have somewhat influenced my opinion of the show.  Regardless, NEEDLESS is a crazy, action-packed, explosion- and fanservice-filled ride through a post-apocalyptic wasteland straight out of Fist of the North Star or sCRYed.\r\nMy reviews have gotten a lot of 'Unhelpfuls', so I'm gonna try and stick with the usual format and see if that's more palatable.\r\nStory - 6/10\r\nUnfortunately, this isNEEDLESS' weakest point, since it's a comedy/action series, the jokes and the fights are really what keep the story running.  The overall plot is pretty much the exact same as the aforementioned sCRYed; an event that devestated part of Japan also gave the survivors mysterious powers, which the heroes use to fight against an evil megacorp trying to run things.  The battle between the two Adams is pretty awesome, but reminds me too much of Cable and Stryfe from the X-Men comics.  Very derivative story but not bad for what it is.\\n\\n\r\nArt - 8/10\\n\\n\r\nI know the art style turned a lot of people off, but I love the super-exaggerated look of the characters and the action sequences are superbly done.  The girls are all drawn primarily to be easy on the eyes, while the guys all have huge necks, pulsing muscles and multi-pack abs (except for poor little Cruz).  As a parody of over-the-top shonen anime, it's appropriate that the art style parody those same conventions.\\n\\n\r\nSound - 10/10\\n\\n\r\nEasily NEEDLESS' best stat.  I loved the music, from the BGM to both OPs and EDs.  I personally prefer \"Modern Strange Cowboy\" to \"Scarlet Bomb\" but they're both pretty killer as OPs, and the (in)famous Pretty Girl Squad takes over for the EDs.  The voice acting is very hammy and over-the-top; Adam Blade's seiyuu speaks maybe three lines in a normal voice, shouting all the others at the top of his lungs.  And the way he rasps \"Memorized!\" (omoeta) is fucking awesome.\\n\\n\r\nCharacters - 8/10\\n\\n\r\nWhile few if any of the characters in this series have any real depth, this was never intended to be a series about dialogue and character interaction.  All the characters have one or two traits that are turned up to maximum volume and blasted 24/7; for example, Adam Blade's overwhelming arrogance and lolita complex, Eve's inability to remember anyone's name, and so on.  Still, despite the lack of depth the characters manage to be quite charming, especially the over-the-top hero of the show (Cruz is technically the main character, but Blade's the one who does all the fighting).\\n\\n\r\nEnjoyment - 9/10\\n\\n\r\nThis show made me laugh, turned me on with the antics of the Pretty Girls Squad (especially when I first saw the ED, full of mostly-naked girls we hadn't even seen yet O_o), and got me pumped up for the crazy over-the-top fights.  Even slamming kanji into the camera's face to remind us of the names of the moves got a 'fawk yeah!' from me.  \\n\\n\r\nOverall - 9/10\\n\\n\r\nUsually story counts for more for me, and I wouldn't give such a high overall score to an anime that falls so short in the storyline category.  But as I said, the plot's not really what's important in this show.  I mean really, what's the overarching plot in Lucky*Star?  It's an insanely fun and crazy funny parody of shonen stereotypes and does it marvelously.  And interestingly enough, the parts that are parodied the most--the endless battles and in-your-face fanservice--are done about as well as I've seen in the 'serious' shows.  \\n\\n\r\nIf you don't like the pro-wrestling atmosphere of hugely muscled guys and hot chicks in skimpy clothes fighting one another (for often implausible reasons), then you might want to stick to more serious fare.  If you love shonen anime tho and like to laugh at the conventions of the genre, NEEDLESS is definitely worth giving a shot.",
            "date": "2011-05-14T06:38:00+00:00",
            "helpful_count": 16,
            "mal_id": 36975,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/480430.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Blind_Guardian",
                "username": "Blind_Guardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=36975"
        },
        {
            "content": "Final verdict and tl;dr for convenience: \r\nNeedless has no redeeming qualities when it comes to being as basic of a concept as a shonen duke-it-out. It's a poor and a mecha-less attempt of capitalizing on the hype for TTGL's \"post-apocalyptic rebels with an attitude\", and as such, it is rushed and bare-bones. I seriously recommend a critical re-watch if you somehow thought that anything above 6/10 is deserved, but I understand if you judge your anime by your personal watching experience.\r\n---\r\nThe visual style and premise seem alluring, until you start watching it. Needless is a very basic shonen duke-it-out with a very basic plotline and,harshly put, proof-of-concept charactes. \\n\r\nThe art? It looks fine and dandy... until they stop giving a sh*t. I don't mean like \"oh neat, this is a simplified black & white raster to intensify the feeling of speed and intensity\", I mean it like lazy and forgotten. There are unfinished sections within, and it's very blatant. For that alone, I cannot recommend this rushjob.\\n\\n\r\nNeedless' noticeable storytelling and character tropes include, but are not limited to:\\n\r\n-clothing damage\\n\r\n-constant peep-shotting, regardless of the previous\\n\r\n-power lobbing\\n\r\n-plot armor & strength (guy who is losing by all accounts suddenly just wins the fight)\\n\r\n-stretching jokes and story recapping to hit the episode time\\n\r\n-useless characters\\n\r\n-pure lack of context and ideas\\n\\n\r\nThe story is actually not basic, just bad. After the nuclear war, sections of the world have become barren wastelands. Yup, it's just SECTIONS of destroyed, plantless/lifeless landscape, not the actual whole world, with people scrounging for scraps and living a generally shitty life. There is nary an explanation for this. Then comes a medicine megacorporation gone bad with the intent of... well, if there was an intent, I'm sure it was hidden in the later episodes to justify one or two evil speeches. The big bad wants one of the characters for his plans and so lures the good guys into their home base after two destroyed goons.\\n\\n\r\nThe main character, the shota, has little to no relevance to the actual storyline. The supposedly actual main character (voiced by Takehito Koyasu, DIO for one) is a thunderhead whose main trait beyond plot armor and stronkest ability is his comedic relief trump card, that is, going full Sanji on >12 yr old girls. The other main and side characters are either useless and/or boast tropes as their only defining traits.\\n\\n\r\nOST, apart from op/ed, is some nice-sounding, yet pretty basic metal guitaring. You've heard all of it in your general fighting games before.\\n\\n",
            "date": "2019-01-22T10:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 299783,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5853156.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Jafarinparta",
                "username": "Jafarinparta"
            },
            "url": "https://myanimelist.net/reviews.php?id=299783"
        },
        {
            "content": "Ever since Kenshiro informed Zeed and his gang they were already dead, the badass traveling a post-apocalyptic wasteland (shirts optional) looking for ass to kick has been a staple of anime, to the point that nowadays it's almost always a parody.\r\nNeedless continues the trend of parodying the genre, by including something almost all anime seem to have nowadays, moe fanservice.\r\nSTORY: Overall the story is nothing special, it's the same thing we've seen before.  The action tends to be done fairly well, albeit usually fairly one sided.  The only thing that holds it back from being a 7 is the tendency to needlessly (punintended) take time to throw in fanservice.  I'm not referring to panty shots or jiggle, that's almost expected nowadays, I'm talking about taking a full 24 minute episode to slowly undress the \"Pretty Girl Squad\" with only the actual plot development in about 90 seconds at the end.  Hopefully they won't pull something like that again.\\n\\n\r\nART: The character designs themselves are good, they just seem out of place.  Adam Blade looks like he belongs, but most of the other characters have designs more fitting for Romantic Comedies like Asu No Yoichi. \\n\\n\r\nSOUND: Nothing to complain about here, the OP is very good, the ED while a bit out of place is rather catchy, and as I've said, Needless covers it's action fairly well, including BGM.  The voices all work, the only thing they need to work on is attack names, they seem a bit random, but that's more a script issue.\\n\\n\r\nCHARACTER: The characters are for the most part fairly good.  Adam Blade's lolicon tendencies are rather entertaining.  And as lolworthy as the existence of a \"Pretty Girl Squad\" is the members are rather likeable and the loli actually makes sense as a \"cute bruiser\" type rather than just fetish fuel.  The only pointless one is Cruz, who is so useless to anything no one even cares to remember his name.  \\n\\n\r\nENJOYMENT: The series grew on me after a couple episodes, it's definitely fun to watch, it just has a few facepalm moments here and there that detract from the series.\\n\\n\r\nOVERALL: Needless is worth watching.  If you aren't really a moe fetishist and are more a straight up action fan you should probably give it a few episodes to try to let the intial anachronism feeling wear off.  I'll probably end up giving the series a 7 or an 8 when I finish",
            "date": "2009-08-30T17:13:00+00:00",
            "helpful_count": 9,
            "mal_id": 18234,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75266.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JustRad",
                "username": "JustRad"
            },
            "url": "https://myanimelist.net/reviews.php?id=18234"
        },
        {
            "content": "I have to say that this is the worst anime that I have seen in a while and I'm surprised I made it through the whole thing. The only redeeming quality of this series is the main character Adam Blade who is just entertaining to watch.\r\nStory:\r\nCliche and predictable are how I would describe it. It tries to throw a few twists at you but I saw them coming far in advance. It tries very hard to be epic and over the top but lacks a well thought out story\r\nArt:\r\nAnimation was pretty clean, but the fact that characters cloths would regenerate and wounds would be healedbetween episodes, or sometimes scenes just so it could be done again was just too much.\\n\\n\r\nCharacters:\\n\r\nI hated every single one of the except Blade! Every single one of them was retarded except the kid who had normal intelligence but was treated like genius. \\n\\n\r\nEnjoyment:\\n\r\nwill never watch this series again and would only recommend it to people that i don't like.",
            "date": "2010-05-29T14:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 26570,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8584.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Caboose",
                "username": "Caboose"
            },
            "url": "https://myanimelist.net/reviews.php?id=26570"
        },
        {
            "content": "Alright, this is my first review, I hope this goes well.\r\nWhen I first saw this anime here, I thought that it would be just another shounen beat up anime, which I haven't really even watched, because I have always kinda shyed away from them. Well, I decided to give it a try and began watching this. The voice actors were for the most part pretty unknown ones to me, they haven't been in any other animes that I have seen, at least ,not in any positions from which I would remember them.\r\nIt soon became pretty clear, that the anime isn't your typical shounen beat upanime, because at least I have an image, that they usually have storylines that take themselves pretty seriously, and they don't really cultivate humor that much. This anime, however, seemed to be pretty humor based, and it wasn't trying to hide it's pure fan service either. As I watched the show, I noticed that I might actually like those shounen animes which I mentioned before, since I enjoyed all the fighting scenes and over the top charismas of the characters and muscles and everything that just screams \"fuck yeah, I am the real man\". That combined with the humor that I actually found to be pretty funny, it looked like this was going to be one really good anime to watch.\\n\\n\r\nI also liked the art of this anime, although there wasn't anything special on it, it was just fit for this anime, that's pretty much all I can say about it, not bad and not anything special. The music however, was so goddamn good. The music fits perfectly in the background of the battles. The music is just full of testosterone and it fits perfectly in the speedy and epic fighting scenes, making them even more enjoyable. I also liked the first OP of the show, for the same reason as I liked the background music of the show. The metal music just fits here perfectly and that's why I highly disliked the other OP. I Liked some of the characters, but, as it is with many other animes, the main character (or one of the main ones, I am not really sure), Cruz,  is pretty bland and boring character, but luckily the other characters make up for that. Adam is a bad ass character that I liked for the sole reason of him being an awesome ass kicker and really over the top confident character, which raises the testosterone count of this anime to the point that it's just so goddamn awesome that you can't hate it. The other characters also function well and they form a pretty good character roster, but Adam alone is one reason to watch this anime.\\n\\n\r\nAs I said in the beginning, this anime is pretty humor and fast action based anime, but the story is also pretty interesting. However, the anime doesn't really utilize it that well, and I personally think that it doesn't have to. I think it was the writer's plan to make this anime more action and humor based one, and not focus to the story that much. And I think that's fine, the reason why I enjoyed this anime is because of the fast paced action and all over the top fights, manliness and humor, not the story. Don't get me wrong though, the story is, at times, interesting, but it's wasn't the reason for me to watch this anime. That being said, in the end, the story of this anime gets much bigger role than in the beginning. This was expected: there were many things that were unexplained, so it was kind of a good thing, since those things are explained in the end, but at times, it kinda felt like a forced drama, not to the point of annoyance luckily, so it didn't really kill the feeling of this anime.\\n\\n\r\nThe fanservice also has a huge role in this anime. And in an anime like this, it doesn't really bother me, actually, I must say that some part of me might actually like it, I mean c'mon, who doesn't like pantsus? If this anime would be a serious one though, then it might kinda kill the feeling, but in this kinda anime, it's not a bad thing.\\n\\n\r\nTo summarize all this, I say that if you expect this to be an anime that has a deep and serious storyline, you probably won't like it, but if you just love all the action, over the top personalities, fighting and the humor, then you will enjoy this.",
            "date": "2012-07-15T12:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 66581,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/681289.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Samstaforcesama",
                "username": "Samstaforcesama"
            },
            "url": "https://myanimelist.net/reviews.php?id=66581"
        },
        {
            "content": "There are some animes that will end of being forgotten from people’s memory, and be marked as ‘generic’ anime. We call those anime, ‘Needless’.\r\nTo describe what needless is; it focuses on multiple theme of being manly, being comical, being serious, being eechi but also being ridiculous itself. It’s anime for ‘GAR’ I can say. Spammed action sequences take majority of this anime, and there are tons of plot holes even on those actions. It follows typical shonen style plot and full of clichés. There is nothing good about anime except the fact that you will actually enjoy it regardless to how horrible it is.\r\nActually, it’seven more generic than you can think. There is useless boy who is reluctant to become a main character. There is a hothead, but also useless support character, screaming ‘LIIIITTLEEEE BOOOOOOOOOI’. There is ‘wanna-be-Kamina’ Blade man who smells like GAR barbecue. There is evil one, who is evil. They killed them of one by one. They have 4 mighty ones, and one ultimate boss, Adam Arclight. It is so generic, that makes it way too much predictable.\\n\\n\r\nHonestly, there is no real plot there. It’s just fighting sequences that make this anime worth with screaming of characters all over the place. Over-the-top actions and series of panty shots. That’s all about it. Regardless, let’s talk about how story of Needless goes. First, there was Cruz. He met some hot-headed manly dudes and girls. They made a crew. There is an enemy to fight by default. They just fight. They went to boss lair. They fight again. Soon they meet boss. Fight. Done, it’s the end of the story.\\n\\n\r\nOne of the worst aspects of this series is pacing. Seriously, at first, it went fast; although it was ridiculous overall, pacing was not that bad. After that, they  got trapped in that gigantic room with pretty girl squads for about… I don’t know, about 6 ,7 episodes? That’s ridiculous. They could’ve at least provide some other background other than that. It screwed up some of enjoyment I had when they were just laughing and kicking around before they went there. Actions are dragged out so much, due to extremely detailed explanations and ANALyses on each move and some babbling, waiting, shoutings that character does. Plot holes are so big; you will have plenty of time wondering; ‘Why are they even waiting for 15 minutes in the middle of fight just to allow enemies to have a think time?’.\\n\\n\r\nHowever, the worst thing is probably that they failed to manage to keep the consistent and interesting plot itself. First 1/3 of the series was probably better in terms of fighting, or w/e. Later, it suddenly gets serious. Every aspect is basically ‘spammed’. It spams this serious and unserious mood about 10 times during one episode. Spammed slap stick comedies are timed so badly, most of time it ruins the mood horribly. There are so much spam of out-of-circumstance-bloods and nudities. Some plot twists are not actually a twist, since they were mostly predictable. It’s just spammed with absurdity. Funny thing is, ‘Side stories’ of needless were much better than its ‘Main story’. I enjoyed the entire support episode that those not contains the main stories. For example, flashback episode of Blade was better than Blade fighting with Arclight. \\n\\n\r\nArt, was terrible. No, it surely was. Starting with character design first; characters are overly muscular and females are overly… um ‘something’. Their body shape all looks exactly same, so does their faces. Design of Cruz is probably the worst here, look at his neck first of all. They all looks like some kind of mass produced clones with different hair style and costumes. Speaking of clothes, they are even worse. Oh hell, they are just ‘LAUGHABLY ABSURD’. Extremely wide collars, un-matching colours… Those costumes are also, almost same for every single characters. The worst, is costume of Disk-san. She wears pyjama from the start to the end and it is clothes that someone like your grandmothers would wear. Action part animations sometimes become choppy, such as the part where they are screaming their ridiculous attack names. Other than that, animation was overall just fine. \\n\\n\r\nSound aspect was as poor as its art. Some audio effects are completely out of circumstances and break apart the atmosphere. OP was fine but it showed how spamming English language in J-pop can be resulted being ridiculous for actual English users. Ending… I better not describ; it’s lolicon fetishes. Well, that makes sense, since two things I can remember in Needless is spam of ‘LIIIITTLEEEE BOOOOOOOOOI’ and kawaii shots. Seiyuus send their most time… screaming. They sound all monotonous; you can’t say the difference between the voice Blade and Arclight when they are speaking, since they speak with exactly same emotion every single time. Moreover, the problem in their speech existed from the start; the title of, ‘Needless’ itself. Those who do not know English people might think its fancy name for calling super heroes, but I personally think it’s ridiculous. Also, there are some extremely uncomfortable attack names that seized me in pain, such as ‘LIIIITTLEEEE BOOOOOOOOOI’, ‘Dean Drive Fox Hound’, ‘Magnetic Worldo’ and even ‘Doppelganger’. They are spammed throughout the whole series and may decay your ear at the end of the series. Seriously, ‘LIIIITTLEEEE BOOOOOOOOOI’ is just the worst thing I’ve ever heard. I cried for overuse of misused English…\\n\\n\r\nThere is not much to say about characters, since they are, generic. They have nothing except of being brave or following some same clichés that shonen suffers most of the time.\\n\\n\r\nBlade, despite of having some spam of irritating lolicon loving part, succeeded of being one of the coolest, and manliest one I’ve ever seen. Other than that, characters development and description is pretty much ‘dead’. They are empty, including Blade. They are just overridden by their cool abilities and failed to show what they have inside. Only one who actually showed that was Saten, but others; none existence. In terms of comical relief and some interesting plot, pretty girl squad and Eve was the only ones who were ‘interesting’.\\n\\n\r\nYes yes, I can ignore everything. However, I just couldn’t stand that Cruz guy. He is the worst character in this series. Everything is on his point of view, yet what he do get kicked and punched to death while everyone is fighting. The part where I died was when everyone is saying, ‘YOUR ONLY ABILITY IS THAT YOU CAN FUCKIN THINK’. Guys, everyone can think, even the most foolish person in this earth. They are all just common senses that Cruz has. Oh wait, maybe because that everyone in his crew is too dumb to even find out what ability of making things freeze and burn at the same time. (Temperature) And, in this part, we find one big plot hole. In his crew, there is a android who lived 300 with super computer brain, and there is also a doctor, who was one of the most professional scientist in the past. It makes absolutely no sense that Cruz becoming the only one who can ‘think’.\\n\\n\r\nEve is the only one character that makes this series at least a level of watchable. She is cool and very manly in terms of her spirit, which makes her only of the most ‘manlike female’ in the anime universe and also the best character of this series. \\n\\n\r\nNeedless is a terrible and good at the same time. Although it was spammed with ridiculous comedies, ‘LIIIITTLEEEE BOOOOOOOOOI’, bad art, monotonous voices, bad English, plastic muscularity and ‘Ability to THINK’, it was very very enjoyable, like most of shonen stuffs. Somehow, character success of at least not being dull. Actions are cool and so does their abilities. There are scenes that you can say, ‘hell this is just awesome’. Dragged episodes cut these enjoyments in half, but whatever. It is still enough.\\n\\n\r\nSo, in conclusion, Needless failed to become over the average anime in terms of its quality etc. every aspect. However, it was still enjoyable whatsoever. Needless will be forgotten, and I also do not particularly recommend watching this anime, but I can be sure that it was quite an experience having manliest characters and cutest females in one series with awesome superpowers.",
            "date": "2010-01-04T04:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 22026,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/225515.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ringoo4",
                "username": "ringoo4"
            },
            "url": "https://myanimelist.net/reviews.php?id=22026"
        },
        {
            "content": "Well, i hadn't had this much fun watching an anime for some time. It was first aired in Dec, 2009 but only found this particular anime about 2 weeks ago. Didn't watch it right away, but when i watched the first episode, i couldn't stop watching.\r\nVery few Anime's hook me like this one. It reminded me of Gurren Laggan for some reason. I'm not very versed in the Anime lingo, i cant tell you that this is a seinen or shounen or what not. I just watch them cuz i enjoy watching anime. Doesn't really matter to me what it's called do don't expect anythingon this review to have that much depth. All i am here to do is tell you what i think... and i think this is a great Anime to have. So lets go down to the scores...\\n\\n\r\nStory - 7: - Well i rated this a 7 because as I've said before theres nothing new here. Post apocalyptic world with people that have super powers and theres one nut that tries to rule the world and the heroes goes out and stop him. Altho if you go to the story, that really wasnt their goal, it just happened to end that way, which made for an amusing story.\\n\\n\r\nArt - 8: - I gave this an 8. To often do i see anime that is consistent throughout the series. There will be a few episodes that seems that the producers used a different animator. For this series, it didn't come often, and the ones that did, turned to to be a more stylized and a rush job. In anycase Gurren Laggan had the same thing.\\n\\n\r\nSound - 7: - Well nothing spectacular here just good. There were sounds, and background music but nothing that really popped out as good or bad. Opening and ending themes were standard and ordinary, even now as i'm writing this review i cant remember the Intro and Ending music. It isn't bad either, its just there and unremarkable. \\n\\n\r\nCharacters - 9: - Here is where it gets interesting. Without going into details and bordering on becoming a spoiler, the characters they had were interesting to say the least. Everything from am anti-hero hero, cute girls that constantly show their underwear, to multiple personalities and character types, including the \" cliché\" types that are abound in any anime genre.\\n\\n\r\nEnjoyment - 9: - I had a blast with this anime. Every episode was either entertaining, Amusing, to total laughter. It was enjoyable to say the least. It pokes fun at every anime you can imagine, and most of the time, it makes fun of itself. There are times where the characters are even aware that they are in an anime and make fun of each other. Lines like \"I cant believe that a minor character like you without powers is even in an anime like this..\" just takes the cake in making fun out of everything. And when it seems that it couldn't get any better, they snuck in a love story without you noticing it. Man, that caught me off guard. In anycase Total Enjoyment start to end.\\n\\n\r\nOverall - 8: - I have the overall score an 8. It could have been higher but i'm just going on the average. Story and sound gout it down to an 8 instead of a 9. But don't let that 8 fool you, if you enjoy a good laugh or just tired of serious anime, and just want senseless fun, this is the anime for you. I highly recommend you watch this. As always, if your not sure, Download the first episode and watch it, It it doesn't tickle your fancy than don't continue, for me at least, the first episode was enough for me to say Hell yeah..",
            "date": "2011-05-02T09:23:00+00:00",
            "helpful_count": 6,
            "mal_id": 36678,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442509.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jekmyster",
                "username": "Jekmyster"
            },
            "url": "https://myanimelist.net/reviews.php?id=36678"
        },
        {
            "content": "Needless\r\nThis anime is about the aftermath of a World War 3. A bomb was dropped on Tokyo city and as a result, some people gained strange powers like controlling fire or water or having great speed or strength and stuff like that (much similar to that in Sekirei). These people were given the name Needless (which is also the anime's title if you hadn't noticed). This anime is a perfect combination of action and comedy together with time to time ecchi.\r\nThe story in this anime is quite good. It's basically about a group of Needless fighting another group which is oppressing them. The story hasprogressed quite well. From start to end everything is in perfect order. They gave a pretty decent introduction as to what is happening and also gave a satisfying ending to the story which sort of ends the possibility that the anime will get a second season and continue with the manga. Anyway, it really won't matter that much when you finish the anime.\\n\\n\r\nVoice acting done was pretty decent. It wasn't like they were doing it on gunpoint or anything. It was pretty good. The artwork was also well done. It was well done and matched the sheer violence this anime had to offer. The way the action scenes were shown was also quite good.\\n\\n\r\nAll the characters in Needless had perfect roles in the anime's story. All introduced characters had perfect and important roles in the story. Along with a role in the story, all characters had something funny happen to them which was very well done and these scenes decreased the overall seriousness which most animes of the action genre have. This anime is one of the best animes I have seen yet. I enjoyed every part of it. It's just full of comedy. Whenever a scene got too serious or emotional, something funny was thrown in to lighten up things. Even the finale, which is supposed to be a very serious and/or emotional episode, also had comical scenes around every corner. A scene did not go too long without some comical scene in it.\\n\\n\r\nNeedless is a great anime. The violence might be too bloody but the excess comedy more than makes up for that. The way bloody violence and comedy have been mixed in this anime has made it quite different from the rest where most action animes are often serious. This great combination of action and comedy is what makes this anime awesome.\\n\\n\r\nI am open to suggestions. Feel free :-)",
            "date": "2013-09-10T06:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 112495,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2650363.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Yamada2",
                "username": "Yamada2"
            },
            "url": "https://myanimelist.net/reviews.php?id=112495"
        },
        {
            "content": "May contain minor spoilers, will leave out story spoilers.\r\nI'd like to sum this up at the beginning, but don't want to give it away just incase you haven't seen it.\r\nThe story was actually the best part, in a sense.  Needless is about people who have supernatural powers called fragments that allow them to do wild shit.  The first 7 episodes of this are amazingly badass, it really sucks you in and the story just takes off quick and runs full steam ahead.  I can't really elaborate on the story without giving too much away, but a group of Needless go take onsome badasses early and it starts off chalk full of potential.  the rest will be below.\\n\\n\r\nArt was very good for its age, the sound was a little too 80's - 90's rage metal for me, but it wasn't totally out of place.  The voice acting was actually fitting as well.\\n\\n\r\nThis show has a bit of a weird feel, on one hand it doesn't take itself too seriously, constantly breaking the fourth wall, but on the other gets a little deep for an action fighting anime.  The comedy keeps it afloat early and had me rolling at times.\\n\\n\r\nThe characters start off strong, but then becomes are major weakness about half way through.\\n\\n\r\n**minor spoils**\\n\\n\\n\r\nThe progression is just too ridiculous.  It starts off so strong you start wondering where this is going and then after 9 or so episodes it just stagnates.  The characters are caricatures of caricatures.  it's got the classic samurai 7 feel to it, gathering the team, all with strong and weak points.  But ultimately the supporting cast were completley irrelevant.  They may have well just left them out since they really just got their asses kicked at every opportunity.\\n\\n\r\nwhen i said the story stagnates at around the midpoint, it's not hyperbole.  MC and crew get trapped in a room for like 9 episodes getting their asses kicked by weak characters and progressively fight stronger characters and the formula repeats until you're sick of it.  The character progression is almost non existent for anyone.  It focuses heavily on the antagonists, which is something i don't really like, and no matter how villainous the antagonists, it becomes obvious there will be no serious resolution.  At least they could have held that card closer to the end to dampen the dissapointment.\\n\\n\r\nat the end its the antagonists giving the motivational speeches and teaming up, which literally makes no sense.  the motivations of the antagonists are so flimsy that you cannot possibly reconcile it meaningfully.  You would think throughout the numerous heinous acts committed they may have questioned their role, but ofc they save that shit until the end, which just left a bitter taste.\\n\\n\r\nThe ending turned into pure DBZ, with so many twists that i subconsciously reached for imaginary nausea pills.\\n\\n\r\nTo sum this up, it starts off really strong, with interesting plot, characters, and potential and ends with a trainwreck.\\n\\n\r\nThe actual main character is a weak boy who plays literally no role, in fact i still have no idea what his role was throughout the entire show but he garnered so much screen time I felt his value would be revealed by the end.  It wasn't.  He served no purpose other than to recap episodes.  If you can shut your brain off and watch it for the moments of parody, there is certainly something here.  But the tone is so confused that you can't call this a comedy or parody, you just have to call it a clusterfuck.  \\n\\n",
            "date": "2015-02-09T08:16:00+00:00",
            "helpful_count": 6,
            "mal_id": 180020,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/149637.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Marthgun",
                "username": "Marthgun"
            },
            "url": "https://myanimelist.net/reviews.php?id=180020"
        },
        {
            "content": "if you like x men then you will like needless. needles are mutant humans with powers.\r\nthe story. \r\nis great its about this guy named Adam blade and he has to fight the dug company know as Simeon. the story is 10 out of10\r\nthe art.\r\nthe art is bright and colorful and great for a 2009 anime . 10 out of10\r\nsound.\r\nsound was very good and it has a very good dub. sound 10 out of 10\r\nthe characters are very good and funny \r\nand Adam arc light is a very great bad guy \r\n   and one of my most fave characters and funniest is eve .character 10 out of10\\n\r\nenjoyment .\\n\r\ni 100% enjoyed this anime  it is funny and has a lot of action. its worth the watch.\\n\r\noverall.\\n\r\ni give this anime 10 out of10 its a great anime",
            "date": "2012-04-11T16:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 58567,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1073845.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/gunslinger90",
                "username": "gunslinger90"
            },
            "url": "https://myanimelist.net/reviews.php?id=58567"
        },
        {
            "content": "First off to compare this anime to gurren lagan is absurd...Ok i can see the similarities in the characters of Kamina and Father but other than that, nothing alike.  There is no real storyline, and the little that is there is not amazing..It was interesting enough for me to watch the whole series.  I love anime with action and this is action packed, with cool abilities for each character.  I do enjoy that but to compare it to Gurren Lagan..give me a break, that was still to this day one of the best anime I have seen, and although I enjoyed needlessto a certain extent it is still my lowest rated anime on my list.  I know I have not seen a whole lot of anime, but enough to get on this site make a profile and continue to be addicted to anime and watch it everyday, and will continue to watch anime for the rest of my life.  Now don't let this deter you from watching this anime.  It is enjoyable because of all the action and cool different powers.  It does have a whole bunch of characters so that is a plus as well, but you don't grow attached to any like you do in Gurren.  Shit I cried during that anime.  You are not shedding tears for needless that is for sure...and the ending for needless...meh",
            "date": "2009-12-12T22:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 21329,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243376.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/firebender",
                "username": "firebender"
            },
            "url": "https://myanimelist.net/reviews.php?id=21329"
        },
        {
            "content": "Hm, it's an anime.\r\n compilation of Fight Game from playstation, Comedy, and Tragedy.\r\nIt's not so good compliation, it seems they could not decide if they make something serious or comedy.\r\nThe fight were OK, but why they say the name of the attact? (that's why I wrote about computer game).\r\nDo real people say things like: \"super punch!\", \"boy kick!\", when fighting?\r\nNot so much.",
            "date": "2010-04-22T12:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 25320,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/harrypotter",
                "username": "harrypotter"
            },
            "url": "https://myanimelist.net/reviews.php?id=25320"
        },
        {
            "content": "This anime is a combination of both action and comedy together including the cuteness of girls. To me, I am fine with moe. I only enjoy this anime is because of the characters and the funny plot combined with great action scene. I don't come and watch this anime just because of panty shots.\r\nEpisode 14 is the most funny part when Adam Blade says \"The reason is Girls. You look like a young girl and I'm already in paradise\".\r\nTo me, all the characters are badass and I like most of the characters except for Curz Schild. At least Cruz Schild instructed people in the lastepisode which was good. All the cast do not show me things that I don't like (crybaby, whiny, arrogant)\\n\\n\r\nMy 2 favorite characters are: Seto & Solva. They are badass females. You know I really love to see badass females even badass lolicons. Seto uses gravity power while Solva uses Magnetic World. Solva's powers reminds me of Magneto who uses magnetic powers. Wow an epic combination of x-men with cute girls.\\n\\n\r\nThe art and animation looks fun just like Soul Eater. I really wanted to see action combined with humour otherwise it will not be fun to watch at all. I also wanted to see action at least my some badass female save the day like Revy from Black Lagoon. Adam Blade is a very cool guy who is badass.\\n\\n\r\nEvery character is unique in a lot of ways which makes this anime even more fun to watch.\\n\\n\r\nI will recommend people this anime who are into fun and action scene with some panty shots. I give it a 9 out of 10. NEEDLESS  to say, I really love this anime! JUDGEMENT EXECUTION! HAHA! Just Joking!",
            "date": "2013-07-03T19:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 103683,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=103683"
        }
    ],
    [
        {
            "content": "Typically shounen style action series are not usually my thing.  I find them to be completely silly and juvenile and cater to a demographic that I am just not a part of.  The posturing and trash talking, the ridiculous reversals of fortune, and the long drawn out nature of the fighting usually cause me to lose interest.  Honestly I am surprised this appeals so much to teenage males, who typically have the attention span of a goldfish.  However, initially Needless seemed to be different, and appeared as more of a parody and comedy with an extremely enjoyable female lead.  Eventuallythough it loses its way and falls victim to the things that doom many of its brother anime; trying to be and do too much instead of sticking with what was working.\\n\\n\r\nThe plot, initially is about as basic and nondescript as they come.  Needless is set in a post apocalyptic world in which a new race of super powered humans have emerged, possessing fragments of power that give them mastery over a certain skill such as fire, gravity, and magnetism.  These fragments apparently have all come from a common source, a god-like being known as the Second.  These altered humans are known as Needless.  But there is a hard and fast rule however, while some fragments are more powerful than others each Needless can only possess one.  It all sounds like it an interesting take on the superpowers genre, and it a lot of ways it is though the way that the powers are used begins to get annoying after while (more on that later).  All is not well in the world of the Needless though as they are threatened by the extremely powerful Adam Arclight and his followers in which they face extinction from his scheming.  Only the mysterious Adam Blade and his band of resistance fighters stand in the way.\\n\\n\r\nNeedless is chalk full of slapstick comedy, action, blood and death, explosions, fan service, and machoism.  Fans of these are likely to find plenty to like.  The real problem with the series as a whole is the pacing of its storyline.  Things move along quickly in the first 1/3 of the series.  Perhaps a bit too quickly, which may have lead to the problems it suffers from for most of the middle and late portions of the anime.  The heroes find themselves trapped in a room where they must do battle with Arclight's strongest followers.  The battles are action packed but they drag out...forever.  The story comes to a crawl and these battles seemingly go on forever as almost half the anime is taken up by this one fight and set in this same room.   The shocking plot revelation made during this arc is obvious to anyone with any degree of sophistication.  Once our heroes finally manage to get out the rest of the series is almost completely taken up with flashbacks, plot building, and adding a conspiracy arc.  While this made Needless' story infinitely better and more complex it again felt to me like a complete reversal once again in the theme.  To me it was like the director couldn’t make up his mind.  Did he want to create an echii action parody, a straight shounen fighting anime, or a complex story about genetic research and political intrigue?  \\n\\n\r\nA small rant is in order on the battles.  I know that it is a staple of this kind of series to yell out and name all of your attack moves and special abilities, but really is it that hard to come up with some names that make some sense?  After hearing \"Little Boy\" or \"Dean Drive Fox Hound\" uttered for the billionth time I just wanted to shove a pair of scissors into my ears.  And seriously what the hell does Dean Drive Fox Hound supposed to fucking mean anyway?  It’s nonsense!\\n\\n\r\nThe real tragedy is that what they were doing at the start was working.  The best part of Needless is the characters, in particular Eve Neuschwanstein (try saying that ten times fast).  She’s got all the body measurements to make her a fan favorite, but she has a hilarious and quirky personality to go along with it to make her memorable.  She stupid, can’t remember anyone’s name which leads her to \"shorten\" people’s names into nonsensical words.  She has a really cool special ability called Doppelganger, which allows her to change herself into basically anything of the same mass as she is.  Unfortunately as the series progresses she tends to disappear more than a main character should from the action, thus taking away a lot of the appeal for the show for me since I really enjoyed her.  Also her Doppelganger ability is used in ways over the course of the series that seem to be inconsistent with what the ability should really be able to do.\\n\\n\r\nAs for the other leads, Adam Blade and Cruz Schild the results are not as good.  Blade is a silly and typical shounen male with an over-the-top character design complete with an unoriginal and clichéd personality (basically think TTGL's Kamina).  Unless you love 12 pack abs and these kinds of stereotypes or this is the first anime you have ever seen, then you’re unlikely to be impressed by him.  That being said he does have his moments of comedy gold and he is not completely without merits.  Cruz is also a typical anime boy who reminds me of another TTGL character, Simon (the young version) in both looks and personality.  Though he seems to have more sense than most of his shounen brethren, and stays out of trouble for the most part and leaves the fighting to those with powers.  His greatest attribute is that he’s probably the only person in the show with a brain.\\n\\n\r\nThe rest supporting cast is a mix of some very entertaining and memorable characters and more shounen stereotypes.  With the exception of Disc, the rest of Blade's team of resistance fighters is uninspired.  The ones who really shine are among Arclight's subordinates.  This starts and ends with the Pretty Girl Squad of Mio, Setsuna, and Kushinashi.  I found their antics to be the most amusing of any of the characters in the series.  They are probably the objects of the most fan service, next to Eve, but for the most part it’s all pretty funny and just doesn’t feel as pointless as it usually is in other shows.\\n\\n\r\nArtistically Needless is an uneven experience.  The animation of the fights, action, and special effects are all topnotch.  The service is well done, at least amongst the females, and they are cute and not too ridiculously proportioned.  However the men are awful.  I am on record as being a firm hater of bishies and effeminate men.  While the men in Needless are certainly manly, they basically look like bishies on steroids.  The fact that all of them looked pretty much the same (does anyone in the future wear shirts?) and the silly looking cartoonish muscles and impossible body builds took away from the art overall.\\n\\n\r\nThe absolute worst thing about this series is the music.  The first OP \"Modern Strange Cowboy\" is without a doubt the silliest song I have ever heard and the worst example of Engrish lyrics gone wild.  The second OP is not near as bad but still not that good and both the ED themes are average at best.  Also the commercial break teaser halfway through is laugh out loud silly with the retarded sounding \"Needless\" being overacted by various male cast members.  The acting overall is decent, but again the male voice actors over play their parts so much that they just sound silly.\\n\\n\r\nOverall my final opinion on Needless mixed.  I did enjoy many aspects of it, but it had more potential than it delivered.  The schizophrenic direction and pacing are too much for me to ignore.  Your enjoyment of Needless is likely to depend on your own personal tastes.  If you love shounen action then you might want to give this a chance.  I found it to be an average series at best.\\n",
            "date": "2009-12-19T15:11:00+00:00",
            "helpful_count": 151,
            "mal_id": 21526,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 2,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=21526"
        },
        {
            "content": "Needless is not for everyone, but it is a fantastic show as long as you watch it for what it is and are able to enjoy it for what it is. Still, while it was still airing I got the feeling that most people had misconceptions.\r\nFirst of all, Needless is not a shounen. Needless is a shounen-parody. Or actually if I stick to proper genres I would agree that it's a seinen, and the reason why it is \"full of shounen clichés\" is because it makes fun of those classic elements by overacting them till they reach grotesque levels. It's important to understand that thatis the basis of the show.\\n\\n\r\nMuscular machos? Naturally. Battles that last for eternity? Most of the anime is set in a single room. Fighters with named attacks or techniques? In Needless they not only shout them all the time, they also write them on the screen with huge flippin' letters to make sure you remember!\\n\\n\r\nI admit though that throughout the anime adaptation there are points when the show turns into the very thing it pokes fun of, but I'll get back to that later.\\n\\n\r\nThe second popular misconception is that Needless is a Tengen Toppa Gurren Lagann ripoff. Which would be hard considering that the Needless manga started years before TTGL. I won't stick my head into the sand and deny the similarities, I compare Needless to TTGL in this review on a few occasions myself, but while TTGL builds a strong coming of age story over the top of making fun of old school mecha anime, Needless stays in the sandbox where it feels safe but pushes its limits further there.\\n\\n\r\nAs you can kinda expect from this type of show, the story is almost non-existent. A mash of dozens of old concepts thrown into a bowl to create a frame for the action, humor and nonstop manliness. What comes as a result is somewhat interesting, but it's kept on minimal complexity so it doesn't get in the way of the \"important\" elements of the show. On the other hand, the author had some fun with the character's special attacks and you can find quite a few references there. Naturally I'm not talking about \"Mio-chan hip attack\", but things like \"Little Boy\", Dean Drive\" or \"Agnischwattas\". I won't call it deep but it's still a bit more layered than people would think.\\n\\n\r\nWhen it comes to characters, Needless has a huge list of archetypes, and this is also the point where TTGL fans start coughing blood. The \"main\" hero who likes to solve every situation with his fists (Blade/Kamina), the main heroine who's also a little ruff around the edges but makes up with bust size for lack of braincells (Eve/Yoko), a useless wingman for comic relief (Uchida/Kittan) and the timid kid who grows into a man (or not) (Cruz/Simon). The difference is that Needless really goes beyond the limits and centers the characters around their most basic trait, pushing that one aspect as far as possible. It also adds things like pedophile priests, bold old scientists and most importantly an army of lolis ranging from lesbians to androids. And yet, despite being this bottomless pool of one-dimensional fan service sources, there is not a single character in the show who is unlikable and every viewer can find one or two who they truly love. Even the one who was annoying in the anime gets cool later on in the manga. This palette of characters is what really makes or breaks Needless.\\n\\n\r\nThe graphics are hardly anything special: the character designs are a nice recreation of the manga, while the animation is mostly fluid but not really homogeneous. The music on the other hand is quite worthy of praise. I would be the last person you could call a metal-fan, but the hard hitting power metal BGM of the show is just amazing. Taken from e-Zuka's \"I got you under my skin\", from \"Raging Flames\" to \"Elephant's Scream\" every track is a perfect match to its respective scenes and gives them the necessary boost.\\n\\n\r\nI think that just proves that Madhouse was the right studio for this show. With that said however, it also entails the consequence that Madhouse fans are all too familiar with: abrupt original ending. This case is not nearly as bad as for instance with Claymore, but the changes at the end, along with the severely toned down gore (compared to the manga), resulted in the anime sometimes coming through as more of a shounen than a seinen.\\n\\n\r\nSo after all that, what makes this mixed bag of shallow elements so special in the end? The entertainment value. The indescribable energy that flows from every scene and gets multiplied by the music to the point that you clench your fist, jump out of your chair and yell \"F**K YEAH!\". The bursts of laughter you get every time said scene gets interrupted for a second with a crazy one-liner. The brainless fun you get from the painful lack of logic in the show. And I think that's the keyword, Needless is brainless fun. If you are looking for something more or different, Needless is probably not for you. But for what it is, Needless is perfect.",
            "date": "2010-08-29T06:34:00+00:00",
            "helpful_count": 137,
            "mal_id": 30067,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/87618.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kvakond",
                "username": "Kvakond"
            },
            "url": "https://myanimelist.net/reviews.php?id=30067"
        },
        {
            "content": "NEEDLESS to say....\r\nWhile Needless bears many similarities to a previous anime, Tengen Toppa Gurren Lagann, I feel that these comparisons are unfair and often lead to many people rating this series down. Comparing one's work of art with the Mona Lisa is an unfair one, after all.\r\nNeedless begins off on a very good note, full of high-octane energy and very manly characters. While it is admittedly similar to Gurren Lagann, it really stands in a class of its own. The story... what story? Fans of this series aren't really interested in the story, or at least in my point of view. Its a generic settingwith generic characters. A badass hero, a moe heroine, a kid, an old guy. The characters don't exactly set themselves apart either, with very unoriginal backgrounds.\\n\\n\r\nNow that the bad parts are out of the way, let's talk about the good. Where do I start? Needless is full of incredibly good stuff, with fantastic art (although there are some dips in quality here and there, but little enough to ignore). The music, is brilliant. While pretty much unnoticible in most parts of the show, it is when the action kicks off that the music really gets going. Heavy metal riffs with fast beats really serve to get your heart racing during the epic battle scenes. The visuals are good, with a suitable style for a show of its type. They really don't spare on the blood either, which is a good thing (for most people, I trust).\\n\\n\r\nUltimately, NEEDLESS is a series that really focuses on what its good at, and cuts away pretty much else. And what its good at, is providing ENJOYMENT. Yes, the slapstick humour, funny (though not very interesting) characters, the epic battle scenes and heavy metal guitar all combine together to provide an extremely enjoyable series. If you want to have a good time, and aren't really interested in heavy plots, emotional baggage, and complex character development, then NEEDLESS is for you!",
            "date": "2009-10-10T10:54:00+00:00",
            "helpful_count": 102,
            "mal_id": 19550,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/userimages/244728.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/bob1191",
                "username": "bob1191"
            },
            "url": "https://myanimelist.net/reviews.php?id=19550"
        },
        {
            "content": "NOTE: I have not read the manga, so manga readers can go to the manga page for this show and talk about it there. This review is for the anime only.\r\nAlthough I've only seen 3 episodes at this point, I think I've seen enough to write a fair review. I'll update it later of course to reflect the future scope of the story, because at this time it's still not completely clear what's really going on. Besides the fact that we know Simeon is evil, what the Needless are, and that they are after Adam Blade.\r\nSTORY: 7 (Good)\r\nThe story so far is typical of ashounen, with nothing really outstanding to set it apart from the rest. It's not overly simple though, so I believe it's worthy of being called \"Good\".\\n\\n\r\nThe evil organization, Simeon, is out to exterminate the Needless, which are a sort of \"super-human\" who possess varying abilities (usually one per Needless). One of the main characters, Adam Blade, possesses the strange ability to copy the powers of other Needless he comes in contact with (think Sharingan), and use them all at his leisure. Eve has the Doppleganger ability, and can take the form of others using either a picture, description, or by coming in contact with them. So far, we don't know much about Cruz (such as whether or not he may be a Needless but just doesn't know it yet), so for now, he plays the part of the currently-weak, developing character that might turn out to be more useful later on.\\n\\n\r\nThrow in a couple of thought-provoking elements such as the Black Spot and Adam Arclight, and the stage is set for (potentially) a moderately interesting shounen.\\n\\n\r\nART: 8 (Very Good)\\n\\n\r\nWhile the art isn't really top-notch, it's well done, and there's not much to complain about. Some found that in episode 2 the special attacks were rather bland, due to reused animation and the fact that each character took longer to \"call out\" their attack rather than to actually do it... But I found this little problem less obvious in episode 3. It seems like they cleaned up their act a bit. Episode 3 bumped up my judgement to \"Very Good\".\\n\\n\r\nSOUND: 10 (Outstanding)\\n\\n\r\nLet's face it, the OP rocks. I like the rock music played throughout other parts of the show as well. It's nice. I'm a bit WTF'd by the ED though, I actually find myself skipping past it every time due to it making my IQ take a temporary plunge, but I won't take points away for that... It's at the end anyway.\\n\\n\r\nCHARACTER: 7 (Good)\\n\\n\r\nIt's about what I'd expect from a show of its genre. Each character has room to grow, so it has potential. I liked Adam right off the bat, and Eve is definitely doing a good job of keeping the show fun. I'm not partial to Cruz at all but maybe that will change. As I said, they have room to grow, but by the same token, they're nothing special at the moment.\\n\\n\r\nENJOYMENT: 9 (Great)\\n\\n\r\nAt the end of the day, I enjoy watching this show. This is not the kind of show I have to force myself to get to watching, unlike some other shows I'm watching at the moment (*cough* Haruhi S2 Endless Eight *cough*). Seeing Adam kick some ass, I'll admit, is mindless, plain-old fun. And you're always curious as to what Eve will do that episode. Curiosity is a big part of what keeps me coming back for more.\\n\\n\r\nOVERALL: 7 (Good)\\n\\n\r\nThis show has room to grow, and for those of you who judged it after episode 2, at least give it one more. Episode 2 didn't sit well with me either particularly, but I found the third episode redeemed everything a little. And after all, who knows where it's really going yet?\\n\\n\r\nI'll keep watching it for sure. I vastly prefer shows that are more thought-provoking, have deep stories, and well developed characters, but to be honest, this show is just fun in it's own way. Sometimes it's good to throw away the rules and rock out to some over-the-top action.\\n\\n\r\nGo watch the OP. I bet that'll have some of you at least trying it out.",
            "date": "2009-07-21T15:32:00+00:00",
            "helpful_count": 43,
            "mal_id": 17013,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9135.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/brass2themax",
                "username": "brass2themax"
            },
            "url": "https://myanimelist.net/reviews.php?id=17013"
        },
        {
            "content": "I feel this show hasn't been getting the love it deserves and I think the only way to rectify this is with a semi thought out and heartfelt review so here I go\r\n(it's the first one I ever wrote so be gentle)\r\nStory\r\nOkay now get this\r\nit's about bad ass muscle-bound lolicon loving mutant Priest dude\r\nwho lives in Japan after several countries decided to bomb them for some reason and so everyone got super powers.\r\nHe fights an evil organisation filled with other muscle-bound mutant dudes \r\nand some hot 6 year olds girls who also have superpowers\r\nthis organisation also has a bunch of bad ass robots that huntpeople down.\\n\\n\r\nThis priest right lives with a hot 14 year old chick who doesn't wear underwear and the bad guy from Mega man, one day on a typical days jogging for the bad ass priest he come across this green haired pussy kid who's being chased by one of the bad ass robots I mentioned earlier,so for some reason he decides to help out the loser and kicks the bad ass robots ass, the kid realising that this priest is totally awesome (something green haired kid could never hope to be)\\n\r\ndecides to go live with the bad ass priest the hot 14 year old chick and the bad guy from mega man.\\n\\n\r\nThen uh a bunch of cool an funny stuff happens  \\n\\n\r\nArt\\n\r\nI can't really say much about this since I don't know too much about it.\\n\\n\r\nBut it has really bright outlandish colours that look lovely and capture your eyes.\\n\r\nIt has lovely character designs the characters look pretty distinct in their appearance so you can easily tell who is who though the rare few do look similar.\\n\\n\r\nThe settings and background art look very appealing, \\n\r\nand animation for the characters is fluid and well just great making many of \\n\r\nthe fight scenes look amazing.\\n\\n\r\nAnimated by the people who made Death note it's about that level I would say.\\n\\n\r\nSound\\n\\n\r\nThe soundtrack is filled with rock and roll type stuff which gets you pretty pumped up which is a must for this kinda show.\\n\\n\r\nThe opening number \\n\r\nSpace cowboy is probably of the coolest and I guess GARest openings your likely to hear.\\n\\n\r\nIt surprisingly features a couple of classical sounding pieces as well which seems a little weird  for the show but does not at all feel out of place.\\n\\n\r\nCharacters\\n\\n\r\nLets see you got\\n\\n\r\nBad ass awesome priest with lolicon fetish\\n\r\nBad ass awesome hot chick with big rack\\n\r\nGreen haired pussy kid (you can ignore him)\\n\r\nDr dude from Mega man\\n\r\nand group of other mostly bad ass characters \\n\r\nwho would take forever to mention,\\n\r\nmost of the characters are cool and awesome basically. \\n\\n\r\nEnjoyment\\n\\n\r\nIf I could give a million points for this I would\\n\r\nbefore warned though \\n\r\nonly awesome people who like awesome things will like this\\n\r\nSo watch it now\\n\r\nor else\\n\\n\r\nbtw\\n\\n\r\nshow = awesome\\n\\n\\n\\n",
            "date": "2009-10-30T10:45:00+00:00",
            "helpful_count": 26,
            "mal_id": 20112,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/209745.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/unellmay",
                "username": "unellmay"
            },
            "url": "https://myanimelist.net/reviews.php?id=20112"
        },
        {
            "content": "When I first watched Needless, I thought the first few seconds in \"Blah blah blah, story line, narrating, etc...\" But then out of nowhere, \"WE'RE MODERN STRANGE COWBOYS!\" The moment I heard this song, I knew I may just have found my new favorite anime. Which leads me to say this, the music and overall sound in this series is BEYOND AMAZING! Sound (10)\r\nAs for that \"Blah blah blah, story line, narrating, etc...\" it is pretty much the gist of the entire story. I suppose settings after World War III are pretty common and that the series is kind of like a mix of Scryedand Gurren Lagann, but I thought it had a little bit of Ikkitousen/DBZ/shonen-ish in general in the mix too. A bunch of fighting, ecchi, etc... I would definitely recommend those kind of series to anyone who may have liked this show as well. (Even if some of the mainstream shonen have extreme negative criticism from some audiences.) To summarize, even if Needless is doing what has already been done, It's doing it RIGHT. Story (10)\\n\\n\r\nHaving said that just now, I want my readers to know this. This series is NOT, I repeat, NOT the new Gurren Lagann. No, if anything, Gurren Lagann is the new NEEDLESS. The Needless manga started in 2004 and I know this is the anime page, but you have to understand that these concepts all first started here. Mostly, the art and character designs. (And characters in general.) We've got a pretty nice cast, a shota for all the fans of that out there, manly man for all the people who want their fill of \"WHO THE HELL DO YOU THINK I AM?!\" and the girl who is pretty much the ecchi fan service until all the other girls show up. All of the characters are pretty unique in my opinion and all have their moment to shine. They're a group to be remembered, not just some random set of people that are like filler characters from Bleach or Naruto. Art/Animation (10) Characters (10)\\n\\n\r\nHowever, the most important factor of this show, which I think really will determine whether or not you can go through with it entirely... Is the \"Enjoyment\" factor. I could say \"Hey, I watch this show, and I love it!\" But it's WAY more than that. I am over here, singing the OP each and every time I watch this, like some kind of weeaboo, raving with my friends at how awesome every single moment of this anime is. We'll be over here screaming \"I'VE MEMORIZED IT!\" \"LITTLE BOY!!!\" \"EVE CANNON!\" and it's just the most amazing experience I've ever had in my entire life. Seriously, if I had to say what my feelings were for Needless in a single sentence, it would be something like this.\\n\\n\r\n\"My Need for NEEDLESS is highest on my list of necessary necessities.\"\\n\\n\r\nI'm sad just at the thought that this series has to end. My overall rating of this series and enjoyment is a 10/10 and if you can watch this, pushing aside just the minor little similiarties and \"shonen-aspect\" that this show gives off, you'll be able to let loose and enjoy this as much as I do.\\n\\n\r\nBE SANITY!!! (Lol, Ayako, and their subbing errors. This was my first review by the way.)",
            "date": "2009-10-12T07:48:00+00:00",
            "helpful_count": 20,
            "mal_id": 19607,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/57671.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Panty",
                "username": "Panty"
            },
            "url": "https://myanimelist.net/reviews.php?id=19607"
        },
        {
            "content": "There are probably a ton of things that could be said about Needless, but in the spirit of this series we will just narrow it down to something simple. Needless! is a show you will either like for what it is, or hate it for the very same reasons.\r\nNeedless is a pretty simple show with an equally simple concept. Have a mix of characters with noticeable personalities brawl it out in a span of 24 episodes, accompanied by some great art, fanservice, GAR, gore, comedy and a fast phased metal soundtrack that won't fail to get your blood pumping. \r\nIn a future where Tokyo hasbeen bombed and 'black spots', areas in which people with mysterious abilities roam, exist there is an evil company surrounded with secrets that has settled in the center of the Black Spot and eliminates all opposition. However, a small group of people decide to stand up against this company. Now the plot is in place we are only missing the 'Fight' and 'Finish him!' lines and the person they belong to. Ah well.\\n\\n\r\nEnter Adam Blade, our very manly main lead. Accompanying him are his sexy sidekick Eve, a kid with no combat abilities, an old geezer, a cool Shinigami girl with a giant sword, a loli half human-half cyborg and a girl with a split personality. On the evil company side we have the usual ultimate evil in human form, Adam Arclight, a mysterious guy warped in bandages, a magician kid and an evil queen type woman with a huge rack. Crew set? Let's Brawl.\\n\\n\r\nQuiz time. The question is: \"What makes a show with such a simple concept so popular?\" Maybe it are the characters. After all, who expects a priest that turns out to be an insane 12 pack abs devil priest with a lolicon fetish that prefers storing grenades over holy texts in his bible and has some wisdom like this: \"If someone hits you on the left cheek...DO A PILE DRIVER WITH YOUR OTHER!!\" ? Or a sexy girl that can transform any part of her body and comes up with the most unique nicknames since she cannot remember people's real names? Or a crazy maid that takes the meaning of split personality to a brand new level?\\n\\n\r\nIt could as well be the art. It is good to great to stunning at times. Animation is smooth, characters look realistic enough. For Needless, that is. The creators probably also knew they did a nice job with the art, as they even included two moments in the series where the art is a..different kind of stunning. The soundtrack could be the secret behind the series' success as well. It always seems to come with the right tune at the right moment, something that makes the fights so much more epic and enjoyable to watch. If not that then it probably is the comedy. It is well done and fits the tone of the show, yet does not fail to give you a good laugh every now and then. \\n\\n\r\nNeedless is a show that may prove either enjoyable or not for the reasons above, but especially on the person watching it. Simple as that. If you are still not sure on what to expect, watch the first opening/ending or simply lock the door to your room, dig up your headphones and marathon the thing. Although the title may be misleading, this show could very well be something that makes a nice addition to your list.",
            "date": "2010-01-13T03:46:00+00:00",
            "helpful_count": 17,
            "mal_id": 22363,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/152508.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stigs",
                "username": "Stigs"
            },
            "url": "https://myanimelist.net/reviews.php?id=22363"
        },
        {
            "content": "NEEDLESS was one of the first anime I started watching as it was airing, when I first got into streaming new shows via fansubs.  The shininess of watching brand-new shows hours after airing in Japan still hadn't worn off for me, so that may have somewhat influenced my opinion of the show.  Regardless, NEEDLESS is a crazy, action-packed, explosion- and fanservice-filled ride through a post-apocalyptic wasteland straight out of Fist of the North Star or sCRYed.\r\nMy reviews have gotten a lot of 'Unhelpfuls', so I'm gonna try and stick with the usual format and see if that's more palatable.\r\nStory - 6/10\r\nUnfortunately, this isNEEDLESS' weakest point, since it's a comedy/action series, the jokes and the fights are really what keep the story running.  The overall plot is pretty much the exact same as the aforementioned sCRYed; an event that devestated part of Japan also gave the survivors mysterious powers, which the heroes use to fight against an evil megacorp trying to run things.  The battle between the two Adams is pretty awesome, but reminds me too much of Cable and Stryfe from the X-Men comics.  Very derivative story but not bad for what it is.\\n\\n\r\nArt - 8/10\\n\\n\r\nI know the art style turned a lot of people off, but I love the super-exaggerated look of the characters and the action sequences are superbly done.  The girls are all drawn primarily to be easy on the eyes, while the guys all have huge necks, pulsing muscles and multi-pack abs (except for poor little Cruz).  As a parody of over-the-top shonen anime, it's appropriate that the art style parody those same conventions.\\n\\n\r\nSound - 10/10\\n\\n\r\nEasily NEEDLESS' best stat.  I loved the music, from the BGM to both OPs and EDs.  I personally prefer \"Modern Strange Cowboy\" to \"Scarlet Bomb\" but they're both pretty killer as OPs, and the (in)famous Pretty Girl Squad takes over for the EDs.  The voice acting is very hammy and over-the-top; Adam Blade's seiyuu speaks maybe three lines in a normal voice, shouting all the others at the top of his lungs.  And the way he rasps \"Memorized!\" (omoeta) is fucking awesome.\\n\\n\r\nCharacters - 8/10\\n\\n\r\nWhile few if any of the characters in this series have any real depth, this was never intended to be a series about dialogue and character interaction.  All the characters have one or two traits that are turned up to maximum volume and blasted 24/7; for example, Adam Blade's overwhelming arrogance and lolita complex, Eve's inability to remember anyone's name, and so on.  Still, despite the lack of depth the characters manage to be quite charming, especially the over-the-top hero of the show (Cruz is technically the main character, but Blade's the one who does all the fighting).\\n\\n\r\nEnjoyment - 9/10\\n\\n\r\nThis show made me laugh, turned me on with the antics of the Pretty Girls Squad (especially when I first saw the ED, full of mostly-naked girls we hadn't even seen yet O_o), and got me pumped up for the crazy over-the-top fights.  Even slamming kanji into the camera's face to remind us of the names of the moves got a 'fawk yeah!' from me.  \\n\\n\r\nOverall - 9/10\\n\\n\r\nUsually story counts for more for me, and I wouldn't give such a high overall score to an anime that falls so short in the storyline category.  But as I said, the plot's not really what's important in this show.  I mean really, what's the overarching plot in Lucky*Star?  It's an insanely fun and crazy funny parody of shonen stereotypes and does it marvelously.  And interestingly enough, the parts that are parodied the most--the endless battles and in-your-face fanservice--are done about as well as I've seen in the 'serious' shows.  \\n\\n\r\nIf you don't like the pro-wrestling atmosphere of hugely muscled guys and hot chicks in skimpy clothes fighting one another (for often implausible reasons), then you might want to stick to more serious fare.  If you love shonen anime tho and like to laugh at the conventions of the genre, NEEDLESS is definitely worth giving a shot.",
            "date": "2011-05-14T06:38:00+00:00",
            "helpful_count": 16,
            "mal_id": 36975,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/480430.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Blind_Guardian",
                "username": "Blind_Guardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=36975"
        },
        {
            "content": "Final verdict and tl;dr for convenience: \r\nNeedless has no redeeming qualities when it comes to being as basic of a concept as a shonen duke-it-out. It's a poor and a mecha-less attempt of capitalizing on the hype for TTGL's \"post-apocalyptic rebels with an attitude\", and as such, it is rushed and bare-bones. I seriously recommend a critical re-watch if you somehow thought that anything above 6/10 is deserved, but I understand if you judge your anime by your personal watching experience.\r\n---\r\nThe visual style and premise seem alluring, until you start watching it. Needless is a very basic shonen duke-it-out with a very basic plotline and,harshly put, proof-of-concept charactes. \\n\r\nThe art? It looks fine and dandy... until they stop giving a sh*t. I don't mean like \"oh neat, this is a simplified black & white raster to intensify the feeling of speed and intensity\", I mean it like lazy and forgotten. There are unfinished sections within, and it's very blatant. For that alone, I cannot recommend this rushjob.\\n\\n\r\nNeedless' noticeable storytelling and character tropes include, but are not limited to:\\n\r\n-clothing damage\\n\r\n-constant peep-shotting, regardless of the previous\\n\r\n-power lobbing\\n\r\n-plot armor & strength (guy who is losing by all accounts suddenly just wins the fight)\\n\r\n-stretching jokes and story recapping to hit the episode time\\n\r\n-useless characters\\n\r\n-pure lack of context and ideas\\n\\n\r\nThe story is actually not basic, just bad. After the nuclear war, sections of the world have become barren wastelands. Yup, it's just SECTIONS of destroyed, plantless/lifeless landscape, not the actual whole world, with people scrounging for scraps and living a generally shitty life. There is nary an explanation for this. Then comes a medicine megacorporation gone bad with the intent of... well, if there was an intent, I'm sure it was hidden in the later episodes to justify one or two evil speeches. The big bad wants one of the characters for his plans and so lures the good guys into their home base after two destroyed goons.\\n\\n\r\nThe main character, the shota, has little to no relevance to the actual storyline. The supposedly actual main character (voiced by Takehito Koyasu, DIO for one) is a thunderhead whose main trait beyond plot armor and stronkest ability is his comedic relief trump card, that is, going full Sanji on >12 yr old girls. The other main and side characters are either useless and/or boast tropes as their only defining traits.\\n\\n\r\nOST, apart from op/ed, is some nice-sounding, yet pretty basic metal guitaring. You've heard all of it in your general fighting games before.\\n\\n",
            "date": "2019-01-22T10:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 299783,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5853156.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Jafarinparta",
                "username": "Jafarinparta"
            },
            "url": "https://myanimelist.net/reviews.php?id=299783"
        },
        {
            "content": "Ever since Kenshiro informed Zeed and his gang they were already dead, the badass traveling a post-apocalyptic wasteland (shirts optional) looking for ass to kick has been a staple of anime, to the point that nowadays it's almost always a parody.\r\nNeedless continues the trend of parodying the genre, by including something almost all anime seem to have nowadays, moe fanservice.\r\nSTORY: Overall the story is nothing special, it's the same thing we've seen before.  The action tends to be done fairly well, albeit usually fairly one sided.  The only thing that holds it back from being a 7 is the tendency to needlessly (punintended) take time to throw in fanservice.  I'm not referring to panty shots or jiggle, that's almost expected nowadays, I'm talking about taking a full 24 minute episode to slowly undress the \"Pretty Girl Squad\" with only the actual plot development in about 90 seconds at the end.  Hopefully they won't pull something like that again.\\n\\n\r\nART: The character designs themselves are good, they just seem out of place.  Adam Blade looks like he belongs, but most of the other characters have designs more fitting for Romantic Comedies like Asu No Yoichi. \\n\\n\r\nSOUND: Nothing to complain about here, the OP is very good, the ED while a bit out of place is rather catchy, and as I've said, Needless covers it's action fairly well, including BGM.  The voices all work, the only thing they need to work on is attack names, they seem a bit random, but that's more a script issue.\\n\\n\r\nCHARACTER: The characters are for the most part fairly good.  Adam Blade's lolicon tendencies are rather entertaining.  And as lolworthy as the existence of a \"Pretty Girl Squad\" is the members are rather likeable and the loli actually makes sense as a \"cute bruiser\" type rather than just fetish fuel.  The only pointless one is Cruz, who is so useless to anything no one even cares to remember his name.  \\n\\n\r\nENJOYMENT: The series grew on me after a couple episodes, it's definitely fun to watch, it just has a few facepalm moments here and there that detract from the series.\\n\\n\r\nOVERALL: Needless is worth watching.  If you aren't really a moe fetishist and are more a straight up action fan you should probably give it a few episodes to try to let the intial anachronism feeling wear off.  I'll probably end up giving the series a 7 or an 8 when I finish",
            "date": "2009-08-30T17:13:00+00:00",
            "helpful_count": 9,
            "mal_id": 18234,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75266.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JustRad",
                "username": "JustRad"
            },
            "url": "https://myanimelist.net/reviews.php?id=18234"
        },
        {
            "content": "I have to say that this is the worst anime that I have seen in a while and I'm surprised I made it through the whole thing. The only redeeming quality of this series is the main character Adam Blade who is just entertaining to watch.\r\nStory:\r\nCliche and predictable are how I would describe it. It tries to throw a few twists at you but I saw them coming far in advance. It tries very hard to be epic and over the top but lacks a well thought out story\r\nArt:\r\nAnimation was pretty clean, but the fact that characters cloths would regenerate and wounds would be healedbetween episodes, or sometimes scenes just so it could be done again was just too much.\\n\\n\r\nCharacters:\\n\r\nI hated every single one of the except Blade! Every single one of them was retarded except the kid who had normal intelligence but was treated like genius. \\n\\n\r\nEnjoyment:\\n\r\nwill never watch this series again and would only recommend it to people that i don't like.",
            "date": "2010-05-29T14:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 26570,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8584.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Caboose",
                "username": "Caboose"
            },
            "url": "https://myanimelist.net/reviews.php?id=26570"
        },
        {
            "content": "Alright, this is my first review, I hope this goes well.\r\nWhen I first saw this anime here, I thought that it would be just another shounen beat up anime, which I haven't really even watched, because I have always kinda shyed away from them. Well, I decided to give it a try and began watching this. The voice actors were for the most part pretty unknown ones to me, they haven't been in any other animes that I have seen, at least ,not in any positions from which I would remember them.\r\nIt soon became pretty clear, that the anime isn't your typical shounen beat upanime, because at least I have an image, that they usually have storylines that take themselves pretty seriously, and they don't really cultivate humor that much. This anime, however, seemed to be pretty humor based, and it wasn't trying to hide it's pure fan service either. As I watched the show, I noticed that I might actually like those shounen animes which I mentioned before, since I enjoyed all the fighting scenes and over the top charismas of the characters and muscles and everything that just screams \"fuck yeah, I am the real man\". That combined with the humor that I actually found to be pretty funny, it looked like this was going to be one really good anime to watch.\\n\\n\r\nI also liked the art of this anime, although there wasn't anything special on it, it was just fit for this anime, that's pretty much all I can say about it, not bad and not anything special. The music however, was so goddamn good. The music fits perfectly in the background of the battles. The music is just full of testosterone and it fits perfectly in the speedy and epic fighting scenes, making them even more enjoyable. I also liked the first OP of the show, for the same reason as I liked the background music of the show. The metal music just fits here perfectly and that's why I highly disliked the other OP. I Liked some of the characters, but, as it is with many other animes, the main character (or one of the main ones, I am not really sure), Cruz,  is pretty bland and boring character, but luckily the other characters make up for that. Adam is a bad ass character that I liked for the sole reason of him being an awesome ass kicker and really over the top confident character, which raises the testosterone count of this anime to the point that it's just so goddamn awesome that you can't hate it. The other characters also function well and they form a pretty good character roster, but Adam alone is one reason to watch this anime.\\n\\n\r\nAs I said in the beginning, this anime is pretty humor and fast action based anime, but the story is also pretty interesting. However, the anime doesn't really utilize it that well, and I personally think that it doesn't have to. I think it was the writer's plan to make this anime more action and humor based one, and not focus to the story that much. And I think that's fine, the reason why I enjoyed this anime is because of the fast paced action and all over the top fights, manliness and humor, not the story. Don't get me wrong though, the story is, at times, interesting, but it's wasn't the reason for me to watch this anime. That being said, in the end, the story of this anime gets much bigger role than in the beginning. This was expected: there were many things that were unexplained, so it was kind of a good thing, since those things are explained in the end, but at times, it kinda felt like a forced drama, not to the point of annoyance luckily, so it didn't really kill the feeling of this anime.\\n\\n\r\nThe fanservice also has a huge role in this anime. And in an anime like this, it doesn't really bother me, actually, I must say that some part of me might actually like it, I mean c'mon, who doesn't like pantsus? If this anime would be a serious one though, then it might kinda kill the feeling, but in this kinda anime, it's not a bad thing.\\n\\n\r\nTo summarize all this, I say that if you expect this to be an anime that has a deep and serious storyline, you probably won't like it, but if you just love all the action, over the top personalities, fighting and the humor, then you will enjoy this.",
            "date": "2012-07-15T12:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 66581,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/681289.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Samstaforcesama",
                "username": "Samstaforcesama"
            },
            "url": "https://myanimelist.net/reviews.php?id=66581"
        },
        {
            "content": "There are some animes that will end of being forgotten from people’s memory, and be marked as ‘generic’ anime. We call those anime, ‘Needless’.\r\nTo describe what needless is; it focuses on multiple theme of being manly, being comical, being serious, being eechi but also being ridiculous itself. It’s anime for ‘GAR’ I can say. Spammed action sequences take majority of this anime, and there are tons of plot holes even on those actions. It follows typical shonen style plot and full of clichés. There is nothing good about anime except the fact that you will actually enjoy it regardless to how horrible it is.\r\nActually, it’seven more generic than you can think. There is useless boy who is reluctant to become a main character. There is a hothead, but also useless support character, screaming ‘LIIIITTLEEEE BOOOOOOOOOI’. There is ‘wanna-be-Kamina’ Blade man who smells like GAR barbecue. There is evil one, who is evil. They killed them of one by one. They have 4 mighty ones, and one ultimate boss, Adam Arclight. It is so generic, that makes it way too much predictable.\\n\\n\r\nHonestly, there is no real plot there. It’s just fighting sequences that make this anime worth with screaming of characters all over the place. Over-the-top actions and series of panty shots. That’s all about it. Regardless, let’s talk about how story of Needless goes. First, there was Cruz. He met some hot-headed manly dudes and girls. They made a crew. There is an enemy to fight by default. They just fight. They went to boss lair. They fight again. Soon they meet boss. Fight. Done, it’s the end of the story.\\n\\n\r\nOne of the worst aspects of this series is pacing. Seriously, at first, it went fast; although it was ridiculous overall, pacing was not that bad. After that, they  got trapped in that gigantic room with pretty girl squads for about… I don’t know, about 6 ,7 episodes? That’s ridiculous. They could’ve at least provide some other background other than that. It screwed up some of enjoyment I had when they were just laughing and kicking around before they went there. Actions are dragged out so much, due to extremely detailed explanations and ANALyses on each move and some babbling, waiting, shoutings that character does. Plot holes are so big; you will have plenty of time wondering; ‘Why are they even waiting for 15 minutes in the middle of fight just to allow enemies to have a think time?’.\\n\\n\r\nHowever, the worst thing is probably that they failed to manage to keep the consistent and interesting plot itself. First 1/3 of the series was probably better in terms of fighting, or w/e. Later, it suddenly gets serious. Every aspect is basically ‘spammed’. It spams this serious and unserious mood about 10 times during one episode. Spammed slap stick comedies are timed so badly, most of time it ruins the mood horribly. There are so much spam of out-of-circumstance-bloods and nudities. Some plot twists are not actually a twist, since they were mostly predictable. It’s just spammed with absurdity. Funny thing is, ‘Side stories’ of needless were much better than its ‘Main story’. I enjoyed the entire support episode that those not contains the main stories. For example, flashback episode of Blade was better than Blade fighting with Arclight. \\n\\n\r\nArt, was terrible. No, it surely was. Starting with character design first; characters are overly muscular and females are overly… um ‘something’. Their body shape all looks exactly same, so does their faces. Design of Cruz is probably the worst here, look at his neck first of all. They all looks like some kind of mass produced clones with different hair style and costumes. Speaking of clothes, they are even worse. Oh hell, they are just ‘LAUGHABLY ABSURD’. Extremely wide collars, un-matching colours… Those costumes are also, almost same for every single characters. The worst, is costume of Disk-san. She wears pyjama from the start to the end and it is clothes that someone like your grandmothers would wear. Action part animations sometimes become choppy, such as the part where they are screaming their ridiculous attack names. Other than that, animation was overall just fine. \\n\\n\r\nSound aspect was as poor as its art. Some audio effects are completely out of circumstances and break apart the atmosphere. OP was fine but it showed how spamming English language in J-pop can be resulted being ridiculous for actual English users. Ending… I better not describ; it’s lolicon fetishes. Well, that makes sense, since two things I can remember in Needless is spam of ‘LIIIITTLEEEE BOOOOOOOOOI’ and kawaii shots. Seiyuus send their most time… screaming. They sound all monotonous; you can’t say the difference between the voice Blade and Arclight when they are speaking, since they speak with exactly same emotion every single time. Moreover, the problem in their speech existed from the start; the title of, ‘Needless’ itself. Those who do not know English people might think its fancy name for calling super heroes, but I personally think it’s ridiculous. Also, there are some extremely uncomfortable attack names that seized me in pain, such as ‘LIIIITTLEEEE BOOOOOOOOOI’, ‘Dean Drive Fox Hound’, ‘Magnetic Worldo’ and even ‘Doppelganger’. They are spammed throughout the whole series and may decay your ear at the end of the series. Seriously, ‘LIIIITTLEEEE BOOOOOOOOOI’ is just the worst thing I’ve ever heard. I cried for overuse of misused English…\\n\\n\r\nThere is not much to say about characters, since they are, generic. They have nothing except of being brave or following some same clichés that shonen suffers most of the time.\\n\\n\r\nBlade, despite of having some spam of irritating lolicon loving part, succeeded of being one of the coolest, and manliest one I’ve ever seen. Other than that, characters development and description is pretty much ‘dead’. They are empty, including Blade. They are just overridden by their cool abilities and failed to show what they have inside. Only one who actually showed that was Saten, but others; none existence. In terms of comical relief and some interesting plot, pretty girl squad and Eve was the only ones who were ‘interesting’.\\n\\n\r\nYes yes, I can ignore everything. However, I just couldn’t stand that Cruz guy. He is the worst character in this series. Everything is on his point of view, yet what he do get kicked and punched to death while everyone is fighting. The part where I died was when everyone is saying, ‘YOUR ONLY ABILITY IS THAT YOU CAN FUCKIN THINK’. Guys, everyone can think, even the most foolish person in this earth. They are all just common senses that Cruz has. Oh wait, maybe because that everyone in his crew is too dumb to even find out what ability of making things freeze and burn at the same time. (Temperature) And, in this part, we find one big plot hole. In his crew, there is a android who lived 300 with super computer brain, and there is also a doctor, who was one of the most professional scientist in the past. It makes absolutely no sense that Cruz becoming the only one who can ‘think’.\\n\\n\r\nEve is the only one character that makes this series at least a level of watchable. She is cool and very manly in terms of her spirit, which makes her only of the most ‘manlike female’ in the anime universe and also the best character of this series. \\n\\n\r\nNeedless is a terrible and good at the same time. Although it was spammed with ridiculous comedies, ‘LIIIITTLEEEE BOOOOOOOOOI’, bad art, monotonous voices, bad English, plastic muscularity and ‘Ability to THINK’, it was very very enjoyable, like most of shonen stuffs. Somehow, character success of at least not being dull. Actions are cool and so does their abilities. There are scenes that you can say, ‘hell this is just awesome’. Dragged episodes cut these enjoyments in half, but whatever. It is still enough.\\n\\n\r\nSo, in conclusion, Needless failed to become over the average anime in terms of its quality etc. every aspect. However, it was still enjoyable whatsoever. Needless will be forgotten, and I also do not particularly recommend watching this anime, but I can be sure that it was quite an experience having manliest characters and cutest females in one series with awesome superpowers.",
            "date": "2010-01-04T04:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 22026,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/225515.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ringoo4",
                "username": "ringoo4"
            },
            "url": "https://myanimelist.net/reviews.php?id=22026"
        },
        {
            "content": "Well, i hadn't had this much fun watching an anime for some time. It was first aired in Dec, 2009 but only found this particular anime about 2 weeks ago. Didn't watch it right away, but when i watched the first episode, i couldn't stop watching.\r\nVery few Anime's hook me like this one. It reminded me of Gurren Laggan for some reason. I'm not very versed in the Anime lingo, i cant tell you that this is a seinen or shounen or what not. I just watch them cuz i enjoy watching anime. Doesn't really matter to me what it's called do don't expect anythingon this review to have that much depth. All i am here to do is tell you what i think... and i think this is a great Anime to have. So lets go down to the scores...\\n\\n\r\nStory - 7: - Well i rated this a 7 because as I've said before theres nothing new here. Post apocalyptic world with people that have super powers and theres one nut that tries to rule the world and the heroes goes out and stop him. Altho if you go to the story, that really wasnt their goal, it just happened to end that way, which made for an amusing story.\\n\\n\r\nArt - 8: - I gave this an 8. To often do i see anime that is consistent throughout the series. There will be a few episodes that seems that the producers used a different animator. For this series, it didn't come often, and the ones that did, turned to to be a more stylized and a rush job. In anycase Gurren Laggan had the same thing.\\n\\n\r\nSound - 7: - Well nothing spectacular here just good. There were sounds, and background music but nothing that really popped out as good or bad. Opening and ending themes were standard and ordinary, even now as i'm writing this review i cant remember the Intro and Ending music. It isn't bad either, its just there and unremarkable. \\n\\n\r\nCharacters - 9: - Here is where it gets interesting. Without going into details and bordering on becoming a spoiler, the characters they had were interesting to say the least. Everything from am anti-hero hero, cute girls that constantly show their underwear, to multiple personalities and character types, including the \" cliché\" types that are abound in any anime genre.\\n\\n\r\nEnjoyment - 9: - I had a blast with this anime. Every episode was either entertaining, Amusing, to total laughter. It was enjoyable to say the least. It pokes fun at every anime you can imagine, and most of the time, it makes fun of itself. There are times where the characters are even aware that they are in an anime and make fun of each other. Lines like \"I cant believe that a minor character like you without powers is even in an anime like this..\" just takes the cake in making fun out of everything. And when it seems that it couldn't get any better, they snuck in a love story without you noticing it. Man, that caught me off guard. In anycase Total Enjoyment start to end.\\n\\n\r\nOverall - 8: - I have the overall score an 8. It could have been higher but i'm just going on the average. Story and sound gout it down to an 8 instead of a 9. But don't let that 8 fool you, if you enjoy a good laugh or just tired of serious anime, and just want senseless fun, this is the anime for you. I highly recommend you watch this. As always, if your not sure, Download the first episode and watch it, It it doesn't tickle your fancy than don't continue, for me at least, the first episode was enough for me to say Hell yeah..",
            "date": "2011-05-02T09:23:00+00:00",
            "helpful_count": 6,
            "mal_id": 36678,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442509.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jekmyster",
                "username": "Jekmyster"
            },
            "url": "https://myanimelist.net/reviews.php?id=36678"
        },
        {
            "content": "Needless\r\nThis anime is about the aftermath of a World War 3. A bomb was dropped on Tokyo city and as a result, some people gained strange powers like controlling fire or water or having great speed or strength and stuff like that (much similar to that in Sekirei). These people were given the name Needless (which is also the anime's title if you hadn't noticed). This anime is a perfect combination of action and comedy together with time to time ecchi.\r\nThe story in this anime is quite good. It's basically about a group of Needless fighting another group which is oppressing them. The story hasprogressed quite well. From start to end everything is in perfect order. They gave a pretty decent introduction as to what is happening and also gave a satisfying ending to the story which sort of ends the possibility that the anime will get a second season and continue with the manga. Anyway, it really won't matter that much when you finish the anime.\\n\\n\r\nVoice acting done was pretty decent. It wasn't like they were doing it on gunpoint or anything. It was pretty good. The artwork was also well done. It was well done and matched the sheer violence this anime had to offer. The way the action scenes were shown was also quite good.\\n\\n\r\nAll the characters in Needless had perfect roles in the anime's story. All introduced characters had perfect and important roles in the story. Along with a role in the story, all characters had something funny happen to them which was very well done and these scenes decreased the overall seriousness which most animes of the action genre have. This anime is one of the best animes I have seen yet. I enjoyed every part of it. It's just full of comedy. Whenever a scene got too serious or emotional, something funny was thrown in to lighten up things. Even the finale, which is supposed to be a very serious and/or emotional episode, also had comical scenes around every corner. A scene did not go too long without some comical scene in it.\\n\\n\r\nNeedless is a great anime. The violence might be too bloody but the excess comedy more than makes up for that. The way bloody violence and comedy have been mixed in this anime has made it quite different from the rest where most action animes are often serious. This great combination of action and comedy is what makes this anime awesome.\\n\\n\r\nI am open to suggestions. Feel free :-)",
            "date": "2013-09-10T06:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 112495,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2650363.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Yamada2",
                "username": "Yamada2"
            },
            "url": "https://myanimelist.net/reviews.php?id=112495"
        },
        {
            "content": "May contain minor spoilers, will leave out story spoilers.\r\nI'd like to sum this up at the beginning, but don't want to give it away just incase you haven't seen it.\r\nThe story was actually the best part, in a sense.  Needless is about people who have supernatural powers called fragments that allow them to do wild shit.  The first 7 episodes of this are amazingly badass, it really sucks you in and the story just takes off quick and runs full steam ahead.  I can't really elaborate on the story without giving too much away, but a group of Needless go take onsome badasses early and it starts off chalk full of potential.  the rest will be below.\\n\\n\r\nArt was very good for its age, the sound was a little too 80's - 90's rage metal for me, but it wasn't totally out of place.  The voice acting was actually fitting as well.\\n\\n\r\nThis show has a bit of a weird feel, on one hand it doesn't take itself too seriously, constantly breaking the fourth wall, but on the other gets a little deep for an action fighting anime.  The comedy keeps it afloat early and had me rolling at times.\\n\\n\r\nThe characters start off strong, but then becomes are major weakness about half way through.\\n\\n\r\n**minor spoils**\\n\\n\\n\r\nThe progression is just too ridiculous.  It starts off so strong you start wondering where this is going and then after 9 or so episodes it just stagnates.  The characters are caricatures of caricatures.  it's got the classic samurai 7 feel to it, gathering the team, all with strong and weak points.  But ultimately the supporting cast were completley irrelevant.  They may have well just left them out since they really just got their asses kicked at every opportunity.\\n\\n\r\nwhen i said the story stagnates at around the midpoint, it's not hyperbole.  MC and crew get trapped in a room for like 9 episodes getting their asses kicked by weak characters and progressively fight stronger characters and the formula repeats until you're sick of it.  The character progression is almost non existent for anyone.  It focuses heavily on the antagonists, which is something i don't really like, and no matter how villainous the antagonists, it becomes obvious there will be no serious resolution.  At least they could have held that card closer to the end to dampen the dissapointment.\\n\\n\r\nat the end its the antagonists giving the motivational speeches and teaming up, which literally makes no sense.  the motivations of the antagonists are so flimsy that you cannot possibly reconcile it meaningfully.  You would think throughout the numerous heinous acts committed they may have questioned their role, but ofc they save that shit until the end, which just left a bitter taste.\\n\\n\r\nThe ending turned into pure DBZ, with so many twists that i subconsciously reached for imaginary nausea pills.\\n\\n\r\nTo sum this up, it starts off really strong, with interesting plot, characters, and potential and ends with a trainwreck.\\n\\n\r\nThe actual main character is a weak boy who plays literally no role, in fact i still have no idea what his role was throughout the entire show but he garnered so much screen time I felt his value would be revealed by the end.  It wasn't.  He served no purpose other than to recap episodes.  If you can shut your brain off and watch it for the moments of parody, there is certainly something here.  But the tone is so confused that you can't call this a comedy or parody, you just have to call it a clusterfuck.  \\n\\n",
            "date": "2015-02-09T08:16:00+00:00",
            "helpful_count": 6,
            "mal_id": 180020,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/149637.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Marthgun",
                "username": "Marthgun"
            },
            "url": "https://myanimelist.net/reviews.php?id=180020"
        },
        {
            "content": "if you like x men then you will like needless. needles are mutant humans with powers.\r\nthe story. \r\nis great its about this guy named Adam blade and he has to fight the dug company know as Simeon. the story is 10 out of10\r\nthe art.\r\nthe art is bright and colorful and great for a 2009 anime . 10 out of10\r\nsound.\r\nsound was very good and it has a very good dub. sound 10 out of 10\r\nthe characters are very good and funny \r\nand Adam arc light is a very great bad guy \r\n   and one of my most fave characters and funniest is eve .character 10 out of10\\n\r\nenjoyment .\\n\r\ni 100% enjoyed this anime  it is funny and has a lot of action. its worth the watch.\\n\r\noverall.\\n\r\ni give this anime 10 out of10 its a great anime",
            "date": "2012-04-11T16:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 58567,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1073845.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/gunslinger90",
                "username": "gunslinger90"
            },
            "url": "https://myanimelist.net/reviews.php?id=58567"
        },
        {
            "content": "First off to compare this anime to gurren lagan is absurd...Ok i can see the similarities in the characters of Kamina and Father but other than that, nothing alike.  There is no real storyline, and the little that is there is not amazing..It was interesting enough for me to watch the whole series.  I love anime with action and this is action packed, with cool abilities for each character.  I do enjoy that but to compare it to Gurren Lagan..give me a break, that was still to this day one of the best anime I have seen, and although I enjoyed needlessto a certain extent it is still my lowest rated anime on my list.  I know I have not seen a whole lot of anime, but enough to get on this site make a profile and continue to be addicted to anime and watch it everyday, and will continue to watch anime for the rest of my life.  Now don't let this deter you from watching this anime.  It is enjoyable because of all the action and cool different powers.  It does have a whole bunch of characters so that is a plus as well, but you don't grow attached to any like you do in Gurren.  Shit I cried during that anime.  You are not shedding tears for needless that is for sure...and the ending for needless...meh",
            "date": "2009-12-12T22:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 21329,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243376.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/firebender",
                "username": "firebender"
            },
            "url": "https://myanimelist.net/reviews.php?id=21329"
        },
        {
            "content": "Hm, it's an anime.\r\n compilation of Fight Game from playstation, Comedy, and Tragedy.\r\nIt's not so good compliation, it seems they could not decide if they make something serious or comedy.\r\nThe fight were OK, but why they say the name of the attact? (that's why I wrote about computer game).\r\nDo real people say things like: \"super punch!\", \"boy kick!\", when fighting?\r\nNot so much.",
            "date": "2010-04-22T12:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 25320,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/harrypotter",
                "username": "harrypotter"
            },
            "url": "https://myanimelist.net/reviews.php?id=25320"
        },
        {
            "content": "This anime is a combination of both action and comedy together including the cuteness of girls. To me, I am fine with moe. I only enjoy this anime is because of the characters and the funny plot combined with great action scene. I don't come and watch this anime just because of panty shots.\r\nEpisode 14 is the most funny part when Adam Blade says \"The reason is Girls. You look like a young girl and I'm already in paradise\".\r\nTo me, all the characters are badass and I like most of the characters except for Curz Schild. At least Cruz Schild instructed people in the lastepisode which was good. All the cast do not show me things that I don't like (crybaby, whiny, arrogant)\\n\\n\r\nMy 2 favorite characters are: Seto & Solva. They are badass females. You know I really love to see badass females even badass lolicons. Seto uses gravity power while Solva uses Magnetic World. Solva's powers reminds me of Magneto who uses magnetic powers. Wow an epic combination of x-men with cute girls.\\n\\n\r\nThe art and animation looks fun just like Soul Eater. I really wanted to see action combined with humour otherwise it will not be fun to watch at all. I also wanted to see action at least my some badass female save the day like Revy from Black Lagoon. Adam Blade is a very cool guy who is badass.\\n\\n\r\nEvery character is unique in a lot of ways which makes this anime even more fun to watch.\\n\\n\r\nI will recommend people this anime who are into fun and action scene with some panty shots. I give it a 9 out of 10. NEEDLESS  to say, I really love this anime! JUDGEMENT EXECUTION! HAHA! Just Joking!",
            "date": "2013-07-03T19:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 103683,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=103683"
        }
    ],
    [
        {
            "content": "I don't know about you, but I love this series more than I loved tengen toppa gurren lagann. I really didn't like the whole Chibi Mecha theme in Gurren Lagann. Anywho, this anime is EPIC in terms of story, characters and ACTION. I think this anime has it all: fan-service, epic fight, supernatural abilities, and ... blood and gore. If you were a fan of Gurren Lagann or even a fan of action genre-based animes, please do consider watching this series. I highly recommend it.",
            "date": "2009-11-10T13:24:00+00:00",
            "helpful_count": 4,
            "mal_id": 20444,
            "reviewer": {
                "episodes_seen": 19,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75487.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Takomancer",
                "username": "Takomancer"
            },
            "url": "https://myanimelist.net/reviews.php?id=20444"
        },
        {
            "content": "hellooooooooooooooooo\r\nthis is my review for needless!!!!!!!\r\nneedless was for my opinion one of the best animes because it has some echhi and it has some action.\r\ni liked the fact that blade cant resist cute girls hahahaha!\r\ni hope there is a second season but i dont thinks so.\r\nsome girls in the anime were pretty cute so that was a plus for me XD\r\nthe attacks were also pretty cool and the story ofcourse.\r\nmy fav charachter in the anime was blade i liked his power and his stupidness.\r\nit was the first anime i ever watched and it was pretty cool.",
            "date": "2011-06-16T05:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 37932,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/475265.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Swenpai",
                "username": "Swenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=37932"
        },
        {
            "content": "this looks like tenga toppa gurren langanfrom art  but mixed special attacks every half minute, 2sec of emotions,there is an old guy that looks like from nintendo as a scientist,  a stupid baka yelling hoe that screams arround, is annoying and a wanna be half naked god loving priest senpai guy that never dies.\r\nA kid that lost his sister and acts like he is sad for 10secs, but then completly forgets that 399 of his friends died in a sec.\r\nBasicly the story quality is on a hentai level but without the hentai part\r\ni wonder how you can enjoy that stuff, but maybee ifyou have adhs + hyperactivity and you are like 11 years old, you could find it \"cool\" instead of good.\\n\\n\\n\r\ntldr: complete bullshit\\n\\n",
            "date": "2016-07-30T19:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 225466,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PUR3ICE",
                "username": "PUR3ICE"
            },
            "url": "https://myanimelist.net/reviews.php?id=225466"
        },
        {
            "content": "Needless is a a fun ride, nothing to spectacular and a little bumpy when it comes to the pacing of the story, but its jam packed with action and humour that at most times over shines the low quality animation when there is to much going on, and the other mainstream anime issues like cliches,mediocre dubbing and the clothes that get almost completely destroyed at the slightest touch, that defy psychics and always end up covering the nipples.lol\r\nStory wise needless is mediocre at best, the whole story goes by to slowly at the beginning and they jam in all of it in the last quarterof the anime.Needless knows what it is and at times tells you by breaking the fourth wall, this was honestly one of my favourite parts of the anime but after a couple episodes in they stop completely.The plot is one of the oldest in the the book, when i mean that I'm saying, an evil corporation lead buy an extremely powerful super villain, that everyone needs to band together to stop.THE POWER OF FRIENDSHIP!!.\\n\r\nYou might say thats a little in spoiler territory but all of that is shown to you in the first episode.Needless holds itself together by making you laugh every episode.\\n\\n\r\nSound is adrenaline pumping awesomeness, the opening and during the action scenes keep you on your toes bringing in the mad guitar solo's that totally fit into the vibe the show emits especially with the main characters personality.Although the closing music is totally the opposite and left me with a \"holy fuck....whats this shit\" being that the music is that stereotypical slice of life crap.\\n\\n\r\nCharacters in needless are all stupid except for the powerless old and young people and even with their smarts they only have a measly intelligence of a 10 year old. Most of the characters have a unique feel to them especially the main  who is awesome and literally steals  the spotlight, they are a few cliches but not as overwhelming as some animes.character development is almost none existent  except for a special few.all characters have their funny moments that will leave you laughing.\\n\\n\r\nLike i said the animation is okay except for the overwhelming scenes where they have to turn the characters into little scribbles, just to show you that the person has so much power the he somewhat turned the animation into something i might have drawn when i was in kindergarten, i might be over doing it but you get what i mean.the background in needless is rather boring being the colours generally stay with light blue,grey,brown and the reds and oranges for the many explosions that occur.\\n\\n\r\nNeedless is nothing unique but i highly recommend it because its fun and never gets boring \\n\r\nAnd you're bound to get a couple laughs from it.\\n\\n\\n\\n\\n",
            "date": "2014-08-16T23:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 156851,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3868285.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Unturnedpage",
                "username": "Unturnedpage"
            },
            "url": "https://myanimelist.net/reviews.php?id=156851"
        },
        {
            "content": "Needless is, as the name implies, needless. Needlessly violent, needlessly stupid, and needlessly likeable for some reason. It’s replete with action, comedy, and enough fan service to make Kokonoe Rin blush, but it comes across as almost a parody half of the time instead of something really trying. At least, toward the beginning. The end tries to take a more serious route and while it does succeed, it succeeds in giving us a cliche story that could have been left out and still maintain the integrity of the show. If there were no back story it could have been a parody or a comedy butwith that background it seems like it’s actually trying to be something real.\\n\\n\r\nIt’s hard to classify Needless as anything because of this. It’s shounen, but is it a comedy or an action story? While it can be both, it changes tone so fast you don’t know what hit you.\\n\\n\r\nStory\\n\r\nThere is a story to this series, which I found strange at first because the series starts with what appears to be a very basic plot of an evil corporation full of super-powerful people fighting a resistance of super powerful people. But later on we get a background plot of science experiments and creating god and all kinds of really  biblical stuff that is trying to make the show sound smarter than it really is. And the problem with the story in the series is it follows the same basic plot as Trigun and Trinity Blood. Spoiler The good guy and bad guy are experiments, pretty much brothers. And they are both called Adam to go with Eve. Which is a lot like Cain and Abel from Trinity Blood.\\n\\n\r\nWhile I can accept the biblical parts, it just seems needless (Ba-ba-ching). There’s also a thin plot about the main character, Cruz’s sister but none of it is really that great. The story is weak and there seems to be a bit too much of it toward the end when we’ve been exposed to fight scene after fight scene mixed with comedy, breaking the flow of things.\\n\\n\r\nIn other words, don’t come to Needless expecting quality story-telling.If it were to boil down to anything, Needless is the story of a bunch of people with powers in a post-apocalyptic world where they fight each other formulaicly for twenty-four episodes.\\n\\n\r\nAnimation\\n\r\nI had no problem with the animation. Characters looked a lot like those from Gurren Lagann which was a bit of a problem at first (Cruz=Simon)(Eve=Yoko)(Blade=Kamina). But it doesn’t matter, the animation is perfectly fine, though it isn’t amazing. It’s average.\\n\\n\r\nSound\\n\r\nI decided to watch the dubbed version and wasn’t surprised that there were quite a few voice actors who were god awful, including Cruz’s sister who had to have been played by a robot. I guess the main characters did competently but…you know. I don’t expect much from my dubs.\\n\\n\r\nThe first opening and ending song for the show is good, but the second opening and ending isn’t. Within the show, the heavy metal soundtrack is pretty good.\\n\\n\r\nCharacters\\n\r\nBelieve it or not, the characters in this show are average! There are a lot of characters but very few actually stand out. Blade is a lolicon priest who is probably the funniest character in the show, Cruz is an emo kid, Eve is a ditzy girl with big boobs. There’s a scientist who states the obvious or reiterates what somebody has just said.There are the girls of the Beautiful Girl Squadron, all of whom have no substance, though I like the seemingly mute lesbian one, Kuchinashi. The bad guy, Adam Arclight, is generic.\\n\\n\r\nSo, not much to talk about in this department.\\n\\n\r\nOverall\\n\r\nAn anime that prides itself on violence, panty shots, and comedy? It has to be good right? Fight scenes are too damn long, and when you have a twenty-four episode anime, you don’t want to stretch out ten episodes as one fight scene in the same room. Seriously, from episode nine to nineteen or so the show takes place in a single room. It gets rather boring and so does the anime. It starts fast-paced and promising but ends rather dully. I heard that the fight scenes in this show were some of the best in anime and I would like to tell the person who said that to suck it because the fight scenes in this show were lame and basic. I was not impressed by this show at all, but it was a decent distraction. It had some good moments, a lot in fact, but it was just so trite and basic and as it continued it tried to inject story but failed.",
            "date": "2015-05-22T11:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 188539,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188539"
        },
        {
            "content": "Review 30: Needless (is all this fanservice needless too)?\r\nThe world wide amazing action and fanservice packed anime adventure, but is all of this fanservice actually needed??\r\nThe world of needless is seriously weird; it's strange in ever way possible all of the way through this anime. In this stranger version of Japan there are weird stand out features that a lot of viewers cannot comprehend.\r\nBasically world three started quite a while ago, as weapons where passed around and altered and then finally fired at Japan it created what many people including the authorities and goverment call the black spot. And it is what it's called, theskies black and it is a abandoned wasted land with nothing living, nothing inhabiting the area and nothing will ever change the black spot or change it any way.\\n\\n\r\nWhen the bomb hit and created the black spot, anyone who was in the area or near the bomb site then the would of been turned into what everone calls a needless or they would of been killed by the blast. Eventually people tried to inhabit the surronding areas and attempted to live within the black spot. Until a company named Simeon built a ginormous building in the centre of the black spot with seriously high security and governers from all over the world coming to visit so they could finally learn and find out what a Needless is and why they exsist. When rumours got out about everyone in the Simeon Company being a Needless there where riots and resistance groups that joined forces to go head on with Simeon..... All of which have ultimately failed at taking down the company.\\n\\n\r\nThis is when we start to meet our main characters, Cruz is the first. This series starts off with the Resistance attempting to ambush Simeon, which fails, and two members trying to flee the battle ground to find somewhere else to stay until the fights die down. Unfortunetly though there is only one main character found from this particular scene. unfortunetly Cruz's older sister Nee-San is destroyed by a Testament robot (From Simeon). Cruz than has to find his way around the sewers in an attempt to get away from this robot before it appears again and takes his life too. Once he's in the sewers he manages to find the time to break down and cry over the lose of his dead sister, which then leads to the Testament breaking the concrete floor to get to Cruz in an attempt to take his life away too. Until a mysterious man wearing a choker and no shirt appears and takes down the Testament in front of Cruz.\\n\\n\r\nThis ladies and gentlemen is our next main character, he never goes by his normal name so everyone just calls him Blade. His real name is Adam and everyone knows him as the memorization Needless, he won't use his power a lot but will use it if he's in danger or someone else his, he doesn't abuse his powers and he hates Simeon. Others we meet later on in some other episodes; like eve and Blades scientist.\\n\\n\r\nCruz; As he has no powers at all he struggles quite a lot when it comes to survivng without his sister in this newly found world.He is a slightly awkward character, whenever someone upsets him he runs the other way to get away for a while.....It never works. He's a small character in the series as he has no powers or any special skills that he can use against Simeon; but he plays the most important role as our lead character who tries to come to terms with the newly found Simeon ruled Japan. He doesn't really like working for his new found friends but it's the only thing he can do as his sister and everyone else he ever knew was murdered in a matter of seconds; due to this he has to slave around for the new found friends until Cruz can stand on his own two feet..... Which will be never in this series as you can not magically earn powers like the ones that the Needless have. For starts the fanservice in this brings out the slightly funnier side of Cruz; he's the stereotypical main boy in the series as his nose bleeds a considerable amount when a naked girl appears and he seems to turn Chibi for some reason. But all in all he is a good lead character, he may be lacking some characteristics which we would rather see than a weak boy; but i think doing this makes a bit of a change for the series and the story line within it. \\n\\n\r\n Blade; As he has all of the power anyone can ask for he is the perfect character to be holding the spot light whenever Cruz hasn't run off or started crying for some unknown reason. But he hasn't got all of the powers in the world actually; his Needless power is the power of manipulation. In other words when he sees his opponent using a strong move than his brain automatically copies the move and uses it against them as he's more powerfull than most of the people we see him fight. Which means that over this series of anime we see Blade using tons of elements to fight with against others and completely random moves like the godly string one that we see in some of the earlier episodes of Needless. Eventually there are tons of other weirdly wonderfull whacky moves we see him posess but non of them apart from the fire element ones actually stood out to me; there is one thing that stands out though, it may only be small but it can indicate to the audience when the fight gets serious. We see a quick glimpse of Blades brain surronded by multi-coloured waves of energy, afterwards it usually says manipulation complete or something along those lines, But this only happens when he's being seriously serious in a fight. \\n\\n\r\n The anime is seriously good but i think the character designs and the story have to be the best thing out of the series. The fight scenes are usually short and not to violent; if they are long it's usually filled in by a lot of talking to the opponent. The graphics are ok i guess usually on high quality 3D moments; e.g. a car moving or a quick flash forward for the audience to show use where the next bad guy is. Even though i've done the review i think i'll still keep on watching the anime as i actually love the charcaters and their fighting styles.\\n\\n\r\nSaturday 27th April, 2013.       11:44 Pm     ~AmyXxx\\n\\n",
            "date": "2013-06-09T03:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 100403,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2684043.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AmyWatkinson",
                "username": "AmyWatkinson"
            },
            "url": "https://myanimelist.net/reviews.php?id=100403"
        },
        {
            "content": "Well allready i find this show the best comedy show besides school rumble!\r\nhaven't laugh this hard since then! xD\r\nstill i'm at episode 7 but i don't care.\r\nwanted to let YOU ALL know that this is a must watch show!",
            "date": "2012-05-07T01:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 60723,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/348856.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Snake-Eyes2012",
                "username": "Snake-Eyes2012"
            },
            "url": "https://myanimelist.net/reviews.php?id=60723"
        },
        {
            "content": "Needless had me right at the opening.They explain they setting and get right to the story without leaving lost or wondering whats going on.Its a bad bad habit but I usually never watch more than 10 seconds of the opening song of any anime. \r\nNOT NEEDLESS! The opening song Modern strange Cowboy wooo! Watched it every single episode LOL.\r\nThe story line is actually solid. It is not the typical \"Oh there's (insert generic bad guys here) lets go punch him lots!\" type. Yes, there is a bad guy but there are several layers in the plot that explain why he is this way, what heis fighting for, and how all the characters are connected. \\n\\n\r\nAll around very good plot, nice balance of humor and story content.\\n\\n\r\nOnly dislike... Cruz... Cant say anymore without spoilers.",
            "date": "2011-02-16T19:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 34530,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Verve",
                "username": "Verve"
            },
            "url": "https://myanimelist.net/reviews.php?id=34530"
        },
        {
            "content": "Do you like priests? Do you like repetitiveness? Do you like panty shots all the time? If yes then this is the anime for you!!!\r\nI am not going to tell you the plot since I am sure many other review probably already told you it. I am here to tell you what I think!\r\nYou may be asking, why is it repetitive? The jokes that is how. Some of the jokes lag through from beginning to the end. But other than those there are some really nice ones that keep things interesting. There is also a plot so there is an actual ending to the anime.The way they tie things together and really do not leave any whole left to fill was really nice to see. I did however get bored at the end was happy for it to end. But it still goes on the all time for it's creativeness and the panty shots and stuff because, well I am a guy so it has more effect on me. I would recommend this to any that read this but not to my parents, they would probably judge me on my choice of anime.",
            "date": "2011-03-24T20:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 35322,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/434514.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LoneAngel",
                "username": "LoneAngel"
            },
            "url": "https://myanimelist.net/reviews.php?id=35322"
        },
        {
            "content": "Sometimes, you just need to turn your brain off and simply enjoy something that wants to be fun.\r\nNeedless, is that very thing.\r\nTo appreciate Needless you need to understand that it is not trying to be overly complex or showcasing moral high grounds or anything like that.\r\nNeedless is, at is core, a show that simply wants to entertain. It gives you character banter, plenty of cool over the top fights and striking visuals. Really, the visuals are amazing in this show, despite using mainly basic, flat colors. \r\nIt doesn't try to be clever with its writing, it's very self-aware of what it wants to be andit does it with a god damn big flare.\\n\\n\r\nIf you ever just want a show simple in its story and giving you tons of fights with a ton of different super powers, this show is just the thing. And it's pretty damn hard to find something like it out there, trust me I've looked.\\n\\n\r\nOur main character, Adam Blade, is a supposed priest with a terrible attitude and personality. He pretty much hounds and bosses his friends, is an open lolicon and is greedy to boot. But despite all his character flaws he is the closest to a good guy we're gonna get in this show, which already sets the mood of what to expect.\\n\r\nLuckily his \"friends\" somehow endures his terrible personality and make sure he stays in line, most of the time. Really, we don't get to see main characters so borderline villainous as Blade here in animes.\\n\\n\r\nSo if you wanna watch some people bash robots apart with their bare hands or bash each other with fire coated fists or supersonic speed, get going and watch Needless already!",
            "date": "2017-07-01T17:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 251696,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6358697.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tramilton",
                "username": "Tramilton"
            },
            "url": "https://myanimelist.net/reviews.php?id=251696"
        },
        {
            "content": "I actually made it more than halfway through this, but I left it and came back the next day. When I tried watching again, I found I had had all the stupid I could handle.  It's basically comedy by making all the usual shounen comic stuff even more extreme.",
            "date": "2011-11-07T08:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 47023,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/userimages/639163.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/colonelpanic",
                "username": "colonelpanic"
            },
            "url": "https://myanimelist.net/reviews.php?id=47023"
        },
        {
            "content": "Needless without a shadow of a doubt has great potential: you have your action, ecchi, interesting storyline and typical anime comedy. However, I can't give it more than a 7, because it is all mashed together. Not a single genre is taken to its fullest, but simply left at the basic level. It leaves a lot to be desired and I'm under the impression that the original story, characters and action were supposed to be awesome and would have been, but there just wasn't time to develop any of it in mere 24 episodes. Also, there are a few ''aw, come on!'' moments.",
            "date": "2012-01-02T03:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 50721,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1069683.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kurupan",
                "username": "Kurupan"
            },
            "url": "https://myanimelist.net/reviews.php?id=50721"
        },
        {
            "content": "Unlike some stupid shounens i like this one.Adam Blade is best kick-ass character i've ever seen in any anime.I didn't like this brat Cruz,because he's a whiny bitch.But overall i enjoyed this anime's comedy the most.",
            "date": "2010-08-25T16:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 29960,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93870.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/luttt",
                "username": "luttt"
            },
            "url": "https://myanimelist.net/reviews.php?id=29960"
        }
    ]
]