[
    [
        {
            "content": "A cool thing about the internet is that it has allowed everyone to become a content creator. While access to mass media and print publication was once closed off to all but society’s most privileged, we now live in an age where anyone with an Internet connection has access to an audience of literally millions. This seems like a weird way to open a review for a show that was broadcast on four different Japanese TV channels, licensed by Sentai Filmworks for a North American Blu-Ray release, based on an ongoing series of light novels with 8 volumes in print as of this writing aswell as a manga adaptation in Monthly Comic Gene magazine, so let me tie them together: Mahou Sensou reads like somebody’s DeviantArt fanfiction.\\n\\n\r\nI’m not saying that free digital publication is a bad thing—it’s given us some of the greatest contemporary works of art and literature—but I AM saying that unskilled, unrefined content creators are published right alongside the hidden geniuses, and Mahou Sensou has a lot more of the former than the latter. If you’ve ever been on DeviantArt (and if you’re on an anime website, it’s a pretty good bet that you have), you know exactly what I mean. The show’s very title is a microcosm of itself, and represents about as much effort as is present in the rest of the show. “Mahou Sensou” probably sounds like it’s something pretty cool, if you don’t know any Japanese, but it’s the blandest, most basic title imaginable. There’s wars! And they’re fought with magic! MAGIC WARS. That is so cool, if you are twelve. It sounds less like fantasy-action series and more like a specialty Lego playset, except the Legos encourage imagination and creativity and can be enjoyed by all ages.\\n\\n\r\nMahou Sensou opens with a foreboding, post-apocalyptic urban landscape and some dramatic conflict between two siblings. It then immediately cuts to a more mundane setting with a similar inter-family conflict featuring our hero, ordinary high school boy™ Takeshi Nanase. I could say that the parallel of these scenes and characters is deliberate, but I get the feeling I’d be giving the author far too much credit. In any case, it is summer break, but Takeshi is off to school anyway to escape the immense pressure of his home life, which seems to consist of his brother and mother staring at him silently while all the lights are turned off. At school Takeshi runs into his doting childhood friend™ and pretend girlfriend Kurumi Isoshimi (the circumstances of their relationship are explained later, and are as convoluted as you’d expect them to be, so I won’t get into the details—if I examined every plot hole this review would never end). Shortly after Takeshi meets a mysterious otherworldly girl who falls from the sky™, Mui Aiba, and she drags him into her ongoing conflict with four equally mysterious and otherworldly assailants. Also Takeshi’s cool friend™ Kazumi Ida shows up, I guess because we need an even four protagonists? The provided reason is he’s there for remedial classes, but again, there’s nobody around but Main Character, Girlfriend, and the mysterious otherworldly folks. We’re not even halfway into the first episode and this already feels less like a television-ready product and more like a clumsy first draft. Not even a first draft. More like a bullet-point list of story notes.\\n\\n\r\nWell, anyway, the long story short is that MC, Girlfriend, and Cool Guy all get dragged into magical combat (perhaps you would even say…a war?? A magic war, perhaps????), and by the rules of this universe, being exposed to magic makes you a magician. There’s several different rigidly-defined, mutually exclusive classes of magic, each of which is carefully explained in detail both by the Mysterious Assailants and other characters through unnecessary expositive dialogue over this episode and the next, and whichever one you get to use is apparently random.  One of the assailants shoots magic bees and, shortly thereafter, nonlethally explodes. The explanation given (again, through expositive dialogue) is thus:\\n\\n\r\n1.\tA long time ago there was a big MAGIC WAR. To spare the non-magicians from getting caught in the MAGIC CROSSFIRE, a group of MAGICIANS using MAGIC split the world in two.\\n\r\n2.\tThere are two worlds, the “living world” and the “ruined world”, and the ruined world is where the MAGIC WARS continue to this day.\\n\r\n3.\tThe Ghost Trailers—the bad guys—want to keep doing MAGIC WARS in the real world (I think? It’s been three months and I watched 32 shows. Go easy on me.), but the good guys—Wizard Brace—want to protect non-magicians.\\n\r\n4.\tWizard Brace cast a spell called “the gift”, by which if you use MAGIC to do MAGIC WARS in the living world, you nonlethally explode and you can’t do MAGIC any more.\\n\\n\r\nThe point of exposition is to answer questions, but all this does is raise them. If you can’t do MAGIC WARS in the living world, and you become a magician by being exposed to MAGIC, where do magicians even come from? Is a propensity for magic genetic? Clearly not, since (spoiler alert) Takeshi’s mother is a highly skilled magician, and Takeshi has no skill until after Mui converts him.  And furthermore, how was he converted in the first place? Mui shoots MAGIC from her MAGIC GUN at least twice, and the mysterious assailants, while also wielding more mundane, non-magical weapons such as Great Big Anime Swords, also use magic attacks with absolutely no ill effects up until MAGIC BEES gets penalized for it. And if Wizard Brace wants to keep non-magicians away from the MAGIC WARS, what was Mui doing in the living world in the first place? It would be one thing if she was pursuing the Ghost Trailers to stop them from doing their EVIL MAGIC, but they were chasing her. We’re barely two episodes in and the show is already a clusterfuck.\\n\\n\r\nI’ve already given the plot synopsis three paragraphs and a numbered list, which is probably more than the author gave it, so I’ll sum up the rest quick. When the battle ends Mui takes Takeshi and friends—all of whom have been converted into magicians—to the “ruined world”. They are given the choice between being sent back to the living world with their memories of the past several hours wiped, or to move to the ruined world—leaving their lives, friends and families behind—and enroll in MAGIC SCHOOL to become soldiers in a MAGIC ARMY to fight MAGIC WARS. All three of them agree to this with literally less than a minute of deliberation. Okay, so we’ve established Takeshi is an angsty little whelp who doesn’t like his home life, but what about the other two? We even learn later on in the show that Kazumi is the sole caretaker of his younger sister. (She also becomes a magician, because Kazumi blows up their apartment, with magic. He doesn’t get Gifted for it though.) None of these kids think twice about leaving behind their real-world obligations to do MAGIC in MAGIC WORLD, and after the second episode they practically never look back. \\n\\n\r\nI’ve spent more words on the story than it deserves, and I haven’t even gotten into the deepest plot holes or the most trodden clichés like Takeshi’s Big Magic Anime Sword or how the Magic School actually works or Takeshi’s family drama or, as previously mentioned, his fake relationship with Kurumi. And I’ll avoid going into much further detail, but it’s worth mentioning that Mahou Sensou literally ends on a cliffhanger. Things appear to be wrapping up in the penultimate episode, but the finale dumps a ton of unbidden plot twists on the audience out of nowhere and then ends abruptly without resolving any of them. Which is especially bold, considering how even these twists fail to make me interested in seeing the plot actually get resolved.\\n\\n\r\nThere’s so much more to talk about. Let’s talk about the animation. Let’s talk about how Madhouse is the living contradiction of simultaneously being perhaps the best and worst animation studio in Japan. Madhouse did Monster, Nana, Dennou Coil and Kaiba, but it also did Chaos;Head, Photo Kano and this. Madhouse shows are either a brilliant, innovative feast for the eyes or they are garbage, and nothing in between. You can see traces of brilliance, like a good animator walked into the wrong room: the ending sequence is interestingly directed and fluidly animated, with excellent use of colour and composition that isn’t to be found anywhere else in the show. The director of Mahou Sensou is about as well-read on film as its author is on story structure. Every shot of Mahou Sensou, besides the aforementioned ending sequence, is boring at best and obscure and difficult to look at at worst. The colours are flat, desaturated and depressing—it could be an attempt to create atmosphere if not for the fact that literally every shot is like this, even when the show forays unsuccessfully into light-hearted rom-com. The animation itself is…not good. Frame count is low, characters are frequently off model, and it often seems as if the animators are trying to restrict movement to conserve the budget.\\n\\n\r\nSo if not to the animation, where is the budget going? The voice cast’s salaries, most likely. The casting choices for Mahou Sensou are bizarre, to say the least. It’s a late-night anime with lots of cute, moe girls who adorn the covers of the original light novels, but most of these girls are brought to life by B-list seiyuus with limited résumés. They’re not bad, per se, but they’re not very good, either. Of course, you could say; Mahou Sensou is hardly an A-list show, so it’s not like they’ve got the budget for A-list voices…until you take a look at the cast of the male characters. Mamoru Miyano! Kenichi Suzumura! Toshiyuki Morikawa! Jun Fukuyama! Truly, the night was dark, for all the stars were in Mahou Sensou. When I heard Miyano’s voice uttering some of the first lines of the show I couldn’t believe it. He’s got some of the most recognizable pipes in the industry, but I had to double-check to make sure it was him. Takeshi is the blandest, flattest, most forgettable male lead in recent memory, in a show that is for all intents and purposes marketed towards straight men. His lines could have been delivered by a carefully-trained parrot and the show wouldn’t be any worse for it. Why shell out the cash for Miyano? It’s not like he really brings his skills to the show, by the way. Miyano in Mahou Sensou is not Tamaki Suou or Light Yagami or Rin Matsuoka. He’s…really not very good at all. I know he’s got more talent than he expends here, so he’s either giving exactly as much effort as Mahou Sensou deserves or the show’s voice director is sleeping on the job. The same goes for just about everyone else—Suzumura’s affected Osaka-ben is grating and Morikawa sounds completely uninterested in anything at any time. Jun Fukuyama actually delivers a totally competent and acceptable performance, but he’s not in the show much.\\n\\n\r\nThe show’s soundtrack is where it truly shines, in that it is thoroughly average instead of being subpar or outright bad. The opening theme by FictionJunction veteran Yuuka Nanri is a generic chamber-pop number—her vocal work is certainly impressive, but the song lacks anything to keep it from being just another fantasy anime theme. On the other hand, the ending theme is quite good. Nano is one of a wave of utaites-turned-major label artists that have emerged in the past several years and, like many of their fellows, brings a breath of fresh air to the previously stale and stagnant anisong industry. “Born to be”, Nano’s contribution to Mahou Sensou, is catchy and powerful, with a meaty bassline and just enough pop in its pop-punk to avoid giving the impression that it’s taking itself too seriously. The song features lyrics in both English and Japanese, and as an American expat Nano’s pronunciation is flawless (not that I’d fault them if it wasn’t, because English is fucking hard). The lyrics, while technically grammatically correct, are corny as hell, but it’s not like anyone goes into anime music expecting Sufjan Stevens, so it’s totally forgivable.\\n\\n\r\nIn addition, Nano’s vocals are featured on a few tracks by series composer Masato Kouda. Kouda is already an accomplished composer, known for his work on Devil May Cry and Monster Hunter, but Mahou Sensou was my first exposure to his work. It’s not bad; one or two really good tracks, a few really bad ones, but mostly in-betweeners. Worth mentioning is “NEW WORLD” (which might not have actually been in the anime proper—it’s labelled on the tracklist as “soundtrack version”, but it’s worth listening to regardless). It moves seamlessly between uplifting orchestral instrumentals, to Nano rapping in English over an electronic beat with piano accompaniment, to a bouncy disco string section. It’s less than two minutes long, but it’s a great track—too good to be stuck in Mahou Sensou, probably.\\n\\n\r\nAll that having been said (and if you did read all of it: thanks!), I’m about to say something that might blow your mind. It’s true that Mahou Sensou is objectively and subjectively of poor quality; amateurishly written, amateurishly animated, amateurishly executed in every way. And I would not say that it’s “so bad it’s good”, or that I really gained any enjoyment out of watching it at all or that my life was enriched by having experienced it in any way.\\n\\n\r\nBut I would like to see more bad anime like Mahou Sensou.\\n\\n\r\nLet me clarify: in a perfect world, I would not like to see anything of Mahou Sensou’s quality at all. I don’t want to see more bad anime, but when you watch as many silly Japanese cartoons as I do, you get exposed to a lot of shit just by the fact of Sturgeon’s law. But I would rather watch Mahou Sensou a dozen times than sit through Wizard Barristers one more time. I would rather watch Mahou Sensou a hundred times than sit through even one episode of ImoCho.\\n\\n\r\nMahou Sensou is bad, but it didn’t make me angry. I did a lot of rolling my eyes and laughing out loud in disbelief at how utterly cliché and ridiculous everything was, and I often wondered how the show could have such little self-awareness, but never—not once—did I feel genuine malice towards anyone involved. Mahou Sensou did not offend me, and although I’m certainly none the richer for having experienced it, I don’t feel much poorer either. For as long as there are nerds, there’s going to be anime, and as long as there’s anime, a lot of it will be shit—but I want more of the shitty anime to start taking a page out of Mahou Sensou’s book. It’s bad, but it’s somehow cute, in that I get the feeling that it’s written by someone who is very young, or at least inexperienced. Whoever wrote Mahou Sensou has very little knowledge of literary structure, conflict, storytelling, or even how the real world or real people work. No one in Mahou Sensou is a real person, they are a walking list of tropes, recycled and regurgitated from a thousand anime characters before them. Things happen in Mahou Sensou not to progress the story or the characters, but because they are cool, or they are well-trodden anime clichés. It’s bad, but for some reason I want to pin it up on the fridge.\\n\\n\r\nI’m not saying it’s totally innocent. There are a handful of weird moments of objectification scattered here and there—for some unexplained reason, the first time Kurumi uses magic, her breasts expand (this never happens again), and I can recall at least one very clichéd “the hero walks in on the heroine in some manner of undress” scene. But these scenes are relatively quick and painless, and feel more like the author felt obligated to throw them in because that’s just something that HAPPENS in anime, rather than because they feel any actual antagonism towards women. It’s true that the female characters are undeveloped and two-dimensional, but so is literally everyone else. The last chunk of the show is a very tired “damsel in distress” arc, but Kurumi has at least a little agency while being held hostage—much unlike Sword Art Online’s revolting, misogynistic mess of a second half. Everything about Mahou Sensou feels like it was written by a child, and while that means it’s of very poor quality, it also means theres nothing cruel or mean-spirited about it, overtly or otherwise. I almost feel bad talking trash about it, because it definitely doesn’t WANT to make me feel bad feelings, and I’m pretty sure it’s doing the best that it can.\\n\\n\r\nSo would I recommend Mahou Sensou? No. Absolutely not. There is nothing you stand to gain from the experience of watching it. It might not be malevolently bad, but it’s still bad, and everything about it is poor. However, I would make the following to anime producers: instead of maladjusted adult men with a deeply-rooted hatred of women, might I suggest turning to thirteen-year-olds to write more anime scenarios? Fresh, new talent could not possibly hurt the industry.",
            "date": "2014-03-28T20:39:00+00:00",
            "helpful_count": 304,
            "mal_id": 137645,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/134590.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/kindergraph",
                "username": "kindergraph"
            },
            "url": "https://myanimelist.net/reviews.php?id=137645"
        },
        {
            "content": "Watching Mahou Sensou (Magical Warfare) is like finding out you just got arrested for something you didn’t even do and get put for jail for it. Confusion is the first word that will come to mind but then comes the anger phase and regret. The term ‘regret’ isn’t for feeling sorry for yourself but rather as how could a show with a tolerable premise can sink to a defiled piece of work. Not that expectations were high coming into this show but Mahou Sensou is an excuse of a damnation. \r\nMahou Sensou translates to Magical Warfare. As the name implies, the series adapts magical themesinvolving various spells in an ongoing war. The war involves a group of magicians going against beings known as Ghost Trailer from another world.  We learn from the first episode that Takeshi Nanase has some sort of mysterious power that allows him to fight on par against some of the magicians in his world. Of course, this doesn’t happen after his life gets turned around forever. Nonetheless, he gets caught in the frenzy when a young girl named Mui became a target by the Ghost Trailers. It’s probable to guess what happens next as Takeshi tries to play the role of a hero and attempts to save her. Not only does this sounds like a trite formula of a typical magical series, it makes little sense at first. Everything happens too quickly as well as all at once. As time goes on, the series attempts to explain itself regarding both worlds, its histories, characters, and everything else in a fashion to hopefully draw viewers in. Unfortunately, it just doesn’t fit right.\\n\\n\r\nThe plus side is that the initial episodes blasts off in a quick fashion with the action and drama with little time to waste. Not only does it immediately get to the point with the conflict but it also brings together most of the main characters together in a dilemma that ties with the premise. But here’s the main problem: the pacing. It’s not just rushed but also inadequate. How would you explain a normal boy who resents his family for unknown reasons at first able to fend off a guy nearly twice his size with a large sword? From minute one to the credits proves the show is gimmicky clustered with cliches, gags, and senseless characters. It’s like a hornet nest with everything dancing and flying at once.\\n\\n\r\nCharacters in this series ranges from the typical small girl Mui to the more fashioned beauty known as Kurumi Isoshima. The latter is known as a stunning beauty at school but more importantly as Takeshi’s ‘fake girlfriend’. Despite the two pretending to be a couple, it’s obvious that Kurumi might have genuine feelings for her “boyfriend”. There’s also the best friend of the main protagonist, Kazumi Ida, a stereotypical delinquent that comes with the spiky hair, tough personality, and carefree attitude. None of these characters appeal to each other in any way. The worst of them might be Takeshi Nanase who sees to possess no personality. On the surface, he is a caring friend but often is indecisive over various matters. Only does trouble comes will he resent to dramatic action. Trouble comes from the Ghost Trailers whom serves as the main antagonists. They are presented as the epitome of stereotypes with their crafty looks, egoistic attitudes, and cheesy ambitions. Forget characterization. The Ghost Trailers don’t have a ghost of a chance for admirable attributes.\\n\\n\r\nDrama takes in the form of family affairs and conflicts. It serves as a degeneration of a happy relationship because of circumstances. For Takeshi, it’s related to his younger brother Gekkou. Through flashbacks, there’s a clear problem with the boy because of his obsession towards a certain character. It’s an establishment for a bomb to explode soon between family manners. And of course, it does through actions in the way of magic. The way the series progresses this also lacks depth because of its basis. It’s clear as day why Gekkou’s behavior is seemingly justified by his actions. The show doesn’t even need to explain itself because of its clichéd angles. It’s saturated with lifeless emotions because of the weak persona through its characters. The characterization of the main magicians also lacks depth with their purpose. Everything just feels if they need to be there with no sense of morality. It fails to make its point with its collection of platitudes.\\n\\n\r\nAs with the concepts itself, mechanics of this show demonstrates some credibility. This is set by the standard of Subaru Magical Academy where students learn magic. It’s a place where characters like Takeshi, Mui, Kurumi and others train to perfect their skill as magicians. On the surface, it touches the basics of magic at a fundamental level. However, everything feels like it progresses far too quickly with its generics. The way magic is acquired is explained in simplicity despite the complex nature of some spells. From the first episode, we witness how our main characters acquire their magic with a taste of fan service involving Kurumi’s enhanced breasts. Besides catching the attention of others, the magic itself is only attractive by its effects rather than its execution. What I mean here is the way how some spells seems be blend to the core with their usage. On a more bright side, the series does focus on training sessions including a magical examination. In essence, it does maintain some degree of trustfulness with this show’s product.\\n\\n\r\nUnfortunately, the romance aspect remains almost tasteless. There’s a lack of chemistry between the main characters. This mainly is focused on the love triangle going on between Kurumi, Mui and Takeshi. It follows an endless cycle of stages with the first stage being misunderstanding, the second stage explanation, and the third seemingly nowhere. Kurumi also gets herself involve with other male characters. We don’t see much progressing between her and them because of her own insecurities. Again, the pacing issue of a one-cour show also plays a role in downgrading Kurumi’s relationships. Furthermore, the chemistry she has with any of the characters just seems lackluster. She’s like a Barbie doll that everyone wants to buy. Her Ken is Takeshi.\\n\\n\r\nOther flaws in the show includes a weak building structure connection both the real world and the magic world. Although it explains itself somewhat with the past and ancestries, the show neglects to explore them in depth. For fantasy writers, a show should demonstrate a decent degree of its world qualities. Unfortunately, this show is not one to serve as an example of that. However, this show does show examples of fan service. Although it doesn’t reach ecchi levels, the clichés reaches its point with swimsuits, compromising positions, and clothes torn by battle damages. The construction of its premise also hardly sounds original with the stereotypical Big Bad wanting to conquer the world and purify its worthless inhabitants. Wait, I heard that somewhere before…\\n\\n\r\nThe artwork would be appealing if it demonstrated an imaginative atmosphere. A world with magic and fighting wars between each other sounds attractive but the artwork is not. Character designs are blend and focused mainly on their stereotypes rather than who they actually are. The Ghost Trailers are hardly charismatic either with their lack of personalities. Everything feels forced with their lifeless expressions. Background artwork offers some degrees of admiration although it only ties in with its main themes. The only artistic attributes I find are perhaps the spells as they do offer degrees of diversity. They connect with the magical themes of this show with some degree of limited thought.\\n\\n\r\nOut of all the technical aspects, soundtrack is probably the strongest factor coming from this show. To say the least, the OST is catchy with its hard rock tone and techno-like sensation. It actually connects with the dramatic scenes involved with the battles. Characters also demonstrates their voice mannerisms decently whether it’s feelings of anguish, fear, happiness, regret, solitude, or egoistic.  The OP song also has its mood done right despite some of the magnetic movements. Focus should be bought forward to this show’s soundtrack aspects if you decide to get into this show. On the other hand, characters such as Takeshi lacks enthusiasm with his voice while others just feels lifeless. \\n\\n\r\nMahou Sensou is not just an underwhelming show but is exactly what you’ll expect. Its predictable plot is almost laughable with rushed scenarios, weak characterization, and conglomeration of cliches. It’s shameful that a show with the concept of magic can turn into this cluster of weak thoughtlessness. What you may expect is what you will get in the form of poor writing, romance cliches, thoughtless characterization, and farcical development. Despite the way this show originally set its family feuds into motion with darker aspects, its executions is stale and atrocious. Rather than evoking excitement, it spawns boredom with no redemption. If you really want to check out this show, then be prepared for a magical tale of mediocrity.  \\n",
            "date": "2014-04-11T00:39:00+00:00",
            "helpful_count": 162,
            "mal_id": 139519,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=139519"
        },
        {
            "content": "The phrase of \"Dont judge book by its covers\" is really true. When we all seeing the short explanation by this anime, we're gonna imagining something great, magnificent, epic battles and stunning art. But in the end it was all just an illusion. Illusion that been made by this anime, summary we're being deceived.\r\nMahou Sensou or Magical Warfare is anime that technically is about action and magic like the genre has said and thats it. If we're talking about plot, it hasnt. Well, at the first you would introduce that the world has two side world, first it was human world and the other oneis wizard and whatever world. Then, somehow without any logical thinking, our MC is choosing to live in magician world just for helping one girl and moreover its the first time that they meet.\\n\\n\r\nThe first time i watch this, i cant help to feel cliche and so pushed. Like one scenes that i said before, the MC is choosing to live in magician world just because he cant enjoyed living in his own house and feel urge to save someone he just met. Being heroic, is probably one of the good aspects that the MC must have but realistically speaking, even the stupid people would think twice to risking their live just for saving people. If the this MC called Takeshi have a good reason for it, then it doesnt matter but honestly all of the reason that he give is kinda illogical and another kind of illogical things is how kendo sword that been made wood is capable of fending off a real blade and moreover its a steel one. Oh god. \\n\\n\r\nAside from logical thinking, another things that quite funny is how easily people can be affecting to use magic. I mean, in this anime the MC or Takeshi is a normal human being and the second later he become magician just because Mui Aiba (the heroine) using magic near of him. Its like \"you want to be a magician? then come here i will use my magic and you would become magician! yeah!\"\\n\\n\r\nMoving on to the art section, this is probably the worst aspects that this anime have. For anime that been adapted by Madhouse studio the one who brought you Hunter x Hunter (2011), this anime's art is really horrible for anime that airing in 2014. First how the characters design isnt consistent. When watching this, i cant help to notice that in every scenes they draw the characters so badly and something that doesn’t bode too well for an action/fantasy series such as this. Like sometimes, the face looks so awkward like it bents to the otherside. \\n\\n\r\nAnother things that probably being controversial is how the character design is like from fate/series. In the opening song, you would see like a white saber with that armor and things, then there is this blonde guy called Kazumi Ida who is looking so similiar with Gilgamesh. For anime that been made by a big studios called Madhouse, surely this one is such a big failure.\\n\\n\r\nAfter all that, there is one thing that atleast \"normal\" and so so. It was the sound. There is nothing to much too mention in this term. Good things they have Mamoru Miyano for voicing Takeshi, as usual he did it well and really fits with the MC. For other seiyuus, they did well though i believe it wasnt something special. The one i like from this anime is the ED. Nano with their \"Born to be\" song is so epic, their fastbeat and energetic song makes this anime looks so epic though it wasnt happen. Such a shame.\\n\\n\r\nLast, the characters. The explanation that i said before maybe give you a glimpse about the characters in this anime. First, we have a \"heroic\" MC called Takeshi which is have a justice feeling and prepare to help anyone who need to help. ANYONE. At the first we would see that he have such a dark past and trying to make us curious. But honestly well, its failed. I dont understanding what happen in this anime so why would i need to curious about his dark past? and for some circumtances, he is dating with such a beautiful blonde girls named Kurumi Isoshima. She is just your typical tsundere girls, and at last, we have Mui Aiba, our main heroines. She is nothing special to being mention about this. Well, she have a gun. a GUN. Summary, the characters isnt likeable which is the most important things in anime to make the viewers enjoy to watch. They have nothing that makes us to like the characters, after all they all plain characters.\\n\\n\r\nAfter all that mubbling, i honestly feel guilty to writing this review. I dont want to judge the anime so badly but its just i cant bear it. I am not saying this anime is bad for all of you but in my perspective, this anime is bad though they have a lot of potentials in there. If you're liking action and magic with some cliche romance on it, probably this anime would suit you but honestly, there is still anime that is more better than this one.",
            "date": "2014-07-15T21:36:00+00:00",
            "helpful_count": 143,
            "mal_id": 152241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1665261.jpg",
                "scores": {
                    "animation": 2,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Kynov",
                "username": "Kynov"
            },
            "url": "https://myanimelist.net/reviews.php?id=152241"
        },
        {
            "content": "The magical warfare. Where to begin? Its an epic tale of conflict with shounen ideals and stride. Its an enthralling tale that captivates the hearts of casual watchers like myself. And did it? No.\r\n - Story - \r\nWhen it comes to having a plot, the anime nails it for having a premise. But is there an actual plot? Not particularly. The first half of the anime is devoted to introducing the protagonists and hinting that Takkeshi might just be a super powerful magician by the end. The second half kept me on the edge of my seat because, well, it was so rushed that eventhe episodes couldn't tell you the whole plot. The established love triangle was more or less realistic, which I applauded. There were several loopholes in explanations and how things popped up. The random pokemon encounters with enemies was not appreciated. By the last episode all I honestly watched the anime for was some senseless violence, and by then it was 5:00 AM. It was a magical night. All in all, there was a rather poor pacing for an unrefined plot.\\n\\n\r\n- Art - \\n\r\nThe art was actually quite good, enough to make me want to see an epic poster disproportionate to the plot itself. Character designs were actually really cool, along with the weapons of some. My qualm was the absolute lack of originality. Sure, the characters were cool. But I would look at other anime for the exact same hairstyle and face. \\n\\n\r\n- Sound - \\n\r\nI gotta say, the music was hella catchy. It had the right vibe to the situation most of the time which I really liked. What else can I say? The folly was pretty standard and there was nothing special in sound effects. \\n\\n\r\n- Character - \\n\r\nOooh boy. Now for the bad boy. The main character Takkeshi was extremely bland and standard. For a protagonist, I haven't seen an emotionless character like him ever. Aside from the stereotypical crying over lovers and yelling at friends to get to safety, this main character had absolutely no emotion. His quirk was the lack of quirks. I can't even call it natural. Without his powers and role in the plot he might as well join the pile of scrap characters I've imagined for fun. His powers made absolutely no sense by the end, since the story couldn't even be told properly by the episode.\\n\\n\r\nNow for the female protagonist, Mui. What in the world is wrong with her. She supposedly has a brother complex, which is understandable. But her development and dynamic with the other characters ended right there. There was nothing to characterize her other than having a brother complex and has a crush on Takkeshi. In terms of her powers, since this is an action anime, she had no growth either. She introduced the characters with her magic, and she stayed stuck. Then what happens, you may ask. She gets hurt. Rinse and repeat.\\n\\n\r\n- Enjoyment -\\n\r\nWas all that heavy stuff weighing on my head as I watched the anime? Not until the very last episode. So I suppose I had a high enjoyment factor when it comes to brainless plot twists and incoherent violence. Not that we couldn't tell what was happening, rather, we just accept that power-ups never need to scale with what was previously established. Like DBZ right? Buu just needs to revert to his original form to be the strongest even though he ABSORBED strong beings to become STRONGER.\\n\\n\r\n- Overall -\\n\r\nI guess I did enjoy this anime while watching it. But if you're the type to watch something and actually take in the details of what is going on while watching, I wouldn't recommend this anime. I'm one to appreciate the anime while watching but also think about it afterwards. In all honesty, Mahou Sensou could have been VERY different and so much better, but the mesh we have is not what I would consider a polished piece of work.",
            "date": "2014-12-16T17:45:00+00:00",
            "helpful_count": 99,
            "mal_id": 172595,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3731201.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/macklez",
                "username": "macklez"
            },
            "url": "https://myanimelist.net/reviews.php?id=172595"
        },
        {
            "content": "I have been summoned here by my very own rage. Sheer amount of anger at this single series has led me to write a review.\r\nI chose to watch this show randomly as it started getting released at the winter 2013/2014 anime season and, God my witness, I chose wrong. I really did chose wrong.\r\nThe story revokes around random looking and acting characters in a somehow magical world. Nothing is really explained properly, nothing really adds up. No sense AT ALL. The story is not the slightest enjoyable for the viewer to see, it's full of random time skips, lack of explanations and a plethora ofboring characters. And it gets worse episode by episode.\\n\r\nThe MC, TakeshiT, is a generic black-hair main hero guy who has a talent in magic (giving him random power ups for no reason at all. Honestly, there is not a single reason for him to live apart from being the main guy).\\n\r\nAs for side characters: most of them are useless. They either appear scarcely in the whole anime, their appearance could have been totally cut off without any harm for the \"story\" or despite their powers they never did anything significant. For example, Kurumi is as useless as Sakura in Naruto first was (and most people remember it as a legendary feat). Despite her powers, she does NOTHING. nothing at all. she''s just \"there\". she exists to cry over Takeshi, when he's hurt. Mui looked promising at first but basically she's powerless, she can be beaten by any random enemy there is. Nothing good can be said about any other characters as well.\\n\r\nThe only fine one is Gekkou. Why, him, of all people, you might ask? because he's, well, nuts. He's just insane and that's all there is to him. Paradoxically, he makes the most sense in the series. and STILL he's a character that has little sense as well.\\n\\n\r\nThere is NOTHING told about the magical world itself, NO ONE ever asks nor questions such issues like brainwashing of other mages or gives a sensible flshback to light a character background up. Events are sudden and out of place, everything seems forced and rushed.\\n\r\nThis is Mars of Destruction tier almost.\\n\\n\r\nMahou Sensou's randomness and really bad plot development make this series practically unwatchable. it's as if someone is TRYING to make it suck. And he's doing a really good job at it.\\n\\n\r\nEvery single episode just goes worse and worse and WORSE. It's both boring and stupid. If you looked for one of the shittiest anime in world history, this is one definitely made it to the top 100 in my personal rank.\\n\\n\r\nThe only good thing is the ED. I like the music and the animation going with it. and that is all good to be said about Mahou Sensou. Don't watch. Just don't. You won't enjoy it.",
            "date": "2014-04-13T13:33:00+00:00",
            "helpful_count": 39,
            "mal_id": 139807,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/422129.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Smoku",
                "username": "Smoku"
            },
            "url": "https://myanimelist.net/reviews.php?id=139807"
        },
        {
            "content": "Okay..where do I start. This is an anime done by Madhouse, so my expectations were quite high, since I've seen most of their other works, but oh God was I dissapointed.\r\nStory: 3 (poor)\r\nFirst of all I think that this is my major problem with the anime. For starters the whole magical stuff is quite chiche, but that is not my real problem here. The real issue is that the plotline is really quite predictable and it lacks development.\r\nOverall the story is predictable and full of cliches used all over the place. \r\nArt: 5 (mediocre)\r\nThe art for the anime is quite good, as expected of Madhouse,but on quite a lot of occasions there are characters in the background that won't move, also as well as that there is some 'derp' faces coming from the main characters.\\n\r\nOverall the art isn't a major issue here.\\n\\n\r\nSound: 6 (fair)\\n\r\nNow that is the one thing about this anime I actually liked, with both the opening and ending themes being catchy and memorable the soundtrack fitting with the scenes and everything.. oh such a waste of great music.\\n\\n\r\nCharacter: 4-3 (decent/poor)\\n\r\nAnother major issue I have with this anime is the lack of character developmet. At the beginning we are introduced to a relationship that starts developing between the main male and female lead that does not develop any further than the first few episodes.Which is a real shame, because it would've been nice to see how thing worked out.\\n\\n\r\nEnjoyment: 4 (decent)\\n\r\nYou could say that I somewhat enjoyed the anime, but if it weren't for all of the things listed above I would've had far more fun watching the show.\\n\\n\r\nOverall: 4 (decent)\\n\r\nWith that in mind I reccomed this anime to anyone who is willing to watch a predictable shounen, full of cliches.\\n\\n\r\nreview by: dark_cookie",
            "date": "2014-08-05T11:06:00+00:00",
            "helpful_count": 25,
            "mal_id": 155375,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3976207.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/dark_cookie",
                "username": "dark_cookie"
            },
            "url": "https://myanimelist.net/reviews.php?id=155375"
        },
        {
            "content": "When I first saw the synopsis for this series, I was extremely excited for it. Unfortunately, my expectations for this series was not met and it left me thinking that this series was a pure waste of my time.\r\nFor one thing, the pacing, in my opinion, is just terrible. The series will have an episode with a battle, then an episode with an explanation. All the explaining is extremely annoying. Sure, I like knowing what is going on, but usually the explanations have nothing to do with whatever event is occurring at the moment, and it will still leave me several unanswered questions as towhat exactly did happen.\\n\\n\r\nAnother thing that seriously annoys me are the characters. Takeshi is just extremely gullible, and I found myself calling him an idiot more than once. Kurumi is your typical \"damsel in distress\" who doesn't seem to really have any useful powers. Ida just acts first without any thought, but we don't even see much of him anyway. Then there's Mui, who I can't really find anything noticeably wrong with her, except that she causes drama between Takeshi, Kurumi, and her.\\n\\n\r\nThen, there's the romance aspect of this anime that I find uncalled for and unnecessary. It provides fan service, I know, but it is not needed at all. The anime would operate just fine without it, and all it does is take up episodes where something important could be happening (or an explanation -.-).\\n\\n\r\nThe ending was also rather open-ended, leaving you to try to figure out what actually happened, or happens... I might just force myself to read the manga in order to try and see if what happened is explained, because the ending of the anime just left me with even more questions than before. Overall, this series is something I wish I didn't spend my time to watch. It is not something I would recommend to watch.",
            "date": "2014-03-28T12:22:00+00:00",
            "helpful_count": 24,
            "mal_id": 137509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3648441.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/lilac677",
                "username": "lilac677"
            },
            "url": "https://myanimelist.net/reviews.php?id=137509"
        },
        {
            "content": "Mahou Sensou was overall the complete definition of a disaster. Starting the anime, I was completely hooked and found it very interesting but the last half is what destroyed it. Parts of the anime skipped from one area to another and plot developement was sacrificed in the process. The characters, to me, werent bad and were fairly well thought out though some were unoriginal  the main characters seemed decent. The characters and the storyline the plot attempted at were ultimately the strongest assets of the show. Lastly, the final episodes were utterly haywire. A new scene is produced the is not at all explainedor supported  in any other parts of the anime and leaves the watcher extemely confused and almost dumbfounded by how chaotic the events become.",
            "date": "2014-06-11T13:59:00+00:00",
            "helpful_count": 21,
            "mal_id": 146665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3715147.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/chidoristream506",
                "username": "chidoristream506"
            },
            "url": "https://myanimelist.net/reviews.php?id=146665"
        },
        {
            "content": "Just finished Magical Warfare (Mahou Sensou) and now I'm here to warn you all of the complete waste of time it was to watch. Out of all of the anime that I watch I hardly ever find one that I just didn't like. Well.. I guess there is a first time for everything. \r\nStory: At the start you think you're going into an anime with great concepts and characters that will leave your jaws on the floor and  cosplays to be made. WRONG!! The story's pacing seemed as though it was on a good track the first 3 episodes but the more you watchedthe more unstable everything got. From skipping between large gaps of time to completely rushing through important adventures and  plots, this story seemed like a really bad LSD trip.\\n\\n\r\nArt: I can't really complain about the art style here. It wasn't anything to showcase but it wasn't horrible per-say.\\n\\n\r\nSound: The only piece of music that i could happily recognize was the opening soundtrack. Aside from that everything else was so overused to the point to where it became a drowned out blur.\\n\\n\r\nCharacter: The only two characters that really stuck with me were the MC and his younger brother. That's only because one was constantly on the screen and the other was so god awfully annoying all I could do was think about how I wanted to kill him myself.\\n\\n\r\nEnjoyment: No. Almost none at all. Every episode half way through was a huge cock tease mixed in with a bit of half assed plot.\\n\\n\r\nOverall: I can't say that I absolutely hated it. Yes there were so many reasons to hate it but I think that overall the concept of the world was pretty impressive. I wish that there were more episode so that there would be more of a story build. But hey this is what you get when you try to build Roam in a day.",
            "date": "2014-04-10T00:57:00+00:00",
            "helpful_count": 19,
            "mal_id": 139431,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3674973.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AtlasGray95",
                "username": "AtlasGray95"
            },
            "url": "https://myanimelist.net/reviews.php?id=139431"
        },
        {
            "content": "As I said in my Strike The Blood review, I do not write many reviews for anime so bare with me as I write something for this one. Honestly, I don't see why this anime is getting so many bad reviews its not as bad as people are making it out to be but of course that is my opinion alone. Now onto the review: I found this setting sort of unique from most animes and for the fact this anime wasn't a harem was a major plus, let alone there wasn't much fan service. It kept serious, and stuck with the plot which Iwas glad for. \\n\\n\r\nI was also quite pleased with the main female; Aiba Mui for she tries very hard to fight on her own without the needing to be saved and how she was devoted to save her brother, but I won't get into spoilers for people who haven't seen the show. For a young girl, I thought Mui was strong.  I also was quite pleased with our male protagonist Takeshi Nanase; who had grown from the twelve episodes. I love characters who have strong determination. : D\\n\\n\r\nThe whole two worlds being separate; sort of gave me a Shakugan no Shana feel for the series which was a nice feel. The music was entertaining, the opening and ending were strong points in the anime as well as the way magic was set up in this series. And I like how Takeshi and crew were transferred into a Magic Academy rather than sticking around in High School; being ordinary the normal thing anime tends to do.\\n\\n\r\nAnd this anime has a lot of nice twists and turns. But again, I'm not gonna get into that because it will be spoiling. However, I'm not going to give this anime a perfect score; considering it ended in a cliff hanger and these type of series I feel needs 24 episodes or more so characters can have room to grow. And have more time.\\n\\n\r\nAlso the art was pretty smooth to look at as well. Another good work by MadHouse. : D\\n\\n\r\nHopefully it will get a second season!~\\n\\n\r\nI give this anime a 7, I would give it an 8 but a lot of questions are still left unanswered and let alone the cliff hanger. My score would change if this series gets another season. :]",
            "date": "2014-03-27T17:52:00+00:00",
            "helpful_count": 18,
            "mal_id": 137321,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2088817.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ShionxChan",
                "username": "ShionxChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=137321"
        },
        {
            "content": "Writing this review because I watched this piece of crap anime while it was airing but was to dam lazy to make a review. This was one of the worst animes I have watched it was just as bad as watching Kanokon. I literally felt slower than the characters in the series. Watching this anime made me feel like I was killing brain cells luckily I survived. \r\nFirst off I give the story a 3\r\nIt has some potential to be good but it was executed pretty badly and rushed.\r\nI didn't like the reason why there was a war because of 1 person I thought thatwas pretty stupid. I also thought there was too much story and not enough episodes, almost like they didn't have enough money to keep going. You got Mui trying to save her brother, Takashi's problems with his family, The war between the magicians and trailers or whatever the hell they were called, Takashi being brought into the magic world, 2 girls fighting over him, and the list goes on. It was poorly done in my opinion and they should have added less plot.\\n\\n\r\nArt - 4\\n\\n\r\nThe art was okay but could have been more original. The characters didn't look very unique they just looked average.\\n\\n\r\nSound - 8\\n\r\nThe only thing good about this anime was the fact Nano sung the ending which sounded very good but sad to see it being used in this anime.\\n\\n\r\nCharacter - 3\\n\r\nI felt no connection to the characters at all. The only character I felt sorry for was Gekkou because Takashi was a piece of sh*t towards him and he just takes it like they're in an abusive relationship and forgives him so easily even though he was a b*tch and shoved him into a car because someone apparently told him to. The kid can't even make choices on his own and he's a weak character. He thinks his mom abuses him even though she was helping him get stronger. Takashi is the definition of a brat. The blonde haired girl is too dam clingy, I was hoping she would go for Gekkou but she's too stupid and falls in love with Takashi even though he's a brat pretending to date her like a little b*tch that he is throughout the whole series. Mui fell in love with Takashi too easily, I see nothing special about him, he claims his mom hates him and he tried to kill his brother and wonders why his brother hates him. Lastly there's Kazumi Ida, I see nothing cool about him that's really all I can say because he really had no involvement in the anime, he wasn't needed at all.\\n\\n\r\nEnjoyment - 3 \\n\r\nI give it a 3 because there were some episodes I laughed at how pathetic the anime is. It was such a chore watching it and finishing it but I survived without losing all my brain cells amazingly.\\n\\n\r\nOverall I give this anime a 2 because it sucked so bad, I would give it a 1 but seeing animes like Kanokon I'm being generous and giving it a 2",
            "date": "2014-08-05T10:48:00+00:00",
            "helpful_count": 18,
            "mal_id": 155373,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Fantasys",
                "username": "Fantasys"
            },
            "url": "https://myanimelist.net/reviews.php?id=155373"
        },
        {
            "content": "I watched this anime after seeing a couple scenes in a youtube clip. It looked interesting so I watched it. Here are some of the pros of the show\r\n1. It had some interesting characters.\r\n2. The magic in it is cool and there were so pretty decent fight scenes. \r\n3. Near the end of the show the story got pretty interesting. \r\nNow here are the cons. \r\n1. The interesting characters aren't the main characters. The side characters in this show are more interesting and awesome than the main characters. The main characters are pretty dull and boring, and only one of them becomes semi interesting nearthe end of the show. \\n\\n\r\n2. I feel they cut a lot and I mean a lot out when adapting this from it's light novel counterpart. One episode we see them unable to do a certain sort of magic and then the next they have suddenly mastered it, not because they are awesome like that but because months have actually passed between the 2 episodes. \\n\\n\r\n3. They bring in new magic that the charactrs can suddenly use, yet the audience never gets told what this magic actually is or does. We can semi guess what it is but overall 9 times out of 10 we are left in the dark. \\n\\n\r\n4. The story gets interesting near the end. I put this in the pro part as well because it was an interesting story point. It's also in the con part because well nothing in the show ever really leads into this story. It's all just suddenly dropped on us in the last couple episodes. \\n\\n\r\nSo in conclusion, I would love to read the light novels this show is based on since it did perk my interest and I know they would go into more depth. As a tv show though, it is a complete mess and not worth watching. There is no real story, the characters we are suppose to connect with we don't and most the time the relationship between characters seems strained at best if not just plain unbelievable. This is because the show skips over so much character development. To sum it up simply, imagine all 7 Harry Potter books jammed into one 2 hour movie and that's pretty much what Magical Warfare is.",
            "date": "2014-09-16T01:37:00+00:00",
            "helpful_count": 17,
            "mal_id": 160577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3193111.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/llama612",
                "username": "llama612"
            },
            "url": "https://myanimelist.net/reviews.php?id=160577"
        },
        {
            "content": "I don't even know where to begin...or maybe I do?\r\n\"Don't judge a book by it's cover.\", comes into play here. You'd think the girl in the front cover, and title would get you all hype about \"what wonders lies within this amazing looking light novel.\"? Or the fact that the PV/Trailer video about the anime was downright attractive. Well let's start with how I first knew the series.\r\nI first knew about Mahō Sensō(Magical Warfare) back in around 2012 IIRC. I was looking for Visual Novels and/or Mangas similar to Shakugan No Shana, because it was been a while since I read a series that involvesfantasy, romance, and action. \\n\\n\r\nI found about Mahō Sensō Light Novel and thought to give it a try. Oh boy, it was interesting at first. At some points as I continue the plot and story becomes bland, and character-wise, everyone has little to no progression at all. I thought at first that maybe 'cause this is a Light Novel and that it'll probably be different when I actually see them in action, like in an anime, or a manga atleast?\\n\\n\r\n2013, the manga was released. I gave it a try, and...it was mediocre at best. I decided to give up on the series, or atleast let it on hold.\\n\\n\r\n2014, the anime was finally released. And what a surprise, it's still bland as ever.\\n\\n\r\nHonestly I'm seeing a lot of potential with the theme and concept. But it just isn't working well with the whole plot and characters.\\n\\n\r\nCritical Short Review:\\n\\n\r\nStory-wise:\\n\r\nIt involves 90% around a girl trying to bring her \"onii-chan\" back from the \"Dark Side\". Laughable. In seriousness, the plot is about two worlds in actually one reality. Magical Side, and Human side. Whole common concept about some dude wanting to erase non-magicians.\\n\\n\r\nNot unique at all.\\n\\n\r\nArt:\\n\r\nMediocre at best. Even the magical effects are mediocre.\\n\\n\r\nSound:\\n\r\nSeiyuu/VA - If it wasn't for Nao Tōyama voicing Aiba Mui, I would've dropped this. There are others like Kenichi Suzumura, but they don't fit their characters well. \\n\\n\r\nMusic - There's music?\\n\\n\r\nCharacter(s):\\n\r\nI'm sorry what? The main male protagonist is just your average guy from any other fantasy, romance, action, magic anime out there.\\n\\n\r\nEvery character is dull and boring. No uniqueness at all.\\n\\n\r\nEnjoyment:\\n\r\nI'm really sorry, but it's not working at all.\\n\\n\r\nOverall:\\n\r\n4.2\\n\\n\r\nSad. The concept, theme, and plot had some potential. Ruined by the common concept ideas of characters, and story-line.\\n\\n\r\n-\\n\\n\r\nI wrote this right after I watched every episode on the date of March 28th, 2014. The date when it ended. So this is my full honest review.",
            "date": "2014-03-28T18:52:00+00:00",
            "helpful_count": 17,
            "mal_id": 137617,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3660335.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zerviscos",
                "username": "Zerviscos"
            },
            "url": "https://myanimelist.net/reviews.php?id=137617"
        },
        {
            "content": "I've already written up a review on this anime. You can check it out on my blog, to get a full review on it *it does contain spoilers*.  \r\nBut to keep it short. This anime starts off pretty well. A solid start, nothing wrong with that right?. But under closer inspection, this anime flaws are pretty evident. And it harms it a lot. \r\nCharacters: \r\nTakeshi is your most generic male character. Nothing outstanding about him. You can forget about Ida, that guy supposed to be one of the lead characters and he is off screen and forgotten about for the most part. Not onlythat, he is just as generic as Takeshi is. Mui, has some redeeming qualities, but like Takeshi and Ida just generic. In fact the whole main and side cast are just plain generic and forgettable. \\n\\n\r\nStory: \\n\\n\r\nStarts off strong, then goes down hill mid way. And then just evaporates with the most ridiculous \"cliff hanger\". Oh and the pacing is just bad - especially towards the end. Heck even the exposition of the story, makes little sense.\\n\\n\r\nArt: \\n\\n\r\nSuffers a lot here. The consistency is just bad. Mui has her nose missing in episode 1. Turns up in episode 3. The budget must have been low, to have even the most basic things go missing then added later on.  \\n\\n\r\nOverall: \\n\\n\r\nA very bad anime. Don't waste your time.",
            "date": "2014-11-25T13:27:00+00:00",
            "helpful_count": 16,
            "mal_id": 169909,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Wh8ever",
                "username": "Wh8ever"
            },
            "url": "https://myanimelist.net/reviews.php?id=169909"
        },
        {
            "content": "Writing this review to try to save as much people from watching this piece of garbage!! I'll try to keep it short.\r\nMain adjectives to describe this anime: SHALLOW, MEDIOCRE, LAME, WEAK, CONFUSING.  \r\nThe story basically has no strong foundation to hold it. It has this main plot/premise but has major problems executing it to its potential. When you read synopsis (wont write it since it's in the main page already), sounds interesting enough. But as you watch the episodes, the pacing is way to off (some episodes are slow and some, too fast) and lacks a straightforward direction. The ending was extremely rush thatit left the viewers with more questions than explanations. There was absolutely no resolution. Additionally, the reason why the characters are acting this certain way is pathetically, annoyingly shallow.\\n\\n\r\nArt is mediocre!! The art of the characters look like a ripoff from different animes. There's no distinct attribute that make them look unique and exclusively from this anime.\\n\\n\r\nCharacters are lame and lacks development.. A typical, weak, martyr \"hero\" who risks his life to saves a girl and decides to follow her to a magical world along with his friends, to run away from his problems in the real world.. my definition for this type of character, an idiotic coward. A fake girlfriend/childhood friend=powerless, tsundere damsel in distress. A delinquent looking friend with a sister complex. The magical, gun-wielding heroine with a brother complex, who later is reduced to a supporting character (she loses significance later on. She might as well be invisible). And lastly, the jealous younger brother who perceives that an honest to goodness street accident was an attempted murder by his \"hero brother\", going to great extent to get his revenge also because the brother \"stole\" everything from him. SO SHALLOW and DUMB!! BTW, their powers are ordinary and lack originality, to the point that the concept is dumb.\\n\\n\r\nOverall: dreadful, boring, weak, mediocre, confusing. STAY AWAY FROM THIS!! Pile of crap and a waste of time!\\n",
            "date": "2014-03-07T05:47:00+00:00",
            "helpful_count": 15,
            "mal_id": 134957,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1132457.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/jbeat",
                "username": "jbeat"
            },
            "url": "https://myanimelist.net/reviews.php?id=134957"
        },
        {
            "content": "Well ,I'll be totally honest about this anime ,it's one of the biggest deception I had in my otaku life.Why? Is it the story? The characters? The art? No, no and no.Actually all of those point are good ,really.\r\nI know it's bad to spoil in review ,so if you really want to see that anime don't read me.But if you're hesitant please read me because I have to warn you about one thing.\r\nStory : Okay ,I'll admit it ,the story is a cliche.The plot sound different but you'll find all the elements for making a classical shonen.Magic war ,a stupid MC which a big heart,a strong will ,a desire to grow stronger for his friends ,and of course girls ! Girls with big boobs (or kind of) and big crush for this stupid MC (which ,like all the time ,will never understand anything about that and stay dumb like all MC of this type.).But in the big line ,the story is really interesting ,looks like there is a lot of mysteries,factions fighting for power, a love triangle ,a new magic war is coming ,,the big bad boy is finally back with his badass magic of the doom ,a strong rivalry between two brothers lead them to fight and...CLIFFHANGER !! Yeah ! That's exactly how this anime end ,with a fucking cliffhanger.The last episode end with a lot of unanswered questions ,even more questions asked and nothing.It end.Like that.That's all.What? Want to know what the fuck happened? Who's really that big bad guy? Why all those plots around the two brothers?You really want to know that?...Me too.\\n\\n\r\nArt : The chara design is ,for me ,really nice and pleasant.It's colored ,warm ,well animated ,the characters are nicely done ,the fighting scene are fast paced and dynamic.Yeah ,I think that the art is the best part of this anime.\\n\\n\r\nSound : The opening is not really my cup of tea but it's a nice song.The anime ost is ,for it's own ,pretty good I think ,some great songs are put in the backgrounds sometimes ,turning some classical scene into something a little more epic/dramatic.\\n\\n\r\nCharacters : Classic ,cliche ,seen again and again...But for my own I never turn tired of this kind of characters.The MC is ,as usual ,stupid but have a strong will like I said ,it's the perfect Shonen hero type.You have the childhood friend secretly in love for this idiot ,the new girl without which all the anime can't start and which will fall in love for this idiot too (turning it into the classical love triangle) and the MC useless ,but funny ,best friend.Add in the middle of that a black haired dark-emo big brother with dark ice power, a loli who actually...Well I don't know what she's doing here really but I don't care ,I love loli ! ..Emmm ,a badass with badass power of the doom of the death (I'm sure this one made some 13yo little boys erect for his power).Anyway ! Cliche ,but nicely done ,so it's not a bad character choice.\\n\\n\r\nEnjoyment : Well...How can I explain the pain?...This anime have 12 episodes.Yeah...12...Just 12.And as I watched the 11 first episodes I was totally in the story ,I was like \"Oh god !\" \"Awesome !\" \"Wait what?...\" \"So it was...Oh god it is !\" and all.The story was awesome ,the plot catch me episode after episode ,questions started to form in my head.I wanted to know about that and that and that.I have watched the full series in one shot.Spend a full night for that but I watched it.And finally I came to the episode 12.And at the end of this episode I was like \"What.The.Fuck.\".Why? Because it's not an ending episode ,it's just a normal episode ending with a cliffhanger ! I've searched for an episode 13 or a season 2 ,or an OAV.But no ,it's over at 12 ,and 12 end with no answers ,new questions ,a big mind fuck and ,for my own ,a strong feeling of disappointment and...a sensation that I've lost a night doing nothing.\\n\\n\\n\r\nConclusion : Take care watching it ,it's interesting but it's a totally unfinished anime with a not-ended plot.",
            "date": "2015-03-01T00:46:00+00:00",
            "helpful_count": 15,
            "mal_id": 181437,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4486047.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dai_Kina",
                "username": "Dai_Kina"
            },
            "url": "https://myanimelist.net/reviews.php?id=181437"
        },
        {
            "content": "This show is such a train wreck it's not worth a full review. Here's a shortened version for your convenience (and mine):\r\nStory: 0/10\r\nHow can someone rate 0 on a story? Well, it's simple: the whole show is a buildup for season two, and explains about fuckall. A few minor characters get some background exposure, but even that is poorly executed and overall uninteresting. The end is an absolute mess. The character development is so absent it often times feels like characters are going backwards in development, getting tricked several times in a row by the same lies and tactics.\r\nIt's worth 0 simply because it isworthless.\\n\\n\r\nArt: meh/10\\n\\n\r\nI'm not a big art guy. This was so uninteresting to look at that I spent most of my time looking at my fortress on dwarf fortress. I know I didn't find it particularly good, and other people seem to have noticed that it's inconsistent, uninspired and possibly even just a knockoff of characters from other shows.\\n\\n\r\nSound: forgettable/10\\n\\n\r\nI don't remember a single song from the show. I don't care much about voice actors, so I can't really judge them; but it sounded as standard as it gets.\\n\\n\r\nCharacter: -2/10\\n\\n\r\nSweet lord in heaven, how can a show about magic have such weak main characters?  All the main characters get defeated over, and over, and over again, to the point where you wonder what the hell they've been learning in their high school and when their teachers are going to start teaching them how not to suck at life 101. Towards the end the sensei to end all senseis steps in and teaches the main character to actually use magic in about three days (after him theoretically learning it for a year). Suddenly the main character can move faster than someone teleporting. Seriously, what a mess.\\n\\n\r\nI actually feel like expanding on this topic.\\n\\n\r\nWhat do we have as the MC crew?\\n\\n\r\nHere's a short breakdown:\\n\\n\r\nA guy who uses evasion magic. Which theoretically means he should never get hit, yet gets his ass handed to him by physical blows he could've easily avoided every other minute.\\n\\n\r\nA girl who uses illusion magic. It somewhat feels like the only reason this is a thing is for the obvious sexual innuendo the people creating this show could cram into this concept. Fanservice galore for a few episodes, and then they completely forget that she's a witch for the rest of the show except when someone needs a bit of healing (even though I've never seen her heal anyone all the way to recovery). Great move, whoever made this.\\n\\n\r\nA guy who uses destruction magic. I'm sorry, I meant to say a guy who uses self-destruction magic. He's so bad at it that the only thing he can do right is give his magical powers to the first mc so they can have a nice little deus ex machina moment every few episodes. You'd expect him to get better at it after practicing for a year, but his improvements are so subtle you could be forgiven for not noticing.\\n\\n\r\nA girl that uses a pistol to shoot fire. Oh, and I can't remember a single instance where she actually defeated an enemy, even though she was technically more powerful than anyone else in this crew.\\n\\n\r\nAnd because you can't have generic without a harem, both girls love the first mc, even though he's completely oblivious to it. Props to the makers to actually make the MC oblivious all the way to the end, and not actually revealing it to him. I, too, believe character development is grossly overrated.\\n\\n\r\nEnjoyment: 5/10\\n\\n\r\nHey, my dwarves managed to beat a human to death using nothing but their bare hands, hence avenging their fallen comrades from the madness of the wereiguana, while the show was playing in the background. Now *that's* entertainment value. This show is made for background playing: it's usually very slow and relevant sections are short and far in between. Except for the last episode, which makes me question the sanity of whoever thought this plot was a good idea. I enjoyed watching my fortress while some really contrived plot was happening off to the screen on the side.\\n\\n\r\nOverall: 3/10\\n\\n\r\nThis show proves that it is possible for the ending of a series to retroactively make the rest of the series bad. If I had to rate it after 2 episodes, it would've been an 8. If I had to rate it after 6, it would've been a 6. At this point I wonder if I really want to give it a 4 or I should just go with a nice, fitting 2 or 1. If you want a good dumb, action-oriented show where you can just turn your mind off for 12x25min and enjoy some mindless action, do yourself a favor and avoid this like the plague, because even the most brain dead person on myanimelist would have a hard time arguing this show has entertainment value at all.",
            "date": "2014-07-26T19:43:00+00:00",
            "helpful_count": 13,
            "mal_id": 153857,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/invalidcharacter",
                "username": "invalidcharacter"
            },
            "url": "https://myanimelist.net/reviews.php?id=153857"
        },
        {
            "content": "Mahou Sensou or Magical Wars really does have a good premise. For those who are interested in fantastical settings with some sort of ongoing war, (obviously just from the title), then this a good show to sit through.\r\nOr so I thought.\r\nYes, I enjoy fantastical settings and I didn't put much expectation into this series while I was beginning to watch it. I was just looking for a show to watch before the fall anime season begins. \r\nAnyhow, to be fair, this is adapted from an ongoing light novel series, which would explain the choppy storytelling. There are a few gems with this types of lightnovel turned to anime but I don't include Mahou Sensou in this category.\\n\\n\r\nFirst of all, there is a lack of depth with the story. Again I stress that the premise of the story is good. In fact it is interesting, but the anime was unable to expound further. There is a lack of exposition of the characters; what I want to say is that, these characters were not flesh out enough.\\n\r\nBy the last half of the series, you would expect that there would a resolution, or a closure, but there is none. Mahou Sensou leaves you very hanging and there is a gaping sense about why did the studio decided to end it that way? Seeing that there are currently 8 volumes published in Japan, I think that there is enough material or sufficient material to draw from. Unless of course the studio is planning for a second season in the event that the BD and DVD sales are good.\\n\\n\r\nSecondly, the animation is a bit off. I enjoy the scenes were the characters start casting their magic and the magic circles appear but other than those, some scenes are just not right.The budget is low for the animation aspect but for the ending sequence, it was very good. Normally I would immediately end the episode once the ending song starts playing but I watch the entire episode until the very end so as to watch the ending sequence.\\n\\n\r\nI may not be an expert when it comes to music but I find the opening and ending songs quite good. Also, the background music was enjoyable. There seiyuus were good in conveying their characters. It's just disappointing that the characterizations aren't enough.\\n\\n\r\nOverall, I won't watch this series again. It's a good enough to while away the time if you have time to spare.",
            "date": "2014-09-16T22:32:00+00:00",
            "helpful_count": 13,
            "mal_id": 160675,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4103415.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/napoli_fiore",
                "username": "napoli_fiore"
            },
            "url": "https://myanimelist.net/reviews.php?id=160675"
        },
        {
            "content": "Mahou Sensou (Magic Warfare) Is one of those animes that  has a lot of potential but also poorly executed. The plot and idea isn't bad but when you put a bunch of generic characters with less then nothing in character development. its a recipe for disaster  If it had 24 episode it might have been better, but who knows. \r\nStory: I think the idea and plot is good, magic academy training students to fight evil, brother rivalries, and untold secrets. However they rushed everything within 12 episodes. Which caused it to end up not being really good because it brought in more plotholes and unanswered questions....that will never be answered 3/10\\n\\n\r\nArt: The art is decent and the animation is nice nothing too special. I'll give it a 4/10\\n\\n\r\nSound: The sound was ok, I don't really know what to say for the sounds...however, the ending song is very nice. It is probably one of the only good thing that came out with this anime lol.  5/10\\n\\n\r\nCharacter:  Generic heroine's, Generic villains. Nothing that really needs a explanation. The first 3 episode is already self explanatory about the characters. 3/10\\n\\n\r\nI did not enjoy this anime. However, my motto is once you start a anime you must finish it. Each episode felt like a stab in chest. I didn't even know what was going on in some parts of the anime due to the fact there were a lot of skipped time lapses. There went  264 minutes of my life....\\n\\n\r\nI highly do not recommend this anime unless you like to watch this kind of  stuff with plot holes with a  wtf ending. Nevertheless if you have spare time or nothing else to watch than maybe you could check this anime out for yourself.",
            "date": "2014-04-02T21:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 138405,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3338737.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/masterofthebaits",
                "username": "masterofthebaits"
            },
            "url": "https://myanimelist.net/reviews.php?id=138405"
        },
        {
            "content": "Well, to start out, this anime wasn't exactly what I'd call the best of Winter 2014 or anything like that. But at the same time it wasn't all that bad, if you could look past the weak story.\r\nArt:\r\nIt's art was ok. Still nothing special. I was able to get through the entire anime somewhat because of the characters designs, making fun of them, and calling Takeshi \"No Nose\" at some points do to the direction he was facing.\r\nSound: The sound was, in my opinion, the best thing about this anime, so if you can't watch it, at least put headphones on, sit back and listen.The ending was the closest thing to \"Best of Winter 2014\" material. \"Born to be\" is a really up tempo rock song and became something I listen to almost weekly. I can't say the same for the opening though.\\n\\n\r\nCharacter:\\n\r\nLet's just say, they were as good as the story itself, and I don't want to repeat .\\n\\n\r\nEnjoyment:\\n\r\nI got a few smiles in and a couple \"oh, that's cool\" remarks about this anime. It was good enough to let me finish to the end. Although the thing that changed this for me was the LAST EPISODE. \\n\r\nReally, the last episode was really REALLY good in my opinion, and left a cliff hanger making one think something like \"WHAT, WHY DID IT END THERE\" because it literally just stops and goes to the ending without any hint of what might happen in the next season other than the fact Takeshi (the main character) is stuck in the past and he'll confront his brother Gekkou at sometime.\\n\\n\r\nOverall:\\n\r\nAltogether, I thought this anime was pretty enjoyable. It wasn't great, but it wasn't all bad either. All I really want to say is, the author of the Novel better get a better pace going. It's too quick and weak.\\n\r\nI can't really say to watch it or not considering this was a really weak \\n\r\n7 Rank\\n\r\nfor me but, if you can, try and watch Mahou Sensou. It's ok.",
            "date": "2014-03-27T13:41:00+00:00",
            "helpful_count": 11,
            "mal_id": 137269,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2653247.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/WindBreaker",
                "username": "WindBreaker"
            },
            "url": "https://myanimelist.net/reviews.php?id=137269"
        }
    ],
    [
        {
            "content": "A cool thing about the internet is that it has allowed everyone to become a content creator. While access to mass media and print publication was once closed off to all but society’s most privileged, we now live in an age where anyone with an Internet connection has access to an audience of literally millions. This seems like a weird way to open a review for a show that was broadcast on four different Japanese TV channels, licensed by Sentai Filmworks for a North American Blu-Ray release, based on an ongoing series of light novels with 8 volumes in print as of this writing aswell as a manga adaptation in Monthly Comic Gene magazine, so let me tie them together: Mahou Sensou reads like somebody’s DeviantArt fanfiction.\\n\\n\r\nI’m not saying that free digital publication is a bad thing—it’s given us some of the greatest contemporary works of art and literature—but I AM saying that unskilled, unrefined content creators are published right alongside the hidden geniuses, and Mahou Sensou has a lot more of the former than the latter. If you’ve ever been on DeviantArt (and if you’re on an anime website, it’s a pretty good bet that you have), you know exactly what I mean. The show’s very title is a microcosm of itself, and represents about as much effort as is present in the rest of the show. “Mahou Sensou” probably sounds like it’s something pretty cool, if you don’t know any Japanese, but it’s the blandest, most basic title imaginable. There’s wars! And they’re fought with magic! MAGIC WARS. That is so cool, if you are twelve. It sounds less like fantasy-action series and more like a specialty Lego playset, except the Legos encourage imagination and creativity and can be enjoyed by all ages.\\n\\n\r\nMahou Sensou opens with a foreboding, post-apocalyptic urban landscape and some dramatic conflict between two siblings. It then immediately cuts to a more mundane setting with a similar inter-family conflict featuring our hero, ordinary high school boy™ Takeshi Nanase. I could say that the parallel of these scenes and characters is deliberate, but I get the feeling I’d be giving the author far too much credit. In any case, it is summer break, but Takeshi is off to school anyway to escape the immense pressure of his home life, which seems to consist of his brother and mother staring at him silently while all the lights are turned off. At school Takeshi runs into his doting childhood friend™ and pretend girlfriend Kurumi Isoshimi (the circumstances of their relationship are explained later, and are as convoluted as you’d expect them to be, so I won’t get into the details—if I examined every plot hole this review would never end). Shortly after Takeshi meets a mysterious otherworldly girl who falls from the sky™, Mui Aiba, and she drags him into her ongoing conflict with four equally mysterious and otherworldly assailants. Also Takeshi’s cool friend™ Kazumi Ida shows up, I guess because we need an even four protagonists? The provided reason is he’s there for remedial classes, but again, there’s nobody around but Main Character, Girlfriend, and the mysterious otherworldly folks. We’re not even halfway into the first episode and this already feels less like a television-ready product and more like a clumsy first draft. Not even a first draft. More like a bullet-point list of story notes.\\n\\n\r\nWell, anyway, the long story short is that MC, Girlfriend, and Cool Guy all get dragged into magical combat (perhaps you would even say…a war?? A magic war, perhaps????), and by the rules of this universe, being exposed to magic makes you a magician. There’s several different rigidly-defined, mutually exclusive classes of magic, each of which is carefully explained in detail both by the Mysterious Assailants and other characters through unnecessary expositive dialogue over this episode and the next, and whichever one you get to use is apparently random.  One of the assailants shoots magic bees and, shortly thereafter, nonlethally explodes. The explanation given (again, through expositive dialogue) is thus:\\n\\n\r\n1.\tA long time ago there was a big MAGIC WAR. To spare the non-magicians from getting caught in the MAGIC CROSSFIRE, a group of MAGICIANS using MAGIC split the world in two.\\n\r\n2.\tThere are two worlds, the “living world” and the “ruined world”, and the ruined world is where the MAGIC WARS continue to this day.\\n\r\n3.\tThe Ghost Trailers—the bad guys—want to keep doing MAGIC WARS in the real world (I think? It’s been three months and I watched 32 shows. Go easy on me.), but the good guys—Wizard Brace—want to protect non-magicians.\\n\r\n4.\tWizard Brace cast a spell called “the gift”, by which if you use MAGIC to do MAGIC WARS in the living world, you nonlethally explode and you can’t do MAGIC any more.\\n\\n\r\nThe point of exposition is to answer questions, but all this does is raise them. If you can’t do MAGIC WARS in the living world, and you become a magician by being exposed to MAGIC, where do magicians even come from? Is a propensity for magic genetic? Clearly not, since (spoiler alert) Takeshi’s mother is a highly skilled magician, and Takeshi has no skill until after Mui converts him.  And furthermore, how was he converted in the first place? Mui shoots MAGIC from her MAGIC GUN at least twice, and the mysterious assailants, while also wielding more mundane, non-magical weapons such as Great Big Anime Swords, also use magic attacks with absolutely no ill effects up until MAGIC BEES gets penalized for it. And if Wizard Brace wants to keep non-magicians away from the MAGIC WARS, what was Mui doing in the living world in the first place? It would be one thing if she was pursuing the Ghost Trailers to stop them from doing their EVIL MAGIC, but they were chasing her. We’re barely two episodes in and the show is already a clusterfuck.\\n\\n\r\nI’ve already given the plot synopsis three paragraphs and a numbered list, which is probably more than the author gave it, so I’ll sum up the rest quick. When the battle ends Mui takes Takeshi and friends—all of whom have been converted into magicians—to the “ruined world”. They are given the choice between being sent back to the living world with their memories of the past several hours wiped, or to move to the ruined world—leaving their lives, friends and families behind—and enroll in MAGIC SCHOOL to become soldiers in a MAGIC ARMY to fight MAGIC WARS. All three of them agree to this with literally less than a minute of deliberation. Okay, so we’ve established Takeshi is an angsty little whelp who doesn’t like his home life, but what about the other two? We even learn later on in the show that Kazumi is the sole caretaker of his younger sister. (She also becomes a magician, because Kazumi blows up their apartment, with magic. He doesn’t get Gifted for it though.) None of these kids think twice about leaving behind their real-world obligations to do MAGIC in MAGIC WORLD, and after the second episode they practically never look back. \\n\\n\r\nI’ve spent more words on the story than it deserves, and I haven’t even gotten into the deepest plot holes or the most trodden clichés like Takeshi’s Big Magic Anime Sword or how the Magic School actually works or Takeshi’s family drama or, as previously mentioned, his fake relationship with Kurumi. And I’ll avoid going into much further detail, but it’s worth mentioning that Mahou Sensou literally ends on a cliffhanger. Things appear to be wrapping up in the penultimate episode, but the finale dumps a ton of unbidden plot twists on the audience out of nowhere and then ends abruptly without resolving any of them. Which is especially bold, considering how even these twists fail to make me interested in seeing the plot actually get resolved.\\n\\n\r\nThere’s so much more to talk about. Let’s talk about the animation. Let’s talk about how Madhouse is the living contradiction of simultaneously being perhaps the best and worst animation studio in Japan. Madhouse did Monster, Nana, Dennou Coil and Kaiba, but it also did Chaos;Head, Photo Kano and this. Madhouse shows are either a brilliant, innovative feast for the eyes or they are garbage, and nothing in between. You can see traces of brilliance, like a good animator walked into the wrong room: the ending sequence is interestingly directed and fluidly animated, with excellent use of colour and composition that isn’t to be found anywhere else in the show. The director of Mahou Sensou is about as well-read on film as its author is on story structure. Every shot of Mahou Sensou, besides the aforementioned ending sequence, is boring at best and obscure and difficult to look at at worst. The colours are flat, desaturated and depressing—it could be an attempt to create atmosphere if not for the fact that literally every shot is like this, even when the show forays unsuccessfully into light-hearted rom-com. The animation itself is…not good. Frame count is low, characters are frequently off model, and it often seems as if the animators are trying to restrict movement to conserve the budget.\\n\\n\r\nSo if not to the animation, where is the budget going? The voice cast’s salaries, most likely. The casting choices for Mahou Sensou are bizarre, to say the least. It’s a late-night anime with lots of cute, moe girls who adorn the covers of the original light novels, but most of these girls are brought to life by B-list seiyuus with limited résumés. They’re not bad, per se, but they’re not very good, either. Of course, you could say; Mahou Sensou is hardly an A-list show, so it’s not like they’ve got the budget for A-list voices…until you take a look at the cast of the male characters. Mamoru Miyano! Kenichi Suzumura! Toshiyuki Morikawa! Jun Fukuyama! Truly, the night was dark, for all the stars were in Mahou Sensou. When I heard Miyano’s voice uttering some of the first lines of the show I couldn’t believe it. He’s got some of the most recognizable pipes in the industry, but I had to double-check to make sure it was him. Takeshi is the blandest, flattest, most forgettable male lead in recent memory, in a show that is for all intents and purposes marketed towards straight men. His lines could have been delivered by a carefully-trained parrot and the show wouldn’t be any worse for it. Why shell out the cash for Miyano? It’s not like he really brings his skills to the show, by the way. Miyano in Mahou Sensou is not Tamaki Suou or Light Yagami or Rin Matsuoka. He’s…really not very good at all. I know he’s got more talent than he expends here, so he’s either giving exactly as much effort as Mahou Sensou deserves or the show’s voice director is sleeping on the job. The same goes for just about everyone else—Suzumura’s affected Osaka-ben is grating and Morikawa sounds completely uninterested in anything at any time. Jun Fukuyama actually delivers a totally competent and acceptable performance, but he’s not in the show much.\\n\\n\r\nThe show’s soundtrack is where it truly shines, in that it is thoroughly average instead of being subpar or outright bad. The opening theme by FictionJunction veteran Yuuka Nanri is a generic chamber-pop number—her vocal work is certainly impressive, but the song lacks anything to keep it from being just another fantasy anime theme. On the other hand, the ending theme is quite good. Nano is one of a wave of utaites-turned-major label artists that have emerged in the past several years and, like many of their fellows, brings a breath of fresh air to the previously stale and stagnant anisong industry. “Born to be”, Nano’s contribution to Mahou Sensou, is catchy and powerful, with a meaty bassline and just enough pop in its pop-punk to avoid giving the impression that it’s taking itself too seriously. The song features lyrics in both English and Japanese, and as an American expat Nano’s pronunciation is flawless (not that I’d fault them if it wasn’t, because English is fucking hard). The lyrics, while technically grammatically correct, are corny as hell, but it’s not like anyone goes into anime music expecting Sufjan Stevens, so it’s totally forgivable.\\n\\n\r\nIn addition, Nano’s vocals are featured on a few tracks by series composer Masato Kouda. Kouda is already an accomplished composer, known for his work on Devil May Cry and Monster Hunter, but Mahou Sensou was my first exposure to his work. It’s not bad; one or two really good tracks, a few really bad ones, but mostly in-betweeners. Worth mentioning is “NEW WORLD” (which might not have actually been in the anime proper—it’s labelled on the tracklist as “soundtrack version”, but it’s worth listening to regardless). It moves seamlessly between uplifting orchestral instrumentals, to Nano rapping in English over an electronic beat with piano accompaniment, to a bouncy disco string section. It’s less than two minutes long, but it’s a great track—too good to be stuck in Mahou Sensou, probably.\\n\\n\r\nAll that having been said (and if you did read all of it: thanks!), I’m about to say something that might blow your mind. It’s true that Mahou Sensou is objectively and subjectively of poor quality; amateurishly written, amateurishly animated, amateurishly executed in every way. And I would not say that it’s “so bad it’s good”, or that I really gained any enjoyment out of watching it at all or that my life was enriched by having experienced it in any way.\\n\\n\r\nBut I would like to see more bad anime like Mahou Sensou.\\n\\n\r\nLet me clarify: in a perfect world, I would not like to see anything of Mahou Sensou’s quality at all. I don’t want to see more bad anime, but when you watch as many silly Japanese cartoons as I do, you get exposed to a lot of shit just by the fact of Sturgeon’s law. But I would rather watch Mahou Sensou a dozen times than sit through Wizard Barristers one more time. I would rather watch Mahou Sensou a hundred times than sit through even one episode of ImoCho.\\n\\n\r\nMahou Sensou is bad, but it didn’t make me angry. I did a lot of rolling my eyes and laughing out loud in disbelief at how utterly cliché and ridiculous everything was, and I often wondered how the show could have such little self-awareness, but never—not once—did I feel genuine malice towards anyone involved. Mahou Sensou did not offend me, and although I’m certainly none the richer for having experienced it, I don’t feel much poorer either. For as long as there are nerds, there’s going to be anime, and as long as there’s anime, a lot of it will be shit—but I want more of the shitty anime to start taking a page out of Mahou Sensou’s book. It’s bad, but it’s somehow cute, in that I get the feeling that it’s written by someone who is very young, or at least inexperienced. Whoever wrote Mahou Sensou has very little knowledge of literary structure, conflict, storytelling, or even how the real world or real people work. No one in Mahou Sensou is a real person, they are a walking list of tropes, recycled and regurgitated from a thousand anime characters before them. Things happen in Mahou Sensou not to progress the story or the characters, but because they are cool, or they are well-trodden anime clichés. It’s bad, but for some reason I want to pin it up on the fridge.\\n\\n\r\nI’m not saying it’s totally innocent. There are a handful of weird moments of objectification scattered here and there—for some unexplained reason, the first time Kurumi uses magic, her breasts expand (this never happens again), and I can recall at least one very clichéd “the hero walks in on the heroine in some manner of undress” scene. But these scenes are relatively quick and painless, and feel more like the author felt obligated to throw them in because that’s just something that HAPPENS in anime, rather than because they feel any actual antagonism towards women. It’s true that the female characters are undeveloped and two-dimensional, but so is literally everyone else. The last chunk of the show is a very tired “damsel in distress” arc, but Kurumi has at least a little agency while being held hostage—much unlike Sword Art Online’s revolting, misogynistic mess of a second half. Everything about Mahou Sensou feels like it was written by a child, and while that means it’s of very poor quality, it also means theres nothing cruel or mean-spirited about it, overtly or otherwise. I almost feel bad talking trash about it, because it definitely doesn’t WANT to make me feel bad feelings, and I’m pretty sure it’s doing the best that it can.\\n\\n\r\nSo would I recommend Mahou Sensou? No. Absolutely not. There is nothing you stand to gain from the experience of watching it. It might not be malevolently bad, but it’s still bad, and everything about it is poor. However, I would make the following to anime producers: instead of maladjusted adult men with a deeply-rooted hatred of women, might I suggest turning to thirteen-year-olds to write more anime scenarios? Fresh, new talent could not possibly hurt the industry.",
            "date": "2014-03-28T20:39:00+00:00",
            "helpful_count": 304,
            "mal_id": 137645,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/134590.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/kindergraph",
                "username": "kindergraph"
            },
            "url": "https://myanimelist.net/reviews.php?id=137645"
        },
        {
            "content": "Watching Mahou Sensou (Magical Warfare) is like finding out you just got arrested for something you didn’t even do and get put for jail for it. Confusion is the first word that will come to mind but then comes the anger phase and regret. The term ‘regret’ isn’t for feeling sorry for yourself but rather as how could a show with a tolerable premise can sink to a defiled piece of work. Not that expectations were high coming into this show but Mahou Sensou is an excuse of a damnation. \r\nMahou Sensou translates to Magical Warfare. As the name implies, the series adapts magical themesinvolving various spells in an ongoing war. The war involves a group of magicians going against beings known as Ghost Trailer from another world.  We learn from the first episode that Takeshi Nanase has some sort of mysterious power that allows him to fight on par against some of the magicians in his world. Of course, this doesn’t happen after his life gets turned around forever. Nonetheless, he gets caught in the frenzy when a young girl named Mui became a target by the Ghost Trailers. It’s probable to guess what happens next as Takeshi tries to play the role of a hero and attempts to save her. Not only does this sounds like a trite formula of a typical magical series, it makes little sense at first. Everything happens too quickly as well as all at once. As time goes on, the series attempts to explain itself regarding both worlds, its histories, characters, and everything else in a fashion to hopefully draw viewers in. Unfortunately, it just doesn’t fit right.\\n\\n\r\nThe plus side is that the initial episodes blasts off in a quick fashion with the action and drama with little time to waste. Not only does it immediately get to the point with the conflict but it also brings together most of the main characters together in a dilemma that ties with the premise. But here’s the main problem: the pacing. It’s not just rushed but also inadequate. How would you explain a normal boy who resents his family for unknown reasons at first able to fend off a guy nearly twice his size with a large sword? From minute one to the credits proves the show is gimmicky clustered with cliches, gags, and senseless characters. It’s like a hornet nest with everything dancing and flying at once.\\n\\n\r\nCharacters in this series ranges from the typical small girl Mui to the more fashioned beauty known as Kurumi Isoshima. The latter is known as a stunning beauty at school but more importantly as Takeshi’s ‘fake girlfriend’. Despite the two pretending to be a couple, it’s obvious that Kurumi might have genuine feelings for her “boyfriend”. There’s also the best friend of the main protagonist, Kazumi Ida, a stereotypical delinquent that comes with the spiky hair, tough personality, and carefree attitude. None of these characters appeal to each other in any way. The worst of them might be Takeshi Nanase who sees to possess no personality. On the surface, he is a caring friend but often is indecisive over various matters. Only does trouble comes will he resent to dramatic action. Trouble comes from the Ghost Trailers whom serves as the main antagonists. They are presented as the epitome of stereotypes with their crafty looks, egoistic attitudes, and cheesy ambitions. Forget characterization. The Ghost Trailers don’t have a ghost of a chance for admirable attributes.\\n\\n\r\nDrama takes in the form of family affairs and conflicts. It serves as a degeneration of a happy relationship because of circumstances. For Takeshi, it’s related to his younger brother Gekkou. Through flashbacks, there’s a clear problem with the boy because of his obsession towards a certain character. It’s an establishment for a bomb to explode soon between family manners. And of course, it does through actions in the way of magic. The way the series progresses this also lacks depth because of its basis. It’s clear as day why Gekkou’s behavior is seemingly justified by his actions. The show doesn’t even need to explain itself because of its clichéd angles. It’s saturated with lifeless emotions because of the weak persona through its characters. The characterization of the main magicians also lacks depth with their purpose. Everything just feels if they need to be there with no sense of morality. It fails to make its point with its collection of platitudes.\\n\\n\r\nAs with the concepts itself, mechanics of this show demonstrates some credibility. This is set by the standard of Subaru Magical Academy where students learn magic. It’s a place where characters like Takeshi, Mui, Kurumi and others train to perfect their skill as magicians. On the surface, it touches the basics of magic at a fundamental level. However, everything feels like it progresses far too quickly with its generics. The way magic is acquired is explained in simplicity despite the complex nature of some spells. From the first episode, we witness how our main characters acquire their magic with a taste of fan service involving Kurumi’s enhanced breasts. Besides catching the attention of others, the magic itself is only attractive by its effects rather than its execution. What I mean here is the way how some spells seems be blend to the core with their usage. On a more bright side, the series does focus on training sessions including a magical examination. In essence, it does maintain some degree of trustfulness with this show’s product.\\n\\n\r\nUnfortunately, the romance aspect remains almost tasteless. There’s a lack of chemistry between the main characters. This mainly is focused on the love triangle going on between Kurumi, Mui and Takeshi. It follows an endless cycle of stages with the first stage being misunderstanding, the second stage explanation, and the third seemingly nowhere. Kurumi also gets herself involve with other male characters. We don’t see much progressing between her and them because of her own insecurities. Again, the pacing issue of a one-cour show also plays a role in downgrading Kurumi’s relationships. Furthermore, the chemistry she has with any of the characters just seems lackluster. She’s like a Barbie doll that everyone wants to buy. Her Ken is Takeshi.\\n\\n\r\nOther flaws in the show includes a weak building structure connection both the real world and the magic world. Although it explains itself somewhat with the past and ancestries, the show neglects to explore them in depth. For fantasy writers, a show should demonstrate a decent degree of its world qualities. Unfortunately, this show is not one to serve as an example of that. However, this show does show examples of fan service. Although it doesn’t reach ecchi levels, the clichés reaches its point with swimsuits, compromising positions, and clothes torn by battle damages. The construction of its premise also hardly sounds original with the stereotypical Big Bad wanting to conquer the world and purify its worthless inhabitants. Wait, I heard that somewhere before…\\n\\n\r\nThe artwork would be appealing if it demonstrated an imaginative atmosphere. A world with magic and fighting wars between each other sounds attractive but the artwork is not. Character designs are blend and focused mainly on their stereotypes rather than who they actually are. The Ghost Trailers are hardly charismatic either with their lack of personalities. Everything feels forced with their lifeless expressions. Background artwork offers some degrees of admiration although it only ties in with its main themes. The only artistic attributes I find are perhaps the spells as they do offer degrees of diversity. They connect with the magical themes of this show with some degree of limited thought.\\n\\n\r\nOut of all the technical aspects, soundtrack is probably the strongest factor coming from this show. To say the least, the OST is catchy with its hard rock tone and techno-like sensation. It actually connects with the dramatic scenes involved with the battles. Characters also demonstrates their voice mannerisms decently whether it’s feelings of anguish, fear, happiness, regret, solitude, or egoistic.  The OP song also has its mood done right despite some of the magnetic movements. Focus should be bought forward to this show’s soundtrack aspects if you decide to get into this show. On the other hand, characters such as Takeshi lacks enthusiasm with his voice while others just feels lifeless. \\n\\n\r\nMahou Sensou is not just an underwhelming show but is exactly what you’ll expect. Its predictable plot is almost laughable with rushed scenarios, weak characterization, and conglomeration of cliches. It’s shameful that a show with the concept of magic can turn into this cluster of weak thoughtlessness. What you may expect is what you will get in the form of poor writing, romance cliches, thoughtless characterization, and farcical development. Despite the way this show originally set its family feuds into motion with darker aspects, its executions is stale and atrocious. Rather than evoking excitement, it spawns boredom with no redemption. If you really want to check out this show, then be prepared for a magical tale of mediocrity.  \\n",
            "date": "2014-04-11T00:39:00+00:00",
            "helpful_count": 162,
            "mal_id": 139519,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=139519"
        },
        {
            "content": "The phrase of \"Dont judge book by its covers\" is really true. When we all seeing the short explanation by this anime, we're gonna imagining something great, magnificent, epic battles and stunning art. But in the end it was all just an illusion. Illusion that been made by this anime, summary we're being deceived.\r\nMahou Sensou or Magical Warfare is anime that technically is about action and magic like the genre has said and thats it. If we're talking about plot, it hasnt. Well, at the first you would introduce that the world has two side world, first it was human world and the other oneis wizard and whatever world. Then, somehow without any logical thinking, our MC is choosing to live in magician world just for helping one girl and moreover its the first time that they meet.\\n\\n\r\nThe first time i watch this, i cant help to feel cliche and so pushed. Like one scenes that i said before, the MC is choosing to live in magician world just because he cant enjoyed living in his own house and feel urge to save someone he just met. Being heroic, is probably one of the good aspects that the MC must have but realistically speaking, even the stupid people would think twice to risking their live just for saving people. If the this MC called Takeshi have a good reason for it, then it doesnt matter but honestly all of the reason that he give is kinda illogical and another kind of illogical things is how kendo sword that been made wood is capable of fending off a real blade and moreover its a steel one. Oh god. \\n\\n\r\nAside from logical thinking, another things that quite funny is how easily people can be affecting to use magic. I mean, in this anime the MC or Takeshi is a normal human being and the second later he become magician just because Mui Aiba (the heroine) using magic near of him. Its like \"you want to be a magician? then come here i will use my magic and you would become magician! yeah!\"\\n\\n\r\nMoving on to the art section, this is probably the worst aspects that this anime have. For anime that been adapted by Madhouse studio the one who brought you Hunter x Hunter (2011), this anime's art is really horrible for anime that airing in 2014. First how the characters design isnt consistent. When watching this, i cant help to notice that in every scenes they draw the characters so badly and something that doesn’t bode too well for an action/fantasy series such as this. Like sometimes, the face looks so awkward like it bents to the otherside. \\n\\n\r\nAnother things that probably being controversial is how the character design is like from fate/series. In the opening song, you would see like a white saber with that armor and things, then there is this blonde guy called Kazumi Ida who is looking so similiar with Gilgamesh. For anime that been made by a big studios called Madhouse, surely this one is such a big failure.\\n\\n\r\nAfter all that, there is one thing that atleast \"normal\" and so so. It was the sound. There is nothing to much too mention in this term. Good things they have Mamoru Miyano for voicing Takeshi, as usual he did it well and really fits with the MC. For other seiyuus, they did well though i believe it wasnt something special. The one i like from this anime is the ED. Nano with their \"Born to be\" song is so epic, their fastbeat and energetic song makes this anime looks so epic though it wasnt happen. Such a shame.\\n\\n\r\nLast, the characters. The explanation that i said before maybe give you a glimpse about the characters in this anime. First, we have a \"heroic\" MC called Takeshi which is have a justice feeling and prepare to help anyone who need to help. ANYONE. At the first we would see that he have such a dark past and trying to make us curious. But honestly well, its failed. I dont understanding what happen in this anime so why would i need to curious about his dark past? and for some circumtances, he is dating with such a beautiful blonde girls named Kurumi Isoshima. She is just your typical tsundere girls, and at last, we have Mui Aiba, our main heroines. She is nothing special to being mention about this. Well, she have a gun. a GUN. Summary, the characters isnt likeable which is the most important things in anime to make the viewers enjoy to watch. They have nothing that makes us to like the characters, after all they all plain characters.\\n\\n\r\nAfter all that mubbling, i honestly feel guilty to writing this review. I dont want to judge the anime so badly but its just i cant bear it. I am not saying this anime is bad for all of you but in my perspective, this anime is bad though they have a lot of potentials in there. If you're liking action and magic with some cliche romance on it, probably this anime would suit you but honestly, there is still anime that is more better than this one.",
            "date": "2014-07-15T21:36:00+00:00",
            "helpful_count": 143,
            "mal_id": 152241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1665261.jpg",
                "scores": {
                    "animation": 2,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Kynov",
                "username": "Kynov"
            },
            "url": "https://myanimelist.net/reviews.php?id=152241"
        },
        {
            "content": "The magical warfare. Where to begin? Its an epic tale of conflict with shounen ideals and stride. Its an enthralling tale that captivates the hearts of casual watchers like myself. And did it? No.\r\n - Story - \r\nWhen it comes to having a plot, the anime nails it for having a premise. But is there an actual plot? Not particularly. The first half of the anime is devoted to introducing the protagonists and hinting that Takkeshi might just be a super powerful magician by the end. The second half kept me on the edge of my seat because, well, it was so rushed that eventhe episodes couldn't tell you the whole plot. The established love triangle was more or less realistic, which I applauded. There were several loopholes in explanations and how things popped up. The random pokemon encounters with enemies was not appreciated. By the last episode all I honestly watched the anime for was some senseless violence, and by then it was 5:00 AM. It was a magical night. All in all, there was a rather poor pacing for an unrefined plot.\\n\\n\r\n- Art - \\n\r\nThe art was actually quite good, enough to make me want to see an epic poster disproportionate to the plot itself. Character designs were actually really cool, along with the weapons of some. My qualm was the absolute lack of originality. Sure, the characters were cool. But I would look at other anime for the exact same hairstyle and face. \\n\\n\r\n- Sound - \\n\r\nI gotta say, the music was hella catchy. It had the right vibe to the situation most of the time which I really liked. What else can I say? The folly was pretty standard and there was nothing special in sound effects. \\n\\n\r\n- Character - \\n\r\nOooh boy. Now for the bad boy. The main character Takkeshi was extremely bland and standard. For a protagonist, I haven't seen an emotionless character like him ever. Aside from the stereotypical crying over lovers and yelling at friends to get to safety, this main character had absolutely no emotion. His quirk was the lack of quirks. I can't even call it natural. Without his powers and role in the plot he might as well join the pile of scrap characters I've imagined for fun. His powers made absolutely no sense by the end, since the story couldn't even be told properly by the episode.\\n\\n\r\nNow for the female protagonist, Mui. What in the world is wrong with her. She supposedly has a brother complex, which is understandable. But her development and dynamic with the other characters ended right there. There was nothing to characterize her other than having a brother complex and has a crush on Takkeshi. In terms of her powers, since this is an action anime, she had no growth either. She introduced the characters with her magic, and she stayed stuck. Then what happens, you may ask. She gets hurt. Rinse and repeat.\\n\\n\r\n- Enjoyment -\\n\r\nWas all that heavy stuff weighing on my head as I watched the anime? Not until the very last episode. So I suppose I had a high enjoyment factor when it comes to brainless plot twists and incoherent violence. Not that we couldn't tell what was happening, rather, we just accept that power-ups never need to scale with what was previously established. Like DBZ right? Buu just needs to revert to his original form to be the strongest even though he ABSORBED strong beings to become STRONGER.\\n\\n\r\n- Overall -\\n\r\nI guess I did enjoy this anime while watching it. But if you're the type to watch something and actually take in the details of what is going on while watching, I wouldn't recommend this anime. I'm one to appreciate the anime while watching but also think about it afterwards. In all honesty, Mahou Sensou could have been VERY different and so much better, but the mesh we have is not what I would consider a polished piece of work.",
            "date": "2014-12-16T17:45:00+00:00",
            "helpful_count": 99,
            "mal_id": 172595,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3731201.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/macklez",
                "username": "macklez"
            },
            "url": "https://myanimelist.net/reviews.php?id=172595"
        },
        {
            "content": "I have been summoned here by my very own rage. Sheer amount of anger at this single series has led me to write a review.\r\nI chose to watch this show randomly as it started getting released at the winter 2013/2014 anime season and, God my witness, I chose wrong. I really did chose wrong.\r\nThe story revokes around random looking and acting characters in a somehow magical world. Nothing is really explained properly, nothing really adds up. No sense AT ALL. The story is not the slightest enjoyable for the viewer to see, it's full of random time skips, lack of explanations and a plethora ofboring characters. And it gets worse episode by episode.\\n\r\nThe MC, TakeshiT, is a generic black-hair main hero guy who has a talent in magic (giving him random power ups for no reason at all. Honestly, there is not a single reason for him to live apart from being the main guy).\\n\r\nAs for side characters: most of them are useless. They either appear scarcely in the whole anime, their appearance could have been totally cut off without any harm for the \"story\" or despite their powers they never did anything significant. For example, Kurumi is as useless as Sakura in Naruto first was (and most people remember it as a legendary feat). Despite her powers, she does NOTHING. nothing at all. she''s just \"there\". she exists to cry over Takeshi, when he's hurt. Mui looked promising at first but basically she's powerless, she can be beaten by any random enemy there is. Nothing good can be said about any other characters as well.\\n\r\nThe only fine one is Gekkou. Why, him, of all people, you might ask? because he's, well, nuts. He's just insane and that's all there is to him. Paradoxically, he makes the most sense in the series. and STILL he's a character that has little sense as well.\\n\\n\r\nThere is NOTHING told about the magical world itself, NO ONE ever asks nor questions such issues like brainwashing of other mages or gives a sensible flshback to light a character background up. Events are sudden and out of place, everything seems forced and rushed.\\n\r\nThis is Mars of Destruction tier almost.\\n\\n\r\nMahou Sensou's randomness and really bad plot development make this series practically unwatchable. it's as if someone is TRYING to make it suck. And he's doing a really good job at it.\\n\\n\r\nEvery single episode just goes worse and worse and WORSE. It's both boring and stupid. If you looked for one of the shittiest anime in world history, this is one definitely made it to the top 100 in my personal rank.\\n\\n\r\nThe only good thing is the ED. I like the music and the animation going with it. and that is all good to be said about Mahou Sensou. Don't watch. Just don't. You won't enjoy it.",
            "date": "2014-04-13T13:33:00+00:00",
            "helpful_count": 39,
            "mal_id": 139807,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/422129.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Smoku",
                "username": "Smoku"
            },
            "url": "https://myanimelist.net/reviews.php?id=139807"
        },
        {
            "content": "Okay..where do I start. This is an anime done by Madhouse, so my expectations were quite high, since I've seen most of their other works, but oh God was I dissapointed.\r\nStory: 3 (poor)\r\nFirst of all I think that this is my major problem with the anime. For starters the whole magical stuff is quite chiche, but that is not my real problem here. The real issue is that the plotline is really quite predictable and it lacks development.\r\nOverall the story is predictable and full of cliches used all over the place. \r\nArt: 5 (mediocre)\r\nThe art for the anime is quite good, as expected of Madhouse,but on quite a lot of occasions there are characters in the background that won't move, also as well as that there is some 'derp' faces coming from the main characters.\\n\r\nOverall the art isn't a major issue here.\\n\\n\r\nSound: 6 (fair)\\n\r\nNow that is the one thing about this anime I actually liked, with both the opening and ending themes being catchy and memorable the soundtrack fitting with the scenes and everything.. oh such a waste of great music.\\n\\n\r\nCharacter: 4-3 (decent/poor)\\n\r\nAnother major issue I have with this anime is the lack of character developmet. At the beginning we are introduced to a relationship that starts developing between the main male and female lead that does not develop any further than the first few episodes.Which is a real shame, because it would've been nice to see how thing worked out.\\n\\n\r\nEnjoyment: 4 (decent)\\n\r\nYou could say that I somewhat enjoyed the anime, but if it weren't for all of the things listed above I would've had far more fun watching the show.\\n\\n\r\nOverall: 4 (decent)\\n\r\nWith that in mind I reccomed this anime to anyone who is willing to watch a predictable shounen, full of cliches.\\n\\n\r\nreview by: dark_cookie",
            "date": "2014-08-05T11:06:00+00:00",
            "helpful_count": 25,
            "mal_id": 155375,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3976207.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/dark_cookie",
                "username": "dark_cookie"
            },
            "url": "https://myanimelist.net/reviews.php?id=155375"
        },
        {
            "content": "When I first saw the synopsis for this series, I was extremely excited for it. Unfortunately, my expectations for this series was not met and it left me thinking that this series was a pure waste of my time.\r\nFor one thing, the pacing, in my opinion, is just terrible. The series will have an episode with a battle, then an episode with an explanation. All the explaining is extremely annoying. Sure, I like knowing what is going on, but usually the explanations have nothing to do with whatever event is occurring at the moment, and it will still leave me several unanswered questions as towhat exactly did happen.\\n\\n\r\nAnother thing that seriously annoys me are the characters. Takeshi is just extremely gullible, and I found myself calling him an idiot more than once. Kurumi is your typical \"damsel in distress\" who doesn't seem to really have any useful powers. Ida just acts first without any thought, but we don't even see much of him anyway. Then there's Mui, who I can't really find anything noticeably wrong with her, except that she causes drama between Takeshi, Kurumi, and her.\\n\\n\r\nThen, there's the romance aspect of this anime that I find uncalled for and unnecessary. It provides fan service, I know, but it is not needed at all. The anime would operate just fine without it, and all it does is take up episodes where something important could be happening (or an explanation -.-).\\n\\n\r\nThe ending was also rather open-ended, leaving you to try to figure out what actually happened, or happens... I might just force myself to read the manga in order to try and see if what happened is explained, because the ending of the anime just left me with even more questions than before. Overall, this series is something I wish I didn't spend my time to watch. It is not something I would recommend to watch.",
            "date": "2014-03-28T12:22:00+00:00",
            "helpful_count": 24,
            "mal_id": 137509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3648441.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/lilac677",
                "username": "lilac677"
            },
            "url": "https://myanimelist.net/reviews.php?id=137509"
        },
        {
            "content": "Mahou Sensou was overall the complete definition of a disaster. Starting the anime, I was completely hooked and found it very interesting but the last half is what destroyed it. Parts of the anime skipped from one area to another and plot developement was sacrificed in the process. The characters, to me, werent bad and were fairly well thought out though some were unoriginal  the main characters seemed decent. The characters and the storyline the plot attempted at were ultimately the strongest assets of the show. Lastly, the final episodes were utterly haywire. A new scene is produced the is not at all explainedor supported  in any other parts of the anime and leaves the watcher extemely confused and almost dumbfounded by how chaotic the events become.",
            "date": "2014-06-11T13:59:00+00:00",
            "helpful_count": 21,
            "mal_id": 146665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3715147.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/chidoristream506",
                "username": "chidoristream506"
            },
            "url": "https://myanimelist.net/reviews.php?id=146665"
        },
        {
            "content": "Just finished Magical Warfare (Mahou Sensou) and now I'm here to warn you all of the complete waste of time it was to watch. Out of all of the anime that I watch I hardly ever find one that I just didn't like. Well.. I guess there is a first time for everything. \r\nStory: At the start you think you're going into an anime with great concepts and characters that will leave your jaws on the floor and  cosplays to be made. WRONG!! The story's pacing seemed as though it was on a good track the first 3 episodes but the more you watchedthe more unstable everything got. From skipping between large gaps of time to completely rushing through important adventures and  plots, this story seemed like a really bad LSD trip.\\n\\n\r\nArt: I can't really complain about the art style here. It wasn't anything to showcase but it wasn't horrible per-say.\\n\\n\r\nSound: The only piece of music that i could happily recognize was the opening soundtrack. Aside from that everything else was so overused to the point to where it became a drowned out blur.\\n\\n\r\nCharacter: The only two characters that really stuck with me were the MC and his younger brother. That's only because one was constantly on the screen and the other was so god awfully annoying all I could do was think about how I wanted to kill him myself.\\n\\n\r\nEnjoyment: No. Almost none at all. Every episode half way through was a huge cock tease mixed in with a bit of half assed plot.\\n\\n\r\nOverall: I can't say that I absolutely hated it. Yes there were so many reasons to hate it but I think that overall the concept of the world was pretty impressive. I wish that there were more episode so that there would be more of a story build. But hey this is what you get when you try to build Roam in a day.",
            "date": "2014-04-10T00:57:00+00:00",
            "helpful_count": 19,
            "mal_id": 139431,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3674973.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AtlasGray95",
                "username": "AtlasGray95"
            },
            "url": "https://myanimelist.net/reviews.php?id=139431"
        },
        {
            "content": "As I said in my Strike The Blood review, I do not write many reviews for anime so bare with me as I write something for this one. Honestly, I don't see why this anime is getting so many bad reviews its not as bad as people are making it out to be but of course that is my opinion alone. Now onto the review: I found this setting sort of unique from most animes and for the fact this anime wasn't a harem was a major plus, let alone there wasn't much fan service. It kept serious, and stuck with the plot which Iwas glad for. \\n\\n\r\nI was also quite pleased with the main female; Aiba Mui for she tries very hard to fight on her own without the needing to be saved and how she was devoted to save her brother, but I won't get into spoilers for people who haven't seen the show. For a young girl, I thought Mui was strong.  I also was quite pleased with our male protagonist Takeshi Nanase; who had grown from the twelve episodes. I love characters who have strong determination. : D\\n\\n\r\nThe whole two worlds being separate; sort of gave me a Shakugan no Shana feel for the series which was a nice feel. The music was entertaining, the opening and ending were strong points in the anime as well as the way magic was set up in this series. And I like how Takeshi and crew were transferred into a Magic Academy rather than sticking around in High School; being ordinary the normal thing anime tends to do.\\n\\n\r\nAnd this anime has a lot of nice twists and turns. But again, I'm not gonna get into that because it will be spoiling. However, I'm not going to give this anime a perfect score; considering it ended in a cliff hanger and these type of series I feel needs 24 episodes or more so characters can have room to grow. And have more time.\\n\\n\r\nAlso the art was pretty smooth to look at as well. Another good work by MadHouse. : D\\n\\n\r\nHopefully it will get a second season!~\\n\\n\r\nI give this anime a 7, I would give it an 8 but a lot of questions are still left unanswered and let alone the cliff hanger. My score would change if this series gets another season. :]",
            "date": "2014-03-27T17:52:00+00:00",
            "helpful_count": 18,
            "mal_id": 137321,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2088817.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ShionxChan",
                "username": "ShionxChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=137321"
        },
        {
            "content": "Writing this review because I watched this piece of crap anime while it was airing but was to dam lazy to make a review. This was one of the worst animes I have watched it was just as bad as watching Kanokon. I literally felt slower than the characters in the series. Watching this anime made me feel like I was killing brain cells luckily I survived. \r\nFirst off I give the story a 3\r\nIt has some potential to be good but it was executed pretty badly and rushed.\r\nI didn't like the reason why there was a war because of 1 person I thought thatwas pretty stupid. I also thought there was too much story and not enough episodes, almost like they didn't have enough money to keep going. You got Mui trying to save her brother, Takashi's problems with his family, The war between the magicians and trailers or whatever the hell they were called, Takashi being brought into the magic world, 2 girls fighting over him, and the list goes on. It was poorly done in my opinion and they should have added less plot.\\n\\n\r\nArt - 4\\n\\n\r\nThe art was okay but could have been more original. The characters didn't look very unique they just looked average.\\n\\n\r\nSound - 8\\n\r\nThe only thing good about this anime was the fact Nano sung the ending which sounded very good but sad to see it being used in this anime.\\n\\n\r\nCharacter - 3\\n\r\nI felt no connection to the characters at all. The only character I felt sorry for was Gekkou because Takashi was a piece of sh*t towards him and he just takes it like they're in an abusive relationship and forgives him so easily even though he was a b*tch and shoved him into a car because someone apparently told him to. The kid can't even make choices on his own and he's a weak character. He thinks his mom abuses him even though she was helping him get stronger. Takashi is the definition of a brat. The blonde haired girl is too dam clingy, I was hoping she would go for Gekkou but she's too stupid and falls in love with Takashi even though he's a brat pretending to date her like a little b*tch that he is throughout the whole series. Mui fell in love with Takashi too easily, I see nothing special about him, he claims his mom hates him and he tried to kill his brother and wonders why his brother hates him. Lastly there's Kazumi Ida, I see nothing cool about him that's really all I can say because he really had no involvement in the anime, he wasn't needed at all.\\n\\n\r\nEnjoyment - 3 \\n\r\nI give it a 3 because there were some episodes I laughed at how pathetic the anime is. It was such a chore watching it and finishing it but I survived without losing all my brain cells amazingly.\\n\\n\r\nOverall I give this anime a 2 because it sucked so bad, I would give it a 1 but seeing animes like Kanokon I'm being generous and giving it a 2",
            "date": "2014-08-05T10:48:00+00:00",
            "helpful_count": 18,
            "mal_id": 155373,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Fantasys",
                "username": "Fantasys"
            },
            "url": "https://myanimelist.net/reviews.php?id=155373"
        },
        {
            "content": "I watched this anime after seeing a couple scenes in a youtube clip. It looked interesting so I watched it. Here are some of the pros of the show\r\n1. It had some interesting characters.\r\n2. The magic in it is cool and there were so pretty decent fight scenes. \r\n3. Near the end of the show the story got pretty interesting. \r\nNow here are the cons. \r\n1. The interesting characters aren't the main characters. The side characters in this show are more interesting and awesome than the main characters. The main characters are pretty dull and boring, and only one of them becomes semi interesting nearthe end of the show. \\n\\n\r\n2. I feel they cut a lot and I mean a lot out when adapting this from it's light novel counterpart. One episode we see them unable to do a certain sort of magic and then the next they have suddenly mastered it, not because they are awesome like that but because months have actually passed between the 2 episodes. \\n\\n\r\n3. They bring in new magic that the charactrs can suddenly use, yet the audience never gets told what this magic actually is or does. We can semi guess what it is but overall 9 times out of 10 we are left in the dark. \\n\\n\r\n4. The story gets interesting near the end. I put this in the pro part as well because it was an interesting story point. It's also in the con part because well nothing in the show ever really leads into this story. It's all just suddenly dropped on us in the last couple episodes. \\n\\n\r\nSo in conclusion, I would love to read the light novels this show is based on since it did perk my interest and I know they would go into more depth. As a tv show though, it is a complete mess and not worth watching. There is no real story, the characters we are suppose to connect with we don't and most the time the relationship between characters seems strained at best if not just plain unbelievable. This is because the show skips over so much character development. To sum it up simply, imagine all 7 Harry Potter books jammed into one 2 hour movie and that's pretty much what Magical Warfare is.",
            "date": "2014-09-16T01:37:00+00:00",
            "helpful_count": 17,
            "mal_id": 160577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3193111.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/llama612",
                "username": "llama612"
            },
            "url": "https://myanimelist.net/reviews.php?id=160577"
        },
        {
            "content": "I don't even know where to begin...or maybe I do?\r\n\"Don't judge a book by it's cover.\", comes into play here. You'd think the girl in the front cover, and title would get you all hype about \"what wonders lies within this amazing looking light novel.\"? Or the fact that the PV/Trailer video about the anime was downright attractive. Well let's start with how I first knew the series.\r\nI first knew about Mahō Sensō(Magical Warfare) back in around 2012 IIRC. I was looking for Visual Novels and/or Mangas similar to Shakugan No Shana, because it was been a while since I read a series that involvesfantasy, romance, and action. \\n\\n\r\nI found about Mahō Sensō Light Novel and thought to give it a try. Oh boy, it was interesting at first. At some points as I continue the plot and story becomes bland, and character-wise, everyone has little to no progression at all. I thought at first that maybe 'cause this is a Light Novel and that it'll probably be different when I actually see them in action, like in an anime, or a manga atleast?\\n\\n\r\n2013, the manga was released. I gave it a try, and...it was mediocre at best. I decided to give up on the series, or atleast let it on hold.\\n\\n\r\n2014, the anime was finally released. And what a surprise, it's still bland as ever.\\n\\n\r\nHonestly I'm seeing a lot of potential with the theme and concept. But it just isn't working well with the whole plot and characters.\\n\\n\r\nCritical Short Review:\\n\\n\r\nStory-wise:\\n\r\nIt involves 90% around a girl trying to bring her \"onii-chan\" back from the \"Dark Side\". Laughable. In seriousness, the plot is about two worlds in actually one reality. Magical Side, and Human side. Whole common concept about some dude wanting to erase non-magicians.\\n\\n\r\nNot unique at all.\\n\\n\r\nArt:\\n\r\nMediocre at best. Even the magical effects are mediocre.\\n\\n\r\nSound:\\n\r\nSeiyuu/VA - If it wasn't for Nao Tōyama voicing Aiba Mui, I would've dropped this. There are others like Kenichi Suzumura, but they don't fit their characters well. \\n\\n\r\nMusic - There's music?\\n\\n\r\nCharacter(s):\\n\r\nI'm sorry what? The main male protagonist is just your average guy from any other fantasy, romance, action, magic anime out there.\\n\\n\r\nEvery character is dull and boring. No uniqueness at all.\\n\\n\r\nEnjoyment:\\n\r\nI'm really sorry, but it's not working at all.\\n\\n\r\nOverall:\\n\r\n4.2\\n\\n\r\nSad. The concept, theme, and plot had some potential. Ruined by the common concept ideas of characters, and story-line.\\n\\n\r\n-\\n\\n\r\nI wrote this right after I watched every episode on the date of March 28th, 2014. The date when it ended. So this is my full honest review.",
            "date": "2014-03-28T18:52:00+00:00",
            "helpful_count": 17,
            "mal_id": 137617,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3660335.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zerviscos",
                "username": "Zerviscos"
            },
            "url": "https://myanimelist.net/reviews.php?id=137617"
        },
        {
            "content": "I've already written up a review on this anime. You can check it out on my blog, to get a full review on it *it does contain spoilers*.  \r\nBut to keep it short. This anime starts off pretty well. A solid start, nothing wrong with that right?. But under closer inspection, this anime flaws are pretty evident. And it harms it a lot. \r\nCharacters: \r\nTakeshi is your most generic male character. Nothing outstanding about him. You can forget about Ida, that guy supposed to be one of the lead characters and he is off screen and forgotten about for the most part. Not onlythat, he is just as generic as Takeshi is. Mui, has some redeeming qualities, but like Takeshi and Ida just generic. In fact the whole main and side cast are just plain generic and forgettable. \\n\\n\r\nStory: \\n\\n\r\nStarts off strong, then goes down hill mid way. And then just evaporates with the most ridiculous \"cliff hanger\". Oh and the pacing is just bad - especially towards the end. Heck even the exposition of the story, makes little sense.\\n\\n\r\nArt: \\n\\n\r\nSuffers a lot here. The consistency is just bad. Mui has her nose missing in episode 1. Turns up in episode 3. The budget must have been low, to have even the most basic things go missing then added later on.  \\n\\n\r\nOverall: \\n\\n\r\nA very bad anime. Don't waste your time.",
            "date": "2014-11-25T13:27:00+00:00",
            "helpful_count": 16,
            "mal_id": 169909,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Wh8ever",
                "username": "Wh8ever"
            },
            "url": "https://myanimelist.net/reviews.php?id=169909"
        },
        {
            "content": "Writing this review to try to save as much people from watching this piece of garbage!! I'll try to keep it short.\r\nMain adjectives to describe this anime: SHALLOW, MEDIOCRE, LAME, WEAK, CONFUSING.  \r\nThe story basically has no strong foundation to hold it. It has this main plot/premise but has major problems executing it to its potential. When you read synopsis (wont write it since it's in the main page already), sounds interesting enough. But as you watch the episodes, the pacing is way to off (some episodes are slow and some, too fast) and lacks a straightforward direction. The ending was extremely rush thatit left the viewers with more questions than explanations. There was absolutely no resolution. Additionally, the reason why the characters are acting this certain way is pathetically, annoyingly shallow.\\n\\n\r\nArt is mediocre!! The art of the characters look like a ripoff from different animes. There's no distinct attribute that make them look unique and exclusively from this anime.\\n\\n\r\nCharacters are lame and lacks development.. A typical, weak, martyr \"hero\" who risks his life to saves a girl and decides to follow her to a magical world along with his friends, to run away from his problems in the real world.. my definition for this type of character, an idiotic coward. A fake girlfriend/childhood friend=powerless, tsundere damsel in distress. A delinquent looking friend with a sister complex. The magical, gun-wielding heroine with a brother complex, who later is reduced to a supporting character (she loses significance later on. She might as well be invisible). And lastly, the jealous younger brother who perceives that an honest to goodness street accident was an attempted murder by his \"hero brother\", going to great extent to get his revenge also because the brother \"stole\" everything from him. SO SHALLOW and DUMB!! BTW, their powers are ordinary and lack originality, to the point that the concept is dumb.\\n\\n\r\nOverall: dreadful, boring, weak, mediocre, confusing. STAY AWAY FROM THIS!! Pile of crap and a waste of time!\\n",
            "date": "2014-03-07T05:47:00+00:00",
            "helpful_count": 15,
            "mal_id": 134957,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1132457.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/jbeat",
                "username": "jbeat"
            },
            "url": "https://myanimelist.net/reviews.php?id=134957"
        },
        {
            "content": "Well ,I'll be totally honest about this anime ,it's one of the biggest deception I had in my otaku life.Why? Is it the story? The characters? The art? No, no and no.Actually all of those point are good ,really.\r\nI know it's bad to spoil in review ,so if you really want to see that anime don't read me.But if you're hesitant please read me because I have to warn you about one thing.\r\nStory : Okay ,I'll admit it ,the story is a cliche.The plot sound different but you'll find all the elements for making a classical shonen.Magic war ,a stupid MC which a big heart,a strong will ,a desire to grow stronger for his friends ,and of course girls ! Girls with big boobs (or kind of) and big crush for this stupid MC (which ,like all the time ,will never understand anything about that and stay dumb like all MC of this type.).But in the big line ,the story is really interesting ,looks like there is a lot of mysteries,factions fighting for power, a love triangle ,a new magic war is coming ,,the big bad boy is finally back with his badass magic of the doom ,a strong rivalry between two brothers lead them to fight and...CLIFFHANGER !! Yeah ! That's exactly how this anime end ,with a fucking cliffhanger.The last episode end with a lot of unanswered questions ,even more questions asked and nothing.It end.Like that.That's all.What? Want to know what the fuck happened? Who's really that big bad guy? Why all those plots around the two brothers?You really want to know that?...Me too.\\n\\n\r\nArt : The chara design is ,for me ,really nice and pleasant.It's colored ,warm ,well animated ,the characters are nicely done ,the fighting scene are fast paced and dynamic.Yeah ,I think that the art is the best part of this anime.\\n\\n\r\nSound : The opening is not really my cup of tea but it's a nice song.The anime ost is ,for it's own ,pretty good I think ,some great songs are put in the backgrounds sometimes ,turning some classical scene into something a little more epic/dramatic.\\n\\n\r\nCharacters : Classic ,cliche ,seen again and again...But for my own I never turn tired of this kind of characters.The MC is ,as usual ,stupid but have a strong will like I said ,it's the perfect Shonen hero type.You have the childhood friend secretly in love for this idiot ,the new girl without which all the anime can't start and which will fall in love for this idiot too (turning it into the classical love triangle) and the MC useless ,but funny ,best friend.Add in the middle of that a black haired dark-emo big brother with dark ice power, a loli who actually...Well I don't know what she's doing here really but I don't care ,I love loli ! ..Emmm ,a badass with badass power of the doom of the death (I'm sure this one made some 13yo little boys erect for his power).Anyway ! Cliche ,but nicely done ,so it's not a bad character choice.\\n\\n\r\nEnjoyment : Well...How can I explain the pain?...This anime have 12 episodes.Yeah...12...Just 12.And as I watched the 11 first episodes I was totally in the story ,I was like \"Oh god !\" \"Awesome !\" \"Wait what?...\" \"So it was...Oh god it is !\" and all.The story was awesome ,the plot catch me episode after episode ,questions started to form in my head.I wanted to know about that and that and that.I have watched the full series in one shot.Spend a full night for that but I watched it.And finally I came to the episode 12.And at the end of this episode I was like \"What.The.Fuck.\".Why? Because it's not an ending episode ,it's just a normal episode ending with a cliffhanger ! I've searched for an episode 13 or a season 2 ,or an OAV.But no ,it's over at 12 ,and 12 end with no answers ,new questions ,a big mind fuck and ,for my own ,a strong feeling of disappointment and...a sensation that I've lost a night doing nothing.\\n\\n\\n\r\nConclusion : Take care watching it ,it's interesting but it's a totally unfinished anime with a not-ended plot.",
            "date": "2015-03-01T00:46:00+00:00",
            "helpful_count": 15,
            "mal_id": 181437,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4486047.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dai_Kina",
                "username": "Dai_Kina"
            },
            "url": "https://myanimelist.net/reviews.php?id=181437"
        },
        {
            "content": "This show is such a train wreck it's not worth a full review. Here's a shortened version for your convenience (and mine):\r\nStory: 0/10\r\nHow can someone rate 0 on a story? Well, it's simple: the whole show is a buildup for season two, and explains about fuckall. A few minor characters get some background exposure, but even that is poorly executed and overall uninteresting. The end is an absolute mess. The character development is so absent it often times feels like characters are going backwards in development, getting tricked several times in a row by the same lies and tactics.\r\nIt's worth 0 simply because it isworthless.\\n\\n\r\nArt: meh/10\\n\\n\r\nI'm not a big art guy. This was so uninteresting to look at that I spent most of my time looking at my fortress on dwarf fortress. I know I didn't find it particularly good, and other people seem to have noticed that it's inconsistent, uninspired and possibly even just a knockoff of characters from other shows.\\n\\n\r\nSound: forgettable/10\\n\\n\r\nI don't remember a single song from the show. I don't care much about voice actors, so I can't really judge them; but it sounded as standard as it gets.\\n\\n\r\nCharacter: -2/10\\n\\n\r\nSweet lord in heaven, how can a show about magic have such weak main characters?  All the main characters get defeated over, and over, and over again, to the point where you wonder what the hell they've been learning in their high school and when their teachers are going to start teaching them how not to suck at life 101. Towards the end the sensei to end all senseis steps in and teaches the main character to actually use magic in about three days (after him theoretically learning it for a year). Suddenly the main character can move faster than someone teleporting. Seriously, what a mess.\\n\\n\r\nI actually feel like expanding on this topic.\\n\\n\r\nWhat do we have as the MC crew?\\n\\n\r\nHere's a short breakdown:\\n\\n\r\nA guy who uses evasion magic. Which theoretically means he should never get hit, yet gets his ass handed to him by physical blows he could've easily avoided every other minute.\\n\\n\r\nA girl who uses illusion magic. It somewhat feels like the only reason this is a thing is for the obvious sexual innuendo the people creating this show could cram into this concept. Fanservice galore for a few episodes, and then they completely forget that she's a witch for the rest of the show except when someone needs a bit of healing (even though I've never seen her heal anyone all the way to recovery). Great move, whoever made this.\\n\\n\r\nA guy who uses destruction magic. I'm sorry, I meant to say a guy who uses self-destruction magic. He's so bad at it that the only thing he can do right is give his magical powers to the first mc so they can have a nice little deus ex machina moment every few episodes. You'd expect him to get better at it after practicing for a year, but his improvements are so subtle you could be forgiven for not noticing.\\n\\n\r\nA girl that uses a pistol to shoot fire. Oh, and I can't remember a single instance where she actually defeated an enemy, even though she was technically more powerful than anyone else in this crew.\\n\\n\r\nAnd because you can't have generic without a harem, both girls love the first mc, even though he's completely oblivious to it. Props to the makers to actually make the MC oblivious all the way to the end, and not actually revealing it to him. I, too, believe character development is grossly overrated.\\n\\n\r\nEnjoyment: 5/10\\n\\n\r\nHey, my dwarves managed to beat a human to death using nothing but their bare hands, hence avenging their fallen comrades from the madness of the wereiguana, while the show was playing in the background. Now *that's* entertainment value. This show is made for background playing: it's usually very slow and relevant sections are short and far in between. Except for the last episode, which makes me question the sanity of whoever thought this plot was a good idea. I enjoyed watching my fortress while some really contrived plot was happening off to the screen on the side.\\n\\n\r\nOverall: 3/10\\n\\n\r\nThis show proves that it is possible for the ending of a series to retroactively make the rest of the series bad. If I had to rate it after 2 episodes, it would've been an 8. If I had to rate it after 6, it would've been a 6. At this point I wonder if I really want to give it a 4 or I should just go with a nice, fitting 2 or 1. If you want a good dumb, action-oriented show where you can just turn your mind off for 12x25min and enjoy some mindless action, do yourself a favor and avoid this like the plague, because even the most brain dead person on myanimelist would have a hard time arguing this show has entertainment value at all.",
            "date": "2014-07-26T19:43:00+00:00",
            "helpful_count": 13,
            "mal_id": 153857,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/invalidcharacter",
                "username": "invalidcharacter"
            },
            "url": "https://myanimelist.net/reviews.php?id=153857"
        },
        {
            "content": "Mahou Sensou or Magical Wars really does have a good premise. For those who are interested in fantastical settings with some sort of ongoing war, (obviously just from the title), then this a good show to sit through.\r\nOr so I thought.\r\nYes, I enjoy fantastical settings and I didn't put much expectation into this series while I was beginning to watch it. I was just looking for a show to watch before the fall anime season begins. \r\nAnyhow, to be fair, this is adapted from an ongoing light novel series, which would explain the choppy storytelling. There are a few gems with this types of lightnovel turned to anime but I don't include Mahou Sensou in this category.\\n\\n\r\nFirst of all, there is a lack of depth with the story. Again I stress that the premise of the story is good. In fact it is interesting, but the anime was unable to expound further. There is a lack of exposition of the characters; what I want to say is that, these characters were not flesh out enough.\\n\r\nBy the last half of the series, you would expect that there would a resolution, or a closure, but there is none. Mahou Sensou leaves you very hanging and there is a gaping sense about why did the studio decided to end it that way? Seeing that there are currently 8 volumes published in Japan, I think that there is enough material or sufficient material to draw from. Unless of course the studio is planning for a second season in the event that the BD and DVD sales are good.\\n\\n\r\nSecondly, the animation is a bit off. I enjoy the scenes were the characters start casting their magic and the magic circles appear but other than those, some scenes are just not right.The budget is low for the animation aspect but for the ending sequence, it was very good. Normally I would immediately end the episode once the ending song starts playing but I watch the entire episode until the very end so as to watch the ending sequence.\\n\\n\r\nI may not be an expert when it comes to music but I find the opening and ending songs quite good. Also, the background music was enjoyable. There seiyuus were good in conveying their characters. It's just disappointing that the characterizations aren't enough.\\n\\n\r\nOverall, I won't watch this series again. It's a good enough to while away the time if you have time to spare.",
            "date": "2014-09-16T22:32:00+00:00",
            "helpful_count": 13,
            "mal_id": 160675,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4103415.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/napoli_fiore",
                "username": "napoli_fiore"
            },
            "url": "https://myanimelist.net/reviews.php?id=160675"
        },
        {
            "content": "Mahou Sensou (Magic Warfare) Is one of those animes that  has a lot of potential but also poorly executed. The plot and idea isn't bad but when you put a bunch of generic characters with less then nothing in character development. its a recipe for disaster  If it had 24 episode it might have been better, but who knows. \r\nStory: I think the idea and plot is good, magic academy training students to fight evil, brother rivalries, and untold secrets. However they rushed everything within 12 episodes. Which caused it to end up not being really good because it brought in more plotholes and unanswered questions....that will never be answered 3/10\\n\\n\r\nArt: The art is decent and the animation is nice nothing too special. I'll give it a 4/10\\n\\n\r\nSound: The sound was ok, I don't really know what to say for the sounds...however, the ending song is very nice. It is probably one of the only good thing that came out with this anime lol.  5/10\\n\\n\r\nCharacter:  Generic heroine's, Generic villains. Nothing that really needs a explanation. The first 3 episode is already self explanatory about the characters. 3/10\\n\\n\r\nI did not enjoy this anime. However, my motto is once you start a anime you must finish it. Each episode felt like a stab in chest. I didn't even know what was going on in some parts of the anime due to the fact there were a lot of skipped time lapses. There went  264 minutes of my life....\\n\\n\r\nI highly do not recommend this anime unless you like to watch this kind of  stuff with plot holes with a  wtf ending. Nevertheless if you have spare time or nothing else to watch than maybe you could check this anime out for yourself.",
            "date": "2014-04-02T21:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 138405,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3338737.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/masterofthebaits",
                "username": "masterofthebaits"
            },
            "url": "https://myanimelist.net/reviews.php?id=138405"
        },
        {
            "content": "Well, to start out, this anime wasn't exactly what I'd call the best of Winter 2014 or anything like that. But at the same time it wasn't all that bad, if you could look past the weak story.\r\nArt:\r\nIt's art was ok. Still nothing special. I was able to get through the entire anime somewhat because of the characters designs, making fun of them, and calling Takeshi \"No Nose\" at some points do to the direction he was facing.\r\nSound: The sound was, in my opinion, the best thing about this anime, so if you can't watch it, at least put headphones on, sit back and listen.The ending was the closest thing to \"Best of Winter 2014\" material. \"Born to be\" is a really up tempo rock song and became something I listen to almost weekly. I can't say the same for the opening though.\\n\\n\r\nCharacter:\\n\r\nLet's just say, they were as good as the story itself, and I don't want to repeat .\\n\\n\r\nEnjoyment:\\n\r\nI got a few smiles in and a couple \"oh, that's cool\" remarks about this anime. It was good enough to let me finish to the end. Although the thing that changed this for me was the LAST EPISODE. \\n\r\nReally, the last episode was really REALLY good in my opinion, and left a cliff hanger making one think something like \"WHAT, WHY DID IT END THERE\" because it literally just stops and goes to the ending without any hint of what might happen in the next season other than the fact Takeshi (the main character) is stuck in the past and he'll confront his brother Gekkou at sometime.\\n\\n\r\nOverall:\\n\r\nAltogether, I thought this anime was pretty enjoyable. It wasn't great, but it wasn't all bad either. All I really want to say is, the author of the Novel better get a better pace going. It's too quick and weak.\\n\r\nI can't really say to watch it or not considering this was a really weak \\n\r\n7 Rank\\n\r\nfor me but, if you can, try and watch Mahou Sensou. It's ok.",
            "date": "2014-03-27T13:41:00+00:00",
            "helpful_count": 11,
            "mal_id": 137269,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2653247.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/WindBreaker",
                "username": "WindBreaker"
            },
            "url": "https://myanimelist.net/reviews.php?id=137269"
        }
    ],
    [
        {
            "content": "Mahou Sensou seemed to have it all right off the bat. The art looked great, the story was new and the concept interesting. The story surrounding the MC's, Takeshi's, life was different and interesting. We got a love interest right off the bat, hell, he had a girlfriend! The best friend looked like a reliable goof, and then their world went upside down thanks to Mui and her magic. But the problem began with what seemed to be the shows strong point; the characters.\r\nTakeshi is a wimp, plain and simple. Sure, he has a moment here and there where he sucks it up and actslike a main character, but only in the beginning of the show. Once the main villain is introduced, who is terrible as well because his reasons are so ridiculous and stupid, every time something bad is going to happen to Takeshi or his friends/loved ones Takeshi doesn't do jack shit. He has the magic, the weapon, the resources to be GOOD. But he throws it out the window because he still holds on to some incredibly naive and stupid thoughts.\\n\\n\r\nKurumi is just pathetic and frustrating, always going on about Takeshi. She gets mad at Mui for every little thing, and provides no support whatsoever. Mui has something going for her, and Kazumi is probably the most normal out of them all; trying to do something and fighting, instead of standing around. The whole show focuses on these horrible characters, so you can't even stop to appreciate the original concept of the show. You completely forget why you picked up this anime because the characters are so terribly done.",
            "date": "2014-08-25T14:57:00+00:00",
            "helpful_count": 10,
            "mal_id": 157909,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4023635.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AnimeKing40",
                "username": "AnimeKing40"
            },
            "url": "https://myanimelist.net/reviews.php?id=157909"
        },
        {
            "content": "After completing this anime I found me questioning myself\r\n\"What was that just now? Is that it?\" \r\nWhere is it going from here on... well, nowhere.\r\nI'm in mood for some hilarity so here goes...\r\nThe main guy Takeshi Nanase looks like Teito Klein from 07~Ghost and has Lelouch's eye. Kurumi & Kazumi are Saber & Gilgamesh from Fate series. Aiba Mui who looks like Shana and names her aspect Arthur (wow to the coincidence) Lancer makes pleasant cameo appearances in episodes from time to time also look out for Rukia's butterfly in episode 1. The war sequences are fine. \r\nSumming up, \r\nI have finished watching the wholeseries and apparently the only thing I realized about this anime was that they have characters from different war/sword-fighting/battle animes participating in one single unified story set in a completely different universe. Their identities and personalities have been swapped out (The Shana girl is still annoying as ever though)\\n\r\nand how does it all turn out to be? Really appalling if you were to ask me. \\n",
            "date": "2014-05-27T05:16:00+00:00",
            "helpful_count": 10,
            "mal_id": 144699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3657559.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Avmugi",
                "username": "Avmugi"
            },
            "url": "https://myanimelist.net/reviews.php?id=144699"
        },
        {
            "content": "[mostly spoiler free review]\r\nI like to keep reviews relatively short, and there's only one thing I can say about Mahou Sensou - it was a complete train-wreck.\r\nIt started out well enough with the introduction of the main characters Takeshi, Mui and Kurumi and immediately managed to grip my attention with an (albeit cliche) \"dark mysterious tone\" regarding Takeshi's home life. Further along into the first episode, I got the impression this was going to turn into some sort of loli harem: not necessarily a bad thing, I thought, as long the producers tie the romantic and magical elements together properly. How naive I was.\r\nAnd thenit began. Mahou Sensou spiralled into chaos from the second episode, and maintained its destructive path until there was no hope for the series at all. The main fault was the PACING. The anime somehow managed to skip through the only possibly interesting parts of Takeshi's experiences, and yet relentlessly dragged through the most boring, unrealistic and out-of-place scenes (trying to make this spoiler free so I'll have to be quite vague).\\n\r\nNot only this, but they wasted the potential of said \"mystery\" involving Takeshi's family and made all the characters from the second episode onwards completely unrelatable and impossible to emphasise with. The producers failed to bring the characters to life, and the only redeeming feature was the art; it wasn't great, but the completely \"half-assed\" nature of the anime's plot and characters brought down my high standards for the art style - for example, Takeshi only had half a nose in most scenes (what the hell?), but they managed to pull off the loli girls with minimal pain to my eyes.\\n\\n\r\nSo, to conclude, should you watch this anime? No, unless you can bear a painfully boring plot (which gets highkey *weird* when you find out about Gekkou...) with weak female mcs/supports and a main (Takeshi) who apparently doesn't have much of a personality. I'm being nice giving this anime a 3, mainly because it had the potential to be great, but somehow blew up into an incomprehensible mess of sibling rivalry and unclear plotlines along the way.",
            "date": "2018-08-14T09:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 286467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7313344.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/lyviacera",
                "username": "lyviacera"
            },
            "url": "https://myanimelist.net/reviews.php?id=286467"
        },
        {
            "content": "After the first three episodes I forgot what this anime set out to be, and what I was told about it. It's got a great setting, a world that could inspire and awe people.\r\nIf written right.\r\nThe problem is that our MC Nippon Stereotype is an underdog with instant talent even though he's new to the magical world. So, what little we do get of actual magical warfare is layered and buried and packed tight under a stock school setting with stock high schoolers and an under-aged disapproving but lenient dean. The show is complete with stock art and animation as well. There's nothing wrong withthe music, antics or seiyuu, but there's nothing great about them either.\\n\\n\r\nThe resistance group has been the best part so far, what's been elaborated for them hints to more complexity in the world and their position against the protagonists. I can only imagine that this painful arc, in the manga (I care so little idek if there is a manga), leads up to the teens graduating magical high school, choosing their colony (or whatever they called it) and making an impact in the real problems of the magical world. But as a writer, that's only what I would expect from such a promising premise.\\n\\n\r\nThe main plot that had me slightly engaged was solved mid season, leaving contained episodic plots in the last half (as of episode 8). The show is bogged down trying to do to much, and ends up accomplishing nothing for the viewer. I love slice of life, but this isn't the place for it. And as likely as it is to culminate all of the events to some finale, where MC Nippon Stereotype gains power from all the good times and nothing he's done; it'll be a disposable ending, because they'll go back to school and continue doing nothing worthwhile.\\n\\n\r\nAll that I watch for is the edgy ED now. It's my kind of music, even if the IS-like show isn't my kind of anime.",
            "date": "2014-03-02T01:22:00+00:00",
            "helpful_count": 8,
            "mal_id": 134425,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1783299.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Swoon",
                "username": "Swoon"
            },
            "url": "https://myanimelist.net/reviews.php?id=134425"
        },
        {
            "content": "I think this anime could have been A LOT better... Like the characters were a great but since the last episode was released today i dont want to spoil anything but as it got to the end of thr season things got really confusing. Over all it was ok ish, but the plot of mahou sensou is t ery easy tk understand.\r\nBasically i enjoyed this anime because of the characters and i also disliked the anime as well because of the ending of the season....idk if its just me but over all they could have made it so much better but i guess it wasok and had some good points and bad points but the ending was so confusing im still confused",
            "date": "2014-03-27T18:58:00+00:00",
            "helpful_count": 8,
            "mal_id": 137333,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/iloveanime3003",
                "username": "iloveanime3003"
            },
            "url": "https://myanimelist.net/reviews.php?id=137333"
        },
        {
            "content": "I had liked this anime.. The story was quite interesting at the start.. But the story kept on getting dragged.. It was becoming horrible and horrible as time passed.. And the ending is bullshit due to ruining the established scene of having a conflict.. And the ending was poorly poorly made.. Was that even an ending? I wasted my time watching this anime.. Sucks..",
            "date": "2014-03-27T17:59:00+00:00",
            "helpful_count": 7,
            "mal_id": 137323,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1634783.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/arch_nightmare",
                "username": "arch_nightmare"
            },
            "url": "https://myanimelist.net/reviews.php?id=137323"
        },
        {
            "content": "Having finally gotten past the half-way mark in Magical Warfare, I feel that I can review it appropriately, for the most part. This season has quite a fair share of decent anime, and I was expecting Magical Warfare to be one of those, seeing as I saw a lot of talk about it before it aired. However, it let me down, and I am thoroughly disappointed. I guess one could say that this show is a perfect example of \"all bark and no bite\". Anyways...\r\nStory (3/10):\r\nSo far, the plot has been extremely simple. It's execution has been even worse. Two characters (one mage, one normalhuman) meet in a high school and the human manages to take on the people chasing after the mage with his new magical powers. Somehow, his friends get wrapped up in it and they all decide to go to magical high school in the new magical world. There's some weird problems and some bad guys and nothing new or exciting is happening.\\n\\n\r\nArt (3/10):\\n\r\nThe background/setting art isn't terrible, but the character art is bland. Most of the time, the characters lack noses and have poorly drawn facial expressions. I've seen much better art in a show that was made eight years ago, and I'm sad that some shows released in 2014 can't come close to that.\\n\\n\r\nSound (6/10):\\n\r\nThe sound isn't amazing, but it's the shows strong part. Effects sounds don't stand out too much, but I've heard a couple decent OSTs. The opening song is nothing special, but the ending song by Nano is good.\\n\\n\r\nCharacters (2/10):\\n\r\nYou can tell characters are good when none of them are annoying, and when most of them have an actual purpose for being in the show. So far, I've found every character in Magical Warfare to be annoying as hell, especially the simple-minded kid with the blond hair. So far, the protagonist's friends seem to be there just to enjoy the ride, but I'm hoping they'll do something with them later in the show. Also, development is non-existent so far, so I won't bother typing up a separate category for it.\\n\\n\r\nRelationship Development (3/10):\\n\r\nThis is a category that I haven't seen in many reviews, but I feel that it is important. Characters describes how good the characters are and why, Character Development describes how the characters are changing, and Relationship Development describes how characters are changing in the context of each other. Basically, changing emotions directed from one character to another is a form of relationship development. So far, the protagonist and the two female protagonists have been trying to sort out what they think of each other, and what they should be doing with other. They've spoken about it, which is where this category earns some points. Beyond that, nothing has happened.\\n\\n\r\nEnjoyment (3/10):\\n\r\nI'm finding it rather stale. I won't drop it because I don't like dropping shows because I like to see where they're headed, but I don't particularly look forward to watching Magical Warfare.\\n\\n\r\nOverall (3/10):\\n\r\nThe sound is decent, but the rest is pretty bad. I hope they can revive it in the last five episodes.",
            "date": "2014-02-24T23:06:00+00:00",
            "helpful_count": 7,
            "mal_id": 133815,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3249065.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MrSmexyTheBeast",
                "username": "MrSmexyTheBeast"
            },
            "url": "https://myanimelist.net/reviews.php?id=133815"
        },
        {
            "content": "Mahou Sensou...\r\nThis is one of those shows that i plan to watch this winter... long story short, this is a big disappointment.\r\nI don't like long reviews, i'll make this short\r\nStory: 5\r\nMeh, MC hates the real world, Darling Mui gave her powers... then MC got evasive magic... MC fought a guy with a badass sword, he fights with a bamboo sword... #animelogic \r\nArt: 8\r\nI like the art though... Not much to say, i'm not a critic. \r\nSound: 6\r\nNot bad... Not good.... But the first few seconds of the opening is stuck in my head for weeks now XD \r\nCharacter: 7\r\nThe characters are made well, especially Mui,mui is love!\\n\r\nOn a more serious note, the characters are a little bland, but they're drawn (made? digitally drawn?) pretty well\\n\\n\r\nEnjoyment: 7\\n\r\nMeh.... It kept me entertained while the other ongoing series haven't aired the new episodes \\n\\n\r\nOverall: 5\\n\r\nBland....\\n\\n\\n\r\nBut Mui-chwan is love!",
            "date": "2014-02-21T05:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 133335,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2454135.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lolicon1101",
                "username": "Lolicon1101"
            },
            "url": "https://myanimelist.net/reviews.php?id=133335"
        },
        {
            "content": "I know that this review may not be the popular opinion, but I think this series is pretty good! But I can understand why there is some hate. It was a very hyped up show. The story seems to move slow at times, but it seemingly continues to draw you in. When it does get moving, it is very entertaining! It has its fair share of twists and turns that lead into some good character development. The relationships between characters are a mystery at times, but are well done. The storyline is decent, but has some awesome moments. If it had a bit more timeto develop, i think the series as a whole would be better. (Though it would seem the door is open : D )  Overall, definitely not the best. But far FAR from bad. The series definitely has the potential to be something great. But the key word in that is POTENTIAL.",
            "date": "2014-03-27T20:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 137351,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3093261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DatDamnPR",
                "username": "DatDamnPR"
            },
            "url": "https://myanimelist.net/reviews.php?id=137351"
        },
        {
            "content": "Overall: 4. When a serie is rushed to the end, or is interrupted, its a bad sign.\r\nStory: There is war, and there is magic. Quite common, but it's alright. It's hard to see some original work. The plot was not developed as it should be.\r\nArt: so-so. Not great, not bad.\r\nSound: The background music fails to dictate the feeling. Not that the plot helped.\r\nCharacter: the character development is too much predictable. Too much.\r\nWell, not a great adaptation of the manga. If it was serialized, then the manga should not be such a disappointment.\r\nWhat I enjoyed the most is a fight that happens in the middle. Reallyliked. The only reason that made me watch to the end.\\n",
            "date": "2015-04-25T19:48:00+00:00",
            "helpful_count": 6,
            "mal_id": 186462,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Djap",
                "username": "Djap"
            },
            "url": "https://myanimelist.net/reviews.php?id=186462"
        },
        {
            "content": "Magical Warfare more like magical bullshit!! lets get started. We follow main character TakeshiT as he goes on several quests that have nothing to do with this confusing ass plot. Magical Warfare has been compared to Harry Potter all and I mean alot Idk if these guys are blind are what because this sack of shit is nothing like harry potter. The story in this anime changes at least 3 or 4 times.Apparently our MC has a rare magic that can predict the future and is the only one who can use some ancient sword called twilight. Let me remind you even though he trainsall the time somehow his little brother is able to kick his ass in about 30 secs (which I thought was hilarious). After one of the main female characters gets kidnapped by his evil OP little brother, he realizes he must become stronger in  a couple days so he can rescue her.I'm so sick of the cliche shonen nakama power crap. The show had an interesting concept about if your exposed to magic in your teens who become a magician I actually thought it was very interesting. Then I realized I made a horrible mistake nothing in this show is ever explained clearly so the audience can have some ideaof what's going on no they just throw in story after story like that were just pulling the script out of their ass at the Last minute. The show doesn't have a main objective to its cringe worthy plot. Also the show changes it antagonist almost every fucking episode you don't know who the real bad guy is. This has to be the only show I've seen with such a piece of shit ending yeah it fucking sucked I was so confused I spent an hour online trying to figure out what the hell happened. What basically happens is while takeshiT is getting his ass beat by his little brother (again) he rescues the female friend that was kidnapped then  shes  killed accidentally by the little brother after she saves TakeshiTs life ,angry he goes into bootleg super saiyan mode and kicks his brothers ass then out of no where there's this giant explosion causing the MC and his brother to travel several years back in time. The End that's it we don't even get an explanation or hint why they go back in time , nothing is fucking explained. The characters are 1 dimensional as hell to we have our boring protagonist who has girls lusting over him for his kindness(I smell bullshit) there's nothing special about him at all we can't relate to him or get attached to him because he's so bland and uninteresting the other characters aren't even worth mentioning because all they do is make him look like a hero or a badass. All the character are bland and follow every stereotype there is. There is zero character development between the MC and his so called friends. The romance goes no where and all the protagonist does is give corny speech that makes all the girls blush and get there panties wet, yeah that's it. It feels like someone   tried to remake  absolute shit ....cough.... I mean absolute duo, but made a anime far worse. The sound and art are ok the fight scenes where kind of cool\\n\r\nand the magic animation was ok I guess. Anyway I didn't enjoy this piece of shit don't watch it you'll be wasting your time watching these 12 episodes of garbage \\n",
            "date": "2015-09-16T09:11:00+00:00",
            "helpful_count": 6,
            "mal_id": 198706,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4802385.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/BaconKingpin",
                "username": "BaconKingpin"
            },
            "url": "https://myanimelist.net/reviews.php?id=198706"
        },
        {
            "content": "First of all, I haven't finished watching this anime but I doubt my opinion will change that much. I should also point out I went into watching this thinking it was ecchi or harem. It's neither of those, but that is just my problem with it, it doesn't have to be yours.\r\nBut from a standpoint of is it good? IMO, not really.\r\nThere is a story and its not a bad one, but it feels rushed in a way. From ep 1-2 it felt like an entire season has passed because the main characters went from a totally normal world with no prior knowledge to beingmagicians.\\n\\n\r\nBut the main protagonist. Oh boy. I get it, he is scarred by some traumatic accident with his brother. But he is a total bloke. When everything is okay, he is emotionless but when shit hits the fan he is the first to yell \"I WILL MAKE YOU UNDERSTAND!\". Idk, I just don't find his character in anyway pleasing. He is always embarrassed ONLY not when there is some girl in trouble, then he is the first to show up and be full of himself. He is a contradictory character IMO.\\n\\n\r\nThe music is good though. Pretty pumped up. If only the anime was as half as the music, then I would of finished watching it. But now I feel like dropping it because its dull and stupid in many ways. The combat is kind of meh as well.\\n\\n\r\nI wouldn't recommend it but try it out for yourself.",
            "date": "2015-03-04T10:44:00+00:00",
            "helpful_count": 6,
            "mal_id": 181689,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488989.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/daimonfo",
                "username": "daimonfo"
            },
            "url": "https://myanimelist.net/reviews.php?id=181689"
        },
        {
            "content": "It's a shame that this anime turned out to be so disappointing.  It had a lot of promise but it really got screwed over.  This anime is based off a ten volume light novel series of the same name but fails to provide an adequate adaptation.  Even the author of the novels didn't like it !\r\n Mahou sensou has an interesting enough premise : the main character Takashi has a troubled home life and one day he and his friends are put in a war in the magical world. This could of been a great piece of work but the writers wouldn't let that happen. Fromwhat I ready from others, the anime tries to adapt 6 volumes of content into 12 episodes.  I can't verify this considering how the novels aren't even translated in English and the manga adaption follows the same route as the anime.  Compressing the story to 12 episodes really hindered it's performance as the pacing is jumbled . Some episodes are just slow while others felt like more content could of been added.\\n\\n\r\n The characters don't stand out too much and Takashi feels just like yumeji from shakugan no shana ( another light novel anime with an incomplete adaptation ). Maybe the characters got more fleshed out in the light novels, I'll never know. I will admit that the live triangle between Takashi, kurumi and mui was really well done and that's coming from someone who doesn't even care for romance.  I felt that whoever did the composition for mahou sensou probably didn't even care for the source material and did some half ass job just to pass time.\\n\\n\r\n In terms of audio and visuals, this anime actually does something impressive.  It was animated by madhouse,  interestingly since this feels more like a jc staff type of show. The art is always pretty good and the animation is smooth, expecially in the ending song. Oh how I love the ending.  It's done by one of my favorite singers, Nano, and it's FANTASTIC ! The combination of wonderful visuals combined with an hard rocking song  provides an experience far more enjoyable than the actual anime. Seriously guys,  looks up born to be by nano.\\n\\n\r\n I truly feel sorry for the author of the books. I'm sure the light novels had a lot going for it and it sounds like it could work well as an American young adult novel series.  Madhouse really took the l with their adaption and just wasted so much potential. It really shows when the last episode end on the worst cliff hanger I've seen yet.  Since the light novels will most likely never be fully translated,  that annoying cliffhanger will be the only conclusion viewers will ever see.\\n",
            "date": "2016-12-18T13:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 235761,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4374209.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lazyking88",
                "username": "lazyking88"
            },
            "url": "https://myanimelist.net/reviews.php?id=235761"
        },
        {
            "content": "This is my first review after watching several animes in my life, I could say that I wasted my night watching this anime. I'm warning the people who are about to watch this then better check some other reviews and decide whether to jump right into this one or not.\r\nThe first episode captivated me and well I thought this would be dope, so I continued watching it until then, I noticed the huge gaps that the timeline that this show had gone. All I remember that they were about to face an upcoming war. Everything had gone so effed up like there was no clearexplanation of it. Thus this anime made a really vague plot development. They rush this anime and the good potential of it. Characters aren't fully developed for me and the whole thing is really a mess.\\n\\n\r\nThe art is mediocore and I'm not complaining regarding the art. \\n\\n\r\nOveruse soundtracks.\\n\\n\r\nCharacters are dull. The main character is one of the impulsive one and careless with his decisions.\\n\\n\r\nTimeline they leap like a really big one leaving the watchers confused. This would be good if it had a strong foundation when they jump to an event.\\n\\n\r\nBy the end of it this anime will leave you more with an unsatisfied feeling and a big disappointment of this year.\\n\\n\r\nThey didn't put too much effort on making this show and they just put something every episode that will keep the show running until it was done airing.\\n\\n",
            "date": "2014-05-02T22:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 142147,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3669261.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/miochan21",
                "username": "miochan21"
            },
            "url": "https://myanimelist.net/reviews.php?id=142147"
        },
        {
            "content": "This is just a quick review basically having to do with the final episode, completely ignore this if you will, just felt like I had to do this with what I managed to witness in the final episode of this series. Also this small review may spoilers.\r\nFirstly, what the actual fuck just happened in the final episode? I don't even think that's what you'd call an episode even. All I can say is my mind is full of what, after that ending I didn't even know what this was meant to be, but then again reflecting back on this whole series I guess you couldn'texpect anything amazing to happen, but let's be real here, is it really that damn hard to make a conclusion to end off this anime along with it's misery instead of bringing more questions to the series that most likely won't have any sequel to it whatsoever.\\n\\n\r\nStory: 4\\n\r\nThe story was just plain meh to me, firstly it's about some magical realm where the two worlds are separated, along with all this random crap that no one honestly would follow because of how confusing this series honestly is, like with this came some random fanservice here and there that was randomly added, I don't mind fanservice and I understand why'd you put it, but where it was placed was just completely ridiculous, it really didn't need to be there at all it just ruined moods of the series and everything.\\n\\n\r\nArt: 7\\n\r\nTo me, i liked the art to some extent nothing amazing, nor anything spectacular, nonetheless worthy artwork for this day and age.\\n\\n\r\nSound: 6\\n\r\nThe sound in the series was good, I quite liked the opening and endings also some fight scene background music was decent to hear, and it was also worked on by nano, with some English and some Japanese added into the songs as she always does.\\n\\n\r\nCharacter: 5\\n\r\nOkay, this is where a lot of the series falls off, mainly because of what they did with the supporting characters to help assist the main character and make the series a bit more interesting, sure every series needs it but this one in particular has to be one of the most appalling ways to set it out, because a majority of these side characters are completely useless, they legitimately have no use in this series but to add a small bit of story, they might as well have been imaginary figures to the main character's mind for all it mattered.\\n\\n\r\nOverall: 5\\n\r\nThis series is just too weak to get any more than a 5, at times it looked somewhat promising but in the end, it just left me confused and felt like a waste of time watching this, would I recommend this series? No. Definitely not, this series would just waste your time as well as in the end, leave you at a mind-boggle, as to what you just witnessed at the end, it just is completely pointless of an ending as well as a series.\\n",
            "date": "2014-07-12T09:40:00+00:00",
            "helpful_count": 5,
            "mal_id": 151669,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3228861.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/yusei757",
                "username": "yusei757"
            },
            "url": "https://myanimelist.net/reviews.php?id=151669"
        },
        {
            "content": "Okay about this anime....Where do i start....hmm...How about the story plotting . Its start with an explanation on how things were supposed to be explained yet they just love to do it in a very F way . At first , i understand about how two world actually exist . But after that , i dont even understand or see an actual story plotting . It does have a story but i felt like they just skipped some or possibility half of the story just for fun i guess . The arts are good and the sounds are okay . Characters does have its potential. The enjoyment are only for a moment cuz after you feel something is a little bit off , thats when you know its not joyable . Overall , i say mehhh its just a pathetic way to end an potential anime in a WTF way . Seriously , how and why did i watched this anime ? Ohh yeah...Its was on youtube top ten most awesome anime . How the actual F**k is this awesome ? Some are better to be unexplain i guess...",
            "date": "2015-02-02T08:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 179498,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4425611.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 1,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ToshibaKenichi",
                "username": "ToshibaKenichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=179498"
        },
        {
            "content": "Oh dear lord the HATRED I have for this show. This show was the worst anime I have ever laid my eyes on. Please Note that in order to accurately and thoroughly explain my hatred for this series I will be spoiling quite a bit. \r\nStory-1 \r\nWhere to begin with this wreck of a narrative? How about how it's one of the most generic things I've ever laid eyes on. This story goes through the check list like it enjoys ticking those boxes for a 100%. It starts with a flashback years ago the world was one and some people could use magic. Then thisevil guy tried to kill all non-magic users so the magic people split into 2 groups. The group that opposed Mr. Genocide (not his real name but all the characters are so generic that I forgot all their names and I'll be damned before I look them up) split the world into 2 parts 1 got wrecked and the magical people stayed there and the other was fine and the normal people stayed there. That is the basis of the story. Now some may be confused as to why its so low well that's because the real issues of the story come across from the characters so I'll talk about it there.\\n\\n\r\nArt-4 Nothing really wrong with it just standard.\\n\\n\r\nSound-4 See Art for feelings on sound.\\n\\n\r\nCharacters-1 Oh God the HATRED I feel for all of these Characters. I have been waiting for some time to unleash the hatred I feel for these characters.\\n\\n\r\nMC- Mr. Generic. Literally the most generic main character in anime history. Whiny, moody, always sad. There is nothing to like about him. Now the reasons why he's sad I understand and can accept. But all he ever is is sad. So even if it's justified it annoys me. The reason he's so moody is because his mom tried to get him to unknowingly kill his brother because she felt his brother was evil. Also his mom never showed him love.\\n\\n\r\nSC1- Goofy Fire Ring Guy. Delinquent friend of MC. Generic and uninteresting. However in one episode this guy whose power is FIRE, is trapped in a sphere of ice. At no point does he make any attempt to use his power to escape and at no point are we given a reason why he can't use his powers. So all he did was cry for the MC to save him. It was stupid and honestly made me pissed.\\n\\n\r\nSC2- Girl with Guns- Generic and underdeveloped.\\n\\n\r\nSC3- Girl with lipstick container- See SC 2.\\n\\n\r\nSC4- MC's brother- Weird, evil, underdeveloped and annoying.\\n\\n\r\nSC5- MC's Mother- EVIL. She tried to kill her son because she thought he was evil. Showed no love to her sons.\\n\\n\r\nFaction 1 \"Good Guys\"- You'll notice the quotation marks. Here's a list of things the good guys did: Genocide, Destroying a persons free will by changing their memories, kidnapping, threatening murder, extortion.\\n\\n\r\nFaction 2 Bad Guys. Here's a list of the things they did: Attempted Genocide, Destroying a person's free will by messing with their memories.\\n\\n\r\nI can only assume that the author was going for a both sides are really evil story where the MC would get an army of his own to beat both sides. If that was the attempt then it failed because THE MAIN CHARACTER IS GENERIC AS ALL HELL. \\n\\n\r\nEnjoyment-1. I hated this.\\n\\n\r\nOverall-1 The only anime I have given a 1 to so far. I hope it wears that with shame.\\n\\n\r\n Oh and this is an amendment to my original review. The series ends with the MC GETTING SENT BACK IN TIME TO BEFORE THE WAR!!! Of all the stupid plot twists/sequel bait they could throw in they decide Time Travel, something that has only been done good in like one series (Back to the Future), is the way to go. My God the balls on these people to hope for a second season.",
            "date": "2016-01-18T12:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 208842,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/pyrus917",
                "username": "pyrus917"
            },
            "url": "https://myanimelist.net/reviews.php?id=208842"
        },
        {
            "content": "Just finished Mahou Sensou. First thing that came into my mind: dafuq did I just watch? Was it a poor a-lot-much-shorter version of Bleach or what?\r\nStory: 6\r\nThe thing is, Mahou Sensou doesn't really have a storyline. In the first episode, main character, Nanase Takeshi, is accidentally turned into a magician by a girl named Aiba Mui, who had come from another world. Of course, his girlfriend, which is not actually his girlfriend and his friend are also accidentally turn into magicians. Then Takeshi decides to live in this world of magicians and learn how to use magic and then some romantic dramas appear, and thenMui is trying to save her brother and then the Second Magical War begins and nothing makes sense anymore. The plot is confusing af and the ending is nothing but a bunch of nonsense. But I'll get to that part later.\\n\\n\r\nWhy did I say that this is an unsuccessful version of Bleach? Let's see...\\n\r\n-MC turned into a magician by a magician (Ichigo & Rukia). \\n\r\n-The war between 2 powerful magic organisations (the war between Soul Society & Hueco Mundo). \\n\r\n-MC has a mother which is a former magician but never told him until she had to (Ichigo & his father). \\n\r\nAnd of course, the characters and the relationships between them:\\n\r\n-Takeshi & Isoshima (Ichigo & Orihime). She likes him but he's not aware of that.\\n\r\n-Mui & her brother (Rukia & Byakuya). Strong and protective brother and a little sister who admires him.\\n\\n\r\nCharacter: 4\\n\r\nLike I said, there's nothing original about any of the characters. The only one I hadn't mentioned is Gekkou, Takeshi's evil brother, who tries to kill him because of several reasons which are not very clear even now. Gekkou is literally screwed up. One second he is one side character of the anime whom you don't even pay attention to and one minute later he becomes the main antagonist. Ok... Isoshima is that kind of useless female character who keeps screaming the MC's name over and over again but does nothing to help him. \\n\\n\r\nArt: 6\\n\r\nI was expecting much more from a 2014 anime. The art is watchable but during fight scenes the characters are drawn awufully bad.\\n\\n\r\nSound: 9\\n\r\nThe sound was good, both the background sounds and the voices of the characters. Yeah, at least something good.\\n\\n\r\nEnjoyment: 6\\n\r\nDespite the fact that almost the whole anime doesn't make sense, I didn't drop it. Despite all the fucked up anime logic, I wanted to see the ending. I'm sure you've heard about anime with open endings beacuse I've see a lot, but let me tell you: this anime doesn't have an open ending. The ending is like: wtf? why did that happen but how is it even possible and why? You will have a lot of unanswered questions to which you'll never find an answer. You can't even speculate because the ending gives you nothing.\\n\\n\r\nAnother thing that I didn't like was that the action is rushed pretty badly in the last two episodes which have barely any connection with each other. Not only does the plot confuse us all, but we're also not given any details about the characters or their past. Like I said in the beginnging: I don't know what this anime is about? First Mui trying to save her brother from the bad guys, then the war between those two organisations or the fight between Takeshi and Gekkou.\\n\\n\r\nOverall: 6\\n\r\nI don't recommend this anime to you. It's pretty much a waste of time because in the end you get nothing. The characters are stereotypical and sometimes dumb and annoying. The logic doesn't exist and nothing makes sense (characters fighting and then chatting like best friends, Takeshi training himself to become stronger in the middle of the war, Isoshima being kidnapped and stuff and then no one gives a fuck about her and so on).\\n\\n",
            "date": "2015-06-24T15:11:00+00:00",
            "helpful_count": 5,
            "mal_id": 191156,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3512445.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Rawrzz03",
                "username": "Rawrzz03"
            },
            "url": "https://myanimelist.net/reviews.php?id=191156"
        },
        {
            "content": "I'm going to rate this based on the assumption that they won't even try to fix it in a second season. Like many other anime it just falls apart towards the end, like they're just making it up as they go. With a plot like this you might as well just show wizards fighting for the length of an episode without any context. But no, it had to pretend it was actually telling a story and as such it will be graded by those standards.\r\nIf you're looking for a plot, stay far away from this show. If what you want is a show with magicalfighting and don't care about it making sense, then I'd still recommend you watch something else. This show is not worth your time. I actually think 3/10 is too generous a rating, but it started out with so much potential.",
            "date": "2015-07-16T14:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 193585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1245719.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Orochimaru9",
                "username": "Orochimaru9"
            },
            "url": "https://myanimelist.net/reviews.php?id=193585"
        },
        {
            "content": "Since this series, due to the controversy, is not getting another season in this universe, I'm gonna fully put my foot down about how appalling it all concluded. Out of all ways to finish, this series probably had THE worst conclusion in all of anime history, and thus making this series one of the worst non-yugioh series I've ever watched that I still found a good amount of enjoyment while watching at the time. Even the author himself, I heard, later admitted that adapting his story was a mistake. Honestly, I think it ended up being handled by the wrong group, and it's quite adamn shame, considering how good it actually felt at the beginning.\\n\\n\r\nSTORY: WHAT THE F*** WAS THAT CLIFFHANGER ENDING?!?!?! There's no need to put this into details, because considering how this series will never get a second season, it is one of the worst wrap-ups I've ever seen in my life. Now, the rather decent yet mediocre plot of the world being separated into two dimensions as a result of a war between magicians and all that magical bullcrap, and then another war started cause the main characters are now involved with the magical world....that would've still be fine if the ending had any sort of payoff. Instead, after what was a furious tense fight, I'm stuck watching and waiting for how the main character would come out of that dream..........but nope, the anime ends right there. I seriously question the god damn sanity and IQ of the people who were in charge of directing this series. I don't give a crap about the budget or whatever. Even the Yugioh ARC V ending actually had some payoff and didn't end on an \"absolute cliffhanger\".\\n\r\nAbsolute cliffhangers is a term I've made up to describe endings where the series or movie ends while the story or plot is still stuck during the point of great conflict instead of a setup/buildup; these are the worst kind of endings when it comes to anime series (movies are fine as long as there's a plan for sequels), because even if an anime gets a sequel, there's the fact that you have to wait such a long time for that sequel; also, there's really no point in ending a series like that if one has to wait an elongated period of time. Now if the series doesn't get a sequel, the series looks even worse considering that if it's an adaptation, a lot of material was definitely compressed beyond comprehension. In short, the overall story was mediocre to decent, and the ending was literally the scum of the earth. Even middle-schoolers can write up a better conclusion for this series.\\n\\n\r\nART: Honestly the artwork of the series was okay, not a lot to really rave about, or complain about. I'm still personally not a fan of how the eyes are drawn in over the hair of some characters....it's sorta offputting. However, then there's the abominations of the episode previews....WHO THE F*** drew that sh**, and whose idea was that to bring a derp child's drawing as a host for a preview??\\n\\n\r\nSOUND: The soundtracks were alright, tbh...it did enough to get me glued to the screen during a lot of the fights that took place in the series.\\n\\n\r\nCHARACTER: I'll just be straight: the characters are bland and generic and not the most exciting...honestly I only watched for the waifus known as Mui and Kurumi, but even the cool characters feel tasteless after they \"settled\" into the plot and get swept up by its pathetic showing.\\n\\n\r\nENJOYMENT: Early on, I really did enjoy the fights as well as some of the funny scenes, including ship-worthy scenes. I still found something to like about the generic characters that were there as well. However, as for the whole story itself, due to how awful it turned out as it progressed and then ended, my enjoyment was thoroughly ruined by the absolute and complete lack of payoff and closure. In the end, my enjoyment level was not rock bottom, but very mediocre. Honestly, it makes me want to shove this series and its setting into one ginormous ygo-centered crossover fanfic one day and give it some sort of better role or closure.\\n\\n\r\nOVERALL:\\n\r\nIt's not the worst thing in the world, but it's one of the most disappointing series, at the very least. Now I know I may compare it to Arc V when it doesn't really fit, but I can't really help it. For something like Yugioh ARC V, watch it all the way, don't listen to anyone else, and then make your judgment afterwards, cause at least something like that actually has at very least a decent plot and a good enjoyment level.\\n\r\nHowever, for something like Mahou Sensou, if you must watch it, though I'd rather you not, watch up to like episode 7 and then just STOP....I mean, STOP, and then track down the LN however you can to finish the series properly (it's a shame that we'll never get to see the true ending in anime form).\\n\r\nIn short, a complete bait of disappointment with only a few waifus as a redeeming factor, better off avoided.",
            "date": "2018-01-22T20:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 269386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5242474.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Ryuseishun",
                "username": "Ryuseishun"
            },
            "url": "https://myanimelist.net/reviews.php?id=269386"
        }
    ],
    [
        {
            "content": "Well... i was enjoying this show for a while. Honest i did enjoy it for awhile. I even tried my hardest to ignore the GLARING plot holes... maybe i just missed a few things in the series and theres some super amazing time traveling plot twist that fixes everything. Maybe if this show gets a ova or a second season to explain the plot holes ill come change this score but for now gona leave it.",
            "date": "2015-08-20T15:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 196639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KouhaiSenpai",
                "username": "KouhaiSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=196639"
        },
        {
            "content": "OK I am glad I happened to watch this before looking at reviews (because we all know how that can go). This anime is supposed to be about a magical war, but really, you don't go into it know anything about what's going on and when you finish, you know even less.\r\nThere are odd explanations throughout the series which are more like information dumps but about what? Uh, good question. They're for characters you don't know well and didn't realize things were going on in the background. Uh...?\r\nI actually did enjoy the anime. I had questions and kept watching to see if they got answeredbut the ending of the anime left me annoyed. Not only is it a cliffhanger, it's a poorly crafted one at that. I was constantly left wanting more in this anime, but the cliffhanger was worse than the one for Zombie Loan (which was pretty bad) or High School of the Dead (which can't be faulted anyway since the manga was on hiatus). You're left in the middle of a random time skip. Did I say middle? I meant the beginning of one and yeah, don't know why it happened but guess I won't find out anything at this rate.\\n\r\nAlso, unless the translator in the last episode made a mistake or something, I was confused as to Kazuma's relationship with the mother. He called her mom...? Please tell me that's an error!\\n\r\nAnyway, I can say I did enjoy the anime because I like a little drama especially when it comes to a love triangle, but there are a lot of holes in this anime and if it doesn't get a 2nd season, they'll just be left like that.",
            "date": "2016-01-01T16:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 207488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4775014.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Jenangelx3",
                "username": "Jenangelx3"
            },
            "url": "https://myanimelist.net/reviews.php?id=207488"
        },
        {
            "content": "I watched this anime before reading any reviews. After seeing so many bad ratings for it, I was surprised since it seemed good to me.\r\nThe story is not special but decent. Unfortunately it was rushed towards the end which I think could have been done better. This earns it a 6 in story.\r\nArt neatly done except for the magic battles in the background, not much work was put into those thus making them look like little fireworks or explosions of color. The battles were excellent, same with magic effects that were up close. An 8 for art. \r\nSound fits just right, opening is alright notthat catchy same with ending theme. 7 for sound.\\n\\n\r\nCharacters are made well, mostly enjoyable but some will hate the main since he lets himself get beat up. There is also the girl(s) that shout his name every chance they have. \"Ichigo-kun! Ichigo-kun!\" \"Naruto-kun!! Narutooo-kun!!\" Sound familiar? 6 for character since most are cliche/common personality.\\n\\n\r\nI did enjoy this anime a lot despite its flaws. Enjoyment 9\\n\\n\r\nOverall I'll give Magical Warfare or Mahou Sensou a 7.5 - 8. You may enjoy it or may not. I think it does deserve a watch.",
            "date": "2014-08-31T22:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 158703,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4019879.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LuxanAndShadow",
                "username": "LuxanAndShadow"
            },
            "url": "https://myanimelist.net/reviews.php?id=158703"
        },
        {
            "content": "Can somebody please remind me to never watch a Madhouse anime ever again. I am grateful to Madhouse for producing many good anime, but can they please finish the anime in a second season instead of leaving us at an enormous cliffhanger every time at the end of the first one. Now I have one more anime on my completed list without knowing how it actually ends and it doesn't even have a manga, just a light novel, and to be honest the anime is not worth reading it. And here's all why: \r\nPLOT AND STORY LINE 📜\r\nWhen I saw this anime and read thesynopsis I knew that I shouldn't expect much of it. It is just another, average fantasy and  magic anime, with a mainly shallow story and characters, a poor romance, predictable events, annoying shoujo and fan-service elements and an even more irritating brother-complex story in the beginning. Still, the show manages to pull it self together and actually improve in the second half, but just a little bit. Here's what happens...\\n\\n\r\nIt all starts when our protagonist Takeshi Nanase stumbles upon an unconscious girl, Aiba Mui that after waking up casts magic and accidentally turns Takeshi also into a magician. He then realizes that the world he lives in is far more different from what he actually thought. What has always been one world is now revealed to be divided into two: the one he used to live in and the one destroyed in the First Magic War. Now with new powers, Takeshi and his two friends (also turned accidentally into magicians) Isoshima and Ida are trying hard to fit in into the new world by training hard and overcoming new obstacles. Also in their way, one of the magic communities called the Ghost Trailers that are using their powers to gain superiority in both worlds. As magicians, Takeshi and his friends are trying to stop the Trailers in order to maintain peace and prevent the beginning of the Second Magic War. \\n\\n\r\nAs I said, the anime isn't any good, at least in the beginning but it does start to get a little better after the 6th or 7th episode. The first half is revolves around Aiba chasing after her brother who doesn't remember who he actually is and some pretty annoying shoujo drama involving a love triangle between the main characters. I really don't know how I didn't drop this mess of a shallow plot and story line full of plot holes, but I didn't. And true I can't say that it became much better, but it does get a far more interesting story, I mean it gets an actual story that makes sense. \\n\\n\r\nIt reminded me of an anime that is probably better known to you than Mahou Sensou. It is Charlotte. They both start with a non-sense and mostly boring story that is not leading us anywhere, but it then turns into something that might even be worth watching. Mahou Sensou becomes an emotional, moving and somewhere intriguing story about the destiny of two brothers. Secrets are uncovered, everything starts to tie together and Takeshi realizes that it wasn't just an accident that brought him to the magic world. \\n\r\nAnd just as the anime introduced this new, fresh story, some amazing fights and new hints on what this anime is really about, it ends. Mahou Sensou ends with an enormous cliffhanger and I am pretty sure the makers are not planning on making another season. What's funny, even the author of the novel Mahou Sensou, Hisashi Suzuki hates the anime and thinks that it wasn't a good idea in first place. \\n\\n\r\nCHARACTERS 👩👦\\n\\n\r\nOh my, so many shallow, useless and annoying characters. All the characters are so simplistic and we have seen personalities like these in so many other anime. The two main characters, being Takeshi and his brother Gekkou are the only ones that kinda stand out with their personalities, but they're still nothing special or unique. The only unique thing that the makers did in the anime is that the useless side-kick is not a girl but a boy, Takeshi's best friend Ida. The female leads of the show, Mui and Isoshima were both pretty annoying and useless picturing the average teenage girl that only has one thing on her mind-love. Isoshima does get a character development later and actually becomes a more vital part of the story. I guess we'd have seen more if the anime actually had a second season. Bute yeah...\\n\\n\r\nANIMATION AND STYLE 💻🎨\\n\\n\r\nI hoped that they would at least do the animation good but this was horrible. I thought the whole time that my laptop charger was defect and that the laptop automatically decreased the brightness after it stops charging. But no, it was the animation of the anime that dimmed the brightness from time to time. In addition to that, I was looking forward to good fight sequences because I love magic action, but instead I got horribly animated fights that looked like a bad flip-chart movie.  The animation style was also nothing special and pretty disappointing on the whole. \\n\\n\r\nCONCLUSION 📋📌\\n\r\nMagic/ School anime having a mainstream plot, a boring story line, shallow characters and average animation should definitely have their own name. I suggest something like Mainstream Magical and Magical Warfare would definitely be their first representative. It is pretty obvious that I don't want to recommend this anime to anyone so you better go watch other anime. And if you really want to watch an anime with a school/magic setting, then go watch Tokyo Ravens or Charlotte, because everything is better than Mahou Sensou. Trust me.",
            "date": "2017-07-09T09:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 252379,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3873351.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/animegirlism",
                "username": "animegirlism"
            },
            "url": "https://myanimelist.net/reviews.php?id=252379"
        },
        {
            "content": "I don't usually hate a work of fiction. Usually if I didn't like it, then it either was disappointing but not bad or it just wasn't for me. It takes a lot to make me actively hate your work.\r\nSo where does Magical Warfare \"succeed\" where so many before it \"failed\"?\r\nTo be fair, it starts off pretty well. Our main character is already in a relationship with a girl, the system of magic used is interesting having been split into around 6 or 7 different schools that range from the usual slinging fireballs to matter manipulation to battle precognition and the setting is a good enoughmasquerade-style setting which justifies the \"magic high school\" setting reasonably well.\\n\\n\r\nSo where does it go wrong?\\n\\n\r\nThe MC's relationship? Turns out that's a \"fake relationship\" just to keep creepy guys away from the girl in question. She wants it to be genuine, but it will never happen because of one thing. She's not the designated love interest so she hasn't got a prayer. The story practically bends over backwards to try and make these two work, actual chemistry be damned, and it's painful to watch.\\n\\n\r\nThe magic system? What should've been an interesting idea that allow the various heroes and villains to show off their own takes on the various schools of magic isn't used at all. There are pretty much only two major fights and it’s battle precognition vs super speed. That's not bad on paper but it's bloody magic. Show some creativity.\\n\\n\r\nThe setting? The show eventually tries to add moral complexity to the whole thing by saying \"the good guys might not be that good\" and \"the bad guys might have a point\". It completely fails at this because it doesn't address the elephant in the room. Namely that the bad guys tried to destroy the world. I don't care how crappy your life has been, I'm not sympathising with anyone who thought genocide was a good idea.\\n\\n\r\nBut the worst part was the ending. That goddamn ending. I won't go into any detail in case you're morbidly curious, but nothing should have an ending like that much less a light novel adaptation by \"We don't do Season 2s\" Madhouse.\\n\\n\r\nThe only nice things I can think to say at this point is that I liked Kurumi (the fake love interest) and I wanted her to be together with the MC because she had actual chemistry with him even if it wasn't that much and that the general presentation for the show was passable. But this is Madhouse. Passable is a noticeable step down from what they're most known for.\\n\\n\r\nShould you watch Magical Warfare? Unless you're morbidly curious or you'd like to see what not to do for your own creative endeavors, HELL no.",
            "date": "2019-04-08T17:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 305806,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/HansFoster",
                "username": "HansFoster"
            },
            "url": "https://myanimelist.net/reviews.php?id=305806"
        },
        {
            "content": "The premise of the show is nothing particularly innovative, the title speaks for itself. It's a real-to-magical world transfer concept (otherwise know as the isekai genre) that has become rather popular with the current generation; and I am a sucker for it as well so it seemed like a safe watch.\r\nAs i got to episode 8 of 12 i was wondering why it was so poorly received in the various anime communities. The artwork would give mid-seasons Bleach a run for its money. The sound was passable as it is in most shows and the voice acting was above average (although the subtle \"nasal\" twiston Mui's speech did become a little annoying). The character designs and attitudes weren't for the most part cookie cutter tropes, but you may notice some popular character archetypes in the mix. Ironically, the support characters are far more interesting than the mains and you'll probably see this expressed in the various comment sections/forums.\\n\\n\r\nThe magic lore also avoided the cliché fire-water-air-earth gimmick, going with a more HxH or western take on magic by including black magic, corporeal (illusion), destruction, evasive (divination), acceleration (rudimentary telekinesis) and \"specialisation\" (which is never really touched upon further).\\n\\n\r\nOnce the final episode concludes you start to understand the negative reception the show has had as it ends on a rather tasteless cliff hanger. You also come to notice, despite what appears to be a segway for a second season, the lack of proper character growth and the fact that the magical lore never really was elaborated on beyond the initial explanation in the first episode, which all smacks of lost potential; but really it's that cliff hanger which really drags down the whole show as everything else could have been considered forgivable if it had only had some closure.\\n\\n\r\nA lot of shows suffer from an intended second season that never comes and this can certainly be put in that basket, if the show had some proper pacing and concentrated more on the characters than the wishy woshy plot that nobody really honestly cares for anyway, it could have been a solid piece of art.\\n\\n\r\nAt any rate, i feel like i gave the show a fair criticism/scoring. It certainly wasn't a bad watch, finale not with standing. If you don't like bad cliffhangers i wouldn't recommend this, if you're mostly interested in just another magical world anime then you could do worse.",
            "date": "2019-01-24T04:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 299905,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5840782.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/grazr",
                "username": "grazr"
            },
            "url": "https://myanimelist.net/reviews.php?id=299905"
        },
        {
            "content": "Gonna be entirely honest here; if you're impatient, don't watch this. If you're bored, don't watch this. If you're an action junkie, don't watch this.\r\nI found myself hooked in by the summary it had on MAL, and watched it every week while it aired. Things started out a bit like this:  \"Oh, I finish work at 5pm today, I'll watch Mahou Sensou.\"\r\nHowever, that phrase quickly became something along the lines of \"Oh, I finish work at 5pm today.... tonight will be boring, nothing good to do.\"  Seriously, this show got so boring the mere thought of it made me feel empty.\r\nStory\r\n-------\r\nAlright, I haven'tread the manga so I can't say this for sure... but I'm assuming this is an adaptation of the manga? An attempt at it anyway.  When I saw the cover art and the summary,  the words \"action,\" \"death,\" and \"magic\" came to mind, as it would. However, when it came down to it, action appeared in maybe... 5-7 episodes? Not to mention it only lasted for a maximum of 6 minutes, if even. On terms of death or loss, anything on that line... I don't actually recall it having occurred even once, excluding minor background characters. So much for a war....   And the magic is the mainstream idea, evasive magic, destruction magic and so on.\\n\\n\r\nArt\\n\r\n----\\n\\n\r\nI didn't find the art too bad, but it wasn't remarkable. I mean, they could've put a bit more into, say, the uniforms, or even the hairstyles; pretty average. Character faces and hairstyle was pretty much by-the-textbook, nothing too adventurous. Still, it's not like it'll make your eyes bleed, it's pretty smooth.\\n\\n\r\nSound\\n\r\n--------\\n\\n\r\nEh, soundtrack was pretty average, not quite as catchy as it could be. The voice acting seemed.... lacking something. Emotions perhaps. It wasn't flatline on things like emotions, but it was a little lacking. As for SFX... pretty average, yet again.\\n\\n\r\nCharacter\\n\r\n-------------\\n\\n\r\nY'know, some of the characters were actually pretty good, whilst some were lacking. There's something like 4 main characters. One or two of them are pretty interesting and have a bit of depth, the others are kinda empty, y'know, average clingy girl and average delinquent guy, not exactly interesting.\\n\\n\r\nEnjoyment\\n\r\n-------------\\n\\n\r\nAs I said above, you sorta get enjoyment for a few episodes, but it quickly wastes away into the sort of dust you get on your desk after you've been on holiday... You know, that dust you immediately sweep onto the floor and never think of again. Pretty harsh, yeah, but this IS a review. :/",
            "date": "2014-10-11T06:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 164407,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3276691.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ShiinachiSylande",
                "username": "ShiinachiSylande"
            },
            "url": "https://myanimelist.net/reviews.php?id=164407"
        },
        {
            "content": "Art: 10/10\r\nThe artwork was great,  the characters were well designed as well as the background which gave a sense of realism.  The magic spells were well created.  \r\nSound 9/10\r\nThe sound of the magic blasts and explosions were exceptionally created.  Unfortunately this anime doesn't use enough osts to create the emotions and mood.  I only heard one and it was repeated throughout the anime\r\nStory 8/10\r\nThe story was quite interesting but it was too plain.  It is basically about 2 sides fighting a war and the main characters will need to choose a side and get stronger to defeat the other.A commonly used plot in shounen anime\\n\\n\\n\r\nCharacter 10/10\\n\\n\r\nThe character design was very good,  Every character was created uniquely and played their roles properly\\n\\n\r\nEnjoyment 10/10\\n\\n\r\nI enjoyed all the parts of the anime,  the character development and such were very good.  There were also some very funny parts\\n\\n\\n\r\noverall 9/10\\n\\n\r\nThe only thing that needs to be worked on is the story which is very repeated and developed very slowly.",
            "date": "2014-04-05T02:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 138741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3361205.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EnergyFlare",
                "username": "EnergyFlare"
            },
            "url": "https://myanimelist.net/reviews.php?id=138741"
        },
        {
            "content": "For real, never watch this anime. The story is slow, we don't understand what is happening and nothing is well explained, the way the anime is directed is just horrible and the characters aren't charismatics.\r\nDuring the whole anime we are expecting for something better, but actually it goes worse and worse....\r\nThe secondary characters aren't useful, they are supposed to \"help\" the main character, but in reality they aren't helpful at all.\r\nEven in the \"side of the bad guys\" no one has an interesting ideology.\r\nAnd by the way if someone understood the end of the anime let me know ...\r\n(sorry for bad english)",
            "date": "2018-10-29T16:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 292954,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/-zemisteurT-",
                "username": "-zemisteurT-"
            },
            "url": "https://myanimelist.net/reviews.php?id=292954"
        },
        {
            "content": "WARNING THIS CONTAINS SPOILERS: Enjoy the review ^^\r\nLets talk about Plot-holes\r\n- In the beginning... Why are they chasing that girl, they explain it but it doesn't really make sense... they also don't really explain why this and that happens it just happens and you just want to appreciate the action because it is alright\r\n-Why is it anyone who sees magic can become a magician, its the dullest idea i've ever seen, there is no special ritual or process that transfers you into magicians doesn't make you sympathise with the protagionist at all!\r\n-  Ending: They go back and in time for some reason, it servesno purpose and you're left at that what a crappy shit ending\\n\r\n- Content: Its jammed packed as it is, being a 12 episode series. They push as many as ideas as they can into your face, its hard to concentrate on the anime without getting lost, i managed to keep up. But i feel like the writers had plenty to write about, but they decided to jam it into the last 3 episodes, perhaps they were like \"oh shit its the 9th episode it was boring... lets ramp it up!\" It is understandable that it was getting bad reviews\\n\\n\r\nOverall, the anime doesn't compel you enough to want to care about the characters, you don't feel sympathy, you don't care what happened - because frankly i lost track, it isn't emotionally driven like some animes, they don't help you understand why anything happens, the protagonist is naive - he doesn't have any guilt for what happened to his brother? -> he also barely responds to any emotional impact pretty clueless i think naruto would have gotten a clue. On the other hand, it ideas behind the anime i loved em magic type animes are beautiful, but the fact they didn't take the time and effort to plan it all out instead of condensing it into this flat 12 episode anime it feels a bit empty. \\n\r\nWatch it for the action, the story leaves you more confused than the plot line.",
            "date": "2018-07-15T03:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 284017,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KayTran",
                "username": "KayTran"
            },
            "url": "https://myanimelist.net/reviews.php?id=284017"
        },
        {
            "content": "This one didn't deserve most of the hate that it is getting. It may not be mind blowing but it has a LOT of things going for it: cute girls, magic powers/fighting down fairly well, all sorts of mystery and twists and turns, a plot that is paced well, lots of character development, good animation and OST, bad guys you love to hate, characters who turns from good to bad and vice verse, basically is had a ton of tropes but they are generally done well. There are some dropped plot points, and some things that are smoothed over a bit too nicely but thatis typical in this genre, it is tough to do so much in a single season.\\n\\n\r\nSo here is the problem... the ending is GARBAGE. It literally ends on a cliffhanger, basically mid-sentence. I have seen anime put their eggs in the sequel basket many a time before, but this is just ridiculous. Literally there is 0 resolution, but not only that but there are characters who may be alive or dead, insane plot twists that occur the last 30 seconds that blow your mind, all sorts of pieces to a puzzle that you will NEVER find the answer to. If not for the ending this would be a solid choice but I honestly can't recommend it. You will be left scratching your head and wondering what you did to deserve to have a story you got sucked into literally cut in the worst and most confusing way possible. \\n\\n\r\nDAMN YOU GEKKOUUUUUUU!!!!\\n\\n\r\nStory 4 / Art 8 / Sound 8 / Character 7 / Enjoyment 8 (until the last 5 minutes) / Overall 6 (but I can't recommend).",
            "date": "2016-07-11T23:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 223809,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=223809"
        },
        {
            "content": "What can I say about this anime that no one else can say? Nothing much really. The story about a boy named (whatever) who randomly comes across a girl,  who randomly faints, then he takes to the nurses station at his school...cause for some reason everything is randomly happening at his school. Then she randomly attacks and just so happens to give him magical powers. Then some guys come in claiming they need to take the girl which causes generic anime boy archtype to fight for her and although he just got powers he's totally on par in skill and abilities with a guywho is taller, more muscular, and dare I say it...better looking than him. So he wins. like we all never saw it coming and he escapes with the random anime girl archtype. Cause saving the life of someone who just tried to you should be number one on your list.\\n\\n\r\nWhile running they pass anime archtype bestfriend and one of the bad guys attack him. Then anime archtype wannabe girlfriend of main character shows up and gets attacked. Then the bad guys fight the MC and he totally outsmarts them and win the day. Then they are taken to a portal that opens up to another world that is for some reason still Tokyo but an even more messed up version than the one that already exists. They go to a school for magicians because...you guessed it, all the friends suddenly have magic powers.  Apparently, if a magician attacks someone in the non screwed up world that person will just get powers. But if you attack another magician in the same world, you'll lose all your powers. \\n\\n\r\nNow let us stop here and put our thinking caps on. These magicians traveled to a world where if they attack each other they will lose their magical powers, to attack each other with magical powers. Of course the archtype damsel doesn't lose her powers, even though she's attacking magic users with magic powers. As well as the MC. Of course the writers then realized this and put in a throwaway explanation as to how none of their attacks are really magic or how it's not ancestral magic and therefore don't count. Nevermind that about a good seven episodes in never mentions this again.\\n\\n\r\nSo they head off to a magic school in sh*tty Tokyo that just so happens to be protected and totally safe while the rest of the world looks like Satan threw a Kegger. They are told that they have a choice, either stay in that world and keep their magic or go back home and lose them...because they cannot be allowed to return home because it is dangerous.\\n\\n\r\nThey all choose to stay. Let's all ignore that in the same episode they are allowed to go home, inform their parents they are switching schools, and pack up, and then in a later episode go home for winter break. yeah let us just forget all about that.\\n\\n\r\nThe anime does what these animes usually do which is set up a love triangle that is never really a freaking triangle.  Iso(side piece) likes Taka(MC) and Taka likes  Miu (damsel) who likes him back. Apparently he was only pretending to be Iso's boyfriend to help her out cause all the dudes like to hit on her, naturally she began to like him and he enjoys playing dumb about it while keeping her on cause he pities her. Miu looks like she's 12 years old and has a brother complex that is outright incest based on a scene of her telling her \"brother\" to pet her *there* as she takes off her bra. yes the anime has some fan service. a lolicon with tits who is in highschool so she isn't a lolicon. But the creators of this anime has made sure that no one walks away pleased and therefore you won't get much out of watching this show. \\n\\n\r\nThere is really nothing to see here. Just terrible pacing, an awful MC, typical side characters complete with desperate chicks, wannabe lolicons, lazy Bleach wannabe storylines, and villains who are just evols for the lulz. Naturally the MC is a threat and for no real reason other than he is the main character and he is supposed to be. The guy is as dense as a box of freaking rocks and not in a comedic sense. \\n\\n\r\nExamples:\\n\\n\r\nDoesn't know Iso likes him, even though it's plain for everyone to see.\\n\\n\r\nHe's told not to sleep with his sword by his bed or it will drain his power and he will die. So the next night he sleeps with his sword by his bed and almost dies then act shocked that he was going to die.\\n\\n\r\nIs obsessed with helping Miu with her brother problems and emo out over his own problems with his brother yet doesn't bother to go home and fix his own issues with his brother.\\n\\n\r\nFor some odd reason I watched until episode 7. As bad as it is I had to see what would happen next, only to have random time skips, jump cuts, fast wrapping up of \"plots\" or vanishing \"plots\" to greet me. Most likely won't continue.",
            "date": "2014-02-21T21:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 133425,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/846605.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Hazegurl",
                "username": "Hazegurl"
            },
            "url": "https://myanimelist.net/reviews.php?id=133425"
        },
        {
            "content": "The plot was interesting and I feel like it would have a lot of potential. However, it wasn't well developed. Perhaps it would've been better if the series was longer. As I was watching, it feels like too many things were happening and none of them were clearly explained. It touched upon too many subject but only grazed the surface of some at best. The others were mentioned quickly and left me in a state of confusion as to whether I should try to understand any potential deeper meaning or simply let it go. The characters' background weren't really explored. Although some relationships/feelings were stronglyhinted throughout the show, none of them really went beyond that.\\n\\n\r\nI was particularly disappointed with the ending because I felt like it was leading to something exiting, but the story suddenly cut and dropped the ultimate bomb: even more confusion. It felt like a cliffhanger that would be resolved in the next episode (that does not exist) or prepare the ground for a new season (also non existent to my knowledge).\\n\\n\r\nI guess it's not that it was particularly bad, but rather, it was unsatisfying. There were too many mysteries left unresolved and many things left for the audience to fill with their own imagination. All I can conclude is great plot, poor development.",
            "date": "2014-06-05T11:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 145981,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3822721.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AceOfNoTrade",
                "username": "AceOfNoTrade"
            },
            "url": "https://myanimelist.net/reviews.php?id=145981"
        },
        {
            "content": "I feel sorry for anyone who walked into this anime without reading any of the reviews first and had high expectations for it because they're in for a BIG disappointment. \r\nStory- I think the plot is decent. From the four episodes I saw, I got the typical \"the protagonist is the chosen one who will fulfill the prophesy and save the world\" kind of vibe. Of course he gets mixed up with someone with their own issues in a world unknown to him and then he accidentally becomes special. That's all fine and dandy, but the problem is that the story is rushed and sloppy.They didn't even take the time to properly introduce the main characters or give a decent view of the school they were attending much less the town they lived in (and it gets disregarded after the first few minutes anyway). The main characters get pulled out of nowhere and suddenly involved in a battle with the stranger Takashi (the protagonist) meets and then (spoiler alert) they all become magicians. This all happened in the first episode. By the 4th episode you could have gotten the impression that they've already fought in countless battles together. Takashi and the girl he meets suddenly have a 10 episode bond.\\n\\n\r\nArt- It's nice, but they don't give proper visuals of their surroundings. Sure you'll know that they're in a school, but you'll have no idea what it looks like, where it's located and then they just skip ahead to wherever it is that the characters end up. Somehow Takashi just knows where Mui is in a world he's never navigated around before. Basically, there isn't even enough to leave to the imagination.\\n\\n\r\nSound- The voice actors seemed appropriate to me and I liked the the opening and ending theme music. The back tracks were all typical and boring. Seriously, I predicted what they would all sound similar to before they started.\\n\\n\r\nCharacter- Their personalities are pretty clear, but I can't say much because I only saw 4 episodes.\\n\\n\r\nEnjoyment- I was really hyped up in the beginning and actually enjoyed the first episode, but then they went ahead and made everything cliche and mediocre.\\n\\n\r\nOverall- It's a 4, with this kind of plot it could have been great with its own unique twists. The concepts of magic like the different types that exists and how things became the way they are today was well explained, but they just didn't bring it to the next level I was expecting it to reach.",
            "date": "2014-03-12T22:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 135577,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Izanimelife",
                "username": "Izanimelife"
            },
            "url": "https://myanimelist.net/reviews.php?id=135577"
        },
        {
            "content": "This could've easily become a massive hit, one of the best anime's out there, but.. It was horrible.. Almost a waste of time..\r\nThe story, the idea, the characters, I love everything about it, but the whole anime has become a failure.. The pace for one is horrible, there's not a single thing that you can understand, all of a sudden they get these new powers without you knowing it etc.. It's like your not watching ep 1 2 3 4 5... etc, but 1 4 7 9 etc... This on its own ruined it, because you do not gain the experience the characters do, allof a sudden they can use magic while in the ep before that they struggled even initiating magical powers..\\n\\n\r\nNear the end it got even sloppier, all of a sudden things are okay again, they kinda 'teleported' away from their goal in my opinion and then the end is the worst of all. I'm not going to spoil anything for anyone who will try and enjoy the anime, but it's horrible.. could've been a 10/10, now it's not more than a 3 or so imo...",
            "date": "2014-03-30T04:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 137867,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2074989.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 3,
                    "overall": 1,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Temojikato",
                "username": "Temojikato"
            },
            "url": "https://myanimelist.net/reviews.php?id=137867"
        },
        {
            "content": "Mahou Sensou, one of my most anticipated anime. Once I heard about his anime, saw pictures, etc; I was exited, maybe a bit too excited.\r\nTo begin with, the story was fair. I like the whole idea, but how it was executed wasn't very good.\r\n6/10\r\nNext is the art. The art was good, nothing special to me.\r\n7/10\r\nProbably one of the better parts of the anime is the sound. The choice of voice actors aren't what I would've liked, but the opening and ending songs are great.\r\n8/10\r\nThe character development was fair. It had its moments, but at the same time, it has its downsides too. There was someunneeded fanservice, one of the characters (not going to mention who) I hated with a lot. Maybe it was his attitude or something else, but he isn't very likable.\\n\r\n6/10\\n\\n\r\nAlthough I didn't like the characters all that much, the rest shows that this anime is good.\\n\r\n7/10\\n\\n\r\nOverall, the anime is good; it had a lot of potential.\\n\r\n6.8/10 (Overall)",
            "date": "2014-04-03T20:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 138551,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3278169.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jiyin",
                "username": "Jiyin"
            },
            "url": "https://myanimelist.net/reviews.php?id=138551"
        },
        {
            "content": "12 episodes, two plots about cast members evil brothers, complete and utter let down of an end. BTW no spoiler alert here because the first thing wrong here is the predictability. We all knew Takeshi's brother was going to join the ghost trailers from the moment he was introduced as a character, foreshadowed poorly by Mui's singular drive to get her brother back, which pretty annoying but at least it ended. Problem two is the age old scoobies problem, why have a supporting cast if they have little to nothing to do? Another issue is the lack of explanation or definition to their powers. Therewas five types of magic but no two magicians had the same powers. Isoshima used her power three times over the span of 12 episodes because she's eye candy/damsel in distress, Ida serves only as comic relief despite the fact his magic has great combat applications. I'm also confused by the progress of time in this anime; how long was Takeshi training to find Isoshima? And what was she doing this whole time? Gekkou didn't seem to mind she was missing the entire time. All the secrets and cliffhangers revealed in the last two episodes serve only to set up a potential second season that I'd rather not have to endure. I give it points for originality and not over exploiting the fan service. The characters are...well let me be honest here, Mui and Isoshima both clearly have a thing for Takeshi but don't say anything to him, or each other for that matter, about it because that would clear up the ongoing love triangle that seems pointless in hind sight. I hate this in anime, the unrequited feelings that lead to jealousy and envy whenever the main character so much as talks to another girl. How can you expect him to know how you feel if you don't tell him?! And then we get to the end. How many anime have I watched that only got interesting in the very last episode? I can add this one to the list. A second season would’ve allowed them to resolve the end and expand upon the characters, setting and story. Since there isn't one the end will literally leave you saying WTF for one reason or another.\\n\r\nThis series had great potential and it may have been better if it had more episodes to flesh out the characters and world they live in. Alors it becomes cliched and predictable and then let's you down. Demand better anime than this\\n",
            "date": "2016-11-01T16:24:00+00:00",
            "helpful_count": 0,
            "mal_id": 233038,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=233038"
        }
    ]
]