[
    [
        {
            "content": "Stories aren't always about narratives. Sometimes, we can discover more ideas by ourselves if we put our efforts through. And of course, discovery comes from experiences. For a certain shy and dull looking (I think she's cute though) girl according to her peers, she's about to experience some whole new changes in her life.\r\nHer name is Izumiko Suzuhara, the Red Data Girl.\r\nRDG: Red Data Girl is an anime series adapted from the light novel of the same name written by Noriko Ogiwara (The Good Witch of the West). Her talent of writing involves in the field of fantasy and supernatural so expect some of thosethemes from RDG. Otherwise, P.A. Works handles the production of the series. They are known for their usages of serene visuals and clearly does not disappoint; at least in the art department. However, the experiences I got out of this series is not exactly enthralling or exciting. In fact, it was something quite different.\\n\\n\r\nIn essence, this series is like a fantasy but takes place in modern times. The time period it takes place seems to be normal and likely perspective to our very own 21st century without high tech gadgets or space cars. Rather, it is a normal and typical school life setting in a modern civilization of development. Suzuhara Izumiko is the main female protagonist in this and she's always been shy. Even from the first episode, it's easy to pick out from the fact that she has a hard time socializing with others or being part of a group. It's not too surprising though by her nature considering the fact that she has been raised in the mountains. Or rather, Suzuhara has been associated with the Tamakura Shrine and along with her miko outfit, we can consider her to be a shrine maiden. \\n\\n\r\nThe series spells out some confusion and mystery. For example, Suzuhara seems to have a strange power that lies dominant in her and these powers are let out when she is near technology. This is proven when electronic gadgets she comes in contact with results in destruction. Additionally, her glasses when removed seems to gave her visions of the supernatural, or otherworldly beings. From an initial standpoint, it's hard to tell anything by how these powers came to be. For one thing, we know that it's some sort of ability and very likely has a connection with Suzuhara's origins. It spells out mystery and the viewers' curiousity may peak from some of these aspects; at least I know I did. Regardless of her strange abilties though, Suzuhara enrolls to Hōjō High School in Tokyo where her life becomes more normal. At least, that's what she originally hoped.\\n\\n\r\nThen on the opposite of the globe is Miyuki Sagara. This guy is essentially introduced as a prick. His attitude is literally a bully by the way he talks to Suzuhara and behaves around her. For whatever reason, Miyuki seems Suzuhara as a nuisance and more so because he is assigned to be her protector. Luckily though, their relationship seems to get better and possibly even go on the road of romance. It's at least not in the friend zone section but the two definitely has some engaging moments. These moments are captured by their dialogues and some development, especially after a certain event that reveals an even deeper secret of Suzuhara.\\n\\n\r\nThe secrets in this series also reveals some other aspects with the character cast. Take example, Mayura Sōda who is known as a cherry girl with friendly demeanor. However, she has more secrets and particularly gets caught in a rivalry among the school grounds. Among other factors, perhaps the biggest secret revolves again with Suzuhara. We learn that there's a supernatural vessel within her. It could be something related to a divinity or a goddess. We don't know too much about it but it has connections with her origins and the mysterious powers that she possesses. Unfortunately for her, she knows little about her origins herself or those powers. She does have a knight in shining armor though. But even so, Suzuhara still can't live the normal life a young teenage girl. With the ability to destroy electronic devices through an unintentional or intentional touch, she won't ever be able to use iphones, listen to ipods, or watching anime on a computer like most people. Damn, shame.\\n\\n\r\nAmong other factors, there's the serene like atmosphere that is constantly present in the show. The mountain atmosphere gives off a fresh scent of the settings and brings out a sense of realism in Tokyo that makes you feel right at home. The way some of the structures are designed as well to fit within the traditional Japanese ways. Needless to say, it presents its Shinto themes in the right direction. After all, Shinto is considered a spirituality and in Tokyo, there are many practices that establishes connections between them. In RDG, we can see some of the way the characters are dressed, the monuments, the festivals, the clear mountains, and shrines that are all over the place. The school itself is traditional and consists more of the modern atmosphere rather than anything too out of place.\\n\\n\r\nUnfortunately, the show is hard to grasp and connect together. There's a lot of confusion among the characters and what's there. The plot itself is also a bit loose and I find it dull at various occasions. The Shinto atmosphere might also not fit well for target audiences. In fact, RDG is more the type of the show where we have to expect the pace to start off slow, flow smoothly, and hopefully wrap up in a tolerable way. However, I find the pacing to be a bit intolerable. At many occasions, I find that the plot itself to be just too dull. It tries to present its story with a mythical narrative that plays along influences of the Japanese culture. At the same time, the way it executes it is not so exciting. Unless of course you're really interested in the Asian culture along with Japanese traditions, Red Data Girl may not be for you. However, there are instances though that I find the series to be interesting. The title character Suzuhara keeps her innocent outlook and seems to be on the side of a 'coming of age' drama. She is the 'miko' and host of a powerful divinity. \\n\\n\r\nBut for some things to care, there are the visuals. P.A Works handles the production of this series and the artwork gives a definition of beauty. As mentioned before, the artwork aesthetics gives the details to the surrounding atmosphere as well as the nature of the series. There's the mountain, the shrines, the outfits, and even spirits to match traditional Japanese ethnics. Of course, Suzuhara herself is drawn as a plain girl with the nerdy glasses and braids to match her statue. For one, I am pleased that P.A. Works is involved in this as it gave me a nostologia of Hanasaku Iroha and Tari Tari; at least in terms of visuals.\\n\\n\r\nAs for the soundtrack, the series maintains a balanced rhythm. It's nothing too special to take notice of as most of the time, the OST remains smooth and light. There's no intense beats or rock. Rather, there's this linear pace of natural sound. The OP song \"Small worldrop\" by Annabel is sung with a smooth voice and at the same time shows some possible foreshadowing. Then, there are the ED songs that plays off the traditional themes again. In the song itself, we can see that Suzuhara is walking as in a possible reference to her development in a modern coming of age/fantasy story.\\n\\n\r\nUltimately, I'd say this series is a gamble to watch. Some people may like the serene backgrounds along with the spiritual vibe that gives off while watching the show. Then of course, there are others who may be bored out of their lives of trying to figure out what is going on. Then, there are the folks who watches the show to pass time. It's a tough gamble but I hope it'll play well for you. Now, phew that was a lot of data to absorb, or rather info.",
            "date": "2013-06-08T10:05:00+00:00",
            "helpful_count": 154,
            "mal_id": 100255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=100255"
        },
        {
            "content": "I was really excited to try out this new anime this season. I saw its description on this website, and I thought \"okay, that sounds really interesting. A romance between a goddess girl who can't touch electricity and her servant protector of sorts.\" I even liked the first episode and thought the main character could become one of my favourites eventually. My only complaint was that I couldn't make much sense of the anime. But I figured that they would end up explaining things eventually, as it's only a 12 episode anime. 7 episodes in, and I have no idea what the hell is goingon.\\n\\n\r\nI really don't know what's going on. All I can understand is that some privileged high school kids with some awesome spiritual powers get to go to the best high school ever and have some weird disputes that I just don't understand. There hasn't been a single answered question so far even though we're more than half way in; in fact, they're just making us ask more and more questions every episode. Who the hell is Izumiko's mother? Why is Miyuki so weak? Why does the anime go from one crappy plot point to another without explaining anything? Who is Takanagi or whatever? Who are Mayura and Manatsu? What the hell is Masumi? Why do they care about a dying horse so much? Why do they fight? What the hell is up with spirits? Why is there a fan club for Mayuri? Who was that weird guy that asked Izumiko's to dance for him? Who is Miyuki's father? Who is Izumiko's father? Why is the anime named Red Data Girl? I just can't make any sense at all of this anime.\\n\\n\r\nArt: This is the only good thing I have to say about this anime. The art is good, one of the best I've ever seen. Though I have no idea why the characters except the main two look so bland and unmemorable.\\n\\n\r\nCharacters: the main character seems like she could be interesting, but she's barely in the plot at all. She barely does anything. Miyuki seems like he could be interesting but he just turns out to be a bland boring typical stern anime character. What the hell is up with Masumi, Takanagi (is this how you spell it?), the person who asked Izumiko for a dance, and Wamiya? Why are the Souda siblings so important? Manatsu is just bland and boring. Mayuri is too to the same extent, but she's also a bland boring moody brat. There's nothing likeable about anyone here.\\n\\n\r\nPlot: As I pointed out earlier, the plot doesn't make sense. It just jumps from one thing to another without explaining anything. It just is plain bad writing. Worthless.\\n\\n\r\nOverall: probably the worst anime I have ever seen--more than even Aku no Hana. 2/10 for good art.",
            "date": "2013-04-29T23:02:00+00:00",
            "helpful_count": 127,
            "mal_id": 95411,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/795335.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Olwen",
                "username": "Olwen"
            },
            "url": "https://myanimelist.net/reviews.php?id=95411"
        },
        {
            "content": "I'm supposed to be studying right now but whatever.\r\nOkay, unlike the majority of the reviews, I actually liked Red Data Girl. It's surprising 'cause I'm easily influenced by the reviews here on MAL. Before I watch an anime or read a manga, I always check MAL and read the reviews so as to see if it the said anime/manga is worth it.\r\nBut before I read the reviews on RDG, I watched a few episodes of it. And well, I really liked it. I think the best factor that got me hooked into the anime was the art (and maybe Miyuki /shot xD) and also thetheme. I always loved Japan and since the theme was about Japanese culture, I got myself interested.\\n\\n\r\nThen around the middle of the anime, I got confused. (Yes, just like all of you who watched) Everything was going too fast and nobody was explaining things at all. So, just in case I wasn't the only one, I checked the MAL reviews on this anime. I wasn't surprised to see negative reviews everywhere. All complaining about the same thing I was complaining about.  I was a bit discouraged to watch after reading all of the reviews, but when the next episode came out, I still watched it and even finished. :D\\n\\n\r\nSure there were so many unanswered questions but I think the anime was good enough. Although, it should've had more episodes so they could've at least explained some stuff.\\n\\n\r\nOkay, let's talk about the characters now.\\n\\n\r\nI really liked Miyuki's character development. (And I also really like Miyuki X3) He started of as the lean and mean bully who seemed to hate the world so much he'd rather jump of a cliff. But around the end of the anime, he started to warm up to Suzuhara. (*squeals*) xD\\n\\n\r\nThe other characters were okay, but nothing out of the ordinary. Suzuhara was the typical shy girl who struggles to become stronger in the end. Mayura, Manatsu and Masumi were cute, but again, they weren't very interesting. (Masumi got my attention a little bit tho. HE WAS SO CUTE IN THE END)\\n\\n\r\nMusic was good. I'm not good with critiquing sounds lol but I really liked the bg music and also the music when Suzuhara dances. :3\\n\\n\r\nOkay so overall, I really liked RDG and if you're into Japanese culture, fantasy and the likes, then this is the anime for you. ;)\\n\\n\r\nBut if you're an impatient person and if you don't like getting confused, then I don't think you'll like this anime at all.",
            "date": "2013-06-27T01:24:00+00:00",
            "helpful_count": 107,
            "mal_id": 102601,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/406941.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/gumi-tan",
                "username": "gumi-tan"
            },
            "url": "https://myanimelist.net/reviews.php?id=102601"
        },
        {
            "content": "RDG: Red Data Girl: Too Much Data And Not Enough Storage\r\nI have to say that this might be the first time I'm genuinely disappointed with a P.A. Works anime. After creating some wildly successful series like Angel Beats and Another, I had reason to believe that P.A. Works could be developing into a strong production company. Unfortunately, I have to chalk RDG up as a dud in their repertoire. I thought with the plot that this series had, it had to the potential to be really good but fell flat in the two biggest aspects...it's story and it's characters.\r\nThe biggest problem with this series isit tried to tackle way too many sub-plots with not nearly enough episodes to work with. It causes some extremely choppy pacing as well as several unresolved plot points. I found it's \"ending\" to be rather ironic since I was feeling the same way Miyuki was when I completed this series. For all the sub-plots going on in this series, it sure did find a way to bore me to sleep. Going back to the limited episodes, this series seemed to set itself up for a sequel and that could be the reason for unresolved plot points. However, I still feel P.A. Works left too many open. This series didn't have the closure it should've had, even for a series that would plan on continuing.\\n\\n\r\nI found the characters to be another huge weakness to this series. Their actions and lack of development left a lot to be desired. Still, I do believe the lack of character development does span from this series trying to introduce a ton of sub-plots. Really, the best way I can describe it is that this series suffered from an identity crisis. It couldn't decide if it wanted to be a plot-driven story or a character-driven story and as a result, it ended up being neither. I found it difficult to get invested in Izumiko and her \"plot\" because it was so damn confusing. It seemed like even the writers were having difficulty trying to figure it out. That's not to say it wasn't \"good\" because I found some aspects of it to be interesting. However, its progression and explanation is so choppy and so poorly explained that it strongly detracted from the overall quality of this series. Miyuki was one character I really got a bit of a laugh at because there was one episode later on in the series where I called him a male tsundere. You just don't see that in anime very often. I can't say it really did anything for the series, because the development between him and Izumiko was so hacked that I just couldn't become invested in their relationship (if you can even call it that). For the most part, the characters are fairly forgettable. I can't say there is one memorable character at all in this series. Maybe Masumi, but even that's a stretch.\\n\\n\r\nWhile I did find the story and the characters to be big weaknesses, there were some things the series did rather well. I really loved the artwork as well as it's traditional Japanese themes. The one thing I'll give P.A. Works is that they are very good with their animation and artistic design. While I did rip this series for having so many sub-plots, that's not to say it didn't have good ones. I did think the main plot was interesting albeit confusing, but it just seemed so rushed and choppy due to having so many sub-plots. I did find the sub-plot revolving around Masumi to be interesting as well as the one behind Wamiya. The sub-plots in themselves were \"good\" but suffered from choppy pacing and lack of strong progression due to having way too much going on in way too little amount of time. The atmosphere for this series was REALLY good and was what had me coming back week-after-week.\\n\\n\r\nAll-in-all, it's such a shame to see this series fall flat. P.A. Works is one of my favorite smaller animation companies and they've produced some really good anime in the past. However, much like it's most popular series (Angel Beats), this needed to be 24-26 episodes in the worst way. It had a good plot and good sub-plots, but it was so overly ambitious with how much this series tried to accomplish. It didn't have a smooth-flowing narrative and that in itself, caused some VERY underdeveloped characters. That's not to say I didn't enjoy watching this series because I did. It's just that after it was all said and done, it left a bitter taste in my mouth. I knew P.A. Works had something good going with this series but got overambitious with it. They tried to make it bigger and deeper than it had to be. It needed more of a focus on it's main plot and developing its main characters with that plot. It's extremely sad that I thought the Souda siblings got more development than the series' lead characters. I would only recommend this series to those with an interest in ancient Japanese traditions and lore. I found those aspects to be pretty good for this series. However, if you're looking for an anime with an excellent story and well-developed characters, it just simply doesn't have it and I'd say give this a pass if this is what you're looking for. Even if you're looking for a good romance series, this series is poorly advertised in that regard and doesn't have a good romance in the least. In the end, I feel its time P.A. Works really starts putting more of a focus on making bigger anime series because the 12 episode format is just not quite getting it done anymore, especially when it came to RDG: Red Data Girl.",
            "date": "2013-06-08T09:30:00+00:00",
            "helpful_count": 61,
            "mal_id": 100243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=100243"
        },
        {
            "content": "*This Review Contains Spoilers*\r\nThis was a series I really wanted to like and that I had high hopes for, but that ultimately fell flat. The story starts out clear enough (Izumiko is to be the new vessel for the Himegami, a mysterious and powerful goddess that could destroy the world, and Miyuki is her reluctant protector… together they must find a way to overcome their differences and figure out the mystery of the Himegami, etc.), but then descends into a mire of seemingly irrelevant side stories and confusing plot points involving clingy triplets, a sick horse, school festivals, student rankings, traditional dancing, and something calledthe “World Heritage”.\\n\\n\r\nI found that the series had quite a lot of exposition – only it was all about things that were seemingly extraneous to the main story and often longwinded, such as the relationship between the triplets, or the reason why Mayura is so focused on beating Takayanagi. Episode 9 had the most informative exposition about the origins of the Himegami, but even so, there was really not enough action to really give substance to it all. With so little of the main plot is actually explained, and a lot of poor pacing, I was left wondering what the point of it all was.\\n\\n\r\nAs for the characters, they felt mostly static the entire time, with the exception of Izumiko, who at least actually made some visible effort to change herself. Miyuki seems to have some development in his feelings towards Izumiko, especially in the last 3 episodes, with his growing concern about her, but he’s mostly petulant, and it’s not quite enough to get me to care at all. I can’t say that I felt much attachment to any one in this anime, which is disappointing since there was a lot of potential in the first 2 episodes.\\n\\n\r\nThe one area in which this anime shines, however, is in the visuals. The backgrounds are really lovely, and the dance sequences and depictions of Izumiko’s kimonos look beautiful. Character design was good but not outstanding. Unfortunately, visuals alone are not enough to carry a series.\\n\\n\r\nIn the end, the show does pick up just slightly around episode 9, but the ending is inconclusive and dissatisfying – probably a byproduct of having too much source material (6 novels!) and not enough episodes to really develop the world or the characters. The ending is left open and nothing is resolved, suggesting the possibility of a second season. I liked the premise, but this series really needed to have more than 12 episodes dedicated to telling the entire story in a cohesive and comprehensive way, instead of cramming everything into one season with hopes of resolving the confused narrative if a second season was green lit.\\n\\n\r\nFinal impressions: Started out with a lot of potential, mired by a host of side stories in the middle, and ends with its head just barely above water.\\n\\n\r\nVerdict: Source-material syndrome combined with an ailment in pacing.",
            "date": "2013-07-30T07:19:00+00:00",
            "helpful_count": 56,
            "mal_id": 107501,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2126757.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/bluevariance",
                "username": "bluevariance"
            },
            "url": "https://myanimelist.net/reviews.php?id=107501"
        },
        {
            "content": "Every season, at least one show comes along that has the potential to impress, whether it would be due to a particularly interesting premise, an animation studio associated with quality work, or a staff who has been known to work well together in the past. However, for whatever reasons, that show does not fare well in execution, ending up either forgettable or just plain disappointing. The Spring 2013 season was no exception to this, having a few flops in and of itself. However, personally, one show perfectly encapsulates this idea: P.A. Works' offering, Red Data Girl.Red Data Girl's premise is a hard one to describe without spoiling the first few episodes, leading to a synopsis that does not fully communicate what the show is actually about. The show does actually change locations entirely at the end of the third episode, with Izumiko going to high school in Tokyo and the plot shifting to a larger school conflict. The show itself is filled to the brim with charming, if somewhat generic, characters and the makings of a truly tense school drama. It all sounds fine on paper, but the execution makes Red Data Girl come off as inconsequential instead of truly interesting.\\n\\n\r\n     What Red Data Girl does right is incorporate many different aspects of traditional Buddhist and Shinto mysticism into the show's own structure, creating a very strange set of circumstances surrounding Izumiko and the rest of the cast. The dense amount of material to take in never feels rushed, with everything happening for an exact reason, abilities and limitations being discussed, and being overall accessible to those with very little background into either spiritual practice. As someone who is enchanted by Eastern spiritualism, seeing how they work with the bits and pieces brought up made me adore this aspect of the series. What I found particularly interesting was the nature of Izumiko's spiritual abilities, and what is later revealed about the spirit residing inside of her. When details about that are finally revealed, they do end up being quite intriguing when you put the pieces together.\\n\\n\r\n     The execution of the show, however, leaves a lot to be desired. The major problem here is the lack of focus placed on the main plot, which comes across as a wholly-serious popularity contest. The show executes this idea in a way that does not make it sound completely stupid, but it still does not resonate due to the fact that the results of this ongoing major plot are never on screen. Given the context it has with Izumiko and her inner conflict (which is barely any at all), it could have been better-integrated by being executed on-screen instead of just being discussed through dialogue. The dilemma surrounding Izumiko given the spiritual forces inside of her that may potentially bring about the world could have managed to meld into the seemingly mundane main plot to form something meaningful, but instead comes across as trying to do too much and not showing enough of what gets a primary focus. Even then, one element of the basic premise is barely explored, which is Izumiko's strange relationship with technology. It is brought up only once after the first three episodes after being brought up in the premise of the show.\\n\\n\r\n     There is a basic tenant in visual media: show, don't tell. Given the fact that the source material is a light novel, the overly narrative nature is to be expected, but this is where the magic of animation comes into play. Why constantly mention something happen in the background when you can show a shot of the event? It would be quite easy to do. However, this show refuses to put forward a potentially interesting plot by sticking it within dialogue only. The overall result makes the show feel insignificant and inconsequential.\\n\\n\r\n     The cast itself is filled with typical moe tropes, but each character definitely feels unique and consistent. Izumiko is your standard shy, glasses-wearing wallflower who wishes to be more out there and make more decisions in his life. Miyuki is a male tsundere but is tolerable despite the fact that he is a jackass in the beginning. Mayura and Manatsu can have some potentially great scenes together, due to Manatsu's ditzy behavior. The characters meant to be seen as villains, though, have very little in the way of characterization or personality, particularly in the case of Takayanagi. The motivation is consistently unclear with him, along with Yukimasa's true motivations, and the show does not do a good job of clarifying either of these.\\n\\n\r\n     P.A. Works and Studio Easter handled the animation and background art work on Red Data Girl, and just like all of their efforts in recent memory, impress more often than not. This project is no exception in the slightest, boasting a delicate style to its animation that is quite fluid and devoted to making the most out of its supernatural focus. When the show goes into its more spiritual focus, the effects compensate by having either eerily dark, vaguely humanoid shadows or by having grand, immaculately-designed yokai when called for. The background work is also the best yet from Easter, fitting the scenes perfectly and being gorgeous enough to just admire on their own. The opening is rather generic, going through a visual novel-like visual of each of the characters, with their names and everything scrolling by. The ending is walking animation, but yet again, the background art is so beautiful that it can be forgiven. The art and animation are definitely the strongest aspects of the show, despite typical P.A. Works character designs, which can be eerily doll-like.\\n\\n\r\n     The sound of this show can be a bit of a mixed bag. The score itself is not particularly memorable, but it is effective when utilized. Moments of tension feel tense due to the eerie score, and moments of true supernatural beauty have the score take on this sweeping orchestral sound with folk instrument accompaniment, feeling opulent and beautiful in nature. The opener is particularly generic, being yet another Annabel song that is pleasant to listen to without being too memorable. The Masumi Itou ending theme is also pleasant and not too memorable on its own sans the chorus, but there is just something about the way it is utilized with the ending that makes it feel much more delicate and vulnerable than it actually is. On the voice work side of things, we do get a rather solid set of performances all around, especially from Saori Hayami as Izumiko. Many other big name voice talent shows up every so often, as well (including Romi Park, Rie Kugimiya, and Jun Fukuyama), who always sound great.\\n\\n\r\n     Overall, Red Data Girl was a show that had plenty of promise. The supernatural Buddhist/Shinto topics have been frequently explored in anime (especially recently), but the way Red Data Girl presented them felt like they could have been fresh and inviting. Instead, the show fumbles its execution by deciding to not show any of what is actually important in favor of events only tangentially related to what is going on. What could have been something fantastic ends up inconsequential and pedestrian.\\n\\n\r\n--BREAKDOWN--\\n\r\nStory - 5\\n\r\nArt - 9\\n\r\nSound - 6\\n\r\nCharacter - 6\\n\r\nEnjoyment - 5\\n\r\nOverall - 6",
            "date": "2013-07-27T12:27:00+00:00",
            "helpful_count": 20,
            "mal_id": 107099,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/325254.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/FuzzyProxy",
                "username": "FuzzyProxy"
            },
            "url": "https://myanimelist.net/reviews.php?id=107099"
        },
        {
            "content": "I wasn't going to do a review for this since so many people already have and I'm not very good at this, but I just want to share what I think of it even if it's just for myself. Even though this isn't the best anime I've seen and I probably wouldn't recommend it to most people, it had a huge impact on me. I'm personally attached to it so I don't want to write it off as bad and I'll tell you why.\r\nSTORY 6/10: It starts off at the Kumano Shrine in the Kii Mountains where Izumiko Suzuhara lives. She lacks self-confidence anddoes not feel like a normal girl. Any technology she touches stops working. It is soon learned that she is the next vessel for the Himegami, a powerful goddess which causes many struggles for her. This is why Miyuki Sagara, who hates her, is sent to protect her from people who want her powers. \\n\r\n  So it's a nice concept based off of a book series, which I have not read. Everything seemed to flow smoothly until around episode 4. Things start to get confusing and many things are unexplained. This, I blame on the screenwriters. If they had stopped to explain certain things to the audience it would have been much better. It also focused too much on stuff that I found unimportant and less on stuff that were. The conflict was not very clear and I didn't feel like there was much danger, considering some of the character's actions. Other than this, it is pretty good. I like that it's based off of Japanese legends and Shinto religion, since I'm interested in that stuff. \\n\\n\r\nART 8/10: I was quite impressed with the artwork in the anime, especially the setting. The backgrounds were gorgeous and set a perfect mood for a Japanese culture-based anime. My favorite background art would probably be when they were in the Kii Mountains, surrounded by nature, and in another world. The style of the characters were also well done with fairly proportionate features. It had soft, neutral colors and lighting. The clothing design also really fit into the Japanese cultural feel.\\n\\n\r\nSOUND 9/10: First, the music is wonderful. It was very masterfully done because it created so much emotion and set the mood perfectly in each scene. This is also one of the things that kept my interest. I suggest anyone who likes instrumental music to look up this soundtrack and just listen to it on a pretty day. The opening song was also pretty good, but I prefer the closing song the most. It's a very cute song. The voice acting was also very effective in developing the mood and characters. It wasn't  crazy or annoying; it sounded nice.\\n\\n\r\nCHARACTER 8/10: The two main characters are mostly the reason that I enjoyed this anime so much. I'm sorry to say that the other characters didn't mean much to me. The main two made up for it, though, with the smooth character and relationship development. Izumiko starts off as very shy and lacks self-confidence, but towards the end she becomes a lot more confident and strong after going through her struggles. Miyuki starts off hating Izumiko and hating who he was, but in the end, he becomes protective of her and *SPOILER* eventually falls for her. *END OF SPOILER* Their relationship is what I love most in the whole anime. I like their backgrounds which were probably the most carefully explained thing in this series.\\n\\n\r\nENJOYMENT 6/10: There were some moments that had my full attention and others that I became a bit sidetracked. I felt confused throughout about half of it, but I continued watching it for the moments between the characters. This is what makes up the enjoyment of the anime. I especially enjoyed watching the interactions between Izumiko and Miyuki because it gradually changes each time.\\n\\n\r\nOVERALL 7/10: I argue that this is not a \"bad\" anime. It was just not written to it's full potential. I think that the art, music, cultural factors, and concept were very creative. I feel attached to it because of this and that the main characters influence me in my own writing and artwork very much, even now after I'd watched it 6 months ago. I recommend it to people who like romance, Japanese culture, and fantasy. People who are impatient or prefer action would most-likely not find this anime amusing. \\n\r\n  After watching it, I feel like I want to read the book series and see the difference, but it's in Japanese, so I can't. I'm hoping that after I become fluent in Japanese or it is translated in English, then I will get to. \\n\\n",
            "date": "2014-09-21T11:28:00+00:00",
            "helpful_count": 18,
            "mal_id": 161383,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3665003.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChibiStarChan",
                "username": "ChibiStarChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=161383"
        },
        {
            "content": "\"Red Data Girl\" is not an anime you would expect by the name alone. You may expect something along the lines of Modern-Science Fiction as I was, but as they say don't judge a book by this cover. The origin of the name is actually quite interesting (you will find out in the OP). This anime revolves around the Shinto religion. You may not understand some parts of RDG if you are not educated in the Shinto religion. It brings to mind when you're watching \"Rurouni Kenshin\", you may not understand some parts if you are not fully versed in the history of Japan. Evenso you can still enjoy both animes. While the story was sometimes confusing, you could still get the gist of it. A lot of the aspects in this anime are appealing, such as the art. The music is also very interesting, as it mixes some traditional anime music with some modern music. The ED is particularly good. This is a very good anime that will make you want to learn more about the Shinto ways of Japan!",
            "date": "2013-07-09T17:04:00+00:00",
            "helpful_count": 14,
            "mal_id": 104635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2612243.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Setsura1",
                "username": "Setsura1"
            },
            "url": "https://myanimelist.net/reviews.php?id=104635"
        },
        {
            "content": "After watching 11 episodes of this anime, I can safely say that this anime is strangely enticing. Focused on a goddess girl that can contact spirits/ghosts but only wanting to be a normal girl. The story is not all that interesting, and seems to have no correlation to it's name either.\r\nThe art in this anime is seemingly unique, but not the best. The characters are very typical and nothing out-of-the-ordinary aside from a few spirits that take on the form of other living things. The music isn't all that overwhelming although the opening and ending themes give a sort of eerie feel and are niceto listen to.\\n\\n\r\nAt episode 11, I still can't predict how this anime is going to end and feel like there will be a continuation. I wouldn't recommend this as a must-watch anime but it's worth watching if you have spare time, once again, it's strangely enticing.",
            "date": "2013-06-02T02:08:00+00:00",
            "helpful_count": 12,
            "mal_id": 99433,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/437142.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/aznfishie",
                "username": "aznfishie"
            },
            "url": "https://myanimelist.net/reviews.php?id=99433"
        },
        {
            "content": "The story of RDG is extremely good in the way it's done. They bring in cultural elements that are accurate and develop them into the story. Seeing as though the season is only 12 episodes the story goes at a pace which isn't fast but certainly isn't slow. The story is confusing, but the basic overall plot is revealed in the second episode. It gets add to constantly seeing as though with only 12 episodes, they really cannot waste one.\r\nAs with most P.A works pieces, it's very visually appealing. It isn't the best visually but has an overall look that does not disappoint. Certain moments,definitely where the Himegami arrives, are particularly memorable for the art adding to the intensity. \\n\\n\r\nThe scenes where Suzuhara dances are definitely the best points when it comes to the sounds. I would like to hear more but it does not fail to supply when it comes to the important bits. Such as moments where they try to build tension and fear in the viewer. Even the intro and ending are particularly well done.\\n\\n\r\nThe characters and their relationships with each others are done perfectly. It isn't at a pace that's glacial, but I feel the pace it's going at is plausible and satisfying. \\n\\n\r\nThe plot I find is unique, although I may be wrong in that point. But it definitely brings points of interest along with twists. The only problem I have is the fact that it isn't that popular.",
            "date": "2013-05-21T12:46:00+00:00",
            "helpful_count": 12,
            "mal_id": 97975,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Uyie",
                "username": "Uyie"
            },
            "url": "https://myanimelist.net/reviews.php?id=97975"
        },
        {
            "content": "What the flameo happened here?\r\nI know that it is easy to be a critic and all... but: This Anime is best summed up by an announcement made at 20:44 in the last episode of the series: \"Uh, at this point we are still unable to determine exactly what is happening.\"  If you watch that scene before watching the series you might think to yourself that you would be able to figure out what is actually happening if you had watched the entire series... good luck. \r\nAdmittedly my misunderstanding(s) and non-understanding(s) could be due to the fact that I don't know much about Shinto legends.However, I am human and I can usually follow plot points and basic story telling.",
            "date": "2014-07-10T20:57:00+00:00",
            "helpful_count": 11,
            "mal_id": 151467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3272637.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/toph4prez",
                "username": "toph4prez"
            },
            "url": "https://myanimelist.net/reviews.php?id=151467"
        },
        {
            "content": "It's always difficult for me to put a number and rate series that I have watched and as a result my numerical ratings tend to vary greatly. I can best express my opinions of a show through words.\r\nAfter the first episode this show began to draw me in. I was really interested in it. The story seemed very interesting and I liked all of the characters. I ended up liking the show more and more as I continued watching. In addition to the plot and characters I also really enjoyed the scenery, art, concept, and soundtrack. This show had a lot of great things goingfor it but there were a few places where it fell short.\\n\\n\r\nI liked the nature and Japanese lore premise that the series employed. The soundtrack matched it perfectly and the art was beautiful. The characters were great and I really like them. These are all categories which the series excelled in.\\n\\n\r\nThis show had a few things that really held it back. The most prominent of these things and likely the cause of it's other flaws is due to the length of the series. I feel that there just weren't enough episodes to work with. With only twelve episodes the series seemed rushed other elements suffered because of it.\\n\\n\r\nThese elements include the plot and characters. The plot seemed rushed and as a result it ended up being a bit choppy and confusing. I would watch an episode and then the next week I would be a bit confused about exactly what was going on. Things could have been more developed and better explained. The characters could have also been better developed. I found myself a bit confused about the Souda twins especially. The plot did an okay job wrapping everything up, but again, it seemed a bit rushed and underdeveloped.\\n\\n\r\nI think that if this series was longer and if the P.A Works had more episodes to work with that things could have been better explained and better developed.\\n\\n\r\nAll in all I really enjoyed the show and it's flaws all stemmed from the fact that the show seemed too short. The series does hint at a potential sequel which I would definitely like to see. Despite its flaws I would still recommend this to any anime fan, but specifically those with and interest in traditional Japanese culture.",
            "date": "2013-06-21T21:40:00+00:00",
            "helpful_count": 10,
            "mal_id": 101875,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1414159.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/robo731",
                "username": "robo731"
            },
            "url": "https://myanimelist.net/reviews.php?id=101875"
        },
        {
            "content": "K i know it's weird I'm giving it such a high score, but \r\nIt isn't full 100%\r\nThe scores don't give such a range and it's close enough to being that good. \r\nI honestly don't know why people are giving such low scores. People are saying that PA Works disappointed them this time, but I don't see how. \r\nThat was amazing. Honestly. it really blended Japanese \"religious/culture\" well with a normal everyday \"Fantasy\" anime. It works. The story was well written, the script was well-written, and for me, that's something big. The story goes at a reasonable pace and it's slightly confusing, but they explain itin their own way. And there are slight hints at somethings. Sometimes. \\n\\n\r\nCharacters are interesting and intriguing and drive the plot themselves, which I like to see. It's natural and isn't force like some anime I'm watching this season.\\n\r\nThe animation is good save for the fact that it's all in SD quality. It's still  fine.\\n\\n\r\nOverall, very good. As expected from PA Works.",
            "date": "2013-06-09T16:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 100499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/azandinoboi",
                "username": "azandinoboi"
            },
            "url": "https://myanimelist.net/reviews.php?id=100499"
        },
        {
            "content": "In my opinion the most Underappreciated anime of the year.\r\nRDG: Red Data Girl received a lot of mediocre reviews.\r\nWhile i do disagree with these reviews i can understand why. This is not an anime for everybody.About 50 percent of the time it's hard to understand just what the hell is going on. Though confusing, the story is very interesting and personally kept me entertained throughout.\r\nThe art was solid, Nothing exceptional but solid.\r\nThe Soundtrack was quite good, especially the Ending, which was very calm sounding.\r\nThere were characters i loved and characters i hated, i loved the two main characters and their relationship, it was my favoritepart of the show, seeing their relationship grow.\\n\r\nOverall Rdg is a very good show, and if it sounds any way interesting give it a shot and hopefully you won't be dissapointed :)",
            "date": "2013-09-29T11:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 114745,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2698755.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SakurasouBusters",
                "username": "SakurasouBusters"
            },
            "url": "https://myanimelist.net/reviews.php?id=114745"
        },
        {
            "content": "I went into this show pretty new to anime, so I had my expectations low, this show couldn't meet one of them. The show started off slow paced, it focused more on character development between Izumiko and Miyuki, which really helped develop their relationship, but after that there really wasn't much time for the plot.\r\nIn the end Miyuki is the only character to get true character development, going from a jerk to a decent guy, if RDG did anything right it's Miyuki, but that's where the good part ends.\r\n**********SPOILERS**********\r\nAs I said the plot progresses slow, leaving the ending incomplete with a scene in the themesong the never happened(Miyuki and Izumiko's kiss) and a plot line left unsolved(Mayura and Miyuki's \"marriage arrangement\").\\n\\n\r\nWhen I saw the first episode, even when I read the description, it intrigued me. The plot goes nowhere. The middle is hard to understand, choppy even. Things happening with little to no reasoning. Leaving things unexplained such as how Izumiko got her powers and why she can't touch electricity.\\n\\n\r\nIzumiko's personality isn't very clear. In the beginning she's sweet, but at certain times near the end she becomes mean towards Miyuki for random reasons such as going on a 'date' with her goddess self and other things.\\n\\n\r\nIzumiko's half goddess thing is also overlooked, the anime itself looks like a slice of life anime. RDG goes more into culture than they do the backstory.\\n\\n\r\nIf you like slow moving plots that go nowhere this anime is for you!",
            "date": "2017-07-06T18:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 252141,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6339966.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ViewTheBoo",
                "username": "ViewTheBoo"
            },
            "url": "https://myanimelist.net/reviews.php?id=252141"
        },
        {
            "content": "When I read about RDG: Red Data Girl airing in Spring 2013, I was kind of excited. The whole Synopsis sounded really good. Now that it has finished airing, I can safely say it was not what I expected!\r\nStory: The story centers around a girl, that is \"possessed\" by a goddess and can't handle anything electric, since it breaks the moment she touches it. She has been raised in the mountains, but one day decides to go to Tokyo and enter a High School there.\r\nThe Plot is based on different Shinto legends and sounds quite intriguing. Reality though looks a bit different. I liked thewhole concept the show had and in principle I liked how they executed it too. My only problem was, that I didn't understand anything. The whole show was full of fillers, that sometimes seemed kind of pointless to me (even if they weren't always). The explenations were , where I had my problems. It got me confused everytime.\\n\r\n6/10\\n\\n\r\nCharacters: We have our main protagonist Suzuhara Izumiko. A girl that has a goddess in herself. She is a really shy person. She does get some developement, but not as much as I hoped it to be.\\n\r\nThen we have the next character, Sagara Miyuki. He is something like Izumiko's servant. At first he seems to be really rude towards almost everyone, but it's not long into the series until we realize that he is a lot more kind than you might've thought at first glance. He probably is the one developing the most in the whole series.\\n\r\nIn total the other characters were ok. Nothing we haven't seen before, but nothing I would dislike either.\\n\r\n6/10\\n\\n\r\nVisuals: The show was produced by P.A. Works, who published other shows like Angel Beats! or Another. The visuals look really nice. The character design is beautiful and the backgrounds great. The Animation is fluent and everything seems to fit.\\n\r\n9/10\\n\\n\r\nSound: The sound of the whole show is in total quite ok. I didn't hear a lot of the OST to be honest, but when I heard something, I heard something it wasn't anything extraordinary. Both Opening and Ending aren't anything special either. They are both slow paced.\\n\r\nThe voiceacting was good and the emotions reached the one watching, if there were emotions needed.\\n\r\n6/10\\n\\n\r\nEnjoyment: My main problem was, as I stated earlier already, that I didn't understand it at all. It was confusing that was it. I found myself being bored while they tried to explain me things, because I had lost track already. Of course it might be that I am too slow at getting things, but that's just how I felt it.\\n\r\n5/10\\n\\n\r\nThe Show in total was a bit of a disappointment for me as one of the people, that really were looking forward to this show. Still it wasn't crap. It was just mediocre.\\n\\n\r\nOverall: 6/10",
            "date": "2013-06-08T14:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 100287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2200817.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/korison",
                "username": "korison"
            },
            "url": "https://myanimelist.net/reviews.php?id=100287"
        },
        {
            "content": "I didn't get it...at all!!\r\nI didn't understood the plot, or the characters.  There is this girl who wants to change and the boy besides her who doesn't want to be with her. Then you got a goddess whom can destroy the world and a bunch of kids fighting to be number one on high school... Then there is a lot of magic, spells,  and ghosts.  It is a hot mess. I don't know why I even watch it all. Can someone please give me my precious time back!!!",
            "date": "2015-06-04T20:22:00+00:00",
            "helpful_count": 7,
            "mal_id": 189571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3151519.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Angelitocurioso",
                "username": "Angelitocurioso"
            },
            "url": "https://myanimelist.net/reviews.php?id=189571"
        },
        {
            "content": "This anime is like eating a sandwich packed and full to the highest level. It looks good but somehow parts of it fall off and it's a waste.\r\nStory:\r\nThe start was really good, even the synopsis which is why I expected a lot from this anime, expecting it to be one of the best this season even but somehow even with the cute romance part between Izumiko and Miyuki, the end really failed to leave a satisfying ending.\r\nThere's a lot of confusion in my part maybe because I haven't read the LN but that just makes it more reason that the story should be properly explainedespecially to non-readers. Some parts left me confused: Why did this happen? What is the reason for this? Who is this person? The end was disappointing. It did not leave the feeling of completeness to the series and failed to shed some light on some things. It's like it left a lot of holes and nothing to fill it with. \\n\\n\r\nI like the concept of it but it failed to deliver. 6/10\\n\\n\r\nArt:\\n\r\nThe art was the one thing that's holding me to this series. That and the fact that I don't drop series even if they are on hold for so long already. Art is one of the strongest points, not a surprise since this is from P.A. works. Sceneries are good, character art is also good. *cough*Miyuki*Cough*\\n\\n\r\n9/10\\n\\n\r\nSound: OP is catchy, I don't watch the ED much and the sounds when Izumiko is dancing is also good. 8/10\\n\\n\r\nCharacter:\\n\\n\r\n7/10\\n\r\nIzumiko and Miyuki develops at the end. The triplets somehow make a development but at the same time I feel like there's something lacking. I just don't like the part where the characters aren't properly explained. For example, what is seriously the deal with her mother. I don't know why technology doesn't work. (or maybe I failed to catch on). Why does Wamiya and Takayanagi look the same? (Or maybe I failed to catch on that too) I don't even get the gist of the judges thing. Nevertheless, the story fails to expound more on characters, their decisions and even on the triplets.\\n\\n\r\nEnjoyment:\\n\r\nNot gonna lie, even if the story did fail to deliver, I was still somehow kind of hooked on the plot with all the goddess thing and during the times Izumiko does great things inspite of her insecurities. One thing that I really enjoyed was Miyuki and Izumiko. I love their end, but not THE END itself. Although I would have really loved it to see them kiss at the end. :C But like I said, too much confusion so 7/10.\\n\\n\r\nOverall:\\n\r\n6/10\\n\\n\r\nEven though I love those fleeting moments with Miyuki and Izumiko and the art, the story is still an important point and I feel like it's meant a 6 (Fine) rather than a 7 (good).\\n\r\nI wish they had more episodes so that it wouldn't feel so fast paced and won't leave that much confusion to the watchers part.\\n\\n\r\nSo much potential for this to become a good anime but 12 episodes butchered it or maybe it was the story board, who knows.\\n\\n\r\nA sandwich is still a sandwich and it's still fine.",
            "date": "2013-06-09T03:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 100359,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1231881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/daisy-",
                "username": "daisy-"
            },
            "url": "https://myanimelist.net/reviews.php?id=100359"
        },
        {
            "content": "So, it seems most people seem to have a problem comprehending this anime... admittedly this may be due to there being a discrepancy between the novels/manga and the anime (manga ended in 2014, anime in 2013, although the novel came out in 2012)... and, I suspect, it contains more than the anime reveals. Still, every individual episode on its own seemed to make sense, especially if one makes sense of the abstruse language characters often use.\r\nIt is a Shinto tale, so some researching could be useful at times (there are quite a lot of references, although not knowing the legends behind them doesn't necessarily precludeenjoyment of the anime) - it's really multi-faceted, though... even if it mythologically makes little sense, one can simply view it as a coming-of-age tale, as ultimately that is how it turns out... it is by no means conventional, and while some viewers might focus too much on the relationships of the characters to the exclusion of the surrounding narrative, in this instance their interactions are a crucial part of the storyline, as there was, throughout the series, a certain political struggle within the school... that was rushed, but the twelve episodes did in the end surely develop the main character.\\n\\n\r\nThe ideas presented, though, I think are the interesting aspect of the story here... one might be confused by them, but from an imaginative point-of-view, and with what limited explanations there are in the twelve episodes (and there are, even if viewers drop the anime after becoming very confused indeed) - concepts from having different ('spiritual') 'phases', to dancing to specifically access the subconscious, as only once suggested by a character, to summoning a spirit (unconsciously) due to loneliness - all understandable ideas (but, as this isn't a documentary they don't go on very long about them, which is why a curt or oblique explanation may be frustratingly confusing).\\n\\n\r\nUltimately, I don't think it was at all not done well... only twelve episodes, another season certainly useful, but the twelve existent episodes felt to me like they could be self-contained, although more of it would be nice...",
            "date": "2015-08-31T11:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 197565,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491626.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Seyfert",
                "username": "Seyfert"
            },
            "url": "https://myanimelist.net/reviews.php?id=197565"
        },
        {
            "content": "While the animation style was pretty good, I can't say that I liked much more than that. The anime wasn't that interesting overall, and it felt more like a chore to watch it then to actually enjoy the show. \r\nA lot of the character and plot development was either sloppy and cliche or really hard to follow. I did enjoy the sound track, and it did match the backgrounds and moods of the anime pretty well. \r\nOverall it wasn't a horrible anime, but it was boring enough to the point where I didn't want to watch it.  While I personally didn't completely love theanime I think that it contains genres that others may be able to follow better than I did and many people do like this anime.",
            "date": "2016-03-06T10:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 212370,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5097097.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/iSenpai",
                "username": "iSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=212370"
        }
    ],
    [
        {
            "content": "Stories aren't always about narratives. Sometimes, we can discover more ideas by ourselves if we put our efforts through. And of course, discovery comes from experiences. For a certain shy and dull looking (I think she's cute though) girl according to her peers, she's about to experience some whole new changes in her life.\r\nHer name is Izumiko Suzuhara, the Red Data Girl.\r\nRDG: Red Data Girl is an anime series adapted from the light novel of the same name written by Noriko Ogiwara (The Good Witch of the West). Her talent of writing involves in the field of fantasy and supernatural so expect some of thosethemes from RDG. Otherwise, P.A. Works handles the production of the series. They are known for their usages of serene visuals and clearly does not disappoint; at least in the art department. However, the experiences I got out of this series is not exactly enthralling or exciting. In fact, it was something quite different.\\n\\n\r\nIn essence, this series is like a fantasy but takes place in modern times. The time period it takes place seems to be normal and likely perspective to our very own 21st century without high tech gadgets or space cars. Rather, it is a normal and typical school life setting in a modern civilization of development. Suzuhara Izumiko is the main female protagonist in this and she's always been shy. Even from the first episode, it's easy to pick out from the fact that she has a hard time socializing with others or being part of a group. It's not too surprising though by her nature considering the fact that she has been raised in the mountains. Or rather, Suzuhara has been associated with the Tamakura Shrine and along with her miko outfit, we can consider her to be a shrine maiden. \\n\\n\r\nThe series spells out some confusion and mystery. For example, Suzuhara seems to have a strange power that lies dominant in her and these powers are let out when she is near technology. This is proven when electronic gadgets she comes in contact with results in destruction. Additionally, her glasses when removed seems to gave her visions of the supernatural, or otherworldly beings. From an initial standpoint, it's hard to tell anything by how these powers came to be. For one thing, we know that it's some sort of ability and very likely has a connection with Suzuhara's origins. It spells out mystery and the viewers' curiousity may peak from some of these aspects; at least I know I did. Regardless of her strange abilties though, Suzuhara enrolls to Hōjō High School in Tokyo where her life becomes more normal. At least, that's what she originally hoped.\\n\\n\r\nThen on the opposite of the globe is Miyuki Sagara. This guy is essentially introduced as a prick. His attitude is literally a bully by the way he talks to Suzuhara and behaves around her. For whatever reason, Miyuki seems Suzuhara as a nuisance and more so because he is assigned to be her protector. Luckily though, their relationship seems to get better and possibly even go on the road of romance. It's at least not in the friend zone section but the two definitely has some engaging moments. These moments are captured by their dialogues and some development, especially after a certain event that reveals an even deeper secret of Suzuhara.\\n\\n\r\nThe secrets in this series also reveals some other aspects with the character cast. Take example, Mayura Sōda who is known as a cherry girl with friendly demeanor. However, she has more secrets and particularly gets caught in a rivalry among the school grounds. Among other factors, perhaps the biggest secret revolves again with Suzuhara. We learn that there's a supernatural vessel within her. It could be something related to a divinity or a goddess. We don't know too much about it but it has connections with her origins and the mysterious powers that she possesses. Unfortunately for her, she knows little about her origins herself or those powers. She does have a knight in shining armor though. But even so, Suzuhara still can't live the normal life a young teenage girl. With the ability to destroy electronic devices through an unintentional or intentional touch, she won't ever be able to use iphones, listen to ipods, or watching anime on a computer like most people. Damn, shame.\\n\\n\r\nAmong other factors, there's the serene like atmosphere that is constantly present in the show. The mountain atmosphere gives off a fresh scent of the settings and brings out a sense of realism in Tokyo that makes you feel right at home. The way some of the structures are designed as well to fit within the traditional Japanese ways. Needless to say, it presents its Shinto themes in the right direction. After all, Shinto is considered a spirituality and in Tokyo, there are many practices that establishes connections between them. In RDG, we can see some of the way the characters are dressed, the monuments, the festivals, the clear mountains, and shrines that are all over the place. The school itself is traditional and consists more of the modern atmosphere rather than anything too out of place.\\n\\n\r\nUnfortunately, the show is hard to grasp and connect together. There's a lot of confusion among the characters and what's there. The plot itself is also a bit loose and I find it dull at various occasions. The Shinto atmosphere might also not fit well for target audiences. In fact, RDG is more the type of the show where we have to expect the pace to start off slow, flow smoothly, and hopefully wrap up in a tolerable way. However, I find the pacing to be a bit intolerable. At many occasions, I find that the plot itself to be just too dull. It tries to present its story with a mythical narrative that plays along influences of the Japanese culture. At the same time, the way it executes it is not so exciting. Unless of course you're really interested in the Asian culture along with Japanese traditions, Red Data Girl may not be for you. However, there are instances though that I find the series to be interesting. The title character Suzuhara keeps her innocent outlook and seems to be on the side of a 'coming of age' drama. She is the 'miko' and host of a powerful divinity. \\n\\n\r\nBut for some things to care, there are the visuals. P.A Works handles the production of this series and the artwork gives a definition of beauty. As mentioned before, the artwork aesthetics gives the details to the surrounding atmosphere as well as the nature of the series. There's the mountain, the shrines, the outfits, and even spirits to match traditional Japanese ethnics. Of course, Suzuhara herself is drawn as a plain girl with the nerdy glasses and braids to match her statue. For one, I am pleased that P.A. Works is involved in this as it gave me a nostologia of Hanasaku Iroha and Tari Tari; at least in terms of visuals.\\n\\n\r\nAs for the soundtrack, the series maintains a balanced rhythm. It's nothing too special to take notice of as most of the time, the OST remains smooth and light. There's no intense beats or rock. Rather, there's this linear pace of natural sound. The OP song \"Small worldrop\" by Annabel is sung with a smooth voice and at the same time shows some possible foreshadowing. Then, there are the ED songs that plays off the traditional themes again. In the song itself, we can see that Suzuhara is walking as in a possible reference to her development in a modern coming of age/fantasy story.\\n\\n\r\nUltimately, I'd say this series is a gamble to watch. Some people may like the serene backgrounds along with the spiritual vibe that gives off while watching the show. Then of course, there are others who may be bored out of their lives of trying to figure out what is going on. Then, there are the folks who watches the show to pass time. It's a tough gamble but I hope it'll play well for you. Now, phew that was a lot of data to absorb, or rather info.",
            "date": "2013-06-08T10:05:00+00:00",
            "helpful_count": 154,
            "mal_id": 100255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=100255"
        },
        {
            "content": "I was really excited to try out this new anime this season. I saw its description on this website, and I thought \"okay, that sounds really interesting. A romance between a goddess girl who can't touch electricity and her servant protector of sorts.\" I even liked the first episode and thought the main character could become one of my favourites eventually. My only complaint was that I couldn't make much sense of the anime. But I figured that they would end up explaining things eventually, as it's only a 12 episode anime. 7 episodes in, and I have no idea what the hell is goingon.\\n\\n\r\nI really don't know what's going on. All I can understand is that some privileged high school kids with some awesome spiritual powers get to go to the best high school ever and have some weird disputes that I just don't understand. There hasn't been a single answered question so far even though we're more than half way in; in fact, they're just making us ask more and more questions every episode. Who the hell is Izumiko's mother? Why is Miyuki so weak? Why does the anime go from one crappy plot point to another without explaining anything? Who is Takanagi or whatever? Who are Mayura and Manatsu? What the hell is Masumi? Why do they care about a dying horse so much? Why do they fight? What the hell is up with spirits? Why is there a fan club for Mayuri? Who was that weird guy that asked Izumiko's to dance for him? Who is Miyuki's father? Who is Izumiko's father? Why is the anime named Red Data Girl? I just can't make any sense at all of this anime.\\n\\n\r\nArt: This is the only good thing I have to say about this anime. The art is good, one of the best I've ever seen. Though I have no idea why the characters except the main two look so bland and unmemorable.\\n\\n\r\nCharacters: the main character seems like she could be interesting, but she's barely in the plot at all. She barely does anything. Miyuki seems like he could be interesting but he just turns out to be a bland boring typical stern anime character. What the hell is up with Masumi, Takanagi (is this how you spell it?), the person who asked Izumiko for a dance, and Wamiya? Why are the Souda siblings so important? Manatsu is just bland and boring. Mayuri is too to the same extent, but she's also a bland boring moody brat. There's nothing likeable about anyone here.\\n\\n\r\nPlot: As I pointed out earlier, the plot doesn't make sense. It just jumps from one thing to another without explaining anything. It just is plain bad writing. Worthless.\\n\\n\r\nOverall: probably the worst anime I have ever seen--more than even Aku no Hana. 2/10 for good art.",
            "date": "2013-04-29T23:02:00+00:00",
            "helpful_count": 127,
            "mal_id": 95411,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/795335.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Olwen",
                "username": "Olwen"
            },
            "url": "https://myanimelist.net/reviews.php?id=95411"
        },
        {
            "content": "I'm supposed to be studying right now but whatever.\r\nOkay, unlike the majority of the reviews, I actually liked Red Data Girl. It's surprising 'cause I'm easily influenced by the reviews here on MAL. Before I watch an anime or read a manga, I always check MAL and read the reviews so as to see if it the said anime/manga is worth it.\r\nBut before I read the reviews on RDG, I watched a few episodes of it. And well, I really liked it. I think the best factor that got me hooked into the anime was the art (and maybe Miyuki /shot xD) and also thetheme. I always loved Japan and since the theme was about Japanese culture, I got myself interested.\\n\\n\r\nThen around the middle of the anime, I got confused. (Yes, just like all of you who watched) Everything was going too fast and nobody was explaining things at all. So, just in case I wasn't the only one, I checked the MAL reviews on this anime. I wasn't surprised to see negative reviews everywhere. All complaining about the same thing I was complaining about.  I was a bit discouraged to watch after reading all of the reviews, but when the next episode came out, I still watched it and even finished. :D\\n\\n\r\nSure there were so many unanswered questions but I think the anime was good enough. Although, it should've had more episodes so they could've at least explained some stuff.\\n\\n\r\nOkay, let's talk about the characters now.\\n\\n\r\nI really liked Miyuki's character development. (And I also really like Miyuki X3) He started of as the lean and mean bully who seemed to hate the world so much he'd rather jump of a cliff. But around the end of the anime, he started to warm up to Suzuhara. (*squeals*) xD\\n\\n\r\nThe other characters were okay, but nothing out of the ordinary. Suzuhara was the typical shy girl who struggles to become stronger in the end. Mayura, Manatsu and Masumi were cute, but again, they weren't very interesting. (Masumi got my attention a little bit tho. HE WAS SO CUTE IN THE END)\\n\\n\r\nMusic was good. I'm not good with critiquing sounds lol but I really liked the bg music and also the music when Suzuhara dances. :3\\n\\n\r\nOkay so overall, I really liked RDG and if you're into Japanese culture, fantasy and the likes, then this is the anime for you. ;)\\n\\n\r\nBut if you're an impatient person and if you don't like getting confused, then I don't think you'll like this anime at all.",
            "date": "2013-06-27T01:24:00+00:00",
            "helpful_count": 107,
            "mal_id": 102601,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/406941.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/gumi-tan",
                "username": "gumi-tan"
            },
            "url": "https://myanimelist.net/reviews.php?id=102601"
        },
        {
            "content": "RDG: Red Data Girl: Too Much Data And Not Enough Storage\r\nI have to say that this might be the first time I'm genuinely disappointed with a P.A. Works anime. After creating some wildly successful series like Angel Beats and Another, I had reason to believe that P.A. Works could be developing into a strong production company. Unfortunately, I have to chalk RDG up as a dud in their repertoire. I thought with the plot that this series had, it had to the potential to be really good but fell flat in the two biggest aspects...it's story and it's characters.\r\nThe biggest problem with this series isit tried to tackle way too many sub-plots with not nearly enough episodes to work with. It causes some extremely choppy pacing as well as several unresolved plot points. I found it's \"ending\" to be rather ironic since I was feeling the same way Miyuki was when I completed this series. For all the sub-plots going on in this series, it sure did find a way to bore me to sleep. Going back to the limited episodes, this series seemed to set itself up for a sequel and that could be the reason for unresolved plot points. However, I still feel P.A. Works left too many open. This series didn't have the closure it should've had, even for a series that would plan on continuing.\\n\\n\r\nI found the characters to be another huge weakness to this series. Their actions and lack of development left a lot to be desired. Still, I do believe the lack of character development does span from this series trying to introduce a ton of sub-plots. Really, the best way I can describe it is that this series suffered from an identity crisis. It couldn't decide if it wanted to be a plot-driven story or a character-driven story and as a result, it ended up being neither. I found it difficult to get invested in Izumiko and her \"plot\" because it was so damn confusing. It seemed like even the writers were having difficulty trying to figure it out. That's not to say it wasn't \"good\" because I found some aspects of it to be interesting. However, its progression and explanation is so choppy and so poorly explained that it strongly detracted from the overall quality of this series. Miyuki was one character I really got a bit of a laugh at because there was one episode later on in the series where I called him a male tsundere. You just don't see that in anime very often. I can't say it really did anything for the series, because the development between him and Izumiko was so hacked that I just couldn't become invested in their relationship (if you can even call it that). For the most part, the characters are fairly forgettable. I can't say there is one memorable character at all in this series. Maybe Masumi, but even that's a stretch.\\n\\n\r\nWhile I did find the story and the characters to be big weaknesses, there were some things the series did rather well. I really loved the artwork as well as it's traditional Japanese themes. The one thing I'll give P.A. Works is that they are very good with their animation and artistic design. While I did rip this series for having so many sub-plots, that's not to say it didn't have good ones. I did think the main plot was interesting albeit confusing, but it just seemed so rushed and choppy due to having so many sub-plots. I did find the sub-plot revolving around Masumi to be interesting as well as the one behind Wamiya. The sub-plots in themselves were \"good\" but suffered from choppy pacing and lack of strong progression due to having way too much going on in way too little amount of time. The atmosphere for this series was REALLY good and was what had me coming back week-after-week.\\n\\n\r\nAll-in-all, it's such a shame to see this series fall flat. P.A. Works is one of my favorite smaller animation companies and they've produced some really good anime in the past. However, much like it's most popular series (Angel Beats), this needed to be 24-26 episodes in the worst way. It had a good plot and good sub-plots, but it was so overly ambitious with how much this series tried to accomplish. It didn't have a smooth-flowing narrative and that in itself, caused some VERY underdeveloped characters. That's not to say I didn't enjoy watching this series because I did. It's just that after it was all said and done, it left a bitter taste in my mouth. I knew P.A. Works had something good going with this series but got overambitious with it. They tried to make it bigger and deeper than it had to be. It needed more of a focus on it's main plot and developing its main characters with that plot. It's extremely sad that I thought the Souda siblings got more development than the series' lead characters. I would only recommend this series to those with an interest in ancient Japanese traditions and lore. I found those aspects to be pretty good for this series. However, if you're looking for an anime with an excellent story and well-developed characters, it just simply doesn't have it and I'd say give this a pass if this is what you're looking for. Even if you're looking for a good romance series, this series is poorly advertised in that regard and doesn't have a good romance in the least. In the end, I feel its time P.A. Works really starts putting more of a focus on making bigger anime series because the 12 episode format is just not quite getting it done anymore, especially when it came to RDG: Red Data Girl.",
            "date": "2013-06-08T09:30:00+00:00",
            "helpful_count": 61,
            "mal_id": 100243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=100243"
        },
        {
            "content": "*This Review Contains Spoilers*\r\nThis was a series I really wanted to like and that I had high hopes for, but that ultimately fell flat. The story starts out clear enough (Izumiko is to be the new vessel for the Himegami, a mysterious and powerful goddess that could destroy the world, and Miyuki is her reluctant protector… together they must find a way to overcome their differences and figure out the mystery of the Himegami, etc.), but then descends into a mire of seemingly irrelevant side stories and confusing plot points involving clingy triplets, a sick horse, school festivals, student rankings, traditional dancing, and something calledthe “World Heritage”.\\n\\n\r\nI found that the series had quite a lot of exposition – only it was all about things that were seemingly extraneous to the main story and often longwinded, such as the relationship between the triplets, or the reason why Mayura is so focused on beating Takayanagi. Episode 9 had the most informative exposition about the origins of the Himegami, but even so, there was really not enough action to really give substance to it all. With so little of the main plot is actually explained, and a lot of poor pacing, I was left wondering what the point of it all was.\\n\\n\r\nAs for the characters, they felt mostly static the entire time, with the exception of Izumiko, who at least actually made some visible effort to change herself. Miyuki seems to have some development in his feelings towards Izumiko, especially in the last 3 episodes, with his growing concern about her, but he’s mostly petulant, and it’s not quite enough to get me to care at all. I can’t say that I felt much attachment to any one in this anime, which is disappointing since there was a lot of potential in the first 2 episodes.\\n\\n\r\nThe one area in which this anime shines, however, is in the visuals. The backgrounds are really lovely, and the dance sequences and depictions of Izumiko’s kimonos look beautiful. Character design was good but not outstanding. Unfortunately, visuals alone are not enough to carry a series.\\n\\n\r\nIn the end, the show does pick up just slightly around episode 9, but the ending is inconclusive and dissatisfying – probably a byproduct of having too much source material (6 novels!) and not enough episodes to really develop the world or the characters. The ending is left open and nothing is resolved, suggesting the possibility of a second season. I liked the premise, but this series really needed to have more than 12 episodes dedicated to telling the entire story in a cohesive and comprehensive way, instead of cramming everything into one season with hopes of resolving the confused narrative if a second season was green lit.\\n\\n\r\nFinal impressions: Started out with a lot of potential, mired by a host of side stories in the middle, and ends with its head just barely above water.\\n\\n\r\nVerdict: Source-material syndrome combined with an ailment in pacing.",
            "date": "2013-07-30T07:19:00+00:00",
            "helpful_count": 56,
            "mal_id": 107501,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2126757.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/bluevariance",
                "username": "bluevariance"
            },
            "url": "https://myanimelist.net/reviews.php?id=107501"
        },
        {
            "content": "Every season, at least one show comes along that has the potential to impress, whether it would be due to a particularly interesting premise, an animation studio associated with quality work, or a staff who has been known to work well together in the past. However, for whatever reasons, that show does not fare well in execution, ending up either forgettable or just plain disappointing. The Spring 2013 season was no exception to this, having a few flops in and of itself. However, personally, one show perfectly encapsulates this idea: P.A. Works' offering, Red Data Girl.Red Data Girl's premise is a hard one to describe without spoiling the first few episodes, leading to a synopsis that does not fully communicate what the show is actually about. The show does actually change locations entirely at the end of the third episode, with Izumiko going to high school in Tokyo and the plot shifting to a larger school conflict. The show itself is filled to the brim with charming, if somewhat generic, characters and the makings of a truly tense school drama. It all sounds fine on paper, but the execution makes Red Data Girl come off as inconsequential instead of truly interesting.\\n\\n\r\n     What Red Data Girl does right is incorporate many different aspects of traditional Buddhist and Shinto mysticism into the show's own structure, creating a very strange set of circumstances surrounding Izumiko and the rest of the cast. The dense amount of material to take in never feels rushed, with everything happening for an exact reason, abilities and limitations being discussed, and being overall accessible to those with very little background into either spiritual practice. As someone who is enchanted by Eastern spiritualism, seeing how they work with the bits and pieces brought up made me adore this aspect of the series. What I found particularly interesting was the nature of Izumiko's spiritual abilities, and what is later revealed about the spirit residing inside of her. When details about that are finally revealed, they do end up being quite intriguing when you put the pieces together.\\n\\n\r\n     The execution of the show, however, leaves a lot to be desired. The major problem here is the lack of focus placed on the main plot, which comes across as a wholly-serious popularity contest. The show executes this idea in a way that does not make it sound completely stupid, but it still does not resonate due to the fact that the results of this ongoing major plot are never on screen. Given the context it has with Izumiko and her inner conflict (which is barely any at all), it could have been better-integrated by being executed on-screen instead of just being discussed through dialogue. The dilemma surrounding Izumiko given the spiritual forces inside of her that may potentially bring about the world could have managed to meld into the seemingly mundane main plot to form something meaningful, but instead comes across as trying to do too much and not showing enough of what gets a primary focus. Even then, one element of the basic premise is barely explored, which is Izumiko's strange relationship with technology. It is brought up only once after the first three episodes after being brought up in the premise of the show.\\n\\n\r\n     There is a basic tenant in visual media: show, don't tell. Given the fact that the source material is a light novel, the overly narrative nature is to be expected, but this is where the magic of animation comes into play. Why constantly mention something happen in the background when you can show a shot of the event? It would be quite easy to do. However, this show refuses to put forward a potentially interesting plot by sticking it within dialogue only. The overall result makes the show feel insignificant and inconsequential.\\n\\n\r\n     The cast itself is filled with typical moe tropes, but each character definitely feels unique and consistent. Izumiko is your standard shy, glasses-wearing wallflower who wishes to be more out there and make more decisions in his life. Miyuki is a male tsundere but is tolerable despite the fact that he is a jackass in the beginning. Mayura and Manatsu can have some potentially great scenes together, due to Manatsu's ditzy behavior. The characters meant to be seen as villains, though, have very little in the way of characterization or personality, particularly in the case of Takayanagi. The motivation is consistently unclear with him, along with Yukimasa's true motivations, and the show does not do a good job of clarifying either of these.\\n\\n\r\n     P.A. Works and Studio Easter handled the animation and background art work on Red Data Girl, and just like all of their efforts in recent memory, impress more often than not. This project is no exception in the slightest, boasting a delicate style to its animation that is quite fluid and devoted to making the most out of its supernatural focus. When the show goes into its more spiritual focus, the effects compensate by having either eerily dark, vaguely humanoid shadows or by having grand, immaculately-designed yokai when called for. The background work is also the best yet from Easter, fitting the scenes perfectly and being gorgeous enough to just admire on their own. The opening is rather generic, going through a visual novel-like visual of each of the characters, with their names and everything scrolling by. The ending is walking animation, but yet again, the background art is so beautiful that it can be forgiven. The art and animation are definitely the strongest aspects of the show, despite typical P.A. Works character designs, which can be eerily doll-like.\\n\\n\r\n     The sound of this show can be a bit of a mixed bag. The score itself is not particularly memorable, but it is effective when utilized. Moments of tension feel tense due to the eerie score, and moments of true supernatural beauty have the score take on this sweeping orchestral sound with folk instrument accompaniment, feeling opulent and beautiful in nature. The opener is particularly generic, being yet another Annabel song that is pleasant to listen to without being too memorable. The Masumi Itou ending theme is also pleasant and not too memorable on its own sans the chorus, but there is just something about the way it is utilized with the ending that makes it feel much more delicate and vulnerable than it actually is. On the voice work side of things, we do get a rather solid set of performances all around, especially from Saori Hayami as Izumiko. Many other big name voice talent shows up every so often, as well (including Romi Park, Rie Kugimiya, and Jun Fukuyama), who always sound great.\\n\\n\r\n     Overall, Red Data Girl was a show that had plenty of promise. The supernatural Buddhist/Shinto topics have been frequently explored in anime (especially recently), but the way Red Data Girl presented them felt like they could have been fresh and inviting. Instead, the show fumbles its execution by deciding to not show any of what is actually important in favor of events only tangentially related to what is going on. What could have been something fantastic ends up inconsequential and pedestrian.\\n\\n\r\n--BREAKDOWN--\\n\r\nStory - 5\\n\r\nArt - 9\\n\r\nSound - 6\\n\r\nCharacter - 6\\n\r\nEnjoyment - 5\\n\r\nOverall - 6",
            "date": "2013-07-27T12:27:00+00:00",
            "helpful_count": 20,
            "mal_id": 107099,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/325254.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/FuzzyProxy",
                "username": "FuzzyProxy"
            },
            "url": "https://myanimelist.net/reviews.php?id=107099"
        },
        {
            "content": "I wasn't going to do a review for this since so many people already have and I'm not very good at this, but I just want to share what I think of it even if it's just for myself. Even though this isn't the best anime I've seen and I probably wouldn't recommend it to most people, it had a huge impact on me. I'm personally attached to it so I don't want to write it off as bad and I'll tell you why.\r\nSTORY 6/10: It starts off at the Kumano Shrine in the Kii Mountains where Izumiko Suzuhara lives. She lacks self-confidence anddoes not feel like a normal girl. Any technology she touches stops working. It is soon learned that she is the next vessel for the Himegami, a powerful goddess which causes many struggles for her. This is why Miyuki Sagara, who hates her, is sent to protect her from people who want her powers. \\n\r\n  So it's a nice concept based off of a book series, which I have not read. Everything seemed to flow smoothly until around episode 4. Things start to get confusing and many things are unexplained. This, I blame on the screenwriters. If they had stopped to explain certain things to the audience it would have been much better. It also focused too much on stuff that I found unimportant and less on stuff that were. The conflict was not very clear and I didn't feel like there was much danger, considering some of the character's actions. Other than this, it is pretty good. I like that it's based off of Japanese legends and Shinto religion, since I'm interested in that stuff. \\n\\n\r\nART 8/10: I was quite impressed with the artwork in the anime, especially the setting. The backgrounds were gorgeous and set a perfect mood for a Japanese culture-based anime. My favorite background art would probably be when they were in the Kii Mountains, surrounded by nature, and in another world. The style of the characters were also well done with fairly proportionate features. It had soft, neutral colors and lighting. The clothing design also really fit into the Japanese cultural feel.\\n\\n\r\nSOUND 9/10: First, the music is wonderful. It was very masterfully done because it created so much emotion and set the mood perfectly in each scene. This is also one of the things that kept my interest. I suggest anyone who likes instrumental music to look up this soundtrack and just listen to it on a pretty day. The opening song was also pretty good, but I prefer the closing song the most. It's a very cute song. The voice acting was also very effective in developing the mood and characters. It wasn't  crazy or annoying; it sounded nice.\\n\\n\r\nCHARACTER 8/10: The two main characters are mostly the reason that I enjoyed this anime so much. I'm sorry to say that the other characters didn't mean much to me. The main two made up for it, though, with the smooth character and relationship development. Izumiko starts off as very shy and lacks self-confidence, but towards the end she becomes a lot more confident and strong after going through her struggles. Miyuki starts off hating Izumiko and hating who he was, but in the end, he becomes protective of her and *SPOILER* eventually falls for her. *END OF SPOILER* Their relationship is what I love most in the whole anime. I like their backgrounds which were probably the most carefully explained thing in this series.\\n\\n\r\nENJOYMENT 6/10: There were some moments that had my full attention and others that I became a bit sidetracked. I felt confused throughout about half of it, but I continued watching it for the moments between the characters. This is what makes up the enjoyment of the anime. I especially enjoyed watching the interactions between Izumiko and Miyuki because it gradually changes each time.\\n\\n\r\nOVERALL 7/10: I argue that this is not a \"bad\" anime. It was just not written to it's full potential. I think that the art, music, cultural factors, and concept were very creative. I feel attached to it because of this and that the main characters influence me in my own writing and artwork very much, even now after I'd watched it 6 months ago. I recommend it to people who like romance, Japanese culture, and fantasy. People who are impatient or prefer action would most-likely not find this anime amusing. \\n\r\n  After watching it, I feel like I want to read the book series and see the difference, but it's in Japanese, so I can't. I'm hoping that after I become fluent in Japanese or it is translated in English, then I will get to. \\n\\n",
            "date": "2014-09-21T11:28:00+00:00",
            "helpful_count": 18,
            "mal_id": 161383,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3665003.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChibiStarChan",
                "username": "ChibiStarChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=161383"
        },
        {
            "content": "\"Red Data Girl\" is not an anime you would expect by the name alone. You may expect something along the lines of Modern-Science Fiction as I was, but as they say don't judge a book by this cover. The origin of the name is actually quite interesting (you will find out in the OP). This anime revolves around the Shinto religion. You may not understand some parts of RDG if you are not educated in the Shinto religion. It brings to mind when you're watching \"Rurouni Kenshin\", you may not understand some parts if you are not fully versed in the history of Japan. Evenso you can still enjoy both animes. While the story was sometimes confusing, you could still get the gist of it. A lot of the aspects in this anime are appealing, such as the art. The music is also very interesting, as it mixes some traditional anime music with some modern music. The ED is particularly good. This is a very good anime that will make you want to learn more about the Shinto ways of Japan!",
            "date": "2013-07-09T17:04:00+00:00",
            "helpful_count": 14,
            "mal_id": 104635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2612243.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Setsura1",
                "username": "Setsura1"
            },
            "url": "https://myanimelist.net/reviews.php?id=104635"
        },
        {
            "content": "After watching 11 episodes of this anime, I can safely say that this anime is strangely enticing. Focused on a goddess girl that can contact spirits/ghosts but only wanting to be a normal girl. The story is not all that interesting, and seems to have no correlation to it's name either.\r\nThe art in this anime is seemingly unique, but not the best. The characters are very typical and nothing out-of-the-ordinary aside from a few spirits that take on the form of other living things. The music isn't all that overwhelming although the opening and ending themes give a sort of eerie feel and are niceto listen to.\\n\\n\r\nAt episode 11, I still can't predict how this anime is going to end and feel like there will be a continuation. I wouldn't recommend this as a must-watch anime but it's worth watching if you have spare time, once again, it's strangely enticing.",
            "date": "2013-06-02T02:08:00+00:00",
            "helpful_count": 12,
            "mal_id": 99433,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/437142.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/aznfishie",
                "username": "aznfishie"
            },
            "url": "https://myanimelist.net/reviews.php?id=99433"
        },
        {
            "content": "The story of RDG is extremely good in the way it's done. They bring in cultural elements that are accurate and develop them into the story. Seeing as though the season is only 12 episodes the story goes at a pace which isn't fast but certainly isn't slow. The story is confusing, but the basic overall plot is revealed in the second episode. It gets add to constantly seeing as though with only 12 episodes, they really cannot waste one.\r\nAs with most P.A works pieces, it's very visually appealing. It isn't the best visually but has an overall look that does not disappoint. Certain moments,definitely where the Himegami arrives, are particularly memorable for the art adding to the intensity. \\n\\n\r\nThe scenes where Suzuhara dances are definitely the best points when it comes to the sounds. I would like to hear more but it does not fail to supply when it comes to the important bits. Such as moments where they try to build tension and fear in the viewer. Even the intro and ending are particularly well done.\\n\\n\r\nThe characters and their relationships with each others are done perfectly. It isn't at a pace that's glacial, but I feel the pace it's going at is plausible and satisfying. \\n\\n\r\nThe plot I find is unique, although I may be wrong in that point. But it definitely brings points of interest along with twists. The only problem I have is the fact that it isn't that popular.",
            "date": "2013-05-21T12:46:00+00:00",
            "helpful_count": 12,
            "mal_id": 97975,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Uyie",
                "username": "Uyie"
            },
            "url": "https://myanimelist.net/reviews.php?id=97975"
        },
        {
            "content": "What the flameo happened here?\r\nI know that it is easy to be a critic and all... but: This Anime is best summed up by an announcement made at 20:44 in the last episode of the series: \"Uh, at this point we are still unable to determine exactly what is happening.\"  If you watch that scene before watching the series you might think to yourself that you would be able to figure out what is actually happening if you had watched the entire series... good luck. \r\nAdmittedly my misunderstanding(s) and non-understanding(s) could be due to the fact that I don't know much about Shinto legends.However, I am human and I can usually follow plot points and basic story telling.",
            "date": "2014-07-10T20:57:00+00:00",
            "helpful_count": 11,
            "mal_id": 151467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3272637.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/toph4prez",
                "username": "toph4prez"
            },
            "url": "https://myanimelist.net/reviews.php?id=151467"
        },
        {
            "content": "It's always difficult for me to put a number and rate series that I have watched and as a result my numerical ratings tend to vary greatly. I can best express my opinions of a show through words.\r\nAfter the first episode this show began to draw me in. I was really interested in it. The story seemed very interesting and I liked all of the characters. I ended up liking the show more and more as I continued watching. In addition to the plot and characters I also really enjoyed the scenery, art, concept, and soundtrack. This show had a lot of great things goingfor it but there were a few places where it fell short.\\n\\n\r\nI liked the nature and Japanese lore premise that the series employed. The soundtrack matched it perfectly and the art was beautiful. The characters were great and I really like them. These are all categories which the series excelled in.\\n\\n\r\nThis show had a few things that really held it back. The most prominent of these things and likely the cause of it's other flaws is due to the length of the series. I feel that there just weren't enough episodes to work with. With only twelve episodes the series seemed rushed other elements suffered because of it.\\n\\n\r\nThese elements include the plot and characters. The plot seemed rushed and as a result it ended up being a bit choppy and confusing. I would watch an episode and then the next week I would be a bit confused about exactly what was going on. Things could have been more developed and better explained. The characters could have also been better developed. I found myself a bit confused about the Souda twins especially. The plot did an okay job wrapping everything up, but again, it seemed a bit rushed and underdeveloped.\\n\\n\r\nI think that if this series was longer and if the P.A Works had more episodes to work with that things could have been better explained and better developed.\\n\\n\r\nAll in all I really enjoyed the show and it's flaws all stemmed from the fact that the show seemed too short. The series does hint at a potential sequel which I would definitely like to see. Despite its flaws I would still recommend this to any anime fan, but specifically those with and interest in traditional Japanese culture.",
            "date": "2013-06-21T21:40:00+00:00",
            "helpful_count": 10,
            "mal_id": 101875,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1414159.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/robo731",
                "username": "robo731"
            },
            "url": "https://myanimelist.net/reviews.php?id=101875"
        },
        {
            "content": "K i know it's weird I'm giving it such a high score, but \r\nIt isn't full 100%\r\nThe scores don't give such a range and it's close enough to being that good. \r\nI honestly don't know why people are giving such low scores. People are saying that PA Works disappointed them this time, but I don't see how. \r\nThat was amazing. Honestly. it really blended Japanese \"religious/culture\" well with a normal everyday \"Fantasy\" anime. It works. The story was well written, the script was well-written, and for me, that's something big. The story goes at a reasonable pace and it's slightly confusing, but they explain itin their own way. And there are slight hints at somethings. Sometimes. \\n\\n\r\nCharacters are interesting and intriguing and drive the plot themselves, which I like to see. It's natural and isn't force like some anime I'm watching this season.\\n\r\nThe animation is good save for the fact that it's all in SD quality. It's still  fine.\\n\\n\r\nOverall, very good. As expected from PA Works.",
            "date": "2013-06-09T16:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 100499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/azandinoboi",
                "username": "azandinoboi"
            },
            "url": "https://myanimelist.net/reviews.php?id=100499"
        },
        {
            "content": "In my opinion the most Underappreciated anime of the year.\r\nRDG: Red Data Girl received a lot of mediocre reviews.\r\nWhile i do disagree with these reviews i can understand why. This is not an anime for everybody.About 50 percent of the time it's hard to understand just what the hell is going on. Though confusing, the story is very interesting and personally kept me entertained throughout.\r\nThe art was solid, Nothing exceptional but solid.\r\nThe Soundtrack was quite good, especially the Ending, which was very calm sounding.\r\nThere were characters i loved and characters i hated, i loved the two main characters and their relationship, it was my favoritepart of the show, seeing their relationship grow.\\n\r\nOverall Rdg is a very good show, and if it sounds any way interesting give it a shot and hopefully you won't be dissapointed :)",
            "date": "2013-09-29T11:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 114745,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2698755.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SakurasouBusters",
                "username": "SakurasouBusters"
            },
            "url": "https://myanimelist.net/reviews.php?id=114745"
        },
        {
            "content": "I went into this show pretty new to anime, so I had my expectations low, this show couldn't meet one of them. The show started off slow paced, it focused more on character development between Izumiko and Miyuki, which really helped develop their relationship, but after that there really wasn't much time for the plot.\r\nIn the end Miyuki is the only character to get true character development, going from a jerk to a decent guy, if RDG did anything right it's Miyuki, but that's where the good part ends.\r\n**********SPOILERS**********\r\nAs I said the plot progresses slow, leaving the ending incomplete with a scene in the themesong the never happened(Miyuki and Izumiko's kiss) and a plot line left unsolved(Mayura and Miyuki's \"marriage arrangement\").\\n\\n\r\nWhen I saw the first episode, even when I read the description, it intrigued me. The plot goes nowhere. The middle is hard to understand, choppy even. Things happening with little to no reasoning. Leaving things unexplained such as how Izumiko got her powers and why she can't touch electricity.\\n\\n\r\nIzumiko's personality isn't very clear. In the beginning she's sweet, but at certain times near the end she becomes mean towards Miyuki for random reasons such as going on a 'date' with her goddess self and other things.\\n\\n\r\nIzumiko's half goddess thing is also overlooked, the anime itself looks like a slice of life anime. RDG goes more into culture than they do the backstory.\\n\\n\r\nIf you like slow moving plots that go nowhere this anime is for you!",
            "date": "2017-07-06T18:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 252141,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6339966.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ViewTheBoo",
                "username": "ViewTheBoo"
            },
            "url": "https://myanimelist.net/reviews.php?id=252141"
        },
        {
            "content": "When I read about RDG: Red Data Girl airing in Spring 2013, I was kind of excited. The whole Synopsis sounded really good. Now that it has finished airing, I can safely say it was not what I expected!\r\nStory: The story centers around a girl, that is \"possessed\" by a goddess and can't handle anything electric, since it breaks the moment she touches it. She has been raised in the mountains, but one day decides to go to Tokyo and enter a High School there.\r\nThe Plot is based on different Shinto legends and sounds quite intriguing. Reality though looks a bit different. I liked thewhole concept the show had and in principle I liked how they executed it too. My only problem was, that I didn't understand anything. The whole show was full of fillers, that sometimes seemed kind of pointless to me (even if they weren't always). The explenations were , where I had my problems. It got me confused everytime.\\n\r\n6/10\\n\\n\r\nCharacters: We have our main protagonist Suzuhara Izumiko. A girl that has a goddess in herself. She is a really shy person. She does get some developement, but not as much as I hoped it to be.\\n\r\nThen we have the next character, Sagara Miyuki. He is something like Izumiko's servant. At first he seems to be really rude towards almost everyone, but it's not long into the series until we realize that he is a lot more kind than you might've thought at first glance. He probably is the one developing the most in the whole series.\\n\r\nIn total the other characters were ok. Nothing we haven't seen before, but nothing I would dislike either.\\n\r\n6/10\\n\\n\r\nVisuals: The show was produced by P.A. Works, who published other shows like Angel Beats! or Another. The visuals look really nice. The character design is beautiful and the backgrounds great. The Animation is fluent and everything seems to fit.\\n\r\n9/10\\n\\n\r\nSound: The sound of the whole show is in total quite ok. I didn't hear a lot of the OST to be honest, but when I heard something, I heard something it wasn't anything extraordinary. Both Opening and Ending aren't anything special either. They are both slow paced.\\n\r\nThe voiceacting was good and the emotions reached the one watching, if there were emotions needed.\\n\r\n6/10\\n\\n\r\nEnjoyment: My main problem was, as I stated earlier already, that I didn't understand it at all. It was confusing that was it. I found myself being bored while they tried to explain me things, because I had lost track already. Of course it might be that I am too slow at getting things, but that's just how I felt it.\\n\r\n5/10\\n\\n\r\nThe Show in total was a bit of a disappointment for me as one of the people, that really were looking forward to this show. Still it wasn't crap. It was just mediocre.\\n\\n\r\nOverall: 6/10",
            "date": "2013-06-08T14:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 100287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2200817.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/korison",
                "username": "korison"
            },
            "url": "https://myanimelist.net/reviews.php?id=100287"
        },
        {
            "content": "I didn't get it...at all!!\r\nI didn't understood the plot, or the characters.  There is this girl who wants to change and the boy besides her who doesn't want to be with her. Then you got a goddess whom can destroy the world and a bunch of kids fighting to be number one on high school... Then there is a lot of magic, spells,  and ghosts.  It is a hot mess. I don't know why I even watch it all. Can someone please give me my precious time back!!!",
            "date": "2015-06-04T20:22:00+00:00",
            "helpful_count": 7,
            "mal_id": 189571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3151519.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Angelitocurioso",
                "username": "Angelitocurioso"
            },
            "url": "https://myanimelist.net/reviews.php?id=189571"
        },
        {
            "content": "This anime is like eating a sandwich packed and full to the highest level. It looks good but somehow parts of it fall off and it's a waste.\r\nStory:\r\nThe start was really good, even the synopsis which is why I expected a lot from this anime, expecting it to be one of the best this season even but somehow even with the cute romance part between Izumiko and Miyuki, the end really failed to leave a satisfying ending.\r\nThere's a lot of confusion in my part maybe because I haven't read the LN but that just makes it more reason that the story should be properly explainedespecially to non-readers. Some parts left me confused: Why did this happen? What is the reason for this? Who is this person? The end was disappointing. It did not leave the feeling of completeness to the series and failed to shed some light on some things. It's like it left a lot of holes and nothing to fill it with. \\n\\n\r\nI like the concept of it but it failed to deliver. 6/10\\n\\n\r\nArt:\\n\r\nThe art was the one thing that's holding me to this series. That and the fact that I don't drop series even if they are on hold for so long already. Art is one of the strongest points, not a surprise since this is from P.A. works. Sceneries are good, character art is also good. *cough*Miyuki*Cough*\\n\\n\r\n9/10\\n\\n\r\nSound: OP is catchy, I don't watch the ED much and the sounds when Izumiko is dancing is also good. 8/10\\n\\n\r\nCharacter:\\n\\n\r\n7/10\\n\r\nIzumiko and Miyuki develops at the end. The triplets somehow make a development but at the same time I feel like there's something lacking. I just don't like the part where the characters aren't properly explained. For example, what is seriously the deal with her mother. I don't know why technology doesn't work. (or maybe I failed to catch on). Why does Wamiya and Takayanagi look the same? (Or maybe I failed to catch on that too) I don't even get the gist of the judges thing. Nevertheless, the story fails to expound more on characters, their decisions and even on the triplets.\\n\\n\r\nEnjoyment:\\n\r\nNot gonna lie, even if the story did fail to deliver, I was still somehow kind of hooked on the plot with all the goddess thing and during the times Izumiko does great things inspite of her insecurities. One thing that I really enjoyed was Miyuki and Izumiko. I love their end, but not THE END itself. Although I would have really loved it to see them kiss at the end. :C But like I said, too much confusion so 7/10.\\n\\n\r\nOverall:\\n\r\n6/10\\n\\n\r\nEven though I love those fleeting moments with Miyuki and Izumiko and the art, the story is still an important point and I feel like it's meant a 6 (Fine) rather than a 7 (good).\\n\r\nI wish they had more episodes so that it wouldn't feel so fast paced and won't leave that much confusion to the watchers part.\\n\\n\r\nSo much potential for this to become a good anime but 12 episodes butchered it or maybe it was the story board, who knows.\\n\\n\r\nA sandwich is still a sandwich and it's still fine.",
            "date": "2013-06-09T03:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 100359,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1231881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/daisy-",
                "username": "daisy-"
            },
            "url": "https://myanimelist.net/reviews.php?id=100359"
        },
        {
            "content": "So, it seems most people seem to have a problem comprehending this anime... admittedly this may be due to there being a discrepancy between the novels/manga and the anime (manga ended in 2014, anime in 2013, although the novel came out in 2012)... and, I suspect, it contains more than the anime reveals. Still, every individual episode on its own seemed to make sense, especially if one makes sense of the abstruse language characters often use.\r\nIt is a Shinto tale, so some researching could be useful at times (there are quite a lot of references, although not knowing the legends behind them doesn't necessarily precludeenjoyment of the anime) - it's really multi-faceted, though... even if it mythologically makes little sense, one can simply view it as a coming-of-age tale, as ultimately that is how it turns out... it is by no means conventional, and while some viewers might focus too much on the relationships of the characters to the exclusion of the surrounding narrative, in this instance their interactions are a crucial part of the storyline, as there was, throughout the series, a certain political struggle within the school... that was rushed, but the twelve episodes did in the end surely develop the main character.\\n\\n\r\nThe ideas presented, though, I think are the interesting aspect of the story here... one might be confused by them, but from an imaginative point-of-view, and with what limited explanations there are in the twelve episodes (and there are, even if viewers drop the anime after becoming very confused indeed) - concepts from having different ('spiritual') 'phases', to dancing to specifically access the subconscious, as only once suggested by a character, to summoning a spirit (unconsciously) due to loneliness - all understandable ideas (but, as this isn't a documentary they don't go on very long about them, which is why a curt or oblique explanation may be frustratingly confusing).\\n\\n\r\nUltimately, I don't think it was at all not done well... only twelve episodes, another season certainly useful, but the twelve existent episodes felt to me like they could be self-contained, although more of it would be nice...",
            "date": "2015-08-31T11:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 197565,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491626.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Seyfert",
                "username": "Seyfert"
            },
            "url": "https://myanimelist.net/reviews.php?id=197565"
        },
        {
            "content": "While the animation style was pretty good, I can't say that I liked much more than that. The anime wasn't that interesting overall, and it felt more like a chore to watch it then to actually enjoy the show. \r\nA lot of the character and plot development was either sloppy and cliche or really hard to follow. I did enjoy the sound track, and it did match the backgrounds and moods of the anime pretty well. \r\nOverall it wasn't a horrible anime, but it was boring enough to the point where I didn't want to watch it.  While I personally didn't completely love theanime I think that it contains genres that others may be able to follow better than I did and many people do like this anime.",
            "date": "2016-03-06T10:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 212370,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5097097.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/iSenpai",
                "username": "iSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=212370"
        }
    ],
    [
        {
            "content": "Red Data Girl was the anime of the season that seemed like it was a filler. While it looked nice and was quite visually appealing in terms of animation, its plot and characters did not own up to the nice treatment the animators did in the studio.\r\nStory wise, this anime seemed like something that needed a full 26 episode season to convey what they tried to convey in 13. The plot had many major holes, and the story seemed rushed throughout the majority of this series. \r\nThis is certainly not an anime to watch for the story, and if anything it was just something towatch because it looked pretty. I believe you can find better out there. \\n\\n\r\nNow to go over the major sections:\\n\\n\r\n--Characters and Story-- 4/10\\n\\n\\n\r\nIn summary: Relatively close to current time, there is a girl in the mountains of Japan that cannot touch technology because of what she is. She is a vessel for a shinto spirit goddess, and has really long hair to channel the goddesses power. Suddenly she is assigned a protector mountain monk named Miyuki to prevent evil spirits from doing her harm. Eventually they end up going to a school in Tokyo, they make friends and live happily together for the rest of their school lives after rejecting a lonely spirit.\\n\\n\r\nIzumiko is a girl that basically cannot mesh with technology. She touches anything electronic and it breaks, which is caused by her being a yorishiro, that is a vessel for a kami, a shinto spirit god. In terms of her character she is completely helpless in a modern society, and throughout parts of the series she looses control of herself to the kami goddess within her who is the exact opposite of how she is in real life. \\n\\n\r\nThis reverse mirroring carries onto the male lead character, Miyuki in an inverse sense. Miyuki is a mountain monk, and even though he has completed his training for dealing with spirits and sorcerers, he is practically useless in fighting them. He excels at everyday things, but throughout the series he feels burdened for having to protect Izumiko from society, and those who want to take advantage of her power. \\n\\n\r\nAnd the rest of the characters are extras that don't really make sense and don't seem to fit into what this story became too well.\\n\\n\r\nPlot wise, as you may guess Miyuki's feelings of burden slowly transform into love, which makes this story that had so much potential, go completely cliche. And because this story needed to develop into a love story, it completely ruined the epic spirits story that was going on at first.\\n\\n\r\n--Animation and Sound-- 8/10\\n\r\nThe studios that made this did a good job on this at least, so visually speaking you won't be disappointed. The characters faces are kinda flat, but that's about it. I have no real complaints.\\n\\n\\n\r\n-- Entertainment Value -- 6/10\\n\\n\r\nI always stick bad animes out to the end, and though it was bad, it was still a decent watch. Just to me it seemed like an emergency filler anime for the studio and station airing it. \\n\\n",
            "date": "2013-06-10T07:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 100575,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2428609.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/rossfudgew",
                "username": "rossfudgew"
            },
            "url": "https://myanimelist.net/reviews.php?id=100575"
        },
        {
            "content": "i just completed watching the show but i am still not clear about what happened. i read all the reviews which said that the anime wasn't good but i still thought to give it a try.they tried to put too many elements into the plot without bothering to explain it. the main characters had a lot of potential but in vain. the plot sounded promising but wasn't clear at all. the only episode which i liked and enjoyed was the first one.after watching the first episode i thought that the anime had something really good in store.i was totally disappointed in the series. i thinkthis is the first anime which left me so confused after completion. overall one of the most confusing anime i have ever watched.",
            "date": "2017-01-04T23:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 237467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5946125.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/animecritic007",
                "username": "animecritic007"
            },
            "url": "https://myanimelist.net/reviews.php?id=237467"
        },
        {
            "content": "Red Data Girl? More like Red Filler Girl, because that's what the entire anime is about -- fillers, and tons of them, that has nothing to do with the main core of the anime.\r\nIzumuki Suzahara is a foruteen years-old teenager who, ever since she could remember, has been living in a rather secluded woods area, away from most people's sight. She is called the Red Data Girl, or like the opening explains it, \"A girl in danger of going inextinct.\" She is apparently carrying some sort of goddess with her, whom appears at random times when she wishes to say or do something important. Otherwise,Izumuki is a girl secluded from the world in order to keep herself safe from people that would want to hurt her and use her powers for the bad. Along her joins Miyuki, a teenager of the same age that was chosen to manservice the goddess for the rest of his life.\\n\\n\r\nRDG is mostly based upon Japanese culture and folklore, history and symbols which might be confusing to one person, but the main issues that lies within the anime isn't the heavy lean towards cultural characteristics, but the really bad storytelling done throughout the entire anime. There are many issues discussed, that -- to the the very last episode -- you wouldn't understand, and couldn't pick on on your own. Even if you tried, you'd still have no idea what was going.\\n\\n\r\nCharacters are likeable, though no very important, and sometimes just really shady and odd. They would act very friendly and the next episode, go crazy and dramatically serious for no reason. This confused me more often than not, and honestly brought me to avoid liking ANY of them.\\n\\n\r\nArt is extremely good, scenery looks great and I personally also really liked the ending songs. Synthetically, this anime is perfect to anyone that likes pretty faces.\\n\\n\r\nOverall, I kept watching since I was excited about Miyuki-kun, considering that he was the only hot character there, and in a sense -- the voice of reason. Otherwise, I wouldn't actually recommend this to anyone. It's sad to see so many resources go to waste on a really weak anime.",
            "date": "2016-10-16T05:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 231877,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4912868.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JinKun",
                "username": "JinKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=231877"
        },
        {
            "content": "I didn't think that I would like this anime that much - I was wrong. The art is lovely and I loved the way that the characters were slowly brought to each other - it made it feel a little bit more realistic. The story was interesting and I - hopefully - plan on reading more into it in the future.",
            "date": "2015-07-15T03:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 193446,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4745247.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cat2819",
                "username": "Cat2819"
            },
            "url": "https://myanimelist.net/reviews.php?id=193446"
        },
        {
            "content": "I found RDG overall to be a decent show, and feel others are a little harsh on it. RDGs problem is that it plays with quite a few interesting elements. Elements, which are then essentially abandoned or ignored. This is a very low stakes show. Even in times of apparent \"danger\" never do we really feel the characters are at risk. This is a show about a girl whom serves as a vessel of sorts for a hime-gami goddess. And yet at no point does the hime-gami have any major role in the show. It is a show about a girl whose powers interfere withelectrical devices. Yet that also never has a major role nor point in the show. It introduces these interesting elements, then spends most of the episodes off doing other things.\\n\\n\r\nTo particularly appreciate the show, it essentially has to be treated as a slice-of-life. Simply watch, feel, and listen, without thinking about what the show isn't showing. The music, sound, and art is generally excellent. The characters grow on you. Though to be honest near the start they were terrible. The major problem with this show is that it is quite obviously demonstrates its novel roots. The sudden changes in character over the first few episodes, and the switching between many events are the hallmarks they were simply trying to cram too much of the books material into this 12 episode run. A lot of what is included is chaff and could have been easily cut, it is odd they did not do so.\\n\\n\r\nOverall this was enjoyable. Though completely low stakes, for an all powerful goddess type person, the main heroine never really does much. This is essentially a character drama of the heroine, her 'servant', and her two friends, and it never strives beyond being this. I think it is passable. Though you certainly aren't missing something superb if you decide to skip it.",
            "date": "2015-01-19T04:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 178481,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/partially",
                "username": "partially"
            },
            "url": "https://myanimelist.net/reviews.php?id=178481"
        },
        {
            "content": "As soon as I saw this anime on Netflix, the one thing that grabbed my attention was the background art and pleasant scenery. The plot summary seemed interesting enough: a girl serving as the vessel for the \"Hime-gami\" reluctantly. A bit cliche, but you don't know until you try.\r\nI wish I didn't try though.\r\nStory: 3/10\r\nI finished the anime more confused than when I started. Nothing in the series was every fully explained and/or rushed. There was an unparalleled feeling of dissatisfaction from something with so much potential.\r\nArt: 7/10\r\nAs I mentioned before, the art was what hooked me in the beginning. Being a relatively new anime,RDG had great perspectives and angles with plenty of detail in the backgrounds. The character design was very standard, however, and did not stand out.\\n\\n\r\nSound:  5/10\\n\r\nSpecial effects were nothing truly special. Voice acting was standard, though a bit emotionless even in scenes that were supposedly emotional (though I wouldn't know since the story was heavily underdeveloped). It was fair overall.\\n\\n\r\nCharacter: 3/10\\n\r\nI ended up not sympathizing with any of the characters or understanding their motives. There's no substantial background on any of them, even the main character! The \"romance\" is incredibly rushed and awkward. No one is truly memorable or has gradual development. It's just all too sudden.\\n\\n\r\nEnjoyment: 4/10\\n\r\nI mean, I watched all of it for the sake of watching it in case it got better. But alas, it was only 12 episodes and nothing really happened. There's no humor, sadness, anything. Just...confusion.\\n\\n\r\nOverall: 5/10\\n\r\nI am generously giving this series a 5/10 because of its art alone. There was so much potential in RDG and none of my expectations were met (besides art).",
            "date": "2015-08-22T21:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 196810,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/67202.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AnimeloverYori",
                "username": "AnimeloverYori"
            },
            "url": "https://myanimelist.net/reviews.php?id=196810"
        },
        {
            "content": "Story:\r\nHeavily influenced by Japanese culture, and in some cases newcomers might not understand, but it does not affect the plot too much. Otherwise, I'd say the plot is something new, and very intriguing. \r\nThe symbolism is nice, but I don't want to spoil so that's all I'll say.\r\nArt:\r\nThe animation is truly great and not very choppy at all. \r\nI very much like how they mostly stuck to natural hair colors in here. The characters were attractive, I don't know how you could think Izumiko looks bland, it's quite obvious this anime is heavily influenced by modern day Japan, where at school you cannot dye yourhair *cough, cough*\\n\\n\\n\r\nSound:\\n\\n\r\nThe voice actors have nice voices... The songs are great as well..\\n\\n\r\nI don't really have a problem with, except for the scene where the father is talking in English with an American, but the American's accent was very thick and it was a little hard to understand him.\\n\\n\\n\r\nCharacters:\\n\\n\r\nWhen it started off, I HATED Izumiko as well as Miyuki. However, as I went through the series, I began to warm up to her and notice her changes. I thought Izumiko found herself and what she wanted. So basically the character development was beautiful. Miyuki was a little bratty at first, but after time, you see different sides of him as his bond with Izumiko strengthens. alsohischaracterdesignissuperhot\\n\\n\r\nThe villains weren't evil for no reason, which was interesting.\\n\\n\r\nOne thing I disliked was the similarity in names like Honoka and Hodaka or Masumi and Manatsu, who happen to be twins/ triplets (along with Mayura).\\n\\n\\n\\n\\n\r\nI'm very excited about the manga and hope this gets another season, I like the direction this is going.",
            "date": "2016-07-19T17:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 224439,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5563830.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ceralynne",
                "username": "Ceralynne"
            },
            "url": "https://myanimelist.net/reviews.php?id=224439"
        },
        {
            "content": "so let's get right in to it!\r\nthe first few episodes left me every time with questions \r\nat the end of every episode I was like 'he...what... did I miss something?' it was so unclear \r\nthe male protagonist is quite handsome but in the first episode he is only screaming at others so that wasn't much fun \r\nI was actually hoping for some juicy romance where I could talk about all the time like the crazy fangirl that I'm but I was quite disappointed why? because there was nothing! in the end there was no kiss there was no awesome fight where in someone was rescuedthere was literally nothing! I'm writing this after finishing the serie and I'm so disappointed and dissatisfied with the ending\\n\\n\r\nokay lats be honest the idea is great, I love it! it's cute, romantic and you can totally fall in love with both the female and male protagonist but I just don't understand what's going on and that ruins the fun and it's not because I wasn't focusing on the serie because in the comments a lot of people said they didn't get it at all\\n\\n\r\nand I he could be just a little bit stronger it would be so much better \\n\r\ni have no problem with weak male protagonists but this guy literally couldn't do shit and that's annoying like hell\\n\\n\r\nso... I don't know if I liked it or not, ugh life of an otaku is hard! but I still think it's worth watching... I think... haha you guys should decide on your own\\n\\n\r\nhave fun watching... or not what ever you like",
            "date": "2017-11-22T11:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 263765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6014205.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Abosede-chan",
                "username": "Abosede-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=263765"
        },
        {
            "content": "When I watched some other works from PA Works, I really liked their way to draw so I started to get interested to RDG: Red Data Girl.\r\nI didn't really look at the plot(I didn't like to do that back then) so I was rather surprised about the story. A shy girl being the last vessel of the Himegami based on the Shinto Legends. and i didn't know anything about Shinto.\r\nBut no I did not get disappointed, like some other users i've seen writing about this. It was really interesting but yeah, a little bit confusing.\r\nThe art is nothing I can complain about. It's really beautifullydrawn and the sceneries are great. I fell in love with the art. There's absolutely nothing to complain about. it gave off a really relaxing feeling.\\n\\n\r\nThe sound was really awesome. I liked all the OSTs and the opening and ending was awesome. Izumiko's voice in ep.3, ep.5 and ep.7 was so pretty. The song was relaxing. I have never complained about the sound when watching the anime from PA Works.\\n\\n\r\nThe characters are well-designed, really pretty. But not so unique i would give it a 9 or 10. \\n\\n\r\nI really enjoyed this anime. This is one of the best spring 2013 anime in my opinion. \\n\r\nBut I understand why people disliked this. Too rushed and too confusing. \\n\r\nI read the manga and novel after watching this, and i noticed they skipped out ALOT of details. It would have been so much better with more episodes than 12. It wasn't enough and they skipped out explanations and all kind of things. A little bit disappointing, i would say ^^.\\n\\n\r\nOverall, this anime was really good but I feel like the romance was a little... weird?(not the right word)\\n\r\nI mean it felt like Miyuki just suddenly was like \"oh so apparently i like her\" or it's just me missing something. The novel had more romance on. xD\\n\\n\r\nThis anime is worth watching unless you hate getting confused.\\n\r\nI'll give this anime a 9/10. I was thinking of giving it an 8 but it really is worth a 9.\\n\\n\r\nBy the way, my bad for making no sense ._.\\n\\n",
            "date": "2013-12-06T11:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 122767,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/671583.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KawaiiDesu01",
                "username": "KawaiiDesu01"
            },
            "url": "https://myanimelist.net/reviews.php?id=122767"
        },
        {
            "content": "I liked RDG, I gave it an 8.\nThe best thing in my opinion: the art. It is just beautiful, plenty of details.\nThe story was great too, but a little rushed I guess. The first 2-3 episodes are the worst, after that the anime grows.\nThe characters are okay, especially when they reach Tokyo. To me, Izumiko is just too plain of a character. Too shy, too young. And I have to admit that she will be like for the entire show. But the rest of the characters are great, especially the brothers and the \"enemies\".\nIt is a beautiful and green anime, with a dark vibe. Ireally recommend to watch it, at least until ep 6. Then you will be able to know if you like it or not.\\n",
            "date": "2013-07-07T05:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 104227,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Friti25",
                "username": "Friti25"
            },
            "url": "https://myanimelist.net/reviews.php?id=104227"
        },
        {
            "content": "***MILD SPOILER ALERT***\r\nI enjoyed watching Red Data Girl. I have been meaning to watch a anime with less fanservice content or over-the-top-forced-on-yourself plot. I was tempted to the series because of the Poster I saw online. Unlike a typical Shoujo Series (like Code-E etc) the male lead, Miyuki Sagara as we know, looked well mature. Izumiko has a timid and fragile built. So it was evident for first goers to predict the storyline. \r\nSo it is true. The first episode starts off Izumiko not wanting to accept herself as the vessel for the Goddess Himegami. She is introduced with Miyuki Sagara who becomes horribly rudeto Izumiko. But what it struck me the most that the main lead, our Izumiko was just a fragile girl. So, I inevitably had in the back of my mind that the Production team wants us to learn more about Izumiko's story and her relationship with her alter ego. So I stuck to the series to know more about her.\\n\\n\r\nI am not disappointed at all by Izumiku's character development. At least she did not weep most the time. In fact it all made sense when we get into to the ending of series we get to know more about her Alter ego, or the Goddess Himegami possessing her using Izumiko as a vessel.\\n\\n\r\n[spoiler]\\n\r\nAfter Izumiko, I loved how incomplete Miyuki's character was. The series starts off with the strong male lead but it only in the middle of series we see him openly confessing that he doubts himself whether being suited for the job that he is chosen for. He says that he doesn't know how to protect her as he doesn't know how to protect his own self. Somehow, it did make sense because at times of our lives, we do become in-confident about decisions and the role given to us.\\n\\n\r\nWhat breaks my heart the most is that the series did not magnify Izumiko and Miyuki's growing closeness. Since as being an ardent Shoujo Manga reader I would expect more of romance. It is only in the few ending episodes we understand that Miyuki thought no longer of her as a burden. Although, the relationship between them grew maturely over the series keeping in mind that they were exposed to wonderful quests that reminded of their of their destiny. It did not give much growth to Miyuki's display of love for Izumiko.\\n\r\n[/spoiler]\\n\\n\r\nI felt that the Souda siblings arc got more focus than the main plot. Yet, Mayuri, Manatsu and Masumi has a great impact of both of our leads. It was obvious that Masumi, Mayuri and Manatsu's spirit, wanted Izumiko all to himself since she was the one to see him other than his siblings.\\n\\n\r\nAs obvious as it seems, the series just concluded open ended leaving the fans needing for more. Leaving most of our questions unanswered. Definitely hinting us to read the Original Novel. (It has a manga adaption as well but it is still ongoing. Sadness.) \\n\\n\r\nRed Data Girl is a wonderful watch if you wish to know more about Japanese Culture. If you are looking for a mild period series, this series is a recommendation. The scenery is breathtaking. The pace is good. You won't feel being rushed. The information is poured to you bit by bit. A kind of anime that I have been looking for.",
            "date": "2014-04-20T23:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 140719,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/422073.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/anime_aditi",
                "username": "anime_aditi"
            },
            "url": "https://myanimelist.net/reviews.php?id=140719"
        },
        {
            "content": "I watched RDG with no prior knowledge of the show other than the single sentence description it has on Netflix. I needed something new to watch, and it looked interesting, so I watched it and thoroughly enjoyed it. Then I went on MAL and read all of the reviews complaining about it and decided to write down my opinion.\r\nSubtlety is an underrated thing in anime (actually, in storytelling generally, but I'm going to focus on anime). There are too many shows that explain everything that appears on screen, bashing people over the head with long monologues explaining exactly what just happened, or barely disguised expositionto catch you up to the situation. And it's not just the bad shows that do this; even something as great as Madoka Magica can get bogged down by explanations.\\n\\n\r\nHowever, I personally enjoy when a show does not go to lengths to keep me perfectly informed. I prefer it when I'm just given the clues and I'm allowed to draw my own conclusions. For example, Manatsu and Mayura are not necessarily the most original characters, but Mayura at least allowed some room to develop and deepen because of a number of things about her and her situation that are not explained. It is because I am forced to draw my own conclusions about her that she becomes an interesting character.\\n\\n\r\nOf course, that's not the lack of explanation that people are complaining about with this show. People are complaining about the plot. They're complaining about the school and the judges and all of those other little things that are mentioned but never given any explanation. I would agree that those things probably should have been a little more explained. However, at the same time, it's the coyness of the show that keeps it original. If the power struggles, the rules, the goals, and the players were all well known, then this show would not be any different to any other highschool anime. What's unique about this show is that it gives you the clues to figure out the show without handing you the answer.\\n\\n\r\nTo prevent too much of a rant, I'll leave it at this; RDG doesn't make it easy for you, and, not only does that not make it a bad show, it is also one of the reasons that I liked the show. It's not something I would like if all shows did it, but in RDG's lack of explanation is a welcome relief from the overabundance of overexplained anime.",
            "date": "2016-05-21T20:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 219063,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3990745.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/apoddball",
                "username": "apoddball"
            },
            "url": "https://myanimelist.net/reviews.php?id=219063"
        },
        {
            "content": "Story - 4/10\r\nIn a word: rushed. What is happening in this story? Well, who can really say, out of your typical audience? In the end, I was still just barely able to follow what was happening, but that doesn't mean I was without any sort of confusion. Even if the plot WAS followable (barely), that does not excuse how poorly put together it seemed. Watching this series from beginning to end, it's hard to even accept this as a comprehensive narrative. It does not flow as it should and left me often feeling the pacing was completely off. It wasn't absolutely terrible, and the conceptsthemselves could have made for a good story - but the execution was poor. Perhaps with a longer series, this could have been avoided, but as it was it felt very disjointed and rushed.\\n\\n\r\nArt/Animation - 9/10\\n\r\nThe art and animation in this series is honestly beautiful. There's no distracting or over the top effects or filters, either - just some genuinely good art. Overall very enjoyable to watch - not the absolute best it could ever be, art wise, but still pretty damn good. At the very least, where other parts of this series might have seemed dull or disappointing, the art outshone everything and at the very least made up for some of the show's shortcomings.\\n\\n\r\nSound - 6/10\\n\r\nTo be fair, I watched the dub (not usually my first choice, but it's what was available to me), so I'm not sure how much I can comment on this in general - but it was okay overall. Sometimes the songs seemed overplayed or 'played up' so to speak - their attempts to tell the story through the score sometimes seemed to fall flat simply by way of being too over-exaggerated. Still, generally it was okay.\\n\\n\r\nCharacters - 7/10\\n\r\nThe characters in this are overall fairly nice and developed just enough not to leave me with any serious issues, partially perhaps because the true focus is on so few characters in the first place. At the very least, the main characters (Izumiko, Miyuki, Mayara, and Manatsu) were generally okay and I did find myself connecting with them at least on the slightest of levels, which is more than some anime can say. I did feel for the characters and their relationships with each other, but overall the side / minor characters seemed to distract from the story as a whole some, as it wasn't clear just how much emphasis was being placed on them and they did not truly get enough fleshing out for me to care about them or understand them at all. The balance of character focus also seemed to be off in a way that I can't really place; it simply came off as weird overall, especially when sometimes it felt as if the true main character, Izumiko, would often fall to the wayside for focus on characters the audience likely didn't really have any reason to care about.\\n\\n\r\nEnjoyment - 7/10\\n\r\nIt was good and I enjoyed it as a whole, though many parts left me with more questions than answers and some of it (especially the first half) had some clear writing issues and pacing issues et cetera. Still, an enjoyable anime. I may rewatch this and I may not - it isn't something I'm rushing to watch again, but I don't think I'd say no to doing so some day either. And who knows - maybe it will make more sense on a second go. One can only hope.\\n\\n\r\nOverall - 7/10",
            "date": "2016-05-08T19:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 218191,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3714377.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/tsundines",
                "username": "tsundines"
            },
            "url": "https://myanimelist.net/reviews.php?id=218191"
        },
        {
            "content": "This anime is the definition of confusion and will leave you saying \"whut?\"\r\nThis anime has an absolute great concept, fantastic animation, decent characters and sound but it all goes to die. It is very interesting but between episodes seem to be a time gap. It doesn't leave any explanation and basically leaves it it up to the viewers assumptions. To the very end I still have no idea what the heck 'The World Heritage Girl' is. I am very confused but I went with the flow and finished it to the end. I guess I'm satisfied with the ending but they leave out a LOTof answers and many holes. I do however 'ship' the main characters together. \\n\\n\r\nIn the end, I give this anime a 7 because even though the concept and art is amazing I still don't even know what this anime is about.",
            "date": "2014-05-24T19:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 144415,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3168833.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeAwesomes117",
                "username": "AnimeAwesomes117"
            },
            "url": "https://myanimelist.net/reviews.php?id=144415"
        },
        {
            "content": "This anime was interesting to me when it seemed like there was this one special girl who had a mysterious power over technology.  But it ended up being nothing like it seemed at first.  It turned out that almost everyone in her school had special powers, and the powers had more to do with spirits than technology.  A better name for the show would've been \"Red Glasses Girl\" or \"Red Spirit Girl\" rather than \"Red Data Girl,\" since the show had almost nothing to do with data.  The ending was also unsatisfactory.  We never learn the reason why Izumiko's pastself did what she did in the past, or why she wants to do it again.  (I'd be more specific, but I don't want to give away spoilers.)  The best thing about the show was probably the pretty art, but one thing about the art I didn't like was how it looks like the girls are always blushing.  I guess it could be explained as makeup, but I don't think Izumiko is the kind of girl to wear makeup everyday.",
            "date": "2015-12-20T12:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 206148,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/237304.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lainbow",
                "username": "lainbow"
            },
            "url": "https://myanimelist.net/reviews.php?id=206148"
        },
        {
            "content": "I thought that Red Data Girl was very cute. I would suggest this anime to someone who is looking for a short satisfying anime to watch while in between other anime or is just looking for something to do for a short while. I liked this anime because the art was fantastic it reminded me of a watercolor painting (Especially when the characters are in the mountains!) The music that went along with Red Data Girl fit very well. They were very calming and traditional sounds. The characters were fair. When I mean by that is that they weren't very iconic or such but theywere not bad, at all means, they still had some diverse personality characteristics and some very enjoyable moments and as you continue to watch the anime you eventually connect more with the characters and begin to like them. The story itself was fairly good and had interesting twists along with a mysterious vibe. I will admit that the story can be confusing and can at times feel random but a secret to fix that problem is that after the credits are over, on some episodes, actually continue the episode and explains a handful of things while tying some of the loose parts of the story together. Even though the episodes may continue at times while explaining things. The story still takes some decoding and moments to review what just happened so that you may gain some what of an understanding of what is actually happening within the story. Even though Red Data Girl may take some time to understand and to notice the hints that the characters give off, it is still a very cute and enjoyable anime to watch. Personally I may even consider re-watching Red Data Girl to fully understand the concept and to put more pieces together in the story. It also makes it easy that the anime is only twelve episodes long. If any of you were wondering why the anime is called Red Data Girl it's because there was actually a book published in the mid 1900's called Red Data about endanger species in other words Red Data Girl means, someone who is wanted by everyone because of their rarity and their powerful powers making them endanger (In the beginning of the anime there is a small script explaining the title of the anime and actually hints toward an important part that plays in Red Data Girl but be fast the small script goes very quick in the beginning making it most likely that you'll miss it, so if you want to read it you may have to pause between the frames and read it. Trust me it will help to explain things that later appear in the anime.)",
            "date": "2015-12-03T19:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 204733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5005926.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rice_Bowl",
                "username": "Rice_Bowl"
            },
            "url": "https://myanimelist.net/reviews.php?id=204733"
        },
        {
            "content": "Red Data Girl is fairly decent to watch if you don't think about it too hard. There are numerous aspects of it seem as if it tried to create a world much bigger than its run time actually allowed for. Notably, the story constantly feels lost in trying to explain the complex nuances of the universe constructed. This exposition for the viewer is necessary; I won't pretend that whatever rules and customs associated with this ethereal culture is common knowledge to everyone, least of all me. It is disappointing then, that the short run of the series effectively limits the intricately developed world to showa satisfying and coherent story. If there's anything to say about it, the overarching story is weakly connected by several subplots and vice versa resulting in a vicious cycle of unsatisfying storytelling. I couldn't tell you if there were any loose ends (it certainly felt that way) just because of how upset I was with the handling of the plot.\\n\\n\r\nThis series should be enjoyed for its art style and aesthetic, with colour schemes and character designs that allow the spiritual nature of the story to shine through. I can't speak on the authenticity of the religion involved, but the outfits, architecture, and general design promote a clean look that seamlessly blends the real and surreal aspects presented; no outfit, demon or spiritual being that appeared looked out of place. I especially appreciated that the music complemented this whole style without ever feeling out of place; especially the opening theme's opening verse with those tastefully dissonant clustered chords. That really sealed the deal and set the tone for the exotic nature of the series.\\n\\n\r\nAll things considered, this series will be hit-or-miss. The lack of story and/or emotional stakes does knock the series from being universally enjoyed. But if  you can look past that aspect and enjoy the occult-like feel of the series, it would be worth watching if not for the aesthetic appeal.",
            "date": "2015-09-28T20:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 200028,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4813721.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Alacarte",
                "username": "Alacarte"
            },
            "url": "https://myanimelist.net/reviews.php?id=200028"
        },
        {
            "content": "RGD: Red Data Girl is an anime about a young girl, Suzuhara, who has had a mysterious ability since birth and why she has it and how she copes with it. It's also about a lot of other things, but the whole show is just so confusing that I can barely comprehend any more than that.\r\nThe anime is based on Shinto legends, but I admittedly do not know any of these legends myself. It takes place during the modern era, but has a great deal of magical and supernatural elements to it. In fact, due to the main characters \"condition\" there is not a lotof technology present in the show at all. I want to say there was a plot and plot twists, but I really don't understand what happened enough to really say anything about that.\\n\\n\r\nSuzuhara is the Red Data Girl, and the story is basically how she balances being special with being normal. She is inherently shy, to the point where it can be annoying. Sagara is tasked to protect her, even though he does not really like doing it. There are other characters, but I'm not even sure how they matter, characters just get thrown at you and have no development at all. Suddenly bad guys appear and I'm thinking \"where did these guys come from?\" I will go as far to say that the mains get some development, but while Suzuhara's is extremely slow and ballanced, Sagara's is very abrupt and seems kind of fake.\\n\\n\r\nAmong the most problematic issues in the show is the pacing. Nothing happens in the first 4 episodes and then you finally get to an important plot point which should have been revealed within the first 2 episodes at the most. Everything just seems very scattered, it goes with all this supernatural stuff to trying to be all mysterious and all, and then suddenly they are in school doing school stuff.\\n\\n\r\nI think the consensus is that the show would be better if it had double the episodes. I'm not really sure about that since the show not only seemed incomplete but also slow, and confusing due to how the show was put together and not because of any constraints. I mean, some shows need fillers episodes for a 12 episode season, I'm not sure what happened here.\\n\\n\r\nOverall, I'd suggest you stay away. Use your special powers to shut this show out of your watch list, whatever.",
            "date": "2015-06-23T01:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 190989,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/143607.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/WildNeptune",
                "username": "WildNeptune"
            },
            "url": "https://myanimelist.net/reviews.php?id=190989"
        },
        {
            "content": "When I was originally reading the synopsis of the story, and it had me think I would see something like Kekkaishi, sadly, it seems I had my hopes up for nothing. While the story wasn't as good as Kekkaiishi, this doesn't mean it was unenjoyable or bad.\r\nThe plot had a lot of potential, but it wasn't capitalized on. There was an opportunity to go far into the world of spirits, but in a puzzling turn of events, they seem to have gone more slice of life style. \r\nNow while slice of life with spiritual elements isn't bad, its the way this anime tried it thatsubtracted from the experience. It seemed like the story types were jaggedly cut and attempted to be placed back together to try and form a coherent puzzle.\\n\r\n It went from spirits/culture, right into school/life, and back and forth. It felt like the genres were playing tug of war to see which had the right to be on screen more than the other. This caused the story and enjoyment in watching to suffer in turn.\\n\\n\r\nThe characters archetypes are rather basic, though I do like the lead and her personality for the most part.\\n\\n",
            "date": "2013-09-16T15:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 113129,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2851887.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mamberu",
                "username": "mamberu"
            },
            "url": "https://myanimelist.net/reviews.php?id=113129"
        }
    ]
]