[
    [
        {
            "content": "As a veteran harem watcher, this anime isn't entirely original in its character personalities, however it made up for it with the story it has.\r\nStory: 9\r\nThe story itself is a good one, there are people who have memories of previous lives that they  had and have special weapons and spells from it. The world is constantly under attack by monsters whom are fought by the said special users. That's more or less the background story, with the show centered around the main male character who turns out to be one of the strongest with a harem of girls (more detailed in characters)\r\nArt: 7\r\nThe artwas kind of average, it wasn't the worst but it wasn't the best either. There were some, not many, but a few instances in which it could have been better.\\n\r\nSound: 7\\n\r\nThe sound was average like the art, it was fine but definitely could have been better.\\n\r\nCharacter: 6\\n\r\nHere's the list of rhe basic main characters:\\n\r\nThe kind, strong main male lead.\\n\r\nThe hyperactive girl who loves the lead, despite being a sister in a previous life.\\n\r\nThe quiet, mean emo girl who, like the previous girl, loves the lead as having known him previously in another life\\n\r\nThe pretty russian beauty who comes in midway in the season.\\n\r\nAnd a whole lot of other side characters.\\n\r\nEnjoyment: 8\\n\r\nI give it a 8 for it, despite a lot of cliche characters, had a decent story behind it, however it would have been higher if they didn't try to cram another 12 episodes worth in the last 5-6 episodes.\\n\r\nOverall: 8\\n\r\nIt was a fine anime that I enjoyed throughout the weeks that it aired, however near the end even I could see how much potential story the writers tried to cram in the last few episodes. In my eyes, this could have easily been a 10 for me but due to the lack of budget and patience the writers had, this anime didn't get the 24 episodes that it deserved.",
            "date": "2015-03-29T16:22:00+00:00",
            "helpful_count": 140,
            "mal_id": 183992,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3066335.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Somebody101",
                "username": "Somebody101"
            },
            "url": "https://myanimelist.net/reviews.php?id=183992"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nPoetry is an interesting form of writing when you take a step back and appreciate what it does. It can be a beautiful piece about a long lost lover or a depressing description of the death of a family member. It can be anything it wants to be because it’s, well, poetry. Some do it for fun while others do it as a hobby. Others still base their entire careers on crafting words together in intricate ways – most music is composed of lyrics that are themselves poetry. But what if it was instead used forsomething a bit more avant-garde? Maybe, instead of just fighting with swords and spells, people fought with words, too? Seiken Tsukai no World Break does exactly this, and it is as ridiculous as it sounds.\\n\\n\\n\r\nSTORY\\n\\n\r\nWorld Break follows young Moroha Haimura who finds himself attending Akane Academy. There, he meets two girls from his “past lives,” Shizuno Urushibara the ice mage and Satsuki Ranjou the dependent sister. Together, they fight as Saviors, defeating evil one line of prose at a time.\\n\\n\r\nWhether or not it can be deemed a “feat” is questionable, but World Break does something that most anime wouldn’t have the guts to do: have their entire narrative’s foundation based on a plot contrivance. Feat or no, this is atrocious. This isn’t just a hole in the tale in the sense that they forgot to mention some important detail or they outright refuse to give it relevancy. No, what the anime does is give Moroha the capability to simply “remember.” He literally, while fighting a giant hydra or a mutated behemoth, just happens to have a recollection concerning with some part of his past, providing him with newfound knowledge in order to defeat whatever monster he happens to be fighting. This goes beyond being over-powered; main characters that are similar in strength at least have some background in regards to where their skills come from. But here, every battle involves the same unfair, random power-up at just the right moment to swing the battle in favor of Moroha and the good guys.\\n\\n\r\nYet it’s not only this broken crutch that the anime leans on. Many of the other aspects of the show don’t work because they’re unfounded or unbelievable. The aforementioned poetry is one such issue; besides being a completely silly premise, it’s nonsensical to have to write poetry in the middle of a fight in order to use one’s own abilities. Another example is the “Big Six,” a league of Saviors who are the heads of their respective countries. They seem to hold large influence, but either don’t do anything despite their positions, are uncharacteristically evil, or even become incapacitated for no other reason than to add on to the list of ever-growing coincidences. The “Transportal” being usable once a day, everyone besides Moroha being useless at what they do, Urushibara’s and Satsuki’s miraculous, deus ex machina recovery near the end of the series; there are countless instances that continually make the anime more incoherent than the last.\\n\\n\r\nThis all sounds like rather niche entertainment, the kind of “so bad, it’s good” media that at least provides some semblance of direction. But that’s not the case; in fact, World Break is essentially mindless in what it sets out to do. There are no themes, there is no focus, there doesn’t even exist a solitary arc that means anything to anyone. This is because our main lead is already destined for greatness, no matter where life takes him. Meaning, not only do we see that he is over-powered but it’s already predetermined that he will be. The idea that past lives have similarities across each other works against the anime, and not just there; it can be seen with Urushibara and Satsuki ending up with him. Even when there are obstacles preventing them from being with him, we “know” that they will eventually be together, and we know they will be by his side because the show’s premise dictates it being so. The finale also doesn’t have any merits. The notion that camaraderie and togetherness can change fate not only goes against everything it’s always been stating otherwise but it’s the only instance where anyone besides Moroha actually does anything, giving us no precedent for such a development. All together it’s a bunch of pointless plot points that contain zero value whatsoever.\\n\\n\r\nANIMATION\\n\\n\r\nWhile the quality of the art for World Break is usually low – there are serious camera issues, lighting is an afterthought, and the choreography of the action is pretty poor – it does at least give itself the chance to showcase a wide range of abilities. Various, large scale attacks such as the beasts made of thunder and lightning, the diverse kinds of magic used by the students, and the other weapons that are wielded provide the show with the opportunity to break up the monotony when it comes to not only the story it “tells” but also with the boring locales that are chosen. That last point mainly stems from where the battles take place; most of the time, they are forced to be airborne, causing the backdrops to always become cloud-filled skies. Worse still, and even though the anime is given the chance to demonstrate different skillsets, it always has to fall back on its poetry. Meaning the foreground is often littered with words and writing, which gets in the way of everything else.\\n\\n\r\nThe character designs tend to be hit or miss. Urushibara’s long purple hair, green eyes, and nice figure define her as the cool beauty that she is. Satsuki, likewise, has her spunky personality showcased through her fun, pink hair, yellow ribbon, and constant smiling. And Elena’s medium-length white hair and gray eyes mirror her emotionless and mysterious demeanor. The flip side contains Moroha with his single strand of silver hair to make him somehow unique, Mari’s (the principal of the academy) witch attire, and Sofia only being known for her enormous bust.\\n\\n\r\nActual animation suffers greatly for nearly the entire series. Sword swinging is often simple swipes, running is jerky and off-putting, and even when characters are sitting or talking with one another, there is hardly any movement to be had. The only portion of the show that sees increased attention is, once again, the word writing: the hand and finger motions are given nice detail since they are what take center stage at nearly all points in the show. But waving one’s hands around here and there doesn’t add up, leaving the animation in a less-than-stellar department.\\n\\n\r\nCHARACTERS\\n\\n\r\nWhat’s astounding about some of World Break’s characters is that, despite the large focus on the past, there is very little learned about any of them. And not just in the sense that their past lives are filled with nothing, for that is partially true, too. Satsuki’s only claim to fame is being Moroha’s past sister. That’s it. She isn’t strong, she isn’t fast, and she isn’t even friendly. Her personality is as one-dimensional as it comes, with her being extremely clingy and defensive of anyone getting close to her loving brother. Moroha doesn’t fare much better, either. They make passing references to his relatives’ deaths at some point in his life, as a means to demonstrate that he is “unable” to protect the ones he loves. But outside of one, one-second clip, they’re importance is insignificant. His past lives are also filled with improper explanations concerning who he is as a person; all that is shown for the longest time is that he is a really strong guy. In a way, his obtuse lack of characterization defines him as someone without a past, as a boy whose only prevalent feature being the remembering he does on a semi-frequent basis. And looking at nearly anyone else besides these two shows a glaring issue: nobody is given their past. Again, when a core facet of the anime isn’t even applied to the majority of the cast, it only serves to weaken its overall value.\\n\\n\r\n“Nearly anyone” was used because, as the phrase implies, not everyone is averse to such a problem. More specifically, Elena and Urushibara do manage to use the show’s focal point to their advantage. Elena is a woman who originally worked for the Russian branch of Saviors as a kind of spy. However, she was more or less forced to do others’ biddings due to her brother being held captive. What’s interesting about her case is what is later revealed: that her past wasn’t real, or in other words, she never had a brother to begin with. In a sort of roundabout way, World Break argues that one’s past shouldn’t control what you do. It is, after all, the past, and nothing from it can be changed. Meaning, instead of letting past transgressions haunt your person, fight in the now and for the future; for it is there where the possibilities are endless. Unfortunately, Elena’s character and the message she carries isn’t around for long; after her mini story-arc halfway through the series, she is subsequently pushed to the side and barely looked at again except for the occasional fan-service.\\n\\n\r\nUndoubtedly the strongest character from the anime is Urushibara. Her past is mired in violence and darkness, which may be a factor that contributes to her cool and icy behavior. Having been a slave, she’s no stranger to chains, torture, and loneliness. This last detail is important, because it also highlights where her caring attitude comes from. For while she teases Moroha, Satsuki, and the others while remaining composed, it’s her previous lack of relationships that causes her to cherish the ones she has now. Initially, she finds herself in the same situation, with no one to turn to but herself. It’s not until Moroha saves her, as he did back then, that she remembers that there is always somebody there watching over you, that there is somebody thinking about and loving you. This, once again, ties back in to her keen understanding of others and the kindness she shows towards those near her.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme has a strange vibe about it. It’s weirdly “scary,” given the instruments and the other, ambient sound effects. This may be due to World Break’s reliance on the past; learning or investigating one’s background can sometimes be filled with rather frightening details. It’s oddly paced, adding further to its unsettling tone. The ending theme is beyond generic – regular singing segments and a used-too-often beat. Overall, the OP is a step-up from the ED, but not by much.\\n\\n\r\nThe soundtrack is laughably forgettable, save for one piece: the more choir-like track that plays during Moroha’s “past remembering” phases that adds a sense of sadness and longing. Other than this track, nothing else stands out or is even remotely memorable.\\n\\n\r\nAs for voice acting, that sits somewhere around average. Special shout-outs are in order for Aoi Yuuki as Urushibara for her calm yet sexy way of speaking and Ayana Taketatsu as Satsuki for never wavering when it came to giving the peppy girl her hyperactive way of talking.\\n\\n\r\nENJOYMENT\\n\\n\r\nDespite all of my harsh critiquing of the anime, I still found myself laughing during certain segments, particularly those involving Urushibara and Satsuki. Not only were their interactions with Moroha pretty funny and rather cute, but the relationship they had between each other – with the constant fighting, joking, and one-upping – were typical harem antics that easily put a smile on my face. Even Elena managed to get in on the action whenever she was around, adding one more girl into the equation.\\n\\n\r\nBut when those three weren’t around, the show took a dive. The action was never engaging due to the poetry-usage being quite silly, the “drama” didn’t move me, and the rest of the characters were tiresome to watch. I found myself not liking anything else it was doing that wasn’t dealing with Urushibara, Satsuki, or Elena’s humor and personalities. And since the show (understandably) couldn’t focus on them all of the time, I subsequently found myself not finding satisfaction all of the time, too.\\n\\n\r\nSeiken Tsukai no World Break is a show that didn’t have much to begin with. While some of its characters are entertaining by themselves, everything else – from the story to the animation – drags it down. Unfortunately for this one, there will be no poems ever crafted in its honor.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, narrative is founded on contrivances, nonsensical world aspects, and mindless plot elements\\n\\n\r\nAnimation: Bad, art is boring and distracting despite some variety, mix of good and bad character designs, with below average actual animation\\n\\n\r\nCharacters: Bad, Moroha, Satsuki, and the majority are very weak, Elena is okay, and Urushibara is good\\n\\n\r\nSound: Bad, okay OP, bad ED, bad soundtrack, average VA work\\n\\n\r\nEnjoyment: Fine, Urushibara, Satsuki, and Elena were fun but that’s it\\n\\n\r\nFinal Score: 2/10",
            "date": "2015-05-20T20:35:00+00:00",
            "helpful_count": 103,
            "mal_id": 188299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=188299"
        },
        {
            "content": "If there is a generic MC with Kirito's voice, there is a way.\r\nIt is up to people who have awakened their memories of past heroic lives to stop the monsters! Or so they say, the only ones who actually use the past life plot device are the MC and his two initial love interests, in order to justify instant infatuation and \"not really incest\". Not a thing is mentioned about anyone else.\r\nThe story progresses as Moroha, our average, unremarkable boy, becomes self insertion fantasy incarnate. At the beginning we get the \"i awakened to a strong power and won\" cliche, only to turn him intothe monster slaying god next episode. He has enough power to become the seventh S-rank savior in the world on episode 2, 2 weeks after awakening his powers. From there, it only ramps up the achievement ladder. The MC kicks ass on levels unseen even in other self insertion fantasy light novels.\\n\\n\r\nAs for the other characters, we got the \"Not incestuous tsundere little sister\", the rich kuudere, a deredere loli, the director, whose only role is being a teleportation gate, the band of Saviors from the school (you may forget there is a school after the first two episodes) who appear as an excuse to prove Moroha's absurd power level, and the other S-rank. The interactions among characters other than the harem are close to null, if there is any, it is sexual or is used to slip in breast jiggling.\\n\\n\r\nThe S-rank deserve an individual paragraph. Two episodes after it was stated that they are basically government dogs without freedom, they show you how they chill together watching Moroha and his crew struggle against an unprecedented beast while refusing to aid at all, followed by a whimsical fit where they impeded the only one who wanted to help from doing so. In later episodes they are never ordered by anyone, and even take trips to Japan on a whim. So much for the last line of defense.\\n\\n\r\nBy the way, there were supposedly many other Savior squads in Japan, but there is not even a glimpse of them, even when there are national level threats. So it all comes down to Moroha's goons to get the brunt of the attack while Moroha tries to remember what spell he has to use.\\n\\n\r\nAs for the animation, I will commend Diomedea on this one. It takes actual effort for it to be so bad. Inconsistency of size and distance, sudden jumps, choppy movement, Backgrounds moving at a different speed than the characters, embarrassingly bad CG, even the character design is terrible. If you are a modest studio and try to take on 4 anime on the same season, you are going to have a bad time.\\n\\n\r\nI personally don't sense much of the BGM when I'm watching an anime, unless it is either truly epic or completely inappropriate. Since it wasn't much of an issue, I'm unable to accurately evaluate. Both the opening and the ending had some slightly irritating voices, but other than that, it passes as satisfactory.\\n\\n\r\nThis is a series that you can only watch if you are searching for a failure to laugh at. Since that was my objective all along, I thoroughly enjoyed myself by facepalming at misplaced eyes, sudden knockdowns and slashing at the void because there was no money to actually have a perspective where you can see the enemy being cut.\\n\\n\r\nAll in all, a series that will make you apologize for everything else you called bad. Every time I see a sword grow half a meter, faces disappearing on far away characters, or an MC being a boob magnet or crotch diver, I just laugh and say, it is still not bad as Seiken Tsukai no World Break.",
            "date": "2015-03-29T13:58:00+00:00",
            "helpful_count": 72,
            "mal_id": 183966,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/jmoxor",
                "username": "jmoxor"
            },
            "url": "https://myanimelist.net/reviews.php?id=183966"
        },
        {
            "content": "This was easily the most frustrating anime I’ve ever watched. From terrible characters to a haphazard story it never showed any signs of being any good. It’s becoming a sad world where you find more of these idiotic attempts at making quick money cause of boobs than people actually putting effort into making a memorable story.\r\n\tStory: 5/10\r\n\tThe story premise is actually kind of interesting. It’s the true highlight of the show and if left to its own devices could have generated a very likeable anime. However the story is way to wavy and it’s the lulls they really drag down the story as they aremuch more frequent and take up way to much of the time. If the more important parts of the story were allowed to be viewed at much more length while taking out unnecessary leisure bits it would of been much more balanced. Instead more time is invested into deciding who likes Moraho more.\\n\\n\r\n\tCharacters: 1/10\\n\r\n\tIt’s really hard to choose the best boobs I mean character. The person in charge of character design was handed a promising story and said “wait, we don’t have enough big boobed bitches in this story, let me add around 20 more.” And thanks to all these girls, the anime was ruined. Now I can’t blame every girl but most of them are just there to be annoying and provide fanservice. We’ll look at the main culprit, the newly named pink haired bitch, because I don’t even want to remember her name, and thank her for making it that difficult of a time. All of the melodrama came from her be it her trying to be the best sister, this one would be cringcest, or just trying to help and utterly failing. I once joked around with a friend that if they killed her off in the first four episodes I would give this show a 10/10. The only other girls of the main harem; Urushibara, and Elena and even to an extent Angela are the only girls that actually helped move the story along. Every other girl you meet except for some girls during the Russian arc are pure fanservice and become utter turn offs.\\n\\n\r\n\tSo rant over on the failed girls, how did the main male do? Well he actually was a very solid character. Bit of a cliché as the standard hero, always protecting something and awkward with the girls. Yet he’s also very quiet and is quick to become deathly serious when need be. He also stands firmly beside his morales and friends willing to take on all punishment. If this anime just centered around him it could have been so much better.\\n\\n\r\n\tArt: 6/10 \\n\r\n\tIt’s not the most beautiful anime of the season, but it’s definitely not the worst. You can easily see a lot of sharpness and colour in the characters themselves. However it just achieves what I would say is standard quality for today’s anime.\\n\\n\r\n\tSound 8/10\\n\r\n\tI actually liked the music. It was the one part of the anime that could not be mucked up by the fanservice characters. Many strong sounding tracks that helped build up scenes. The piano version of the main theme became a very memorable piece, despite what the characters would normally act like, the moment this song played everything would just slowly calm down. \\n\\n\r\n\tEnjoyment: 2/10\\n\r\n\tI had mix feelings on this anime. While the story could prove very interesting, the producers constantly had to force in the ecchi/harem aspects so that we might never enjoy the actual story. If they could of even toned back some of the characters it could have proved to be a fun watch.",
            "date": "2015-03-31T13:32:00+00:00",
            "helpful_count": 64,
            "mal_id": 184264,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3552353.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/zperson5",
                "username": "zperson5"
            },
            "url": "https://myanimelist.net/reviews.php?id=184264"
        },
        {
            "content": "STORY: 6/10\r\nCHARACTER: 2/10\r\nART: 2/10\r\nSOUND: 7/10\r\nENJOYMENT: 5/10\r\nOVERALL: 6/10\r\nWhen you keep on repeating “I Remember Everything” every single episode, then YOU DON’T FREAKING REMEMBER ANYTHING!! \r\nSo, we start in a world with a ridiculous albeit interesting premise of humans tasked to remember their past lives since it stirs their hidden inner powers! They have a school where students are trained to become warriors, so they can stop the monsters that pop up at random. Moroha happens to be in this school even though he hasn’t ‘awakened’ yet so it begs to question how he even got admitted in the 1st place! Anyway upon remembering his previous life,it turns out he had 2! One where he’s a White shining Hero and the other where he’s a Dark Cold Antihero. And this is where the anime caught my attention because I was expecting some serious character development for our MC, thinking they would further explore the struggles of Moroha trying to find a middle ground between his past 2 lives. That would have been great right? But the creators decided to deem all this unworthy by skipping through it and opted to only present us with titbits of his previous lives in a sloppily rushed manner! Which seems to happen at the worst time possible, usually during the climax of a fight where the MC simply remembers a half-assed memory which provides him with a spell or technique that helps him defeat that specific monster! Repeat this a few times and all tension has vaporized since the MC just swoops in and safes the day without any trouble! Even the story isn’t coherent, with the show moving in no particular direction except for a series of pointless events that happens one after the other and Moroha comes out victories and unharmed every time cause he’s our MC! This doesn’t help the fact that whatever little story does exist, is filled loop holes. For instance, you meet the S Rank group and it’s suggested they are under constant pressure from government jobs with no time for themselves. Yet all we see are these S Rank chaps moving around at their own freewill with no worries in the world and doing whatever they feel like doing!\\n\\n\r\nThe characters are mostly kept to the background except for the 2 leading girls, so you pretty much forget about the rest. The lead girls are a red haired Tsundere who’s only contribution is being the MC’s sister from the past life and her over clinginess to Moroha really made her unlikable. The other one is the dark-haired girl with a rich family background and we don’t see much from her either, though I really wanted to know more about her interesting past. You have a Principle who only shows up when it’s time to use the teleportation gate and the rest aren’t worth mentioning, in fact you forget we are in a school with tons of other students. We hardly get any real character development, for all the girls are present just for fanservice with big chests and googly eyes at the MC while the guys are mostly kept at the background with 1 or 2 exceptions. They planted the seeds for some great personal growth for Moroha but sadly it was lost to a standard hero who would do anything to protect the people he cares for. (You know the cliched hero trope) Elena managed to stand out at first with her own tragic story but once her arc was over, she was side-lined to being just another girl! And while some of the comedy worked, like the jealous fights between the girls, I feel like they stole precious time for the actual plot to prosper! I mean think about it, we don’t get anything about their life from the past, so we can just forget that. But then we don’t even get a lot of info about their current lives either which pleads to query, when are you going to progress your characters?\\n\\n\r\nThe animation isn’t good either with bad character designs, poor use of CG and the inconsistencies with sloppy movements and facials really begs the question who made this! The size and speed of the characters conflicted each other at times and this is a 2015 release! I did like the magic display though and the power demonstration during the Russia arc were good, but it isn’t enough to save the show from the rest of the mess. Music too follows this route by delivering moderate OP and ED that never sticks the landing but. Yes, there is a but! Some parts of the soundtrack are good, especially the main theme ‘Dragon Heart’ which is usually played during the big moments in the anime. I just wish the rest of the anime had this soundtrack’s level of sophistication for it was a joy to behold the symphony at play! This memorable piece of music always managed to get my attention and I loved every second of it.  \\n\\n\r\nWith all my ranting so far, you would be expecting a serious low figure for this anime but despite all I just said, the show did manage to make me smile at times. And I truly enjoyed the potential of the story which the anime never bothered with. Add in the bad fights and boring drama, and you are left with mostly bad show with little hints of good in it! I just wish they had toned down on the fan service and focused more on their material cause the anime really had a chance. Sigh! Maybe it will get remade in the future, for now it’s not worth recommending to anyone. And you can catch the soundtrack online which is this show’s biggest standout so no need to sit through the entire episodic season!",
            "date": "2018-01-19T03:24:00+00:00",
            "helpful_count": 8,
            "mal_id": 269008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6421599.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PakiUSA",
                "username": "PakiUSA"
            },
            "url": "https://myanimelist.net/reviews.php?id=269008"
        },
        {
            "content": "Having seen a lot of harem anime, this one is unique in that the main character and 2 of his romantic interests are reincarnations of their past lives, meaning both of them were his lovers at one point, which makes things interesting for the present, especially with the addition of new fan girls. The romance plot as well as the action are pretty decent in this show, especially the spell casting, thought I don't understand why nearly every spell has to have some blasphemus phrase to it. The show has been a fun watch overall, but the downside is it's got some of those unfortunateaction and harem cliches you just can't get away from nowadays. Also, the intro song is utterly terrible. I probably won't watch it again but you might like it. It's pretty similar to Aesthetica of a Rogue Hero, which I think I prefer.",
            "date": "2015-03-29T23:15:00+00:00",
            "helpful_count": 18,
            "mal_id": 184041,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3404479.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/UponAShallowBay",
                "username": "UponAShallowBay"
            },
            "url": "https://myanimelist.net/reviews.php?id=184041"
        },
        {
            "content": "Well, I tried whit other form in this second review....\r\nStory\r\nA tipycal story whith the generic main character. Haimura, Moroha have  a one great and unic power. This MC going to school where people come together with this power or similar. In this school  He  created own tipycal harem.  (girl whit big boobs vs girl whit pettits boobs, the quiet girl, the loli...) To this must be added the power of Haimura, that acts of wildcard throughout the anime; one \"remember\" and he can use a a prohibited technique, this makes almost no effort to end the anime.\r\nArt\r\nVery good, like  thistype of anime. the characters are pretty and vivacious, which sometimes causes you admire them,although this feeling does not last long enough to create a waifu. Landscapes are a strong point of anime, are cute, , large and there are many. and the characters interact with them causing changes\\n\\n\r\nSound\\n\\n\r\nThe strength of the anime, cute, beatiful, wonderful... Really feel like how  as if you fight your own battles. and ranges from classical to metal. simply speechless.\\n\\n\r\nCharacter\\n\\n\r\nNice and defined personalities, however, hardly evolve and no situations requiring face this until very late\\n\\n\r\nEnjoyment\\n\\n\r\nIt has a nice music and a cute art, but the story and the characters are generaly. personally, I recommende other animes if you wants a one good story.\\n\\n\r\nSo, this anime have a one unique sound, one art acceptable and a good base story, but need more situations puntuals and the characters generics makes it an anime heap",
            "date": "2015-03-30T02:38:00+00:00",
            "helpful_count": 16,
            "mal_id": 184054,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4092261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yakamin",
                "username": "Yakamin"
            },
            "url": "https://myanimelist.net/reviews.php?id=184054"
        },
        {
            "content": "This show I thought was really good in the first few episodes, and then boy was I wrong, this anime turned out excatly what I expected, everything the anime was gonna do, i already predicted it. They do it so expected that it wasn't even fine. The animation for like the last few episodes were poor, things were getting copy and pasted, the battle scenes were not exciting, and what's suppose to be a Boss is animated poorly. The characters, there are way too many, and of cource, that means that like half of the characters we barely get to know them, the anime basicallytold the story of one character good, and that's basically it, They just keep adding more and more character without going to the backstory with them. The music in this anime was repetative, there was one track that was good that's it. The story was poor also, there were many plot holes along the anime and you can't even consider there was a story at all. At least my enjoyment with this anime was ok, I came into this anime expecting this much anyways. Overall, I give World break a 6/10",
            "date": "2015-08-03T19:37:00+00:00",
            "helpful_count": 11,
            "mal_id": 195112,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4719984.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Childly",
                "username": "Childly"
            },
            "url": "https://myanimelist.net/reviews.php?id=195112"
        },
        {
            "content": "Plot Devices is something that exists in any given entertainment medium in order to move the plot forward.  Plot armor is where a given character can never be hurt or killed simply because the plot demands that he doesn't.  Like any other form of story, anime utilizes these two aspects to a certain extent in order to tell its story and move along in plot progression.  But what happens when they're...overused?  Well, I believe Seiken Tsukai no World break answers that question quite easily.\r\nStory (4.44/10): In the world of World Break, this fantasy rendition of the world has a special twistto it.  In this world, reincarnation exists, and it is here where we have Haimura Moroha, the our main protagonist enter the school that specializes in harnessing the power that people wielded in their past lives in order to fight the mysterious creatures known as metaphysicals.  \\n\\n\r\nAs far as story setup goes, World Break doesn't particularly do a well and proper explanation.  In the first couple episodes, the show attempts to explain the ideas that it wants to establish, showcasing how exactly the idea of reincarnation and how it corresponds to the weapons and abilities that these students wield.  While the explanation is subpar at best, with some things not getting a complete explanation, the first few episodes do give some insight as to how the world of World Break actually works.  But apart from this though, the story falls VERY flat, entering into the void of lazy writing and predictability.  \\n\\n\r\nLet's start with cohesion.  Throughout the runtime of World break, the series never really puts its plot points together.  With the series spanning over the course of six in-anime months, the events within that timespan aren't really told in the most fluent of manner.  The series is made in an arc-like setup, with different arcs and events that pertain to each small set of episodes which make up the entire series.  The problem with this though is just how clunky the transitions are.  Simply put, after finishing a specific event, the World Break jumps headfirst into the next arc in the next episode without word or warning, creating a very awkward transition and overall, a very distasteful experience.\\n\\n\r\nAs far as actual plot goes, every individual arc is quite separate from one another, with some of them bordering on sheer ridiculousness and the simple question of \"why is he doing this?\"  (Like seriously, bastard goes to war BY HIMSELF in one arc.  That's just...why?!)  Not that the stories are particularly bad per say, since each one does have to do with the series and contributes some progression, but I feel as though each one was done in a spur of the moment feel because of how dramatic the situation can and will change in any given arc.  \\n\\n\r\nBut overall though, I think the biggest problem with this series is the plot device known as \"reincarnation\".  Yes, the central thing of World Break is its main problem.  Throughout the whole series, our main protagonist faces problems and issues that pertain to the series, aka metaphysicals terrorizing the world, or people wanting to kill him for reasons unknown, you get the idea.  Because of how the series presents these battles, the impact of said conflict is little to none.  And this is all because of the little phrase \"I remember.\"  Just two words, everybody.  As the series explains, Moroha is someone who has two past lives (I'm not really sure what the significance of that is because I'm pretty sure every savior in the series theoretically has reincarnated a bunch of times according to the show's logic), being our overpowered main character who shares the same level of power as SAO's Kirito and Mahouka's Tatsuya.  During the course of any given battle, Moroha CAN AND WILL utter the phrase \"I remember\", as he randomly remembers something that occurred in a past life, thus giving him the ability to win a battle without any kind of repercussions.  Basically, this means that this guy's very existence has the ability to turn the tide of any battle.  I find this a very lazy way of writing a story for several reasons.\\n\r\n1.  This makes the plot extremely boring and predictable because there is no way that this guy will lose.\\n\r\n2.  None of the tension the show gives us will have any impact because we already know he's going to pull out the MC card and win.\\n\r\n3.  Conflicts become resolved extremely easily.  \\n\\n\r\nOverall, the story of World Break is one of the more lazier things I have seen to date.  While the setup of the story was decent enough to at least establish what we were watching, the rest of the story fell very flat.  With lack of story cohesion, easily resolved conflicts, plot convenience that comes WAY too easily, and above all else, an ending episode that looks nothing like the beginning two minutes of the series in a flashback, the story of this series made my blood boil more than anything else.\\n\\n\r\nOverview:\\n\r\n+/-  Somewhat decent explanation of the fantasy elements (still don't understand where they metaphysicals come from or why they exist.)\\n\r\n-  Lack of story cohesion\\n\r\n-  Way too much plot convenience\\n\r\n-  Ridiculous story arcs.  (You go to war against the biggest country in the world BY YOURSElf just because a girl was tricked into believing she had a brother?  Seriously?)\\n\\n\r\nCharacters (5.87/10): While the story by itself was poorly done, the characters of this show followed that to a certain degree.  \\n\\n\r\nUp first, we have Haimura Moroha, or as I like to call him, walking plot armor.  Following the traditional MC character traits of being nice to the girls in his harem, swearing to protect people and not let anyone get hurt, and being OP as all hell because harem/fantasy MC's area always like that.  As far as change in character, this guy changes none.  But his impact to the series is a completely different story altogether.  Because of his existence as walking plot armor, literally every issue the anime has is resolved because of him.  Because of his signature phrase \"I remember\", any technique that existed in his previous life can and will return back to him and take down whatever is before him.  A gigantic hydra terrorizing your harem?  He just remembered something and take it down.  A British knight making your life hell?  Just remember something to take him out.  A russian tyrant tricked one of your harem members?  Just go up to her, remember something, and knock her off her throne.  Because the conflicts of the series are wrapped up THIS easily, nothing in the series really has any important impact.  It is guaranteed that the situation will turn in the MC's favor, and there's simply just no enjoyment in my opinion to be had seeing someone just plow their way through like that without any drawbacks.  \\n\\n\r\nAnd then we have Ranjou Satsuki, the girl who plays off as the little sister troupe with the combination of the girl with the irritating laugh.  Being Moroha's blood-related sister in their past lives, Satsuki spends the entire series trying to prove herself to her \"older brother\" by trying to obtain strength so that she can be praised.  The only problem about this is the fact that she doesn't really have much of an impact.  Throughout the whole series, Satsuki doesn't particularly do much but be a character that you can just love to hate because of how arrogant she comes off and how little she actually does in the grand scheme of things.  \\n\\n\r\nNext, we have Shizuno Urushibara, the main girl of the series that plays off as the level-headed girl with the big chest.  As Moroha's wife from a different past life, Shizuno similar to Satsuki, she doesn't really come off as very important in the series.  While her impact to the series overall is more so than Satsuki due to the fact that she received an arc to herself, she doesn't really go beyond what we as the audience knew of her, and thus doesn't really stray from the traditional characteristics that her kind of character has.  \\n\\n\r\nSide characters for World Break are expansive and plentiful.  Apart from the loli member of the harem, Maya, the rest of the characters serve one of two purposes.  One, they are recurring characters that exist purely for the background, or two, are characters that are only important in a certain arc and don't have much reach beyond that.  The side characters have varying importance and screentime, all of them with a good deal of personality to them.  While not perfect, they do hold their own in some sense.  \\n\\n\r\nOverview:\\n\r\n+/- Decent side cast\\n\r\n-  Generic harem MC\\n\r\n-  MC is literally plot armor\\n\r\n-  Main girls are troupe characters for the most part\\n\\n\r\nArt and Sound (7.00/10 and 6.49/10): Art for World break is very colorful and bright.  While I have bashed this show on its more technical aspects, its aesthetic aspects do make up that somewhat.  Because of it more or less being standard animation for this day and age, there really isn't much to say about it.  But the action is quite fluid and nice, I'll give it that.  (Still don't understand how the way spellcasting in this series is effective.  You have to stand for three-five minutes at a time just to cast one thing.)  \\n\\n\r\nThere are however some flaws within the show's artstyle.  For one thing, the metaphysicals don't really work well with the series's standard animation at times.  Sometimes, things go into what looks like CG, and it just looks kinda awkward when it does.  It doesn't use it very often, but when it does, it can become prominent.  In addition, there is one glaring character design flaw which I feel needs to be addressed, that being concerning the character Elena.  Hair...does...not...work...like...that.  Within this character's design, her right eye is supposedly being covered up by the large bang that she has over it.  The only problem with this is the fact that the eye shows right through.  Because of this, you can see both her eyes even when one is being covered up by hair, and it just looks so weird.  It's only a minor detail, but it's very obvious and glaring when you watch it.  \\n\\n\r\nAs far as ecchi goes, World Break doesn't really capitalize on the idea all that much.  While it does showcase some ecchi elements, it doesn't really come up all that often.  That being said though, there is one specific character that creates most of the fanservice-esque scenes, and those scenes have earned a cringed look from me, and left me with a scarred memory.\\n\\n\r\nThe sound for World Break is simply split into three tracks.  The OP, the ED, and the battle music because as far as I'm concerned, these are the only three songs that this show actually has.  The OP is a song that I would regard as irritatingly catchy.  It has that tone to it that makes to me, a sound that is equivalent to nails of a chalkboard as the entire thing is sung by someone with a very high voice in addition to a beat that suddenly speeds up at times.  Personally, I hate the OP.  While it is insanely catchy, I personally don't like it.  The ED is forgettable, so there's not really much to say about that.  As for the \"battle music\", the show uses an opera style track with a mystical sounding flair to it that sounds rather pleasing.  While the rest of the soundtrack wasn't particularly stellar in my opinion, this song in particular did song very pleasing to me.\\n\\n\r\nOverview:\\n\r\n+  Decent art\\n\r\n+  One good song\\n\r\n-   Some artistic flaws\\n\\n\r\nPersonal Enjoyment (4.33/10): During the fall 2014 season, an anime by the name of \"Seirei Tsukai no Blade Dance\", a series that I saw as one that was written very poorly but somehow deserved the \"it's so bad it's good\" rating on account of people saying the show was actually good, even if I saw otherwise.  Likewise, \"Seiken Tsukai no World Break\" while sharing a similar sounding title, is one that I regard as a spiritual successor to that series.  \\n\\n\r\nDid I like this anime?\\n\\n\r\nAs far as aesthetics go, (ignoring Elena's eye), the series didn't look too bad visually.  While there were some choice moments I would like to forget, overall, the look of the series was one that I would regard as a higher point in the series, even if the designs of some of the female characters made no sense biologically.  \\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nI hate just how lazy this series felt.  Because of its reincarnation idea, the series exploited that idea by creating a very poorly written story where everything was solved simply because the MC could remember something that could help him in the situation, and giving the excuse that because he has that to back him up, that writing up something like that was ok.  You know what?  It's not.  Every time he uttered the phrase, there was a sense of rage inside me simply because of how ridiculous and how common this plot device was used.  Use it once, shame on you.  Use it twice?  Shame on me.  Use it 10-15 times?  Ok, that's just bullshit now.  \\n\\n\r\nWould I recommend this anime?\\n\\n\r\nWhile I personally didn't enjoy this anime, I wouldn't say that this show isn't enjoyable to some extent.  If you're a fan of overpowered MC's, this show is perfect, because the entire show just capitalizes on just how ridiculously overpowered this guy is.  Hell, even the best fighters from other countries, who are seasoned, adult veterans, cannot stand up to a guy who hasn't even finished high school.  If that isn't OP, I don't know what is.  But because of its lazy storytelling, troupe-filled characters, and several aesthetic flaws, this show doesn't come close to being good in my book.\\n\\n\r\nOverall Score: 5.04/10",
            "date": "2015-03-29T15:57:00+00:00",
            "helpful_count": 11,
            "mal_id": 183987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=183987"
        },
        {
            "content": "(reposted because MAL preview rules & yada yada yada)\r\nTL;DR: A slow motion train wreck of a show which you'll spend the first half saying \"I hope they do something interesting with the premise\" & the second half saying \"this wasn't what I had in mind.\" Some interesting ideas are touched on but between the bad writing & obvious low budget, there's nothing really worth watching.\r\nSometimes I forget how grateful I should be for straight up bad TV series. You know where you stand with a bad show, because you know exactly how you feel about it & can either keep watching it, knowing you're justwatching it on some ironic level or for its unintentionally comedic value; or you can just walk away from it with no regrets that it might get better or it could have been good if only they'd done x, y & z better.\\n\\n\r\nI say this because World Break is bad. It's a lazy action-romance with boring archetypical characters, dull fights, cliché harem hijinks & everything else that makes you ask yourself wtf Japan sees in these regurgitated fantasy-action-romance stories that they keep adapting them again & again each season. This Winter season alone we had World Break, ISUCA, Absolute Duo & Unlimited Fafnir (& those are just the ones I watched), each so similar to the other that I still have to remind myself which one I'm watching at times.\\n\\n\r\nWhat is it that keeps the production line that these series come off running? Well I think the answer lies in that all of these shows can be summed up as “generic fantasy-action-romance but...” & that but is, frustratingly, enough that you keep watching in the vein hope that it will be used to good effect at some point during the series. It never does, of course, but you don't know that until the last episode, by which point it's too late to bail out.\\n\\n\r\nWorld breaks tale takes place in Japan. For reasons unexplained, the world is under constant threat of attack by monsters called metaphysicals from...somewhere. Fortunately, there are people in this world who have the souls of past heroes inside them, allowing them to tap into the collective memories of past lives to generate magic weapons with which to fight. There are two types of magic user in this world, although the distinction really doesn't mean anything consequential except to emphasise that our hero, Moroha Haimura, is a special snowflake for having the souls of two heroes within him & therefore the power to use both.\\n\\n\r\nHere's the first part of World Break that frustrates me. The idea of people drawing power from the souls of dead heroes isn't new, but it is one that can be interesting. Unfortunately, all World Break really uses it for is to explain away why our hero quickly finds himself with the two main girls, pink haired, ditsy hothead Satsuki Ranjou & purple (or mauve? Vermilion, maybe?) haired, cool, aloof Shizuno Urushibara clinging to him like limpets. You know the drill with these two: they both feud with each other over the MCs attention while never really making any real effort to actually go anywhere relationship wise because then there wouldn't be a “plot.”\\n\\n\r\nThere are several flashbacks detailing how each of them were connected in past lives, which again could have been an interesting way to explore why they feel they have to be with each other in the present, but, while World Break does this to a superficial degree, mostly they just serves as the authors way to write stories that belong more on fanfic.net than here. Which do you prefer: the gallant knight saving the princess/sister?; or the emo warlock saving the poor slave girl? Your answer will decide who you're shipping. Really, it all just serves to contrive awkward misunderstandings & reasons for the MC to find his face buried in one of their chests.\\n\\n\r\nBeyond our trio, we have a schools worth of characters for us not to care about. Because of the power of friendship & stuff, all three of them rise up the ranks of the magic people school they attend to join the team who have to defend their region from monster attacks. Again, being part of a kind of super sentai strike team could have been cool, but all said squad does half the time is molest each others ridiculously oversized breasts for comic effect. The Vice Captain in particular is a literal ball breaker who seems determined to pop any round objects she can grasp, be they male or female appendages. It's all oh so funny & all so pointless, cheap titillation masquerading as banter to show the group getting along.\\n\\n\r\nThis would be a good time to mention World Breaks main gimmick in its action scenes. You see to cast spells, mages don't simply say an enchantment, they write it. It's a gimmick, yes but it is one that could have been interesting, I feel. Ultimately, though, it's just boring as the caster simply stands their wiggling their finger in the air for anything up to a minute. As a concept I like that casting spells requires more poetic language than simply blurting out some vaguely European sounding words before striking with the engrish (although that's there too), like it so often does in anime. Sadly, its one of those things that probably works fine when you're reading but it doesn't adapt well to animation.\\n\\n\r\nOn the subject of action, the fights in World Break are a mixed bunch. There are a couple fights that are well enough animated & directed. But on the flip side, particularly as the series goes on the quality drops almost precipitously. There's a big group battle against a giant turtle crab monster thing, for example, that was meant to serve both as the first big test of the schools strike team & also show the MC prove his superior power to the world elite Rank-S group. Unfortunately, it's so full of shoddy animation & art that you can hear the moths fluttering in the space where the shows budget was supposed to be.\\n\\n\r\nIn fact animation & art issues plague World Break. Diomedia, the studio behind this series, have four shows airing concurrently this winter, & you can see that World Break drew the short straw at the budget & resources meeting. It's a shame, because some of the music playing behind it all is pretty good. There's an aria that is sung during the climactic parts of fights that I really like the melody of & does a good job of matching the emotion of the scene. Unfortunately, that's not nearly enough to compensate for the other shortcomings of this shows production.\\n\\n\r\nAs the story of World Break unfolded, I became more frustrated with where the author/writer have chosen to take things. The past lives idea, once it's been used to establish why the main trio are together, only really comes up when Moreha needs to pull a spell out of his arse to win a fight. In fact, \"I remember now\" is probably his most repeated phrase. None of the other characters seem to have such a relationship with each other, despite the almost predetermined nature of the main three. The idea of false memories is brought in the story of Russian student Elena Arshavina, but it's never explored; which is a shame because it could have had interesting implications for the whole past lives thing World Break has going on.\\n\\n\r\nThe metaphysicals are also really just there as a convenient device for whenever the show needs something to happen. Despite their apparent ever present threat to the world, no one seems that interested in actually doing something about them. Indeed, Moreha manages to find time between them & his harem duties to wage a one man war against Russia, which is as stupid as it sounds & is one of the most absurd examples of a selflessly heroic gesture for a pretty girl that anime romance require their male main characters to do. Ultimately, everything potentially interesting in World Break is just window dressing for a plot that goes through the tired old motions of having a teenage boy find friends, struggle through adversity & ultimately learn that working together to reach your goals is better than trying to do everything alone (except when it isn't).\\n\\n\r\nTo reiterate, World Break is bad. It's the kind of show that makes you understand why people see “light novel adaptation” on AniChart & say “nope!” without even watching the first episode. It's a lazy, by the numbers fantasy romance that like so many before it comes, goes, & is forgotten before the end credits have finished rolling. It's the type of story makes you wish it was worse, simply so you could just ignore it entirely rather than getting hung up, as I have, on the little parts of it that could have made for such a better show; if only they had been given prominence instead of just being there to try & mask that this the same tired tale that's been told a thousand times before & usually several times each season.",
            "date": "2015-04-03T05:12:00+00:00",
            "helpful_count": 11,
            "mal_id": 184584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4095221.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Lancehot",
                "username": "Lancehot"
            },
            "url": "https://myanimelist.net/reviews.php?id=184584"
        },
        {
            "content": "Seiken Tsukai no World Break appears to be like any other typical ecchi and harem anime with a bit of action mixed in, but any experienced anime watcher would notice that it's very poorly made. If one thing killed this anime, I'd have to say it was the animation.\r\nStory: 6\r\nI'm sure the light novel had a story of some sort, otherwise it wouldn't sell, and probably wouldn't be adapted into an anime either. The premise is pretty interesting, as I've heard many say, but they don't really do anything with it. The story here seems to be secondary to the characters acting out their (mostlycliche and predictable) personalities. Most episodes don't touch the plot, and the writing and dialogue do little explaining, making the plot feel plain and incomplete.\\n\\n\r\nArt and Animation: 5\\n\r\nNow, there's nothing particularly wrong with the art itself, which is pretty standard for anime right now. The animation, however, is incredibly shoddy, and immediately and continuously noticeable throughout the entire anime. I don't know if the studio was lazy or just didn't care, but for most scenes, just the minimum amount of animation necessary was done. Just how little movement there is in every scene is painfully obvious; you'll generally see just thing happening at a time: one person's mouth moving (no gestures, ever, just mouths moving), one person walking, or just 3 or 4 frames being repeated, if not just one still frame, etc. I could go on and on about it, but suffice to say, it's truly terrible for any anime  that even pretends to have action scenes (the amount of animation would be equivalent to one of those Gintama episodes where they sit around a kotatsu, or a wordplay based gag anime).\\n\\n\r\nSound: 7\\n\r\nNothing special; it did is job. Voice acting was fine, soundtrack was average;  I didn't see (or hear) any problems.\\n\\n\r\nCharacter: 6\\n\r\nVery flat, not fleshed out. Most are given very little characterization, and are  mostly given just a few traits or behaviors that are used to define them. Less so for main characters, but not by much.\\n\\n\r\nOverall: 5\\n\r\nMost bad animes are bad primarily because of plot or premise, but this one is just.... bad. Even if you're looking for fanservice, pretty much any other anime is probably better.",
            "date": "2015-05-07T04:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 187284,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229672.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MortalMelancholy",
                "username": "MortalMelancholy"
            },
            "url": "https://myanimelist.net/reviews.php?id=187284"
        },
        {
            "content": "I don't recommend this anime,because it has nothing to offer.\r\n STORY(3/10): This anime has no consistent plot and has many plot holes.Plot was all over the place.Sometimes was one thing and sometimes another.And after 3 or 4 episodes it got uninteresting.\r\n  CHARACTERS(3/10): Characters ware bland and not interesting.And one-sided,one was loud,one was shy,one was strong etc.Main Character had no flaws and the viewers can not relate to him at all. There is no sense of struggle and  therefore gets really boring.\r\n ART(8/10)I really liked characters design,it looked nice and pretty and i also liked backgrund art but  fight senses ware bad,just HORIBBLE.infact so it was unwatchable.\\n\r\nENJOYMENT(4/10):Why? because its really boring,but if you like Harem and don't care about the story, i think you will enjoy it.\\n\\n\\n\r\np.s. i really liked the music.",
            "date": "2017-01-13T10:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 238205,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5339548.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dazy",
                "username": "Dazy"
            },
            "url": "https://myanimelist.net/reviews.php?id=238205"
        },
        {
            "content": "I was bored on a weekend away from home and had this anime on my \"someday\" list, so I decided to give it a try without great expectations. And I was wrong.\r\nI've seen some (won't say a lot) of a nime, and a great part of them were highschool harem, so when I saw the cover I decided to just sit and get over with it. But this one in particular is great, I don't rememeber many series that make me lose sense of time and this one did it.\r\nStory: 9/10\r\nReincarnation, past lives are interesting topics and it's easy to ruin them, but for mysurprise it wasn't the case with World Break. They were nicely used and the story as a whole actually makes sense, it's entertaining  It is deep enough to make you keep watching without taking away your social life. Story itself won't get a 10 from me because past lives aren't properly developed (and they seem pretty awesome) leaving a bit of a plot hole there.\\n\\n\r\nArt: 8/10\\n\\n\r\nNice drawing, beautiful magic and the best freaking dragon I've seen in years. That alone got me. The battles are great, you can actually keep track of them, the magic is bright, the color palette is also interesting.\\n\r\nAs a bonus point: Rusia was really nicely drawn.\\n\\n\r\nSound: 8/10\\n\\n\r\nThe ending is way better than the opening, but what really got me was the BGM, really tocuhing despise being the same track almost everytime. The characters had some personalities on their voices and that improved their very characters.\\n\\n\r\nCharacter: 7/10\\n\\n\r\nNot the best point. The MC has a standard high school harem personality, and the harem members didn't bring anything new to the world. There's so little character improvement or growing, but maybe that's because of the 12 episode lenght. \\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nPretty awesome as I said, it's agile, easy to watch and follow. I was tempted to rate it as a solid 10, but the fanservice was too much and unnecesary. You can't waste two whole episodes of a 12 episode series on beaches and saunas. But without the fanservice, or ignoring it, the anime is very enjoyable.\\n\\n\r\nOverall: 9/10\\n\\n\r\nFor me, and you know, that's a very subjective opinion, this one is a solid 9. An interesting story, the best dragon in a long time, great magic and battle scenes. Too much fan service costed it a whole point, but maybe if there were made 24 episodes instead of 12 it would have been better.",
            "date": "2015-12-19T14:26:00+00:00",
            "helpful_count": 7,
            "mal_id": 206031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4881879.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Vehemor",
                "username": "Vehemor"
            },
            "url": "https://myanimelist.net/reviews.php?id=206031"
        },
        {
            "content": "The characters remember who their were in their past lifes, and battle monsters with the magic of their old selfs, thats a pretty good idea but it wasn't that good as it could have been.\r\nStory\r\nThe idea was pretty good but the implementation was awefull, the characters weren't good either. \r\nThere was no depth in them, not much backstory. They seemed \"dead\" for me, cuz they didn't behave as they should have. They seemed to be idiots in some scenes.\r\nWhen they fought the behemoth, the MC and another character destroyed the legs  of it, with ease. Then the behemoth spawns parasites and they get destroyed.They behaved really odd, dunno how to explain this, but it could have done better.\\n\\n\r\nArt\\n\r\nThe art was not good too.\\n\r\nThere were many flaws in the scenes, when they fought the first fortress class monster, as example.\\n\\n\r\nSound\\n\r\nWasn't good either.\\n\r\nThe music was almost the same everytime.\\n\\n\r\nSo what do I think overall of the anime?\\n\r\nThe story idea was great, the implementation was bad, the art could have been better and the designs for the monsters too.\\n\r\nSame for the sound and music, they used the same music multiple times and I would have liked some better sounds for attacks and other stuff.\\n\r\nThe characters didn't have depth, they seemed to be puppets, they weren't even interesting. They behaved odd in some situatens and fought against monster the false way everytime, it was more like some mishup.\\n\r\nBut still the anime was enyojable.\\n\\n\r\nWell, I don't know how to explain the characters propably, they just behaved like retards. Sorry to say this, but it's true.\\n\\n\r\nWell that was my first review, I don't really know how to describe this anime, but I think, it could have been done a lot better.",
            "date": "2018-09-01T10:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 287900,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6540040.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/xOngKox",
                "username": "xOngKox"
            },
            "url": "https://myanimelist.net/reviews.php?id=287900"
        },
        {
            "content": "Just another male protagonist hitting it off with every other girl he comes across.  At this point, most of us probably know quite well what to expect from anime of the \"ecchi\" and \"harem\" genre.  A mediocre story at best, the oversized flapping breasts (or not), attacks that seemingly only strip girls, the facepalm dialogue, and the recycled female archetypes among others.  To which, the selling point of this sort of anime becomes its quality art that one can usually expect.  Which in actuality was anything but.  \r\nThe premise of the story was actually not all that appalling.  Everyoneseems to live forever through a perpetual cycle of reincarnation, monsters that seemingly appear out of nowhere just to harass the protagonists, inconsistent plot/characters, and the ever-so-appealing-power-up catchphrase \"I Remember Now.\"  Okay maybe not, but with a little more direction the plot could have easily been good.  Probably.\\n\\n\r\nThe art was far from onpoint.  The appearance of monsters resembled that of cardboard cut-outs, there was no fluidity in movement, battle scenes were choppy, over usage of still frames, the whole thing just felt clunky.  The only somewhat detailed scenes were fanservice segments, but hey that is supposedly a norm by this point right?\\n\\n\r\nThe BGM in this series seems to have had one goal in mind.  Make already annoying and shrill voiced characters ... sound even more annoying.  OP and ED were normal.  As normal as could be as far as \"harem\" and \"ecchi\" series go anyways.    \\n\\n\r\nCharacter development was.... well, let's just stop there.\\n\\n\r\nIf you can get past the inconsistent plot, art, and characters, then feel free to give this series a go.  If you can't, you should probably move on to the next anime lest you pull all your hair out and go-for-bald.  I for one managed to plow through this series unscathed, but that may be that I'm simply overly callous from repetition.  \\n\\n\\n",
            "date": "2016-09-10T00:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 228678,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/299491.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MondayBlues",
                "username": "MondayBlues"
            },
            "url": "https://myanimelist.net/reviews.php?id=228678"
        },
        {
            "content": "Welcome to my review of Seiken Tsukai no World Break. At the time of writing this review, I have completed watching the series. Although it might be a little late considering the Anime finished airing on March 30 2015, do take a look and give me some pointers as to where I should or could improve on in my review so I can write better ones in the future.\r\nI'll put this section here early in case you guys miss it. Do visit my blog section on my profile after reading my review for an Afterthoughts pertaining to this particular Anime for some healthy discussion. Thanks!\r\nHeregoes:\\n\\n\r\n1) Story (3/10) \\n\\n\r\n- Here's why I feel that the Story portion is poor. The development to the series is way too imbalanced. While I feel that the \"memories of past lives\" concept is an interesting notion and makes for great development potential (which is why I gave it points in the first place) , it did not happen throughout the series. The reason why I say this is because if you have memories of your past lives, then your abilities in this life has already been decided from the get-go. In other words, they're limited. At the time of reading this review, if you guys have watched the Anime, then you should be able to tell a noticeable power gap between the MC and almost everyone else. \\n\\n\r\n2) Art (5/10)\\n\\n\r\n- Here's why I feel that the Art portion is fair. The art is actually pretty decent. The MC has a silver highlight in the middle-front portion of his hair, which makes him stand out from the other characters (duh, because he's the MC). Even though he has a feature that distinguishes him from the other characters, it is not too much to the point where he looks totally different. He actually blends in well with the others. The art of the Metaphysicals are average at best. While I an understand that making them look incredibly huge will instill the notion that they're hard-to-beat bosses that are supposed to be taken down by multiple people, it doesn't really matter when all you have to do is remember a fraction of your past live, right? The story doesn't do the art justice, which is why it only gets a passable score.\\n\\n\r\n3) Sound (7/10)\\n\\n\r\n- Here's why I feel that the Sound portion is good. There's actually not much to comment about this part, if you've heard the OST, you'll find that it's quite pleasant and fits into the Anime well. It gives the Anime itself a good start.\\n\\n\r\nIn case you're wondering, the OST's name is Dragon Heart. No, do your own research. I ain't gonna help any more than telling the name.\\n\\n\r\n4) Character (2/10)\\n\\n\r\n- Here's why I feel that the Character portion is dreadful. Character development  for the MC is way too fast. A few starting episodes in and he's already an unstoppable beast and a Metaphysical-killing machine. Got himself into a rough patch? No problem, \"I remember!\" ( or\"Omoidashita!\" for those who remember). In comparison, all other characters(and I really mean every single other featured character) pale A LOT in comparison. This is proven by the MC needing to appear at every last moment and remembering some powerful moves to finish the enemy. The difference between the MC and the other characters are too great to even be considered having a higher score.\\n\\n\r\n5) Enjoyment (2/10)\\n\\n\r\n- Here's why I feel that the Enjoyment portion is dreadful. As mentioned in the Character section above, character development is way too imbalanced. This means that about halfway through the series (or even earlier), you'd be used to the MC landing hard-hitting wide area attacks that will defeat the enemy easily. Sure you might enjoy the opening moments of the Anime watching the characters develop, which is little to none, but after that comes boredom. There's literally nothing else to watch other than, you know, hard-hitting moves that will save the day.\\n\\n\r\n6) Overall (3/10)\\n\\n\r\n- Overall, the Anime is not a very one to watch. The progression feels forced and the pacing is pretty bad as well. You could watch it if you're just looking to kill some time or if you really like Harem Anime. I wouldn't recommend it.",
            "date": "2015-04-21T15:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 186177,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3339977.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AndyFaunus",
                "username": "AndyFaunus"
            },
            "url": "https://myanimelist.net/reviews.php?id=186177"
        },
        {
            "content": "Personally, I believe that this is great anime. If it had had 24 episodes long the plot, the development of characters, feelings between the characters and the history behind the main characters like Moroha which wasn't given enough detail would all have been developed to produce a triumphant anime. However, this is really just nitpicking. In the basic of premise of things, World Break brought something quite new and interesting to the industry. It's an anime that doesn't just follow the typical route in which harems proceed. Here's some detail,\r\nStory 9/10:\r\nThe story for World Break is one I enjoy considerably. In this anime world, themain antaganists are called 'Metaphysicals' which just go round doing the usual bad stuff (stepping on flowers and the like) and the ones who defend the countries of the world from them are called saviours. To put it bluntly, there are two types of saviours. One who uses magic that's good (light in a sense) and the other uses bad (dark in a sense) magic. The saviours use abilities that they can learn from their past lives as heroes, mages and the like and put into practice. Although, saviours only have one past life which they can take good or bad abilities from depending on what they were. The story centres around a guy called Moroha who is the the first person to have two past lives which luckily have good abilites in one and bad abilities in the other. Moroha starts his first day at an academy for newly-training saviours and then the story follows him as he encounters new enemies, creates new bonds with others and grows ever stronger. \\n\\n\r\nThis story is extremely intriguing to say the least and gives us an insight into World Break. This is one of the best harem anime I've ever seen, contesting with the likes of Highschool DXD (you know, the anime with the boobs). However, because the anime is short in length, it lacks the full development the story deserves which, in that respect, is similar to DXD. At some points you can clearly see that the writers have to rush the storyline in order to finish the last arc of the series. However, the story is amazing enough that you can look past it which is also similar to DXD even though it follows a totally different premise.\\n\\n\r\nArt: 7/10\\n\\n\r\nI gotta say, the art is average at best for something made in 2015. There are many rough parts in the anime which could use some smoothing over. But, the art isn't too bad that you wouldn't be able to watch it. It all depends on your tolerance and taste. For example, I won't touch Higashi no Eden because I don't like the art.\\n\\n\r\nSound: 8/10\\n\\n\r\nThe anime soundtrack wise isn't something I'd download to my phone like Btooom!'s opening or Noragami's (You know that's the good stuff). However, the sounds used inside the anime were fantastic. I love the music when an emotional part of the anime comes into view. I would say that it's slightly below SAO (Sword Arts Online) in terms of sound quality.\\n\\n\r\nCharacter: 8/10\\n\\n\r\nThe thing I love about this harem anime is the fact that Morota isn't a giant wet blanket and has a hardened mental state behind him. It is so refreshing to see some guy with giant balls join the small, \"powerful main leads in harem anime\" club and be a candidate for harem king 2015. Apart from Morota, the cast seems rather generic though. Excitable imouto (Japenese for 'little sister'), a cold girl with questionable views and everyone else is practically a supporting cast. But seriously who gives a damn when you've got a badass in a harem anime, stuff like that only happens on Christmas!\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nI loved it to be honest. I laughed, I cried, I woke my parents up, I got bitchslapped (The life of a kid entering college). It was a great anime for me, I got the same emotions from it as I did with memorable anime like Demon King Daimao and Trinity Seven. That may seem a little biased but it's the truth, promise. Pretty much everything just felt right in the anime and I just liked it for sticking to its ground rather then trailing off into oblivion (*Cough* Mahou Sensou *Cough*).\\n\\n\r\nOverall 9/10\\n\\n\r\nI was really impressed with this anime. I have to congratulate the developers for bringing a new flavour to the Harem genre, not literally of course. Although it's art was average, the premise, the fanservice, the action and everything was pretty great. I only wish it could have been longer but beggars can't be choosers. All in all, a great anime and I would reccomend the hell out of it. This is my first review so be sure to give me some opinions of my work by messaging me or whatever. With this Senpai may finally notice me;) How cheeky. \\n\\n\r\nHope you enjoyed my review :)",
            "date": "2015-07-01T01:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 191886,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4696580.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MattTheLad",
                "username": "MattTheLad"
            },
            "url": "https://myanimelist.net/reviews.php?id=191886"
        },
        {
            "content": "Hello all! I am new to the anime reviewing front, but I am going to try to do my best at reviewing this anime. I started out just thinking this would be another basic harem anime with the same characteristics in the characters, the same plot, the same school setting, and the same old ending. This anime was actually quite different, the plot was extremely different from any other harem I've seen and was very enjoyable, although, somewhat predictable. The introduction to the 2 types of people: saviors and kuromas, was a very cool concept in my opinion. \r\nNow I'll get down to the actualreview.\\n\\n\r\nStory: I found the story to this anime very good. It included a lot of aspects quite a few animes neglect to add, such as flashbacks and others. Not only was the story good, but it has the watcher wanting to come back for more and more. The ending was the icing on the cake, a perfect finale, finishing the anime perfectly. My rating for story: 10/10\\n\\n\r\nArt: I found the art of this anime exceedingly good for such a small-time anime studio such as Diomedea ,check them out, they have much other good anime, and the fight scenes for this anime was excellent. The camera angles and character art could have been better at times, but was all around good. I give it a 8.5/10 (I'll give it a 9 for the benefit of the doubt)\\n\\n\r\nSound: The OST for this anime was very decent, I am not going to say I liked any of the songs other than the intro. 7/10 not bad, but could be improved, especially fight scene music.\\n\\n\r\nCharacter: The main protagonist in the anime is a very well made character, and I loved seeing him in the anime and how he reacted to certain things. BUT one of the other main characters, I found absolutely annoying and certainly taking away from the anime. 6/10 they could have definitely added some spice to the other characters.\\n\\n\r\nEnjoyment: I enjoyed this anime, thoroughly.  After what seemed like every episode, it would leave you with the feeling of wanting to see more. I will definitely re-watch this anime in the future. 9/10 very good\\n\\n\r\nOverall: With everything I've just said in consideration, I rank this anime with an overall score of 9, I was going to give it 8, but the whole point of anime is to enjoy it, and I certainly enjoyed this one. I think if a few things were improved this could be an iconic anime everyone needs to see.",
            "date": "2016-01-06T19:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 207936,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4953540.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Puritenda",
                "username": "Puritenda"
            },
            "url": "https://myanimelist.net/reviews.php?id=207936"
        },
        {
            "content": "\"It's amazing how much destruction one person can cause\".\r\nStory 7.5/10\r\nI actually love the story. It has its own greatness. The plot revolves around Haimura Moroha a young boy who inherited 2 past lives and goes to private high school with the concept of \"saviors.\" Saviors are known as people who possess awakened memories of their past lives. There are two types of saviors: one who fight using weapon and one who fight using magic. Normally, every person only has one past life. But in the case of Haimura is completely different. One of his past lives is known as Kensei Flaga, the strongest knight thatever lived with his divine sword \"Salatiga\". On the opposite, his other life is as Shu Saura, the most powerful Dark arts user. Different than Kensei Flaga who uses his power to protect the country by fighting off nations by himself. As Shu Saura was described to be incredibly powerful, of having razed many nations, resulting in the deaths of many, which gave him the title King of the Netherworld. But even the strongest always have a weakness. Nightmares befall to the two of them before it can reach a happy ending. They couldn't save the girl their love the most. Now, with 2 past lives, Can Homura prevent the story from repeating itself? Can he protect his friend this time? With those 2 past lives powers he had obtained, can he change his future? \\n\\n\r\nArt 5/10\\n\r\nThe only one weakness in the anime is the art. But it's not really the worst. Still acceptable though. Just don't expect too much. For me, I still find it quite good and not really bother me that much though. Well maybe you want to see it for yourself to judge the anime art.\\n\\n\r\nSound 7/10\\n\r\nSound really play important part in this series. I found that the Op is great and when the right time comes, you will found the sound for this anime is marvelous and simply fantastic.\\n\\n\r\nCharacter 8/10\\n\r\nOne of the keys to the success. Producer is sure genius to make such a great character's development. It teaches me to think outside the box. Each character has place in both the serious and the silly contexts of the story and humor and plot are blended well throughout the episodes. You need to see this for yourself. I'm quite sure you will be enticed by all the characters. \\n\\n\r\nEnjoyment and Overall 7/10\\n\r\nThis anime is fantastic. The concept that has been brought to the anime is great. No wonder I will rewatch this anime back though. The main storyline put me in uneasiness as the story goes on but I miscalculate it. It just great but not flawless. But, the anime also lack some aspect with made it's not really masterpiece but nearly to it. I kind of enjoy the story overall. Not waste of time to give it a shot. I prefer to give the series as a fine piece. For some reasons, I can't. Because I'm expecting more from the series. I actually kind of hard to give a good mark unless there are some few point in the series that I see deems the worth. This series never enough for it to approach average, but certainly enough to keep it from being one of the all time greats. This is what makes this a potentially polarizing experience. The series still highly entertaining experience for fans of fantasy and action for this season. Still, I recommend this. I'd recommend it any day, for anyone who wants to watch Op main lead, good story and interesting characters to be explored.",
            "date": "2015-09-12T22:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 198452,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4465109.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/End",
                "username": "End"
            },
            "url": "https://myanimelist.net/reviews.php?id=198452"
        },
        {
            "content": "ill first say that alot of people will be surprised with what i give this anime but honestly i hella liked this anime\r\nStory: so this story is about Moroha who goes too this school not even like a couple of minutes in we meet Satsuki and Shizuno who Moroha knew in a former life he knew Satsuki as this knight who went on many journeys well him in that and she was the younger sister and he knew Shizuno he saved her from slavery and they ended up married as in his former life he was a ruler or a bad guy you could saybut the story is about this life where he is pretty much a nice and awesome guy (not spoil anything else)\\n\\n\r\nArt: art was very good nothing too really complain about\\n\\n\r\nSound: Again same as art the OP and ED weren't that great but did end up liking the OP later on \\n\\n\r\nCharacter: now with this ill only be going into the male lead and the 3 girls Satsuki, Shizuno and Elena. Now with Moroha he had 2 former lives one with Satsuki where he was a knight and her big bother and also with Shizuno where they were married and ruling now i liked this guy for many reason most being the stuff that would happen with him and the girls just also the action with him was good too. Satsuki is your typical hyper and energetic girl in a anime she would always cling to the Moroha in the most nice ways she never bother me at all. Shizuno is this nice but also cold person she really doesn't open up about what happen until later in the anime but she is a good character. Elena is a russian girl who doesn't show until midway through the anime Moroah helped her as she thought she always had a bother but didn't so when Moroah helped she (of course) went right for his love she is a decent character\\n\\n\r\nEnjoyment: i personally hella enjoyed this anime from the action that was amazing to some of the side characters too Moroah getting into situations with the other three girls\\n\\n\r\nOverall: im giving this a 9 yes im giving it that rating my review should honestly reflect that even though that sure its a typical anime and so are the characters and the harem but hi i freaking enjoyed this the comedy was very good so was the action also there is ecchi so be aware but man the comedy was gold",
            "date": "2016-11-08T22:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 233462,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=233462"
        }
    ],
    [
        {
            "content": "As a veteran harem watcher, this anime isn't entirely original in its character personalities, however it made up for it with the story it has.\r\nStory: 9\r\nThe story itself is a good one, there are people who have memories of previous lives that they  had and have special weapons and spells from it. The world is constantly under attack by monsters whom are fought by the said special users. That's more or less the background story, with the show centered around the main male character who turns out to be one of the strongest with a harem of girls (more detailed in characters)\r\nArt: 7\r\nThe artwas kind of average, it wasn't the worst but it wasn't the best either. There were some, not many, but a few instances in which it could have been better.\\n\r\nSound: 7\\n\r\nThe sound was average like the art, it was fine but definitely could have been better.\\n\r\nCharacter: 6\\n\r\nHere's the list of rhe basic main characters:\\n\r\nThe kind, strong main male lead.\\n\r\nThe hyperactive girl who loves the lead, despite being a sister in a previous life.\\n\r\nThe quiet, mean emo girl who, like the previous girl, loves the lead as having known him previously in another life\\n\r\nThe pretty russian beauty who comes in midway in the season.\\n\r\nAnd a whole lot of other side characters.\\n\r\nEnjoyment: 8\\n\r\nI give it a 8 for it, despite a lot of cliche characters, had a decent story behind it, however it would have been higher if they didn't try to cram another 12 episodes worth in the last 5-6 episodes.\\n\r\nOverall: 8\\n\r\nIt was a fine anime that I enjoyed throughout the weeks that it aired, however near the end even I could see how much potential story the writers tried to cram in the last few episodes. In my eyes, this could have easily been a 10 for me but due to the lack of budget and patience the writers had, this anime didn't get the 24 episodes that it deserved.",
            "date": "2015-03-29T16:22:00+00:00",
            "helpful_count": 140,
            "mal_id": 183992,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3066335.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Somebody101",
                "username": "Somebody101"
            },
            "url": "https://myanimelist.net/reviews.php?id=183992"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nPoetry is an interesting form of writing when you take a step back and appreciate what it does. It can be a beautiful piece about a long lost lover or a depressing description of the death of a family member. It can be anything it wants to be because it’s, well, poetry. Some do it for fun while others do it as a hobby. Others still base their entire careers on crafting words together in intricate ways – most music is composed of lyrics that are themselves poetry. But what if it was instead used forsomething a bit more avant-garde? Maybe, instead of just fighting with swords and spells, people fought with words, too? Seiken Tsukai no World Break does exactly this, and it is as ridiculous as it sounds.\\n\\n\\n\r\nSTORY\\n\\n\r\nWorld Break follows young Moroha Haimura who finds himself attending Akane Academy. There, he meets two girls from his “past lives,” Shizuno Urushibara the ice mage and Satsuki Ranjou the dependent sister. Together, they fight as Saviors, defeating evil one line of prose at a time.\\n\\n\r\nWhether or not it can be deemed a “feat” is questionable, but World Break does something that most anime wouldn’t have the guts to do: have their entire narrative’s foundation based on a plot contrivance. Feat or no, this is atrocious. This isn’t just a hole in the tale in the sense that they forgot to mention some important detail or they outright refuse to give it relevancy. No, what the anime does is give Moroha the capability to simply “remember.” He literally, while fighting a giant hydra or a mutated behemoth, just happens to have a recollection concerning with some part of his past, providing him with newfound knowledge in order to defeat whatever monster he happens to be fighting. This goes beyond being over-powered; main characters that are similar in strength at least have some background in regards to where their skills come from. But here, every battle involves the same unfair, random power-up at just the right moment to swing the battle in favor of Moroha and the good guys.\\n\\n\r\nYet it’s not only this broken crutch that the anime leans on. Many of the other aspects of the show don’t work because they’re unfounded or unbelievable. The aforementioned poetry is one such issue; besides being a completely silly premise, it’s nonsensical to have to write poetry in the middle of a fight in order to use one’s own abilities. Another example is the “Big Six,” a league of Saviors who are the heads of their respective countries. They seem to hold large influence, but either don’t do anything despite their positions, are uncharacteristically evil, or even become incapacitated for no other reason than to add on to the list of ever-growing coincidences. The “Transportal” being usable once a day, everyone besides Moroha being useless at what they do, Urushibara’s and Satsuki’s miraculous, deus ex machina recovery near the end of the series; there are countless instances that continually make the anime more incoherent than the last.\\n\\n\r\nThis all sounds like rather niche entertainment, the kind of “so bad, it’s good” media that at least provides some semblance of direction. But that’s not the case; in fact, World Break is essentially mindless in what it sets out to do. There are no themes, there is no focus, there doesn’t even exist a solitary arc that means anything to anyone. This is because our main lead is already destined for greatness, no matter where life takes him. Meaning, not only do we see that he is over-powered but it’s already predetermined that he will be. The idea that past lives have similarities across each other works against the anime, and not just there; it can be seen with Urushibara and Satsuki ending up with him. Even when there are obstacles preventing them from being with him, we “know” that they will eventually be together, and we know they will be by his side because the show’s premise dictates it being so. The finale also doesn’t have any merits. The notion that camaraderie and togetherness can change fate not only goes against everything it’s always been stating otherwise but it’s the only instance where anyone besides Moroha actually does anything, giving us no precedent for such a development. All together it’s a bunch of pointless plot points that contain zero value whatsoever.\\n\\n\r\nANIMATION\\n\\n\r\nWhile the quality of the art for World Break is usually low – there are serious camera issues, lighting is an afterthought, and the choreography of the action is pretty poor – it does at least give itself the chance to showcase a wide range of abilities. Various, large scale attacks such as the beasts made of thunder and lightning, the diverse kinds of magic used by the students, and the other weapons that are wielded provide the show with the opportunity to break up the monotony when it comes to not only the story it “tells” but also with the boring locales that are chosen. That last point mainly stems from where the battles take place; most of the time, they are forced to be airborne, causing the backdrops to always become cloud-filled skies. Worse still, and even though the anime is given the chance to demonstrate different skillsets, it always has to fall back on its poetry. Meaning the foreground is often littered with words and writing, which gets in the way of everything else.\\n\\n\r\nThe character designs tend to be hit or miss. Urushibara’s long purple hair, green eyes, and nice figure define her as the cool beauty that she is. Satsuki, likewise, has her spunky personality showcased through her fun, pink hair, yellow ribbon, and constant smiling. And Elena’s medium-length white hair and gray eyes mirror her emotionless and mysterious demeanor. The flip side contains Moroha with his single strand of silver hair to make him somehow unique, Mari’s (the principal of the academy) witch attire, and Sofia only being known for her enormous bust.\\n\\n\r\nActual animation suffers greatly for nearly the entire series. Sword swinging is often simple swipes, running is jerky and off-putting, and even when characters are sitting or talking with one another, there is hardly any movement to be had. The only portion of the show that sees increased attention is, once again, the word writing: the hand and finger motions are given nice detail since they are what take center stage at nearly all points in the show. But waving one’s hands around here and there doesn’t add up, leaving the animation in a less-than-stellar department.\\n\\n\r\nCHARACTERS\\n\\n\r\nWhat’s astounding about some of World Break’s characters is that, despite the large focus on the past, there is very little learned about any of them. And not just in the sense that their past lives are filled with nothing, for that is partially true, too. Satsuki’s only claim to fame is being Moroha’s past sister. That’s it. She isn’t strong, she isn’t fast, and she isn’t even friendly. Her personality is as one-dimensional as it comes, with her being extremely clingy and defensive of anyone getting close to her loving brother. Moroha doesn’t fare much better, either. They make passing references to his relatives’ deaths at some point in his life, as a means to demonstrate that he is “unable” to protect the ones he loves. But outside of one, one-second clip, they’re importance is insignificant. His past lives are also filled with improper explanations concerning who he is as a person; all that is shown for the longest time is that he is a really strong guy. In a way, his obtuse lack of characterization defines him as someone without a past, as a boy whose only prevalent feature being the remembering he does on a semi-frequent basis. And looking at nearly anyone else besides these two shows a glaring issue: nobody is given their past. Again, when a core facet of the anime isn’t even applied to the majority of the cast, it only serves to weaken its overall value.\\n\\n\r\n“Nearly anyone” was used because, as the phrase implies, not everyone is averse to such a problem. More specifically, Elena and Urushibara do manage to use the show’s focal point to their advantage. Elena is a woman who originally worked for the Russian branch of Saviors as a kind of spy. However, she was more or less forced to do others’ biddings due to her brother being held captive. What’s interesting about her case is what is later revealed: that her past wasn’t real, or in other words, she never had a brother to begin with. In a sort of roundabout way, World Break argues that one’s past shouldn’t control what you do. It is, after all, the past, and nothing from it can be changed. Meaning, instead of letting past transgressions haunt your person, fight in the now and for the future; for it is there where the possibilities are endless. Unfortunately, Elena’s character and the message she carries isn’t around for long; after her mini story-arc halfway through the series, she is subsequently pushed to the side and barely looked at again except for the occasional fan-service.\\n\\n\r\nUndoubtedly the strongest character from the anime is Urushibara. Her past is mired in violence and darkness, which may be a factor that contributes to her cool and icy behavior. Having been a slave, she’s no stranger to chains, torture, and loneliness. This last detail is important, because it also highlights where her caring attitude comes from. For while she teases Moroha, Satsuki, and the others while remaining composed, it’s her previous lack of relationships that causes her to cherish the ones she has now. Initially, she finds herself in the same situation, with no one to turn to but herself. It’s not until Moroha saves her, as he did back then, that she remembers that there is always somebody there watching over you, that there is somebody thinking about and loving you. This, once again, ties back in to her keen understanding of others and the kindness she shows towards those near her.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme has a strange vibe about it. It’s weirdly “scary,” given the instruments and the other, ambient sound effects. This may be due to World Break’s reliance on the past; learning or investigating one’s background can sometimes be filled with rather frightening details. It’s oddly paced, adding further to its unsettling tone. The ending theme is beyond generic – regular singing segments and a used-too-often beat. Overall, the OP is a step-up from the ED, but not by much.\\n\\n\r\nThe soundtrack is laughably forgettable, save for one piece: the more choir-like track that plays during Moroha’s “past remembering” phases that adds a sense of sadness and longing. Other than this track, nothing else stands out or is even remotely memorable.\\n\\n\r\nAs for voice acting, that sits somewhere around average. Special shout-outs are in order for Aoi Yuuki as Urushibara for her calm yet sexy way of speaking and Ayana Taketatsu as Satsuki for never wavering when it came to giving the peppy girl her hyperactive way of talking.\\n\\n\r\nENJOYMENT\\n\\n\r\nDespite all of my harsh critiquing of the anime, I still found myself laughing during certain segments, particularly those involving Urushibara and Satsuki. Not only were their interactions with Moroha pretty funny and rather cute, but the relationship they had between each other – with the constant fighting, joking, and one-upping – were typical harem antics that easily put a smile on my face. Even Elena managed to get in on the action whenever she was around, adding one more girl into the equation.\\n\\n\r\nBut when those three weren’t around, the show took a dive. The action was never engaging due to the poetry-usage being quite silly, the “drama” didn’t move me, and the rest of the characters were tiresome to watch. I found myself not liking anything else it was doing that wasn’t dealing with Urushibara, Satsuki, or Elena’s humor and personalities. And since the show (understandably) couldn’t focus on them all of the time, I subsequently found myself not finding satisfaction all of the time, too.\\n\\n\r\nSeiken Tsukai no World Break is a show that didn’t have much to begin with. While some of its characters are entertaining by themselves, everything else – from the story to the animation – drags it down. Unfortunately for this one, there will be no poems ever crafted in its honor.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, narrative is founded on contrivances, nonsensical world aspects, and mindless plot elements\\n\\n\r\nAnimation: Bad, art is boring and distracting despite some variety, mix of good and bad character designs, with below average actual animation\\n\\n\r\nCharacters: Bad, Moroha, Satsuki, and the majority are very weak, Elena is okay, and Urushibara is good\\n\\n\r\nSound: Bad, okay OP, bad ED, bad soundtrack, average VA work\\n\\n\r\nEnjoyment: Fine, Urushibara, Satsuki, and Elena were fun but that’s it\\n\\n\r\nFinal Score: 2/10",
            "date": "2015-05-20T20:35:00+00:00",
            "helpful_count": 103,
            "mal_id": 188299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=188299"
        },
        {
            "content": "If there is a generic MC with Kirito's voice, there is a way.\r\nIt is up to people who have awakened their memories of past heroic lives to stop the monsters! Or so they say, the only ones who actually use the past life plot device are the MC and his two initial love interests, in order to justify instant infatuation and \"not really incest\". Not a thing is mentioned about anyone else.\r\nThe story progresses as Moroha, our average, unremarkable boy, becomes self insertion fantasy incarnate. At the beginning we get the \"i awakened to a strong power and won\" cliche, only to turn him intothe monster slaying god next episode. He has enough power to become the seventh S-rank savior in the world on episode 2, 2 weeks after awakening his powers. From there, it only ramps up the achievement ladder. The MC kicks ass on levels unseen even in other self insertion fantasy light novels.\\n\\n\r\nAs for the other characters, we got the \"Not incestuous tsundere little sister\", the rich kuudere, a deredere loli, the director, whose only role is being a teleportation gate, the band of Saviors from the school (you may forget there is a school after the first two episodes) who appear as an excuse to prove Moroha's absurd power level, and the other S-rank. The interactions among characters other than the harem are close to null, if there is any, it is sexual or is used to slip in breast jiggling.\\n\\n\r\nThe S-rank deserve an individual paragraph. Two episodes after it was stated that they are basically government dogs without freedom, they show you how they chill together watching Moroha and his crew struggle against an unprecedented beast while refusing to aid at all, followed by a whimsical fit where they impeded the only one who wanted to help from doing so. In later episodes they are never ordered by anyone, and even take trips to Japan on a whim. So much for the last line of defense.\\n\\n\r\nBy the way, there were supposedly many other Savior squads in Japan, but there is not even a glimpse of them, even when there are national level threats. So it all comes down to Moroha's goons to get the brunt of the attack while Moroha tries to remember what spell he has to use.\\n\\n\r\nAs for the animation, I will commend Diomedea on this one. It takes actual effort for it to be so bad. Inconsistency of size and distance, sudden jumps, choppy movement, Backgrounds moving at a different speed than the characters, embarrassingly bad CG, even the character design is terrible. If you are a modest studio and try to take on 4 anime on the same season, you are going to have a bad time.\\n\\n\r\nI personally don't sense much of the BGM when I'm watching an anime, unless it is either truly epic or completely inappropriate. Since it wasn't much of an issue, I'm unable to accurately evaluate. Both the opening and the ending had some slightly irritating voices, but other than that, it passes as satisfactory.\\n\\n\r\nThis is a series that you can only watch if you are searching for a failure to laugh at. Since that was my objective all along, I thoroughly enjoyed myself by facepalming at misplaced eyes, sudden knockdowns and slashing at the void because there was no money to actually have a perspective where you can see the enemy being cut.\\n\\n\r\nAll in all, a series that will make you apologize for everything else you called bad. Every time I see a sword grow half a meter, faces disappearing on far away characters, or an MC being a boob magnet or crotch diver, I just laugh and say, it is still not bad as Seiken Tsukai no World Break.",
            "date": "2015-03-29T13:58:00+00:00",
            "helpful_count": 72,
            "mal_id": 183966,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/jmoxor",
                "username": "jmoxor"
            },
            "url": "https://myanimelist.net/reviews.php?id=183966"
        },
        {
            "content": "This was easily the most frustrating anime I’ve ever watched. From terrible characters to a haphazard story it never showed any signs of being any good. It’s becoming a sad world where you find more of these idiotic attempts at making quick money cause of boobs than people actually putting effort into making a memorable story.\r\n\tStory: 5/10\r\n\tThe story premise is actually kind of interesting. It’s the true highlight of the show and if left to its own devices could have generated a very likeable anime. However the story is way to wavy and it’s the lulls they really drag down the story as they aremuch more frequent and take up way to much of the time. If the more important parts of the story were allowed to be viewed at much more length while taking out unnecessary leisure bits it would of been much more balanced. Instead more time is invested into deciding who likes Moraho more.\\n\\n\r\n\tCharacters: 1/10\\n\r\n\tIt’s really hard to choose the best boobs I mean character. The person in charge of character design was handed a promising story and said “wait, we don’t have enough big boobed bitches in this story, let me add around 20 more.” And thanks to all these girls, the anime was ruined. Now I can’t blame every girl but most of them are just there to be annoying and provide fanservice. We’ll look at the main culprit, the newly named pink haired bitch, because I don’t even want to remember her name, and thank her for making it that difficult of a time. All of the melodrama came from her be it her trying to be the best sister, this one would be cringcest, or just trying to help and utterly failing. I once joked around with a friend that if they killed her off in the first four episodes I would give this show a 10/10. The only other girls of the main harem; Urushibara, and Elena and even to an extent Angela are the only girls that actually helped move the story along. Every other girl you meet except for some girls during the Russian arc are pure fanservice and become utter turn offs.\\n\\n\r\n\tSo rant over on the failed girls, how did the main male do? Well he actually was a very solid character. Bit of a cliché as the standard hero, always protecting something and awkward with the girls. Yet he’s also very quiet and is quick to become deathly serious when need be. He also stands firmly beside his morales and friends willing to take on all punishment. If this anime just centered around him it could have been so much better.\\n\\n\r\n\tArt: 6/10 \\n\r\n\tIt’s not the most beautiful anime of the season, but it’s definitely not the worst. You can easily see a lot of sharpness and colour in the characters themselves. However it just achieves what I would say is standard quality for today’s anime.\\n\\n\r\n\tSound 8/10\\n\r\n\tI actually liked the music. It was the one part of the anime that could not be mucked up by the fanservice characters. Many strong sounding tracks that helped build up scenes. The piano version of the main theme became a very memorable piece, despite what the characters would normally act like, the moment this song played everything would just slowly calm down. \\n\\n\r\n\tEnjoyment: 2/10\\n\r\n\tI had mix feelings on this anime. While the story could prove very interesting, the producers constantly had to force in the ecchi/harem aspects so that we might never enjoy the actual story. If they could of even toned back some of the characters it could have proved to be a fun watch.",
            "date": "2015-03-31T13:32:00+00:00",
            "helpful_count": 64,
            "mal_id": 184264,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3552353.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/zperson5",
                "username": "zperson5"
            },
            "url": "https://myanimelist.net/reviews.php?id=184264"
        },
        {
            "content": "STORY: 6/10\r\nCHARACTER: 2/10\r\nART: 2/10\r\nSOUND: 7/10\r\nENJOYMENT: 5/10\r\nOVERALL: 6/10\r\nWhen you keep on repeating “I Remember Everything” every single episode, then YOU DON’T FREAKING REMEMBER ANYTHING!! \r\nSo, we start in a world with a ridiculous albeit interesting premise of humans tasked to remember their past lives since it stirs their hidden inner powers! They have a school where students are trained to become warriors, so they can stop the monsters that pop up at random. Moroha happens to be in this school even though he hasn’t ‘awakened’ yet so it begs to question how he even got admitted in the 1st place! Anyway upon remembering his previous life,it turns out he had 2! One where he’s a White shining Hero and the other where he’s a Dark Cold Antihero. And this is where the anime caught my attention because I was expecting some serious character development for our MC, thinking they would further explore the struggles of Moroha trying to find a middle ground between his past 2 lives. That would have been great right? But the creators decided to deem all this unworthy by skipping through it and opted to only present us with titbits of his previous lives in a sloppily rushed manner! Which seems to happen at the worst time possible, usually during the climax of a fight where the MC simply remembers a half-assed memory which provides him with a spell or technique that helps him defeat that specific monster! Repeat this a few times and all tension has vaporized since the MC just swoops in and safes the day without any trouble! Even the story isn’t coherent, with the show moving in no particular direction except for a series of pointless events that happens one after the other and Moroha comes out victories and unharmed every time cause he’s our MC! This doesn’t help the fact that whatever little story does exist, is filled loop holes. For instance, you meet the S Rank group and it’s suggested they are under constant pressure from government jobs with no time for themselves. Yet all we see are these S Rank chaps moving around at their own freewill with no worries in the world and doing whatever they feel like doing!\\n\\n\r\nThe characters are mostly kept to the background except for the 2 leading girls, so you pretty much forget about the rest. The lead girls are a red haired Tsundere who’s only contribution is being the MC’s sister from the past life and her over clinginess to Moroha really made her unlikable. The other one is the dark-haired girl with a rich family background and we don’t see much from her either, though I really wanted to know more about her interesting past. You have a Principle who only shows up when it’s time to use the teleportation gate and the rest aren’t worth mentioning, in fact you forget we are in a school with tons of other students. We hardly get any real character development, for all the girls are present just for fanservice with big chests and googly eyes at the MC while the guys are mostly kept at the background with 1 or 2 exceptions. They planted the seeds for some great personal growth for Moroha but sadly it was lost to a standard hero who would do anything to protect the people he cares for. (You know the cliched hero trope) Elena managed to stand out at first with her own tragic story but once her arc was over, she was side-lined to being just another girl! And while some of the comedy worked, like the jealous fights between the girls, I feel like they stole precious time for the actual plot to prosper! I mean think about it, we don’t get anything about their life from the past, so we can just forget that. But then we don’t even get a lot of info about their current lives either which pleads to query, when are you going to progress your characters?\\n\\n\r\nThe animation isn’t good either with bad character designs, poor use of CG and the inconsistencies with sloppy movements and facials really begs the question who made this! The size and speed of the characters conflicted each other at times and this is a 2015 release! I did like the magic display though and the power demonstration during the Russia arc were good, but it isn’t enough to save the show from the rest of the mess. Music too follows this route by delivering moderate OP and ED that never sticks the landing but. Yes, there is a but! Some parts of the soundtrack are good, especially the main theme ‘Dragon Heart’ which is usually played during the big moments in the anime. I just wish the rest of the anime had this soundtrack’s level of sophistication for it was a joy to behold the symphony at play! This memorable piece of music always managed to get my attention and I loved every second of it.  \\n\\n\r\nWith all my ranting so far, you would be expecting a serious low figure for this anime but despite all I just said, the show did manage to make me smile at times. And I truly enjoyed the potential of the story which the anime never bothered with. Add in the bad fights and boring drama, and you are left with mostly bad show with little hints of good in it! I just wish they had toned down on the fan service and focused more on their material cause the anime really had a chance. Sigh! Maybe it will get remade in the future, for now it’s not worth recommending to anyone. And you can catch the soundtrack online which is this show’s biggest standout so no need to sit through the entire episodic season!",
            "date": "2018-01-19T03:24:00+00:00",
            "helpful_count": 8,
            "mal_id": 269008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6421599.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PakiUSA",
                "username": "PakiUSA"
            },
            "url": "https://myanimelist.net/reviews.php?id=269008"
        },
        {
            "content": "Having seen a lot of harem anime, this one is unique in that the main character and 2 of his romantic interests are reincarnations of their past lives, meaning both of them were his lovers at one point, which makes things interesting for the present, especially with the addition of new fan girls. The romance plot as well as the action are pretty decent in this show, especially the spell casting, thought I don't understand why nearly every spell has to have some blasphemus phrase to it. The show has been a fun watch overall, but the downside is it's got some of those unfortunateaction and harem cliches you just can't get away from nowadays. Also, the intro song is utterly terrible. I probably won't watch it again but you might like it. It's pretty similar to Aesthetica of a Rogue Hero, which I think I prefer.",
            "date": "2015-03-29T23:15:00+00:00",
            "helpful_count": 18,
            "mal_id": 184041,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3404479.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/UponAShallowBay",
                "username": "UponAShallowBay"
            },
            "url": "https://myanimelist.net/reviews.php?id=184041"
        },
        {
            "content": "Well, I tried whit other form in this second review....\r\nStory\r\nA tipycal story whith the generic main character. Haimura, Moroha have  a one great and unic power. This MC going to school where people come together with this power or similar. In this school  He  created own tipycal harem.  (girl whit big boobs vs girl whit pettits boobs, the quiet girl, the loli...) To this must be added the power of Haimura, that acts of wildcard throughout the anime; one \"remember\" and he can use a a prohibited technique, this makes almost no effort to end the anime.\r\nArt\r\nVery good, like  thistype of anime. the characters are pretty and vivacious, which sometimes causes you admire them,although this feeling does not last long enough to create a waifu. Landscapes are a strong point of anime, are cute, , large and there are many. and the characters interact with them causing changes\\n\\n\r\nSound\\n\\n\r\nThe strength of the anime, cute, beatiful, wonderful... Really feel like how  as if you fight your own battles. and ranges from classical to metal. simply speechless.\\n\\n\r\nCharacter\\n\\n\r\nNice and defined personalities, however, hardly evolve and no situations requiring face this until very late\\n\\n\r\nEnjoyment\\n\\n\r\nIt has a nice music and a cute art, but the story and the characters are generaly. personally, I recommende other animes if you wants a one good story.\\n\\n\r\nSo, this anime have a one unique sound, one art acceptable and a good base story, but need more situations puntuals and the characters generics makes it an anime heap",
            "date": "2015-03-30T02:38:00+00:00",
            "helpful_count": 16,
            "mal_id": 184054,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4092261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yakamin",
                "username": "Yakamin"
            },
            "url": "https://myanimelist.net/reviews.php?id=184054"
        },
        {
            "content": "This show I thought was really good in the first few episodes, and then boy was I wrong, this anime turned out excatly what I expected, everything the anime was gonna do, i already predicted it. They do it so expected that it wasn't even fine. The animation for like the last few episodes were poor, things were getting copy and pasted, the battle scenes were not exciting, and what's suppose to be a Boss is animated poorly. The characters, there are way too many, and of cource, that means that like half of the characters we barely get to know them, the anime basicallytold the story of one character good, and that's basically it, They just keep adding more and more character without going to the backstory with them. The music in this anime was repetative, there was one track that was good that's it. The story was poor also, there were many plot holes along the anime and you can't even consider there was a story at all. At least my enjoyment with this anime was ok, I came into this anime expecting this much anyways. Overall, I give World break a 6/10",
            "date": "2015-08-03T19:37:00+00:00",
            "helpful_count": 11,
            "mal_id": 195112,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4719984.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Childly",
                "username": "Childly"
            },
            "url": "https://myanimelist.net/reviews.php?id=195112"
        },
        {
            "content": "Plot Devices is something that exists in any given entertainment medium in order to move the plot forward.  Plot armor is where a given character can never be hurt or killed simply because the plot demands that he doesn't.  Like any other form of story, anime utilizes these two aspects to a certain extent in order to tell its story and move along in plot progression.  But what happens when they're...overused?  Well, I believe Seiken Tsukai no World break answers that question quite easily.\r\nStory (4.44/10): In the world of World Break, this fantasy rendition of the world has a special twistto it.  In this world, reincarnation exists, and it is here where we have Haimura Moroha, the our main protagonist enter the school that specializes in harnessing the power that people wielded in their past lives in order to fight the mysterious creatures known as metaphysicals.  \\n\\n\r\nAs far as story setup goes, World Break doesn't particularly do a well and proper explanation.  In the first couple episodes, the show attempts to explain the ideas that it wants to establish, showcasing how exactly the idea of reincarnation and how it corresponds to the weapons and abilities that these students wield.  While the explanation is subpar at best, with some things not getting a complete explanation, the first few episodes do give some insight as to how the world of World Break actually works.  But apart from this though, the story falls VERY flat, entering into the void of lazy writing and predictability.  \\n\\n\r\nLet's start with cohesion.  Throughout the runtime of World break, the series never really puts its plot points together.  With the series spanning over the course of six in-anime months, the events within that timespan aren't really told in the most fluent of manner.  The series is made in an arc-like setup, with different arcs and events that pertain to each small set of episodes which make up the entire series.  The problem with this though is just how clunky the transitions are.  Simply put, after finishing a specific event, the World Break jumps headfirst into the next arc in the next episode without word or warning, creating a very awkward transition and overall, a very distasteful experience.\\n\\n\r\nAs far as actual plot goes, every individual arc is quite separate from one another, with some of them bordering on sheer ridiculousness and the simple question of \"why is he doing this?\"  (Like seriously, bastard goes to war BY HIMSELF in one arc.  That's just...why?!)  Not that the stories are particularly bad per say, since each one does have to do with the series and contributes some progression, but I feel as though each one was done in a spur of the moment feel because of how dramatic the situation can and will change in any given arc.  \\n\\n\r\nBut overall though, I think the biggest problem with this series is the plot device known as \"reincarnation\".  Yes, the central thing of World Break is its main problem.  Throughout the whole series, our main protagonist faces problems and issues that pertain to the series, aka metaphysicals terrorizing the world, or people wanting to kill him for reasons unknown, you get the idea.  Because of how the series presents these battles, the impact of said conflict is little to none.  And this is all because of the little phrase \"I remember.\"  Just two words, everybody.  As the series explains, Moroha is someone who has two past lives (I'm not really sure what the significance of that is because I'm pretty sure every savior in the series theoretically has reincarnated a bunch of times according to the show's logic), being our overpowered main character who shares the same level of power as SAO's Kirito and Mahouka's Tatsuya.  During the course of any given battle, Moroha CAN AND WILL utter the phrase \"I remember\", as he randomly remembers something that occurred in a past life, thus giving him the ability to win a battle without any kind of repercussions.  Basically, this means that this guy's very existence has the ability to turn the tide of any battle.  I find this a very lazy way of writing a story for several reasons.\\n\r\n1.  This makes the plot extremely boring and predictable because there is no way that this guy will lose.\\n\r\n2.  None of the tension the show gives us will have any impact because we already know he's going to pull out the MC card and win.\\n\r\n3.  Conflicts become resolved extremely easily.  \\n\\n\r\nOverall, the story of World Break is one of the more lazier things I have seen to date.  While the setup of the story was decent enough to at least establish what we were watching, the rest of the story fell very flat.  With lack of story cohesion, easily resolved conflicts, plot convenience that comes WAY too easily, and above all else, an ending episode that looks nothing like the beginning two minutes of the series in a flashback, the story of this series made my blood boil more than anything else.\\n\\n\r\nOverview:\\n\r\n+/-  Somewhat decent explanation of the fantasy elements (still don't understand where they metaphysicals come from or why they exist.)\\n\r\n-  Lack of story cohesion\\n\r\n-  Way too much plot convenience\\n\r\n-  Ridiculous story arcs.  (You go to war against the biggest country in the world BY YOURSElf just because a girl was tricked into believing she had a brother?  Seriously?)\\n\\n\r\nCharacters (5.87/10): While the story by itself was poorly done, the characters of this show followed that to a certain degree.  \\n\\n\r\nUp first, we have Haimura Moroha, or as I like to call him, walking plot armor.  Following the traditional MC character traits of being nice to the girls in his harem, swearing to protect people and not let anyone get hurt, and being OP as all hell because harem/fantasy MC's area always like that.  As far as change in character, this guy changes none.  But his impact to the series is a completely different story altogether.  Because of his existence as walking plot armor, literally every issue the anime has is resolved because of him.  Because of his signature phrase \"I remember\", any technique that existed in his previous life can and will return back to him and take down whatever is before him.  A gigantic hydra terrorizing your harem?  He just remembered something and take it down.  A British knight making your life hell?  Just remember something to take him out.  A russian tyrant tricked one of your harem members?  Just go up to her, remember something, and knock her off her throne.  Because the conflicts of the series are wrapped up THIS easily, nothing in the series really has any important impact.  It is guaranteed that the situation will turn in the MC's favor, and there's simply just no enjoyment in my opinion to be had seeing someone just plow their way through like that without any drawbacks.  \\n\\n\r\nAnd then we have Ranjou Satsuki, the girl who plays off as the little sister troupe with the combination of the girl with the irritating laugh.  Being Moroha's blood-related sister in their past lives, Satsuki spends the entire series trying to prove herself to her \"older brother\" by trying to obtain strength so that she can be praised.  The only problem about this is the fact that she doesn't really have much of an impact.  Throughout the whole series, Satsuki doesn't particularly do much but be a character that you can just love to hate because of how arrogant she comes off and how little she actually does in the grand scheme of things.  \\n\\n\r\nNext, we have Shizuno Urushibara, the main girl of the series that plays off as the level-headed girl with the big chest.  As Moroha's wife from a different past life, Shizuno similar to Satsuki, she doesn't really come off as very important in the series.  While her impact to the series overall is more so than Satsuki due to the fact that she received an arc to herself, she doesn't really go beyond what we as the audience knew of her, and thus doesn't really stray from the traditional characteristics that her kind of character has.  \\n\\n\r\nSide characters for World Break are expansive and plentiful.  Apart from the loli member of the harem, Maya, the rest of the characters serve one of two purposes.  One, they are recurring characters that exist purely for the background, or two, are characters that are only important in a certain arc and don't have much reach beyond that.  The side characters have varying importance and screentime, all of them with a good deal of personality to them.  While not perfect, they do hold their own in some sense.  \\n\\n\r\nOverview:\\n\r\n+/- Decent side cast\\n\r\n-  Generic harem MC\\n\r\n-  MC is literally plot armor\\n\r\n-  Main girls are troupe characters for the most part\\n\\n\r\nArt and Sound (7.00/10 and 6.49/10): Art for World break is very colorful and bright.  While I have bashed this show on its more technical aspects, its aesthetic aspects do make up that somewhat.  Because of it more or less being standard animation for this day and age, there really isn't much to say about it.  But the action is quite fluid and nice, I'll give it that.  (Still don't understand how the way spellcasting in this series is effective.  You have to stand for three-five minutes at a time just to cast one thing.)  \\n\\n\r\nThere are however some flaws within the show's artstyle.  For one thing, the metaphysicals don't really work well with the series's standard animation at times.  Sometimes, things go into what looks like CG, and it just looks kinda awkward when it does.  It doesn't use it very often, but when it does, it can become prominent.  In addition, there is one glaring character design flaw which I feel needs to be addressed, that being concerning the character Elena.  Hair...does...not...work...like...that.  Within this character's design, her right eye is supposedly being covered up by the large bang that she has over it.  The only problem with this is the fact that the eye shows right through.  Because of this, you can see both her eyes even when one is being covered up by hair, and it just looks so weird.  It's only a minor detail, but it's very obvious and glaring when you watch it.  \\n\\n\r\nAs far as ecchi goes, World Break doesn't really capitalize on the idea all that much.  While it does showcase some ecchi elements, it doesn't really come up all that often.  That being said though, there is one specific character that creates most of the fanservice-esque scenes, and those scenes have earned a cringed look from me, and left me with a scarred memory.\\n\\n\r\nThe sound for World Break is simply split into three tracks.  The OP, the ED, and the battle music because as far as I'm concerned, these are the only three songs that this show actually has.  The OP is a song that I would regard as irritatingly catchy.  It has that tone to it that makes to me, a sound that is equivalent to nails of a chalkboard as the entire thing is sung by someone with a very high voice in addition to a beat that suddenly speeds up at times.  Personally, I hate the OP.  While it is insanely catchy, I personally don't like it.  The ED is forgettable, so there's not really much to say about that.  As for the \"battle music\", the show uses an opera style track with a mystical sounding flair to it that sounds rather pleasing.  While the rest of the soundtrack wasn't particularly stellar in my opinion, this song in particular did song very pleasing to me.\\n\\n\r\nOverview:\\n\r\n+  Decent art\\n\r\n+  One good song\\n\r\n-   Some artistic flaws\\n\\n\r\nPersonal Enjoyment (4.33/10): During the fall 2014 season, an anime by the name of \"Seirei Tsukai no Blade Dance\", a series that I saw as one that was written very poorly but somehow deserved the \"it's so bad it's good\" rating on account of people saying the show was actually good, even if I saw otherwise.  Likewise, \"Seiken Tsukai no World Break\" while sharing a similar sounding title, is one that I regard as a spiritual successor to that series.  \\n\\n\r\nDid I like this anime?\\n\\n\r\nAs far as aesthetics go, (ignoring Elena's eye), the series didn't look too bad visually.  While there were some choice moments I would like to forget, overall, the look of the series was one that I would regard as a higher point in the series, even if the designs of some of the female characters made no sense biologically.  \\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nI hate just how lazy this series felt.  Because of its reincarnation idea, the series exploited that idea by creating a very poorly written story where everything was solved simply because the MC could remember something that could help him in the situation, and giving the excuse that because he has that to back him up, that writing up something like that was ok.  You know what?  It's not.  Every time he uttered the phrase, there was a sense of rage inside me simply because of how ridiculous and how common this plot device was used.  Use it once, shame on you.  Use it twice?  Shame on me.  Use it 10-15 times?  Ok, that's just bullshit now.  \\n\\n\r\nWould I recommend this anime?\\n\\n\r\nWhile I personally didn't enjoy this anime, I wouldn't say that this show isn't enjoyable to some extent.  If you're a fan of overpowered MC's, this show is perfect, because the entire show just capitalizes on just how ridiculously overpowered this guy is.  Hell, even the best fighters from other countries, who are seasoned, adult veterans, cannot stand up to a guy who hasn't even finished high school.  If that isn't OP, I don't know what is.  But because of its lazy storytelling, troupe-filled characters, and several aesthetic flaws, this show doesn't come close to being good in my book.\\n\\n\r\nOverall Score: 5.04/10",
            "date": "2015-03-29T15:57:00+00:00",
            "helpful_count": 11,
            "mal_id": 183987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=183987"
        },
        {
            "content": "(reposted because MAL preview rules & yada yada yada)\r\nTL;DR: A slow motion train wreck of a show which you'll spend the first half saying \"I hope they do something interesting with the premise\" & the second half saying \"this wasn't what I had in mind.\" Some interesting ideas are touched on but between the bad writing & obvious low budget, there's nothing really worth watching.\r\nSometimes I forget how grateful I should be for straight up bad TV series. You know where you stand with a bad show, because you know exactly how you feel about it & can either keep watching it, knowing you're justwatching it on some ironic level or for its unintentionally comedic value; or you can just walk away from it with no regrets that it might get better or it could have been good if only they'd done x, y & z better.\\n\\n\r\nI say this because World Break is bad. It's a lazy action-romance with boring archetypical characters, dull fights, cliché harem hijinks & everything else that makes you ask yourself wtf Japan sees in these regurgitated fantasy-action-romance stories that they keep adapting them again & again each season. This Winter season alone we had World Break, ISUCA, Absolute Duo & Unlimited Fafnir (& those are just the ones I watched), each so similar to the other that I still have to remind myself which one I'm watching at times.\\n\\n\r\nWhat is it that keeps the production line that these series come off running? Well I think the answer lies in that all of these shows can be summed up as “generic fantasy-action-romance but...” & that but is, frustratingly, enough that you keep watching in the vein hope that it will be used to good effect at some point during the series. It never does, of course, but you don't know that until the last episode, by which point it's too late to bail out.\\n\\n\r\nWorld breaks tale takes place in Japan. For reasons unexplained, the world is under constant threat of attack by monsters called metaphysicals from...somewhere. Fortunately, there are people in this world who have the souls of past heroes inside them, allowing them to tap into the collective memories of past lives to generate magic weapons with which to fight. There are two types of magic user in this world, although the distinction really doesn't mean anything consequential except to emphasise that our hero, Moroha Haimura, is a special snowflake for having the souls of two heroes within him & therefore the power to use both.\\n\\n\r\nHere's the first part of World Break that frustrates me. The idea of people drawing power from the souls of dead heroes isn't new, but it is one that can be interesting. Unfortunately, all World Break really uses it for is to explain away why our hero quickly finds himself with the two main girls, pink haired, ditsy hothead Satsuki Ranjou & purple (or mauve? Vermilion, maybe?) haired, cool, aloof Shizuno Urushibara clinging to him like limpets. You know the drill with these two: they both feud with each other over the MCs attention while never really making any real effort to actually go anywhere relationship wise because then there wouldn't be a “plot.”\\n\\n\r\nThere are several flashbacks detailing how each of them were connected in past lives, which again could have been an interesting way to explore why they feel they have to be with each other in the present, but, while World Break does this to a superficial degree, mostly they just serves as the authors way to write stories that belong more on fanfic.net than here. Which do you prefer: the gallant knight saving the princess/sister?; or the emo warlock saving the poor slave girl? Your answer will decide who you're shipping. Really, it all just serves to contrive awkward misunderstandings & reasons for the MC to find his face buried in one of their chests.\\n\\n\r\nBeyond our trio, we have a schools worth of characters for us not to care about. Because of the power of friendship & stuff, all three of them rise up the ranks of the magic people school they attend to join the team who have to defend their region from monster attacks. Again, being part of a kind of super sentai strike team could have been cool, but all said squad does half the time is molest each others ridiculously oversized breasts for comic effect. The Vice Captain in particular is a literal ball breaker who seems determined to pop any round objects she can grasp, be they male or female appendages. It's all oh so funny & all so pointless, cheap titillation masquerading as banter to show the group getting along.\\n\\n\r\nThis would be a good time to mention World Breaks main gimmick in its action scenes. You see to cast spells, mages don't simply say an enchantment, they write it. It's a gimmick, yes but it is one that could have been interesting, I feel. Ultimately, though, it's just boring as the caster simply stands their wiggling their finger in the air for anything up to a minute. As a concept I like that casting spells requires more poetic language than simply blurting out some vaguely European sounding words before striking with the engrish (although that's there too), like it so often does in anime. Sadly, its one of those things that probably works fine when you're reading but it doesn't adapt well to animation.\\n\\n\r\nOn the subject of action, the fights in World Break are a mixed bunch. There are a couple fights that are well enough animated & directed. But on the flip side, particularly as the series goes on the quality drops almost precipitously. There's a big group battle against a giant turtle crab monster thing, for example, that was meant to serve both as the first big test of the schools strike team & also show the MC prove his superior power to the world elite Rank-S group. Unfortunately, it's so full of shoddy animation & art that you can hear the moths fluttering in the space where the shows budget was supposed to be.\\n\\n\r\nIn fact animation & art issues plague World Break. Diomedia, the studio behind this series, have four shows airing concurrently this winter, & you can see that World Break drew the short straw at the budget & resources meeting. It's a shame, because some of the music playing behind it all is pretty good. There's an aria that is sung during the climactic parts of fights that I really like the melody of & does a good job of matching the emotion of the scene. Unfortunately, that's not nearly enough to compensate for the other shortcomings of this shows production.\\n\\n\r\nAs the story of World Break unfolded, I became more frustrated with where the author/writer have chosen to take things. The past lives idea, once it's been used to establish why the main trio are together, only really comes up when Moreha needs to pull a spell out of his arse to win a fight. In fact, \"I remember now\" is probably his most repeated phrase. None of the other characters seem to have such a relationship with each other, despite the almost predetermined nature of the main three. The idea of false memories is brought in the story of Russian student Elena Arshavina, but it's never explored; which is a shame because it could have had interesting implications for the whole past lives thing World Break has going on.\\n\\n\r\nThe metaphysicals are also really just there as a convenient device for whenever the show needs something to happen. Despite their apparent ever present threat to the world, no one seems that interested in actually doing something about them. Indeed, Moreha manages to find time between them & his harem duties to wage a one man war against Russia, which is as stupid as it sounds & is one of the most absurd examples of a selflessly heroic gesture for a pretty girl that anime romance require their male main characters to do. Ultimately, everything potentially interesting in World Break is just window dressing for a plot that goes through the tired old motions of having a teenage boy find friends, struggle through adversity & ultimately learn that working together to reach your goals is better than trying to do everything alone (except when it isn't).\\n\\n\r\nTo reiterate, World Break is bad. It's the kind of show that makes you understand why people see “light novel adaptation” on AniChart & say “nope!” without even watching the first episode. It's a lazy, by the numbers fantasy romance that like so many before it comes, goes, & is forgotten before the end credits have finished rolling. It's the type of story makes you wish it was worse, simply so you could just ignore it entirely rather than getting hung up, as I have, on the little parts of it that could have made for such a better show; if only they had been given prominence instead of just being there to try & mask that this the same tired tale that's been told a thousand times before & usually several times each season.",
            "date": "2015-04-03T05:12:00+00:00",
            "helpful_count": 11,
            "mal_id": 184584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4095221.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Lancehot",
                "username": "Lancehot"
            },
            "url": "https://myanimelist.net/reviews.php?id=184584"
        },
        {
            "content": "Seiken Tsukai no World Break appears to be like any other typical ecchi and harem anime with a bit of action mixed in, but any experienced anime watcher would notice that it's very poorly made. If one thing killed this anime, I'd have to say it was the animation.\r\nStory: 6\r\nI'm sure the light novel had a story of some sort, otherwise it wouldn't sell, and probably wouldn't be adapted into an anime either. The premise is pretty interesting, as I've heard many say, but they don't really do anything with it. The story here seems to be secondary to the characters acting out their (mostlycliche and predictable) personalities. Most episodes don't touch the plot, and the writing and dialogue do little explaining, making the plot feel plain and incomplete.\\n\\n\r\nArt and Animation: 5\\n\r\nNow, there's nothing particularly wrong with the art itself, which is pretty standard for anime right now. The animation, however, is incredibly shoddy, and immediately and continuously noticeable throughout the entire anime. I don't know if the studio was lazy or just didn't care, but for most scenes, just the minimum amount of animation necessary was done. Just how little movement there is in every scene is painfully obvious; you'll generally see just thing happening at a time: one person's mouth moving (no gestures, ever, just mouths moving), one person walking, or just 3 or 4 frames being repeated, if not just one still frame, etc. I could go on and on about it, but suffice to say, it's truly terrible for any anime  that even pretends to have action scenes (the amount of animation would be equivalent to one of those Gintama episodes where they sit around a kotatsu, or a wordplay based gag anime).\\n\\n\r\nSound: 7\\n\r\nNothing special; it did is job. Voice acting was fine, soundtrack was average;  I didn't see (or hear) any problems.\\n\\n\r\nCharacter: 6\\n\r\nVery flat, not fleshed out. Most are given very little characterization, and are  mostly given just a few traits or behaviors that are used to define them. Less so for main characters, but not by much.\\n\\n\r\nOverall: 5\\n\r\nMost bad animes are bad primarily because of plot or premise, but this one is just.... bad. Even if you're looking for fanservice, pretty much any other anime is probably better.",
            "date": "2015-05-07T04:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 187284,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229672.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MortalMelancholy",
                "username": "MortalMelancholy"
            },
            "url": "https://myanimelist.net/reviews.php?id=187284"
        },
        {
            "content": "I don't recommend this anime,because it has nothing to offer.\r\n STORY(3/10): This anime has no consistent plot and has many plot holes.Plot was all over the place.Sometimes was one thing and sometimes another.And after 3 or 4 episodes it got uninteresting.\r\n  CHARACTERS(3/10): Characters ware bland and not interesting.And one-sided,one was loud,one was shy,one was strong etc.Main Character had no flaws and the viewers can not relate to him at all. There is no sense of struggle and  therefore gets really boring.\r\n ART(8/10)I really liked characters design,it looked nice and pretty and i also liked backgrund art but  fight senses ware bad,just HORIBBLE.infact so it was unwatchable.\\n\r\nENJOYMENT(4/10):Why? because its really boring,but if you like Harem and don't care about the story, i think you will enjoy it.\\n\\n\\n\r\np.s. i really liked the music.",
            "date": "2017-01-13T10:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 238205,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5339548.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dazy",
                "username": "Dazy"
            },
            "url": "https://myanimelist.net/reviews.php?id=238205"
        },
        {
            "content": "I was bored on a weekend away from home and had this anime on my \"someday\" list, so I decided to give it a try without great expectations. And I was wrong.\r\nI've seen some (won't say a lot) of a nime, and a great part of them were highschool harem, so when I saw the cover I decided to just sit and get over with it. But this one in particular is great, I don't rememeber many series that make me lose sense of time and this one did it.\r\nStory: 9/10\r\nReincarnation, past lives are interesting topics and it's easy to ruin them, but for mysurprise it wasn't the case with World Break. They were nicely used and the story as a whole actually makes sense, it's entertaining  It is deep enough to make you keep watching without taking away your social life. Story itself won't get a 10 from me because past lives aren't properly developed (and they seem pretty awesome) leaving a bit of a plot hole there.\\n\\n\r\nArt: 8/10\\n\\n\r\nNice drawing, beautiful magic and the best freaking dragon I've seen in years. That alone got me. The battles are great, you can actually keep track of them, the magic is bright, the color palette is also interesting.\\n\r\nAs a bonus point: Rusia was really nicely drawn.\\n\\n\r\nSound: 8/10\\n\\n\r\nThe ending is way better than the opening, but what really got me was the BGM, really tocuhing despise being the same track almost everytime. The characters had some personalities on their voices and that improved their very characters.\\n\\n\r\nCharacter: 7/10\\n\\n\r\nNot the best point. The MC has a standard high school harem personality, and the harem members didn't bring anything new to the world. There's so little character improvement or growing, but maybe that's because of the 12 episode lenght. \\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nPretty awesome as I said, it's agile, easy to watch and follow. I was tempted to rate it as a solid 10, but the fanservice was too much and unnecesary. You can't waste two whole episodes of a 12 episode series on beaches and saunas. But without the fanservice, or ignoring it, the anime is very enjoyable.\\n\\n\r\nOverall: 9/10\\n\\n\r\nFor me, and you know, that's a very subjective opinion, this one is a solid 9. An interesting story, the best dragon in a long time, great magic and battle scenes. Too much fan service costed it a whole point, but maybe if there were made 24 episodes instead of 12 it would have been better.",
            "date": "2015-12-19T14:26:00+00:00",
            "helpful_count": 7,
            "mal_id": 206031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4881879.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Vehemor",
                "username": "Vehemor"
            },
            "url": "https://myanimelist.net/reviews.php?id=206031"
        },
        {
            "content": "The characters remember who their were in their past lifes, and battle monsters with the magic of their old selfs, thats a pretty good idea but it wasn't that good as it could have been.\r\nStory\r\nThe idea was pretty good but the implementation was awefull, the characters weren't good either. \r\nThere was no depth in them, not much backstory. They seemed \"dead\" for me, cuz they didn't behave as they should have. They seemed to be idiots in some scenes.\r\nWhen they fought the behemoth, the MC and another character destroyed the legs  of it, with ease. Then the behemoth spawns parasites and they get destroyed.They behaved really odd, dunno how to explain this, but it could have done better.\\n\\n\r\nArt\\n\r\nThe art was not good too.\\n\r\nThere were many flaws in the scenes, when they fought the first fortress class monster, as example.\\n\\n\r\nSound\\n\r\nWasn't good either.\\n\r\nThe music was almost the same everytime.\\n\\n\r\nSo what do I think overall of the anime?\\n\r\nThe story idea was great, the implementation was bad, the art could have been better and the designs for the monsters too.\\n\r\nSame for the sound and music, they used the same music multiple times and I would have liked some better sounds for attacks and other stuff.\\n\r\nThe characters didn't have depth, they seemed to be puppets, they weren't even interesting. They behaved odd in some situatens and fought against monster the false way everytime, it was more like some mishup.\\n\r\nBut still the anime was enyojable.\\n\\n\r\nWell, I don't know how to explain the characters propably, they just behaved like retards. Sorry to say this, but it's true.\\n\\n\r\nWell that was my first review, I don't really know how to describe this anime, but I think, it could have been done a lot better.",
            "date": "2018-09-01T10:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 287900,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6540040.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/xOngKox",
                "username": "xOngKox"
            },
            "url": "https://myanimelist.net/reviews.php?id=287900"
        },
        {
            "content": "Just another male protagonist hitting it off with every other girl he comes across.  At this point, most of us probably know quite well what to expect from anime of the \"ecchi\" and \"harem\" genre.  A mediocre story at best, the oversized flapping breasts (or not), attacks that seemingly only strip girls, the facepalm dialogue, and the recycled female archetypes among others.  To which, the selling point of this sort of anime becomes its quality art that one can usually expect.  Which in actuality was anything but.  \r\nThe premise of the story was actually not all that appalling.  Everyoneseems to live forever through a perpetual cycle of reincarnation, monsters that seemingly appear out of nowhere just to harass the protagonists, inconsistent plot/characters, and the ever-so-appealing-power-up catchphrase \"I Remember Now.\"  Okay maybe not, but with a little more direction the plot could have easily been good.  Probably.\\n\\n\r\nThe art was far from onpoint.  The appearance of monsters resembled that of cardboard cut-outs, there was no fluidity in movement, battle scenes were choppy, over usage of still frames, the whole thing just felt clunky.  The only somewhat detailed scenes were fanservice segments, but hey that is supposedly a norm by this point right?\\n\\n\r\nThe BGM in this series seems to have had one goal in mind.  Make already annoying and shrill voiced characters ... sound even more annoying.  OP and ED were normal.  As normal as could be as far as \"harem\" and \"ecchi\" series go anyways.    \\n\\n\r\nCharacter development was.... well, let's just stop there.\\n\\n\r\nIf you can get past the inconsistent plot, art, and characters, then feel free to give this series a go.  If you can't, you should probably move on to the next anime lest you pull all your hair out and go-for-bald.  I for one managed to plow through this series unscathed, but that may be that I'm simply overly callous from repetition.  \\n\\n\\n",
            "date": "2016-09-10T00:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 228678,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/299491.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MondayBlues",
                "username": "MondayBlues"
            },
            "url": "https://myanimelist.net/reviews.php?id=228678"
        },
        {
            "content": "Welcome to my review of Seiken Tsukai no World Break. At the time of writing this review, I have completed watching the series. Although it might be a little late considering the Anime finished airing on March 30 2015, do take a look and give me some pointers as to where I should or could improve on in my review so I can write better ones in the future.\r\nI'll put this section here early in case you guys miss it. Do visit my blog section on my profile after reading my review for an Afterthoughts pertaining to this particular Anime for some healthy discussion. Thanks!\r\nHeregoes:\\n\\n\r\n1) Story (3/10) \\n\\n\r\n- Here's why I feel that the Story portion is poor. The development to the series is way too imbalanced. While I feel that the \"memories of past lives\" concept is an interesting notion and makes for great development potential (which is why I gave it points in the first place) , it did not happen throughout the series. The reason why I say this is because if you have memories of your past lives, then your abilities in this life has already been decided from the get-go. In other words, they're limited. At the time of reading this review, if you guys have watched the Anime, then you should be able to tell a noticeable power gap between the MC and almost everyone else. \\n\\n\r\n2) Art (5/10)\\n\\n\r\n- Here's why I feel that the Art portion is fair. The art is actually pretty decent. The MC has a silver highlight in the middle-front portion of his hair, which makes him stand out from the other characters (duh, because he's the MC). Even though he has a feature that distinguishes him from the other characters, it is not too much to the point where he looks totally different. He actually blends in well with the others. The art of the Metaphysicals are average at best. While I an understand that making them look incredibly huge will instill the notion that they're hard-to-beat bosses that are supposed to be taken down by multiple people, it doesn't really matter when all you have to do is remember a fraction of your past live, right? The story doesn't do the art justice, which is why it only gets a passable score.\\n\\n\r\n3) Sound (7/10)\\n\\n\r\n- Here's why I feel that the Sound portion is good. There's actually not much to comment about this part, if you've heard the OST, you'll find that it's quite pleasant and fits into the Anime well. It gives the Anime itself a good start.\\n\\n\r\nIn case you're wondering, the OST's name is Dragon Heart. No, do your own research. I ain't gonna help any more than telling the name.\\n\\n\r\n4) Character (2/10)\\n\\n\r\n- Here's why I feel that the Character portion is dreadful. Character development  for the MC is way too fast. A few starting episodes in and he's already an unstoppable beast and a Metaphysical-killing machine. Got himself into a rough patch? No problem, \"I remember!\" ( or\"Omoidashita!\" for those who remember). In comparison, all other characters(and I really mean every single other featured character) pale A LOT in comparison. This is proven by the MC needing to appear at every last moment and remembering some powerful moves to finish the enemy. The difference between the MC and the other characters are too great to even be considered having a higher score.\\n\\n\r\n5) Enjoyment (2/10)\\n\\n\r\n- Here's why I feel that the Enjoyment portion is dreadful. As mentioned in the Character section above, character development is way too imbalanced. This means that about halfway through the series (or even earlier), you'd be used to the MC landing hard-hitting wide area attacks that will defeat the enemy easily. Sure you might enjoy the opening moments of the Anime watching the characters develop, which is little to none, but after that comes boredom. There's literally nothing else to watch other than, you know, hard-hitting moves that will save the day.\\n\\n\r\n6) Overall (3/10)\\n\\n\r\n- Overall, the Anime is not a very one to watch. The progression feels forced and the pacing is pretty bad as well. You could watch it if you're just looking to kill some time or if you really like Harem Anime. I wouldn't recommend it.",
            "date": "2015-04-21T15:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 186177,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3339977.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AndyFaunus",
                "username": "AndyFaunus"
            },
            "url": "https://myanimelist.net/reviews.php?id=186177"
        },
        {
            "content": "Personally, I believe that this is great anime. If it had had 24 episodes long the plot, the development of characters, feelings between the characters and the history behind the main characters like Moroha which wasn't given enough detail would all have been developed to produce a triumphant anime. However, this is really just nitpicking. In the basic of premise of things, World Break brought something quite new and interesting to the industry. It's an anime that doesn't just follow the typical route in which harems proceed. Here's some detail,\r\nStory 9/10:\r\nThe story for World Break is one I enjoy considerably. In this anime world, themain antaganists are called 'Metaphysicals' which just go round doing the usual bad stuff (stepping on flowers and the like) and the ones who defend the countries of the world from them are called saviours. To put it bluntly, there are two types of saviours. One who uses magic that's good (light in a sense) and the other uses bad (dark in a sense) magic. The saviours use abilities that they can learn from their past lives as heroes, mages and the like and put into practice. Although, saviours only have one past life which they can take good or bad abilities from depending on what they were. The story centres around a guy called Moroha who is the the first person to have two past lives which luckily have good abilites in one and bad abilities in the other. Moroha starts his first day at an academy for newly-training saviours and then the story follows him as he encounters new enemies, creates new bonds with others and grows ever stronger. \\n\\n\r\nThis story is extremely intriguing to say the least and gives us an insight into World Break. This is one of the best harem anime I've ever seen, contesting with the likes of Highschool DXD (you know, the anime with the boobs). However, because the anime is short in length, it lacks the full development the story deserves which, in that respect, is similar to DXD. At some points you can clearly see that the writers have to rush the storyline in order to finish the last arc of the series. However, the story is amazing enough that you can look past it which is also similar to DXD even though it follows a totally different premise.\\n\\n\r\nArt: 7/10\\n\\n\r\nI gotta say, the art is average at best for something made in 2015. There are many rough parts in the anime which could use some smoothing over. But, the art isn't too bad that you wouldn't be able to watch it. It all depends on your tolerance and taste. For example, I won't touch Higashi no Eden because I don't like the art.\\n\\n\r\nSound: 8/10\\n\\n\r\nThe anime soundtrack wise isn't something I'd download to my phone like Btooom!'s opening or Noragami's (You know that's the good stuff). However, the sounds used inside the anime were fantastic. I love the music when an emotional part of the anime comes into view. I would say that it's slightly below SAO (Sword Arts Online) in terms of sound quality.\\n\\n\r\nCharacter: 8/10\\n\\n\r\nThe thing I love about this harem anime is the fact that Morota isn't a giant wet blanket and has a hardened mental state behind him. It is so refreshing to see some guy with giant balls join the small, \"powerful main leads in harem anime\" club and be a candidate for harem king 2015. Apart from Morota, the cast seems rather generic though. Excitable imouto (Japenese for 'little sister'), a cold girl with questionable views and everyone else is practically a supporting cast. But seriously who gives a damn when you've got a badass in a harem anime, stuff like that only happens on Christmas!\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nI loved it to be honest. I laughed, I cried, I woke my parents up, I got bitchslapped (The life of a kid entering college). It was a great anime for me, I got the same emotions from it as I did with memorable anime like Demon King Daimao and Trinity Seven. That may seem a little biased but it's the truth, promise. Pretty much everything just felt right in the anime and I just liked it for sticking to its ground rather then trailing off into oblivion (*Cough* Mahou Sensou *Cough*).\\n\\n\r\nOverall 9/10\\n\\n\r\nI was really impressed with this anime. I have to congratulate the developers for bringing a new flavour to the Harem genre, not literally of course. Although it's art was average, the premise, the fanservice, the action and everything was pretty great. I only wish it could have been longer but beggars can't be choosers. All in all, a great anime and I would reccomend the hell out of it. This is my first review so be sure to give me some opinions of my work by messaging me or whatever. With this Senpai may finally notice me;) How cheeky. \\n\\n\r\nHope you enjoyed my review :)",
            "date": "2015-07-01T01:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 191886,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4696580.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MattTheLad",
                "username": "MattTheLad"
            },
            "url": "https://myanimelist.net/reviews.php?id=191886"
        },
        {
            "content": "Hello all! I am new to the anime reviewing front, but I am going to try to do my best at reviewing this anime. I started out just thinking this would be another basic harem anime with the same characteristics in the characters, the same plot, the same school setting, and the same old ending. This anime was actually quite different, the plot was extremely different from any other harem I've seen and was very enjoyable, although, somewhat predictable. The introduction to the 2 types of people: saviors and kuromas, was a very cool concept in my opinion. \r\nNow I'll get down to the actualreview.\\n\\n\r\nStory: I found the story to this anime very good. It included a lot of aspects quite a few animes neglect to add, such as flashbacks and others. Not only was the story good, but it has the watcher wanting to come back for more and more. The ending was the icing on the cake, a perfect finale, finishing the anime perfectly. My rating for story: 10/10\\n\\n\r\nArt: I found the art of this anime exceedingly good for such a small-time anime studio such as Diomedea ,check them out, they have much other good anime, and the fight scenes for this anime was excellent. The camera angles and character art could have been better at times, but was all around good. I give it a 8.5/10 (I'll give it a 9 for the benefit of the doubt)\\n\\n\r\nSound: The OST for this anime was very decent, I am not going to say I liked any of the songs other than the intro. 7/10 not bad, but could be improved, especially fight scene music.\\n\\n\r\nCharacter: The main protagonist in the anime is a very well made character, and I loved seeing him in the anime and how he reacted to certain things. BUT one of the other main characters, I found absolutely annoying and certainly taking away from the anime. 6/10 they could have definitely added some spice to the other characters.\\n\\n\r\nEnjoyment: I enjoyed this anime, thoroughly.  After what seemed like every episode, it would leave you with the feeling of wanting to see more. I will definitely re-watch this anime in the future. 9/10 very good\\n\\n\r\nOverall: With everything I've just said in consideration, I rank this anime with an overall score of 9, I was going to give it 8, but the whole point of anime is to enjoy it, and I certainly enjoyed this one. I think if a few things were improved this could be an iconic anime everyone needs to see.",
            "date": "2016-01-06T19:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 207936,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4953540.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Puritenda",
                "username": "Puritenda"
            },
            "url": "https://myanimelist.net/reviews.php?id=207936"
        },
        {
            "content": "\"It's amazing how much destruction one person can cause\".\r\nStory 7.5/10\r\nI actually love the story. It has its own greatness. The plot revolves around Haimura Moroha a young boy who inherited 2 past lives and goes to private high school with the concept of \"saviors.\" Saviors are known as people who possess awakened memories of their past lives. There are two types of saviors: one who fight using weapon and one who fight using magic. Normally, every person only has one past life. But in the case of Haimura is completely different. One of his past lives is known as Kensei Flaga, the strongest knight thatever lived with his divine sword \"Salatiga\". On the opposite, his other life is as Shu Saura, the most powerful Dark arts user. Different than Kensei Flaga who uses his power to protect the country by fighting off nations by himself. As Shu Saura was described to be incredibly powerful, of having razed many nations, resulting in the deaths of many, which gave him the title King of the Netherworld. But even the strongest always have a weakness. Nightmares befall to the two of them before it can reach a happy ending. They couldn't save the girl their love the most. Now, with 2 past lives, Can Homura prevent the story from repeating itself? Can he protect his friend this time? With those 2 past lives powers he had obtained, can he change his future? \\n\\n\r\nArt 5/10\\n\r\nThe only one weakness in the anime is the art. But it's not really the worst. Still acceptable though. Just don't expect too much. For me, I still find it quite good and not really bother me that much though. Well maybe you want to see it for yourself to judge the anime art.\\n\\n\r\nSound 7/10\\n\r\nSound really play important part in this series. I found that the Op is great and when the right time comes, you will found the sound for this anime is marvelous and simply fantastic.\\n\\n\r\nCharacter 8/10\\n\r\nOne of the keys to the success. Producer is sure genius to make such a great character's development. It teaches me to think outside the box. Each character has place in both the serious and the silly contexts of the story and humor and plot are blended well throughout the episodes. You need to see this for yourself. I'm quite sure you will be enticed by all the characters. \\n\\n\r\nEnjoyment and Overall 7/10\\n\r\nThis anime is fantastic. The concept that has been brought to the anime is great. No wonder I will rewatch this anime back though. The main storyline put me in uneasiness as the story goes on but I miscalculate it. It just great but not flawless. But, the anime also lack some aspect with made it's not really masterpiece but nearly to it. I kind of enjoy the story overall. Not waste of time to give it a shot. I prefer to give the series as a fine piece. For some reasons, I can't. Because I'm expecting more from the series. I actually kind of hard to give a good mark unless there are some few point in the series that I see deems the worth. This series never enough for it to approach average, but certainly enough to keep it from being one of the all time greats. This is what makes this a potentially polarizing experience. The series still highly entertaining experience for fans of fantasy and action for this season. Still, I recommend this. I'd recommend it any day, for anyone who wants to watch Op main lead, good story and interesting characters to be explored.",
            "date": "2015-09-12T22:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 198452,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4465109.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/End",
                "username": "End"
            },
            "url": "https://myanimelist.net/reviews.php?id=198452"
        },
        {
            "content": "ill first say that alot of people will be surprised with what i give this anime but honestly i hella liked this anime\r\nStory: so this story is about Moroha who goes too this school not even like a couple of minutes in we meet Satsuki and Shizuno who Moroha knew in a former life he knew Satsuki as this knight who went on many journeys well him in that and she was the younger sister and he knew Shizuno he saved her from slavery and they ended up married as in his former life he was a ruler or a bad guy you could saybut the story is about this life where he is pretty much a nice and awesome guy (not spoil anything else)\\n\\n\r\nArt: art was very good nothing too really complain about\\n\\n\r\nSound: Again same as art the OP and ED weren't that great but did end up liking the OP later on \\n\\n\r\nCharacter: now with this ill only be going into the male lead and the 3 girls Satsuki, Shizuno and Elena. Now with Moroha he had 2 former lives one with Satsuki where he was a knight and her big bother and also with Shizuno where they were married and ruling now i liked this guy for many reason most being the stuff that would happen with him and the girls just also the action with him was good too. Satsuki is your typical hyper and energetic girl in a anime she would always cling to the Moroha in the most nice ways she never bother me at all. Shizuno is this nice but also cold person she really doesn't open up about what happen until later in the anime but she is a good character. Elena is a russian girl who doesn't show until midway through the anime Moroah helped her as she thought she always had a bother but didn't so when Moroah helped she (of course) went right for his love she is a decent character\\n\\n\r\nEnjoyment: i personally hella enjoyed this anime from the action that was amazing to some of the side characters too Moroah getting into situations with the other three girls\\n\\n\r\nOverall: im giving this a 9 yes im giving it that rating my review should honestly reflect that even though that sure its a typical anime and so are the characters and the harem but hi i freaking enjoyed this the comedy was very good so was the action also there is ecchi so be aware but man the comedy was gold",
            "date": "2016-11-08T22:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 233462,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=233462"
        }
    ],
    [
        {
            "content": "Okay so to start with, for me this is one of the more unique and memorable high school-harem and ecchi kind that i have watched, for me i loved the story and I think that the past lives memories idea was fresh and cool. The fight scenes were also plenty and were pretty good.\r\nFor the main characters,\r\n-the main lead is the OP and kind type\r\n-his energetic and chirpy sister from his past live \r\n-his lover from another past live of whom he has saved from slavery\r\nTo add on, the ost and soundtracks were simply epic.\r\nAll in all, in my personal opinion this anime is definitelyworthwhile watching and i have enjoyed it a lot, I also think that the story has more potential and it can be developed further.\\n\\n\r\nBtw this is my first review so bear with me please and this is purely my own personal opinion!!!",
            "date": "2017-06-23T07:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 250753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6306625.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_IneedAnime_",
                "username": "_IneedAnime_"
            },
            "url": "https://myanimelist.net/reviews.php?id=250753"
        },
        {
            "content": "Im bored with this caracter satsuki Retard , overal i hate chara like satsuki , i dont know why i hate this chara , i feel so bad person , MC goblok , Suck oppai for stasuki , just delete chara satsuki make this anim great again , Harem retard ya thia anim , idon care about u creati this chara , but i so fking hate this chra like a sh*t\r\nWhat’s astounding about some of World Break’s characters is that, despite the large focus on the past, there is very little learned about any of them. And not just in the sense that theirpast lives are filled with nothing, for that is partially true, too. Satsuki’s only claim to fame is being Moroha’s past sister. That’s it. She isn’t strong, she isn’t fast, and she isn’t even friendly. Her personality is as one-dimensional as it comes, with her being extremely clingy and defensive of anyone getting close to her loving brother. Moroha doesn’t fare much better, either. They make passing references to his relatives’ deaths at some point in his life, as a means to demonstrate that he is “unable” to protect the ones he loves. But outside of one, one-second clip, they’re importance is insignificant. His past lives are also filled with improper explanations concerning who he is as a person; all that is shown for the longest time is that he is a really strong guy. In a way, his obtuse lack of characterization defines him as someone without a past, as a boy whose only prevalent feature being the remembering he does on a semi-frequent basis. And looking at nearly anyone else besides these two shows a glaring issue: nobody is given their past. Again, when a core facet of the anime isn’t even applied to the majority of the cast, it only serves to\\n\r\n weaken its overall value.",
            "date": "2019-03-15T13:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 303590,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6992646.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/katonavelin",
                "username": "katonavelin"
            },
            "url": "https://myanimelist.net/reviews.php?id=303590"
        },
        {
            "content": "Okay, I have watched A LOT of anime in my short time, but I HONESTLY don't know what to make of this show. It had some interesting concepts, and though those concepts were not executed particularly well, I can honestly say it wasn't BAD. Each episode held my interest, and though I frequently wondered WHY I was watching this show (especially at the beginning), I wasn't really disappointed. And the humor, the humor was actually REALLY good (and the accents SO fake). This show is so campy, so if you like unexpected and sometimes cheesy humor, this show is right up your ally.\r\nIf you needsomething to fill the gap, something amusing that shouldn't be taken too seriously, or something just to laugh at, this show is what you're looking for. But if you just came down from an awesome anime that was almost perfect in every way (like Code Geass or Fullmetal Alchemist), you might want to reconsider.\\n\\n\r\nOn a side note, I really like the Opening.",
            "date": "2016-03-24T23:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 213982,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4656398.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/yesterdaz",
                "username": "yesterdaz"
            },
            "url": "https://myanimelist.net/reviews.php?id=213982"
        },
        {
            "content": "It's an idea most of us think about from time to time. What if we retained some memories from a past life? Or how many times have we explained a skill we have to us simply being good at it in a previous life. It's a childish thought since we have now real way of finding out the answer. So it lives a fantasy and nothing more. This show, however, decided to show what could happen if we could retain memmories from a past life as well as their skills. It's also an ecchi/harem show....... God help us now.\r\nStory: 6\r\nSo surprisingly, for being a ecchi/harem,this show actually manages to tell a story. Too bad its not really interesting in any particular fashion. The story focuses on kids who have come to realize they remember previous incarnations of themselves and are now being trained to harness their old selve's powers and abilities to fight demons and monsters. One among them is Kimito, I mean Moroha    (Mor-aw-ha), who just so happens to be Jesus Christ, I mean gifted with two different past lives with two very different sets of abilities.\\n\\n\r\nIf it's not clear by now, this show acts a lot like SAO in terms of story-telling. It may turn out to be another one of those instances where the setting can be changed and there will be a show title tto go with it. It may be unfair to compare it as such but the similarities are to uncanny. The main character is a gifted individual with abilities unlike any other can match. He goes around solving other people's problems for them and in return women fall for him without a second thought. The story is broken up with set pieces where the side characters attempt to solve it themselves but it all ends with the MC arriving on scene to deal the final blow. I think the only difference here is that World Break starts with two girls already wanting the MC's wiener.\\n\\n\r\nI liked the concept well enough, but there had to be a more entertaining way of going about this story then just having a Jesus and his bitches going through life. Moroha seriously one shots/combos practically anything he fights because he *poof* remembers more from his past so he can cast a stronger spell to trump the offensive or be reminded of just how skilled with a sword he should be so as to be above the opponent. That's not growth of a character, that's cheating. It's lining your hand with a bunch of joker cards when you play poker.\\n\\n\r\nArt and Sound: 6 and 7\\n\r\nFollowing up on the average parade, here we talk visuals. There isn't anything spectacular that really grabbed me about them. Which isn't a bad thing. The particle effects were pretty nice but then it doesn't anything interesting for monster designs. We had a pile of giant snakes, two blobs, and a dragon. Once again I say they were average and that isn't a problem. The art is much like the office guy at work. He comes in, does his job, and clocks out and while you notice him there while at work, you will never remember his name after you leave.\\n\\n\r\nSound is in a better position in my opinion. To start with, the opening theme is stuck in my head simply because i have never heard a song quite like it before. It's actually kind of hard to describe in terms of quality. The ending too. The sound effects were nice and smooth and the voice acting was never annoying or terrible although I can't speak in favor or against the accents used to depict the different nations. It's the Infinite Stratos situation where they decided to show case the super power nations (or at least the ones that people can name in the first ten seconds) and wanted to have voice actors with unique accents to those of the nation they represent. In IS, they were hammy and stereotypical, but here I can't say either way. I enjoy stuff like this because it makes the characters feel more unique as long as is doesn't make them sound silly.\\n\\n\r\nCharacter: 7\\n\r\nIt's weird to look at these characters and try and figure them out beyond the \"Must bone Jesus\" motive. Like I said before, these character all retain memories from previous incarnations of themselves. So they will sometimes act in the manner they had back in the day. So pin pointing who's character we are dealing with can become tricky at times. You may be thinking \"But if they are the same person, shouldn't that just serve a trait that is embedded into their personality?\" which is a solid point, but you must remember that there is an era gap between themselves. You wouldn't say you were raised the same way as you your grandparents were, so there would be difference is morals and likes. The only one not effected (too much) by this is the MC himself since he is channeling Jesus Christ 97% of the time. As a whole, these characters aren't bad for only being half unique and half copies of other people. It just makes them complicated. A side character or two are put in the situation of being sitting archetypes which is fine since they are at least archetypes I am fond of, that being the nymphomaniac and the adorable young loving girl. Other than that, I can't say there was a true villain here. Just set pieces for the MC to topple.\\n\\n\r\nEnjoyment: 6\\n\r\nAs far as a concept goes, this was a pretty unique one. Definitely not one I have seen before. I just feels to much like other anime I've watched before, like the aforementioned SAO. So in the end I didn't end up liking it as much. There wasn't anything that really made me go \"Oh shit\" or \"Fucking hell\". Although, there was nothing entirely wrong with it that left me unable or unwilling to continue watching. It follows the path of average-ness and status quo. Much like the forgetful lives that we have lived before as well.\\n\\n\r\nOverall: 6",
            "date": "2017-07-20T23:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 253348,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6061538.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DarkScribe492",
                "username": "DarkScribe492"
            },
            "url": "https://myanimelist.net/reviews.php?id=253348"
        },
        {
            "content": "If your looking for a show that's stupid, but the last episode leaves you dying for more, then this is the one. Now I'm not one to start a show, but stop because it sucks and I didn't with this one.\r\nThe storyline seems to be going somewhere, but it could have progressed more throughout the show. Small flashbacks of the characters previous lives, but not much story is given that leads up to where they are. There are a lot of perverted scenes that throws the show off, but also gives comedy. The show would have been a 10 if only there were more backstoryon the MC's, leaving the last episode the best. It's the only one that give at least a little feel on what the show could be and truthfully after watching it, I'm hoping for more. After this the show gets a 5 until I see another season that leads me to believe differently.",
            "date": "2017-06-16T16:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 250049,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LoveAndJustice",
                "username": "LoveAndJustice"
            },
            "url": "https://myanimelist.net/reviews.php?id=250049"
        },
        {
            "content": "To start with, the shows premise is actually pretty interesting and fairly unique. Using the abilities of ones past lives to do combat through either special weaponry or spells. But they didn't dig much deeper into that concept than the surface level. And the actual plot line of the story is pretty trash. The one good thing about the plot is that it wasn't possible to guess every twist and turn it would take so there was some degree of surprise at times but the individual situations were pretty predictable in how they would turn out. On to characters, aside from the numerous cliché sidecharacter girls who are all but useless in actual combat despite seeming accomplished in their own right. The main character is a walking breathing Deus Ex Machina who can suddenly remember a specific power from his past lives to pull himself out of whatever impossible, shitty situation the author wrote him into. Which really takes the gravity out of a lot of the fights. And he doesn't have any kind of unique personality to speak of. The art work was fairly good, although I fell it didn't look that good when there was high speed movement involved. The music in the show was truly its saving grace and most of the reason I didn't drop it after episode 5. I honestly feel that the music on this show is wasted by being on such a comparatively mediocre product. The music actually managed to make the predicable fights feel more tense and epic. But its good enough for me to listen to it on its own. The ending for the show also seemed very rushed and didn't feel as epic or satisfying as I figured the author was going for. In a nut shell this is a show with a decent but not fleshed out premise, crappy plot, terrible characters, decent artwork, amazing music, and nothing else notable about it. Its a show you can defiantly go without watching or watch just for the music.",
            "date": "2017-01-19T07:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 238633,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5104941.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Pokemonbro",
                "username": "Pokemonbro"
            },
            "url": "https://myanimelist.net/reviews.php?id=238633"
        },
        {
            "content": "Action Total Score: 55/100\r\n-Art Style: 13/20\r\nFairly okay, nothing special but not god awful either.\r\n-Animation: 11/20\r\nFairly okay, nothing special but not god awful either. Yes I said the exact same thing above.\r\n-Storyline: 8/20\r\nWorld Break is your run-of-the-mill Fantasy Harem anime with a character for adolescent boys to self-insert as. I don't know how much more criticizing I can get than that. Juxtapose World Break to other similar shows such as Gakusen Toshi Asterisk and Kuusen Madoushi Kouhosei no Kyoukan, and you'll be hard pressed to find any differences between them. The only difference that I think World Break brings to the table is that the storybothers advancing past your school setting to a much more grandiose one, i.e. literally saving the entire world from a big bad as the superpower countries get involved as well. That's not to say World Break is different in a good way.\\n\\n\r\nFor context, the MC has the memories of 2 previous lives. Both past lives indicate that he has the raw potential and the ability to become yet another genius in this universe. However, literally all of his fights are only won because he remembered how he managed to overcome an obstacle in his path. I am forced to believe that the MC has no intelligence to think for himself and formulate a plan, but rather to merely rely on luck and his memory to beat some enemy, or to overcome massive numbers of opponents. One word to describe this would be \"Convenience\", because he conveniently remembers how and what to do in the event of a life-threatening situation.\\n\\n\r\nNot to mention the ridiculous levels of power-creep as the show progresses on. Initially he remembers a Level 3 skill while in a duel at school, which some students remark as a rather intricate ability to pull off, leading me to believe that Level 3 is already pretty high up there. By the end of the show, the MC is using Level 13 Dark Arts to slay the big bad. What the hell? How many Levels are there? Never in the show do they describe the difference in Levels or what the Level cap is. Does it increase in magnitude like the Richter scale? These Levels are never explained(?) and it's become difficult for me to take this show seriously as it progressively became more absurd.\\n\\n\r\nThe characters, other than the MC, are not interesting at all either. It is a harem anime and you have women throwing themselves all over the MC, but there are 2 main girls, his sister (I don't think she's related by blood) and some other girl. While I think the other girl can be acceptable as a character, his sister is entirely irrelevant in the show, and she proves to be more of an obstacle than any other enemy faced merely because she is utterly useless, requiring the MC to be extra cautious that the enemy does not attack her. Even when left to her own devices, she is still a bother and an eyesore. Not to mention her constant \"Ehhhh???\" outbursts as she acts as the tsukkomi to the boke (the other girl). My ears did not enjoy the high pitched screams and as such I am more inclined to favour the reserved, quieter other girl.\\n\\n\r\nNotice how I never even once attempt to name the characters? That's because I don't remember a single one of their names, except maybe the MC (Haimura Moroha) because his name gets passed around like the most popular prostitute in town. Everyone in general is forgettable.\\n\\n\r\n-Music: 13/20\\n\\n\r\nAt least the OST is above average, I can tell you that. Dragon Heart is one of the more inspiring instrumentals I have heard in the past year and it never fails to give me some drive to continue whatever chores I was doing. The opening is catchy, but I think I will forget it as time passes.\\n\\n\r\n-Enjoyment: 10/20\\n\\n\r\nWorld Break is disappointing. As a standard Fantasy Harem that comes out every season, it fails to be anything more than that and I am tempted to believe that even the producers were aiming for mediocrity when they were making this show, just to procure enough funds for more innovative projects in the future.",
            "date": "2018-06-21T03:29:00+00:00",
            "helpful_count": 0,
            "mal_id": 281733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4764304.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DR34Memeking",
                "username": "DR34Memeking"
            },
            "url": "https://myanimelist.net/reviews.php?id=281733"
        },
        {
            "content": "ok so this is my opinion, hope ya don't mind, and sorry if the scores ae a bit high, I don't actually have high standards all I need in a anime is good art work and dub XD anyways soo many anime I like most people hate ^^\r\nStory: 9\r\nthe story and plot to me was awesome but I wanted to see more dreams, so the reincarnation/reborn stuff isn't new to me, but not many can pull it off without me going confuzzled :3 I also love how they scare the hell out of me when they almost-kill characters or actually kill em.\r\nArt: 10\r\nThe art wasperfect to me, the art went well with everything there were some flaws I would originally give it 9.6 buut that's not a thing so I just rounded it XD also that dragon was awesome, best dragon I have seen since fairy tail \\n\\n\r\nSound: 8\\n\r\nsoo, the dub and sound effects were AMAZING the dub fit perfectly well with the characters, but there were some flaws, although Satsuki's dub is really loud and annoying sometimes it fits the character, (and the flaws = the Russian accents, oh don't forget British, I was really offended at their British people)\\n\\n\r\nCharacter: 8\\n\r\nOki now characters, these were good, again the British and the Russian is killing meee XD anyways, I would've liked to see more of Shizuno's reincarnation's husband in dreams, since from the intel from the other dreams he's the same as he is in present time! I also love some on the love-hate characters, XD one of them being Shizuno's brother. Anyways I think the characters could've got more character development, it might just be because of the 12 episodes or somethin\\n\\n\r\nEnjoyment: 10\\n\r\nI loved every bit of this, to the artwork to the deaths I was intrigued the entire time\\n\\n\r\nOverall: 9\\n\r\nI loved this anime with all my being, but all anime have flaws theres no such thing as a perfect anime, but it kept me on the edge of my bed the entire time. so overall it gets a solid 9",
            "date": "2017-01-10T16:29:00+00:00",
            "helpful_count": 0,
            "mal_id": 237977,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5971263.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AsunaXI",
                "username": "AsunaXI"
            },
            "url": "https://myanimelist.net/reviews.php?id=237977"
        }
    ]
]