[
    [
        {
            "content": "Sora no Otoshimono: Forte is the second season of the series of Sora no Otoshimono.  Likewise, it's highly recommended you watch the first season before watching this show, as the story in Forte basically picks up immediately after where season one ends.\r\nFor those who don't know what this show is about, it's obviously an ecchi comedy at heart, but do not let this discourage your hopes of finding the foundations of good characters and story.  Sora no Otoshimono has proven last year that the ecchi comedy genre when directed well is one that can create a very endearing story and truly likable castof characters, and Forte as of this year continues with the same excellent direction that its prequel managed to execute successfully. All in all what you have in this series is amazingly epic and genuinely funny comedy, and an interesting story to round things out.\\n\\n\r\nThe story in Forte I feel isn't quite as consistent in quality as it was in the previous season. A few of the episodes exist mainly for the purpose of random (but usually funny) comedy, and don't really contribute very much to the plot. It is also worth knowing that the final two episodes are anime original content, and had weaker character development than some of the other episodes. However, the way Forte introduces the new characters of the series, mainly Astrea and Chaos, was truly a highlight of the series. Generally when Forte shows the viewer in which way the story is headed, it is clear, to the point, and captures emotions during both internal and external conflict beautifully. A point of focus is the fact the Angeloids, normally an emotionless object of servitude towards their master, are changed through Tomoki's kindness and equal level treatment towards them, which in turn develops their emotions for Tomoki, and raises some intrapersonal questions about what rights an Angeloid has under her master.\\n\\n\r\nSpeaking of characters, the characters are generally very good in this show. The three Angeloids, like other classical trios, are endearing individually and together with their varying levels of intelligence, combat abilities, and emotions. The duo Mikako and Suguta are both cunning, yet contrast each other brilliantly with their evil and good qualities respectively, although Suguta gets extra points for promoting the advancement of the story in a number of episodes. The character I enjoyed least personally was Sohara, who didn't feature too much development, and for the most part was just a stereotypical tsundere osananajimi who beats up Tomoki periodically.\\n\\n\r\nSpeaking of Tomoki, a lot of people complain about the protagonist Tomoki being too perverted, but I believe that the show would not be nearly as entertaining without a deliberately flawed protagonist like him. Tomoki is honest in more than one way, and while his honesty is something that his friends can rely on, his blatantly honest acceptance of his perversions as a hormonal teenager is also a refreshing concept in light of the \"perfect\" but boring and ultra lame protagonists that typically accompany your usual harem anime. This type of personality opens up a lot of opportunities for extremely creative and risque comedy.\\n\\n\r\nThe other part of what makes the series of Sora no Otoshimono exceptional is the general production quality.  Forte follows the footsteps of its predecessor appropriately in this way, so it generally should be agreed that the art and sound quality of Forte are simply outstanding. Figures and backgrounds are detailed and colorful, voice acting for every character fits and contributes to the comedy well, and animations are fluid in many different types of scenes, ranging from the opening sequence (two of them!), snowball fights, chibi comedy shenanigans, showdowns in the sky between Angeloids, and of course ending sequence that is unique to each episode. Forte reuses some of the soundtrack that was present in season one, although a few new themes can be heard in the background to suit each important or comedic moment as it happens. In each ED, a different classic Japanese J-pop/rock song is remixed to accompany its paired animation. Anyone who has listened to a lot of old J-rock/pop might get a kick out of that.\\n\\n\r\nWhile a few of the episodes might be mildly not up to expectations of fans of the series, they can be overlooked in light of how many exceptional things this show does. Generally speaking this show does a lot of things really really well in spite of (or because of?) being an ecchi comedy. This is not to say that this show ever slacked on being a legitimately fun ecchi comedy on top of their solid production and story.  If you watched season one, it's pretty hard to miss an exceptionally epic concept like the flying panties. I'll leave it to you to decide, but I believe Forte does no worse in coming up with at least one idea that is equally, if not more amazing than flying panties. For me, becoming a fan of the series was inevitable, given how much I enjoyed it.",
            "date": "2010-12-17T23:49:00+00:00",
            "helpful_count": 112,
            "mal_id": 32834,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/A2ZOMG",
                "username": "A2ZOMG"
            },
            "url": "https://myanimelist.net/reviews.php?id=32834"
        },
        {
            "content": "Story:  the story isn't that special but the when it mixes with the music, characters it just goes, WOW.... it's hillarious when i first read sora no otoshimonos manga, i dropped after the 2nd chapter(regret doing so!!), then i watched the anime just to give it a try and season did not disappoint... season 2 isn't much different from the 1st season except for the addition of a new girl astrea.. the best part about this is the COMEDY... its perverted but really really funny(i'm not kidding)... this isn't just about fan service.... it's seriously funny with all the charaters. all i cansay is, the author is a GENIUS in making comedies, the comedy is better in the anime because the presence of awesome sound!\\n\\n\r\nsound: 10, why? because there's so many ending themes and its hillarious, every episode has a special ending theme.. 2nd reason is because it adds to the comedy... the sound, u just need to watch it for yourself, the comedy scenes will sometimes have this serious music but then again it's comedy..i don't know wht to say, both season 1 and 2 have marvelous op(i prefer season 1's :D).....the music for the action scenes r also good.\\n\\n\r\nart: 7 nothing special here i don't really have anything to say about this part... it's everage, not that bad but also not that good... \\n\\n\r\ncharacter: 10 the setting for the characters is pretty cliche but its hard to find characters which r not cliche...  best character: tomoki...he never fail to make laugh ... most of the time(comedic scene), there will be this chibi tomoki  and serious looking tomoki.. without them, i think the comedy will only be 70% less enjoyable...     sugata sempai, he's the coolest, smartest character in the series(i think) but he's not all that perfect(makes the comedy better)... he's weird, funny and... cool(but still funny!)....he's searching for answers regarding to the 'new world'. most of the time, at the beginning of the episode, he'll talk about the world's hystory with his assistant 'pretty'...\\n\\n\r\nenjoyment/overall: 10, i'm satisfied with almost everything in this series... the art isn't special but still... no complaints...",
            "date": "2010-12-29T08:20:00+00:00",
            "helpful_count": 47,
            "mal_id": 33174,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/74890.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ariffmontel",
                "username": "ariffmontel"
            },
            "url": "https://myanimelist.net/reviews.php?id=33174"
        },
        {
            "content": "Forte basically picks up right where the first series left off, but it's going to be really hard for me to review this since I have such ambivalent emotions about it.\r\nStory: 8/10\r\nIn terms of storytelling style, it basically mimics the first season in that you have a little plot development and a little filler-type comedy mixed into each episode, although I'd say this season is definitely more focused on the overall conflict, which is the mysterious blue-haired angle in Tomoki's dream. My only concern is that since there is more focus on this mysterious angel and about Synapse in general, which leads to a moreserious tone, the comedy and seriousness clash a little bit at times as in some episodes you'll feel like that with such a solemn plot going on, is it really appropriate to have this much comedy? Especially since this anime does have some violence (Nymph losing her wings in the first one was pretty brutal to watch) that seems out of place when mixed with comedy. The pacing was also annoying in that although there is more focus on Synapse, sometimes you'll only get a tiny bit of plot movement in some of the episodes, which is extremely frustrating because it really makes you just want to find out what happens already. Cliffhangers are one thing, but delaying the main plot and making it that slow-paced was definitely a bit frustrating to watch. However, I would say that after episode 7 or so, the series gets really really good all the way to the end and it concludes with a strong finish, which really redeems this series. So to give it a more accurate rating, I would say the first half is a 6/10, and the second half is an 8 or 9.\\n\\n\r\nArt: 7/10\\n\\n\r\nI don't have a problem with the animation itself, but like the first season, there is a ton of chibi, but there's even more in this season to the point that I honestly forget what Tomoki looks like sometimes because you'll have entire episodes where he'll be in chibi. Chibi is cute when used correctly and really enhances comedic effects, but it's definitely overused on Tomoki, even though it's used really well on all the other characters. \\n\\n\r\nSound: 10/10\\n\\n\r\nThe opening and ending themes are awesome as usual, and the music picked for the various moods is also appropriate as well. No complaints here.\\n\\n\r\nCharacter: 10/10\\n\\n\r\nI think Forte did an excellent job with character development. Nymph continues her tsundere growth, and it's really pleasant to watch how much she changes from the first time she enters the show to the very end, where she's a completely different character, and yet retains her core personality traits. Ikaros experiences just as much growth as she learns little by little what emotion is, and what her feelings for her master really mean. Really heartwarming to watch. The other characters remain pretty much the same though, especially Sohara, the Pres, and Sugata; they don't really change at all. But this season did such a great job focusing on Nymph and Ikaros' development that it makes up for the other characters'. \\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nI'm only giving it a 7 since I really didn't like the first half all that much, but the second half was extremely well done, so I definitely enjoyed that part of the series, but the first half was, like I said, a little frustrating to watch. \\n\\n\r\nOverall: 8/10\\n\\n\r\nForte definitely wasn't a disappointment to Sora No Otoshimono fans, though, since I definitely consider Forte to be stronger than the first season, so if you liked that one, go ahead and start this one!",
            "date": "2014-02-19T21:26:00+00:00",
            "helpful_count": 22,
            "mal_id": 133209,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3397505.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kevstuf",
                "username": "Kevstuf"
            },
            "url": "https://myanimelist.net/reviews.php?id=133209"
        },
        {
            "content": "This is now my newly edited review for this anime. As this anime  nears its end, lets get a general review of it: The story is awesome  in a comic way, never mind if it's perverted humor, what's important is that one gets to have a good laugh since, just like from the previous season, it is all about the misadventures of the perverted Tomoki and his never ending quest to peek inside the ladies locker which serves as the main climax of this anime, everything else are side dishes. The action side of it, the one which the angeliods do battle withChaos can be considered as good as well. But, one thing about this anime is it's ending theme...... it doesn't have one, there is a different ending theme for every episode, but it does give it a unique way of ending an episode and  you can really feel the creativeness of the author. The art, I really like the way how the characters were drawn especially  the  female characters in  various attire whether in a bikini,  lingerie, school uniform, normal everyday clothes or in any kinky outfit that you see in some of Mikako's festival scheme, it really look great (and the boobs, too). The sounds, if your talking about the opening theme, I'd say I like it, but the ending theme......I don't like any of it and frankly all of it are corny. The characters...... this kinda gets interesting, from the start, you would have thought that you've already knew the characters from the previous season and you simply rely on what info you get from the newly added, and as you watch the new season of this anime you would have thought that  Astraea was mislabeled as a  \"Close Combat Angeliod\" because of her stupidity, but as the episode progresses she really is  what she is been labeled and she's has made herself part of Tomoki's bunch that adds to the comic relief of the anime , for the other characters, well, I found out that Tomoki is hornier than ever, but I can't dig as to why he didn't bang Ikaros (ep9) when he has the chance, Sohara who is as jealous as ever whenever Tomoki does some perverted things to others rather than to her (co'z she always dream of him doing it to her)  , Nymph, who still has no wings, desires to be Tomoki's servant and hotter that ever despite being flat chested , there is Ikaros who is still a bit of an air head, but now seems to desires to have a deeper relationship with Tomoki, also we get to see the 2 angeliods  observing modesty whenever they get close to Tomoki. The 2 other characters, Eishiro who still longs to discover the so-called \"NEW WORLD\" may have have found it above the sky to where the angeliods came from, thanks to Nymph's dream machine and there is Mikako who is sadistic and always has a lot of schemes to relive her boredom. There is a new comer, Chaos, whom at first I thought  has been defeat by Ikaros, so I guess  the best is yet to come.\\n\\n\r\nFurthermore, the enjoyment of this anime, is fair enough to be rated as \"FAIR,\" the comedy of this anime is enough to make up for any shortfalls, frankly speaking I don't think that an actual end for the main villain, Prometheus would be probable, maybe to Chaos something will. Also,  Deadalus the angel that Tomoki sees in his dream will remain a mystery to him, not surprising since most animes with this kind of genre  always end up with the main villain getting away to fight another day, still it is anybody's guess as to how the author of this anime plans to end it. So overall it's a FAIRLY FAIR ANIME TO WATCH. \\n\\n\r\nTrivia: Do you know that an angel, a heavenly being with wings that we know,  was actually a Nordic (Vikings) concept, called Valkyries it is said that they are responsible to bring warriors who died heroically to Valhalla (the Norse concept of heaven). The concept was adapted by Christians later on during the early middle ages. The idea of an angel with a halo on top  was an Islamic Arab concept, just like the Nordic concepts it is said that the halo that angels wore represent the turban that they wear in heaven, the concept was lather on  adapted by the Christians  also during the middle ages.",
            "date": "2010-10-09T12:21:00+00:00",
            "helpful_count": 22,
            "mal_id": 31222,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mugen900",
                "username": "Mugen900"
            },
            "url": "https://myanimelist.net/reviews.php?id=31222"
        },
        {
            "content": "Ok, this is my first review as you will probably notice, i am not that great in reviewing, but after seeing other reviews i just had to give it a shot, ok so im going to review Sora no otoshimono forte, an anime about a boy that has angeloids, that pretty much sums a lot of it up, but there is more to the story than you think\r\nStory:\r\nThe story is very enjoyable, as i have noticed in the first season and what they are doing now in the second season is that they pretty much have loads of fillers and pointless episodes as some peoplemight call them untill around episode 8, then from then onwards it just gets very good and actiony, the thing is tho that its not a very bad thing, i would really call those episodes fillers or pointless fan service episodes, each of them is very creative in its own way and will always make you laugh your head of. If it wasnt for the ecchi and the comedy then the show wouldnt be as enjoyable as it is. The story overall is very enjoyable nevertheless it is pretty ecchi xD, i like the idea of Angeloids coming from somewhere random and getting into the hands of Tomoki, he is the bggest perv on the planet and with the Angeloids he can do anything, go watch it to find out how he carries on from the first series\\n\\n\r\nArt:\\n\\n\r\nThe art, ahh yes, the art is outstanding, the quality is perfect, th characters look sharp and very well made, the background doesnt lack anything either, the special effect while fighting are still impressive and the bouncing boo** look even better than before, especially in some of the episodes that you get. The face expressions they make are good and over all its very good looking, Tomoki as usually stays in his Chibi form a lot but when he does go all serious he looks very manly and cool.\\n\\n\r\nSound:\\n\\n\r\nhmm the sound is pretty good, nothing outstanding, just the usually, an OP thats pretty good, an ending that is different every episode (i never watch them anyway only saw them to make this review) the sound in the anime is good as well, the sounds effect and explosions sound good, the voice acting is still to a very good standard, i really like that one tune that goes on everytime something evil starts happening, i just love it, it gives you the chills when the song turns on while something bd is happening, makes you go OMG this scene is EPIC.\\n\\n\r\nCharacters:\\n\\n\r\nHmm the characters, we have the same ones as in the first season, all still very enjoyable and funny, especially that Ikaros feelings towards Tomoki have grown even bigger, we also do get to meet 2 new characters, the first one is Astraea, a type Delta Angeloid, shes the strongest in terms of hand to hand combat but has no range weapons, also shes a BAKA, and later on we meet another Angeloid called Chaos, shes a second generation angeloid but i wont give away too much about her because that would be considered a spoiler, we still have my beloved Nymph and her feelings grown stronger, bigger and more clear towards Tomoki as well, shes still the only good loli character in this anime, but she is the ultimate loli,",
            "date": "2010-12-14T09:48:00+00:00",
            "helpful_count": 13,
            "mal_id": 32734,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/342708.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Roofipl",
                "username": "Roofipl"
            },
            "url": "https://myanimelist.net/reviews.php?id=32734"
        },
        {
            "content": "Sora no Otoshimono: Forte.\r\nI've seen plenty of anime, although very few actually made me laugh. I'm actually really cold-hearted. I've never truly cried to any anime, (yes, I've watched clannad) and I rarely laugh while watching anime at all in general.. but this series made me loose it! LOL.\r\nThis show is so incredibly random and it has never ceased to entertain me.. You can honestly NEVER predict what's going to happen and it just makes it all the more entertaining ^_^\r\nThe whole way they set up this show was genius, the characters are all unique, all different in their own \"special\" ways. xD\r\nThis anime isa legend and deserves every single bit of credit it receives. Make sure to watch this, it'll probably be on your list of favourite comedy anime :D",
            "date": "2014-08-30T21:37:00+00:00",
            "helpful_count": 13,
            "mal_id": 158577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3880295.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/crew7",
                "username": "crew7"
            },
            "url": "https://myanimelist.net/reviews.php?id=158577"
        },
        {
            "content": "Sora no Otoshimono Forte is the second season to the hilarious ecchi comedy, Sora no Otoshimono.  Also because it's an ecchi comedy I find it funny that it's only rated PG-13. The series is pretty funny with all it's ecchi jokes and it was a pretty fun watch\r\nThe story picks up right where the first season left off, with the main protagonist, Tomoki Sakurai,trying to get comfortable living with Angeloids. Tomoki continues to have weird dreams and begins to wonder what they really mean.  As the series continues, Tomoki meets more Angeloids sometimes engaging in battle with them while he tries to takedown Synapse. Now the story itself is quite weak because a lot of the episodes are focused on Tomoki being perverted and up to his antics. I'm not saying that the series is bad, in fact a lot of times watching Tomoki finding new ways to be perverted is quite fun to watch. It's just that the story suffers from all the hilarious ecchi comedy moments.\\n\\n\r\nThe art is actually outstanding. The character designs for the Angeloids are amazing and the background is really detailed.  The battle scenes are really well animated and overall the artwork is great\\n\\n\r\nThe sound is good too, nothing outstanding but no complains. The opening is good just like the first season. The ending is always different and the voice actors seem to fit their role. However I cannot go more in depth because I don't pay attention to the technical stuff\\n\\n\r\nAs for the characters.  Tomoki still is the most perverted protagonist who always finds different ways to satisfy himself, some would say he's too perverted and just ruins the series but come on this what the series is about. Now I do admit sometimes I wish he would mature and sometimes his antics get old.  But he's what makes this series Sora no Otoshimono, the way he keeps going out of his way to be perverted just makes the series all the more funnier.\\n\\n\r\n Ikaros is probably the only character which gets any significant development. She slowly starts to develop emotions and starts to realize what \"love\" is. Also she is still the kick-ass Uranus queen who is awesome in battle and makes these battles fun to watch.  Ikaros in general is a pretty well done character. \\n\\n\r\nNow the other characters, Nymph really doesn't get much development.  She is still the most down to Earth Angeloid. However when she ponders about not having her wings I can't help but sympathize with her.  Astraea is probably the weakest of the three angeloids as a character.  She doesn't have much impact but she does help with the comedy and also she is kick ass in battle too. Mikako is still a sadistic student council president who makes all these contests which usually leads to Tomoki going back to his antics and making episodes hilarious. Sugata not only tries to discover new things about Synapse but also advances the story for us. Also Sugata and Mikako both contrast each other with their good and evil qualities. Sohara is always there to punish Tomoki for his perverted ways but she really doesn't have much impact on the series, she seems generic and doesn't usually help the series.\\n\\n\r\nSora no Otoshimono: Forte is really good ecchi comedy which is not for everyone.  I personally thought it was a fun watch but not up to par with the first season.  Tomoki's antics are funny but sometimes they get old and annoying but all in all it's not a bad series.",
            "date": "2010-12-30T14:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 33218,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=33218"
        },
        {
            "content": "'Sora no Otoshimono: Forte' is the sequel to the well received and highly praised 'Sora no Otoshimono'. This season basically takes over where the previous one left off. Despite being a decent sequel which continues the interesting and original plot while delivering good entertainment, I'm beginning to see certain problems in this anime, problems that the makers will have to address immediately in the 3rd season.\r\nFor starters, 'Forte' takes the blueprint of the 1st season and basically does the exact same thing while adding a new character or two and slightly thickening the plot. Right off the bat,  'Forte' starts with an immeasurable amountof ecchi scenes that will keep going for good 3-4 episodes. When you finally get tired of it 'Forte' does a 180 degree turn and jumps into seriousness and starts explaining the plot holes of the 1st season. You think 'great finally some development here' but then the next episode, what happens? Back to ecchi you go. It angered me so much I was ready to punch a hole through my monitor because just when I expected to get some answers pertaining to the angeloids or the Synapse (the world angeloids are from), the makers basically decided to moon their fans and viewers. \\n\\n\r\nIn the first season we get to grips with the concept of angeloids and the 'new world' but in reality not that much is explained about them. It's still not explained in 'Forte'. We still don't know that much about Synapse. Who is its leader? Who's that blue haired angel appearing in Tomoki's dreams? What exacly are angeloids and why are they armed with so much weaponry? We have no idea and the second season doesn't even attempt to answer those questions because it mercilessly keeps throwing ecchi and fanservice at you. \\n\\n\r\nAnother problem is that Tomoki is slowly becoming a shallow character. Not a single episode passes by where he doesn't try to do something perverted. I understand that it's part of his personality but the makers are just taking it a tad too far. He's perverted all the fricking time. Chasing girls and grabbing their breasts is like the only thing he did in 'Forte', seriously. If you were hoping for some kind of a twist and suprising development I'll have to disappoint you. He does NOTHING. Nada.\\n\\n\r\nAnd then of course we have the various plot holes and plot points that were quickly forgotten and never mentioned again. For example, in the 1st season we saw the destruction of Babylon at the hands of Ikaros in her flashbacks but it was never explained why she did it or what exacly happened that drove her to do it. In forte that plot point is completely forgotten. Then we have the 'Uranus system' that Ikaros posseses and her 'Variable wings'. We saw them in action but... what exacly are they? How were they made? Why were they made? Uhm, what's going on? No explanation what-so-ever. 'Forte' is plagued by those problems and the makers need to ease off on the ecchi and fanservice stuff and focus more on the plot if they want this anime to retain its high rating.\\n\\n\r\nCharacters in forte basically do the same thing they did in the 1st season. Tomoki runs around chasing girls like a dog, Mitsuki karate chops him, Eishirou is being a crazy genius and Mikako's still up to her psychotic shenanigans. We have 2 newcomers though - Astraea and Chaos. While I understood bringing in a new villan to the series which is Chaos, Astraea is completely and utterly plot insignificant and pointless. Nymph was already a bit shallow but Astraea was literally made from the same template as Ikaros. And thanks to her, Sora no Otoshimo is now turning into a haremish, love square type anime. What happened to the futuristic supernatural plot straight out of a science-fiction novel? Why aren't the makers focusing on that? I have no idea.\\n\\n\r\nSound and art are as good as in the first season and that's a good thing because now they're the only things that deserve a 10 rating and they're pulling the overall rating up. If it wasn't for the flawless art and the breathtaking soundtrack the overall rating would have been much, much lower.\\n\\n\r\nOverall, 'Sora no Otoshimo: Forte' is the first mess up in the 'Sora no Otoshimono' anime series. There are lots of issues that need to be addressed. This anime has an amazing potential, the plot has immense strength, all the makers need to do is stop messing around and treating this series as a borderline hentai lumbering bore.\\n\\n\r\nI will await the third season in trepidation.",
            "date": "2012-08-15T15:43:00+00:00",
            "helpful_count": 10,
            "mal_id": 69867,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=69867"
        },
        {
            "content": "NOTE: This is my first review. I've debated writing a review on this sequel for a while now. I've wanted to express my feelings for this show but for some reason I have been holding back. After having constant disputes with my friend over this anime, I'm now typing this review.\r\nStory: 2\r\nThe story of Sora no Otoshimono isn't a bad one, but it is the way it's executed throughout the series. Over half of this series consists of episodic fillers with cheesy humor and overused ecchi. Now, I'm not the kind of person who doesn't like ecchi. But with the way it's presented in thisshow with Tomoki's constant pervertedness and dumbness, I just find it unpleasant and appalling. For the last couple episodes of the season, the anime decides to verge off from the usual perverted Tomoki and tries to fit in a story that you probably have already forgotten from season one after the overload of pervert given to you in Forte. Overall, I give the story a 2 mainly because over half of this season isn't even story, and trying to quickly fit it in at the end messed it up.\\n\\n\r\nArt: 6 \\n\r\nThe art is good, I won't lie about that. The ecchi animation is good along with the background setting. The problem with the art for me is the overuse of chibi throughout the series. I found it humorous at certain times, but the amount of chibi used in this show is taken to extremes, which messed with the character development and just aggravated me at certain moments.\\n\\n\r\nSound: 6\\n\r\nNothing bad about it, nothing good about it. The opening and ending were decent, but nothing memorable. Background music was decent, but once again, nothing very good or memorable about it.\\n\\n\r\nCharacter: 2\\n\r\nThe main character, Tomoki, is just a total mess that it is almost embarassing. A perverted young teen who ends up with a harem of angel girls, yet still feels the need to disregard their feelings and spy on other random girls in numerous situations. The other main characters are just typical for any harem, and even their personalities are typical and dull. Ikaros, the one who \"lacks\" emotion, but somehow is gaining it through the wonderful perverted actions of Tomoki. Nymph, the small one who won't admit her feelings to the pervert. And Delta, I think her name is, the \"blonde klutz\" of the anime, who just happens to have an enormous rack and will mess up every possible situation she is in. And then last there is Sohara, the \"childhood friend\", who has been in love with the perverted, almost always chibi, Tomoki, and still is in love with those marvelous perverted moments.\\n\\n\r\nEnjoyment: 2\\n\r\nI just found this anime to be terrible in almost every aspect possible. Now, this i just my opinion though, obviously the majority of MAL likes this show, and I respect that. I just believe that if you look more closely than the ecchi and comedy of the show, you will see how Sora no Otoshimono isn't as great as it could have been. It had potential. But with the overused perverted comedy along with the terrible character development and use of episodic ecchi fillers throughout the season, the potential to be something better than other ecchi/comedy/harem animes was ruined. \\n\\n\r\nOverall: 4 \\n\r\nOverall this anime failed to appeal to my likes. My apologies to those who love everything about this show. This is my personal opinion and please feel free to try and change my views about it. Thanks to everyone for reading my first review.",
            "date": "2013-11-17T16:42:00+00:00",
            "helpful_count": 10,
            "mal_id": 120643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2780297.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Takkyon",
                "username": "Takkyon"
            },
            "url": "https://myanimelist.net/reviews.php?id=120643"
        },
        {
            "content": "I'm not overrating this show, I honestly think it deserves an award. Not only is it drop dead hilarious, it's full of romance, it's got more action in this season, and the plot just got deeper.\r\nThe story picks up around a year after season 1 if I remember correctly. Ikaros and Nymph are still living with Tomoki, and he's grown used to them being around, and then, BOOM. Another angeloid by the name of Astraea appears. Super strong, fast, she's got emotions unlike Ikaros, but the only downside, she couldn't figure out what 2+2 is if her life depended on it. Seriously, they ask herwhat it is, her reply is \"I eat them\". So anyways, she wants to kill Tomoki, serves the douchey master that Nymph escaped from last season, figures, right? Eventually it all gets better though.\\n\\n\r\nNymph hasn't had a master in about a year, and she really wants Tomoki to be her master, so there's that, and Ikaros is still trying to figure out her feelings for Tomoki, while Sohara also has feelings for Tomoki, despite her constant karate chops to his skull. Tomoki is still as perverted as ever, if not more so, although in some of the episodes he can be so serious to a level he could take on anybody in anime history and give them a run for their money, which I liked, because there comes a point where you want to see Tomoki do something other then look up girl's skirts.\\n\\n\r\nThe comedy in this is better then the first season. You get to see the return of Panty-Robo (2.0), Tomoko returns in multiple episodes, the Summer Festival 3 Million Yen tournament returns along with the psycho-gunner who runs the gun booth, and Sohara is still using her lethal right hand on Tomoki whenever he does something despicable. Knowing Tomoki, you know what that is.\\n\\n\r\nAction-wise, there are at least 3 or 4 episodes with really good fight scenes, so more then last season, which I'm happy about, because even though there don't seem to be many of them, they can extend for a good amount of time, and they are really awesome to watch.\\n\\n\r\nBy far this is one of my favorite animes now, and I will be waiting for the day that Season 3 airs in Japan, so please hurry!\\n\\n\r\nHopefully this review helped.",
            "date": "2012-10-25T15:39:00+00:00",
            "helpful_count": 9,
            "mal_id": 75899,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=75899"
        },
        {
            "content": "Never thought I would give a perfect rating to a comedy/ ecchi anime, but this one really deserves it... Just like its prequel, plot develops in an amazing way, keeping me anxious to see the next episode over and over, until it ends!\r\nThis time, two new angeloids are introduced. Tomoki, as before, is able to persuade them with love, eventhough he doesn't know any about it... It's just incredible like he can leave being a pervert for a few moments and get all serious about saving those girls!\r\nI knew this one would be great after finishing the first season... My expectations were surpassed and I'mimpressed\\n\\n\r\n\u2029An unique and original anime like this isn't something you get to see everyday and that's because it's so nice to watch it. One of the funniest from my list, yet so beautiful...\\n\\n\r\nUnderstanding love is really a tough matter... Nymph becomes even cuter after falling for Tomoki, as well as Ikaros. Both try to show it, despite he being a complete pervert...\\n\\n\r\nAnd a lot of things get clear with this sequel: The truth about Synapse, the purpose of creating angeloids and some other strong revelations are show, some of them can even make us question why we are here... It gives us reasons to reflect upon our lives...\\n\\n\r\nI liked the ED themes. Every of them being different from the previous deserves a lot of points. One in particular almost made me die from laughter in here!\\n\\n\r\nArt is gorgeous and I loved all characters, since they're so distinct from each other. Plus, it seemed like Tomoki was in \"chibi mode\" almost the entire anime... Never saw that before on any other work.\u2029And the ending... Just perfect! A trailer from the movie is shown... It got me excited! Will look for it right away!\\n\\n\r\nSo, basically, this was the best comedy anime I've watched so far... It won't let you down, for sure!",
            "date": "2013-09-24T09:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 114105,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=114105"
        },
        {
            "content": "Bias & First Impression:\r\n\tI was excited to see what the new angeloid would bring since the quick appearance in the OVA. I was always amazed at somebody who 'hated' ecchi could actually enjoy this show. I thought for a comedy the plot they had behind the scenes was not half bad either, or maybe the promise behind it is what let me enjoy this type of humor I instinctively try to detest.\r\n\tThe first episode opened with Tomoki singing the first season OP accompanied by a hilarious animation. It was good to bridge between the seasons. When I saw the synapse right away I was ardentthat this would be better than the first season.\\n\\n\r\nAnticipated: 7-8 Good, or Very Good\\n\r\nGave: 7 Very Good (read my bias)\\n\\n\r\nEpisode scores: -,-,-,-,9,6,8,9,9,8,9,7\\n\\n\r\nAnaylsis:\\n\\n\r\nStory-\\n\r\nWe get to see a lot more of the synapse in this one. The evil masters are still playing around, and we get a little more involved in the plot compared to the first season. They managed to mix the comedy and story pretty well. However, for many episodes they clearly divide the two from each other. Yes, despite the fact that the story is good for this genre, it is still this genre. The importance of the events are insignificant in the end, as Tomoki likes his peace and quiet the best.\\n\r\n\tThe majority of the show is still crazy contests between Mikako and Tomoki, and the boys vs. girls fights. I will just say that this will reoccur throughout the season, and after so many times I questioned how I put up with it. Despite the slight redundancy, I was able to enjoy the different situations they could make, even if poor Tomoki can never win.\\n\r\n\tThere is very few actions scenes, only a handful, but they don’t waste any effort in animating it. The battles are not just pasted together, and maintain a rather good level of suspense too. It is essentially at the same level as last season.\\n\\n\r\nCharacters-\\n\r\nThe characters undergo very little development save Ikaros, but that is to be expected as we are involved in the antics of Tomoki and the female cast who tries to thwart his attempts. Nymph stays a worry wart through the show since she does not have her wings, hence no master or real powers. This was disappointing since she was my favorite, but she is still good in the comedy aspect and makes the most of the situation without her wings.\\n\r\n\tThe new character, with as little spoiling as possible, really disappointed me. I expected more from her, but she rarely shows up more than any of the other characters till the very late episodes. I won’t curb anyone’s enthusiasm, but she has very little impact.\\n\r\n\tSugata proves to be a good character this season as he is the only one interested in the synapse and the new world, while the rest of the cast is \\n\r\nsexually harassing and beating each other up. \\n\\n\r\nConclusion:\\n\r\n\tSadistic loli, patsu robots, a parade of porn books, a peeping network, or angeloid battles, this show still has a lot to deliver. If you enjoyed the first season, I may dare to say that this will be better than it. Now if you excuse me I am going to pick up the manga, as my interest has been piqued.\\n",
            "date": "2010-12-18T21:43:00+00:00",
            "helpful_count": 8,
            "mal_id": 32862,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=32862"
        },
        {
            "content": "When I reviewed the previous season of Sora no Otoshimono, I mentioned how much I dislike the ecchi and harem genre and how much I love it. Regardless of how much I love or hate the genres, Sora no Otoshimono Forte once again cements in me that there is hope, and there is some originality to be found in a genre populated by lackluster titles. Now, I’m not explicitly saying that Sora no Otoshimono Forte is absolutely amazing, but I am explicitly saying that taken as a whole, Sora no Otoshimono is probably the best harem/ecchi anime I’ve encountered so far. In many regards itfalls into conventions: but it plays those conventions well and manages to be balanced—especially this second season—in that the serious plot and the comedy are intermixed perfectly.\\n\\n\r\nThe plot of Forte follows our hero, Tomoki, who is targeted by a third Angeloid, this one a girl with tits about the circumference of a truck tire. Her name is Astrea, and she’s a bit of an idiot. Like, severely stupid. But she’s powerful. This doesn’t prove a problem for our hero though as his perverted endeavors continue, this time targeted on Astrea. As Tomoki defeats Astrea with his disgusting habits, his friend Eishiro “dives” into Tomo’s dreams to learn more about the “New World”. Tomoki dreams of an angel girl all the time, and when Tomo and company realize his dreams are directly connected to the Synapse, where the Angeloids’ come from, Eishiro finds it the perfect opportunity to learn more. What he finds is disconcerting and dangerous, but I’ll leave you to discover what that is.\\n\\n\r\nAlso, a second-generation Angeloid, much more powerful than the first-gen’s, attacks; a little loli girl by the name of Chaos who is wearing what appears to be nun clothing. She wants to know what love is.\\n\\n\r\nThe series really divides itself between the serious and comedic quite nicely. And while the serious episodes are pretty good, with a nifty plot that doesn’t really go anywhere; on the comedic side there is some good news. There are some hilarious moments. Just some straight up hilarious episodes really. The episode where Tomoki enters a wrestling tournament using his perverted ability to grope the female contestants he faces is hilarious. The feudal snow fight is pretty funny as well. And of course, these episodes are broken up by Eishiro learning more about the New World.\\n\\n\r\nNow, all of this said, Forte doesn’t have a lot of plot to go with. What it has is a lot of set-up and cool ideas being thrown out, but no resolution at the end. And for many, you can say that the series wrapped up pretty happily and well. But otherwise, the journeys to the New World don’t really go anywhere (especially a part where Eishiro finds a place full of humans in capsules). It gives way to Chaos, the evil nun-sister, and while that’s an entertaining enough plot, I want to learn more about the New World and the Angeloids. I have some niggling feeling they’re aliens. But no confirmation means that’s just speculation.\\n\\n\r\nQuite simply, as far as the series plot goes, it’s positively entertaining. There’s not a lot to complain about really. Tomoki’s attempts at being a pervert are just as creative and funny as you’d expect and I have to applaud anything that makes me constantly laugh at boob fondling. I’ve seen a lot of it in anime, and it never is funny because it’s always staged the same way. But Tomoki manages to do it in such idiotic yet smart ways that you can’t help but laugh.\\n\\n\r\nAs far as characters go, this is where the series is weakest. Tomoki is certainly funny, but he’s just a perverted guy. He doesn’t really develop at all through the entire series. Ikaros develops, in a forced kind of way. Her not understanding what love is but feeling something toward Tomoki is spread across the entire series, but this season focuses on it a lot more. It’s cute and all, but I see no reason for why she loves him. He’s a pervert. It’s not really understood why any of these girls like Tomoki. That’s beside the point though. Ikaros just isn’t very entertaining aside from the occasional cute moment.\\n\\n\r\nAstrea, the newcomer, is another conventional character. The tits with no brain! Amazing! She’s clumsy, stupid, and eats a lot. Nothing to see here. Except tits. Who’d have thought the most powerful of the first-gen Angeloids has tits the size of blimps? Practicality is heaven’s first name!\\n\\n\r\nI am once again drawn to Nymph. She has the most character of any of the main characters. She’s the only one who sort of develops. She wants Tomoki to become her master, and seems to be in love with him as well. Her happiest day is the day that he decides to become her master. At the same time she has to deal with the fact she has no wings and people call her a heap of scrap metal. She’s pretty depressed because she’s so useless, and is searching for a purpose. Sure, she’s the flat-chested one who is constantly thrown aside for the Angeloids with tits, but overall, I find her both an entertaining, engaging, and certainly very cute character. She’s my favorite of the series.\\n\\n\r\nChaos is a pretty cool bad guy. I thought she was pretty badass at first. She wants to know what love is and assumes it is pain and murder. So she kills a lot of animals and wants to murder her sisters to show them her love (her sisters being the other Angeloids). But as the series continues, she becomes the obligatory loli character.\\n\\n\r\nIt’s about time I wrapped this up. Overall, Sora no Otoshimono is my favorite ecchi/harem anime and one of my favorite anime. It’s fun. Sure, it has a lot of problems in the genericism and un-finished-plot-lines department, but overall, it’s entertaining as hell. And I can’t really complain about something a lot if I enjoyed it so much.\\n\\n\r\nI give it my personal recommendation.",
            "date": "2015-05-22T11:23:00+00:00",
            "helpful_count": 8,
            "mal_id": 188498,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188498"
        },
        {
            "content": "Boring...way too boring...The story (hell even any story exist at all in this anime?) is slooooooowly moving forward with a mentally retarded and way too perverted \"hero\".\r\nIt`s ecchi, so be a pervert is fine until some point...but here somehow is not...and he is too dumb if we talking about his dreams..Luckily his friends hold his hands all the times, so he can move forward and slowly (again too slowly)realise what`s going on..but it`s too slow...Can`t recommend to anyone, you can find much better animes in this genre...(sad, because the 1. season was not sooo bad...slow too, but a bit better)",
            "date": "2011-07-21T13:45:00+00:00",
            "helpful_count": 7,
            "mal_id": 39669,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/cateran100",
                "username": "cateran100"
            },
            "url": "https://myanimelist.net/reviews.php?id=39669"
        },
        {
            "content": "The second season of heavens lost property. As i said in my review for season 1, if you like comedy, romance and even some action, this anime is for you! Just make sure you watch season 1 first. This season was just as amazing as season 1, but i did wish there was more of this show. To me, by the end i really felt the need for more! i hope some time in the future they make a season 3. (but they do at least have a movie also!) So to shorten this review, Yes i recommend this anime! The rest of this reviewwill be the same as my review for season 1. \\n\\n\r\nstory-The story still manages to be very good and steady, throw in some heavy comedy, awkward situations and a good character cast, you have heavens lost property! 9 for story\\n\\n\r\nart-The art style, it tries something unique and it works! switching back and forth between realistically serious, to funny chibi, to realistically funny. 10 on art!\\n\\n\r\nsound-i give the sound a 10 for the voice cast of both english and japanese versions. they was very well placed and something about the english dub cast just made me laugh so much more. \\n\\n\r\ncharacter- the characters are very dynamic. the cast is well capable of going from funny, to sad, to dramatic in no time flat. this also gets a 9 from me for the characters\\n\\n\r\nenjoyment-this gets a hard 10 from me, from the first episode to the final episode, i loved it. \\n\\n\r\noverall- i give this anime a hard 9, the voices, the characters, the scenarios, the plot, its all so perfect!",
            "date": "2015-12-13T18:17:00+00:00",
            "helpful_count": 7,
            "mal_id": 205473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4267345.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TenshiYoru",
                "username": "TenshiYoru"
            },
            "url": "https://myanimelist.net/reviews.php?id=205473"
        },
        {
            "content": "To be honest, I have seen animes with a worst plot. \r\nSora no Otoshimono: Forte is obviously a comedy but it kept me watching until the end. There is not that much ecchi (I expected much more) but all the satire and the funny scenes made me laugh from time to time.\r\nIt is no more than that, a funny anime, with a little bit of ecchi moments.\r\nIt is also short, so you can enjoy it and stop thinking in your problems or something like that. The seriousness is minimal and Tomoki and his adventures for sure are going to make you laugh at least once.",
            "date": "2019-01-10T14:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 298667,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6574799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/iNVE14",
                "username": "iNVE14"
            },
            "url": "https://myanimelist.net/reviews.php?id=298667"
        },
        {
            "content": "This anime is a one-in-a-kind version!!! Everyday in this wonderful society there is a variety of what goes on in this world! The story behind all of this is quite wonderful, and REALLY heart-touching. Some parts of this story makes you want to cry. I said this a while in my other review but this art.... there is ALWAYS a variety of new art and it is never-ending especially the designs! The characters here are quite wonderful, except for *SPOILER* the President and Sohara (Or whatever her name is) who NEVER minds there business and makes you want to punch them in the face. Asfor the rest, so cute! In the end of this season.... Well let's say there is another cutie. Overall I think this anime is a good anime to start with if you're a newbie in watching anime!\\n\\n\r\nJapanese Translation:\\n\\n\r\nKono anime wa 1· in· a· shinsetsuna bājondesu! Kono subarashī shakai no naka de nichijō no kono sekai de nani ga okotta samazamana mono ga arimasu! Ko no subete no haigo ni aru monogatari wa, hijō ni subarashī, hontōni shinzō ni furete iru. Kono monogatari no ikutsu ka no bubun ni wa, nakitaku naru. Watashi wa watashi no ta no rebyūde wa kono while ga, kono geijutsu i~tsu.... Soko ni atarashī geijutsu no samazama wa tsuneni, sore wa tokuni dezain o owaru koto no naidesu! Koko ni moji* shachō ken Sohara (aruiwa kanojo no namaedesu) nebā soko ni kokoro no bijinesu to wa, anata no kao ni sorera o panchi shitaku naru hito* supoirā o nozoite, hijō ni subarashīdesu. Totemo kawaī kyūsoku-yō to shite! Ima shīzun no owari ni.... Yoku mimashou betsu no kawai ko-chan ga aru to iu. Zentai-teki ni watashi wa kono anime wa, anime o mite no shoshinshanara shite kaishi suru ni wa yoi animeda to omoimasu!",
            "date": "2013-01-02T01:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 82332,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1581225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shigeta",
                "username": "Shigeta"
            },
            "url": "https://myanimelist.net/reviews.php?id=82332"
        },
        {
            "content": "This review goes for both Sora no Otoshimono and it's second season Forte. Sora no Otoshimono is one of the funniest series that I have  ever seen. This series is funny, can get serious at moments, has a terrific cast of characters.\r\nStory: I'll say this, Sora's ANIME has no real plot. Aside from the season finales and a few things that go on in between, there is no real story line. When I watched Sora I accidentally watched it's second season first having no prior knowledge of the first. I wasn't too lost and all the really important things that I needed to knowwere in flashbacks. If you really want plot you should read the manga. It's like the anime but with a bit more things to the plot. (Also the ending of Forte doesn't exactly go with the manga, everything else does as far as I can remember.)\\n\\n\r\nCharacter: I loved loved loved the characters in Sora. The Main Character is a pervert who really makes no attempt to hide it, but also has a heart of gold. The Angeloids are a very fun bunch. All of them are funny in their own way and have 1 thing in common, they're clueless.In fact all the girls in the Sora series was very well done, all of them were funny and enjoyable, from the cunning School President, to the Clueless Angeloid, to the Childhood Friend who keeps him in line, they always keep me laughing.\\n\\n\r\nOverall: Overall the Sora no Otoshimono series was very good and one of my favorite animes. This anime was funny and well done, it has it's dark moments but always keeps you laughing and the lovable characters are just a joy. If you're looking for an anime series that will keep you laughing and you don't mind a little ecchi, or an anime that is just a good ecchi, or just a good ecchi anime in general, watch Sora no Otoshimono. (If you truly want more read the manga.)",
            "date": "2014-07-11T00:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 151491,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3390523.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/giby1",
                "username": "giby1"
            },
            "url": "https://myanimelist.net/reviews.php?id=151491"
        },
        {
            "content": "First of all..this is my first time on this site! Anyway, this is a great anyway. I Never finished this anime until recently and i'm glad i did. After the 2 seasons of this anime i went to read the manga to get further into the plot. Hmmmm everyone else probably said everything about this anime already but the music is amazing, so are the character's voices because it matches them, and the characters are cool. Art is great . Well this story has it all, it has a good story which i find is pretty interesting with the synapse, angels, and if we're actuallyreal. It has a deeper plot aside from all the good comedy. The romance is cute also! But that gets better in the manga since the seasons didn't reach that far yet even though it does have some in the anime.",
            "date": "2011-12-18T10:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 49491,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/chillmochi",
                "username": "chillmochi"
            },
            "url": "https://myanimelist.net/reviews.php?id=49491"
        },
        {
            "content": "(This review will only help people how are planing or have watch this anime, and is just to help them understand the format/style of this anime series.)\r\nThe most powerful weapon is in the hands of the most perverted but with heart of gold student. Yes this is the sequel to one of my favorite anime series. Now I prefer the manga but there are things in the anime that I really like that are not in the manga. If anyone of you have watched the first series you and you liked it are compelled to witch this sequel just because you watched it and youlike it. \\n\\n\r\nSora no Otoshimono: Forte fallows the events of the previous series. As Tomoki continuous perverted ways and teaches freedom, love and wisdom to his angeloids. \\n\\n\r\nVerdict \\n\\n\r\nSo far I have enjoyed this anime best thing about this anime is the comedy and fight scenes. But this anime those not focus on the fight but the daily life of Tomoki and his friends so for those who are looking for fighting anime this is not it. This anime is similar to the Tenchi series and if you likes that series I recommend this to you. \\n\\n\r\nSpeaking of fight scenes Sora no Otoshimono has its moments but not to the extent of action anime, because after the fight build up it will mellow down from hot fight to normal to the next episode like nothing happened the day before.   (Example episode blah action galore, the next episode after that nothing ............... dead blank as if nothing about the fight is mentioned until the some time later with a new enemy arrives that when it is even talk about/ or remembered)     \\n\\n\r\nSo for those thinking of watching this like the first one only focus is the comedy not action. So i hope this helps I'll see you guys next time.",
            "date": "2010-11-07T18:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 31904,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jornalator",
                "username": "Jornalator"
            },
            "url": "https://myanimelist.net/reviews.php?id=31904"
        }
    ],
    [
        {
            "content": "Sora no Otoshimono: Forte is the second season of the series of Sora no Otoshimono.  Likewise, it's highly recommended you watch the first season before watching this show, as the story in Forte basically picks up immediately after where season one ends.\r\nFor those who don't know what this show is about, it's obviously an ecchi comedy at heart, but do not let this discourage your hopes of finding the foundations of good characters and story.  Sora no Otoshimono has proven last year that the ecchi comedy genre when directed well is one that can create a very endearing story and truly likable castof characters, and Forte as of this year continues with the same excellent direction that its prequel managed to execute successfully. All in all what you have in this series is amazingly epic and genuinely funny comedy, and an interesting story to round things out.\\n\\n\r\nThe story in Forte I feel isn't quite as consistent in quality as it was in the previous season. A few of the episodes exist mainly for the purpose of random (but usually funny) comedy, and don't really contribute very much to the plot. It is also worth knowing that the final two episodes are anime original content, and had weaker character development than some of the other episodes. However, the way Forte introduces the new characters of the series, mainly Astrea and Chaos, was truly a highlight of the series. Generally when Forte shows the viewer in which way the story is headed, it is clear, to the point, and captures emotions during both internal and external conflict beautifully. A point of focus is the fact the Angeloids, normally an emotionless object of servitude towards their master, are changed through Tomoki's kindness and equal level treatment towards them, which in turn develops their emotions for Tomoki, and raises some intrapersonal questions about what rights an Angeloid has under her master.\\n\\n\r\nSpeaking of characters, the characters are generally very good in this show. The three Angeloids, like other classical trios, are endearing individually and together with their varying levels of intelligence, combat abilities, and emotions. The duo Mikako and Suguta are both cunning, yet contrast each other brilliantly with their evil and good qualities respectively, although Suguta gets extra points for promoting the advancement of the story in a number of episodes. The character I enjoyed least personally was Sohara, who didn't feature too much development, and for the most part was just a stereotypical tsundere osananajimi who beats up Tomoki periodically.\\n\\n\r\nSpeaking of Tomoki, a lot of people complain about the protagonist Tomoki being too perverted, but I believe that the show would not be nearly as entertaining without a deliberately flawed protagonist like him. Tomoki is honest in more than one way, and while his honesty is something that his friends can rely on, his blatantly honest acceptance of his perversions as a hormonal teenager is also a refreshing concept in light of the \"perfect\" but boring and ultra lame protagonists that typically accompany your usual harem anime. This type of personality opens up a lot of opportunities for extremely creative and risque comedy.\\n\\n\r\nThe other part of what makes the series of Sora no Otoshimono exceptional is the general production quality.  Forte follows the footsteps of its predecessor appropriately in this way, so it generally should be agreed that the art and sound quality of Forte are simply outstanding. Figures and backgrounds are detailed and colorful, voice acting for every character fits and contributes to the comedy well, and animations are fluid in many different types of scenes, ranging from the opening sequence (two of them!), snowball fights, chibi comedy shenanigans, showdowns in the sky between Angeloids, and of course ending sequence that is unique to each episode. Forte reuses some of the soundtrack that was present in season one, although a few new themes can be heard in the background to suit each important or comedic moment as it happens. In each ED, a different classic Japanese J-pop/rock song is remixed to accompany its paired animation. Anyone who has listened to a lot of old J-rock/pop might get a kick out of that.\\n\\n\r\nWhile a few of the episodes might be mildly not up to expectations of fans of the series, they can be overlooked in light of how many exceptional things this show does. Generally speaking this show does a lot of things really really well in spite of (or because of?) being an ecchi comedy. This is not to say that this show ever slacked on being a legitimately fun ecchi comedy on top of their solid production and story.  If you watched season one, it's pretty hard to miss an exceptionally epic concept like the flying panties. I'll leave it to you to decide, but I believe Forte does no worse in coming up with at least one idea that is equally, if not more amazing than flying panties. For me, becoming a fan of the series was inevitable, given how much I enjoyed it.",
            "date": "2010-12-17T23:49:00+00:00",
            "helpful_count": 112,
            "mal_id": 32834,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/A2ZOMG",
                "username": "A2ZOMG"
            },
            "url": "https://myanimelist.net/reviews.php?id=32834"
        },
        {
            "content": "Story:  the story isn't that special but the when it mixes with the music, characters it just goes, WOW.... it's hillarious when i first read sora no otoshimonos manga, i dropped after the 2nd chapter(regret doing so!!), then i watched the anime just to give it a try and season did not disappoint... season 2 isn't much different from the 1st season except for the addition of a new girl astrea.. the best part about this is the COMEDY... its perverted but really really funny(i'm not kidding)... this isn't just about fan service.... it's seriously funny with all the charaters. all i cansay is, the author is a GENIUS in making comedies, the comedy is better in the anime because the presence of awesome sound!\\n\\n\r\nsound: 10, why? because there's so many ending themes and its hillarious, every episode has a special ending theme.. 2nd reason is because it adds to the comedy... the sound, u just need to watch it for yourself, the comedy scenes will sometimes have this serious music but then again it's comedy..i don't know wht to say, both season 1 and 2 have marvelous op(i prefer season 1's :D).....the music for the action scenes r also good.\\n\\n\r\nart: 7 nothing special here i don't really have anything to say about this part... it's everage, not that bad but also not that good... \\n\\n\r\ncharacter: 10 the setting for the characters is pretty cliche but its hard to find characters which r not cliche...  best character: tomoki...he never fail to make laugh ... most of the time(comedic scene), there will be this chibi tomoki  and serious looking tomoki.. without them, i think the comedy will only be 70% less enjoyable...     sugata sempai, he's the coolest, smartest character in the series(i think) but he's not all that perfect(makes the comedy better)... he's weird, funny and... cool(but still funny!)....he's searching for answers regarding to the 'new world'. most of the time, at the beginning of the episode, he'll talk about the world's hystory with his assistant 'pretty'...\\n\\n\r\nenjoyment/overall: 10, i'm satisfied with almost everything in this series... the art isn't special but still... no complaints...",
            "date": "2010-12-29T08:20:00+00:00",
            "helpful_count": 47,
            "mal_id": 33174,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/74890.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ariffmontel",
                "username": "ariffmontel"
            },
            "url": "https://myanimelist.net/reviews.php?id=33174"
        },
        {
            "content": "Forte basically picks up right where the first series left off, but it's going to be really hard for me to review this since I have such ambivalent emotions about it.\r\nStory: 8/10\r\nIn terms of storytelling style, it basically mimics the first season in that you have a little plot development and a little filler-type comedy mixed into each episode, although I'd say this season is definitely more focused on the overall conflict, which is the mysterious blue-haired angle in Tomoki's dream. My only concern is that since there is more focus on this mysterious angel and about Synapse in general, which leads to a moreserious tone, the comedy and seriousness clash a little bit at times as in some episodes you'll feel like that with such a solemn plot going on, is it really appropriate to have this much comedy? Especially since this anime does have some violence (Nymph losing her wings in the first one was pretty brutal to watch) that seems out of place when mixed with comedy. The pacing was also annoying in that although there is more focus on Synapse, sometimes you'll only get a tiny bit of plot movement in some of the episodes, which is extremely frustrating because it really makes you just want to find out what happens already. Cliffhangers are one thing, but delaying the main plot and making it that slow-paced was definitely a bit frustrating to watch. However, I would say that after episode 7 or so, the series gets really really good all the way to the end and it concludes with a strong finish, which really redeems this series. So to give it a more accurate rating, I would say the first half is a 6/10, and the second half is an 8 or 9.\\n\\n\r\nArt: 7/10\\n\\n\r\nI don't have a problem with the animation itself, but like the first season, there is a ton of chibi, but there's even more in this season to the point that I honestly forget what Tomoki looks like sometimes because you'll have entire episodes where he'll be in chibi. Chibi is cute when used correctly and really enhances comedic effects, but it's definitely overused on Tomoki, even though it's used really well on all the other characters. \\n\\n\r\nSound: 10/10\\n\\n\r\nThe opening and ending themes are awesome as usual, and the music picked for the various moods is also appropriate as well. No complaints here.\\n\\n\r\nCharacter: 10/10\\n\\n\r\nI think Forte did an excellent job with character development. Nymph continues her tsundere growth, and it's really pleasant to watch how much she changes from the first time she enters the show to the very end, where she's a completely different character, and yet retains her core personality traits. Ikaros experiences just as much growth as she learns little by little what emotion is, and what her feelings for her master really mean. Really heartwarming to watch. The other characters remain pretty much the same though, especially Sohara, the Pres, and Sugata; they don't really change at all. But this season did such a great job focusing on Nymph and Ikaros' development that it makes up for the other characters'. \\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nI'm only giving it a 7 since I really didn't like the first half all that much, but the second half was extremely well done, so I definitely enjoyed that part of the series, but the first half was, like I said, a little frustrating to watch. \\n\\n\r\nOverall: 8/10\\n\\n\r\nForte definitely wasn't a disappointment to Sora No Otoshimono fans, though, since I definitely consider Forte to be stronger than the first season, so if you liked that one, go ahead and start this one!",
            "date": "2014-02-19T21:26:00+00:00",
            "helpful_count": 22,
            "mal_id": 133209,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3397505.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kevstuf",
                "username": "Kevstuf"
            },
            "url": "https://myanimelist.net/reviews.php?id=133209"
        },
        {
            "content": "This is now my newly edited review for this anime. As this anime  nears its end, lets get a general review of it: The story is awesome  in a comic way, never mind if it's perverted humor, what's important is that one gets to have a good laugh since, just like from the previous season, it is all about the misadventures of the perverted Tomoki and his never ending quest to peek inside the ladies locker which serves as the main climax of this anime, everything else are side dishes. The action side of it, the one which the angeliods do battle withChaos can be considered as good as well. But, one thing about this anime is it's ending theme...... it doesn't have one, there is a different ending theme for every episode, but it does give it a unique way of ending an episode and  you can really feel the creativeness of the author. The art, I really like the way how the characters were drawn especially  the  female characters in  various attire whether in a bikini,  lingerie, school uniform, normal everyday clothes or in any kinky outfit that you see in some of Mikako's festival scheme, it really look great (and the boobs, too). The sounds, if your talking about the opening theme, I'd say I like it, but the ending theme......I don't like any of it and frankly all of it are corny. The characters...... this kinda gets interesting, from the start, you would have thought that you've already knew the characters from the previous season and you simply rely on what info you get from the newly added, and as you watch the new season of this anime you would have thought that  Astraea was mislabeled as a  \"Close Combat Angeliod\" because of her stupidity, but as the episode progresses she really is  what she is been labeled and she's has made herself part of Tomoki's bunch that adds to the comic relief of the anime , for the other characters, well, I found out that Tomoki is hornier than ever, but I can't dig as to why he didn't bang Ikaros (ep9) when he has the chance, Sohara who is as jealous as ever whenever Tomoki does some perverted things to others rather than to her (co'z she always dream of him doing it to her)  , Nymph, who still has no wings, desires to be Tomoki's servant and hotter that ever despite being flat chested , there is Ikaros who is still a bit of an air head, but now seems to desires to have a deeper relationship with Tomoki, also we get to see the 2 angeliods  observing modesty whenever they get close to Tomoki. The 2 other characters, Eishiro who still longs to discover the so-called \"NEW WORLD\" may have have found it above the sky to where the angeliods came from, thanks to Nymph's dream machine and there is Mikako who is sadistic and always has a lot of schemes to relive her boredom. There is a new comer, Chaos, whom at first I thought  has been defeat by Ikaros, so I guess  the best is yet to come.\\n\\n\r\nFurthermore, the enjoyment of this anime, is fair enough to be rated as \"FAIR,\" the comedy of this anime is enough to make up for any shortfalls, frankly speaking I don't think that an actual end for the main villain, Prometheus would be probable, maybe to Chaos something will. Also,  Deadalus the angel that Tomoki sees in his dream will remain a mystery to him, not surprising since most animes with this kind of genre  always end up with the main villain getting away to fight another day, still it is anybody's guess as to how the author of this anime plans to end it. So overall it's a FAIRLY FAIR ANIME TO WATCH. \\n\\n\r\nTrivia: Do you know that an angel, a heavenly being with wings that we know,  was actually a Nordic (Vikings) concept, called Valkyries it is said that they are responsible to bring warriors who died heroically to Valhalla (the Norse concept of heaven). The concept was adapted by Christians later on during the early middle ages. The idea of an angel with a halo on top  was an Islamic Arab concept, just like the Nordic concepts it is said that the halo that angels wore represent the turban that they wear in heaven, the concept was lather on  adapted by the Christians  also during the middle ages.",
            "date": "2010-10-09T12:21:00+00:00",
            "helpful_count": 22,
            "mal_id": 31222,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mugen900",
                "username": "Mugen900"
            },
            "url": "https://myanimelist.net/reviews.php?id=31222"
        },
        {
            "content": "Ok, this is my first review as you will probably notice, i am not that great in reviewing, but after seeing other reviews i just had to give it a shot, ok so im going to review Sora no otoshimono forte, an anime about a boy that has angeloids, that pretty much sums a lot of it up, but there is more to the story than you think\r\nStory:\r\nThe story is very enjoyable, as i have noticed in the first season and what they are doing now in the second season is that they pretty much have loads of fillers and pointless episodes as some peoplemight call them untill around episode 8, then from then onwards it just gets very good and actiony, the thing is tho that its not a very bad thing, i would really call those episodes fillers or pointless fan service episodes, each of them is very creative in its own way and will always make you laugh your head of. If it wasnt for the ecchi and the comedy then the show wouldnt be as enjoyable as it is. The story overall is very enjoyable nevertheless it is pretty ecchi xD, i like the idea of Angeloids coming from somewhere random and getting into the hands of Tomoki, he is the bggest perv on the planet and with the Angeloids he can do anything, go watch it to find out how he carries on from the first series\\n\\n\r\nArt:\\n\\n\r\nThe art, ahh yes, the art is outstanding, the quality is perfect, th characters look sharp and very well made, the background doesnt lack anything either, the special effect while fighting are still impressive and the bouncing boo** look even better than before, especially in some of the episodes that you get. The face expressions they make are good and over all its very good looking, Tomoki as usually stays in his Chibi form a lot but when he does go all serious he looks very manly and cool.\\n\\n\r\nSound:\\n\\n\r\nhmm the sound is pretty good, nothing outstanding, just the usually, an OP thats pretty good, an ending that is different every episode (i never watch them anyway only saw them to make this review) the sound in the anime is good as well, the sounds effect and explosions sound good, the voice acting is still to a very good standard, i really like that one tune that goes on everytime something evil starts happening, i just love it, it gives you the chills when the song turns on while something bd is happening, makes you go OMG this scene is EPIC.\\n\\n\r\nCharacters:\\n\\n\r\nHmm the characters, we have the same ones as in the first season, all still very enjoyable and funny, especially that Ikaros feelings towards Tomoki have grown even bigger, we also do get to meet 2 new characters, the first one is Astraea, a type Delta Angeloid, shes the strongest in terms of hand to hand combat but has no range weapons, also shes a BAKA, and later on we meet another Angeloid called Chaos, shes a second generation angeloid but i wont give away too much about her because that would be considered a spoiler, we still have my beloved Nymph and her feelings grown stronger, bigger and more clear towards Tomoki as well, shes still the only good loli character in this anime, but she is the ultimate loli,",
            "date": "2010-12-14T09:48:00+00:00",
            "helpful_count": 13,
            "mal_id": 32734,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/342708.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Roofipl",
                "username": "Roofipl"
            },
            "url": "https://myanimelist.net/reviews.php?id=32734"
        },
        {
            "content": "Sora no Otoshimono: Forte.\r\nI've seen plenty of anime, although very few actually made me laugh. I'm actually really cold-hearted. I've never truly cried to any anime, (yes, I've watched clannad) and I rarely laugh while watching anime at all in general.. but this series made me loose it! LOL.\r\nThis show is so incredibly random and it has never ceased to entertain me.. You can honestly NEVER predict what's going to happen and it just makes it all the more entertaining ^_^\r\nThe whole way they set up this show was genius, the characters are all unique, all different in their own \"special\" ways. xD\r\nThis anime isa legend and deserves every single bit of credit it receives. Make sure to watch this, it'll probably be on your list of favourite comedy anime :D",
            "date": "2014-08-30T21:37:00+00:00",
            "helpful_count": 13,
            "mal_id": 158577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3880295.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/crew7",
                "username": "crew7"
            },
            "url": "https://myanimelist.net/reviews.php?id=158577"
        },
        {
            "content": "Sora no Otoshimono Forte is the second season to the hilarious ecchi comedy, Sora no Otoshimono.  Also because it's an ecchi comedy I find it funny that it's only rated PG-13. The series is pretty funny with all it's ecchi jokes and it was a pretty fun watch\r\nThe story picks up right where the first season left off, with the main protagonist, Tomoki Sakurai,trying to get comfortable living with Angeloids. Tomoki continues to have weird dreams and begins to wonder what they really mean.  As the series continues, Tomoki meets more Angeloids sometimes engaging in battle with them while he tries to takedown Synapse. Now the story itself is quite weak because a lot of the episodes are focused on Tomoki being perverted and up to his antics. I'm not saying that the series is bad, in fact a lot of times watching Tomoki finding new ways to be perverted is quite fun to watch. It's just that the story suffers from all the hilarious ecchi comedy moments.\\n\\n\r\nThe art is actually outstanding. The character designs for the Angeloids are amazing and the background is really detailed.  The battle scenes are really well animated and overall the artwork is great\\n\\n\r\nThe sound is good too, nothing outstanding but no complains. The opening is good just like the first season. The ending is always different and the voice actors seem to fit their role. However I cannot go more in depth because I don't pay attention to the technical stuff\\n\\n\r\nAs for the characters.  Tomoki still is the most perverted protagonist who always finds different ways to satisfy himself, some would say he's too perverted and just ruins the series but come on this what the series is about. Now I do admit sometimes I wish he would mature and sometimes his antics get old.  But he's what makes this series Sora no Otoshimono, the way he keeps going out of his way to be perverted just makes the series all the more funnier.\\n\\n\r\n Ikaros is probably the only character which gets any significant development. She slowly starts to develop emotions and starts to realize what \"love\" is. Also she is still the kick-ass Uranus queen who is awesome in battle and makes these battles fun to watch.  Ikaros in general is a pretty well done character. \\n\\n\r\nNow the other characters, Nymph really doesn't get much development.  She is still the most down to Earth Angeloid. However when she ponders about not having her wings I can't help but sympathize with her.  Astraea is probably the weakest of the three angeloids as a character.  She doesn't have much impact but she does help with the comedy and also she is kick ass in battle too. Mikako is still a sadistic student council president who makes all these contests which usually leads to Tomoki going back to his antics and making episodes hilarious. Sugata not only tries to discover new things about Synapse but also advances the story for us. Also Sugata and Mikako both contrast each other with their good and evil qualities. Sohara is always there to punish Tomoki for his perverted ways but she really doesn't have much impact on the series, she seems generic and doesn't usually help the series.\\n\\n\r\nSora no Otoshimono: Forte is really good ecchi comedy which is not for everyone.  I personally thought it was a fun watch but not up to par with the first season.  Tomoki's antics are funny but sometimes they get old and annoying but all in all it's not a bad series.",
            "date": "2010-12-30T14:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 33218,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=33218"
        },
        {
            "content": "'Sora no Otoshimono: Forte' is the sequel to the well received and highly praised 'Sora no Otoshimono'. This season basically takes over where the previous one left off. Despite being a decent sequel which continues the interesting and original plot while delivering good entertainment, I'm beginning to see certain problems in this anime, problems that the makers will have to address immediately in the 3rd season.\r\nFor starters, 'Forte' takes the blueprint of the 1st season and basically does the exact same thing while adding a new character or two and slightly thickening the plot. Right off the bat,  'Forte' starts with an immeasurable amountof ecchi scenes that will keep going for good 3-4 episodes. When you finally get tired of it 'Forte' does a 180 degree turn and jumps into seriousness and starts explaining the plot holes of the 1st season. You think 'great finally some development here' but then the next episode, what happens? Back to ecchi you go. It angered me so much I was ready to punch a hole through my monitor because just when I expected to get some answers pertaining to the angeloids or the Synapse (the world angeloids are from), the makers basically decided to moon their fans and viewers. \\n\\n\r\nIn the first season we get to grips with the concept of angeloids and the 'new world' but in reality not that much is explained about them. It's still not explained in 'Forte'. We still don't know that much about Synapse. Who is its leader? Who's that blue haired angel appearing in Tomoki's dreams? What exacly are angeloids and why are they armed with so much weaponry? We have no idea and the second season doesn't even attempt to answer those questions because it mercilessly keeps throwing ecchi and fanservice at you. \\n\\n\r\nAnother problem is that Tomoki is slowly becoming a shallow character. Not a single episode passes by where he doesn't try to do something perverted. I understand that it's part of his personality but the makers are just taking it a tad too far. He's perverted all the fricking time. Chasing girls and grabbing their breasts is like the only thing he did in 'Forte', seriously. If you were hoping for some kind of a twist and suprising development I'll have to disappoint you. He does NOTHING. Nada.\\n\\n\r\nAnd then of course we have the various plot holes and plot points that were quickly forgotten and never mentioned again. For example, in the 1st season we saw the destruction of Babylon at the hands of Ikaros in her flashbacks but it was never explained why she did it or what exacly happened that drove her to do it. In forte that plot point is completely forgotten. Then we have the 'Uranus system' that Ikaros posseses and her 'Variable wings'. We saw them in action but... what exacly are they? How were they made? Why were they made? Uhm, what's going on? No explanation what-so-ever. 'Forte' is plagued by those problems and the makers need to ease off on the ecchi and fanservice stuff and focus more on the plot if they want this anime to retain its high rating.\\n\\n\r\nCharacters in forte basically do the same thing they did in the 1st season. Tomoki runs around chasing girls like a dog, Mitsuki karate chops him, Eishirou is being a crazy genius and Mikako's still up to her psychotic shenanigans. We have 2 newcomers though - Astraea and Chaos. While I understood bringing in a new villan to the series which is Chaos, Astraea is completely and utterly plot insignificant and pointless. Nymph was already a bit shallow but Astraea was literally made from the same template as Ikaros. And thanks to her, Sora no Otoshimo is now turning into a haremish, love square type anime. What happened to the futuristic supernatural plot straight out of a science-fiction novel? Why aren't the makers focusing on that? I have no idea.\\n\\n\r\nSound and art are as good as in the first season and that's a good thing because now they're the only things that deserve a 10 rating and they're pulling the overall rating up. If it wasn't for the flawless art and the breathtaking soundtrack the overall rating would have been much, much lower.\\n\\n\r\nOverall, 'Sora no Otoshimo: Forte' is the first mess up in the 'Sora no Otoshimono' anime series. There are lots of issues that need to be addressed. This anime has an amazing potential, the plot has immense strength, all the makers need to do is stop messing around and treating this series as a borderline hentai lumbering bore.\\n\\n\r\nI will await the third season in trepidation.",
            "date": "2012-08-15T15:43:00+00:00",
            "helpful_count": 10,
            "mal_id": 69867,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=69867"
        },
        {
            "content": "NOTE: This is my first review. I've debated writing a review on this sequel for a while now. I've wanted to express my feelings for this show but for some reason I have been holding back. After having constant disputes with my friend over this anime, I'm now typing this review.\r\nStory: 2\r\nThe story of Sora no Otoshimono isn't a bad one, but it is the way it's executed throughout the series. Over half of this series consists of episodic fillers with cheesy humor and overused ecchi. Now, I'm not the kind of person who doesn't like ecchi. But with the way it's presented in thisshow with Tomoki's constant pervertedness and dumbness, I just find it unpleasant and appalling. For the last couple episodes of the season, the anime decides to verge off from the usual perverted Tomoki and tries to fit in a story that you probably have already forgotten from season one after the overload of pervert given to you in Forte. Overall, I give the story a 2 mainly because over half of this season isn't even story, and trying to quickly fit it in at the end messed it up.\\n\\n\r\nArt: 6 \\n\r\nThe art is good, I won't lie about that. The ecchi animation is good along with the background setting. The problem with the art for me is the overuse of chibi throughout the series. I found it humorous at certain times, but the amount of chibi used in this show is taken to extremes, which messed with the character development and just aggravated me at certain moments.\\n\\n\r\nSound: 6\\n\r\nNothing bad about it, nothing good about it. The opening and ending were decent, but nothing memorable. Background music was decent, but once again, nothing very good or memorable about it.\\n\\n\r\nCharacter: 2\\n\r\nThe main character, Tomoki, is just a total mess that it is almost embarassing. A perverted young teen who ends up with a harem of angel girls, yet still feels the need to disregard their feelings and spy on other random girls in numerous situations. The other main characters are just typical for any harem, and even their personalities are typical and dull. Ikaros, the one who \"lacks\" emotion, but somehow is gaining it through the wonderful perverted actions of Tomoki. Nymph, the small one who won't admit her feelings to the pervert. And Delta, I think her name is, the \"blonde klutz\" of the anime, who just happens to have an enormous rack and will mess up every possible situation she is in. And then last there is Sohara, the \"childhood friend\", who has been in love with the perverted, almost always chibi, Tomoki, and still is in love with those marvelous perverted moments.\\n\\n\r\nEnjoyment: 2\\n\r\nI just found this anime to be terrible in almost every aspect possible. Now, this i just my opinion though, obviously the majority of MAL likes this show, and I respect that. I just believe that if you look more closely than the ecchi and comedy of the show, you will see how Sora no Otoshimono isn't as great as it could have been. It had potential. But with the overused perverted comedy along with the terrible character development and use of episodic ecchi fillers throughout the season, the potential to be something better than other ecchi/comedy/harem animes was ruined. \\n\\n\r\nOverall: 4 \\n\r\nOverall this anime failed to appeal to my likes. My apologies to those who love everything about this show. This is my personal opinion and please feel free to try and change my views about it. Thanks to everyone for reading my first review.",
            "date": "2013-11-17T16:42:00+00:00",
            "helpful_count": 10,
            "mal_id": 120643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2780297.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Takkyon",
                "username": "Takkyon"
            },
            "url": "https://myanimelist.net/reviews.php?id=120643"
        },
        {
            "content": "I'm not overrating this show, I honestly think it deserves an award. Not only is it drop dead hilarious, it's full of romance, it's got more action in this season, and the plot just got deeper.\r\nThe story picks up around a year after season 1 if I remember correctly. Ikaros and Nymph are still living with Tomoki, and he's grown used to them being around, and then, BOOM. Another angeloid by the name of Astraea appears. Super strong, fast, she's got emotions unlike Ikaros, but the only downside, she couldn't figure out what 2+2 is if her life depended on it. Seriously, they ask herwhat it is, her reply is \"I eat them\". So anyways, she wants to kill Tomoki, serves the douchey master that Nymph escaped from last season, figures, right? Eventually it all gets better though.\\n\\n\r\nNymph hasn't had a master in about a year, and she really wants Tomoki to be her master, so there's that, and Ikaros is still trying to figure out her feelings for Tomoki, while Sohara also has feelings for Tomoki, despite her constant karate chops to his skull. Tomoki is still as perverted as ever, if not more so, although in some of the episodes he can be so serious to a level he could take on anybody in anime history and give them a run for their money, which I liked, because there comes a point where you want to see Tomoki do something other then look up girl's skirts.\\n\\n\r\nThe comedy in this is better then the first season. You get to see the return of Panty-Robo (2.0), Tomoko returns in multiple episodes, the Summer Festival 3 Million Yen tournament returns along with the psycho-gunner who runs the gun booth, and Sohara is still using her lethal right hand on Tomoki whenever he does something despicable. Knowing Tomoki, you know what that is.\\n\\n\r\nAction-wise, there are at least 3 or 4 episodes with really good fight scenes, so more then last season, which I'm happy about, because even though there don't seem to be many of them, they can extend for a good amount of time, and they are really awesome to watch.\\n\\n\r\nBy far this is one of my favorite animes now, and I will be waiting for the day that Season 3 airs in Japan, so please hurry!\\n\\n\r\nHopefully this review helped.",
            "date": "2012-10-25T15:39:00+00:00",
            "helpful_count": 9,
            "mal_id": 75899,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=75899"
        },
        {
            "content": "Never thought I would give a perfect rating to a comedy/ ecchi anime, but this one really deserves it... Just like its prequel, plot develops in an amazing way, keeping me anxious to see the next episode over and over, until it ends!\r\nThis time, two new angeloids are introduced. Tomoki, as before, is able to persuade them with love, eventhough he doesn't know any about it... It's just incredible like he can leave being a pervert for a few moments and get all serious about saving those girls!\r\nI knew this one would be great after finishing the first season... My expectations were surpassed and I'mimpressed\\n\\n\r\n\u2029An unique and original anime like this isn't something you get to see everyday and that's because it's so nice to watch it. One of the funniest from my list, yet so beautiful...\\n\\n\r\nUnderstanding love is really a tough matter... Nymph becomes even cuter after falling for Tomoki, as well as Ikaros. Both try to show it, despite he being a complete pervert...\\n\\n\r\nAnd a lot of things get clear with this sequel: The truth about Synapse, the purpose of creating angeloids and some other strong revelations are show, some of them can even make us question why we are here... It gives us reasons to reflect upon our lives...\\n\\n\r\nI liked the ED themes. Every of them being different from the previous deserves a lot of points. One in particular almost made me die from laughter in here!\\n\\n\r\nArt is gorgeous and I loved all characters, since they're so distinct from each other. Plus, it seemed like Tomoki was in \"chibi mode\" almost the entire anime... Never saw that before on any other work.\u2029And the ending... Just perfect! A trailer from the movie is shown... It got me excited! Will look for it right away!\\n\\n\r\nSo, basically, this was the best comedy anime I've watched so far... It won't let you down, for sure!",
            "date": "2013-09-24T09:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 114105,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=114105"
        },
        {
            "content": "Bias & First Impression:\r\n\tI was excited to see what the new angeloid would bring since the quick appearance in the OVA. I was always amazed at somebody who 'hated' ecchi could actually enjoy this show. I thought for a comedy the plot they had behind the scenes was not half bad either, or maybe the promise behind it is what let me enjoy this type of humor I instinctively try to detest.\r\n\tThe first episode opened with Tomoki singing the first season OP accompanied by a hilarious animation. It was good to bridge between the seasons. When I saw the synapse right away I was ardentthat this would be better than the first season.\\n\\n\r\nAnticipated: 7-8 Good, or Very Good\\n\r\nGave: 7 Very Good (read my bias)\\n\\n\r\nEpisode scores: -,-,-,-,9,6,8,9,9,8,9,7\\n\\n\r\nAnaylsis:\\n\\n\r\nStory-\\n\r\nWe get to see a lot more of the synapse in this one. The evil masters are still playing around, and we get a little more involved in the plot compared to the first season. They managed to mix the comedy and story pretty well. However, for many episodes they clearly divide the two from each other. Yes, despite the fact that the story is good for this genre, it is still this genre. The importance of the events are insignificant in the end, as Tomoki likes his peace and quiet the best.\\n\r\n\tThe majority of the show is still crazy contests between Mikako and Tomoki, and the boys vs. girls fights. I will just say that this will reoccur throughout the season, and after so many times I questioned how I put up with it. Despite the slight redundancy, I was able to enjoy the different situations they could make, even if poor Tomoki can never win.\\n\r\n\tThere is very few actions scenes, only a handful, but they don’t waste any effort in animating it. The battles are not just pasted together, and maintain a rather good level of suspense too. It is essentially at the same level as last season.\\n\\n\r\nCharacters-\\n\r\nThe characters undergo very little development save Ikaros, but that is to be expected as we are involved in the antics of Tomoki and the female cast who tries to thwart his attempts. Nymph stays a worry wart through the show since she does not have her wings, hence no master or real powers. This was disappointing since she was my favorite, but she is still good in the comedy aspect and makes the most of the situation without her wings.\\n\r\n\tThe new character, with as little spoiling as possible, really disappointed me. I expected more from her, but she rarely shows up more than any of the other characters till the very late episodes. I won’t curb anyone’s enthusiasm, but she has very little impact.\\n\r\n\tSugata proves to be a good character this season as he is the only one interested in the synapse and the new world, while the rest of the cast is \\n\r\nsexually harassing and beating each other up. \\n\\n\r\nConclusion:\\n\r\n\tSadistic loli, patsu robots, a parade of porn books, a peeping network, or angeloid battles, this show still has a lot to deliver. If you enjoyed the first season, I may dare to say that this will be better than it. Now if you excuse me I am going to pick up the manga, as my interest has been piqued.\\n",
            "date": "2010-12-18T21:43:00+00:00",
            "helpful_count": 8,
            "mal_id": 32862,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=32862"
        },
        {
            "content": "When I reviewed the previous season of Sora no Otoshimono, I mentioned how much I dislike the ecchi and harem genre and how much I love it. Regardless of how much I love or hate the genres, Sora no Otoshimono Forte once again cements in me that there is hope, and there is some originality to be found in a genre populated by lackluster titles. Now, I’m not explicitly saying that Sora no Otoshimono Forte is absolutely amazing, but I am explicitly saying that taken as a whole, Sora no Otoshimono is probably the best harem/ecchi anime I’ve encountered so far. In many regards itfalls into conventions: but it plays those conventions well and manages to be balanced—especially this second season—in that the serious plot and the comedy are intermixed perfectly.\\n\\n\r\nThe plot of Forte follows our hero, Tomoki, who is targeted by a third Angeloid, this one a girl with tits about the circumference of a truck tire. Her name is Astrea, and she’s a bit of an idiot. Like, severely stupid. But she’s powerful. This doesn’t prove a problem for our hero though as his perverted endeavors continue, this time targeted on Astrea. As Tomoki defeats Astrea with his disgusting habits, his friend Eishiro “dives” into Tomo’s dreams to learn more about the “New World”. Tomoki dreams of an angel girl all the time, and when Tomo and company realize his dreams are directly connected to the Synapse, where the Angeloids’ come from, Eishiro finds it the perfect opportunity to learn more. What he finds is disconcerting and dangerous, but I’ll leave you to discover what that is.\\n\\n\r\nAlso, a second-generation Angeloid, much more powerful than the first-gen’s, attacks; a little loli girl by the name of Chaos who is wearing what appears to be nun clothing. She wants to know what love is.\\n\\n\r\nThe series really divides itself between the serious and comedic quite nicely. And while the serious episodes are pretty good, with a nifty plot that doesn’t really go anywhere; on the comedic side there is some good news. There are some hilarious moments. Just some straight up hilarious episodes really. The episode where Tomoki enters a wrestling tournament using his perverted ability to grope the female contestants he faces is hilarious. The feudal snow fight is pretty funny as well. And of course, these episodes are broken up by Eishiro learning more about the New World.\\n\\n\r\nNow, all of this said, Forte doesn’t have a lot of plot to go with. What it has is a lot of set-up and cool ideas being thrown out, but no resolution at the end. And for many, you can say that the series wrapped up pretty happily and well. But otherwise, the journeys to the New World don’t really go anywhere (especially a part where Eishiro finds a place full of humans in capsules). It gives way to Chaos, the evil nun-sister, and while that’s an entertaining enough plot, I want to learn more about the New World and the Angeloids. I have some niggling feeling they’re aliens. But no confirmation means that’s just speculation.\\n\\n\r\nQuite simply, as far as the series plot goes, it’s positively entertaining. There’s not a lot to complain about really. Tomoki’s attempts at being a pervert are just as creative and funny as you’d expect and I have to applaud anything that makes me constantly laugh at boob fondling. I’ve seen a lot of it in anime, and it never is funny because it’s always staged the same way. But Tomoki manages to do it in such idiotic yet smart ways that you can’t help but laugh.\\n\\n\r\nAs far as characters go, this is where the series is weakest. Tomoki is certainly funny, but he’s just a perverted guy. He doesn’t really develop at all through the entire series. Ikaros develops, in a forced kind of way. Her not understanding what love is but feeling something toward Tomoki is spread across the entire series, but this season focuses on it a lot more. It’s cute and all, but I see no reason for why she loves him. He’s a pervert. It’s not really understood why any of these girls like Tomoki. That’s beside the point though. Ikaros just isn’t very entertaining aside from the occasional cute moment.\\n\\n\r\nAstrea, the newcomer, is another conventional character. The tits with no brain! Amazing! She’s clumsy, stupid, and eats a lot. Nothing to see here. Except tits. Who’d have thought the most powerful of the first-gen Angeloids has tits the size of blimps? Practicality is heaven’s first name!\\n\\n\r\nI am once again drawn to Nymph. She has the most character of any of the main characters. She’s the only one who sort of develops. She wants Tomoki to become her master, and seems to be in love with him as well. Her happiest day is the day that he decides to become her master. At the same time she has to deal with the fact she has no wings and people call her a heap of scrap metal. She’s pretty depressed because she’s so useless, and is searching for a purpose. Sure, she’s the flat-chested one who is constantly thrown aside for the Angeloids with tits, but overall, I find her both an entertaining, engaging, and certainly very cute character. She’s my favorite of the series.\\n\\n\r\nChaos is a pretty cool bad guy. I thought she was pretty badass at first. She wants to know what love is and assumes it is pain and murder. So she kills a lot of animals and wants to murder her sisters to show them her love (her sisters being the other Angeloids). But as the series continues, she becomes the obligatory loli character.\\n\\n\r\nIt’s about time I wrapped this up. Overall, Sora no Otoshimono is my favorite ecchi/harem anime and one of my favorite anime. It’s fun. Sure, it has a lot of problems in the genericism and un-finished-plot-lines department, but overall, it’s entertaining as hell. And I can’t really complain about something a lot if I enjoyed it so much.\\n\\n\r\nI give it my personal recommendation.",
            "date": "2015-05-22T11:23:00+00:00",
            "helpful_count": 8,
            "mal_id": 188498,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188498"
        },
        {
            "content": "Boring...way too boring...The story (hell even any story exist at all in this anime?) is slooooooowly moving forward with a mentally retarded and way too perverted \"hero\".\r\nIt`s ecchi, so be a pervert is fine until some point...but here somehow is not...and he is too dumb if we talking about his dreams..Luckily his friends hold his hands all the times, so he can move forward and slowly (again too slowly)realise what`s going on..but it`s too slow...Can`t recommend to anyone, you can find much better animes in this genre...(sad, because the 1. season was not sooo bad...slow too, but a bit better)",
            "date": "2011-07-21T13:45:00+00:00",
            "helpful_count": 7,
            "mal_id": 39669,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/cateran100",
                "username": "cateran100"
            },
            "url": "https://myanimelist.net/reviews.php?id=39669"
        },
        {
            "content": "The second season of heavens lost property. As i said in my review for season 1, if you like comedy, romance and even some action, this anime is for you! Just make sure you watch season 1 first. This season was just as amazing as season 1, but i did wish there was more of this show. To me, by the end i really felt the need for more! i hope some time in the future they make a season 3. (but they do at least have a movie also!) So to shorten this review, Yes i recommend this anime! The rest of this reviewwill be the same as my review for season 1. \\n\\n\r\nstory-The story still manages to be very good and steady, throw in some heavy comedy, awkward situations and a good character cast, you have heavens lost property! 9 for story\\n\\n\r\nart-The art style, it tries something unique and it works! switching back and forth between realistically serious, to funny chibi, to realistically funny. 10 on art!\\n\\n\r\nsound-i give the sound a 10 for the voice cast of both english and japanese versions. they was very well placed and something about the english dub cast just made me laugh so much more. \\n\\n\r\ncharacter- the characters are very dynamic. the cast is well capable of going from funny, to sad, to dramatic in no time flat. this also gets a 9 from me for the characters\\n\\n\r\nenjoyment-this gets a hard 10 from me, from the first episode to the final episode, i loved it. \\n\\n\r\noverall- i give this anime a hard 9, the voices, the characters, the scenarios, the plot, its all so perfect!",
            "date": "2015-12-13T18:17:00+00:00",
            "helpful_count": 7,
            "mal_id": 205473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4267345.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TenshiYoru",
                "username": "TenshiYoru"
            },
            "url": "https://myanimelist.net/reviews.php?id=205473"
        },
        {
            "content": "To be honest, I have seen animes with a worst plot. \r\nSora no Otoshimono: Forte is obviously a comedy but it kept me watching until the end. There is not that much ecchi (I expected much more) but all the satire and the funny scenes made me laugh from time to time.\r\nIt is no more than that, a funny anime, with a little bit of ecchi moments.\r\nIt is also short, so you can enjoy it and stop thinking in your problems or something like that. The seriousness is minimal and Tomoki and his adventures for sure are going to make you laugh at least once.",
            "date": "2019-01-10T14:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 298667,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6574799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/iNVE14",
                "username": "iNVE14"
            },
            "url": "https://myanimelist.net/reviews.php?id=298667"
        },
        {
            "content": "This anime is a one-in-a-kind version!!! Everyday in this wonderful society there is a variety of what goes on in this world! The story behind all of this is quite wonderful, and REALLY heart-touching. Some parts of this story makes you want to cry. I said this a while in my other review but this art.... there is ALWAYS a variety of new art and it is never-ending especially the designs! The characters here are quite wonderful, except for *SPOILER* the President and Sohara (Or whatever her name is) who NEVER minds there business and makes you want to punch them in the face. Asfor the rest, so cute! In the end of this season.... Well let's say there is another cutie. Overall I think this anime is a good anime to start with if you're a newbie in watching anime!\\n\\n\r\nJapanese Translation:\\n\\n\r\nKono anime wa 1· in· a· shinsetsuna bājondesu! Kono subarashī shakai no naka de nichijō no kono sekai de nani ga okotta samazamana mono ga arimasu! Ko no subete no haigo ni aru monogatari wa, hijō ni subarashī, hontōni shinzō ni furete iru. Kono monogatari no ikutsu ka no bubun ni wa, nakitaku naru. Watashi wa watashi no ta no rebyūde wa kono while ga, kono geijutsu i~tsu.... Soko ni atarashī geijutsu no samazama wa tsuneni, sore wa tokuni dezain o owaru koto no naidesu! Koko ni moji* shachō ken Sohara (aruiwa kanojo no namaedesu) nebā soko ni kokoro no bijinesu to wa, anata no kao ni sorera o panchi shitaku naru hito* supoirā o nozoite, hijō ni subarashīdesu. Totemo kawaī kyūsoku-yō to shite! Ima shīzun no owari ni.... Yoku mimashou betsu no kawai ko-chan ga aru to iu. Zentai-teki ni watashi wa kono anime wa, anime o mite no shoshinshanara shite kaishi suru ni wa yoi animeda to omoimasu!",
            "date": "2013-01-02T01:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 82332,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1581225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shigeta",
                "username": "Shigeta"
            },
            "url": "https://myanimelist.net/reviews.php?id=82332"
        },
        {
            "content": "This review goes for both Sora no Otoshimono and it's second season Forte. Sora no Otoshimono is one of the funniest series that I have  ever seen. This series is funny, can get serious at moments, has a terrific cast of characters.\r\nStory: I'll say this, Sora's ANIME has no real plot. Aside from the season finales and a few things that go on in between, there is no real story line. When I watched Sora I accidentally watched it's second season first having no prior knowledge of the first. I wasn't too lost and all the really important things that I needed to knowwere in flashbacks. If you really want plot you should read the manga. It's like the anime but with a bit more things to the plot. (Also the ending of Forte doesn't exactly go with the manga, everything else does as far as I can remember.)\\n\\n\r\nCharacter: I loved loved loved the characters in Sora. The Main Character is a pervert who really makes no attempt to hide it, but also has a heart of gold. The Angeloids are a very fun bunch. All of them are funny in their own way and have 1 thing in common, they're clueless.In fact all the girls in the Sora series was very well done, all of them were funny and enjoyable, from the cunning School President, to the Clueless Angeloid, to the Childhood Friend who keeps him in line, they always keep me laughing.\\n\\n\r\nOverall: Overall the Sora no Otoshimono series was very good and one of my favorite animes. This anime was funny and well done, it has it's dark moments but always keeps you laughing and the lovable characters are just a joy. If you're looking for an anime series that will keep you laughing and you don't mind a little ecchi, or an anime that is just a good ecchi, or just a good ecchi anime in general, watch Sora no Otoshimono. (If you truly want more read the manga.)",
            "date": "2014-07-11T00:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 151491,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3390523.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/giby1",
                "username": "giby1"
            },
            "url": "https://myanimelist.net/reviews.php?id=151491"
        },
        {
            "content": "First of all..this is my first time on this site! Anyway, this is a great anyway. I Never finished this anime until recently and i'm glad i did. After the 2 seasons of this anime i went to read the manga to get further into the plot. Hmmmm everyone else probably said everything about this anime already but the music is amazing, so are the character's voices because it matches them, and the characters are cool. Art is great . Well this story has it all, it has a good story which i find is pretty interesting with the synapse, angels, and if we're actuallyreal. It has a deeper plot aside from all the good comedy. The romance is cute also! But that gets better in the manga since the seasons didn't reach that far yet even though it does have some in the anime.",
            "date": "2011-12-18T10:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 49491,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/chillmochi",
                "username": "chillmochi"
            },
            "url": "https://myanimelist.net/reviews.php?id=49491"
        },
        {
            "content": "(This review will only help people how are planing or have watch this anime, and is just to help them understand the format/style of this anime series.)\r\nThe most powerful weapon is in the hands of the most perverted but with heart of gold student. Yes this is the sequel to one of my favorite anime series. Now I prefer the manga but there are things in the anime that I really like that are not in the manga. If anyone of you have watched the first series you and you liked it are compelled to witch this sequel just because you watched it and youlike it. \\n\\n\r\nSora no Otoshimono: Forte fallows the events of the previous series. As Tomoki continuous perverted ways and teaches freedom, love and wisdom to his angeloids. \\n\\n\r\nVerdict \\n\\n\r\nSo far I have enjoyed this anime best thing about this anime is the comedy and fight scenes. But this anime those not focus on the fight but the daily life of Tomoki and his friends so for those who are looking for fighting anime this is not it. This anime is similar to the Tenchi series and if you likes that series I recommend this to you. \\n\\n\r\nSpeaking of fight scenes Sora no Otoshimono has its moments but not to the extent of action anime, because after the fight build up it will mellow down from hot fight to normal to the next episode like nothing happened the day before.   (Example episode blah action galore, the next episode after that nothing ............... dead blank as if nothing about the fight is mentioned until the some time later with a new enemy arrives that when it is even talk about/ or remembered)     \\n\\n\r\nSo for those thinking of watching this like the first one only focus is the comedy not action. So i hope this helps I'll see you guys next time.",
            "date": "2010-11-07T18:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 31904,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jornalator",
                "username": "Jornalator"
            },
            "url": "https://myanimelist.net/reviews.php?id=31904"
        }
    ],
    [
        {
            "content": "Sora no Otoshimono, as a series with a different 'fabular' base seemed appealing to me, so as soon as I found out there's a sequel, I put it to 'want to watch' anime. And it kept being there until recently. In all honesty, I wish it kept been there for a while longer, as watching it wasn't a good idea. The second season, Forte, is a blast. A negative blast. The amount of fanservice in it was a lot higher than in the first season, which didn't serve the series well. More boobs than common sense... I'm not saying, of course, that fanservice is abad thing, as there were some gems of this kind, but putting basically everything in it and basically emphasizing it to any limits in each and every episode wasn't a good idea.\\n\\n\r\nKeeping Tomoki in 'deformed' form most of the time proved better than everybody would expect, as it helped thinking of the series as some sort of bad joke. Seriously, seeing 'real' Tomoki instead would cause me to drop it after 2-3 episodes.\\n\\n\r\nIdiotism is what keeps on growing in it. And it's the main reason this season went so wrong. Come on, I dare you to watch the series with the brain on its place and not think of dropping it even once. I had a trouble not dropping it with my brain turned off, so you do the math.\\n\\n\r\nLuckily, art wasn't half bad. Graphics weren't any special but I didn't notice any awkward animation or error so I'll give it a solid 5/10. Yes, the only solid rating out of all of the aspects in this anime. For story, I'm not sure I saw one... if there was, it was brutally abandoned in the end, and during the actual show it was lost somewhere between the boobs of main heroines... A new one, by the way, called Astrea, was basically a boost to boobs and idiotism, so I won't bother describing her any longer than that... Oh yeah, for characters I put 2/10 after a long time thinking of putting 1. Even though the characters were pathetic and shallow as hell, Nymph gave off some warmth to save the feeling a bit. Just a bit.\\n\r\nSound wasn't all that noticable, therefore it gets 2/10. It may have been there, may have not, it wasn't any special if there was so it's a bad aspect.\\n\\n\r\nI speak negatively of it, as you may have noticed. It's because I kind of enjoyed the first season. And what they've done to the second let me down so much... Overall, I'll give it a weak 2/10, BECAUSE of Nymph. If not for her, it'd receive a strong 1.\\n\\n\r\nOh, and forgot to mention - even Sekirei was better.",
            "date": "2013-06-03T01:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 99577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2491527.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Nanashi666",
                "username": "Nanashi666"
            },
            "url": "https://myanimelist.net/reviews.php?id=99577"
        },
        {
            "content": "After watching the first season of Sora no Otoshimono it quickly became one of my favorite anime, which made me excited to move on to the second season: Forte. This season offers a bit more action, but still delivers the same raunchy ecchi comedy and good character drama that I loved in the first season. The only notible change is that this time around, the story tackles more of the \"bigger picture\" of the angeloids and adds more action than the previous season.\r\nI'm going to be writing this review with the knowledge of already having watched the first season of the show, so if youhave not seen season one, go watch it.\\n\\n\r\nStory (8). Like I said earlier, the story doesn't stray too far away from the shows formula of ecchi comedy and human drama with some action. However this time there's alot more action, along with the same antics that we saw previously. The action scenes were gorgeous and very unique, seeing the Angeloids fight was really cool and the fights never dragged on or felt rushed. The action itself was very entertaining as well and I always got hyped when there was a battle going on. The story still offers plenty of ecchi comedy that I found funny as ever. The human drama is explored more as well, Tomoki's relationship with Ikaros, Nymph, Sohara and the newly introduced Astrea, were center stage at some points over the 12 episodes. I do wish I saw more of this though, at some points I feel like the story kinda pushed it aside when it's one of my favorite things about the show. Tomoki's schemes never cease to entertain me and some of the crazy episodes like the snowball fight, and the boob fishing game were some of the best episodes. They weren't completely out of proportions and they fit the show's tone very well. If you enjoyed the first season, you'll like the story here the same if not more.\\n\\n\r\nAnimation (9). The animation this time around is even better than it was last season. The colors are bright and vibrant, action scenes look smooth and are well animated, and everything appears to have a bright glow to it. The show just looks very pretty. Being made in 2010, the animation to me is very impressive. No sequences came off as dull and it shows the creators really put all their effort into the show. CG effects like the ocean look good as ever, and angeloid weapons like swords or sheilds light up bright and look gorgeous.\\n\\n\r\nSound (7). The sounds of the show itself go without saying, crisp and clean with little to no bugs. The voice acting (in english) was spot on, none of the actors sounded annoying and they all fit their characters well with plenty of emotion and charisma. The soundtrack was decent as well, some new music with recycled music from the last season which I actually liked. As I believe I said in my review of season 1 the music didn't blow me away, but during action scenes or emotional scenes the music fit the mood great. The new opening was good, but I still prefer the previous one anyway. The outro song worked well too, nothing amazing but enjoyable at the least.\\n\\n\r\nCharacters (8). The same cast of season one returns in this season, along with a few new characters that added something new to this season other than just the continued story. The cast of characters is still small, so nobody gets shunned when it comes to screentime. The new protagonist character, Astrea/Delta is a new angeloid who comes down to Earth. She eventually finds herself becoming friends with the group of kids and becomes one of the main characters. She's a fierce warrior but suffers from being, well, an idiot. This brings more humor into the show, and while she is dumb she's still a very entertaining and interesting character. She might come off as annoying at times but I personally liked her. The new antagonist, Chaos, adds some more depth to the show, adding a (tragic) villian who worked well for the story. She wasn't overused and wasn't extremely powerfull or anythig so she didn't take away from the fun nature of the show. She was a good villian and she brought some good action and suspense to the table as well. The other reoccurring characters like Tomoki, Sohara, Mikako, Ikaros and the others, did what they did in the first season just as well. I liked them all the same and loved seeing their drama unfold. The relationships between them was on point as usual and kept me enetertained. They maintained their unique personalities and had good chemistry as they did before.\\n\\n\r\nOverall, my opinion on this show doesn't change, I still like it alot. I'm personally hoping for a season 3 because the show leaves you wanting to see more, for me at least. Forte adds more action and evolves the character drama along with bringing in some new faces. The animation got better and I overall enjoyed it alot. The story isn't groundbreaking and the characters aren't phenomenal but I still have very few complaints. If you liked the first season you'll feel the same way about this one, if you didn't like the first season then this won't really do much for you unfortunatly.\\n\\n\r\nThanks for reading! If you agree with me at all give the review a thumbs up (:\\n\\n",
            "date": "2014-09-15T12:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 160451,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3946361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ImTheRhetorician",
                "username": "ImTheRhetorician"
            },
            "url": "https://myanimelist.net/reviews.php?id=160451"
        },
        {
            "content": "Much like first season, only somewhat better overall. Pretty much the best ecchi anime in existence. Even though this is 8/10, it's 8/8 on ecchi anime scale. Though even the ecchi here isn't totally braindead shallow, it's actually part of our character's personality and it drives most of the comedy. And it's a silly comedy, very silly comedy, very very silly comedy. One of the funniest anime actually. \r\nThe way it utilises the chibi forms is spot on perfect and really adds to the charm. It's amazingly good at balancing its uber-silly side with its serious melodrama side. The new character gets introduced in thisseason, at first she seemed like an archetype stupid bigboob blonde, which just made me sigh. But by the mid/end of the season I totally loved her because she turned out to be such a great character. And that's what Sora no Otoshimono does best is some way, characters. And that's why it's so great. Plot wise is keeps going forward rather slowly, much like first season. It's an interesting plot but I'm keeping my expectations in check, as it never seemed to be too plot centric.",
            "date": "2015-07-11T12:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 193089,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2424123.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Eagleshadow",
                "username": "Eagleshadow"
            },
            "url": "https://myanimelist.net/reviews.php?id=193089"
        },
        {
            "content": "Sora no otoshimono: Forte is the second season of Sora no otoshimono. i recommend watching the first season, Since you need the information given in that season to understand the second one.\r\nSora no otoshimono is a funny ecchi anime with alot of 'Filler episodes' \r\nFiller episodes are episodes with no real story but just random adventures to fill up the spare episodes. \r\nThis anime is a great example for the 'Showoff ecchi' genre. \r\nShowoff ecchi is what we call everything that has to do with ecchi besides love. we could say that Showoff ecchi is the 'perverted/desired' form of ecchi. \r\nThe anime has a weirdcharacter design with the use of 'Chibi'\\n\r\nChibi is a smaller version of the anime character which is used to show off when they are acting childish. This is happening alot and if you dislike this i wouldn't recommend watching this anime in the first place.\\n\\n\r\nSora no Otoshimono: Forte is a 'Random anime' which means that everything is happening out of nowhere. This makes the comedy factor more enjoyable and you will be looking forward to these moments. \\n\\n\r\nNow i will go to the rating part which is my personal experience with the anime, You can have different oppinions.\\n\\n\r\nStory:\\n\r\nThe story of Sora no Otoshimono: Forte is based on the Sci-fi genre. Since it involves unknown creatures called Angeloids. The basic idea of the story is to show that even tough we think the sky is beautifull the angeloids still have a hard time. This is not unique but the way they made this anime is really different from any other. With the use of fanservise i think they did fantastic on the story.\\n\\n\r\nArt:\\n\r\nThe art is really focussed on the main events and lacks in the background work. The art is enjoyable but not the best. \\n\\n\r\nSound:\\n\r\nThe sound is basic not interesting but normal like most animes. again not much work in the background.\\n\\n\r\nCharacter:\\n\r\nThe character work is really focussed on the male crowd. since girls are wearing a lack of clothing most of the time and they are what we call 'Cute'\\n\r\nsince the focus on the crowd is for males i guess that's fine. Great work on feelings and movements of the characters. I dont see any lacking on the characters since all characters are unique. from an evil daughter from a maffia to a sweet angel. they all seem the develope also off scenes which is great since we can see changes in reaction and taught proces.\\n\\n\r\nEnjoyment: \\n\r\nPretty much that is good for me but i accualy prefered that anime was also good for the female crowd. besides that a fun anime ( this is personal for everyone)\\n\\n\r\nOverall:\\n\r\nA hillarious echhifull romantic anime with the use of great character designs and perverted taughts to make a great filler anime for the male crowd.\\n\\n\r\nI recommend it to ecchi lovers and comedy lovers",
            "date": "2013-10-12T14:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 116615,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2611659.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/milanvde",
                "username": "milanvde"
            },
            "url": "https://myanimelist.net/reviews.php?id=116615"
        },
        {
            "content": "Something i love about this show is the characters. There is only one character that i can recall that isn't the villain that i don't like and that's the Pres. But this show for the most part nails all the other characters very well. For example here are the reasons why this Haremi show works \r\nIkaros: likes him cause she spends time with her and goes and of his way to try and make her happy, Was also the first if not one of the first people to actually be nice to her. He also goes and helps develop her. You can see her becomingmore of a character as the series continued.\\n\\n\r\nNymph: Likes him cause he was the one to help her escape a situation where a person is in control of her that is abusive ( Physically & Emotionally) and treats her like trash. He also was the one to help her start making her own decisions after being told what to do all her life.\\n\\n\r\nAstraea: Is actually different cause i don't think she really has any romantic interest in him, But just goes with the flow of conversations and likes that he provides food for her. I'd say she is more of a friend to him then anything.\\n\\n\r\nSohara: Is his childhood friend that was one of her only friends growing up and like the others he does care about stuff happening with her.\\n\\n\r\nHiyori: As stated above is someone who has watched him enjoying time with his friends. They have some of the same interest together and she doesn't even mind that he is a little perverted. She is also one of the few characters that just comes straight out and say \"I love You\" Ikaros does say this later and is in fact the only other character to do so and although she doesn't come straight out and say it i would give it a pass. She had just figured out the feeling he has at that moment.\\n\\n\r\nChaos: Something else this show does really good is that they don't have some little girl wanting to have sex with someone older than them. This is something i see a lot in these. But Chaos is a fun little character that i would have liked if she was in more episodes.\\n\\n\r\nReally this show has such good characters for such a genre and i am surprised. I found out that this was a Ecchi-Harem show and got my hopes down. But this is my favorite one out of the entire genre. \\n\\n\r\nThere is also one last character i want to mention. The female version of the MC. My god do i love that character and wish it wasn't wasted as a tool for some episodes to use. The way she acts the way she looks. I honestly wish at some point in the show she became her own person or even had her own show. It's really surprising to me too because whenever shows have characters turning into opposite genders it's always just for a one off gag and not much thought seems to be put into the character itself. Would have loved it even if the MC was stuck as a girl for more than one episode just cause i really like that character.",
            "date": "2017-07-23T05:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 253550,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=253550"
        },
        {
            "content": "I never expected this anime to get such a good score from me, as the whole thing just seemed all too nonchalant and funny. But it actually had a deep story to it, that, if you look past the pervert-ness of Tomoki, you can really develop something great here. \r\nBut in all seriousness, this may just be one of the funniest anime I've ever seen to date. From the random humor, to the pervert Tomoki, you can't get through an episode without laughing at least once. I think that these type of anime definitely give an ease to the many serious anime out there, andwhile keeping an interesting enough plot line to go with the hectic show.\\n\\n\r\nCharacters were memorable, and i think Ikaros might just be the most attractive anime character I've ever seen.  As well as the plethora of other cute characters in this series. Tomoki, as he can be kinda dense to the signals Ikaros always throws at him, but he definitely made this show much more than what it would have been without.\\n\\n\r\nLike i said before, this anime is deeper than it looks, and i think it's a great show to watch out of the serious shows that are out there. Overall this anime is definitely worth watching, and i really hope this one get's a third season!",
            "date": "2017-01-03T20:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 237381,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=237381"
        },
        {
            "content": "Imagine yourself sitting down on Christmas day, looking at the presents and wondering which one is yours, what's inside, and of course, did you get what you asked for? Now picture yourself getting almost everything you wanted, but you got a lump of coal (or something really undesired), now picture Sora No Otoshimono:Forte before you watch(ed) it, and then think about if afterwards. \r\nForte being the sequel to perhaps one of the funniest animes i've seen in quite some time, is exactly like what i described in the introduction. It's tough for an anime that brought you the hit single \"My Tingling Nipples\" to followup with a just as a good as, or better sequel. \\n\\n\r\nStory: 6/10\\n\\n\r\nThe story around Forte was pretty similar to the first season's, only now instead of Beta, Delta takes her place, once again trying to capture or destroy Alpha. There's nothing wrong with the story as much as it feels like im just watching the first season's story all over just with new characters (for those that have seen Gundam Seed, it's not exactly what Gundam Seed Destiny did, but not far off from it either). The main theme for the season, which is spelled out practically half way through, is the question \"What is love?\" Now if you watched the first season, we all know that Ikaros kissed Tomoki and told him that she \"loved\" him, this is Ikaros' main conflict throughout the whole second season. The problem here is, it's not really known if she ever overcame this conflict or not. The story was surprising original for much of the season, but it totally collapses at the end when Tomoki agrees to become Beta and Delta's master, which basically destroys the reason why he free'd them in the first place, to give them free will to do what they want to do, not what someone tells them to do. This idea of freedom was something i was surprised to see and i was glad the first season stuck to it. But by now taking that away and Tomoki becoming their master, the season no longer was original and became almost an identical replication of Sekirei and became a true harem. Not only this, but the ending is left wide open, with a new angeliod (Chaos) joining the group (as it would appear). The last problem is Ikaros (the main angeliod) playing a surprisingly minor role in this season compared to the last season (with two exceptions being the two fights with Chaos) Take it for what's it worth, but i recommend keeping a major open mind with this season and pay more attention to the comedy, and you'll probably not even notice the major flaws in the story.\\n\\n\r\nArt: 8/10\\n\r\nAs with most animes, the animation was pretty decent, especially the art styles to the angeliods when in combat.\\n\\n\r\nSound: 9/10\\n\r\nThe OST to this anime is pretty good, and the ending theme to this season is really good.\\n\\n\r\nCharacters: 8/10\\n\r\nThere is plenty of character development with the remaining angeliods, and possibly Ikaros (the ending does a poor job portraying if Ikaros ever truely overcame her new found emotions). Adding Delta to the group added quite a lot to the comedy this anime serves to put to out which is a major plus considering she's highly clumsy and is a pretty cute girl (i mean her personality here... the thought of robotic chicks with big boobs doesn't turn me on in the slightest) Beta struggles with understanding what Tomoki meant by finding her own reason to live without having to follow orders, but she never does find the answer since Tomoki ends up being her replacement master anyway (what a shame)...the addition of Chaos half way through also helps Ikaros out by seriously taking a look at what love really is, in her own words. Overall, if you like all the angeliods equally, you won't be disappointed, beware getting too attached to a character though.\\n\\n\r\nEnjoyment: 9/10\\n\r\nThe comedy kept me going throughout the entire season, and is why i watched this series in the first place, Tomoki and his feminine ego Tomoko keep the series alive the whole way through. It's pretty similar to Baka and Test, which was aired pretty much at the same time this season was aired.\\n\\n\r\nOverall: 8/10\\n\r\nAs i said before, the comedy kept it alive and made it well worth watching, but it did feel like a disappointment to me after i finished it (this is the undesired present i was talking about to those who are slow to pick up things). My advice to anyone just starting this season, watch it for the comedy and don't get attached to any particular detail with the story or any particular angeliod. There is a 3rd season currently being made, so perhaps it will provide the closure that this season failed to bring.",
            "date": "2012-12-23T09:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 81036,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1183397.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Venom900",
                "username": "Venom900"
            },
            "url": "https://myanimelist.net/reviews.php?id=81036"
        },
        {
            "content": "After watching the first season, my expectations coming into this one were very high. I found the first season great; however, I was extremely disappointed by Forte. This season consisted of mostly recycled material, boring emotions, and very little development. \r\nSora no Otoshimono is known a lot for its comedic aspects. However, the comedy in this season was reused constantly. Every episode I found myself watching the same old perverted jokes from Tomoki, the same old anger from Sugata, and the same old situations from the other characters. Don't get me wrong -- I love the characters. Unfortunately they were not put to good use.I found myself getting bored of the episodes and skipping to where the story began.  I feel like the anime is comedy up until the last 2 episodes which is when they have the final battle to end the season. The rest of it is just repetitive.\\n\\n\r\nSome other things that were over played were probably the emotions of the characters. Nymph's sadness and Ikaros' love were mentioned in so many episodes. Shows that are mainly romance don't even have as much emphasis as there was on Ikaros' feelings.\\n\\n\r\nThe development was just horrid as well. Throughout the story, characters \"fell\" for Tomoki with very little development involved in this. I've watched harem anime with better romantic plot. Despite it being 12 episodes, more than 75% of it is spent on the recycled comedy I've mentioned above. It'd be fine if this comedy was used to develop the characters' feelings or emotions a little more, but it just gave us emotions we already knew.",
            "date": "2013-07-13T23:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 105251,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/XzoticSpade",
                "username": "XzoticSpade"
            },
            "url": "https://myanimelist.net/reviews.php?id=105251"
        },
        {
            "content": "The whole gang is back with more weirdness and perverseness from before!\r\nThe main plot of the story is more explored in this season. We can have a glimpse to the world of SYNAPSE. The truth about angeloids are slightly revealed. More importantly, the laughter is even better as we get to know the characters even more unlike the previous one where it’s more like an introduction on the story and the characters.\r\nYou will love the characters even more with their own very unique personalities. Plus a new character arrives in this season. The ever so sadistic Mikako who consider people most especially Tomoki as herplaythings yet you can still sense that it’s her own unique way of helping others. The very weird Sugata who loves conspiracy which becomes very helpful as he is the only serious one who investigates what is really happening around them. The irritating girl, Sohara, who still won’t admit her true feelings. Nymph, who lost his previous master and years for Tomoki to be her new master. The arrival of the new girl, Astrea, who is almost all the time hungry. The still very enigmatic, Ikaros. I just love her naivety to almost everything and how she tries so hard to be like a real human. Her innocence is very cute. Let’s not forget the King of all perverted character in the history of anime, Tomoki. He never ceases to amaze me on how perverted he can be. His different ideas of perverseness never stop. I am surprisingly anticipating on what perverted things he will do. The weirdest thing is that all the girls are still head over heels on him which left me so confused and puzzled. Anyway, he can still be so kind, nice, and responsible when it comes to important decisions. Plus, he is one of the most hilarious characters I’ve ever seen.\\n\\n\r\nThe animation is still nice with its unique set-up and the hilarious mini size of Tomoki. Plus, Tomoki’s voice is so perfect for his pervert character. It makes you laugh even more.\\n\\n\r\nThe whole experience while watching this season is really worth it. I laugh my hearts out almost in every episode. Hopefully, we can still see more of the hilarious gang in the coming future.\\n",
            "date": "2012-12-09T07:29:00+00:00",
            "helpful_count": 0,
            "mal_id": 79592,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79592"
        }
    ]
]