[
    [
        {
            "content": "Note: May contain SLIGHT SPOILERS. Nothing too major though. \r\nNow~ to the review!\r\nOther than La Corda, the only other series that I can think of that somehow revolved around classical music (that I've ACTUALLY seen) was Piano. I won't go into that series as I did DO a review for it. Because of the fact that I haven't a series like La Corda before, that caught my attention. And also having classical music as a major theme within the series definitely sparked my interest.\r\nMy first impression of the series was that it just caught my attention because it was a bit different than manyseries that I have seen in the past. And I'll admit that by just watching the OP sequence, you may considered it a harem (this case, a reverse harem = more main guys than girls) anime, which it really isn't. Sure, there are several parts that have slight fanservice, but nothing major at all.\\n\\n\r\nFor me, from just watching the 1st episode, I was hooked and HAD to watch more episodes and I eventually made a fansite for this series, which used to be called 'Musical Secret, but is now called 'Crescendo'. Whether that had anything to do with the ED song being called that, I dunno, but yeah...\\n\\n\r\nWhat I didn't like was that sometimes the animation would be a bit strange and look awkward. For example, in particular, I didn't notice this one thing until Meagi, one of my staff members at Crescendo, sent me a pic from episode 4 where Kahoko's talking to Lili and his feet are facing in the opposite direction to where the rest of his body was. \\n\\n\r\nIn some of the later episodes, many of the character's faces and such just look weird, like the lines were drawn thicker than in earlier episodes. It wasn't that big of an issue, but with the slight inconsistencies was a bit of a turn off. Overall, the animation was decent, but it wasn't uber, uber vibrant but not bland either (well.. that depended on the episode as sometimes the colors looked a bit dimmer in some shots and brighter in others...). Kinda funny considering that they look a lot more vibrant in magazines and such. XD;\\n\\n\r\nA definite strong point in the series was the music. Though I did already have a liking for classical music, because of this series, I've come to like it a whole lot more and that makes me happy. And gee, I never realized how MUCH music there was for the series. I don't even think that I even own it all -- 2+ gigs and there are STILL more CDs. T.T\\n\\n\r\nWith the plot itself, it isn't a complex one, though it did make me wonder if the plot was going to keep my attention long enough. Luckily it did, but the music and the bishies were MAJOR bonuses. In general, the series itself, because of the reverse harem-likeness (as there are many more male main charas than female ones) it gives off is aimed more towards girls, rather than guys. But, any fanservice that even shows up in the series is nothing comparing to other series that have MAJOR fanservice in then.\\n\\n\r\nEven though this series is one of my favorites, there were some episodes that were a bit boring towards the end, say around episode 20, as the episode(s) were a bit boring because Kahoko's all angsty and such and when I found out there was a manga version, I noticed some differences, like in virtually any adaptation that originated from a manga first. \\n\\n\r\nI noticed that some of the events that happened in between the selections were either excluded altogether, modified, or where just different. And also, since the manga itself hasn't finish the concours (from last I looked, they finished the 3rd selection but no word on the 4th and final selection of the concours), so the ending of the concours will be different probably in the manga than in the anime. \\n\\n\r\nI really hope that there is a second season as the series itself originated as a game, than manga, now anime and the anime itself opened the possibility for a second season as it was an open-ended ending. There's a second game, so it's a possibilty that it could happen, but for now it's quite unlikely as the manga isn't done with the concours (aka not enough material for a second season) and if Yuki Kure doesn't adapt the 2nd game into manga form, it'll be less likely than if she did.\\n\\n\r\nOverall, this series was really good and is definitely one of those series that can be viewed again and I won't get sick of it. I can't say that it's one of those 'you'll love or hate it' series, but the first few might be a bit slow at first, depending on the viewer. I enjoyed watching it and I do recommend watching it, or at least give it a try.",
            "date": "2007-05-30T13:51:00+00:00",
            "helpful_count": 116,
            "mal_id": 329,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4423.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/icerydragon",
                "username": "icerydragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=329"
        },
        {
            "content": "STORY (10)\r\nHino Kahoko, a high school girl who has never played an instrument in her life, is given a magic violin. In turn, she must compete in a competition (the Concours) with several elite music students from her school. It's a story about Kaho learning to love the violin and music, while deepening her relationships with her fellow competitors.\r\nThe story is not for everyone. This is a character driven series through and through. The plot loosely falls around the Concours, but the purpose of the Concours is to contribute to character development. That being said, the character development is outstanding. I barely noticed the lackof plot- simply seeing these amazing characters interact and grow had me yearning to see the next episode.\\n\\n\r\nThe story really falls flat when it comes to romance. This is a reverse-harem at its core (based on a dating sim), so I was not surprised by how things ended up. Still, the lack of any concrete romantic development or even a hint on Kaho's part as to which guy she likes best is very frustrating. Yet, there are just enough romantic moments to make you want to see something more. This cannot be written off as a simple \"friendship\" series.\\n\\n\r\nCHARACTERS (9)\\n\r\nHino Kahoko is a decent, but bland lead. I liked her determined approach to the violin, and her character development was well done. During the anime, we see Kaho persevere, doubt herself, face a major setback, and ultimately triumph. While I enjoyed this, her inability to choose one guy was irritating. This flaw really shows through in the La Corda Special, where she can't even begin to make a decision as to which guy she likes best. It was very annoying to watch this.\\n\\n\r\nEach male has a distinct personality, because this is a harem-type show. You have all of the usual suspects- the cheerful and clumsy guy, the guy all of the girls are in love with, the cold but good-looking guy, the cute and innocent guy, etc. I found all of the boys to be interesting, enjoyable characters. To some extent, every character develops, which is refreshing. Tsukimori was definitely my favorite character. I liked how his approach to his music gradually became gentler throughout the series. All of the characters are cute, both inside and out!\\n\\n\r\nSOUND (10)\\n\r\nMusic is where this anime shines...which is what I expected from an anime centered around a music competition (hehe). In 25 episodes, a wide variety of classical music is introduced, which I really enjoyed.\\n\\n\r\nThe OP and the ED songs are outstanding. In particular, the OP \"Brand New Breeze\" had great music, great art, and overall, it was very cute! It tells us exactly what the anime is all about. The song gives a feeling that Kaho is singing to each of the boys. The ED music is also very good- it seems like the boys are singing back to Kaho. I like the call and response format of the OP and the ED.\\n\\n\r\nANIMATION (10)\\n\r\nI loved, loved, loved the character designs. This is what attracted me to the show in the first place. Each character has a distinct, unique look, right down to face shape. All of the Bishounen are good-looking, but my favorite character designs are Tsukimori, Shimizu, and Tsuchiura.\\n\r\nApart from character design, animation was average.\\n\\n\\n\r\nVALUE / ENJOYMENT (9)\\n\r\nIn case you didn't notice, I adore this anime. The story it told was heartwarming. I would only recommend watching it again if you really love the story. Or if you really love Bishies.\\n\\n\r\nThe Bottom line:\\n\r\nThe music, character designs, and the characters themselves are easily the strongest components of the show. Recommended for fans of Shoujo anime. Skip this one if you dislike indecisiveness in romance.\\n\r\nIf you liked this, you may also like Aishiteruze Baby (a series that gives off the same warm and fuzzy feeling as La Corda), or even Peach Girl (a reverse harem with a more concrete romance story).\\n\\n\r\n(kamika:This was my first review! Feedback is appreciated. Thanks! )",
            "date": "2009-04-12T09:04:00+00:00",
            "helpful_count": 89,
            "mal_id": 14079,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48520.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Komika",
                "username": "Komika"
            },
            "url": "https://myanimelist.net/reviews.php?id=14079"
        },
        {
            "content": "La Corda d'Ora is a reverse harem story with a heavy dose of music.  I first heard about it when I was really into Nodame Cantabile and Ouran High School Host Club.  So I thought,\"Wow, it combines two great shows -- how perfect!\"  Only... it wasn't, which was disappointing.  It does combine music with a reverse harem, but -- in my opinion -- it doesn't do music as well as Nodame and it doesn't do romance as well as OHSHC.  I guess you can't have everything at once.\r\nWhat it does have is great music.  Ave Maria, which is oneof my favorite pieces of all time, plays a pretty prominent role in the series.  And there were some other pieces that I really enjoyed -- familiar and new to me.  And it also has a great collection of really, really gorgeous bishies. ;)  Like, when you think of traditional hot anime guys -- this is it.  They're so pretty. So pretty. ^.^\\n\\n\r\nPlot wise... story wise... character wise... it's okay.  It has a nice overall theme/message/moral.  If you go in with average expectations, a fan of reverse harems or bishies or music-themed animes would be pretty satisfied.  More satisfied if you're looking for eye or ear candy. \\n\\n\r\nThe plot is pretty simple.  The synopsis hits the nail on the head and there really isn't too much more to it.  The characters are a little shallow, a little cliche... a little under-developed.  The biggest problem for me was probably the conflict felt by the main character and how she reacted to it.  I liked the beginning of the show; it was pretty entertaining.  But in the middle, I got so frustrated and turned off by the angst and the whining that I actually dropped the show: I didn't care what happened next because I was too annoyed to watch.  (The time between release of episodes probably made that worse -- I might have barreled through if I had the whole series at once.)  Not everyone is going to feel that way about the main character or the show -- I just personally have low tolerance for that character type.\\n\\n\r\nAfter several months, out of boredom, I decided to go back and see if I could just finish it off since I had gotten all the way to episode 20 while it was being initially fansubbed.  It was the beginning of the end so a lot of the annoying behaviors that drove me away were gone and it went back to being a nice, if somewhat predictable, story with great music and pretty bishies.\\n\\n\r\nTo be honest, more than anything... it makes me want to watch Nodame Cantabile again.  Maybe it isn't fair to compare the two, but I can't help it -- I compare everything to anything. ;)  And, as a matter of personal taste, I think I prefer when things are a little bit more romance and a little less harem, so that probably skews my score too.  I didn't think it was a masterpiece or a must-see, but it was cute and entertaining and watchable because I like all the genres it falls into.",
            "date": "2008-01-23T21:21:00+00:00",
            "helpful_count": 81,
            "mal_id": 2119,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4869.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lowell",
                "username": "lowell"
            },
            "url": "https://myanimelist.net/reviews.php?id=2119"
        },
        {
            "content": "I was really not going to give this series an eye, after reading a chapter of the manga it seemed lame and confusing. For some reason though, maybe because I was bored I started downloading the first few episode. This anime is so much better as an anime than a manga. Music can't be represented very well on paper. ^^ \r\nI love the way the story is cute and fresh. I don't watch very many animes based on activities, but I'm glad I watched this one. The character are just so lovable and pretty. BISHONENS!!! Nyaaaa ><. Give this a try if you atleast likemusic. Which just about everyone does.\\n",
            "date": "2008-01-20T17:20:00+00:00",
            "helpful_count": 20,
            "mal_id": 2070,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/30586.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Minamino_K",
                "username": "Minamino_K"
            },
            "url": "https://myanimelist.net/reviews.php?id=2070"
        },
        {
            "content": "At the beginning I would like to warn some of you that my review is going to be biased and partial. However subjective may it be, I hope it will be at least justifiable.\r\nI have not seen worse anime. NEVER. It may be true that I have not seen many of them but this was simply the worst piece of kitsch I have ever encountered. I thought that it is impossible to accumulate greater number of cliches in one place than in an American movie, but I was proved wrong.\r\nLet's start with story. Story? There's no story! Only some propaganda advocating that self-confidence and faithare of more value than years of effort. Which is by the way cliche from Disney movies. Repetitiveness and dullness are two words which would depict the most effectively abysmal awfulness of this piece of \"art\". I wonder how it is possible that so many people endured its predictability and aesthetic foulness.\\n\\n\r\nArt is simply average. Nothing that I wouldn't see before. Standard style copied in many in many second-rate animes. It generally makes me smile ironically so it gets 3/10. I don't see any reason to elaborate on that subject.\\n\\n\r\nNow we come to the best part of this pathetic creation which is not that good at all. There is some classical music included which makes me forgive revoltingly poor ending and opening. I just can't understand why music is often drowned by so-called cogitation of protagonist.This is unforgivable. And classical music itself is performed poorly anyway.\\n\\n\r\nAnd here we are - definitely the worst part of all show.Characters and their design. Catastrophe. Every character has his own hair color and none of them is natural. I wonder how much time it took to choose different shades of improbable greens, blues and violets. Disgusting is the best fitting word here. Well and personalities are two dimensional to say the least. In fact I couldn't see any difference between most of the character throughout whole series. Maybe that's because they don't differ. Just like other thousands of nameless characters of numerous animes which have been hopefully already forgotten.\\n\\n\r\nTaking all of it under consideration there may be only one verdict: If you ever encounter this anime you better split your eyes out and plug your ears or you will experience unspeakable torment. Well, if you have any aesthetic taste, that is.",
            "date": "2011-01-16T14:55:00+00:00",
            "helpful_count": 11,
            "mal_id": 33816,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/388613.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Ajamek",
                "username": "Ajamek"
            },
            "url": "https://myanimelist.net/reviews.php?id=33816"
        },
        {
            "content": "In the wake of finishing \"Nodame Cantabile Finale\", the latest series of a superb franchise that blew me away and got me into classical music, I found myself wanting to watch more anime about classical music. And that's why I decided to check out \"La Corda D'Oro: Primo Lasso\". I went into it fully expecting a poor man's \"Nodame Cantabile\" - such classics don't just grow on trees after all - but still, I couldn't help feeling disappointed even though I got exactly what I was expecting.\r\n\"La Corda D'Oro: Primo Lasso\" (to be abbreviated as \"La Corda\" for the remainder of this review) tells thestory of a normal girl Hino Kahoko coming into possession of a magical violin and taking part in the concours, the school's premier music competition, where she has to compete against a bunch of other students, most of whome study music.\\n\\n\r\nThere's not much to complain about the presentation of \"La Corda\". All the character designs are pleasing to the eye, and a sense of beauty and elegance often shines through particularly when a character is performing. But you can guess where the priority of this show lies from the opening credits featuring shoulder up portraits of all the main characters - none of them appear to be wearing anything! Not that it's a fiery, passionate tale about complicated love triangles or anything like that, but it does come off as an anime that's more concerned about superficial imagery than solid substance.\\n\\n\r\nAnd from the very first episode, \"La Corda\" does little to help you shake off that impression. Aside from its almost non-existent attempt at preserving story integrity by sweeping the concour selection process under the carpet, it soon becomes clear that the show is very much a reverse harem as Hino is quickly surrounded by more bishounens than you can shake a stick at. There's the Proudly Aloof Bishounen, the Mysterious Prince Bishounen, the Playful Bishounen etc - all the most common bishounen architypes in shoujo are here, and then some. They are, of course, her fellow students and competitors in the concours and, together with Hino, they make up the selection of characters featured in the portraits in the opening credits. The only person from the concours who isn't featured in those portraits is, unsurprisingly, the Other Girl in the competition. Because as everyone knows, in a reverse harem, the Other Girl is, of course, unimportant.\\n\\n\r\nThe main problem is that most of these bishies have totally flat personalities. Proudly Aloof Bishounen is like Chiaki from \"Nodame Cantabile\", except without any depth and taken to unbelivable extremes. Dopey Bishounen's characteristic dopeyness is also excessive - he can't even talk in a normal voice. Yes, we know he's not supposed to be quite \"with it\", but does it have to be so obnoxiously obvious?? And no, I don't find his dopeyness to be particularly amusing.\\n\\n\r\nFortunately, not all the characters are like this. Surrounded by the other princely bishies, Tsuchiura is refreshingly down to earth - as shown by the fact that I was unable to think of a nickname that shelves his personality into a stereotypical mould. Best of all, Hino herself is a good main character. Unlike most of the others, she actually plays a very genuine \"ordinary girl\" role. She'd never played the violin before, and her understandable anxiety and reservation for entering the concours with her magical violin, along with her gradual change of attitude towards music and in particular the violin are all aspects that are smoothly handled for the most part. Hino's involvement in a competition that's mostly reserved for specialised music students also means that she does have to cross some tall barriers to gain acceptance, and her refreshing \"outsider's\" approach to music as a non-music student goes some way towards breaking down the elistist attitude prevalent amongst the music students.\\n\\n\r\nHaving said that, I do have largely mixed feelings for the musical aspects of \"La Corda\", and it's especially interesting to compare this with \"Nodame Cantabile\". Firstly, it has to be said that there are no shortage of variety in the pieces performed in \"La Corda\". Beyond the standard selection of great composers such as Chopin, Beethoven etc that are covered by \"Nodame Cantabile\", \"La Corda\" also features quite a number of lesser known composers such as Boccherini, Reger, Vitali etc. It's a selection that I, as a casual listener to classical music, am largely unfamiliar with, and it's a selection that far exceeds the variety and perhaps even the quantity of music on offer in \"Nodame Cantabile\". Whether this is because the characters of \"La Corda\" focuses on the solo performances of so many different instruments while \"Nodame Cantabile\" is mostly involved with either orchestral symphonies or piano (both of which have a staggering number of well known pieces), it's hard to say. And along with those bits of trivia at the end of each episode, \"La Corda\" certainly gives the impression of having a broad knowledge of classical music. In addition, like \"Nodame Cantabile\", the music played in \"La Corda\" is also tailored to suit the story line (as in, if it's supposed to be a bad performance, you'll be able to hear from the music, although the tailoring isn't quite on the same scale as \"Nodame Cantabile\").\\n\\n\r\nOn the other hand, I have no problem in saying that I enjoyed the music of \"Nodame Cantabile\" far more than the music of \"La Corda\". Is this because the music in \"La Corda\" is simply not as good? Perhaps, but I feel there's a lot more to it than just the quality of the music...\\n\\n\r\nThe thing about \"Nodame Cantabile\" is that it simply comes off as far more passionate about its music. Everything about the show revolves around the music - it is woven seamlessly, inseparably into the very fabric of the show itself, with the story, the atmosphere and the music all complementing each other. And during the performances, the characters are often reflecting on the music itself. This means that it's easy to get affected by the show's infectious enthusiasm, and I found myself enjoying every performance, even when the music being played is not to my taste. In constrast, \"La Corda\" is too often caught up in its reverse harem aspects, with the incessant posturing of the sparkling bishounens and various love polygons (\"love triangles doesn't even come close to discribing it) proving to be a constant distraction. During the performances, the characters seem more concerned with their respective love interests than with the music they're playing. In addition, its philosophy towards music also seems to subtly change to suit the latest story arc. The result is that, despite certain similarities between the messages that \"La Corda\" and \"Nodame Cantabile\" are trying to get across, the former's attempts are sometimes undermined as it seems far less sincere in its attitude towards music. Also, \"La Corda\"'s music production feels mostly like a separate entity, isolated and often forced to stand by themselves, as though the people who worked in that area were working largely independently from the script writers and the storyboard (with the notable exception of the aforementioned tailoring of music). So while \"Nodame Cantabile\" seems to be capable to getting people interested in classical music, I have a hard time imagining \"La Corda\" to be capable of the same feat.\\n\\n\r\nTo its credit, the last third of the \"La Corda\" improves significantly. Most of the one dimensional characters develop some kind of depth to become 1.5 dimensional. Hino, who was by far the best character to begin with, goes through even more development. In particular, the way she chooses to deal with her final obstacle is surprisingly and admirably direct. If I have any complaints, it would be how unbelivably fast she manages to improve on an instrument as difficult to play as the violin - it usually takes people ages just to produce a sound that's not harsh! But minor gripes aside, the show really takes off and proceeds to pull out all the stops in the final concours. Here, the story, the atmosphere and the selection of music are finally all pulling in one direction. The performance of Bach's cello prelude that radiated a sonorous beauty, the performance of Lizst's \"La Campanella\" that grew from a delicate beginning to a tempestuous climax, and a dignified, graceful performance of Schubert's \"Ave Maria\" are just some of the highlights that bring a sense of elation, satisfaction and closure to a colourful final proceedings. For \"La Corda\", this is a rare occasion on which it manages to emulate the kind of magic that \"Nodame Cantabile\" produces with such casual regularity. After the final episode, some may feel the omission of a certain detail to be a bit of a cop out, but I'm of the opinion that the omission actually has the effect of highlighting what they DID show - Hino's courage and love of violin - to be the things that truly matter.\\n\\n\r\nThanks to the last third of the series gaining a focus, \"La Corda\" just about qualifies as a \"good\" anime rather than an \"okay\" one. Just like Tsuchiura is accused of being half hearted in his pursuit of music and football, for the majority of the series \"La Corda\" also seems guilty of half heartedly going for a lot of things. It playfully toys with the idea of romance but does not go anywhere with it; it tries to do some character development, but is hampered by its reverse harem elements and overly stereotypical characters it shackled itself with in the beginning; it seems to want to give off the impression of being serious about music while at the same time rarely displaying an inclination for exploring the subject past the surface. The result is that it's well beaten in all areas by \"Nodame Cantabile\" and ends up as little more than a genre specific show with an appeal that is unlikely to extend beyond its targetted audience. \\n\\n\r\nBut while all of this may sound like very harsh criticism for a series I'm labelling as \"good\", it's more to do with me being spoilt by \"Nodame Cantabile\" than anything else. Would I be scrutinising this show - in particular its musical aspects - so closely if it isn't for \"Nodame Cantabile\"? I doubt it. It's not so much that \"La Corda\" doesn't measure up as the fact that \"Nodame Cantabile\" set the standards far too high, and it's a tall ask for any similar anime to compete without coming off looking a lot worse. At the end of the day, \"La Corda\" is by no means a poor series - it's simply a poor man's \"Nodame Cantabile\". And that, to be fair, is nothing to be ashamed of.",
            "date": "2011-05-22T23:32:00+00:00",
            "helpful_count": 10,
            "mal_id": 37227,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302826.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kajia",
                "username": "kajia"
            },
            "url": "https://myanimelist.net/reviews.php?id=37227"
        },
        {
            "content": "(Read below the line for comments made before I finished the anime)\r\nHonestly, the ending left something to be desired.  If you are interested in romance, this may not be the anime for you.  There are elements of romance all over the place and there is even a hint to a definite couple...but, don't get your hopes up because there isn't anything beyond that.\r\nIt was a well made anime besides the problem(s) listed below.\r\nTO SUM IT UP:\r\n*Positivites: original plot, the art was beautiful, the characters (especially male) were gorgeous and had a variety of personalities\r\n*Negatives: repetitive problem/conflict in the story (see below the linefor explanation), (previous neg led to) flaw in main character's development (since she kept on going in circles), the sound quality when music started was not as great as it should've been for a music-based anime, ***things were left open-ended...but maybe there will be a second part or something (-_-*)\\n\\n\r\n----------------------------------------\\n\r\nNote: I am still watching the anime.  Thus, I will edit this review once I have finished.\\n\\n\r\nI feel like there is a main conflict that keeps repeating in this anime.  It seems it is resolved, but then the problem will come back around as if it was never solved in the first place.  What troubles me the most is that this problem has to do with the main character's (and the main plot's) development.  By making the problem reappear after being solved, it as if the writer couldn't come up with anything better or just keeps contradicting herself* (I had to blame her* since I'm sure she worked hard on this project.)  It makes the viewer not like the character---&gt;the main character seems immature, naive, ignorant, selfish...however, the story does not illustrate the character in such a fashion.  In other words, she is supposed to be this kind, caring, gentle person who learns from others.  However, this problem makes her seem to block off the lessons she learns from others.  Urgh, it's hard to explain...but yeah.\\n\\n\r\nOther than that, it's a pretty nice anime...definitely something new.  The characters are cute overall (and very GORGEOUS!!).  The sound for this anime would've been 10...however, considering the fact that it is an anime about music, they could've made the quality a bit better.  For example, it just didn't stand out as much as Nodame Cantabile.",
            "date": "2008-06-08T02:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 5325,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/63677.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dazedqt23",
                "username": "dazedqt23"
            },
            "url": "https://myanimelist.net/reviews.php?id=5325"
        },
        {
            "content": "OMG this was an incredibly boring anime...it took but sheer force of will not to drop this title! But rest assured I wasn't sitting in front of the monitor the whole time. Such a waste with all the lovely bishounen, but I guess it goes to show; \"you can't put lipstick on a pig\" and having all the bishounen in the world isn't a guaranteed success. But seriously, I shouldn't have to be a classical music major or aficionado to appreciate this anime. If I could enjoy an anime about baseball [Big Windup] when I dislike sports or be completely entertained by a story aboutgalactic garbage collectors [PlanetES] then I should be able to enjoy this anime. But I don't and not because of the subject matter but because of the story itself which I found to be very slow, non-existent in some parts, non-committal in others and totally indecisive.\\n\\n\r\nHhmmm, the art....,I wouldn't say it was terrible, but for a 2006-2007 title, I'm pretty much underwhelmed. Barring the character designs, which were lovely, there is absolutely nothing interesting about the art. The backdrops were generic, the sceneries were boring...actually anything that went beyond the characters was boring and inconsequential. Oh and be prepared for lots and LOTS of still shots like when the characters are playing their instruments, a lot of the time you'll just see still shots of them holding their instrument of choice with some serene look on their face. It doesn't happen all the time, some of the animation is nice [it's nice to see the fingers moving on the strings] but the static images do appear very frequently. And I feel, the topic of classical music is already boring enough as it is, they could have at least put some proper effort into the animation. Also expect to see the same audience for ALL FOUR concerts, there is a lot of recycling of stock images.\\n\\n\r\nNot much I can say about the music either, since I'm not a fan of classical music...I might have a vague interest in Baroque and some piano works but that's as far as it goes for me. I'm sure it's all lovely but it did nothing for me. Which if anything made me like the anime even less, but before you jump down my throat and say stuff like “then why did you pick an anime about classical music if you don't like classical music???” But like I said, from my own experience, anime titles in the past have taken topics I've had zero to little interest in and made them fascinating. I hate sports, but liked Wild Striker, Prince of Tennis and totally LOVED Big Windup! I hate Westerns but loved Gun Frontier, I hate talking animals and god knows how many of those are in anime? So I expected an interesting [if at the very least informative] story about classical music, but there was none of that, so I'm still pretty much an outsider when it comes to classical music. \\n\r\nI also have mixed feelings for the intro song “Brand New Breeze” part of me likes it but the other part of me think it sounds a little bit too much like a commercial for some kind of laundry detergent or feminine product....[just keeping it real, sorry]\\n\\n\r\nStory....hhhhmmmm, one word: ABYSMAL! OK so the story is about a girl who was magically chosen [for some reason or another, which is irrelevant since it's only some thinly veiled premise to get her surrounded by a bunch of hot guys] to participate in some sort of classical music playoff. But the contest is not the central theme, the actual theme is music appreciation and each character's relation to it...which, yes, may sound deep but none of this came across to the viewer. There was nothing that really drew me into being interested in classical music like I felt when I watched a baseball game with Big Windup, for example. There's no humour, there's no romance to speak of, they didn't even get into the technical aspects of classical music. In Hikaru no Go, they made moving those little game pieces on a board seem so exciting and dramatic and they also informed me about how the game of GO is played and even certain strategies and tactics. There is none of that in this series, except maybe if you want to count the fairy at the end talking about Bach and Beethoven, which I don't. \\n\r\nThis series seriously spent the better part of 24 episodes to talk about how each of them loved music or played their music [which to be honest sounded just a little more than pretentious “Ah this sonatta is so brilliant and the strings are so vibrant and so transparent”....yeah bull***t] There’s nothing else to this anime besides this and maybe some minor romantic innuendo [FAIL]. It's only after episode 20 when all the B.S. goes away, such as the magic violin and all that reverse harem kitsch that she, Kahoko, has to really deal with the fact of being a such novice violinist does the show even have any sort of merit.\\n\\n\r\nSo Like I said before, the character designs were lovely. I can't really complain there! And to be honest, that's the only real selling point of this series: very nice character designs and a lot of time spent on character development. That being said, it's not like we're going to discover anything new with these characters, they all pretty much follow the typical anime character templates: The Femme/Bishie Heartthrob, The Sporty one, The Angelic/Loli one, The Loud Comic one, The Posh/Stuck-up one, The Glasses one, etc... It's all pretty much colour-by-number, isn't it?\\n\\n\r\nMy Verdict: The cast is PRETTY, but the show's BORING so overall it's \"pretty boring\"....get it? Hey, gotta do something to entertain myself cuz god knows this anime ain't doing it for me.",
            "date": "2012-01-22T18:20:00+00:00",
            "helpful_count": 6,
            "mal_id": 52353,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48644.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Bishounen_Hunter",
                "username": "Bishounen_Hunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=52353"
        },
        {
            "content": "The review sort of says it all. La Corda D'oro was slightly better than average, but with good art and music. I thought that the characters were CUTE, and that was it. Hihara basically kept me watching that show. While I enjoy reverse harems, I can't say that I've ever actually watched a good one. I'd much rather read/watch something thats riveting and twisted than some sugar-coated shojo about musical instruments. Oh, but for a laugh, watch episode 26. Its pretty much a filler...wait...the whole show is fillers! That's true. There are only about three episode that actually matter for the plot...wait...the show has noplot! Well, it might, it's just being constantly smothered by ODs of classical music/unrequited love. BUT, despite all the random crap that has been sqaushed into this anime, there's something about it that makes it not a total waste of time...wait...it WAS a total waste of time! But at least it kept me entertained enough to watch the whole thing. The characters are sort of funny, the plot is sort of interesting, and the show is sort of enjoyable. The end.",
            "date": "2009-08-17T00:07:00+00:00",
            "helpful_count": 5,
            "mal_id": 17827,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Shinganai",
                "username": "Shinganai"
            },
            "url": "https://myanimelist.net/reviews.php?id=17827"
        },
        {
            "content": "OK.... the short review of this show= it is a reverse harem anime with music, magic, and a fairy....not much fan service and great musical pieces throughout.. if this sounds like the show for you great! If you are still hesitant... here is the deeper review:\r\nStory: I'm not going to harp on this... for it is a reverse harem anime that is mediocre... that means that there are attractive males throughout that like the main female lead who is usually pretty useless and emotional. So, i expect everyone wanting to watch this are already expecting a storyline that is simular to the one I justdescribed. Now, this one is definately mediocre, it is not as good as ouran high or fruits basket, but it could definately be worse (i personally believe the music is what mostly saves this) The good: I was able to finish the series and somewhat looked forward to the next episode (i say somewhat hesitantly)\\n\\n\r\nArt: again...decent... seemed pretty most of the time... However it really shined when the characters were playing their instruments. It really could make you sit on the edge of your seat if a character was playing a fast-pace song, especially when the song was played by the piano or the violin (these two insturments seemed to be animated the best the majority of the time)\\n\\n\r\nSound: BEAUTIFUL!!!!!.... but i must harp on this... they are pieces that many people have heard because they were done by famous composers... the music the anime had that was unique to itself like the opening and ending scenes were horrible! namely the intro song (the ending song i don't really know if i ever watched it all the way through and therefore don't remember much) The intro song should have been full of classical music and beautiful scenes of people playing instruments right? WRONG!.... if you are going to watch this anime... JUST SKIP THE OPENING! And again, the rest of the already famous pieces were good throughout the show.\\n\\n\r\nCharacter: the good= the main heroin wasn't as annoying as I was worried she would be. A couple of the males had ok stories and one of the character's true nature caught me by surprise... also.. there were more females in this show than in typical reverse harem shows... or at least I thought there was more than usual... kinda refreshing actually to not be shown yet ANOTHER pretty boy for every character spot that needed to be filled. the bad= they are cookie cutter characters that are typical in a reverse harem anime.  One character that i want to harp on especially is the loli boy that plays the cello....HE IS A WASTE OF CHARACTER! He is only there so that the anime can say that they have a loli boy other than the fairy.... he really has no true emotion and is a waste of space! ..... he plays the cello nicely.. but why couldn't he actually do something more than just sleep, play cello, sleep, say an interesting fact, sleep, then say a little something that is slightly inspirational that any other character could have said!!!.. (sorry... just ranted)\\n\\n\r\nEnjoyment: ..I finished it... take that as you will... (few of the characters were slightly enjoyable, i liked the music, and the twist in the one character did surprise me even though it probably shouldn't have)\\n\\n\r\nOverall: its ok.... i like the classical music elements, the animation of some of the instruments.. some characters grew on me a little.... but nothing too amazing... If you want the best that this 'pretty boy' genre has to offer... watch/read Fruits Basket or Ouran High.... If you want to know what this one is simular to... it is like UTA no Prince Sama 1000% and its sequel UnPS 2000% however Uta no Prince has a SUPER pathetic main female lead... and stupid fanservice at random points... >.< OY VAY!",
            "date": "2013-07-19T22:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 106055,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2554903.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Midori_Suzume",
                "username": "Midori_Suzume"
            },
            "url": "https://myanimelist.net/reviews.php?id=106055"
        },
        {
            "content": "La Corda D'Oro is pretty much the first anime I ever watched, so I have somewhat of a nostalgic attachment to this show. It’s a sweet and relaxing anime about a music competition and explores the effect music can have on one’s life and the people around them. If you have an interest in classical music and don’t mind somewhat simplistic characters, I would encourage you to give it a try.\r\nSTORY:\r\nThis show is about a music competition, and centers around Hino Kahoko, who was named as a competitor despite having no knowledge or experience in playing the violin. It’s a character-driven story, and focuses onthe interactions between Kahoko and the other participants, and explores what music means to each of them. It spans the course of the entire music competition, and I like how the four main events serve as major turning points in the story and the characters’ development. It’s a simple and somewhat predictable plot, but the use of music and the structure of a competition makes it an enjoyable and relaxing ride.\\n\\n\r\nCHARACTERS:\\n\r\nThe characters all seem to fit into a stereotype, which makes their behavior somewhat predictable and lacking in complexity. But all of the characters are likable (though some more than others) and they all have a decent amount of character development (though again, usually predictable). All of this character development centers around Kahoko and her genuine love for music. It’s fun to watch how much of an effect Kahoko has on her fellow competitors and her classmates, and especially the effect this music competition has had on herself.\\n\\n\r\nOne thing to note is that this is a reverse harem, so most of the guys develop some kind of crush on Kahoko. But these feelings don’t lead to an actual romance, and merely serve to influence each character’s behavior. I have no complaints about the lack of concrete romance, and prefer to have it open-ended given that it’s a reverse harem (and I’d rather not see the show choose one pairing and leave everyone else disappointed). All the guys care about Kahoko in their own way which I found sweet, and I was satisfied with the way the show handled it.\\n\\n\r\nSOUND:\\n\r\nSince this show is centered around classical music, you’ll get to listen to a variety of short pieces throughout the series. Each song fits the scene, and it’s one of the show’s strength (since there aren’t a whole lot of anime about classical music).\\n\\n\r\nART:\\n\r\nIt looks decent, and I have no major complaints.\\n\\n\r\nENJOYMENT:\\n\r\nI found this show sweet and relaxing, and I enjoyed the competitive spirit and the focus on classical music. It’s a simple story and doesn’t have anything unique or complex to offer, but it does a good job for what it is. Its biggest flaw is its simplistic characters and predictable plot, but the abundance of music is what made this show enjoyable for me.",
            "date": "2016-11-25T19:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 234386,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3805971.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/azphyron",
                "username": "azphyron"
            },
            "url": "https://myanimelist.net/reviews.php?id=234386"
        },
        {
            "content": "To be honest all thanks to my big sister I'm watching this! She talked me into it! I'm really interested now in playing and listening to music all thanks to this show! I always like go to youtube and listen to music like Fantasie-Impromtu one off my favorite pieces! I'm gonna miss La corda d'oro primo passo! This is where I get my courage in playing the piano! I love playing the piano so much! Thank you La corda D'oro you made me enjoy music!",
            "date": "2009-04-13T20:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 14127,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sakurafeather",
                "username": "sakurafeather"
            },
            "url": "https://myanimelist.net/reviews.php?id=14127"
        },
        {
            "content": "Remember to give any sort of criticism as possible, good, bad, constructive, useless, and even harsh, I accept It all! From the first two I even learned a few things! I'll try to keep spoilers as LOW as possible.\r\nFirst Comments: This show is one of the very few music based animes that I REALLY enjoyed. The music was great, the sound was also great. The story though needs a bit of critic and the art was good but there's always room for some critic.\r\nStory: The story is somewhat clichéd. All these events that somehow and suddenly lead to spectacular events that seem; somewhat not believable.Luck I might say and a bunch of it too. No matter how many times I look back on it, it seems too good to be something within normal \"naturalness\". The addition to some magic in the show does somewhat counteract the unbelievable part, though I adds some childishness to the story. Which I thought was kind of silly. Though It did add some comedy into the mix. Even though it's kind of clichéd it's also rare somewhat. Reverse harems seems little to none these days. I really enjoyed the addition of reverse harem to the story because It made it seem more unique and interesting. Though it's plot might not be solid and fool proof, It's still very well executed. Even though I'm not too big of a fan on school dramas, it was one those that I enjoyed. The flow of the story is a little different than I expected, not in a bad way though. The exposition just seemed to smash into me, giving me a lot of background information with it along with the rising action. It even made me excited or reacted somewhat at the climax! This all coming from a musical anime!\\n\\n\r\nArt: The art is very good, though I still wonder about the hair colours... Not a problem though, it was just like a rainbow :P The art style is a bit more \"mature\" not cartoonish or kiddy. It gave it a bright happy look to it. But sometimes when the time was right the sad and melancholy settings are just perfect along with the character's emotions and the music. The background overall was good, though I really couldn't pay too much attention to it due to the fact my eyes and ears were mesmerized by the animation of them playing those instruments and the sounds flowing out of it. The faces of the people seemed to change though, I really enjoyed that actually! Since it made it just a little more realistic, because in real life, no one looks exactly the same, everyday... The best part I have to say about the art is the animation when they play the instruments. Like I said before it really feels like you're getting absorbed into it.\\n\\n\r\nSound: What can I say? It's a musical anime, of course I have high expectations for it! La Corda handed it too me nearly flawlessly. Though there might be some mistakes some people might say, it's all really hard to point out. Due to the fact that the main music hides all the background music and makes you literally forget all about it. Also since I'm a big fan of classical music, it might be a LITTLE biased. Nonetheless it's still very well done. There was one problem though. Even though the main music attraction was great, big, and epic. It just had that problem. It overpowered the rest of the little music in the background. Though I might be contradicting myself, it is true. Using some none music animes like Chobits as an example, I can clearly remember all or most of the background music. This is a musical based anime though, so the music should be the main attraction; even though that is true they should have made the background music more \"rememberable\" is how I'll put it. Even through those it's still quite hard to point out mistakes. I only gave it 9/10 due to one thing I learned. Nothing in music is perfect, there is always room for more improvement. (yes I due play an instrument and somewhat to quite well as a matter of fact)\\n\\n\r\nCharacter: The characters were very well planned out. From the hair colour suiting their feeling and emotions to the instrument they chose to play, it all matched up very well. I don't have much to say here due to that fact the only problem I had was with the way they were set up. It might sound confusing but, the way they almost all appear at school or within the area, then they suddenly know each-other and become friends. Also the romance is a bit stereotypical type of romance inside anime. The main character lead also is a bit clichéd type of person. It might be just because I've watched so much anime that it seems that way, but overall the characters were very good and somewhat \"believable\". (my favourite Kazuki and no I am not gay, I just preferred his instrument over the rest *hint**hint* :P) You can also see why the anime might be more focused on the female population ;P\\n\\n\r\nEnjoyment: It was very enjoyable actually, though I doubted it at first when I say the genre was Shoujo, not saying that there aren't any good ones just saying that I didn't think it would be so exciting! The main points of excitement would be any time they play their instruments, like I said before, it makes you flow into it and listen to it with your um... \"Second ear\" meaning you get a deeper richer understanding of why they chose that song, how it suits them playing it, and the theme they're trying to play/show. If you're a music lover like me you could even just close your eyes and listen solely to the sound (though it would be quite hard if you weren't literate or understand Japanese. I don't either. I'm jut saying it's just that enjoyable)\\n\\n\r\nOverall: It was really hard to pick out a lot problems with the story, the sound is really where it captured me, so I HIGHLY recommend it to anyone, especially classical music lovers.",
            "date": "2008-08-15T15:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 7152,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85715.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zerokill",
                "username": "zerokill"
            },
            "url": "https://myanimelist.net/reviews.php?id=7152"
        },
        {
            "content": "This is my first time writing a review, so please bare with me.  \r\nThis anime is one of the best ones I've seen in a long time. It was amusing and funny. It was more funny in the beginning, but once you got towards the of the series it got serious and sad. The ending was pretty good. I love Kaho-chan!!  \r\nIt taught me a lot about classical music, I actually like it now. It made me want to go buy a violin and try playing it.  This is an awesome anime. :]]\r\nOver all I would recommend this anime to everyone!",
            "date": "2010-04-23T18:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 25374,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/197049.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ExSxGURL16",
                "username": "ExSxGURL16"
            },
            "url": "https://myanimelist.net/reviews.php?id=25374"
        },
        {
            "content": "Your first thought may be \"Why a nine for a video game reverse harem adaption?\" Many of these are often rated pretty harshly one being that the heroine never ends up with any of the guys. Not that this one does, but there are many aspects of this show that makes it different.\r\nStory: I guess you can say the story has some unique aspects to it. Magical violin didn't appeal to me very much in the beginning but as the it went on, the story started to slowly develop more potential around this \"magical\" violin. I can't really say much more without spoiling the story..sooverall, I thought the story/plot was pretty intriguing. \\n\\n\r\nArt: Hmmm..art is something important when I watch an anime. Kiniro's art was nice and the scenes where the characters played their instruments were nice to watch. Of course, there were nice scenes with romance in it too.\\n\\n\r\nSound: The music in this series were what amazed me the most. Every piece of music has its own meaning and touch to it. The opening of the show was a very nice piece especially. You'll see throughout the story, there will be many different pieces of music, so of which, you might recognize (if you listen and play music often).\\n\\n\r\nCharacter: Character development was okay to me. You'll see the main heroine grow and change throughout the story with the help of Lili (fairy) and all the guys around her.\\n\\n\r\nEnjoyment: Overall, I enjoyed this show a lot. Also, as a music lover it was pretty fun to watch. I have to say the ending disappointed me a bit since the heroine didn't end up with anyone, but I guess that's just how it goes.",
            "date": "2013-01-27T14:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 85041,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1571401.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/onesnowyday_",
                "username": "onesnowyday_"
            },
            "url": "https://myanimelist.net/reviews.php?id=85041"
        },
        {
            "content": "My very first review! Yippie!\r\nStory [10]\r\nHm... Maybe I'm biased and all, but I absolutely LOVE anime like this, which is reverse harem. Very exciting, so to speak. Kahoko Hino, a girl who has never touched an instrument, is literally forced to compete in her schools musical competition after meeting a musical fairy. Generally, the music department students get to do this, so this means Kahoko is the only General - Ed character that participates (Actually no, but I'm not going to spoil anything).  Anyways, a girl is surrounded by typical bishounen guys. And they all like her. The best way to describe this storyis love CIRCLE. Seriously, it made me hungry for the next episode. It's mainly emotional (and for some episodes, pure DEPRESSION) but it's still pretty funny at parts. Story was outstanding. 'Nuff said.\\n\\n\r\nArt [10]\\n\\n\r\nThe art's great. Love it, perfect type of art for a perfect bishounen anime. The artists made everyone very attractive.\\n\\n\r\nSound [10]\\n\\n\r\nWell, no DUH! The music is the best part of the show! It honestly got me into classical music ( In fact, I believe I have one of Kazuki's songs on auto-replay right now...). But still, the music is the best. Out ranks 98.9% of all anime music. In my opinion, of course. The music is emotional when it needs to be, and there are a lot of happy tunes going on in the anime too. Trust me, you'll get hooked.\\n\\n\r\nCharacter [8]\\n\\n\r\nI have an itty-bitty problem with the characters. Their personalities: Great! However, I would like some more background knowledge from a few of the characters. That would mean a 9 from this, but there was ONE character in which the anime didn't introduce AT ALL. And he was pretty good-looking too. Other than that, the characters were AWESOME! And there was some surprisingly good character development.\\n\\n\r\nEnjoyment [10]\\n\\n\r\nIt kept me on the edge of my seat! The music added very nice touches to MANY emotional and squeal-ivating scenes. Lots of drama and each of the boys get their fair share of lovey-dovey scenes. Melted my manly heart.\\n\\n\r\nOverall, this series gets a 10. Meaning,\\n\\n\r\nWatch it or I will hunt you down. 'Cause I know where you live.\\n\\n",
            "date": "2011-10-19T16:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 45851,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/776925.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kushukushu",
                "username": "Kushukushu"
            },
            "url": "https://myanimelist.net/reviews.php?id=45851"
        },
        {
            "content": "I absolutly loved this anime!!!! It is the best anime I have ever watched!!!! First i only started with Bleach and thought that that was the best, then i watched others, and then i watched this one, which went wayyyyy beyond my expectations!! I play violin and i can really connnect and understand this story. It was funny, passionate, enjoyable, and had great music. i want to play the music from this anime and widen my range. I reccommend this anime for those interested in music, or think this will b a good anime to watch.\r\nIM sorry if this review doesnt help much :( itsmy very first and i loved this anime so much i wanted to share my opinion about it :)",
            "date": "2010-08-16T14:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 29692,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/359252.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/misakiandusui",
                "username": "misakiandusui"
            },
            "url": "https://myanimelist.net/reviews.php?id=29692"
        },
        {
            "content": "La Corda D'oro is one of my favourite anime. The main character is Hino Kahoko. She has a magical violin given to her by Lili. This is a reverse harem anime targeted at shojo audiences, all the boys who participated in the music competition in school had a crush on Hino Kahoko. Among them is my favourite character in the anime, Tsukimori Len. He is a boy who has a cold face but actually cares for others alot, especially Kahoko. He is very handsome and is a violinist too! (like me) I like this anime mainly because of the music. People who like reverse haremand people who are interested in classical music should really watch this AWESOME anime(:",
            "date": "2009-11-27T04:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 20890,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/263064.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xiaoxin",
                "username": "xiaoxin"
            },
            "url": "https://myanimelist.net/reviews.php?id=20890"
        },
        {
            "content": "I really like reverse harem, because I think there's too little of them. This is definitely one of the best romantic anime that I have watched. The plot is very good because it covers every main character in depth and shows great character development. There's a bit of disappointment with the actual romance, because in the end, it doesn't show you who the main character ends up with. The music in this story was awesome. If you know music yourself or not at all, it may make you more interested in it. The art is really beautiful, too. They paid attention to all categories. \r\nI'mnot going to give a summary, because this is a review. \\n\\n\r\nOverall, I would give this a 9.8 for the rating because the everything was outstanding.",
            "date": "2014-01-17T16:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 129131,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3497691.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/xxSweetBunny",
                "username": "xxSweetBunny"
            },
            "url": "https://myanimelist.net/reviews.php?id=129131"
        },
        {
            "content": "La Corda D’Oro ~ primo passo ~ was a quite enjoyable anime to watch. It combines a bit of comedy, fantasy, romance, and drama all in one. Not to mention, this anime is a reverse harem. \r\nWhat I liked: \r\nWhat impressed me the most in the anime was the theme songs it had which was (personally) very enjoyable to listen to. Also, while watching this anime, I was exposed to a wider range of music and more general musical knowledge in the little segment at the end of the show and during the show itself. The show itself had quite a bit of drama andtwists too. There was also something that made me quite addicted to it for some time (or maybe it was just me?) \\n\\n\r\nWhat I disliked: \\n\r\nAlthough I do like the personalities of some of the characters, some of them are a bit typical and predictable. The main character / protagonist has her good and bad points, but enchants and changes all the other characters in a good way. Another main character is a genius violinist too, but is cold and harsh and only thinks of winning. There are many more typical characters like this in the anime. \\n\\n\r\nThe anime also gives out an equal amount of time between the protagonist and other characters, but this makes the storyline a bit boring the middle. In the middle of the anime, there were also a few irrelevant episodes that do not seem needed for the main story, but just adds some comedy and romance in between. \\n\\n\r\nI would recommend this anime to amateur musicians such as myself, those interested in music, or those who would like a bit of romance and comedy with a music theme. \\n\\n\r\nAll in all, this wasn’t a bad anime, maybe with some quirks, but it was still enjoyable.                           \\n\r\nThe source I used was www.crunchyroll.com I hope this review helped! \\n",
            "date": "2009-08-06T10:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 17540,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/206943.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jHorizon",
                "username": "jHorizon"
            },
            "url": "https://myanimelist.net/reviews.php?id=17540"
        }
    ],
    [
        {
            "content": "Note: May contain SLIGHT SPOILERS. Nothing too major though. \r\nNow~ to the review!\r\nOther than La Corda, the only other series that I can think of that somehow revolved around classical music (that I've ACTUALLY seen) was Piano. I won't go into that series as I did DO a review for it. Because of the fact that I haven't a series like La Corda before, that caught my attention. And also having classical music as a major theme within the series definitely sparked my interest.\r\nMy first impression of the series was that it just caught my attention because it was a bit different than manyseries that I have seen in the past. And I'll admit that by just watching the OP sequence, you may considered it a harem (this case, a reverse harem = more main guys than girls) anime, which it really isn't. Sure, there are several parts that have slight fanservice, but nothing major at all.\\n\\n\r\nFor me, from just watching the 1st episode, I was hooked and HAD to watch more episodes and I eventually made a fansite for this series, which used to be called 'Musical Secret, but is now called 'Crescendo'. Whether that had anything to do with the ED song being called that, I dunno, but yeah...\\n\\n\r\nWhat I didn't like was that sometimes the animation would be a bit strange and look awkward. For example, in particular, I didn't notice this one thing until Meagi, one of my staff members at Crescendo, sent me a pic from episode 4 where Kahoko's talking to Lili and his feet are facing in the opposite direction to where the rest of his body was. \\n\\n\r\nIn some of the later episodes, many of the character's faces and such just look weird, like the lines were drawn thicker than in earlier episodes. It wasn't that big of an issue, but with the slight inconsistencies was a bit of a turn off. Overall, the animation was decent, but it wasn't uber, uber vibrant but not bland either (well.. that depended on the episode as sometimes the colors looked a bit dimmer in some shots and brighter in others...). Kinda funny considering that they look a lot more vibrant in magazines and such. XD;\\n\\n\r\nA definite strong point in the series was the music. Though I did already have a liking for classical music, because of this series, I've come to like it a whole lot more and that makes me happy. And gee, I never realized how MUCH music there was for the series. I don't even think that I even own it all -- 2+ gigs and there are STILL more CDs. T.T\\n\\n\r\nWith the plot itself, it isn't a complex one, though it did make me wonder if the plot was going to keep my attention long enough. Luckily it did, but the music and the bishies were MAJOR bonuses. In general, the series itself, because of the reverse harem-likeness (as there are many more male main charas than female ones) it gives off is aimed more towards girls, rather than guys. But, any fanservice that even shows up in the series is nothing comparing to other series that have MAJOR fanservice in then.\\n\\n\r\nEven though this series is one of my favorites, there were some episodes that were a bit boring towards the end, say around episode 20, as the episode(s) were a bit boring because Kahoko's all angsty and such and when I found out there was a manga version, I noticed some differences, like in virtually any adaptation that originated from a manga first. \\n\\n\r\nI noticed that some of the events that happened in between the selections were either excluded altogether, modified, or where just different. And also, since the manga itself hasn't finish the concours (from last I looked, they finished the 3rd selection but no word on the 4th and final selection of the concours), so the ending of the concours will be different probably in the manga than in the anime. \\n\\n\r\nI really hope that there is a second season as the series itself originated as a game, than manga, now anime and the anime itself opened the possibility for a second season as it was an open-ended ending. There's a second game, so it's a possibilty that it could happen, but for now it's quite unlikely as the manga isn't done with the concours (aka not enough material for a second season) and if Yuki Kure doesn't adapt the 2nd game into manga form, it'll be less likely than if she did.\\n\\n\r\nOverall, this series was really good and is definitely one of those series that can be viewed again and I won't get sick of it. I can't say that it's one of those 'you'll love or hate it' series, but the first few might be a bit slow at first, depending on the viewer. I enjoyed watching it and I do recommend watching it, or at least give it a try.",
            "date": "2007-05-30T13:51:00+00:00",
            "helpful_count": 116,
            "mal_id": 329,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4423.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/icerydragon",
                "username": "icerydragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=329"
        },
        {
            "content": "STORY (10)\r\nHino Kahoko, a high school girl who has never played an instrument in her life, is given a magic violin. In turn, she must compete in a competition (the Concours) with several elite music students from her school. It's a story about Kaho learning to love the violin and music, while deepening her relationships with her fellow competitors.\r\nThe story is not for everyone. This is a character driven series through and through. The plot loosely falls around the Concours, but the purpose of the Concours is to contribute to character development. That being said, the character development is outstanding. I barely noticed the lackof plot- simply seeing these amazing characters interact and grow had me yearning to see the next episode.\\n\\n\r\nThe story really falls flat when it comes to romance. This is a reverse-harem at its core (based on a dating sim), so I was not surprised by how things ended up. Still, the lack of any concrete romantic development or even a hint on Kaho's part as to which guy she likes best is very frustrating. Yet, there are just enough romantic moments to make you want to see something more. This cannot be written off as a simple \"friendship\" series.\\n\\n\r\nCHARACTERS (9)\\n\r\nHino Kahoko is a decent, but bland lead. I liked her determined approach to the violin, and her character development was well done. During the anime, we see Kaho persevere, doubt herself, face a major setback, and ultimately triumph. While I enjoyed this, her inability to choose one guy was irritating. This flaw really shows through in the La Corda Special, where she can't even begin to make a decision as to which guy she likes best. It was very annoying to watch this.\\n\\n\r\nEach male has a distinct personality, because this is a harem-type show. You have all of the usual suspects- the cheerful and clumsy guy, the guy all of the girls are in love with, the cold but good-looking guy, the cute and innocent guy, etc. I found all of the boys to be interesting, enjoyable characters. To some extent, every character develops, which is refreshing. Tsukimori was definitely my favorite character. I liked how his approach to his music gradually became gentler throughout the series. All of the characters are cute, both inside and out!\\n\\n\r\nSOUND (10)\\n\r\nMusic is where this anime shines...which is what I expected from an anime centered around a music competition (hehe). In 25 episodes, a wide variety of classical music is introduced, which I really enjoyed.\\n\\n\r\nThe OP and the ED songs are outstanding. In particular, the OP \"Brand New Breeze\" had great music, great art, and overall, it was very cute! It tells us exactly what the anime is all about. The song gives a feeling that Kaho is singing to each of the boys. The ED music is also very good- it seems like the boys are singing back to Kaho. I like the call and response format of the OP and the ED.\\n\\n\r\nANIMATION (10)\\n\r\nI loved, loved, loved the character designs. This is what attracted me to the show in the first place. Each character has a distinct, unique look, right down to face shape. All of the Bishounen are good-looking, but my favorite character designs are Tsukimori, Shimizu, and Tsuchiura.\\n\r\nApart from character design, animation was average.\\n\\n\\n\r\nVALUE / ENJOYMENT (9)\\n\r\nIn case you didn't notice, I adore this anime. The story it told was heartwarming. I would only recommend watching it again if you really love the story. Or if you really love Bishies.\\n\\n\r\nThe Bottom line:\\n\r\nThe music, character designs, and the characters themselves are easily the strongest components of the show. Recommended for fans of Shoujo anime. Skip this one if you dislike indecisiveness in romance.\\n\r\nIf you liked this, you may also like Aishiteruze Baby (a series that gives off the same warm and fuzzy feeling as La Corda), or even Peach Girl (a reverse harem with a more concrete romance story).\\n\\n\r\n(kamika:This was my first review! Feedback is appreciated. Thanks! )",
            "date": "2009-04-12T09:04:00+00:00",
            "helpful_count": 89,
            "mal_id": 14079,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48520.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Komika",
                "username": "Komika"
            },
            "url": "https://myanimelist.net/reviews.php?id=14079"
        },
        {
            "content": "La Corda d'Ora is a reverse harem story with a heavy dose of music.  I first heard about it when I was really into Nodame Cantabile and Ouran High School Host Club.  So I thought,\"Wow, it combines two great shows -- how perfect!\"  Only... it wasn't, which was disappointing.  It does combine music with a reverse harem, but -- in my opinion -- it doesn't do music as well as Nodame and it doesn't do romance as well as OHSHC.  I guess you can't have everything at once.\r\nWhat it does have is great music.  Ave Maria, which is oneof my favorite pieces of all time, plays a pretty prominent role in the series.  And there were some other pieces that I really enjoyed -- familiar and new to me.  And it also has a great collection of really, really gorgeous bishies. ;)  Like, when you think of traditional hot anime guys -- this is it.  They're so pretty. So pretty. ^.^\\n\\n\r\nPlot wise... story wise... character wise... it's okay.  It has a nice overall theme/message/moral.  If you go in with average expectations, a fan of reverse harems or bishies or music-themed animes would be pretty satisfied.  More satisfied if you're looking for eye or ear candy. \\n\\n\r\nThe plot is pretty simple.  The synopsis hits the nail on the head and there really isn't too much more to it.  The characters are a little shallow, a little cliche... a little under-developed.  The biggest problem for me was probably the conflict felt by the main character and how she reacted to it.  I liked the beginning of the show; it was pretty entertaining.  But in the middle, I got so frustrated and turned off by the angst and the whining that I actually dropped the show: I didn't care what happened next because I was too annoyed to watch.  (The time between release of episodes probably made that worse -- I might have barreled through if I had the whole series at once.)  Not everyone is going to feel that way about the main character or the show -- I just personally have low tolerance for that character type.\\n\\n\r\nAfter several months, out of boredom, I decided to go back and see if I could just finish it off since I had gotten all the way to episode 20 while it was being initially fansubbed.  It was the beginning of the end so a lot of the annoying behaviors that drove me away were gone and it went back to being a nice, if somewhat predictable, story with great music and pretty bishies.\\n\\n\r\nTo be honest, more than anything... it makes me want to watch Nodame Cantabile again.  Maybe it isn't fair to compare the two, but I can't help it -- I compare everything to anything. ;)  And, as a matter of personal taste, I think I prefer when things are a little bit more romance and a little less harem, so that probably skews my score too.  I didn't think it was a masterpiece or a must-see, but it was cute and entertaining and watchable because I like all the genres it falls into.",
            "date": "2008-01-23T21:21:00+00:00",
            "helpful_count": 81,
            "mal_id": 2119,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4869.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lowell",
                "username": "lowell"
            },
            "url": "https://myanimelist.net/reviews.php?id=2119"
        },
        {
            "content": "I was really not going to give this series an eye, after reading a chapter of the manga it seemed lame and confusing. For some reason though, maybe because I was bored I started downloading the first few episode. This anime is so much better as an anime than a manga. Music can't be represented very well on paper. ^^ \r\nI love the way the story is cute and fresh. I don't watch very many animes based on activities, but I'm glad I watched this one. The character are just so lovable and pretty. BISHONENS!!! Nyaaaa ><. Give this a try if you atleast likemusic. Which just about everyone does.\\n",
            "date": "2008-01-20T17:20:00+00:00",
            "helpful_count": 20,
            "mal_id": 2070,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/30586.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Minamino_K",
                "username": "Minamino_K"
            },
            "url": "https://myanimelist.net/reviews.php?id=2070"
        },
        {
            "content": "At the beginning I would like to warn some of you that my review is going to be biased and partial. However subjective may it be, I hope it will be at least justifiable.\r\nI have not seen worse anime. NEVER. It may be true that I have not seen many of them but this was simply the worst piece of kitsch I have ever encountered. I thought that it is impossible to accumulate greater number of cliches in one place than in an American movie, but I was proved wrong.\r\nLet's start with story. Story? There's no story! Only some propaganda advocating that self-confidence and faithare of more value than years of effort. Which is by the way cliche from Disney movies. Repetitiveness and dullness are two words which would depict the most effectively abysmal awfulness of this piece of \"art\". I wonder how it is possible that so many people endured its predictability and aesthetic foulness.\\n\\n\r\nArt is simply average. Nothing that I wouldn't see before. Standard style copied in many in many second-rate animes. It generally makes me smile ironically so it gets 3/10. I don't see any reason to elaborate on that subject.\\n\\n\r\nNow we come to the best part of this pathetic creation which is not that good at all. There is some classical music included which makes me forgive revoltingly poor ending and opening. I just can't understand why music is often drowned by so-called cogitation of protagonist.This is unforgivable. And classical music itself is performed poorly anyway.\\n\\n\r\nAnd here we are - definitely the worst part of all show.Characters and their design. Catastrophe. Every character has his own hair color and none of them is natural. I wonder how much time it took to choose different shades of improbable greens, blues and violets. Disgusting is the best fitting word here. Well and personalities are two dimensional to say the least. In fact I couldn't see any difference between most of the character throughout whole series. Maybe that's because they don't differ. Just like other thousands of nameless characters of numerous animes which have been hopefully already forgotten.\\n\\n\r\nTaking all of it under consideration there may be only one verdict: If you ever encounter this anime you better split your eyes out and plug your ears or you will experience unspeakable torment. Well, if you have any aesthetic taste, that is.",
            "date": "2011-01-16T14:55:00+00:00",
            "helpful_count": 11,
            "mal_id": 33816,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/388613.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Ajamek",
                "username": "Ajamek"
            },
            "url": "https://myanimelist.net/reviews.php?id=33816"
        },
        {
            "content": "In the wake of finishing \"Nodame Cantabile Finale\", the latest series of a superb franchise that blew me away and got me into classical music, I found myself wanting to watch more anime about classical music. And that's why I decided to check out \"La Corda D'Oro: Primo Lasso\". I went into it fully expecting a poor man's \"Nodame Cantabile\" - such classics don't just grow on trees after all - but still, I couldn't help feeling disappointed even though I got exactly what I was expecting.\r\n\"La Corda D'Oro: Primo Lasso\" (to be abbreviated as \"La Corda\" for the remainder of this review) tells thestory of a normal girl Hino Kahoko coming into possession of a magical violin and taking part in the concours, the school's premier music competition, where she has to compete against a bunch of other students, most of whome study music.\\n\\n\r\nThere's not much to complain about the presentation of \"La Corda\". All the character designs are pleasing to the eye, and a sense of beauty and elegance often shines through particularly when a character is performing. But you can guess where the priority of this show lies from the opening credits featuring shoulder up portraits of all the main characters - none of them appear to be wearing anything! Not that it's a fiery, passionate tale about complicated love triangles or anything like that, but it does come off as an anime that's more concerned about superficial imagery than solid substance.\\n\\n\r\nAnd from the very first episode, \"La Corda\" does little to help you shake off that impression. Aside from its almost non-existent attempt at preserving story integrity by sweeping the concour selection process under the carpet, it soon becomes clear that the show is very much a reverse harem as Hino is quickly surrounded by more bishounens than you can shake a stick at. There's the Proudly Aloof Bishounen, the Mysterious Prince Bishounen, the Playful Bishounen etc - all the most common bishounen architypes in shoujo are here, and then some. They are, of course, her fellow students and competitors in the concours and, together with Hino, they make up the selection of characters featured in the portraits in the opening credits. The only person from the concours who isn't featured in those portraits is, unsurprisingly, the Other Girl in the competition. Because as everyone knows, in a reverse harem, the Other Girl is, of course, unimportant.\\n\\n\r\nThe main problem is that most of these bishies have totally flat personalities. Proudly Aloof Bishounen is like Chiaki from \"Nodame Cantabile\", except without any depth and taken to unbelivable extremes. Dopey Bishounen's characteristic dopeyness is also excessive - he can't even talk in a normal voice. Yes, we know he's not supposed to be quite \"with it\", but does it have to be so obnoxiously obvious?? And no, I don't find his dopeyness to be particularly amusing.\\n\\n\r\nFortunately, not all the characters are like this. Surrounded by the other princely bishies, Tsuchiura is refreshingly down to earth - as shown by the fact that I was unable to think of a nickname that shelves his personality into a stereotypical mould. Best of all, Hino herself is a good main character. Unlike most of the others, she actually plays a very genuine \"ordinary girl\" role. She'd never played the violin before, and her understandable anxiety and reservation for entering the concours with her magical violin, along with her gradual change of attitude towards music and in particular the violin are all aspects that are smoothly handled for the most part. Hino's involvement in a competition that's mostly reserved for specialised music students also means that she does have to cross some tall barriers to gain acceptance, and her refreshing \"outsider's\" approach to music as a non-music student goes some way towards breaking down the elistist attitude prevalent amongst the music students.\\n\\n\r\nHaving said that, I do have largely mixed feelings for the musical aspects of \"La Corda\", and it's especially interesting to compare this with \"Nodame Cantabile\". Firstly, it has to be said that there are no shortage of variety in the pieces performed in \"La Corda\". Beyond the standard selection of great composers such as Chopin, Beethoven etc that are covered by \"Nodame Cantabile\", \"La Corda\" also features quite a number of lesser known composers such as Boccherini, Reger, Vitali etc. It's a selection that I, as a casual listener to classical music, am largely unfamiliar with, and it's a selection that far exceeds the variety and perhaps even the quantity of music on offer in \"Nodame Cantabile\". Whether this is because the characters of \"La Corda\" focuses on the solo performances of so many different instruments while \"Nodame Cantabile\" is mostly involved with either orchestral symphonies or piano (both of which have a staggering number of well known pieces), it's hard to say. And along with those bits of trivia at the end of each episode, \"La Corda\" certainly gives the impression of having a broad knowledge of classical music. In addition, like \"Nodame Cantabile\", the music played in \"La Corda\" is also tailored to suit the story line (as in, if it's supposed to be a bad performance, you'll be able to hear from the music, although the tailoring isn't quite on the same scale as \"Nodame Cantabile\").\\n\\n\r\nOn the other hand, I have no problem in saying that I enjoyed the music of \"Nodame Cantabile\" far more than the music of \"La Corda\". Is this because the music in \"La Corda\" is simply not as good? Perhaps, but I feel there's a lot more to it than just the quality of the music...\\n\\n\r\nThe thing about \"Nodame Cantabile\" is that it simply comes off as far more passionate about its music. Everything about the show revolves around the music - it is woven seamlessly, inseparably into the very fabric of the show itself, with the story, the atmosphere and the music all complementing each other. And during the performances, the characters are often reflecting on the music itself. This means that it's easy to get affected by the show's infectious enthusiasm, and I found myself enjoying every performance, even when the music being played is not to my taste. In constrast, \"La Corda\" is too often caught up in its reverse harem aspects, with the incessant posturing of the sparkling bishounens and various love polygons (\"love triangles doesn't even come close to discribing it) proving to be a constant distraction. During the performances, the characters seem more concerned with their respective love interests than with the music they're playing. In addition, its philosophy towards music also seems to subtly change to suit the latest story arc. The result is that, despite certain similarities between the messages that \"La Corda\" and \"Nodame Cantabile\" are trying to get across, the former's attempts are sometimes undermined as it seems far less sincere in its attitude towards music. Also, \"La Corda\"'s music production feels mostly like a separate entity, isolated and often forced to stand by themselves, as though the people who worked in that area were working largely independently from the script writers and the storyboard (with the notable exception of the aforementioned tailoring of music). So while \"Nodame Cantabile\" seems to be capable to getting people interested in classical music, I have a hard time imagining \"La Corda\" to be capable of the same feat.\\n\\n\r\nTo its credit, the last third of the \"La Corda\" improves significantly. Most of the one dimensional characters develop some kind of depth to become 1.5 dimensional. Hino, who was by far the best character to begin with, goes through even more development. In particular, the way she chooses to deal with her final obstacle is surprisingly and admirably direct. If I have any complaints, it would be how unbelivably fast she manages to improve on an instrument as difficult to play as the violin - it usually takes people ages just to produce a sound that's not harsh! But minor gripes aside, the show really takes off and proceeds to pull out all the stops in the final concours. Here, the story, the atmosphere and the selection of music are finally all pulling in one direction. The performance of Bach's cello prelude that radiated a sonorous beauty, the performance of Lizst's \"La Campanella\" that grew from a delicate beginning to a tempestuous climax, and a dignified, graceful performance of Schubert's \"Ave Maria\" are just some of the highlights that bring a sense of elation, satisfaction and closure to a colourful final proceedings. For \"La Corda\", this is a rare occasion on which it manages to emulate the kind of magic that \"Nodame Cantabile\" produces with such casual regularity. After the final episode, some may feel the omission of a certain detail to be a bit of a cop out, but I'm of the opinion that the omission actually has the effect of highlighting what they DID show - Hino's courage and love of violin - to be the things that truly matter.\\n\\n\r\nThanks to the last third of the series gaining a focus, \"La Corda\" just about qualifies as a \"good\" anime rather than an \"okay\" one. Just like Tsuchiura is accused of being half hearted in his pursuit of music and football, for the majority of the series \"La Corda\" also seems guilty of half heartedly going for a lot of things. It playfully toys with the idea of romance but does not go anywhere with it; it tries to do some character development, but is hampered by its reverse harem elements and overly stereotypical characters it shackled itself with in the beginning; it seems to want to give off the impression of being serious about music while at the same time rarely displaying an inclination for exploring the subject past the surface. The result is that it's well beaten in all areas by \"Nodame Cantabile\" and ends up as little more than a genre specific show with an appeal that is unlikely to extend beyond its targetted audience. \\n\\n\r\nBut while all of this may sound like very harsh criticism for a series I'm labelling as \"good\", it's more to do with me being spoilt by \"Nodame Cantabile\" than anything else. Would I be scrutinising this show - in particular its musical aspects - so closely if it isn't for \"Nodame Cantabile\"? I doubt it. It's not so much that \"La Corda\" doesn't measure up as the fact that \"Nodame Cantabile\" set the standards far too high, and it's a tall ask for any similar anime to compete without coming off looking a lot worse. At the end of the day, \"La Corda\" is by no means a poor series - it's simply a poor man's \"Nodame Cantabile\". And that, to be fair, is nothing to be ashamed of.",
            "date": "2011-05-22T23:32:00+00:00",
            "helpful_count": 10,
            "mal_id": 37227,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302826.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kajia",
                "username": "kajia"
            },
            "url": "https://myanimelist.net/reviews.php?id=37227"
        },
        {
            "content": "(Read below the line for comments made before I finished the anime)\r\nHonestly, the ending left something to be desired.  If you are interested in romance, this may not be the anime for you.  There are elements of romance all over the place and there is even a hint to a definite couple...but, don't get your hopes up because there isn't anything beyond that.\r\nIt was a well made anime besides the problem(s) listed below.\r\nTO SUM IT UP:\r\n*Positivites: original plot, the art was beautiful, the characters (especially male) were gorgeous and had a variety of personalities\r\n*Negatives: repetitive problem/conflict in the story (see below the linefor explanation), (previous neg led to) flaw in main character's development (since she kept on going in circles), the sound quality when music started was not as great as it should've been for a music-based anime, ***things were left open-ended...but maybe there will be a second part or something (-_-*)\\n\\n\r\n----------------------------------------\\n\r\nNote: I am still watching the anime.  Thus, I will edit this review once I have finished.\\n\\n\r\nI feel like there is a main conflict that keeps repeating in this anime.  It seems it is resolved, but then the problem will come back around as if it was never solved in the first place.  What troubles me the most is that this problem has to do with the main character's (and the main plot's) development.  By making the problem reappear after being solved, it as if the writer couldn't come up with anything better or just keeps contradicting herself* (I had to blame her* since I'm sure she worked hard on this project.)  It makes the viewer not like the character---&gt;the main character seems immature, naive, ignorant, selfish...however, the story does not illustrate the character in such a fashion.  In other words, she is supposed to be this kind, caring, gentle person who learns from others.  However, this problem makes her seem to block off the lessons she learns from others.  Urgh, it's hard to explain...but yeah.\\n\\n\r\nOther than that, it's a pretty nice anime...definitely something new.  The characters are cute overall (and very GORGEOUS!!).  The sound for this anime would've been 10...however, considering the fact that it is an anime about music, they could've made the quality a bit better.  For example, it just didn't stand out as much as Nodame Cantabile.",
            "date": "2008-06-08T02:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 5325,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/63677.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dazedqt23",
                "username": "dazedqt23"
            },
            "url": "https://myanimelist.net/reviews.php?id=5325"
        },
        {
            "content": "OMG this was an incredibly boring anime...it took but sheer force of will not to drop this title! But rest assured I wasn't sitting in front of the monitor the whole time. Such a waste with all the lovely bishounen, but I guess it goes to show; \"you can't put lipstick on a pig\" and having all the bishounen in the world isn't a guaranteed success. But seriously, I shouldn't have to be a classical music major or aficionado to appreciate this anime. If I could enjoy an anime about baseball [Big Windup] when I dislike sports or be completely entertained by a story aboutgalactic garbage collectors [PlanetES] then I should be able to enjoy this anime. But I don't and not because of the subject matter but because of the story itself which I found to be very slow, non-existent in some parts, non-committal in others and totally indecisive.\\n\\n\r\nHhmmm, the art....,I wouldn't say it was terrible, but for a 2006-2007 title, I'm pretty much underwhelmed. Barring the character designs, which were lovely, there is absolutely nothing interesting about the art. The backdrops were generic, the sceneries were boring...actually anything that went beyond the characters was boring and inconsequential. Oh and be prepared for lots and LOTS of still shots like when the characters are playing their instruments, a lot of the time you'll just see still shots of them holding their instrument of choice with some serene look on their face. It doesn't happen all the time, some of the animation is nice [it's nice to see the fingers moving on the strings] but the static images do appear very frequently. And I feel, the topic of classical music is already boring enough as it is, they could have at least put some proper effort into the animation. Also expect to see the same audience for ALL FOUR concerts, there is a lot of recycling of stock images.\\n\\n\r\nNot much I can say about the music either, since I'm not a fan of classical music...I might have a vague interest in Baroque and some piano works but that's as far as it goes for me. I'm sure it's all lovely but it did nothing for me. Which if anything made me like the anime even less, but before you jump down my throat and say stuff like “then why did you pick an anime about classical music if you don't like classical music???” But like I said, from my own experience, anime titles in the past have taken topics I've had zero to little interest in and made them fascinating. I hate sports, but liked Wild Striker, Prince of Tennis and totally LOVED Big Windup! I hate Westerns but loved Gun Frontier, I hate talking animals and god knows how many of those are in anime? So I expected an interesting [if at the very least informative] story about classical music, but there was none of that, so I'm still pretty much an outsider when it comes to classical music. \\n\r\nI also have mixed feelings for the intro song “Brand New Breeze” part of me likes it but the other part of me think it sounds a little bit too much like a commercial for some kind of laundry detergent or feminine product....[just keeping it real, sorry]\\n\\n\r\nStory....hhhhmmmm, one word: ABYSMAL! OK so the story is about a girl who was magically chosen [for some reason or another, which is irrelevant since it's only some thinly veiled premise to get her surrounded by a bunch of hot guys] to participate in some sort of classical music playoff. But the contest is not the central theme, the actual theme is music appreciation and each character's relation to it...which, yes, may sound deep but none of this came across to the viewer. There was nothing that really drew me into being interested in classical music like I felt when I watched a baseball game with Big Windup, for example. There's no humour, there's no romance to speak of, they didn't even get into the technical aspects of classical music. In Hikaru no Go, they made moving those little game pieces on a board seem so exciting and dramatic and they also informed me about how the game of GO is played and even certain strategies and tactics. There is none of that in this series, except maybe if you want to count the fairy at the end talking about Bach and Beethoven, which I don't. \\n\r\nThis series seriously spent the better part of 24 episodes to talk about how each of them loved music or played their music [which to be honest sounded just a little more than pretentious “Ah this sonatta is so brilliant and the strings are so vibrant and so transparent”....yeah bull***t] There’s nothing else to this anime besides this and maybe some minor romantic innuendo [FAIL]. It's only after episode 20 when all the B.S. goes away, such as the magic violin and all that reverse harem kitsch that she, Kahoko, has to really deal with the fact of being a such novice violinist does the show even have any sort of merit.\\n\\n\r\nSo Like I said before, the character designs were lovely. I can't really complain there! And to be honest, that's the only real selling point of this series: very nice character designs and a lot of time spent on character development. That being said, it's not like we're going to discover anything new with these characters, they all pretty much follow the typical anime character templates: The Femme/Bishie Heartthrob, The Sporty one, The Angelic/Loli one, The Loud Comic one, The Posh/Stuck-up one, The Glasses one, etc... It's all pretty much colour-by-number, isn't it?\\n\\n\r\nMy Verdict: The cast is PRETTY, but the show's BORING so overall it's \"pretty boring\"....get it? Hey, gotta do something to entertain myself cuz god knows this anime ain't doing it for me.",
            "date": "2012-01-22T18:20:00+00:00",
            "helpful_count": 6,
            "mal_id": 52353,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48644.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Bishounen_Hunter",
                "username": "Bishounen_Hunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=52353"
        },
        {
            "content": "The review sort of says it all. La Corda D'oro was slightly better than average, but with good art and music. I thought that the characters were CUTE, and that was it. Hihara basically kept me watching that show. While I enjoy reverse harems, I can't say that I've ever actually watched a good one. I'd much rather read/watch something thats riveting and twisted than some sugar-coated shojo about musical instruments. Oh, but for a laugh, watch episode 26. Its pretty much a filler...wait...the whole show is fillers! That's true. There are only about three episode that actually matter for the plot...wait...the show has noplot! Well, it might, it's just being constantly smothered by ODs of classical music/unrequited love. BUT, despite all the random crap that has been sqaushed into this anime, there's something about it that makes it not a total waste of time...wait...it WAS a total waste of time! But at least it kept me entertained enough to watch the whole thing. The characters are sort of funny, the plot is sort of interesting, and the show is sort of enjoyable. The end.",
            "date": "2009-08-17T00:07:00+00:00",
            "helpful_count": 5,
            "mal_id": 17827,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Shinganai",
                "username": "Shinganai"
            },
            "url": "https://myanimelist.net/reviews.php?id=17827"
        },
        {
            "content": "OK.... the short review of this show= it is a reverse harem anime with music, magic, and a fairy....not much fan service and great musical pieces throughout.. if this sounds like the show for you great! If you are still hesitant... here is the deeper review:\r\nStory: I'm not going to harp on this... for it is a reverse harem anime that is mediocre... that means that there are attractive males throughout that like the main female lead who is usually pretty useless and emotional. So, i expect everyone wanting to watch this are already expecting a storyline that is simular to the one I justdescribed. Now, this one is definately mediocre, it is not as good as ouran high or fruits basket, but it could definately be worse (i personally believe the music is what mostly saves this) The good: I was able to finish the series and somewhat looked forward to the next episode (i say somewhat hesitantly)\\n\\n\r\nArt: again...decent... seemed pretty most of the time... However it really shined when the characters were playing their instruments. It really could make you sit on the edge of your seat if a character was playing a fast-pace song, especially when the song was played by the piano or the violin (these two insturments seemed to be animated the best the majority of the time)\\n\\n\r\nSound: BEAUTIFUL!!!!!.... but i must harp on this... they are pieces that many people have heard because they were done by famous composers... the music the anime had that was unique to itself like the opening and ending scenes were horrible! namely the intro song (the ending song i don't really know if i ever watched it all the way through and therefore don't remember much) The intro song should have been full of classical music and beautiful scenes of people playing instruments right? WRONG!.... if you are going to watch this anime... JUST SKIP THE OPENING! And again, the rest of the already famous pieces were good throughout the show.\\n\\n\r\nCharacter: the good= the main heroin wasn't as annoying as I was worried she would be. A couple of the males had ok stories and one of the character's true nature caught me by surprise... also.. there were more females in this show than in typical reverse harem shows... or at least I thought there was more than usual... kinda refreshing actually to not be shown yet ANOTHER pretty boy for every character spot that needed to be filled. the bad= they are cookie cutter characters that are typical in a reverse harem anime.  One character that i want to harp on especially is the loli boy that plays the cello....HE IS A WASTE OF CHARACTER! He is only there so that the anime can say that they have a loli boy other than the fairy.... he really has no true emotion and is a waste of space! ..... he plays the cello nicely.. but why couldn't he actually do something more than just sleep, play cello, sleep, say an interesting fact, sleep, then say a little something that is slightly inspirational that any other character could have said!!!.. (sorry... just ranted)\\n\\n\r\nEnjoyment: ..I finished it... take that as you will... (few of the characters were slightly enjoyable, i liked the music, and the twist in the one character did surprise me even though it probably shouldn't have)\\n\\n\r\nOverall: its ok.... i like the classical music elements, the animation of some of the instruments.. some characters grew on me a little.... but nothing too amazing... If you want the best that this 'pretty boy' genre has to offer... watch/read Fruits Basket or Ouran High.... If you want to know what this one is simular to... it is like UTA no Prince Sama 1000% and its sequel UnPS 2000% however Uta no Prince has a SUPER pathetic main female lead... and stupid fanservice at random points... >.< OY VAY!",
            "date": "2013-07-19T22:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 106055,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2554903.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Midori_Suzume",
                "username": "Midori_Suzume"
            },
            "url": "https://myanimelist.net/reviews.php?id=106055"
        },
        {
            "content": "La Corda D'Oro is pretty much the first anime I ever watched, so I have somewhat of a nostalgic attachment to this show. It’s a sweet and relaxing anime about a music competition and explores the effect music can have on one’s life and the people around them. If you have an interest in classical music and don’t mind somewhat simplistic characters, I would encourage you to give it a try.\r\nSTORY:\r\nThis show is about a music competition, and centers around Hino Kahoko, who was named as a competitor despite having no knowledge or experience in playing the violin. It’s a character-driven story, and focuses onthe interactions between Kahoko and the other participants, and explores what music means to each of them. It spans the course of the entire music competition, and I like how the four main events serve as major turning points in the story and the characters’ development. It’s a simple and somewhat predictable plot, but the use of music and the structure of a competition makes it an enjoyable and relaxing ride.\\n\\n\r\nCHARACTERS:\\n\r\nThe characters all seem to fit into a stereotype, which makes their behavior somewhat predictable and lacking in complexity. But all of the characters are likable (though some more than others) and they all have a decent amount of character development (though again, usually predictable). All of this character development centers around Kahoko and her genuine love for music. It’s fun to watch how much of an effect Kahoko has on her fellow competitors and her classmates, and especially the effect this music competition has had on herself.\\n\\n\r\nOne thing to note is that this is a reverse harem, so most of the guys develop some kind of crush on Kahoko. But these feelings don’t lead to an actual romance, and merely serve to influence each character’s behavior. I have no complaints about the lack of concrete romance, and prefer to have it open-ended given that it’s a reverse harem (and I’d rather not see the show choose one pairing and leave everyone else disappointed). All the guys care about Kahoko in their own way which I found sweet, and I was satisfied with the way the show handled it.\\n\\n\r\nSOUND:\\n\r\nSince this show is centered around classical music, you’ll get to listen to a variety of short pieces throughout the series. Each song fits the scene, and it’s one of the show’s strength (since there aren’t a whole lot of anime about classical music).\\n\\n\r\nART:\\n\r\nIt looks decent, and I have no major complaints.\\n\\n\r\nENJOYMENT:\\n\r\nI found this show sweet and relaxing, and I enjoyed the competitive spirit and the focus on classical music. It’s a simple story and doesn’t have anything unique or complex to offer, but it does a good job for what it is. Its biggest flaw is its simplistic characters and predictable plot, but the abundance of music is what made this show enjoyable for me.",
            "date": "2016-11-25T19:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 234386,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3805971.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/azphyron",
                "username": "azphyron"
            },
            "url": "https://myanimelist.net/reviews.php?id=234386"
        },
        {
            "content": "To be honest all thanks to my big sister I'm watching this! She talked me into it! I'm really interested now in playing and listening to music all thanks to this show! I always like go to youtube and listen to music like Fantasie-Impromtu one off my favorite pieces! I'm gonna miss La corda d'oro primo passo! This is where I get my courage in playing the piano! I love playing the piano so much! Thank you La corda D'oro you made me enjoy music!",
            "date": "2009-04-13T20:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 14127,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sakurafeather",
                "username": "sakurafeather"
            },
            "url": "https://myanimelist.net/reviews.php?id=14127"
        },
        {
            "content": "Remember to give any sort of criticism as possible, good, bad, constructive, useless, and even harsh, I accept It all! From the first two I even learned a few things! I'll try to keep spoilers as LOW as possible.\r\nFirst Comments: This show is one of the very few music based animes that I REALLY enjoyed. The music was great, the sound was also great. The story though needs a bit of critic and the art was good but there's always room for some critic.\r\nStory: The story is somewhat clichéd. All these events that somehow and suddenly lead to spectacular events that seem; somewhat not believable.Luck I might say and a bunch of it too. No matter how many times I look back on it, it seems too good to be something within normal \"naturalness\". The addition to some magic in the show does somewhat counteract the unbelievable part, though I adds some childishness to the story. Which I thought was kind of silly. Though It did add some comedy into the mix. Even though it's kind of clichéd it's also rare somewhat. Reverse harems seems little to none these days. I really enjoyed the addition of reverse harem to the story because It made it seem more unique and interesting. Though it's plot might not be solid and fool proof, It's still very well executed. Even though I'm not too big of a fan on school dramas, it was one those that I enjoyed. The flow of the story is a little different than I expected, not in a bad way though. The exposition just seemed to smash into me, giving me a lot of background information with it along with the rising action. It even made me excited or reacted somewhat at the climax! This all coming from a musical anime!\\n\\n\r\nArt: The art is very good, though I still wonder about the hair colours... Not a problem though, it was just like a rainbow :P The art style is a bit more \"mature\" not cartoonish or kiddy. It gave it a bright happy look to it. But sometimes when the time was right the sad and melancholy settings are just perfect along with the character's emotions and the music. The background overall was good, though I really couldn't pay too much attention to it due to the fact my eyes and ears were mesmerized by the animation of them playing those instruments and the sounds flowing out of it. The faces of the people seemed to change though, I really enjoyed that actually! Since it made it just a little more realistic, because in real life, no one looks exactly the same, everyday... The best part I have to say about the art is the animation when they play the instruments. Like I said before it really feels like you're getting absorbed into it.\\n\\n\r\nSound: What can I say? It's a musical anime, of course I have high expectations for it! La Corda handed it too me nearly flawlessly. Though there might be some mistakes some people might say, it's all really hard to point out. Due to the fact that the main music hides all the background music and makes you literally forget all about it. Also since I'm a big fan of classical music, it might be a LITTLE biased. Nonetheless it's still very well done. There was one problem though. Even though the main music attraction was great, big, and epic. It just had that problem. It overpowered the rest of the little music in the background. Though I might be contradicting myself, it is true. Using some none music animes like Chobits as an example, I can clearly remember all or most of the background music. This is a musical based anime though, so the music should be the main attraction; even though that is true they should have made the background music more \"rememberable\" is how I'll put it. Even through those it's still quite hard to point out mistakes. I only gave it 9/10 due to one thing I learned. Nothing in music is perfect, there is always room for more improvement. (yes I due play an instrument and somewhat to quite well as a matter of fact)\\n\\n\r\nCharacter: The characters were very well planned out. From the hair colour suiting their feeling and emotions to the instrument they chose to play, it all matched up very well. I don't have much to say here due to that fact the only problem I had was with the way they were set up. It might sound confusing but, the way they almost all appear at school or within the area, then they suddenly know each-other and become friends. Also the romance is a bit stereotypical type of romance inside anime. The main character lead also is a bit clichéd type of person. It might be just because I've watched so much anime that it seems that way, but overall the characters were very good and somewhat \"believable\". (my favourite Kazuki and no I am not gay, I just preferred his instrument over the rest *hint**hint* :P) You can also see why the anime might be more focused on the female population ;P\\n\\n\r\nEnjoyment: It was very enjoyable actually, though I doubted it at first when I say the genre was Shoujo, not saying that there aren't any good ones just saying that I didn't think it would be so exciting! The main points of excitement would be any time they play their instruments, like I said before, it makes you flow into it and listen to it with your um... \"Second ear\" meaning you get a deeper richer understanding of why they chose that song, how it suits them playing it, and the theme they're trying to play/show. If you're a music lover like me you could even just close your eyes and listen solely to the sound (though it would be quite hard if you weren't literate or understand Japanese. I don't either. I'm jut saying it's just that enjoyable)\\n\\n\r\nOverall: It was really hard to pick out a lot problems with the story, the sound is really where it captured me, so I HIGHLY recommend it to anyone, especially classical music lovers.",
            "date": "2008-08-15T15:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 7152,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85715.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zerokill",
                "username": "zerokill"
            },
            "url": "https://myanimelist.net/reviews.php?id=7152"
        },
        {
            "content": "This is my first time writing a review, so please bare with me.  \r\nThis anime is one of the best ones I've seen in a long time. It was amusing and funny. It was more funny in the beginning, but once you got towards the of the series it got serious and sad. The ending was pretty good. I love Kaho-chan!!  \r\nIt taught me a lot about classical music, I actually like it now. It made me want to go buy a violin and try playing it.  This is an awesome anime. :]]\r\nOver all I would recommend this anime to everyone!",
            "date": "2010-04-23T18:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 25374,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/197049.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ExSxGURL16",
                "username": "ExSxGURL16"
            },
            "url": "https://myanimelist.net/reviews.php?id=25374"
        },
        {
            "content": "Your first thought may be \"Why a nine for a video game reverse harem adaption?\" Many of these are often rated pretty harshly one being that the heroine never ends up with any of the guys. Not that this one does, but there are many aspects of this show that makes it different.\r\nStory: I guess you can say the story has some unique aspects to it. Magical violin didn't appeal to me very much in the beginning but as the it went on, the story started to slowly develop more potential around this \"magical\" violin. I can't really say much more without spoiling the story..sooverall, I thought the story/plot was pretty intriguing. \\n\\n\r\nArt: Hmmm..art is something important when I watch an anime. Kiniro's art was nice and the scenes where the characters played their instruments were nice to watch. Of course, there were nice scenes with romance in it too.\\n\\n\r\nSound: The music in this series were what amazed me the most. Every piece of music has its own meaning and touch to it. The opening of the show was a very nice piece especially. You'll see throughout the story, there will be many different pieces of music, so of which, you might recognize (if you listen and play music often).\\n\\n\r\nCharacter: Character development was okay to me. You'll see the main heroine grow and change throughout the story with the help of Lili (fairy) and all the guys around her.\\n\\n\r\nEnjoyment: Overall, I enjoyed this show a lot. Also, as a music lover it was pretty fun to watch. I have to say the ending disappointed me a bit since the heroine didn't end up with anyone, but I guess that's just how it goes.",
            "date": "2013-01-27T14:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 85041,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1571401.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/onesnowyday_",
                "username": "onesnowyday_"
            },
            "url": "https://myanimelist.net/reviews.php?id=85041"
        },
        {
            "content": "My very first review! Yippie!\r\nStory [10]\r\nHm... Maybe I'm biased and all, but I absolutely LOVE anime like this, which is reverse harem. Very exciting, so to speak. Kahoko Hino, a girl who has never touched an instrument, is literally forced to compete in her schools musical competition after meeting a musical fairy. Generally, the music department students get to do this, so this means Kahoko is the only General - Ed character that participates (Actually no, but I'm not going to spoil anything).  Anyways, a girl is surrounded by typical bishounen guys. And they all like her. The best way to describe this storyis love CIRCLE. Seriously, it made me hungry for the next episode. It's mainly emotional (and for some episodes, pure DEPRESSION) but it's still pretty funny at parts. Story was outstanding. 'Nuff said.\\n\\n\r\nArt [10]\\n\\n\r\nThe art's great. Love it, perfect type of art for a perfect bishounen anime. The artists made everyone very attractive.\\n\\n\r\nSound [10]\\n\\n\r\nWell, no DUH! The music is the best part of the show! It honestly got me into classical music ( In fact, I believe I have one of Kazuki's songs on auto-replay right now...). But still, the music is the best. Out ranks 98.9% of all anime music. In my opinion, of course. The music is emotional when it needs to be, and there are a lot of happy tunes going on in the anime too. Trust me, you'll get hooked.\\n\\n\r\nCharacter [8]\\n\\n\r\nI have an itty-bitty problem with the characters. Their personalities: Great! However, I would like some more background knowledge from a few of the characters. That would mean a 9 from this, but there was ONE character in which the anime didn't introduce AT ALL. And he was pretty good-looking too. Other than that, the characters were AWESOME! And there was some surprisingly good character development.\\n\\n\r\nEnjoyment [10]\\n\\n\r\nIt kept me on the edge of my seat! The music added very nice touches to MANY emotional and squeal-ivating scenes. Lots of drama and each of the boys get their fair share of lovey-dovey scenes. Melted my manly heart.\\n\\n\r\nOverall, this series gets a 10. Meaning,\\n\\n\r\nWatch it or I will hunt you down. 'Cause I know where you live.\\n\\n",
            "date": "2011-10-19T16:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 45851,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/776925.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kushukushu",
                "username": "Kushukushu"
            },
            "url": "https://myanimelist.net/reviews.php?id=45851"
        },
        {
            "content": "I absolutly loved this anime!!!! It is the best anime I have ever watched!!!! First i only started with Bleach and thought that that was the best, then i watched others, and then i watched this one, which went wayyyyy beyond my expectations!! I play violin and i can really connnect and understand this story. It was funny, passionate, enjoyable, and had great music. i want to play the music from this anime and widen my range. I reccommend this anime for those interested in music, or think this will b a good anime to watch.\r\nIM sorry if this review doesnt help much :( itsmy very first and i loved this anime so much i wanted to share my opinion about it :)",
            "date": "2010-08-16T14:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 29692,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/359252.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/misakiandusui",
                "username": "misakiandusui"
            },
            "url": "https://myanimelist.net/reviews.php?id=29692"
        },
        {
            "content": "La Corda D'oro is one of my favourite anime. The main character is Hino Kahoko. She has a magical violin given to her by Lili. This is a reverse harem anime targeted at shojo audiences, all the boys who participated in the music competition in school had a crush on Hino Kahoko. Among them is my favourite character in the anime, Tsukimori Len. He is a boy who has a cold face but actually cares for others alot, especially Kahoko. He is very handsome and is a violinist too! (like me) I like this anime mainly because of the music. People who like reverse haremand people who are interested in classical music should really watch this AWESOME anime(:",
            "date": "2009-11-27T04:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 20890,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/263064.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xiaoxin",
                "username": "xiaoxin"
            },
            "url": "https://myanimelist.net/reviews.php?id=20890"
        },
        {
            "content": "I really like reverse harem, because I think there's too little of them. This is definitely one of the best romantic anime that I have watched. The plot is very good because it covers every main character in depth and shows great character development. There's a bit of disappointment with the actual romance, because in the end, it doesn't show you who the main character ends up with. The music in this story was awesome. If you know music yourself or not at all, it may make you more interested in it. The art is really beautiful, too. They paid attention to all categories. \r\nI'mnot going to give a summary, because this is a review. \\n\\n\r\nOverall, I would give this a 9.8 for the rating because the everything was outstanding.",
            "date": "2014-01-17T16:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 129131,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3497691.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/xxSweetBunny",
                "username": "xxSweetBunny"
            },
            "url": "https://myanimelist.net/reviews.php?id=129131"
        },
        {
            "content": "La Corda D’Oro ~ primo passo ~ was a quite enjoyable anime to watch. It combines a bit of comedy, fantasy, romance, and drama all in one. Not to mention, this anime is a reverse harem. \r\nWhat I liked: \r\nWhat impressed me the most in the anime was the theme songs it had which was (personally) very enjoyable to listen to. Also, while watching this anime, I was exposed to a wider range of music and more general musical knowledge in the little segment at the end of the show and during the show itself. The show itself had quite a bit of drama andtwists too. There was also something that made me quite addicted to it for some time (or maybe it was just me?) \\n\\n\r\nWhat I disliked: \\n\r\nAlthough I do like the personalities of some of the characters, some of them are a bit typical and predictable. The main character / protagonist has her good and bad points, but enchants and changes all the other characters in a good way. Another main character is a genius violinist too, but is cold and harsh and only thinks of winning. There are many more typical characters like this in the anime. \\n\\n\r\nThe anime also gives out an equal amount of time between the protagonist and other characters, but this makes the storyline a bit boring the middle. In the middle of the anime, there were also a few irrelevant episodes that do not seem needed for the main story, but just adds some comedy and romance in between. \\n\\n\r\nI would recommend this anime to amateur musicians such as myself, those interested in music, or those who would like a bit of romance and comedy with a music theme. \\n\\n\r\nAll in all, this wasn’t a bad anime, maybe with some quirks, but it was still enjoyable.                           \\n\r\nThe source I used was www.crunchyroll.com I hope this review helped! \\n",
            "date": "2009-08-06T10:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 17540,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/206943.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jHorizon",
                "username": "jHorizon"
            },
            "url": "https://myanimelist.net/reviews.php?id=17540"
        }
    ],
    [
        {
            "content": "La Corda was one of the first animes I watched from start to finish a few years back. The story is nothing spectacular or other-worldly, but the way it was conveyed felt so...magical. Maybe it was the music, or the art style. But, whatever the case, I finished this series feeling so good about it. It's nothing super serious or revolutionary, but it definitely is a feel-good kind of show. Especially for those who enjoy the reverse genre. \r\nThe show is cute and soothing so, if you're looking for a nice way to pass the time, I think that it is worth a watch. Itdoesn't have a whole lot of rewatch value, but I think it was a great show overall.",
            "date": "2016-08-08T18:16:00+00:00",
            "helpful_count": 0,
            "mal_id": 226267,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Too_enthused55",
                "username": "Too_enthused55"
            },
            "url": "https://myanimelist.net/reviews.php?id=226267"
        },
        {
            "content": "Masterpiece of Shojo!! Well, I can't help from making several fanfiction based on this. Although some of them are war-related FF. I prefer to enjoy the music instead of the romance because I'm a maturing man.\r\nThe story is extremely well-built to show who fights who to gain Kahoko's love. I know that such an anime wold be classified as shojo, but I took the wrong anime.\r\nThe art or the design is perfect. From the school's layout until Kahoko's bruises are well-drawn. Their clothing vary widely and used equally one another, depends on situation and airtime proportions. Nothing more expected.\r\nSpeaking of sound in music anime iscompulsory. The classical pieces are reduced in order to conserve time for romance. But we can find the original pieces in the classic collection. The Opening Song \"Brand New Breeze\" is extremely good, beyond perfect for an anime soundtrack. This song is made by classical music style, already giving vague idea how this anime will go.\\n\r\nThe character is largely S.S.D.D. (short for \"same shit different days\", USMC term) with nothing much difference, only very rational appearance, I'll skip the bishonens because I'm not gay.\\n\r\nEnjoyment is also perfect. An exceptional fan-service is when so-called Yunoki-sama (I prefer to say U-know-kisama) is literally going to rape Kahoko (WTF!!), the scene is set, just do that and goodbye lucky bitch.\\n\\n\\n\r\nI like Shoko Fuyuumi, though. She makes me fapping on my imagination, damn you, little shy bitch!",
            "date": "2011-02-06T05:19:00+00:00",
            "helpful_count": 0,
            "mal_id": 34295,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Cruiser",
                "username": "Cruiser"
            },
            "url": "https://myanimelist.net/reviews.php?id=34295"
        },
        {
            "content": "this anime is really fun i`m sure all of you will like of all the animes i`ve known and watch this anime stands out for me\r\nin this anime you`ll find musical instrument really fun to watch and play i`m sure everyone of you will like this LA CORDA D` ORO is the anime that i`m sure you`ll be interested in...\r\nhere, you`ll find musical instrument really interesting and you`ll know thatyour heart and soul must be put when you play an instrument.As long as you put your  heart into the instrument i`m sure most of the people will love your play.\r\nI HOPE YOU`LL ENJOY YOURWATCHING......  ^_^\\n\\n\r\n                                                                                           -hino_kahoko11-",
            "date": "2010-06-29T21:25:00+00:00",
            "helpful_count": 0,
            "mal_id": 27779,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/311957.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/hino_kahoko11",
                "username": "hino_kahoko11"
            },
            "url": "https://myanimelist.net/reviews.php?id=27779"
        },
        {
            "content": "a very unique and lovely series.  And straight-forwardly i have never seen a show like this.  \r\nYou totally want to put yourself in Hino's shoes(girls do~) you have so many hot pretty boys around her, and you never know who'll she'll end up with, and that might be the annoying part to some people.  I have recommended this show to 3 of my friends all of them saying they loved it and are hocked so much they're buying the manga just to find out who'll she'll pick ^^\r\n and for classical music lovers like myself, were caught in a lovely daze asthe beautiful music began to play famous names and songs are constantly mentioned, you can totally relate to the show as well.\\n\\n\r\nit might be a bit to corny for boys, but i still recommend!",
            "date": "2009-10-01T19:02:00+00:00",
            "helpful_count": 0,
            "mal_id": 19292,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/61021.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/animegirlfan",
                "username": "animegirlfan"
            },
            "url": "https://myanimelist.net/reviews.php?id=19292"
        },
        {
            "content": "This anime was very good towards the music area. They showed a very good display of instruments and classical pieces such as the canon or Salut' d amour. The animation was decent overall, at some points it was really well done, some werent so flattering. But the story line is very good and the characters you'll fall in love with! ^^",
            "date": "2009-05-29T18:19:00+00:00",
            "helpful_count": 0,
            "mal_id": 15372,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/35171.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/graceleewon",
                "username": "graceleewon"
            },
            "url": "https://myanimelist.net/reviews.php?id=15372"
        }
    ]
]