[
    [
        {
            "content": "Many criticize the harem genre of anime for its overly formulaic approach and execution.  And Ladies vs. Butlers will probably not change the opinions of these critics, since practically every convention common in harem anime is crammed into this show.\r\nThe premise behind Ladies vs. Butlers is simple yet predictable.  The main character, Hino Akiharu, attends a school for upper-class ladies that is also dedicated to instructing maids and butlers how to function in high-class society.  The story basically details Hino interacting with the various girls at the school and the various ecchi situations he gets himself into.  The majority of thisseries is episodic and, in all honesty, serves nothing more than to introduce the female characters and to show ecchi scenes.     \\n\\n\r\nLadies vs. Butlers includes almost every female archetype found in the harem genre: a tsundere, a childhood friend, a (reverse) trap, lolis, clumsy girls, foreign girls, etc.  The harem lead, Akiharu, is also a fairly generic character.  While he doesn’t fit the “total loser” persona as many other harem leads do, there is nothing really noteworthy about him.  Also, there is hardly any significant character development, but that is to be expected of an anime of this type.   \\n\\n\r\nThe art is decent and very reminiscent of one of XEBEC’s earlier productions, Kanokon.  And while some of the character designs may be slightly off-putting (for example, there is a 19-year-old girl who looks like an elementary school student), this will not detract from overall enjoyment of the anime.   \\n\\n\r\nThe opening and ending songs are appropriate for this kind of anime but nothing all that memorable, and the voice-acting suited each character’s personality well.  The background music is virtually nonexistent, though you will probably be too fixated on all the bouncing breasts, panty shots, and nudity present in this anime to even notice.         \\n\\n\r\nWhile Ladies vs. Butlers does not fail in one particular aspect, its main issue is that it does nothing to stand out from the countless other harem anime out there.  It doesn’t deviate from the harem formula at all, and as a result, this anime most likely will not appeal to anyone looking for anything more than fanservice and comedy.  However, if you are a diehard harem or ecchi fan, you should give Ladies vs. Butlers a try.  \\n\\n\r\nOverall, this was a decent ecchi/harem anime, albeit nothing exceptional or ground-breaking.",
            "date": "2010-03-25T17:19:00+00:00",
            "helpful_count": 139,
            "mal_id": 24316,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/197890.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/rpatwater",
                "username": "rpatwater"
            },
            "url": "https://myanimelist.net/reviews.php?id=24316"
        },
        {
            "content": "Hey, here's a fun game! In thirty seconds, try and see how many common Ero-game character archetypes you can think of then, see how many of them you can find in Ladies versus Butlers. I did the same thing and found all of them before I was even halfway through episode 1. You name it, they've got it! From tsundere, to clumsy chicks, to childhood friend/tormentor. They even have an OBVIOUS reverse trap who's roommates with our main hero and what harem would be complete without  a 19 year old girl who looks like she's 10!\r\nHowever, I digress. The truth is Ladies vs. Butlersis a harem that tries to mash as many cliches(God, I hate that word) of the harem genre into one place, hoping it won't just collapse on itself. And while the whole \"Oh crap! I tripped and grabbed your titties\" can be good for a laugh once and a while, devoting an entire episode to it may be crossing the line. Especially when we get to the level of \"Clumsy maid girl falls onto to guy and rubs her cooch on his face\".\\n\\n\r\nIn terms of story, it's the usual deal. Guy transfers to a \"special\" school for butlers, maids, and up and coming \"ojou-samas\", that has an insanely unbalanced ratio of boys to girls because, how are you gonna have a decent harem, when there aren't 20 girls to every guy. The music is nothing special and, as I said before, the characters are very ordinary. Things may get better over time but, as things look now, that is very unlikely.",
            "date": "2010-01-06T10:15:00+00:00",
            "helpful_count": 88,
            "mal_id": 22124,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/108763.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/NoBadsign",
                "username": "NoBadsign"
            },
            "url": "https://myanimelist.net/reviews.php?id=22124"
        },
        {
            "content": "I'm just gonna get the obvious stuff out of the way first. Ladies versus Butlers is an ecchi harem comedy that does little to break the chain of \"we don't need a story as long there are boobies\" shows that we see in shows of this genre. Almost all the characters fall perfectly within some set archetype, and don't really see anything in the way of character development. Also, this show has more of these archetypes than I think I've ever seen in one place, as well all the gags you'd expect in this genre.\r\nDespite this, I still enjoyed this series quite a bit ,for two main reasons. The main character, and fact that the non-ecchi related jokes were actually funny.\\n\\n\r\nStory: Didn't really expect anything from the story to begin with, didn't really get anything. The show basically just follows him around as he lives at this school with all these girls. No real plot. He's just sorta there with all these girls, and.... yeah.\\n\\n\r\nArt: The show does look nice, which is definitely a plus. It's not incredibly unique in terms of style, but it's not bad to look at either. It gets the job done for this series just fine. A show based on fanservice should be something fans would want to look at, no?\\n\\n\r\nSound: Not really anything notable about the sound. The OP was kinda catchy, but that's about it. It wasn't bad, but it never really stuck out during the series.\\n\\n\r\nCharacter: The show has more character archetypes crammed into it than I've ever seen in any place before, and nobody really develops beyond these roles. However, I was pleasantly surprised by Akuharu. While he's no brilliant character himself, I'd definitely choose him over most of the other male leads you see in ecchi harem. Him not being a spineless loser without any backbone or opinion of any kind was nice change from the usual, and his appearance (red eyes, scar on his eyebrow, and not small/wimpy) felt like someone actually gave it a bit of thought rather than just taking the concept art from another ecchi harem and doing just enough edits to make him not a blatant clone. For the first time, I actually CARED about the male lead. While there's still lots of work to be done in terms of characters, L x B was at least a step in the right direction.\\n\\n\r\nEnjoyment: While there was more than enough fanservice for those who came here looking for it, the show was quite amusing with its more worksafe bits humor(the principal and ninja maid in particular). It was enough to keep me watching the entire way through, although I really would have liked to see more of it in place of the \"I tripped and grabbed a boob\" gag or the ever present \"Some random situation has forced us into a sexually awkward position\" bit.\\n\\n\r\nOverall: Ladies versus Butlers is by no means a greatanime, but it definitely preferrable to most of the shows in this genre. Akuharu hinted at something in the way of effort in his design, the art looks very nice, and there's enough not fanservice related humor to actually, well , make someone not as into that as others find some enjoyment out of this, however small that may be.",
            "date": "2010-06-16T15:21:00+00:00",
            "helpful_count": 57,
            "mal_id": 27233,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332743.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Kilik64",
                "username": "Kilik64"
            },
            "url": "https://myanimelist.net/reviews.php?id=27233"
        },
        {
            "content": "Ladies versus Butlers!\r\nI watched this anime because of the ecchiness that i wanted to see and i thought this was going to be great but it was just good, i enjoyed it, but not as much as i thought.\r\nStory\r\nIt's too simple, is about a boy named Akiharu who is transfered to a school of maids and butlers and attends classes with the rich people and he will find nice people and even if he looks like a delinquent he helps people when they request help from him or when he sees they need help but there will be people that wants to make his lifea living hell; The ending was bad, it was an open ending so the story was fine.\\n\\n\r\nArt & Animation\\n\r\nThe art is good but is a let down because all the girls have the same faces just with different hair and boobs but is colorful and of course the ecchiness was good.\\n\\n\r\nSound\\n\r\nThe sound was good, the music background is ok the voice acting wasn't bad and the OP and ED were ok.\\n\\n\r\nCharacter\\n\r\nEven tho the girls looked the same just with different hair, they have different personalities that where good on them, Akiharu was kind, he looks like a delinquent but he is a good person, he is fu**ing slow understanding the girls feelings, he was really dumb, that's why he didn't get any of them.\\n\\n\r\nEnjoyment\\n\r\nWhat i enjoyed the most was the Ecchi and this has a lot and the specials were really good. ( ͡° ͜ʖ ͡°)",
            "date": "2015-08-05T17:00:00+00:00",
            "helpful_count": 31,
            "mal_id": 195270,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195270"
        },
        {
            "content": "Ladies versus Butlers in an anime that when you first watch it, already gives the impression that they've tried to implement as much clichés as possible in the first episode. Ranging from the overused oh-I-tripped-and-accidentially-touched-your-boobs-with-my-hand scene to lolis that look half the age they actually are, you'd have trouble coming up with something they haven't used yet.\r\nThe characters are as flat as they get. One of the first characters you meet is a tsundere, next is the childhood-friend/tormenter, followed by a shameless perv and a gay who's too full of himself - just to give you a fraction of the archetypes you'll meet in thefirst two episodes. It's possible they'll change during the series, but my first impression isn't too much. - 3/10\\n\\n\r\nThe story is quite absent in those episodes, only a small part is revealed already but what has unfolded already doesn't promise any high-quality story at all. I could be wrong though, I've already met an anime that managed to pull out quite the story while having an (almost) equally senseless beginning. Who knows what Ladies vs Butlers will bring us? For now, I don't think I'm able to give much either. - 4/10\\n\\n\r\nMoving on to the better parts of the series, the art isn't anything special, but does the job it's supposed to do just fine. Considering this still is a comedy, the style is very functional and overall apeasing. This is a score that most likely won't change at all during the broadcast of the show so you can consider it final. - 7/10\\n\\n\r\nWhat I really do like about this anime is the sound. Not only are the OP and the ED very catchy songs on their own, the background music during the series itself is also very nice. FX'es likewise. The voice acting isn't something outstanding, but still good enough as there aren't any negative remarks from me. Again, this isn't something that is prone to changing during the duration of the series so this is final too. - 8/10\\n\\n\r\nLast - but not least - is the enjoyment. This is the most important part of the show because it's a comedy - obviously - so I took my time deciding on a score. The show is quite funny, even if it's laughing at the excessive use of clichés. Humor is well-timed and sometimes even manages to come from an unexpected corner. I sincerely hope this won't slack off during the series because that'd be a shame. But since it usually only gets better I gave it quite the respectable score. - 8/10\\n\\n\r\nNow, because comedies are supposed to make you laugh and not ponder about amazing character complexity or godlike plot twist, these factors won't be taken into account very much. Because the direct viewing experience is of biggest importance, the other factors - being Art, Sound and most notably Enjoyment - have a much heavier weight on the outcome of the overall score. This way my overall score about this anime was decided on a nice one. - 7/10",
            "date": "2010-01-19T14:24:00+00:00",
            "helpful_count": 17,
            "mal_id": 22513,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/268134.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Gyzome",
                "username": "Gyzome"
            },
            "url": "https://myanimelist.net/reviews.php?id=22513"
        },
        {
            "content": "I really think that this is an okay show. There really isn't that much of a plot, but the art and sound are very praise worthy. Unfortunately, what worked for Baccano! doesn't really work for this show. By that, i mean that the ending in Baccano blatatly states that there is no ending, thus leaving large chunks of the plot unresolved. This show takes the same route, except they do it in an exremely sloppy manner. Maybe the only reason that i liked it so much is because im a dude that gets some enjoyment out of 12 episodes of pointless nudity and 30 poundsof fanservice, but maybe not. This show could've honestly been a  lot worse. I believe that i didn't only come back for more simply because of the fanservice, but maybe because i just wanted to see who would get the guy in the end. (Though we all pretty much figured that out before the first episode ended). Simply put: if you couldn't get enough of the loli-service anime of the same creator Kanokon, then this is definately the show for you. On the other hand, if you covered your eyes in the OVAs of Kanokon when the middle schoolers were getting it on, then i'd definately reccomend browsing extremely far away from this section. Think of this show like this; it's like Bleach. If Bleach had no plot, but good artwork. Oh, and mainly focused on Orihime and Rangiku accidentally removing their clothes while they claw their way back to standing up, all the while accidentally stimulating the other by touching them in awkward places.",
            "date": "2010-03-24T15:37:00+00:00",
            "helpful_count": 14,
            "mal_id": 24283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/193805.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KaminL",
                "username": "KaminL"
            },
            "url": "https://myanimelist.net/reviews.php?id=24283"
        },
        {
            "content": "Alright, anime fans.  The list of winter shows has looked kind of, well, boring.  But I just got a hold of the pre-release episode of Ladies versus Butlers!  \r\nI have been watching anime since the 80's and have enjoyed various types growing up.  For the past few years I have really enjoyed comedies.  \r\nLadies versus Bulters! started me off with a pretty good laugh.  I must warn you that it is ecchi.  So for those who enjoy a good ecchi comedy, then you are in luck.  I can not say how much I will like this showuntil I watch a few episodes.  As it stands I enjoyed the first.\\n\r\nHopefully this will kick off the winter with a handful of good animes.",
            "date": "2010-01-02T20:28:00+00:00",
            "helpful_count": 11,
            "mal_id": 21979,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/269846.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/anime_sama",
                "username": "anime_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=21979"
        },
        {
            "content": "Oppai!,Oppai!,Oppai!. They're Everywhere!! With Actual Nipple's?? with no Censorship?? Oh dear lord...... My Friend \"Excalibur\" was always standing strong & mighty. It was at full throttle....no matter how much i resisted....It was like heaven for Breast Lords, while it was Hell for.....well normal Otaku's??. *ehem* Well anyway's despite all of that i at least enjoyed the anime as a Time-Passer and A little Laughs here and there so i will at least make a review for it.\r\nStory (6/10): The story is about a Teenage boy named Hino Akiharu........Who goes around groping and peeping every girl he sees at the campus. Girls fainting,Girls Slipping,Girls Crashing....Girls landingeither on his Face or on his Crotch.... for a Harem Anime this one was rather weak...Lol was there any plot at all?? NO! NO Sir! sure there is one thing about the story...like Akiharu's parents died and his only choice was to become a butler, but if you are looking for a Anime with Epic Sword Fighting or Lovely and Cute Romance.......Better pack your \"Excalibur\" and go to a place far away or you will regret it and just start blabbering and complaining about how crappy the anime is....and for the ones who LOVE Oppai,Nude Bodies,Lolies,Oppai and More Oppai......Just sit back,Unzip your fly and Do a little \"Spanking the Monkey\".\\n\\n\r\nArt (6/10): Art was nothing special......one problem to complain about though...The DEM OPPAI'S!! i mean dafuq?? for a Boob themed anime where did the boobs get pulled out from? Cow Ass? omg.....just look at Tomomi's boobs.....they were so soggy and long they reached the lower part of the chest....i was like \"ugh, is this even......\". At least animation was decent. Background and Scenery were also nice. Buildings,Structures,etc. All fine.\\n\\n\r\nSound (6/10): Hmm....Nothing much to say about the Music and Songs...Quite Normal for Harem Animes. While it gives off a Lighthearted feeling. It doesn't exactly match the Situations and Scenes. It was like it's Forcing the Comedy and Romance Genre to Mix but fails in doing so. it just doesn't sit right with me. OP and ED songs were likeable...especially the OP. i at least loved that one! \\n\\n\r\nCharacter (7/10): This! this was one of the few parts that got 7 in the whole review! i mean, Seriously! blah! At least for a Harem Anime it doesn't only focus on one or two Character Development. All of them were in the spotlight. Each has their own uniqueness and speciality. Especially The Clumsy Sisters XD Loved them!! Sernia was the perfect High-Class lady with the right amount of Tsundere and Lovely Voice. Tomomi was....err.....weird....i don't know if she was a nice person....or just a evil Sadist.....i was just confused at her character.. Daichi!! oh! how could i forget her?? she was the most cutest of all the girls! Especially when she keeps her secret from Akiharu and blushes. Moe Overload.... Well like i said, all of them has equal Roles and Screen Time. though Selina and Saikyou may have the most Screen time..Why should i complain? they were the main Heroine's after all. and Lastly, our Perfectly Normal,Delinquent,Dense MC....which is normal for Harem Animes nowadays. at least he's not as dense as our MC in IS: Infinite Stratos right? so it's all ok!\\n\\n\r\nEnjoyment (7/10): Can't say i was dissatisfied with the Enjoyment. The Comedy of the Anime made me laugh a few times so i enjoyed it at least. And i'll admit that i like Ecchi Genre's, So the Uncensored Shots with the Oppai's and Nude Bodies didn't Make me feel bored either.\\n\\n\r\nOverall (6/10) : Yes, Overall i Enjoyed the Anime with it's Jokes and Little Romance. But was a little dissapointed with a few things. So can't say i liked the anime...it was more of like a Time-Passer one. it's not really one of those anime's where you can watch them again and again and never get tired of it. It was just One-Go.\\n\\n\r\nThis is my 5th Review in MAL and My 1st Review in a Harem,Ecchi Anime. sorry if i missed a few parts in my review but please point them out so that i can study and recorrect them when i make another review in the near future. Thanks!",
            "date": "2014-12-15T23:04:00+00:00",
            "helpful_count": 9,
            "mal_id": 172495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3674457.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/IMeinRuby",
                "username": "IMeinRuby"
            },
            "url": "https://myanimelist.net/reviews.php?id=172495"
        },
        {
            "content": "Okay so yes, this show is features copious amounts of *plot* and if that's what you're after you will not be disappointed. Any *plot* connoisseur will appreciate the wide variety of *plot* options on display here, including small side dishes of *plot* and mammoth, quivering *plots* with assorted sauces from tea to hot spring water. Some of the *plot* helpings are actually so generous you might even be like \"wow I really like *plots* with my anime, but this is a LOT more than I expected!\"\r\nBut more importantly--for me anyway--is that LvB has charm, sharp and comedic animation, and a catchy theme song that almostmade me not skip the intro every time (almost!). I always complain about genre-shifting, and while LvB teases the romantic drama angle towards the latter episodes it never fully crosses the line. There are gags and goofs quite literally to the end of the series which I entirely appreciate. \\n\\n\r\nAforementioned gags and goofs are 99% about boobs and/or groping, but hilarious facial animations make it all a joke rather than slanting it into rapey scenarios. There's rarely a dull moment here! I also rather enjoy the worldbuilding because it demonstrates real effort was put into the writing rather than starting with boob jokes and working from there. Overall, LvB is not a serious anime whatsoever, and I totally understand why people don't like it, but for me it was a breeze of levity that most \"comedies\" fail to grasp.",
            "date": "2019-03-08T07:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 303108,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7458802.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/starfarts",
                "username": "starfarts"
            },
            "url": "https://myanimelist.net/reviews.php?id=303108"
        },
        {
            "content": "now this series is the worse romance anime i watched for the year 2010 so far. it had a bad start with the first episode throwing so many ecchi cliches that you will be facepalming yourself every 2 minutes. even though the series get a little better as it goes on i still have a bad taste in my mouth from watching the first episode.\r\nthe story about a guy who looks like a bad kid going to a school populated by mostly girl would catch an eye romantic anime fan like me but it fail due to the poor execution.i do say it does getbetter but only better than the last episode which were not that great to begin with. the art is a matter of personal opinion. the animator try to create a new look for anime characters but to me they failed. since it is mostly the eyes that creep me out. i don't know maybe it because i like the old eye with a white spot in the corner of the eye.\\n\\n\r\nthe voice acting was decent and all the voice actor did their best to match their characters. now character which i have to say is the most important in any show. many of the characters are either cliches or dull with the exception of  Akiharu and Tomomi who were actually likable characters.\\n\\n\r\n now i did not enjoy this anime because of its horrible start, characters animation, and cliches characters. another thing i did not enjoy was the fan-service in the episode since it show girls naked talking about crap i couldn't read since i was looking at something else.\\n\\n\r\nnow this anime i think is made for a person who really likes his ecchi anime but if you really want to watch anime ecchi anime i recommend Bokusatsu Tenshi Dokuro-chan or to love ru since these are better that watching this.\\n\r\noverall: 5\\n",
            "date": "2010-01-30T15:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 22812,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/102844.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/marick251",
                "username": "marick251"
            },
            "url": "https://myanimelist.net/reviews.php?id=22812"
        },
        {
            "content": "Well this is my first review i have ever made publicly... I'm not an expert at every anime style or every genre but ive have taken a like to these kind of romantic comedies recently. Very basic and fun anime to watch i would say, with the typical echinnes these types of anime's  got, the childhood friend, the stubborn rich girl, the petite girls, etc, etc, and the clueless protagonist which seem to never notice the feelings from the girls that are actually interested on him. I felt that the story was very typical and predictable (I believe that many people who watches thesekind of anime's can agree with that) but non the less interesting and attractive. The style and characters reminded me to another anime called Kanokon... and i later found they were produced by the same studio... lol This means very nice colors and many close shots of the girls faces and \"cough\" body parts \"cough\" Although predictable and kind of familiar to other anime's some characters can be surprising and some times \"Scary\" so it makes for a few more laughs at some times. Overall i think an 8 is a nice score for this anime because either way you see it these types of \"harem\" animes, together with the animation and plot, always brings good times and a few laughs to the viewer. \\n\\n\r\nHope you guys like it and understand my opinion =)",
            "date": "2010-06-07T21:10:00+00:00",
            "helpful_count": 5,
            "mal_id": 26920,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/322411.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheCbass",
                "username": "TheCbass"
            },
            "url": "https://myanimelist.net/reviews.php?id=26920"
        },
        {
            "content": "This series is one of those regular ecchi romace animes added with rich ladies, maids, butlers and a prestigious school that exempts payment of education. In real life, that school would change its policy due to many people that might want to go. The show has its random ecchi moments such as accidental breast grabbing, panty shots and undressings. \r\n In terms of animation, it's not bad. A very fine detailed work of art. \r\n The story is still progressing yet not giving much thus leading to some negative first impressions including episodes that look much of a downhill. In a situation such asGreen Green, that story may pick up and give more interest. \\n\r\n The main characters are so far the ones being progressed right now which again may not help the slow pace of the story. But the hilarious antics they are involved in puts up for some humorous delight.\\n\r\n The music is pretty good and the voice acting is very amazing. With people such as Mai Nakahara (Midori Kasugano in Midori Days, Rena in Higurashi) and Ayako Kawasumi (Osaka in Azumanga Daioh, Saber in Fate/Stay Night) as the main characters and other roles filled by more great voice actors such as Rie Kugimiya, Shinji Kawada and Yuko Goto.\\n\r\n This anime is one of those shows that have to give a chance, you never know if it may actually be your one of your favorites.",
            "date": "2010-02-05T10:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 22964,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/R2J",
                "username": "R2J"
            },
            "url": "https://myanimelist.net/reviews.php?id=22964"
        },
        {
            "content": "As others have mentioned, LvB is a very fanservicey, ecchi harem anime with lots of romantic comedy, perverted misunderstandings, and yes, lots and lots of oppai.  This will probably turn some people off immediately, while others will just go watch it because of the boobs.  The show is definately fap-worthy, but it is more than just a show of oversized, bouncing oppai (there's some small-breasted girls too, heehee ;p).  Japanese comedy often falls flat to me, but LvB doesn't overdo the 'beat up and abuse the main hero for comedic effect' gag that so many anime 'comedies' never get past.  There'splenty of ecchi humor throughout, the girls are hot, and there's even a reverse-trap (girl pretending to be a boy) for variety.  \\n\\n\r\nI'd recommend it if you like perverted humor and/or topless anime girls, but if those things turn you off, go elsewhere.  8/10",
            "date": "2011-05-04T06:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 36741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/480430.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Blind_Guardian",
                "username": "Blind_Guardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=36741"
        },
        {
            "content": "This was one of the first \"ecchi\" anime I've seen. As someone who doesn't normally watch ecchi, I was expecting no plot, lots of boobs, and several unnecessary panty shots. I was right about the boobs and panty shots, but wrong about the plot. If you look past the insane boob physics and panties, the plot is actually really good. \r\nIt starts off like you'd expect any ecchi-harem to: male protagonist runs into a female character and something happens to cause them to fall; male protagonist falls on female character and grabs onto her boob(s) for support, causing the female character to think of him asnothing but a pervert even thought that's not the case at all. Once that happened and the plot started developing, I really enjoyed the show. \\n\\n\r\nThe comedy in this show does not disappoint. I always found myself laughing throughout the show, sometimes I'd laugh nearly the entire duration of an episode. \\n\\n\r\nCharacter development is often something a harem/reverse harem lacks, but this anime did a good job with developing the main characters - especially towards the end of the show. They could've done a better job with the side characters, but any development is better than no development. \\n\\n\r\nOverall, for an ecchi-harem, this anime was really good. ",
            "date": "2017-02-16T14:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 240722,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545700.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NalarueAni",
                "username": "NalarueAni"
            },
            "url": "https://myanimelist.net/reviews.php?id=240722"
        },
        {
            "content": "[Specialty: Ecchi and enjoyment]\r\nA short note: Ladies vs Butlers is one of quite a few XEBEC productions I've seen. And this has the best colour and animation I've seen, This is *strictly* one reason why it is a 7. Compare it with Mahou Sensei Negima to get what I mean. The story is kinda like a dunno-why-girls-jump-at-guy harem that never gets resolved. Watch it for enjoyment.\r\n[Mood: Light for near-all episodes]\r\n[Explained notable pickings:]\r\nEcchi: Lots of see-thru underwear and naked bodies, dun worry, there's lots of it. Not all episodes though, sometimes a lot sometimes none. [6-7/10]\r\nEnjoyment:Well, to be honest, most of the laughs came with ecchi.There were a few touching moments to boot too, and it is quite well-rounded entertainment, but leaning to ecchi. [8/10]\\n\\n\r\nHarem: Typical. Girls fall in love with same guy cause of soem cheap kindness or a favour done. No resolution done for any girls in harem except the 2 mains. [4/10]\\n\\n\r\nCharacter varsity: A lot. Like someone mentioned in a review, count how many typical characters you can see in 1st episode and it'll probably exceed *a few*. Not to mention the rest. But... little character development spoils the characters.\\n\r\n[4/10]\\n\\n\r\nPotential wasted: This is one controversial problem. What was the manga like? I dunno. But Asu no Yoichi the anime was great, much better than manga (I put it on hold aft a few chapters, couldn't continue). Cos this anime seems to trap itself in a harem net it couldn't untangle. Girls who fell in love with guy disappeared completely sometimes for a few episodes, then reappear. If it was like something like Princess Lover!, it could have much more potential. [7-8/10]\\n\\n\r\nStory:6\\n\r\nHere and there. No plot at all. Seems to just show us school life at a Ladies-Maids-Butlers school and have harem thrown in. The ending was a big fluke, and the last episodes seem to culminate in a \"trough\", the opposite of a climax. Harem was hopelessly unresolved, which was pathetic. Some things were resolved, though, credits to that. Like the rivalry-love fight between he 2 main gal characters.\\n\\n\r\nBtw some episodes seem focused on one character, while some were purposefully ecchi (to the point of being ridiculously funny). Tons of fanservice that derail main mood.\\n\\n\r\nArt:9\\n\r\nColour was very good, animation was very smooth, ecchi was expressed very well and so on. Scenery was good too, unlike Baka to Test to Shoukanjuu (?), and shades were nicely done.\\n\\n\r\nOnly complaint about art is that it does not have a 3D concept and probably some characters seem pretty similar, facial expressions were not significantly memorable.\\n\\n\r\nSound:6\\n\r\nDidn't really take notice of ED. OP the lyrics were good and tune was catchy. Can't remember much of sound effects and bgm, although I'm quite sure they are not great (or else I should have remembered).\\n\\n\r\nCharacter:6\\n\r\nSome characters that get introduced for 1 or more episodes get thrown away pretty often. Character personalities were pretty stable except last few episodes, where a very clumsy girl suddenly becomes strong and very steady (she's the *VERY* clumsy type).\\n\\n\r\nVery little character development in any character, by the end I still wondered what is the main guy's character like. He seemed to be led on by various circumstances and was just using typical responses, so nothing special was noted about him other than the very cliche \"kind\". Plus his past has a lot of potential, but was not delved into. Wasted.\\n\\n\r\nEnjoyment:8\\n\r\nEcchi to the point where it becomes funny. Some touching moments and slower parts. Well, to be sure I was \"mindlessly\" enjoying myself. It was not about plot but I managed to successfully watch all 12 episodes, which is good already :D.\\n\\n\r\nOverall:7\\n\r\nWatch it if you are feeling down or something. Dun try watching for a plot or serious anime. I put it on hold before, once.",
            "date": "2010-04-04T03:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 24643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=24643"
        },
        {
            "content": "very cool funny and ECCHİ anime if u love these kinds u found it \r\nit's about a highschooler who is Akiharu Hino he transfers to a school a very different one than others.there is two clas of students that given education one of them is upper-ed there the rich girls and a boy(gay i think :D) that given education and the other one is servant-ed there they train how to be a butler or a maid so the main protagonist Akiharu Hino starts to take education there but there is many many hardships awaiting for him like his childhood friend Tomomi Saikyo she is oneof a killer and there is Selnia Iori Flameheart she kinda starts to fall in love with Akiharu.it's very fun to watch it's comedy scenes is cool to and it's ecchi it's something i can't tell u guys u must live it :D \\n\\n\r\nstory: it's interesting and cool 10\\n\r\nart: very very good 10\\n\r\nsound: good 10\\n\r\ncharacter:all of them are uniqe 10\\n\r\nenjoyment:great 10\\n\r\noverall: 10",
            "date": "2010-02-06T16:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 22998,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/291600.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/chingstah",
                "username": "chingstah"
            },
            "url": "https://myanimelist.net/reviews.php?id=22998"
        },
        {
            "content": "Finish watching Ladies vs Butlers and not realizing that i already finish all 12 episode just like that \r\nIt ends so sudden that you wanna watch for more but if only your a fan of Ecchi & RomCom with lots of fan service. You might want to try this.\r\nTo be honest I'm not a fan of Ecchi anime but this anime was so easy to watch that i can actually finish all 12 \r\nepisode in just one sit. I mean easy 'cause it didn't bored me at all there's no doll moments the characters was great they gave me so much laugh and the twofemale lead was outstanding with their role as a Tsundere and a Sadistic but our male main protagonist is your typical average guy making all the girls fall for him with his bad boy looks but good on the inside and even there's no main plot at all you can easily keep up with the story.\\n\\n\\n\r\nThe only downfall for me is that the boobs was uncensored it kinda distract me while watching the anime but if you like boobs being uncensored and totally this anime is for you. 'cause the whole point of this anime is for the male fans 'cause it has a lot of fan service i mean a lot basically the whole season is about fan service and they just added a little bit of romance and one more thing the ending was messed up they should do a season 2 of ladies vs butlers so that will know what happens next.",
            "date": "2014-06-22T02:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 147987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2425719.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bloody_Venus55",
                "username": "bloody_Venus55"
            },
            "url": "https://myanimelist.net/reviews.php?id=147987"
        },
        {
            "content": "10/10 for 13 year old boys!\r\nI knew the show wasn't gonna be good when the entire first episode was comprised of boob grab jokes. I chuckled the first time and then I stopped chuckling after the 3rd one in the same episode. Upon watching the second episode, I thought they showed us tits because they knew episode 1 was a flop. Without fail, we got tits on every episode after that. I love some tig ol' biddies, but you can't run a show off of those alone. And they knew how to compensate for all the huge tits. I like me some small titties aswell, but I don't care too much for girls that look like a dolled up 10 year old boy. It is a little creepy, at the very least, seeing the tits of a girl that looks like she belongs in grade school. Then saying she is the oldest one doesn't make that alright. It is still not cool.\\n\\n\r\nThis anime has a few off topic things worth mentioning. I have never seen a lack of facial features consistent throughout an entire series. Noses are not optional, we need them. The main character is the first delinquent without a personality. I love how delinquents are always given a decent personality because they have more freedom with their character. This was clearly not the case with  Akiharu. This is also the first time I have ever seen a few episodes subbed and then decided to swap out to the dub version. There comes a time where you say \"fuck it, we are doing it live\" and change to the dub because you know the show can't get any worse. This is the first time I ever felt bad for a voice actor. They got some people who seemed sleep deprived and asked them to read the entire script in one sitting and record it. Money is money and we all like food and shiny things. \\n\\n\r\nWith all the bitching I have done, I still give the show a 4. It is bad. There wasn't anything that particularly pissed me off. The show was a generic boob and scoot. This strikes me as a show that I will show my 13 year old son and he will love anime because of it. When he asks me about women and their bodies, this will be a worthwhile instructional show. I will get my ass kicked by my wife if/when she finds out. Everything will be worth it in the end though.",
            "date": "2016-03-23T22:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 213755,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4670871.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Midg3tLuv",
                "username": "Midg3tLuv"
            },
            "url": "https://myanimelist.net/reviews.php?id=213755"
        },
        {
            "content": "Oh lord, where to begin... let's see... Interesting at points, weird at other points... overall it's one giant Echii-palooza.\r\nMy first reaction to watching this was \"What the heck did I just get myself into?\". That was only the first episode. Over time, it got better, funnier, and a lot more perverted, trust me. As an Anime Expert, I know a good echii show when I see one. It's got everything you could think of; bath houses, hot springs, hotel rooms, closets, beaches, and in an entire school with like 3 guys and 400 girls, you know it'll be interesting to watch.\r\nThe story was interesting, normalguy moving to a school to learn how to be a butler, and what really made me think, was when he got every girl in the school to try and kill him after one little mistake: landing on top of a girl. She freaks out, runs off with her chasing him, stumbles on top of another girl, then another, and another... next thing you know it, there are a whole bunch of Amazons coming after him. That made me laugh. They all work it out in the end, but for a while, it looked like the end of the show for him.\\n\\n\r\nArt, what you would find in a normal anime made these days, well done.\\n\\n\r\nSound, good character voices, matches them fairly well, but now we gotta see how english dubs will fair.\\n\\n\r\nCharacters, lovable, annoying, crazy... a variety.\\n\\n\r\nEnjoyment... a solid 6. I didn't enjoy it as much as I could have if they had changed a few things. If you've seen it and agreed with pretty much everything I've said so far, you know what I mean.\\n\\n\r\nOverall, this was just an anime that had crossed my eyes and I had clicked on episode 1-12. Nothing amazingly special, worth watching, but your ending results may vary.",
            "date": "2012-09-26T16:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 73361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=73361"
        },
        {
            "content": "Ladies vs. Butlers is a typical ecchi comedy, which pretty much sticks to the formula and includes all the standard elements without doing anything that makes it stand out.  It's not particularly bad, but then it's not particularly good either.  Expect lots of nudity and a few hilarious moments, but no real redeeming qualities otherwise.\r\nStory: 4\r\nA school designed specifically to reinforce the hereditary social hierarchy.  If you're from an upper class family, you come here to learn how to be prim and proper.  If you're from a servant class family, you come here to learn how to be properly subservient toyour betters.  (Can you tell I'm cynical?)  Fortunately, the anime doesn't really hit you over the head with it, like for example in They Are My Noble Masters.  The school is just the setting, and the show is about humorous goings-on at the school.\\n\\n\r\nArt: 4\\n\\n\r\nThe style isn't as clean as in some others, and something kind of bugs me about the character designs of the girls.  I guess they're meant to be \"voluptuous\" but to me they just come across as chubby.  Upon watching it a second time, I figured it out.  It's most obvious on Flameheart.  Her waist is too high, which makes her look like she has big hips.  It's not quite as pronounced on the other girls, but it's still there.  Also, I really don't like her \"drill hair,\" but the fact that they turned it into a running gag keeps it from losing another point.\\n\\n\r\nSound: 5\\n\\n\r\nThe theme song is fun and catchy, although not my favorite.  The voice acting and incidental sounds are fine.\\n\\n\r\nCharacters: 5\\n\\n\r\nI'll be honest, there's nothing special about these characters.  They're your standard harem anime characters.  I don't like Saikyo's sadistic streak (worst childhood friend ever!), or Flameheart's snobbishness, but neither bugs me enough to lose a point.  The principal is funny, and it would have gained an extra point if she played a larger role.\\n\\n\r\nThe hero is not one of the two harem anime stereotypes: the misunderstood good guy or the admitted pervert.  He's not the pervert everyone thinks he is, but he's no \"poor me\" whiny brat either.  He gives as well as he takes, as evidenced by his insubordinate attitude toward his betters, such as his banter with Flameheart.  She gets the better of him as often as he gets the better of her, but his \"I don't give a damn\" attitude makes him particularly likable.\\n\\n\r\nI do have one complaint, which is that I really don't like any of the girls.  Part of the fun of a harem anime comes from choosing your favorite girl, but in this case, I think the hero is better off without any of them.  The two main rivals, Flameheart and Saikyo, are each unlikable.  The other girls are mostly forgettable.\\n\\n\r\nNormally I would consider this a huge failing in a harem anime, but for some reason, it doesn't bother me too much here.  The show is entertaining despite a lack of sympathetic characters.\\n\\n\r\nEnjoyment: 6\\n\\n\r\nIt's just plain fun to watch.  Don't expect anything deep or awe-inspiring, and don't even expect any particularly interesting characters.\\n\\n\r\nOverall: 5\\n\\n\r\nIf you're into perverted comedies, you have to watch this one just to check it off your list.  Otherwise, skip it.\\n",
            "date": "2014-12-22T21:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 173731,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/lasterrending",
                "username": "lasterrending"
            },
            "url": "https://myanimelist.net/reviews.php?id=173731"
        }
    ],
    [
        {
            "content": "Many criticize the harem genre of anime for its overly formulaic approach and execution.  And Ladies vs. Butlers will probably not change the opinions of these critics, since practically every convention common in harem anime is crammed into this show.\r\nThe premise behind Ladies vs. Butlers is simple yet predictable.  The main character, Hino Akiharu, attends a school for upper-class ladies that is also dedicated to instructing maids and butlers how to function in high-class society.  The story basically details Hino interacting with the various girls at the school and the various ecchi situations he gets himself into.  The majority of thisseries is episodic and, in all honesty, serves nothing more than to introduce the female characters and to show ecchi scenes.     \\n\\n\r\nLadies vs. Butlers includes almost every female archetype found in the harem genre: a tsundere, a childhood friend, a (reverse) trap, lolis, clumsy girls, foreign girls, etc.  The harem lead, Akiharu, is also a fairly generic character.  While he doesn’t fit the “total loser” persona as many other harem leads do, there is nothing really noteworthy about him.  Also, there is hardly any significant character development, but that is to be expected of an anime of this type.   \\n\\n\r\nThe art is decent and very reminiscent of one of XEBEC’s earlier productions, Kanokon.  And while some of the character designs may be slightly off-putting (for example, there is a 19-year-old girl who looks like an elementary school student), this will not detract from overall enjoyment of the anime.   \\n\\n\r\nThe opening and ending songs are appropriate for this kind of anime but nothing all that memorable, and the voice-acting suited each character’s personality well.  The background music is virtually nonexistent, though you will probably be too fixated on all the bouncing breasts, panty shots, and nudity present in this anime to even notice.         \\n\\n\r\nWhile Ladies vs. Butlers does not fail in one particular aspect, its main issue is that it does nothing to stand out from the countless other harem anime out there.  It doesn’t deviate from the harem formula at all, and as a result, this anime most likely will not appeal to anyone looking for anything more than fanservice and comedy.  However, if you are a diehard harem or ecchi fan, you should give Ladies vs. Butlers a try.  \\n\\n\r\nOverall, this was a decent ecchi/harem anime, albeit nothing exceptional or ground-breaking.",
            "date": "2010-03-25T17:19:00+00:00",
            "helpful_count": 139,
            "mal_id": 24316,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/197890.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/rpatwater",
                "username": "rpatwater"
            },
            "url": "https://myanimelist.net/reviews.php?id=24316"
        },
        {
            "content": "Hey, here's a fun game! In thirty seconds, try and see how many common Ero-game character archetypes you can think of then, see how many of them you can find in Ladies versus Butlers. I did the same thing and found all of them before I was even halfway through episode 1. You name it, they've got it! From tsundere, to clumsy chicks, to childhood friend/tormentor. They even have an OBVIOUS reverse trap who's roommates with our main hero and what harem would be complete without  a 19 year old girl who looks like she's 10!\r\nHowever, I digress. The truth is Ladies vs. Butlersis a harem that tries to mash as many cliches(God, I hate that word) of the harem genre into one place, hoping it won't just collapse on itself. And while the whole \"Oh crap! I tripped and grabbed your titties\" can be good for a laugh once and a while, devoting an entire episode to it may be crossing the line. Especially when we get to the level of \"Clumsy maid girl falls onto to guy and rubs her cooch on his face\".\\n\\n\r\nIn terms of story, it's the usual deal. Guy transfers to a \"special\" school for butlers, maids, and up and coming \"ojou-samas\", that has an insanely unbalanced ratio of boys to girls because, how are you gonna have a decent harem, when there aren't 20 girls to every guy. The music is nothing special and, as I said before, the characters are very ordinary. Things may get better over time but, as things look now, that is very unlikely.",
            "date": "2010-01-06T10:15:00+00:00",
            "helpful_count": 88,
            "mal_id": 22124,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/108763.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/NoBadsign",
                "username": "NoBadsign"
            },
            "url": "https://myanimelist.net/reviews.php?id=22124"
        },
        {
            "content": "I'm just gonna get the obvious stuff out of the way first. Ladies versus Butlers is an ecchi harem comedy that does little to break the chain of \"we don't need a story as long there are boobies\" shows that we see in shows of this genre. Almost all the characters fall perfectly within some set archetype, and don't really see anything in the way of character development. Also, this show has more of these archetypes than I think I've ever seen in one place, as well all the gags you'd expect in this genre.\r\nDespite this, I still enjoyed this series quite a bit ,for two main reasons. The main character, and fact that the non-ecchi related jokes were actually funny.\\n\\n\r\nStory: Didn't really expect anything from the story to begin with, didn't really get anything. The show basically just follows him around as he lives at this school with all these girls. No real plot. He's just sorta there with all these girls, and.... yeah.\\n\\n\r\nArt: The show does look nice, which is definitely a plus. It's not incredibly unique in terms of style, but it's not bad to look at either. It gets the job done for this series just fine. A show based on fanservice should be something fans would want to look at, no?\\n\\n\r\nSound: Not really anything notable about the sound. The OP was kinda catchy, but that's about it. It wasn't bad, but it never really stuck out during the series.\\n\\n\r\nCharacter: The show has more character archetypes crammed into it than I've ever seen in any place before, and nobody really develops beyond these roles. However, I was pleasantly surprised by Akuharu. While he's no brilliant character himself, I'd definitely choose him over most of the other male leads you see in ecchi harem. Him not being a spineless loser without any backbone or opinion of any kind was nice change from the usual, and his appearance (red eyes, scar on his eyebrow, and not small/wimpy) felt like someone actually gave it a bit of thought rather than just taking the concept art from another ecchi harem and doing just enough edits to make him not a blatant clone. For the first time, I actually CARED about the male lead. While there's still lots of work to be done in terms of characters, L x B was at least a step in the right direction.\\n\\n\r\nEnjoyment: While there was more than enough fanservice for those who came here looking for it, the show was quite amusing with its more worksafe bits humor(the principal and ninja maid in particular). It was enough to keep me watching the entire way through, although I really would have liked to see more of it in place of the \"I tripped and grabbed a boob\" gag or the ever present \"Some random situation has forced us into a sexually awkward position\" bit.\\n\\n\r\nOverall: Ladies versus Butlers is by no means a greatanime, but it definitely preferrable to most of the shows in this genre. Akuharu hinted at something in the way of effort in his design, the art looks very nice, and there's enough not fanservice related humor to actually, well , make someone not as into that as others find some enjoyment out of this, however small that may be.",
            "date": "2010-06-16T15:21:00+00:00",
            "helpful_count": 57,
            "mal_id": 27233,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332743.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Kilik64",
                "username": "Kilik64"
            },
            "url": "https://myanimelist.net/reviews.php?id=27233"
        },
        {
            "content": "Ladies versus Butlers!\r\nI watched this anime because of the ecchiness that i wanted to see and i thought this was going to be great but it was just good, i enjoyed it, but not as much as i thought.\r\nStory\r\nIt's too simple, is about a boy named Akiharu who is transfered to a school of maids and butlers and attends classes with the rich people and he will find nice people and even if he looks like a delinquent he helps people when they request help from him or when he sees they need help but there will be people that wants to make his lifea living hell; The ending was bad, it was an open ending so the story was fine.\\n\\n\r\nArt & Animation\\n\r\nThe art is good but is a let down because all the girls have the same faces just with different hair and boobs but is colorful and of course the ecchiness was good.\\n\\n\r\nSound\\n\r\nThe sound was good, the music background is ok the voice acting wasn't bad and the OP and ED were ok.\\n\\n\r\nCharacter\\n\r\nEven tho the girls looked the same just with different hair, they have different personalities that where good on them, Akiharu was kind, he looks like a delinquent but he is a good person, he is fu**ing slow understanding the girls feelings, he was really dumb, that's why he didn't get any of them.\\n\\n\r\nEnjoyment\\n\r\nWhat i enjoyed the most was the Ecchi and this has a lot and the specials were really good. ( ͡° ͜ʖ ͡°)",
            "date": "2015-08-05T17:00:00+00:00",
            "helpful_count": 31,
            "mal_id": 195270,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195270"
        },
        {
            "content": "Ladies versus Butlers in an anime that when you first watch it, already gives the impression that they've tried to implement as much clichés as possible in the first episode. Ranging from the overused oh-I-tripped-and-accidentially-touched-your-boobs-with-my-hand scene to lolis that look half the age they actually are, you'd have trouble coming up with something they haven't used yet.\r\nThe characters are as flat as they get. One of the first characters you meet is a tsundere, next is the childhood-friend/tormenter, followed by a shameless perv and a gay who's too full of himself - just to give you a fraction of the archetypes you'll meet in thefirst two episodes. It's possible they'll change during the series, but my first impression isn't too much. - 3/10\\n\\n\r\nThe story is quite absent in those episodes, only a small part is revealed already but what has unfolded already doesn't promise any high-quality story at all. I could be wrong though, I've already met an anime that managed to pull out quite the story while having an (almost) equally senseless beginning. Who knows what Ladies vs Butlers will bring us? For now, I don't think I'm able to give much either. - 4/10\\n\\n\r\nMoving on to the better parts of the series, the art isn't anything special, but does the job it's supposed to do just fine. Considering this still is a comedy, the style is very functional and overall apeasing. This is a score that most likely won't change at all during the broadcast of the show so you can consider it final. - 7/10\\n\\n\r\nWhat I really do like about this anime is the sound. Not only are the OP and the ED very catchy songs on their own, the background music during the series itself is also very nice. FX'es likewise. The voice acting isn't something outstanding, but still good enough as there aren't any negative remarks from me. Again, this isn't something that is prone to changing during the duration of the series so this is final too. - 8/10\\n\\n\r\nLast - but not least - is the enjoyment. This is the most important part of the show because it's a comedy - obviously - so I took my time deciding on a score. The show is quite funny, even if it's laughing at the excessive use of clichés. Humor is well-timed and sometimes even manages to come from an unexpected corner. I sincerely hope this won't slack off during the series because that'd be a shame. But since it usually only gets better I gave it quite the respectable score. - 8/10\\n\\n\r\nNow, because comedies are supposed to make you laugh and not ponder about amazing character complexity or godlike plot twist, these factors won't be taken into account very much. Because the direct viewing experience is of biggest importance, the other factors - being Art, Sound and most notably Enjoyment - have a much heavier weight on the outcome of the overall score. This way my overall score about this anime was decided on a nice one. - 7/10",
            "date": "2010-01-19T14:24:00+00:00",
            "helpful_count": 17,
            "mal_id": 22513,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/268134.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Gyzome",
                "username": "Gyzome"
            },
            "url": "https://myanimelist.net/reviews.php?id=22513"
        },
        {
            "content": "I really think that this is an okay show. There really isn't that much of a plot, but the art and sound are very praise worthy. Unfortunately, what worked for Baccano! doesn't really work for this show. By that, i mean that the ending in Baccano blatatly states that there is no ending, thus leaving large chunks of the plot unresolved. This show takes the same route, except they do it in an exremely sloppy manner. Maybe the only reason that i liked it so much is because im a dude that gets some enjoyment out of 12 episodes of pointless nudity and 30 poundsof fanservice, but maybe not. This show could've honestly been a  lot worse. I believe that i didn't only come back for more simply because of the fanservice, but maybe because i just wanted to see who would get the guy in the end. (Though we all pretty much figured that out before the first episode ended). Simply put: if you couldn't get enough of the loli-service anime of the same creator Kanokon, then this is definately the show for you. On the other hand, if you covered your eyes in the OVAs of Kanokon when the middle schoolers were getting it on, then i'd definately reccomend browsing extremely far away from this section. Think of this show like this; it's like Bleach. If Bleach had no plot, but good artwork. Oh, and mainly focused on Orihime and Rangiku accidentally removing their clothes while they claw their way back to standing up, all the while accidentally stimulating the other by touching them in awkward places.",
            "date": "2010-03-24T15:37:00+00:00",
            "helpful_count": 14,
            "mal_id": 24283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/193805.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KaminL",
                "username": "KaminL"
            },
            "url": "https://myanimelist.net/reviews.php?id=24283"
        },
        {
            "content": "Alright, anime fans.  The list of winter shows has looked kind of, well, boring.  But I just got a hold of the pre-release episode of Ladies versus Butlers!  \r\nI have been watching anime since the 80's and have enjoyed various types growing up.  For the past few years I have really enjoyed comedies.  \r\nLadies versus Bulters! started me off with a pretty good laugh.  I must warn you that it is ecchi.  So for those who enjoy a good ecchi comedy, then you are in luck.  I can not say how much I will like this showuntil I watch a few episodes.  As it stands I enjoyed the first.\\n\r\nHopefully this will kick off the winter with a handful of good animes.",
            "date": "2010-01-02T20:28:00+00:00",
            "helpful_count": 11,
            "mal_id": 21979,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/269846.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/anime_sama",
                "username": "anime_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=21979"
        },
        {
            "content": "Oppai!,Oppai!,Oppai!. They're Everywhere!! With Actual Nipple's?? with no Censorship?? Oh dear lord...... My Friend \"Excalibur\" was always standing strong & mighty. It was at full throttle....no matter how much i resisted....It was like heaven for Breast Lords, while it was Hell for.....well normal Otaku's??. *ehem* Well anyway's despite all of that i at least enjoyed the anime as a Time-Passer and A little Laughs here and there so i will at least make a review for it.\r\nStory (6/10): The story is about a Teenage boy named Hino Akiharu........Who goes around groping and peeping every girl he sees at the campus. Girls fainting,Girls Slipping,Girls Crashing....Girls landingeither on his Face or on his Crotch.... for a Harem Anime this one was rather weak...Lol was there any plot at all?? NO! NO Sir! sure there is one thing about the story...like Akiharu's parents died and his only choice was to become a butler, but if you are looking for a Anime with Epic Sword Fighting or Lovely and Cute Romance.......Better pack your \"Excalibur\" and go to a place far away or you will regret it and just start blabbering and complaining about how crappy the anime is....and for the ones who LOVE Oppai,Nude Bodies,Lolies,Oppai and More Oppai......Just sit back,Unzip your fly and Do a little \"Spanking the Monkey\".\\n\\n\r\nArt (6/10): Art was nothing special......one problem to complain about though...The DEM OPPAI'S!! i mean dafuq?? for a Boob themed anime where did the boobs get pulled out from? Cow Ass? omg.....just look at Tomomi's boobs.....they were so soggy and long they reached the lower part of the chest....i was like \"ugh, is this even......\". At least animation was decent. Background and Scenery were also nice. Buildings,Structures,etc. All fine.\\n\\n\r\nSound (6/10): Hmm....Nothing much to say about the Music and Songs...Quite Normal for Harem Animes. While it gives off a Lighthearted feeling. It doesn't exactly match the Situations and Scenes. It was like it's Forcing the Comedy and Romance Genre to Mix but fails in doing so. it just doesn't sit right with me. OP and ED songs were likeable...especially the OP. i at least loved that one! \\n\\n\r\nCharacter (7/10): This! this was one of the few parts that got 7 in the whole review! i mean, Seriously! blah! At least for a Harem Anime it doesn't only focus on one or two Character Development. All of them were in the spotlight. Each has their own uniqueness and speciality. Especially The Clumsy Sisters XD Loved them!! Sernia was the perfect High-Class lady with the right amount of Tsundere and Lovely Voice. Tomomi was....err.....weird....i don't know if she was a nice person....or just a evil Sadist.....i was just confused at her character.. Daichi!! oh! how could i forget her?? she was the most cutest of all the girls! Especially when she keeps her secret from Akiharu and blushes. Moe Overload.... Well like i said, all of them has equal Roles and Screen Time. though Selina and Saikyou may have the most Screen time..Why should i complain? they were the main Heroine's after all. and Lastly, our Perfectly Normal,Delinquent,Dense MC....which is normal for Harem Animes nowadays. at least he's not as dense as our MC in IS: Infinite Stratos right? so it's all ok!\\n\\n\r\nEnjoyment (7/10): Can't say i was dissatisfied with the Enjoyment. The Comedy of the Anime made me laugh a few times so i enjoyed it at least. And i'll admit that i like Ecchi Genre's, So the Uncensored Shots with the Oppai's and Nude Bodies didn't Make me feel bored either.\\n\\n\r\nOverall (6/10) : Yes, Overall i Enjoyed the Anime with it's Jokes and Little Romance. But was a little dissapointed with a few things. So can't say i liked the anime...it was more of like a Time-Passer one. it's not really one of those anime's where you can watch them again and again and never get tired of it. It was just One-Go.\\n\\n\r\nThis is my 5th Review in MAL and My 1st Review in a Harem,Ecchi Anime. sorry if i missed a few parts in my review but please point them out so that i can study and recorrect them when i make another review in the near future. Thanks!",
            "date": "2014-12-15T23:04:00+00:00",
            "helpful_count": 9,
            "mal_id": 172495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3674457.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/IMeinRuby",
                "username": "IMeinRuby"
            },
            "url": "https://myanimelist.net/reviews.php?id=172495"
        },
        {
            "content": "Okay so yes, this show is features copious amounts of *plot* and if that's what you're after you will not be disappointed. Any *plot* connoisseur will appreciate the wide variety of *plot* options on display here, including small side dishes of *plot* and mammoth, quivering *plots* with assorted sauces from tea to hot spring water. Some of the *plot* helpings are actually so generous you might even be like \"wow I really like *plots* with my anime, but this is a LOT more than I expected!\"\r\nBut more importantly--for me anyway--is that LvB has charm, sharp and comedic animation, and a catchy theme song that almostmade me not skip the intro every time (almost!). I always complain about genre-shifting, and while LvB teases the romantic drama angle towards the latter episodes it never fully crosses the line. There are gags and goofs quite literally to the end of the series which I entirely appreciate. \\n\\n\r\nAforementioned gags and goofs are 99% about boobs and/or groping, but hilarious facial animations make it all a joke rather than slanting it into rapey scenarios. There's rarely a dull moment here! I also rather enjoy the worldbuilding because it demonstrates real effort was put into the writing rather than starting with boob jokes and working from there. Overall, LvB is not a serious anime whatsoever, and I totally understand why people don't like it, but for me it was a breeze of levity that most \"comedies\" fail to grasp.",
            "date": "2019-03-08T07:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 303108,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7458802.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/starfarts",
                "username": "starfarts"
            },
            "url": "https://myanimelist.net/reviews.php?id=303108"
        },
        {
            "content": "now this series is the worse romance anime i watched for the year 2010 so far. it had a bad start with the first episode throwing so many ecchi cliches that you will be facepalming yourself every 2 minutes. even though the series get a little better as it goes on i still have a bad taste in my mouth from watching the first episode.\r\nthe story about a guy who looks like a bad kid going to a school populated by mostly girl would catch an eye romantic anime fan like me but it fail due to the poor execution.i do say it does getbetter but only better than the last episode which were not that great to begin with. the art is a matter of personal opinion. the animator try to create a new look for anime characters but to me they failed. since it is mostly the eyes that creep me out. i don't know maybe it because i like the old eye with a white spot in the corner of the eye.\\n\\n\r\nthe voice acting was decent and all the voice actor did their best to match their characters. now character which i have to say is the most important in any show. many of the characters are either cliches or dull with the exception of  Akiharu and Tomomi who were actually likable characters.\\n\\n\r\n now i did not enjoy this anime because of its horrible start, characters animation, and cliches characters. another thing i did not enjoy was the fan-service in the episode since it show girls naked talking about crap i couldn't read since i was looking at something else.\\n\\n\r\nnow this anime i think is made for a person who really likes his ecchi anime but if you really want to watch anime ecchi anime i recommend Bokusatsu Tenshi Dokuro-chan or to love ru since these are better that watching this.\\n\r\noverall: 5\\n",
            "date": "2010-01-30T15:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 22812,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/102844.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/marick251",
                "username": "marick251"
            },
            "url": "https://myanimelist.net/reviews.php?id=22812"
        },
        {
            "content": "Well this is my first review i have ever made publicly... I'm not an expert at every anime style or every genre but ive have taken a like to these kind of romantic comedies recently. Very basic and fun anime to watch i would say, with the typical echinnes these types of anime's  got, the childhood friend, the stubborn rich girl, the petite girls, etc, etc, and the clueless protagonist which seem to never notice the feelings from the girls that are actually interested on him. I felt that the story was very typical and predictable (I believe that many people who watches thesekind of anime's can agree with that) but non the less interesting and attractive. The style and characters reminded me to another anime called Kanokon... and i later found they were produced by the same studio... lol This means very nice colors and many close shots of the girls faces and \"cough\" body parts \"cough\" Although predictable and kind of familiar to other anime's some characters can be surprising and some times \"Scary\" so it makes for a few more laughs at some times. Overall i think an 8 is a nice score for this anime because either way you see it these types of \"harem\" animes, together with the animation and plot, always brings good times and a few laughs to the viewer. \\n\\n\r\nHope you guys like it and understand my opinion =)",
            "date": "2010-06-07T21:10:00+00:00",
            "helpful_count": 5,
            "mal_id": 26920,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/322411.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheCbass",
                "username": "TheCbass"
            },
            "url": "https://myanimelist.net/reviews.php?id=26920"
        },
        {
            "content": "This series is one of those regular ecchi romace animes added with rich ladies, maids, butlers and a prestigious school that exempts payment of education. In real life, that school would change its policy due to many people that might want to go. The show has its random ecchi moments such as accidental breast grabbing, panty shots and undressings. \r\n In terms of animation, it's not bad. A very fine detailed work of art. \r\n The story is still progressing yet not giving much thus leading to some negative first impressions including episodes that look much of a downhill. In a situation such asGreen Green, that story may pick up and give more interest. \\n\r\n The main characters are so far the ones being progressed right now which again may not help the slow pace of the story. But the hilarious antics they are involved in puts up for some humorous delight.\\n\r\n The music is pretty good and the voice acting is very amazing. With people such as Mai Nakahara (Midori Kasugano in Midori Days, Rena in Higurashi) and Ayako Kawasumi (Osaka in Azumanga Daioh, Saber in Fate/Stay Night) as the main characters and other roles filled by more great voice actors such as Rie Kugimiya, Shinji Kawada and Yuko Goto.\\n\r\n This anime is one of those shows that have to give a chance, you never know if it may actually be your one of your favorites.",
            "date": "2010-02-05T10:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 22964,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/R2J",
                "username": "R2J"
            },
            "url": "https://myanimelist.net/reviews.php?id=22964"
        },
        {
            "content": "As others have mentioned, LvB is a very fanservicey, ecchi harem anime with lots of romantic comedy, perverted misunderstandings, and yes, lots and lots of oppai.  This will probably turn some people off immediately, while others will just go watch it because of the boobs.  The show is definately fap-worthy, but it is more than just a show of oversized, bouncing oppai (there's some small-breasted girls too, heehee ;p).  Japanese comedy often falls flat to me, but LvB doesn't overdo the 'beat up and abuse the main hero for comedic effect' gag that so many anime 'comedies' never get past.  There'splenty of ecchi humor throughout, the girls are hot, and there's even a reverse-trap (girl pretending to be a boy) for variety.  \\n\\n\r\nI'd recommend it if you like perverted humor and/or topless anime girls, but if those things turn you off, go elsewhere.  8/10",
            "date": "2011-05-04T06:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 36741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/480430.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Blind_Guardian",
                "username": "Blind_Guardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=36741"
        },
        {
            "content": "This was one of the first \"ecchi\" anime I've seen. As someone who doesn't normally watch ecchi, I was expecting no plot, lots of boobs, and several unnecessary panty shots. I was right about the boobs and panty shots, but wrong about the plot. If you look past the insane boob physics and panties, the plot is actually really good. \r\nIt starts off like you'd expect any ecchi-harem to: male protagonist runs into a female character and something happens to cause them to fall; male protagonist falls on female character and grabs onto her boob(s) for support, causing the female character to think of him asnothing but a pervert even thought that's not the case at all. Once that happened and the plot started developing, I really enjoyed the show. \\n\\n\r\nThe comedy in this show does not disappoint. I always found myself laughing throughout the show, sometimes I'd laugh nearly the entire duration of an episode. \\n\\n\r\nCharacter development is often something a harem/reverse harem lacks, but this anime did a good job with developing the main characters - especially towards the end of the show. They could've done a better job with the side characters, but any development is better than no development. \\n\\n\r\nOverall, for an ecchi-harem, this anime was really good. ",
            "date": "2017-02-16T14:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 240722,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545700.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NalarueAni",
                "username": "NalarueAni"
            },
            "url": "https://myanimelist.net/reviews.php?id=240722"
        },
        {
            "content": "[Specialty: Ecchi and enjoyment]\r\nA short note: Ladies vs Butlers is one of quite a few XEBEC productions I've seen. And this has the best colour and animation I've seen, This is *strictly* one reason why it is a 7. Compare it with Mahou Sensei Negima to get what I mean. The story is kinda like a dunno-why-girls-jump-at-guy harem that never gets resolved. Watch it for enjoyment.\r\n[Mood: Light for near-all episodes]\r\n[Explained notable pickings:]\r\nEcchi: Lots of see-thru underwear and naked bodies, dun worry, there's lots of it. Not all episodes though, sometimes a lot sometimes none. [6-7/10]\r\nEnjoyment:Well, to be honest, most of the laughs came with ecchi.There were a few touching moments to boot too, and it is quite well-rounded entertainment, but leaning to ecchi. [8/10]\\n\\n\r\nHarem: Typical. Girls fall in love with same guy cause of soem cheap kindness or a favour done. No resolution done for any girls in harem except the 2 mains. [4/10]\\n\\n\r\nCharacter varsity: A lot. Like someone mentioned in a review, count how many typical characters you can see in 1st episode and it'll probably exceed *a few*. Not to mention the rest. But... little character development spoils the characters.\\n\r\n[4/10]\\n\\n\r\nPotential wasted: This is one controversial problem. What was the manga like? I dunno. But Asu no Yoichi the anime was great, much better than manga (I put it on hold aft a few chapters, couldn't continue). Cos this anime seems to trap itself in a harem net it couldn't untangle. Girls who fell in love with guy disappeared completely sometimes for a few episodes, then reappear. If it was like something like Princess Lover!, it could have much more potential. [7-8/10]\\n\\n\r\nStory:6\\n\r\nHere and there. No plot at all. Seems to just show us school life at a Ladies-Maids-Butlers school and have harem thrown in. The ending was a big fluke, and the last episodes seem to culminate in a \"trough\", the opposite of a climax. Harem was hopelessly unresolved, which was pathetic. Some things were resolved, though, credits to that. Like the rivalry-love fight between he 2 main gal characters.\\n\\n\r\nBtw some episodes seem focused on one character, while some were purposefully ecchi (to the point of being ridiculously funny). Tons of fanservice that derail main mood.\\n\\n\r\nArt:9\\n\r\nColour was very good, animation was very smooth, ecchi was expressed very well and so on. Scenery was good too, unlike Baka to Test to Shoukanjuu (?), and shades were nicely done.\\n\\n\r\nOnly complaint about art is that it does not have a 3D concept and probably some characters seem pretty similar, facial expressions were not significantly memorable.\\n\\n\r\nSound:6\\n\r\nDidn't really take notice of ED. OP the lyrics were good and tune was catchy. Can't remember much of sound effects and bgm, although I'm quite sure they are not great (or else I should have remembered).\\n\\n\r\nCharacter:6\\n\r\nSome characters that get introduced for 1 or more episodes get thrown away pretty often. Character personalities were pretty stable except last few episodes, where a very clumsy girl suddenly becomes strong and very steady (she's the *VERY* clumsy type).\\n\\n\r\nVery little character development in any character, by the end I still wondered what is the main guy's character like. He seemed to be led on by various circumstances and was just using typical responses, so nothing special was noted about him other than the very cliche \"kind\". Plus his past has a lot of potential, but was not delved into. Wasted.\\n\\n\r\nEnjoyment:8\\n\r\nEcchi to the point where it becomes funny. Some touching moments and slower parts. Well, to be sure I was \"mindlessly\" enjoying myself. It was not about plot but I managed to successfully watch all 12 episodes, which is good already :D.\\n\\n\r\nOverall:7\\n\r\nWatch it if you are feeling down or something. Dun try watching for a plot or serious anime. I put it on hold before, once.",
            "date": "2010-04-04T03:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 24643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=24643"
        },
        {
            "content": "very cool funny and ECCHİ anime if u love these kinds u found it \r\nit's about a highschooler who is Akiharu Hino he transfers to a school a very different one than others.there is two clas of students that given education one of them is upper-ed there the rich girls and a boy(gay i think :D) that given education and the other one is servant-ed there they train how to be a butler or a maid so the main protagonist Akiharu Hino starts to take education there but there is many many hardships awaiting for him like his childhood friend Tomomi Saikyo she is oneof a killer and there is Selnia Iori Flameheart she kinda starts to fall in love with Akiharu.it's very fun to watch it's comedy scenes is cool to and it's ecchi it's something i can't tell u guys u must live it :D \\n\\n\r\nstory: it's interesting and cool 10\\n\r\nart: very very good 10\\n\r\nsound: good 10\\n\r\ncharacter:all of them are uniqe 10\\n\r\nenjoyment:great 10\\n\r\noverall: 10",
            "date": "2010-02-06T16:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 22998,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/291600.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/chingstah",
                "username": "chingstah"
            },
            "url": "https://myanimelist.net/reviews.php?id=22998"
        },
        {
            "content": "Finish watching Ladies vs Butlers and not realizing that i already finish all 12 episode just like that \r\nIt ends so sudden that you wanna watch for more but if only your a fan of Ecchi & RomCom with lots of fan service. You might want to try this.\r\nTo be honest I'm not a fan of Ecchi anime but this anime was so easy to watch that i can actually finish all 12 \r\nepisode in just one sit. I mean easy 'cause it didn't bored me at all there's no doll moments the characters was great they gave me so much laugh and the twofemale lead was outstanding with their role as a Tsundere and a Sadistic but our male main protagonist is your typical average guy making all the girls fall for him with his bad boy looks but good on the inside and even there's no main plot at all you can easily keep up with the story.\\n\\n\\n\r\nThe only downfall for me is that the boobs was uncensored it kinda distract me while watching the anime but if you like boobs being uncensored and totally this anime is for you. 'cause the whole point of this anime is for the male fans 'cause it has a lot of fan service i mean a lot basically the whole season is about fan service and they just added a little bit of romance and one more thing the ending was messed up they should do a season 2 of ladies vs butlers so that will know what happens next.",
            "date": "2014-06-22T02:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 147987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2425719.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bloody_Venus55",
                "username": "bloody_Venus55"
            },
            "url": "https://myanimelist.net/reviews.php?id=147987"
        },
        {
            "content": "10/10 for 13 year old boys!\r\nI knew the show wasn't gonna be good when the entire first episode was comprised of boob grab jokes. I chuckled the first time and then I stopped chuckling after the 3rd one in the same episode. Upon watching the second episode, I thought they showed us tits because they knew episode 1 was a flop. Without fail, we got tits on every episode after that. I love some tig ol' biddies, but you can't run a show off of those alone. And they knew how to compensate for all the huge tits. I like me some small titties aswell, but I don't care too much for girls that look like a dolled up 10 year old boy. It is a little creepy, at the very least, seeing the tits of a girl that looks like she belongs in grade school. Then saying she is the oldest one doesn't make that alright. It is still not cool.\\n\\n\r\nThis anime has a few off topic things worth mentioning. I have never seen a lack of facial features consistent throughout an entire series. Noses are not optional, we need them. The main character is the first delinquent without a personality. I love how delinquents are always given a decent personality because they have more freedom with their character. This was clearly not the case with  Akiharu. This is also the first time I have ever seen a few episodes subbed and then decided to swap out to the dub version. There comes a time where you say \"fuck it, we are doing it live\" and change to the dub because you know the show can't get any worse. This is the first time I ever felt bad for a voice actor. They got some people who seemed sleep deprived and asked them to read the entire script in one sitting and record it. Money is money and we all like food and shiny things. \\n\\n\r\nWith all the bitching I have done, I still give the show a 4. It is bad. There wasn't anything that particularly pissed me off. The show was a generic boob and scoot. This strikes me as a show that I will show my 13 year old son and he will love anime because of it. When he asks me about women and their bodies, this will be a worthwhile instructional show. I will get my ass kicked by my wife if/when she finds out. Everything will be worth it in the end though.",
            "date": "2016-03-23T22:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 213755,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4670871.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Midg3tLuv",
                "username": "Midg3tLuv"
            },
            "url": "https://myanimelist.net/reviews.php?id=213755"
        },
        {
            "content": "Oh lord, where to begin... let's see... Interesting at points, weird at other points... overall it's one giant Echii-palooza.\r\nMy first reaction to watching this was \"What the heck did I just get myself into?\". That was only the first episode. Over time, it got better, funnier, and a lot more perverted, trust me. As an Anime Expert, I know a good echii show when I see one. It's got everything you could think of; bath houses, hot springs, hotel rooms, closets, beaches, and in an entire school with like 3 guys and 400 girls, you know it'll be interesting to watch.\r\nThe story was interesting, normalguy moving to a school to learn how to be a butler, and what really made me think, was when he got every girl in the school to try and kill him after one little mistake: landing on top of a girl. She freaks out, runs off with her chasing him, stumbles on top of another girl, then another, and another... next thing you know it, there are a whole bunch of Amazons coming after him. That made me laugh. They all work it out in the end, but for a while, it looked like the end of the show for him.\\n\\n\r\nArt, what you would find in a normal anime made these days, well done.\\n\\n\r\nSound, good character voices, matches them fairly well, but now we gotta see how english dubs will fair.\\n\\n\r\nCharacters, lovable, annoying, crazy... a variety.\\n\\n\r\nEnjoyment... a solid 6. I didn't enjoy it as much as I could have if they had changed a few things. If you've seen it and agreed with pretty much everything I've said so far, you know what I mean.\\n\\n\r\nOverall, this was just an anime that had crossed my eyes and I had clicked on episode 1-12. Nothing amazingly special, worth watching, but your ending results may vary.",
            "date": "2012-09-26T16:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 73361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=73361"
        },
        {
            "content": "Ladies vs. Butlers is a typical ecchi comedy, which pretty much sticks to the formula and includes all the standard elements without doing anything that makes it stand out.  It's not particularly bad, but then it's not particularly good either.  Expect lots of nudity and a few hilarious moments, but no real redeeming qualities otherwise.\r\nStory: 4\r\nA school designed specifically to reinforce the hereditary social hierarchy.  If you're from an upper class family, you come here to learn how to be prim and proper.  If you're from a servant class family, you come here to learn how to be properly subservient toyour betters.  (Can you tell I'm cynical?)  Fortunately, the anime doesn't really hit you over the head with it, like for example in They Are My Noble Masters.  The school is just the setting, and the show is about humorous goings-on at the school.\\n\\n\r\nArt: 4\\n\\n\r\nThe style isn't as clean as in some others, and something kind of bugs me about the character designs of the girls.  I guess they're meant to be \"voluptuous\" but to me they just come across as chubby.  Upon watching it a second time, I figured it out.  It's most obvious on Flameheart.  Her waist is too high, which makes her look like she has big hips.  It's not quite as pronounced on the other girls, but it's still there.  Also, I really don't like her \"drill hair,\" but the fact that they turned it into a running gag keeps it from losing another point.\\n\\n\r\nSound: 5\\n\\n\r\nThe theme song is fun and catchy, although not my favorite.  The voice acting and incidental sounds are fine.\\n\\n\r\nCharacters: 5\\n\\n\r\nI'll be honest, there's nothing special about these characters.  They're your standard harem anime characters.  I don't like Saikyo's sadistic streak (worst childhood friend ever!), or Flameheart's snobbishness, but neither bugs me enough to lose a point.  The principal is funny, and it would have gained an extra point if she played a larger role.\\n\\n\r\nThe hero is not one of the two harem anime stereotypes: the misunderstood good guy or the admitted pervert.  He's not the pervert everyone thinks he is, but he's no \"poor me\" whiny brat either.  He gives as well as he takes, as evidenced by his insubordinate attitude toward his betters, such as his banter with Flameheart.  She gets the better of him as often as he gets the better of her, but his \"I don't give a damn\" attitude makes him particularly likable.\\n\\n\r\nI do have one complaint, which is that I really don't like any of the girls.  Part of the fun of a harem anime comes from choosing your favorite girl, but in this case, I think the hero is better off without any of them.  The two main rivals, Flameheart and Saikyo, are each unlikable.  The other girls are mostly forgettable.\\n\\n\r\nNormally I would consider this a huge failing in a harem anime, but for some reason, it doesn't bother me too much here.  The show is entertaining despite a lack of sympathetic characters.\\n\\n\r\nEnjoyment: 6\\n\\n\r\nIt's just plain fun to watch.  Don't expect anything deep or awe-inspiring, and don't even expect any particularly interesting characters.\\n\\n\r\nOverall: 5\\n\\n\r\nIf you're into perverted comedies, you have to watch this one just to check it off your list.  Otherwise, skip it.\\n",
            "date": "2014-12-22T21:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 173731,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/lasterrending",
                "username": "lasterrending"
            },
            "url": "https://myanimelist.net/reviews.php?id=173731"
        }
    ],
    [
        {
            "content": "This show is just one pencil drawing away from being hentai, and that is being generous.  Besides that, the only really annoying parts of this show, which can be found in about 99% of anime because, well, anime logic, are the girls with ridiculously big curly hair, 19 year olds that look and act like 6 year olds, and the infamous \"when in an intense sexual situation, lets snap out of it and try to say something inspirational in an annoying caring tone\".  \r\nThat aside, it was fun to watch.  The audio and art was fine, though the eyes left a lotto be desired as they all look dead.  The anime food looks nice and the structures are done nicely.",
            "date": "2018-12-31T08:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 297583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7611530.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/FuzzyButtGaming",
                "username": "FuzzyButtGaming"
            },
            "url": "https://myanimelist.net/reviews.php?id=297583"
        },
        {
            "content": "Ladies Versus Butlers! The first anime in 2010 i planned, and eventually did watch.\r\nIt wasn't bad.. but it wasn't good either, \r\nReasons Why: \r\nPros = Gave a new harem twist to anime\r\nIntresting characters, the tsundere, the childhood friend, the lolicon, etc etc\r\nCons:\r\nFrom the title, you'd assume this was an action title.. heh, action..\r\nWhich relates to my next point, the ecchi, yes, the ecchi.\r\nEcchi anime certainly have comedic value, but I feel that this was way too much ecchi, even for an R+ anime, i was quite shocked.\r\nThis is no Ichigo 100% with almost constant panty shots\r\nIt's more of a combination of Hanaukyo Maid Team andIkkitousen (Battle Vixens)\\n\r\nCleavage and Nudity, now for those who like ecchi i'm sure this would get a full 10\\n\\n\r\nbut from me it gets a 7",
            "date": "2010-12-20T15:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 32919,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/256490.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mimerio",
                "username": "Mimerio"
            },
            "url": "https://myanimelist.net/reviews.php?id=32919"
        },
        {
            "content": "I have always believed that no matter how bad the anime is i can always find something made up for it. So i rarely dropped an anime and i dont hate any animes, i just dislike them.\r\nAnd i think that no matter what gernes you're watching, there's nothing more badass than treating the girls with respect. So im very frustrated to rate an anime this bad for a long long time and it's all because of the main male character.\r\nI dont care if this is a very ecchi anime with lots of fanservices ( naked bodies, bouncing boobs,.. ), i will enjoy it but therecomes the main male character who look like a gay always angry for no reasons what so ever. Treating women so bad like it makes him the coolest guy in the world. Finally i found a character i really hate the same like Banri from Golden Time or Kirito...\\n\\n\r\nWell the girls of this anime are pretty typical, stundere, childhood friend, tranfer student,... well it could be an awesome comedy if not for the reason i just stated. \\n\\n\r\nThat's all i wanna say.",
            "date": "2015-07-04T05:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 192265,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4489573.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 0,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/johnbradshaw",
                "username": "johnbradshaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=192265"
        },
        {
            "content": "So what do you expect of this title? An epic battle between the two different sexes of servants, or something unlikely like a harem love triangle? Well, the title is pretty irrelevant to what the anime offers.\r\nAs I watched this anime through the very end, I found myself annoyed of how much fanservice appears very, VERY frequently. Too much, that it was unbearable to watch most of the time. I'm not much for fanservice, but those who appreciate it, will be well satisfied. The story is pretty in-and-out, like I mentioned before, it's a love triangle, but some episodes are character intros and more fanservice.\r\nTheonly good thing, that I would give this a fair score, would be some comedic moments that gave me a smirk or a grin. It's pretty well executed and you'll know once you've watch the first episode.\\n\\n\r\nSo, overall, it's a pretty fair anime. Not something I would rewatch, but if you want to watch a new harem this year, I'd put this in your list.",
            "date": "2010-03-28T19:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 24417,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/286289.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Shobster",
                "username": "Shobster"
            },
            "url": "https://myanimelist.net/reviews.php?id=24417"
        },
        {
            "content": "I don't really like this kind of anime, but I always end up watching it just because of the fanservice [lol].\r\nAnyway, here are my thoughts:\r\nStory [6/10]: Random guy enters in a school for rich people, get involved in some trouble, there are some fanservice and two girls [or more] fall in love with him. That's an old cliche we are all used to. The only original thing about it is that it's a ladies and maids/butlers school. It seems a little too fantasy, but you get used to it. It's actually quite fun to see how they are teached differently, and there's some mild societycritics deep in there. I mean, really deep. The end is predictable. Fair story.\\n\\n\r\nArt [07/10]: Almost nothing to complain about. The art is cute and good, clothes and scenario are really nice. Some hairs are weird [Flamehart's is the most crazy one XD] but you get used to it too [specially because the characters themselves make fun of them]. Sometimes boobs are a bit too big, and faces/feet are a bit weird, but overall it's quite decent, pleasant art.\\n\\n\r\nSound [10/10]: I absolutely LOVED the songs, they placed the mood really well. OP and ED are great, they have nice beats and good voices! There were some great seiyuus involved in this, so there couldn't go wrong, they made a great job.\\n\\n\r\nCharacter [08/10]: There's almost no character development. Only Flameheart and Tomomi make some serious breakthrough during the series. But the characters are funny and cute, so I enjoyed them. I tend to like the dark haired girls, but this time I really went for Flameheart, she's cute and her hair is awesomely weird XD go doriruu!!~~ I also fell in love with Ayse and Pina. I'm sure you'll find a least one character that you'll like, they're all very different, funny and interesting.\\n\\n\r\nEnjoyment [08/10]: There was a lot of discussions and posts in Sankaku Complex about the explicit ecchi content of this series. I enjoy ecchi, and I think it was well done. I laughed a lot and was touched by some characters, I enjoyed it. I've seen lots of animes like this, but watched all the episodes, so yay for it 8D I'm really picky.\\n\\n\r\nOverall [08/10]: It's not the first time you see an anime like this, I think it's a \"can't go wrong\" formula. If you like animes with this genre, go for it, it's a pleasant story. The end of the series is totally expected, but it's part of the old \"formula\" thing. Ecchi is quite good, it gets to almost every fetish you guys may have. As an ecchi fan, I liked it. So, if you have an afternoon with nothing to do, and want to watch some light, funny and hot anime, get into LadiesxButlers. If you don't like ecchi, or want complexed characters/etc, please don't even bother watching it.",
            "date": "2010-05-08T02:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 25845,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/35948.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tengu_Susanoo",
                "username": "Tengu_Susanoo"
            },
            "url": "https://myanimelist.net/reviews.php?id=25845"
        },
        {
            "content": "At first glance it appears to be just another ecchi show focusing on breasts. And it pretty much is. There's very little depth to it, and that's fine.\r\nI don't mean to go on a rant here but some people seem to be under the impression that every EVERY anime has to be thought provoking and meaningful. And if you're of a similar mind then avoid Ladies Versus Butlers like the plague.\r\n But if you understand that context and intent define an anime AND aren't opposed to this sort of material, then you've got a winner here! The girls are cute, jiggly and diverse and it'splayed up for laughs.\\n\r\n [spoiler]\\n\r\nOne thing I really liked about this anime is it dealt with my main issue with harem type anime i.e. \"JUST PICK ONE AKIHARU!\"  No Akiharu is oblivious to their efforts and that makes the whole thing funnier\\n\r\n[/spoiler]\\n\r\n If you love fanservice and comedy and don't take your anime too seriously then check it out, you've nothing to lose. BUT... it would be wrong of me to not mention that this one isn't for everyone. There plenty of reasons others will tell you to avoid this title; some are valid but it really comes down to the mentality of you the viewer. Just look at the picture for this anime and you should already know if this is something you wanna watch.",
            "date": "2017-07-21T11:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 253392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=253392"
        },
        {
            "content": "\"Seriously, what a crappy ending...\" - Pina Sformklan Estor, one of the supporting characters.\r\nThis review contains spoilers regarding the ending.\r\nThis show is rated R+ for mild nudity and has an Ecchi tag, the reason being is the fan service and uncensored boobs. You should keep this in mind if you are going to watch it, the boobs themselves appear every episode for 1-3 minutes.\r\nI had high hopes for this show, beside the fan service and the boobs, the show had interesting characters with potential, even tho I knew that I shouldn't had hoped for such a thing, I had hoped that the romance would gosomewhere and we would end in a good note, but as you can see from the quote above that sadly doesn't happen. Sadly the MC has a deadly disease known as being dense as a black hole and as such he can't understand that the girls are interested in him even if they are fighting for a chance to spend time with him.\\n\\n\r\nThe characters are interesting and aren't shallow, you know why they do what they do and understand their reasoning - at least the 2 main heroines. The MC is your common run-of-the-mill Harem MC. It is something that appears a lot these days, the show or the manga tries to make the MC as ordinary and empty as possible so that the viewer can project himself on him, in an attempt at trying to make the MC likable by every viewer they make him shallow and bland so that no one gets offended or dislikes any particular part of him. Well because of this reason the show failed miserably.\\n\\n\r\nIf one wants to watch this show then he/she shouldn't do it for the ending, and only do it for the fan service and boobs, which I must say, in itself was pretty well. The animation is done in a neat way, it is fluid and looks natural, the art itself is pretty good too, it is definitely better then most Harem series out there. When you add the pretty characters to the great looking art then it creates a good eye candy. \\n\\n\r\nIf you wish to watch a fan service anime with boobs and pretty girls, then without a doubt give this show a try. The romance didn't go anywhere and the MC is dense so you shouldn't expect anything from that department. Overall what it lacked the most was what almost all Harem anime lacks in common, a daring, bold and interesting main character.",
            "date": "2017-07-15T12:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 252936,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4711749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/HDTurtle",
                "username": "HDTurtle"
            },
            "url": "https://myanimelist.net/reviews.php?id=252936"
        },
        {
            "content": "Ladies versus Butlers! is basically a show with a great premise that was poorly executed with the likes of massive amounts of fanservice. \r\nStory: 7/10\r\nThe story in theory is actually very interesting. A group of students go to a boarding school where they either learn proper etiquette and manners, while other students learn how to become a maid or butler. The story revolves around Akiharu who tries to become a butler to get his life going, as well as his interactions with the many girls in the school and the butlers themselves. \r\nArt: 6/10\r\nThe art is decent, but there are two issues I have withthe art style: 1. Every female's face looks exactly alike (except for eye color and hair style/color) and 2. There's a ridiculous amount of fanservice. Other than that, it's decent, but nothing really stands out. \\n\\n\r\nSound: 5/10\\n\r\nThe music was okay for this anime, but it's pretty forgettable and insignificant. \\n\\n\r\nCharacter: 6/10\\n\r\nThe characters were okay, with Akiharu looking like a delinquent but having a nice and naive attitude, while the girls had each of their own personalities that set them apart. Examples would be Selenia being a snobby girl who tries to be the best in everything, Tomomi being a nice girl when she's really a manipulative prankster, Kaoru who's a cross-dresser who's cold to Akiharu, and Sanae who's a total klutz. \\n\\n\r\nEnjoyment: 6/10\\n\r\nBesides the Fanservice that made me groan and cringe constantly, I enjoyed the interactions that Akiharu had with everyone, how the plot fleshed out as the episodes went along. It had it's funny moments that made me chuckle a little.\\n\\n\r\nOverall: 6/10\\n\r\nA show that could've had good potential had it not gone in the fanservice route and go full throttle with the massive amounts of nudity and breasts it threw in my face. Watch it with caution, this is the type of anime that people who love ecchi would enjoy.",
            "date": "2017-05-05T20:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 247032,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5843414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OBruxo",
                "username": "OBruxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=247032"
        },
        {
            "content": "Ladies Versus Butlers is a decent harem anime, but decent is where it cuts off.\r\nPersonally I did enjoy this anime, but I have a soft spot for harem anime, so objectively it is neither amazing nor bad. \r\nThe story is probably where this one suffers the most. It is fairly unmemorable and exists only as a kind of string tying all of the scenes together, if you are somebody who finds enjoyment in clever writing, deep meanings or something that will get you thinking, pass on this one.\r\nIf you want an easily digestible ecchi with an abundance of bouncy goodness, simple art, and a fewgood laughs than Ladies Versus Butlers is a good way to kill some time.\\n\\n",
            "date": "2016-07-07T13:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 223408,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5533235.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HarmonicRev",
                "username": "HarmonicRev"
            },
            "url": "https://myanimelist.net/reviews.php?id=223408"
        },
        {
            "content": "Hey folks, this will be a review for Ladies versus Butlers!. This show is a harem, ecchi, slice of life, generic piece of work. If you don't like those things then you shouldn't watch this show. That being said its not terrible. It doesn't excite me like other harems, and even though there was a host of wonderful women didn't feel like it was anything special or interesting.\r\nThe story revolves around our male main character Hino, Akiharu. Hino transfers into a school which is split between maids/butlers and the upper class ladies. As I'm not super into maids this is already a boring plot linebut whatever. When he transfers in he is mistaken for a delinquent and as such most of the girls fear him. This is how we meet our token Tsundere, along with a childhood friend who is the schemer. Hino then try's to fit in to his new role as a butler in this school.\\n\\n\r\nThis has been done in other shows and handled vastly better than ladies versus butlers. I don't want to give the impression that I hate generic themes or anything, because I love a generic harem(including this one). However if your looking for this to be refreshing, new, or otherwise well conceived you will be upset. Hino doesn't really fit the butler role, though they do give up trying to make the butler and maid image their flagship image. We spend most of the story showing the good qualities of Hino and exposing some of the secrets our harem full of ladies have. Of course nothing is decided by the end of the anime. Though I will give them props for not forcing some dramatic event that seem to plague shows like this.\\n\\n\r\nThe art was decent. Someone in the comments pointed out the girls sometimes don't have noses and that bugged me because I couldn't stop noticing it. Soundtrack was cute and not bad.\\n\\n\r\nThe characters were decent enough and each girl had a charm of her own. Our two main female leads were Flameheart, Sernia Iori and Saikyou, Tomomi. Iori is your typical tsundere, who spends most of the anime giving Hino shit and slowly falling in love with him. Tomomi is the childhood friend who likes to scheme and pick on everyone. These two remind me of Boku wa Tomadachi which IMO was an excellent anime so give that a watch if you like that kind of rivalry. Anyway our side characters are the interesting ones. I cant put them all down because there is an extensive list. Most of them have interesting personality and I rooted for most of them.\\n\\n\r\nI enjoyed this show. It was funny at times and the girls all grabbed my attention. The art was a little dated and the ecchi wasn't very titillating. The ending was bland, didn't really inspire much interest. I guess you could say that's how the rest of the anime felt. This was just a mediocre anime over all. However, If you like harems and you have nothing to watch this isn't terrible, its a quick and enjoyable fix for those that like this type of anime.",
            "date": "2016-02-10T20:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 210629,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=210629"
        },
        {
            "content": "It's not the most complicated anime ever. BUT if you don't have a problem with heavy ecchi. And you watch anime to cool off from your daily stress, This is the best thing.\r\nI think this anime is really funny and this anime is such a feel good. After 4 years I still think I have never laughed so hard and smiled so wide as with this anime. The reason isn't because I'm a pervert, but This just made me so happy",
            "date": "2013-04-08T14:02:00+00:00",
            "helpful_count": 0,
            "mal_id": 93063,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442090.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/sinned1995",
                "username": "sinned1995"
            },
            "url": "https://myanimelist.net/reviews.php?id=93063"
        },
        {
            "content": "After much internal debate , i finally decided to write a review for the abomination that is this anime. Yep ! you read it right fam - ABOMINATION . Not a word you'd associate with a genre designed to solely satisfy your not so dormant carnal desires , without having to resort to hentai or you know actually getting some.. but lets be honest - you arent getting any thats why you watch harem anime (UNLESS you are getting it , then well done bro!.. or girl.. Gender Equality for the win right?)\r\nAnyway the anime..\r\n~Synopsis~\r\nOur MC Akiharu joins a school that trains you to puta straight smiling face whilst being oppressed by your now peers and soon to be \"masters\" .Basically they train butlers and maids....and also arrogant teenage girls from rich families how to oppress their classmates who are in the  \" servant class\" . Also the majority of students are female obviously.\\n\\n\r\n~Story~\\n\\n\r\nIt would have been interesting if they just showed servant class students being trained in the brutal anime-esque fashion. The only training the mistresses get is knowing what tea and cake to order .. how original! \\n\\n\r\nThe story telling is so bad that they spend half the season of 12 episodes introducing pointless characters , who are all basically the overused troupes we are all tired of -\\n\r\n1) the loli , \\n\r\n2) the overtly cluless girl, \\n\r\n3) the clumsy AF times ten girl with unsurprisingly large bossoms who offer a sneak peek at her panties every time she \"falls\"\\n\r\n4) the mute exotic princess who stereotypically is indian-ish  and her ninja bodyguard who'll go to any lengths to satisfy her\\n\r\n5) an otaku chick   \\n\r\n6) the pervert friend who gets nothing\\n\r\n7) the boy who keeps questioning his gender.\\n\r\nand so on\\n\\n\r\nThe story never picks up any sort of movement till the last 3 episodes. I had to force myself to finish the series hoping to get some sort of plot. But who was i kidding - its an echhi anime..very rarely do they put more effort into the story than into deciding how large the next girl's boobs should be. And i wasnt wrong.. all this anime offers is eyecandy .. i.e nude girls ( No Steam-san or 'god rays from out of nowhere'-kun to spoil your mood) If hentai minus the action gets your blood boiling then this anime is for you.\\n\\n\r\nThe only saving grace storywise was the entertaining female protaginists who easily overshadow the most clueless male protagonist since Goku. The Tsundere vs Yandere battle was by far the most entertaining thing on a show where they just cut-away to a bath with lots of nude girls when the story gets boring...or when these 2 need to ponder about their feelings for the idiot Akiharu.\\n\\n\r\nBut what grinds the gears of most people including myself who watched the whole ordeal is the ending.. I'm not gonna spoil it for anyone who actually wants to go waste 6 hrs on this anime. But its so bad that i think the internet got the word 'Cop-out\" from this anime. Its so bad that even one of the characters in the anime admitted it . Not joking , its true .\\n\\n\r\nBut to be honest i think the creators did this thinking that they would be able to get a second season out of this. How deluded were they ? \\n\\n\r\n~Artstyle~\\n\\n\r\nI have to give this an 8 . Nothing new . But a pretty solid design for most characters , mainly Selnia (the tsundere) . The artsyle is perhaps the only reason i managed to finish this horrendous piece of crap.\\n\\n\r\n~Sound~\\n\\n\r\nAverage.\\n\\n\r\n~FINAL VERDICT~\\n\\n\r\nIf you still want me to spell out for ya - go elswhere! There are plenty of better echhi harems with uncensored content who atleast make an effort to make a decent attempt. \\n",
            "date": "2018-03-21T07:53:00+00:00",
            "helpful_count": 0,
            "mal_id": 274447,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5358430.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/the_neko_man",
                "username": "the_neko_man"
            },
            "url": "https://myanimelist.net/reviews.php?id=274447"
        }
    ]
]