[
    [
        {
            "content": "These days we take the written word for granted, but for the majority of human history this has not been the case. Over the millennia, those with the ability to communicate using these strange markings have been viewed with awe and suspicion in almost equal measure, and many believed that anything written was magical in some way. It's only logical then, that people would begin to think that certain works were  holy writ handed down by a deity, held the secrets to immense power, or contained forbidden knowledge that would bring misfortune and death upon anyone who read them.\r\nEventually certain books were, for onereason or another, deemed too dangerous for the general public ...\\n\\n\r\nOriginally a light novel series by Mikumo Gakuto, Dantalian no Shoka (The Mystic Archives of Dantalian), takes place in England after World War 1. Hugh Anthony Disward (or Huey to his friends), returns to his ancestral home six months after receiving a letter informing him that his grandfather, Earl Wesley Disward, had been murdered by a burglar. According to the will, Huey can inherit the title, the estate, and everything contained within the mansion, but in return he must take over responsibility for the Bibliotheca Mystica de Dantalian, and look after Dalian as well.\\n\\n\r\nMagical books have long been a staple of the fantasy genre, but unlike the majority of tales dealing with them, the main focus of Dantalian no Shoka is to seal away those works that were never meant to exist, or have fallen into the wrong hands. It's a reasonably simple idea that can work very well with an episodic plot (Mushishi, Natsume Yuujinchou and Mokke use a similar method), but sadly that isn't the case here. The straightforward premise doesn't seem to have been enough for the writers, who have very clearly tried to cram as much as possible into twelve episodes. The story can often get sidetracked or bogged down in semantics, and there is a tendency towards over-explanation and melodrama. In addition to this, there are several characters who appear to have been included just to show how \"good\" Huey and Dalian are, and because of these issues it can often seem as though the narrative has been cobbled together with hobnails and glue.\\n\\n\r\nNow it may seem as though there's little of interest to be found in the story, but that's not actually the case. When the plot sticks to the point there's a surprisingly nice balance between the mystery and supernatural aspects, and there's a good deal of imagination in the way certain phantom books are used or affect people. The series also ventures into darker territory that suits the main theme of the show very well, but these occasions tend to be spoiled by some truly inane humour.\\n\\n\r\nThat said, while there are some major issues with the storyline, Gainax have done a decent job with the visuals. There are several different art styles on display that reflect the nature of certain episodes, especially in aspects like design and colouring. There are also some rather nice effects that work well with the detailed backgrounds to create some very atmospheric settings and scenery.\\n\\n\r\nThere are some issues that need to be raised though.\\n\\n\r\nFor some reason the animation tends to be rather simplistic, and while this seems to fit with one episode in particular, it does become a problem during action sequences. In addition to this, there's a certain \"stiffness\" to the character movements that may be an intentional dig at British reserve, but it's more likely due to carelessness or time/cost constraints. The character designs are unoriginal and uninspired, and while the clothing is somewhat reflective of the period, viewers will be forgiven for thinking that Dantalian no Shoka is nothing more than a copycat of Gosick.\\n\\n\r\nThe opening sequence is a decent montage that features the more prominent characters, some rather pleasant imagery, and a little action, all to the tune of \"Cras Numquam Scire\" (Tomorrow is Never to Know), by Yucca (featuring Ono Daisuke), a hauntingly choral track that is slightly reminiscent of \"Lilium\" - the opening song from Elfen Lied. The ending sequence is a short film about a little girl in a horned mask and white dress, walking barefoot through the forest while dragging a large trunk, and alongside the music box stylings of maRIONnetTe and their song \"Yes, prisoner\", the overall effect is decidedly ... unnerving.\\n\\n\r\nDantalian no Shoka is generally well served in the audio department, and there's a nice variety of classically themed tracks available, although it should be pointed out that the majority of the series is actually devoid of musical accompaniment. The effects are well choreographed, but rarely overbearing, and it seems that a conscious effort has been made to emphasize the quality of the script and the acting.\\n\\n\r\nFor the most part the dialogue is pretty decent, although there is a degree of immaturity about certain conversations, and the explanations can sometimes sound pompous and overbearing. Then again, the latter may be nothing more than a reflection of each role, especially as the actors deliver some good performance throughout the series.\\n\\n\r\nThere's something puzzling about the characters as there's very little in the way of actual development, but there's also not much definition given to them either. Aside from being unable to write off the supernatural as mere superstition, Huey doesn't actually grow in any way, and Dalian remains the stereotypical tsundere loli for much of the series. There's also very little attention given to the supporting roles, in particular to the people using or afflicted by the phantom books, and one has to wonder if this was due to the attempt to cram so many different elements into the plot.\\n\\n\r\nThere's also the issue of Dalian's connection to the pink haired girl living in the \"gourd\", but that raises a lot of other questions, especially about Raziel and Flamberge, so if you really want to know, just ask (or Google it).\\n\\n\r\nAside from the similarity in the character design and the fact both shows try to wade through various mysteries, Dantalian no Shoka has surprisingly little in common with Gosick, but that's both a good and bad thing. The general lack of detail about the characters means that there's very little justification for their actions, and aside from Huey, the lack of any real back story means that many of the roles lack the necessary depth needed to take the story seriously. There's also a surpisingly pro-censorship message built into the narrative, and this isn't helped by the fact that the male lead is a lord, while Hal Kamhout, the Libricide officer, looks like a priest.\\n\\n\r\nThe biggest problem with the series is that it tries to do far more than it should, and because of that viewer's may be left with a feeling of incompleteness come the end of the anime. While the story is interesting up to a point, the morass of people and events mean that there are no outstanding moments, and nothing to really capture the heart. There is entertainment to be had from Dantalian no Shoka, especially for those who like shows laden with symbolism, but this is nothing more than a veneer of \"intelligence\" that overlays the shallowness of the series as a whole.\\n\\n\r\nIt's a shame that more effort wasn't put into making this anime work as the concept is actually pretty good. The basic premise is sound, and if Gainax, the writers, and director Uemura Yutaka had taken the show more seriously, then Dantalian no Shoka could have been something truly interesting and entertaining.\\n\\n\r\nAnd for those of you wondering how an entire library can fit inside a person, here's an explanation from Sir Terry Pratchett's \"Discworld Companion\":\\n\\n\r\n\"Even big collections of ordinary books distort space and time, as can readily be proved by anyone who has been around a really old-fashioned second-hand bookshop, one of those that has more staircases than storeys and those rows of shelves that end in little doors that are surely too small for a full sized human to enter.\\n\\n\r\nThe relevant equation is Knowledge = Power = Energy = Matter = Mass; a good bookshop is just a genteel Black Hole that knows how to read. Mass distorts space into polyfractal L-space, in which Everywhere is also Everywhere Else.\\n\\n\r\nAll libraries are connected in L-space by the bookwormholes created by the strong space-time distortions found in any large collection of books.\"",
            "date": "2011-11-18T14:55:00+00:00",
            "helpful_count": 203,
            "mal_id": 47653,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=47653"
        },
        {
            "content": "Updated to Final Episode.\r\nI personally had this anime recommended to me by a friend, saying I might like it. (He had read the novels I believe.) So I came into this show knowing nothing at all since I had decided not to try to get any background on it to be unbiased about it.\r\nI was reasonably surprised by how good I actually found it to be. \r\nStory:\r\nPersonally I normally don't like dark atmosphere anime, yet this one does it in a way that I wanted to keep watching since it kept pulling me in to want to know more about the story and these PhantomBooks.\\n\\n\r\nOk, after episode two I find myself mildly lost. At first I thought that the Phantom Books were going to be a tool of destruction in the hands of people who could not control them. But if I understood correctly Huey used two in the episode as weapons. Guess they can be used as tools in the right hands.\\n\\n\r\nWith that said, the story feels a little rushed since there isn't continuity between the two episodes, so it looks like theres an overall theme, but different scenarios that don't continue on. Hopefully this doesn't persist and they take sometime to explain some more concepts or the anime is going to suffer with confusing concepts and butchered story telling. \\n\\n\r\nWell, they never slowed down one bit the entire anime, they just kept on chugging by without taking the time to explain concepts. They decided to go on an episodic route, which I had hoped they wouldn't, since a good linear story would probably have made more sense for this series. But I still liked each episode for what it put out, each being interesting and unique in its own way. The finale was especially well done, making up for some of the confusion along the way.\\n\\n\r\nArt: \\n\r\nVery neat realistic backgrounds. Pretty well designed cars and items from the time period the anime is set in. The backgrounds never cease to amaze me in this anime, they are extrordinarly well done, it looks very realistic for an anime that's for sure. The character designs go well with the backgrounds and settings. Huey has a nice design, and so does Dalian. Not much else to say about it.\\n\\n\r\nSound:\\n\r\nThe background music so far is very appropriate to the scenes it is used in. It doesn't seem out of place and just fits with the anime in general. With episode two I saw the opening, they did use it in episode one, but without the opening sequence. I think the opening is very appropriate for the anime, it goes with its theme of being a dark mysterious anime, which the opening reflects with its mellow somber tune. I stand by my perspective of episode one; the ending... IS strange, the music was creepy and the video is just really really creepy, I didn't particularly like it one bit. So for me the opening and background music is appealing, very appealing.\\n\\n\r\nCharacter: \\n\r\nHuey's character seems likeable to me. Seems like the kind of person that has an interesting past to say the least. Also seems to be well rounded, such as his knowledge with books and firearms, and piloting experience as well. Dalian, was enigmatic to say the least. She seems to be the kind of character you will learn more about slowly as the plot progress, but from what I've seen so far she is somewhat reserved and was brought up in a somewhat pampered state. I mainly say this because of the manner she bosses Huey around and her posture she witholds the air of someone that had been pampered or sheltered.\\n\\n\r\nEnjoyment:\\n\r\nI oddly enjoyed the first episode much to my surprise. At first I had thought that I might be a bit bored since this isn't typically a type of anime I would try. But I said what the heck and watched the first episode. This was a decision I do not regret since I am already hooked on the story, and want to know more about it. And I honestly enjoyed the comedy between Huey and Dalian in each episode since it is played out nicely and just works into character development well. \\n\\n\r\nOverall, I am mighty pleased that I picked up this show since it looks quite promising, I'm hoping that it doesn't disappoint me somewhere along the way. If the story picks up and pieces together some loose plot holes I still think this anime will be a fantastic watch. Sadly it didn't fill up every plot hole along the way, with certain things remaining murky. This seemed like the kind of anime that needed another 12 episodes to round itself off into what it could be. Hopefully a season 2 comes out to explain the loose ends, and instead of being episode by episode they chain it together into something that flows better.",
            "date": "2011-07-16T19:25:00+00:00",
            "helpful_count": 127,
            "mal_id": 39305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/473250.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KiritoKun",
                "username": "KiritoKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=39305"
        },
        {
            "content": "This is an anime about a loligoth tsundere and her generic male sidekick romping around a historically inaccurate yet picturesque England looking for magical books. It is a story perfectly exemplifying the phrase “golden mediocrity”. You can actually see how everything in this anime is just mediocre. Not bad, or at least, not all the time, but mediocre. You can almost feel how a talented touch would have raised this above the slush. Oh, well, better luck next time.\r\nStory:\r\nThe story format is episodic. This means that while there is a lot of diversity in tone and feeling, inevitably episodes will be hit or miss dependingon their chosen subject. Some episodes really caught my interest while in others I was constantly hitting the pause button so I could go do some important stuff like watch cat videos on my Internetz. \\n\r\nEverything in this show has to do with books. Magical books that have some weird superpowers. This is a nice concept and I would have been very pleased to see it delivered with more gothic subtlety and psychological horror stuff. Instead, most of the time the writers are pulling shit out of their asses that looks like it was googled on the spot and then put in the blender. I have to give them credit, though, for presenting this random hodgepodge of ideas and names as though it was actually true. \\n\r\nI guess the worst thing about this show is that it is so ridiculously over the top and crams so much corny stuff when a more subtle approach would have worked wonders for it. \\n\\n\r\nCharacters:\\n\r\nDalian: is a tsundere loligoth who loves reading and being snotty to others. She also has a magical lock on her chest, which makes for a pedo-creepy, sexual sequence that I guess the creators thought looked really cool but is actually pretty dumb. Anyway, Dalian is the keeper (one of the keepers? I don't know, I'm confused) of a mystical library of magic books. I must say, the most that can be said for her is that she is not as annoying as she first appears to be. But she is pretty annoying. Weak, too. She can neither fight nor cast any spells. To reduce the annoyance factor I suggest putting the magical lock on her mouth. Nothing interesting comes out of it anyway. \\n\r\nHuey McDuck: (demons in hell, who had the brilliant idea of naming this guy? I’ll just call him McDuck) is the generic male lead who does all the legwork. Aside from getting beaten up, shot at and drinking tea—which are all activities I enjoy watching characters do—there is nothing interesting about him. He is such a basic, unshaped mould of a character that he feels as bland as raw flour. \\n\r\nRandom episodic characters: to make up for the lameness of the main pair there are a bunch of interesting side characters making random appearances. I just realised that the episodes I liked the most focused on these other characters, like the guy burning the books and his sidekick in a straightjacket. Or the perky cosplaying heiress. Once again we have a show where the side characters are much more interesting than the leads. I suspect this is some kind of trolling trend in Japan. Along with frozen highschoolgirl panties or whatever. \\n\\n\r\nAnimation:\\n\r\nThis has the sort of glossy animation that's become popular recently. To save money, the studio used filtered photographs for backgrounds. It has a slightly jarring feel to it but nothing as eye-gouging as badly done CG. \\n\r\nThe thing that bugged me most about the animation was the style used at “magic” moments. Often, the visuals are totally inappropriate to the mood and setting. Enough with the stupid energy bolts and Technicolor seizure graphics! This ain't Power Rangers, dammit! Instead of going for dark, gothic and discreet they ruin the atmosphere and buildup with that wacky stuff. Hey, should I be expecting Ichigo to pop up with his new Bankai? \\n\\n\r\nSound:\\n\r\nThe soundtrack is quite competently put together. It has a sort of melancholy choir vibe going for it and a kind of music box tune. The people working on this knew where to put it to good use, that's for sure. \\n\r\nOP: a quite pretty and atmospheric ballad that ties in nicely with the graphics. In fact, it makes you believe you're about to watch a much better show. Ha! Joke’s on you!\\n\r\nED: some weird live-action sequence. I don't really like live-action in my anime so I never bothered to watch it to the end. I doubt it was something stellar though. \\n\\n\r\nOverview:\\n\r\nIt was a semi-chore to sit through this easily forgettable show. The best time to view it is when you're home and you are so bored out of your skull you have nothing better to do. Maybe some lazy Sunday afternoon. Not even loligoth fetishists would vote for this. \\n",
            "date": "2011-12-24T05:11:00+00:00",
            "helpful_count": 25,
            "mal_id": 50001,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56329.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Jigoku-n3ko",
                "username": "Jigoku-n3ko"
            },
            "url": "https://myanimelist.net/reviews.php?id=50001"
        },
        {
            "content": "Danatalian no Shoka or the Mystic Archives of Danatalian looked very promising, but to my disappointment so far,  hasn't shown us much of anything. \r\nStory: Well, the viewer isn't really introduced to or given much information to the main characters. You pretty much are thrown in from the first episode in a world filled with books that can cast forbidden spells that humans want to get their hands on. Hugh and Dalian, the two main characters, some how from episode 1 the episode where they just met(yes from episode 1) just plain decide to go after the phantom books. WTF? I mean doesn't Hughfind this at all strange? I've complained about some very slow story lines, but man this one takes the cake for just moving along too fast. I honestly don't know if this happens in the novel, etc, but it just seems mighty unrealistic for someone just to jump in and so \"okay Dalian let's go get these books now, when I just met you like 10 minutes ago.\" Yes the story has supernatural characteristics to it, but geez. Not only that. It turns out so far in 8 episodes we aren't really given much info about anything else other than there are other book holders like Dalian out there. Problem is that the format follows the \"monster of the week\" type and well, I'm pretty sure most people find that annoying and boring, I know I sure do. I give the story a 5. Weak.\\n\\n\r\nArt. Well I can't complain about it. It's just plain beautiful, though at times it can be a bit dark and you just can't see anything. The detail to the architecture (that is the designs) of the buildings, vehicles, etc is very nicely done. \\n\\n\r\nSound. Opening and Ending songs are very reminiscent of 18th/19th century folk songs. Usually one person singing in a chamber style type of song with accompanying instrumentation. Depending on the mood, the songs really do come out strong, though I must say it is not my cup of tea. Still I give it a decent 7.\\n\\n\r\nCharacters. Well, the Characters aren't particularly uninteresting, they just seem extremely unrealistic and well they seem to rip off other characters from other animes like for example Gosick. We have Victorique from Gosick who's short, blonde, wears nice dresses, likes to read and is tsundere and on the other side we have Dalia, black haired little girl, who likes to read books, wears nice dresses and is as well...a tsundere. I mean seriously? Well at least the male main lead isn't a chump like Kujo from Gosick. At least Hugh can stand up to himself instead of making just ridiculous claims \"I'll protect you, blah, blah\" and then ends up getting beat up like Kujo does. We are introduced to other characters like those guys from the burn books society (or something of that nature) and the most recent character Fiona (who acts a lot like Elizabeth from Gosick???). So okay the characters aren't that original, but at least, AT LEAST Hugh is cooler and tougher than that other fool from Gosick. I give it a high 6.\\n\\n\r\nOverall? Hmm...still kind of left wondering about this anime. It can be great, but it just seems to sit in mediocrity. It seems to copy a lot from another anime Gosick, which I didn't find particularly great (especially that terrible ending.) So I give this a fair 6. Maybe something else will come up in the next episodes, that might change my mind, but so far. It's pretty average.",
            "date": "2011-09-05T23:55:00+00:00",
            "helpful_count": 19,
            "mal_id": 42797,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=42797"
        },
        {
            "content": "~ May the doors of wisdom open ~\r\nIn essence, Dantalian no Shoka, or \"Dantalian\" as i will refer to it from here on is an anime that made the best of an unfortunate situation. If anime production meant compacting carbon at high temperatures, then Dantalian is a diamond that refused itself the right to form...\r\nA simple, yet vivid and interesting context of \"Magical Tomes\" makes up Dantalian, and allows it to attract an audience range primarily from both the mystery and fantasy realms. It's not revolutionary, though it's certainly a context that captures my attention much better than the majority of shows with similar paths.Literature is an important theme for Dantalian (not only due to the tomes), and generally the mystery genre as a whole. It serves to add some weight to this otherwise malnourished anime; allowing its slightly eccentric and expressive presentation to shine through, and so non-dialogue words also contribute towards Dantalian's distict \"richness\". \\n\\n\r\nThe implied scale of Dantalian's expansive fantasy context is just phenomenal. It's one that not only makes me curious enough to desire more, but the show as a whole is bathed in an ecstasy of wonderment. Behind Dantalian is an open-ended, unrestricted context, that is simply too much for a mere 12 episode production. I describe it as malnourished for this reason, and that is because the actual anime in question is plagued with unexplained concepts and gaping holes in character and plot development that rightfully throws viewers off course.\\n\\n\r\nThere are 2 ways to go into/look back at Dantalian. The first is to see the anime as a linear, chronological and summarizing plot line to represent the original \"Dantalian Story\" - a normal, continued story progression that you could expect from the majority of things you watch. Due to the massive imbalance of wonderful contextual weight that Dantalian brings, versus its minuscule 12 episode duration, seeing it in this way alone makes the anime not even worth watching. \\n\\n\r\nAlternately, you can choose to look at the anime, in the way that it actually (though unintentionally) turned out to be: a particularly episodic, and engaging production.\\n\r\nFor this review i have considered both viewpoints (slightly biasing towards the latter), and frustratingly concluded, that Dantalian as an anime is just upper-mediocre.\\n\\n\r\nThere are definitely some pull factors to be credited where credit is due, but for the most part: \"a potentially brilliant story that isn't given the proper amount of episode-time to develop\" will be the overriding message behind this review.\\n\\n\r\nThis leads me swiftly on to compliment Dantalian's presentation, and not only in terms of art and sound... The foreground animation is of a high standard, but it's the extreme realism of the softly and yet vividly represented backdrops, that contrast between each other; as though the characters' silhouettes dance effortlessly like an overlay. This artistic method emulates a macro photograph due to the varying contrasts i believe, and so Dantalian is certainly a feast for the eyes. In terms of audio: we get a really beautiful and warming, appropriately latin opening track for the \"old-style\" feel, that does well in the way it represents the mystery and literary ties of the show. Throughout, it seems to me that Dantalian maintains this classic-styled score, and uses audio relatively well to compliment the atmosphere of scenes. I'm not a big fan of the outro sequence, which for some reason seems to tell the story of someone being raped, through metaphorical and expressive presentation. The song sounds especially cold both with and without the visuals, and so in my opinion it is highly unfitting.\\n\\n\r\nThere is a good cohesion between art and sound in Dantalian, and so they don't act like separate unrelated entities. The show is really good at presenting the content in an organic way that comes across to me as especially immersive. This is definitely helped by the inclusion of \"small-talk\" accompanying the story development, which allows for a good contrast between light-hearted, and more dire situations. This contrast makes more prominent the show's drama, and so it does know exactly how to build up the appropriate atmosphere, and relaxed or heavy moody feelings in scenes. The presentation is perhaps the department with the least flaws, as i really do feel immersed in \"olden times\" when i watch...\\n\\n\r\nThe heart of any episodic mystery show, as i now identify Dantalian as, is the story.\\n\r\nStory being a reasonably formidable department also, i can safely say that there is a lot of substance, in the intricacies, and nature of the mysteries. It's quite clever how Dantalian stays away from deliberately overwhelming the viewer as some mystery shows have been known to do. Instead, Dantalian takes up some relatively straightforward concepts, and turns them into rather beautiful and wholesome \"episode-long\" mysteries, that slowly reveal their secrets, only to show how much of a morally driven and inspired story, the one of Dantalian is...\\n\\n\r\nThese are far from one-dimesional plot lines or tangents, as they also open up opportunities for us viewers to see the main duo develop, and deal with a range of situations. There is a definite sense of personality and passion in these \"arcs\", and this can even be felt from side characters. Perhaps this is thanks to the emphasis of morals, motives, and Dantalian's very able audiovisual ability.\\n\r\nAs for an overriding story, Dantalian seems as though it must be a summary of the original, as it comes to an abrupt conclusion, which ties all of the open-ends far too prematurely. Nevertheless, a conclusion is given to at least package the show into a neat bundle. It's a rather eccentrically presented one which goes back on the very first scene to establish some feeling of a \"journey\", as we are given a prequel or \"events leading up to the first episode\" related conclusion.\\n\\n\r\nI find it impossible to not be charmed by the character design, particularly the main duo. The many characters of Dantalian have a certain sense of realism, and a reliability to their plights in spite of the show's fantasy ties. When expressive presentation comes together with expressive and realistic characters, the viewers can attach themselves more to the stories, thus giving the show more power. The real development of Hugh, during one of the later episodes to give us some background to our male protagonist was quite good. It furthered the story's time-setting, and allowed me to appreciate him more. \\n\\n\r\nHowever, this was all still too little too late, as character development is always a department where it's easy to spot holes... For the most part, the character depth is limited just to their charm: the way they show unity as they go through this journey, and the way that their personalities shine through a little in the less eventful, atmosphere and character development committed scenes. It was certainly not enough to allow for the well-structured stories to pack pack much of a punch. There were many intense scenes for the duo, but asides from an internal gasp once or twice, i felt distanced from the characters. The anime was therefore unable to convey the extent of severity in situations, which you need to have, for viewers to be genuinely taken aback, and on the edge of their seats. The flaws are blatantly obvious, as i elaborated upon the show's restrictive time scale near the start. It means that all of the really good story design and effort into the presentation was quite wasted; as Dantalian wasn't given anywhere near enough funding for episodes that would be needed to provide some suitable coverage in relation to the wonderfully large-scale context. It also meant sacrificing character development, and therefore attachment, and therefore power and \"umph\" to the arcs. \\n\\n\r\nDantalian is a show that allows you \"oooh\" and \"ahhh\" at its context filled with wonderment, and really moody atmosphere. It brings you some well thought out story arcs which will have you questioning moral intention.\\n\r\nHowever, these 12 episodes only allow this anime with so much potential to stay knee-deep. There's no real power conveyed in this series of un-flowing arcs, that come to an abrupt end...\\n\\n\r\n~ \"There are things better left unknown\", is this always true? ~\\n",
            "date": "2015-05-10T13:45:00+00:00",
            "helpful_count": 19,
            "mal_id": 187527,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=187527"
        },
        {
            "content": "\"There are things better left unknown\"-Dalian \r\n  At first glance, Dantalian no Shoka seems like a mediocre anime,which is full of mysteries but I think it's more than that. \r\n  Story: 8/10 \r\n  Summary- The story follows Huey who inherits a mansion and a library with many valuable books from his grandfather but there happens something unexpected. He meets Dalian,the custodian of the Bibliotheca Mystica de Dantalian and he becomes Dalian's Keykeeper.  Bibliotheca Mystica of Dantalian is not an ordinary library. There are books that should not exist.      \r\n  Point of View- I think thatthe story was told pretty well. Even if the anime is episodic , the mystery is complex. The storyline is unique and interesting. I think  the pacing is pretty good. The ending is good too but you must understand it. \\n\\n\r\n  Art: 9/10 \\n\\n\r\n The art is incredible and the style is very realistic. I think the art style is fitting for the story and I love the colours used. The animation is fluid and the backgrounds are amazing. The gothic style fits the main characters.\\n\\n\r\n  Sound: 9/10 \\n\\n\\n\r\n  The opening is amazing.It's one of my favourite and I love that the opening is in latin.\\n\r\n   The ending is not my taste so I don't really liked it. The voice actors are great. I think that Dalian's voice actress and Huey's voice actor have done a great job. \\n\\n\r\n  Character: 8/10 \\n\\n\r\n  Although the anime doesn't have much character development,you can easily love the main characters.  \\n\r\n    I think that Dalian is smart,brave and bossy. She's a typical tsundere loli but she has some special features. I think she's pretty interesting. \\n\r\n   Huey is the most developed character in anime. His story is well explained. He's a kind character and he takes care of Dalian. \\n\r\n   Their relationship is often funny and they care about each other. All the characters react to situations in a very realistic way. \\n\\n\\n\r\n  Enjoyment:10/10 \\n\\n\r\n  I really like the anime because it has so many good moments . All episodes are interesting and the anime has some emotional moments. This anime really impressed me. \\n\\n\r\n  Overall: 9/10 \\n\\n\r\n  I think it's a great series. I am sure I 'll remember it in the future. \\n\r\n So if you like the mystery and the action,you should give it a try! \\n\\n\\n",
            "date": "2015-05-09T12:59:00+00:00",
            "helpful_count": 15,
            "mal_id": 187458,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4554339.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aoiy25",
                "username": "Aoiy25"
            },
            "url": "https://myanimelist.net/reviews.php?id=187458"
        },
        {
            "content": "I've always had this habit of picking up stuff to watch and read on a whim, and lately I have been doing that quite frequently. Without giving it a second thought, I put Dantalian no Shoka on download. Not that I was expecting anything much from it to begin with but to be honest, Dantalian no Shoka is a letdown. \r\n- STORY - \r\nAdapted from the light novel of the same, Dantalian no Shoka (also known as Bibliotheca Mystica de Dantalian or the Mystic Archives of Dantalian) is set in the backdrop of England after World War I. Hugh Anthony \"Huey\" Disward, a young manand ex-Pilot inherits a mansion including a vast library from his late grandfather. He encounters and soon befriends a mysterious, petite girl named Dalian who is the guardian of the Bibliotheca Mystica de Dantalian accommodating several thousands of 'phantom books'. Phantom books grant 'forbidden knowledge' which in the wrong hands can impose grave danger. Huey is proclaimed as the keykeeper to Dantalian's archives by Dalian, and together the pair must unravel incidents involving the misuse of the phantom books and restore peace and order.\\n\\n\r\nThe first thing that struck me is how similar its premise is to that of Gosick. Dalian, one of the two leads, is nothing more than just a copycat of Victorique. But that's not where the problem lies. The series is episodic with each episode dealing with a particular phantom book and the threat it poses to people including its owner, and the duo ultimately saving the day using their ability to access Dantalian's Archives. Most of the episodes are boring to say the least. I occasionally paused the video to check Facebook notifications. In other words, it failed to keep me hooked. To boot, some of the episodes felt absolutely stupid. For instance, the latter half of the eighth episode (Book of Relationship). \\n\r\nAnother flaw is the ambiguity. Many of the things are either not explained clearly or they're left totally unexplained which results in confusion and you don't know what is exactly going on. \\n\r\nIn the entire anime, the only episode I can call decent is the one involving the perfumer. Which episode was it again? Let me check. Okay, the seventh one. The rest of the episodes are not even worth mentioning. I remember having the urge to skip a few parts of them. \\n\\n\r\n- CHARACTERS - \\n\r\nThe cast failed to leave any impression on me. To a small degree, Dalian is interesting but then again, she is an imitation of Victorique from Gosick. Huey is decent. Among the supporting characters, Armand is easily the most annoying character following Camilla. There is nothing to say about the rest of the characters as they only appear in their respective episode, play their role and exit. \\n\\n\r\n- VISUALS - \\n\r\nThere are some instances when the art is gorgeous with rich textures and lighting effects. The backgrounds are pretty well detailed too. I remember there was this particular episode in which the art resembled illustrations from storybook. I liked that innovative art style. The character designs, on the other hand, are above average. \\n\\n\r\n- AUDIO - \\n\r\nThe best thing about Dantalian no Shoka is the OP 'Cras Numquam Scire'. Besides that, I don't remember any other soundtrack. Did anything even play in the background in the entire anime? Maybe it did but I failed to notice. The ED 'Yes, Prisoner' is so-so. Sawashiro Miyuki as Dalian's voice actress did a good job. \\n\\n\r\n- CONCLUSION - \\n\r\nI am at a loss of words here. I can't seem to find anything else other than 'mediocre' to describe Dantalian no Shoka because, well, that's what it is. Judging by the synopsis, you may expect something intriguing but to put it bluntly, that’s not the case. Well, you can still give it a shot if you can’t find anything better to watch. \\n",
            "date": "2012-07-09T23:11:00+00:00",
            "helpful_count": 14,
            "mal_id": 65891,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/503355.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/_Rika",
                "username": "_Rika"
            },
            "url": "https://myanimelist.net/reviews.php?id=65891"
        },
        {
            "content": "...yeah. What in the blue hell was that?\r\nI took a risk and did something I never ever do: watch a 12-24 episode anime while it's still airing. Why do I never do this? I want to know that I'm watching something of fine quality. I can only know that with a finished product. However, after the rare gem that was Stein's Gate, I thought \"hey maybe it's not so bad.\" I'm highly selective with my anime, you know, like Daniel Day Lewis is with movie roles, but hey enough about me.\r\nIn this case the risk did not pay off. This entire show was like atease. You have this uppity goth lolita, Dalian, and her lukewarm handler Huey. They travel about, hunting shadow books. And at the end of every episode he enters her and reads a magic book that asplodes the monster of the week. \\n\\n\r\nDalian was entertaining with her snarkiness, but she didn't really do anything but talk snarky and be kawaiidesu while eating bread (sounds familiar). I was hoping she had ninja powers or some shit. I guess it's hard to do much when you wear a tent dress everyday. They made it seem like there was gonna be some huge payoff to all this. But no. In the end I felt empty and unsatisfied, to say the least.\\n\\n\r\nWhat the hell was the point of it all? The second to last episode was basically some random shit about airplanes, and Hayami Show reading books on a plane with his manly Aizen voice. In the end, basically nothing in the murky plot is resolved, except \"Oh herp derp sorry your princess is in another castle lol.\" In fact, there's basically there's no tangible plot that I can see except \"hunt shadow books with some loli princess girls.\" \\n\\n\r\nI dunno if there's another season. If not then wow, so much wasted potential. There are so many ways they could have made this a good anime.",
            "date": "2011-10-01T22:01:00+00:00",
            "helpful_count": 13,
            "mal_id": 44583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/220276.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 9,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/AngerAndHate",
                "username": "AngerAndHate"
            },
            "url": "https://myanimelist.net/reviews.php?id=44583"
        },
        {
            "content": "'Art thou mankind?'  'Nay.  I am the world.  The world inside the gourd.'\r\nI came into The Mystic Archives of Dantalian/Dantalian no Shoka (Hereafter known simply as Dantalian) with no expectations.  The very first thing I noticed about the show was the art.  It was simply put gorgeous.  My eyes were fully engrossed with the shows beautiful use of color and artistry.  To be completely honest with you my readers, this anime is worth a try for the art alone.  If that were all I would say this was simply another run of the mill anime and that'sall, but not only that, but the music is simply fabulous.  Orchestral pieces throughout the entire series fit the dark and enigmatic presence of the series as a whole.  Making this a treat for both the eyes and the ears, where could this series go wrong?\\n\\n\r\nI ask you to take the following with a grain of salt.  \\n\r\nThe story starts with Hughey Anthony Disward arriving at a mansion, inherittance letter in hand to take over his recently deceased grandfather's estate.  With strict instructions to take care of the estate of the deceased bibliomaniac and his unfathomable collection of books, and to care for a being referred to in the letter only as Dalian.  Assuming that Dalian is a pet of some sort, Hughey is surprised to find not an animal of some sort but a young girl.\\n\\n\r\nAs the story progresses you find that his grandfather was in a sense gatekeeper of a mystic and legendary library housing books tht no human should ever know the contents of, granting to some great power, but to the unworthy, catastrophe, misery, despair and death.  Hughey proceeds to try to find as many of these books that his grandfather lent out as possible before they fall into the wrong hands or something horrible happens.\\n\\n\r\nAll in all, the premise is promising.  The powers and the outcomes of using these books are quite intriguing and unique.  But the series seems to rely on this alone as a driving point.  Other than the two main characters, none of the cast gets much if ANY developement.  And the only character that does seem to get any development is a very...unique character?  In the sense that his driving force is to woo women...at all times.  It introduces very unique themes and characters only to drop them or only include them in a few episodes.  This is mostly due to the episodic way the entire anime works, but with no development the characters seem to be lacking in the final episode, which does try to link some of the questions together, but only adds more mysteries to the mix.  Although I did love the two main characters, they both had...too little time to grow I suppose.  Hughey doesnt seemt o change at all while Dalians changes are very small and hard to read and the questions of how she links to the other girl(s) they keep showing keep getting more and more relevant.  I will have to say that if they don't add a second season, these questions will never be answered.\\n\\n\r\nThe only other qualm I have with this show is how hypocritical it is with the points that it makes.  It makes a point of saying how 'some things aren't meant to be seen' or know...or something along those lines.  Then saying about how the books are all meant for a certain person.  Also saying things such as there being no such thing as magic or curses then having the character that made that point say about the curse on -that- family, or having a true sorceror suddenly appear in one episode out of nowhere.\\n\\n\r\nAll in all if you are looking for a treat for both the eyes and the ears, I definitely DEFINITELY suggest you watch this anime.  I personally loved every minute of it and give it a 9 out of 10 as its good qualities are so outstanding that they far outweigh the bad.  I hope that some of you find this review helpful and that you enjoy the show when you get the chance to watch it.",
            "date": "2011-11-06T00:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 46923,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/261660.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Forganesolid",
                "username": "Forganesolid"
            },
            "url": "https://myanimelist.net/reviews.php?id=46923"
        },
        {
            "content": "Back in the days of post-WW1 era, books and written words were the main medium in passing down knowledge from one to another. However, some books contain knowledge that are too dangerous to the world.\r\nThese books were known as ‘phantom books’, and should be returned to their rightful place.\r\nStory – 6/10\r\nThe story revolves around Hugh Anthony Disward (Huey), a retired WW1 soldier who inherited his grandfather’s Bibliotheca Mystica no Dantalian, made contact with Dalian, who happens to be the library herself. They are to find those misplaced phantom books, and return them to the library.\r\nThis sets up to an episodic plot. Each episode features adifferent phantom book which is and affects its user and the world in various ways. The common issue of an episodic plot remains, some episodes may be absolutely genius, while some can be notably inferior, depending on the viewer’s taste. \\n\r\nThe story of Dantalian no Shoka can be so vast, as in there are too many things that a book can do. However, with only 12 episodes, there are many questions left unanswered, and there is no real resolution in the end.\\n\r\nOtherwise, the story would’ve been much more complete. \\n\\n\r\nArt – 8/10 \\n\r\nMade by the animation studio GAINAX (Neon Genesis Evangelion, Tengen Toppa Gurren Lagann), the artwork in Dantalian no Shoka is beautiful. The backgrounds were drawn in detailed, animation is fluid, and the character designs which are reminiscent to the post-WW1 setting are pleasant to see.\\n\\n\r\nSound – 7/10\\n\r\nMost of the soundtracks in Dantalian no Shoka are classical pieces which featured instruments such as violin, piano, etc. They aren’t particularly memorable, but fits into the scenes they are inserted into. \\n\r\nThe OP is a soprano latin song and the ED is a rather eerie and creepy song, both adds to the mysterious and ominous feel which reflects the nature of the phantom books, which is nice.\\n\r\nThe seiyuus did a great job in bringing the characters to life, particularly Miyuki Sawashiro, who really fleshed out Dalian’s character very well.\\n\\n\r\nCharacters – 6/10\\n\r\nDalian happens to be your stereotypical tsundere loli, while Huey is a kind, strong-willed and hardened man who has lots of resolve. Both are presented rather well and their relationship is enjoyable to watch. \\n\r\nNot much character development happens in Dantalian no Shoka, perhaps the most obvious would be Dalian becoming more and more concerned about Huey when he was exposed to danger. Huey himself, however, does not develop much.\\n\r\nThe problem with Dantalian no Shoka is that the side characters did not get enough screen time. While those minor ones which are shown in one episode but vanish thereafter were featured just enough to develop them well; those major ones such as Hal, Flamberge, Raziel and the unnamed Professor, we all know they are very important characters, but the lack of screen time did not disclose them enough, and viewers are left puzzled by their intentions and motives.\\n\r\nNot to mention the viewers would be guessing the mysterious identity of the girl inside the library world, who is frequently shown from time to time in the anime, but was never given an answer to her real identity.\\n\\n\r\nEnjoyment – 8/10\\n\r\nTo me, watching Dantalian no Shoka is almost as if I am reading a book. The anime itself is like a literature art. The subs were brilliantly written in Dantalian no Shoka, and this alone gave me tremendous enjoyment. Following the detective manner of the plot is great fun as well, with all the mystery and suspense going on.  Too bad the anime did not end well and left a sour note into my account. \\n\\n\r\nOther Thoughts\\n\r\nDantalian no Shoka is akin to literature, and as such, book lovers may love it, while those who are not fans of heavy words may not like it so much. \\n",
            "date": "2013-09-06T22:38:00+00:00",
            "helpful_count": 11,
            "mal_id": 112173,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2431015.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lord_Odous",
                "username": "Lord_Odous"
            },
            "url": "https://myanimelist.net/reviews.php?id=112173"
        },
        {
            "content": "Gothic and Lolita themed stories often present that vampiric charisma atmosphere that charms an audience so pleasantly. With a story of both Gothic and Lolita elements as Dantalian no Shoka, the remaining ingredient for a charming series lies in the characters. And yes, they did deliver. Although not on their own. As individuals, Hugh is only our calm, cool-keeping lead and Dalian is our standard tea sipping, pastry loving, tsundere loli. The key to the show's success was the interaction between these two as they developed through their journey.\r\nSpice and Wolf fans (and not for the furry aspect of the show), will enjoy Dantalian noShoka for the chemistry between the two lead characters. As a shift from the romance genre, Dantalian no Shoka steers clear of any suggested innuendos of perversion, or romantic love. That's not to say however, the character have no love for each other; in fact, not only do the characters share a strong bond, they also value others as human beings. Even for villains who are destroyed, Dalian and Hugh neither cheers nor turn a cold shoulder. Instead, an episode would takes a moment to reflect upon the moral dilemma caused by the Phantom Books and usually closes leaving somewhat of a melancholic atmosphere.\\n\\n\r\nWhile the chemistry of Hugh and Dalian does developed, expecting any slice-of-life action through the series may be a tad misleading as the characters themselves remain relatively unchanged from start to finish. The audience does however grow to love Dalian and Hugh in the process as they open up more to each other. Through the introduction of Hugh's friends and events of the Phantom Books, we learn that Dalian is less cold than her appearance and title, the Black Bibliopricess, may suggest. With the heart for those who have been misfortunated by the effects of the Phantom Books, and a soul of a child for sweets and pastry, Dalian becomes less monotonous as a character as the audience witness the multiple sides of her personality. For Hugh, rather then personality display, we learn about him through his past events as a soldier. Namely, his persistence to help and fight for his friends.\\n\\n\r\nBut the charm of merely two characters doesn't quite bring a show up to \"recommendable\". Particularly for an episodic series as many fall into that pitfall of each episode simple being a rehash of each other. Isn't that right, Hell Girl? For Dantalian no Shoka, the core formula for an episode remains unchanged: Something is amiss. A Phantom Book antagonist is suspected to be behind the corruption. Stop said antagonist. Go home. Drink tea. Enjoy some mild sauce tsundere. However, the Phantom Books themselves acts as a convenient plot device for altering this generic formula. Due to the various nature and power of each book, they cause one to question the value of life, the morals of deceit and white lies, and the limits of justice. Although such questions were subtle, an each episode leaves the viewer with some food for thought.\\n\\n\r\nAs enjoyable as Dantalian no Shoka may be, it's difficult to place any title equal to \"spectacular\" for the show. For the show itself did not lack any particular elements, it also was not outstanding in any particular elements. It's comedy and dialogue were kept at a minimal, for it was not a comedic based series. It's drama was not striking and sudden, for it was not a drama. It's mystery served just enough to create its enigmatic and dark atmosphere, for it was not Death Note. Conclusively, it was only a very enjoyable, charming, paced, and amusing series.",
            "date": "2011-10-31T10:52:00+00:00",
            "helpful_count": 11,
            "mal_id": 46571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/330213.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kartesian",
                "username": "kartesian"
            },
            "url": "https://myanimelist.net/reviews.php?id=46571"
        },
        {
            "content": "I started this series with high hopes and an understanding that they may not be met.  Unfortunately they weren't on all levels but were on a few.  An above average series for some, disappointing for most, but still something that I, in the end, enjoyed and liked, though I would only recommend to a niche audience.\r\nOverall:  7\r\nRead Below\r\nStory:  7\r\nThe idea in it's very basic form is nothing new.  A guy-girl duo out to save people from things they don't understand/are misusing to hurt others.  Despite this, I found it interesting still that \"phantom books\" were chosen as the tools.It's something different and in a sense, philosophical, to see that words are chosen as the weapon.  Anyways, the story starts off rather episodic with very little tying one episode to the next other than the main characters.  There isn't much plot development till the last few episodes which left me wondering why they either didn't attempt to turn this into a longer series or just start integrating the plot sooner.  There is a set of characters that don't make an appearance till the last two episodes and another set that are briefly glimpsed earlier than revisited in the last few episodes.  Also, an entire history/relationship between Huey and the pig-tailed girl is pretty much left unexplained.  In short, the story was generic yet refreshing at the same time, however, the plot development was weak and rushed.  Unless there is another season or a movie to be released, this is a big weakness in the series.  \\n\\n\r\nArt:  9\\n\r\nAs the rating suggests, I liked the art.  In all actuality, the art and animation deserves an 8 but I am rating a 9 for two different reasons.  1)  Baby The Stars Shine Bright's and Alice and the Pirates was involved in designing costumes for Dantalian and the cast.  I am a huge fan of Goth Loli (one of the secret reasons I picked up this series to begin with) and anyone who even has remote interest in Goth Loli should know this name or look it up.  2)  Episode 9.  Watch it.  The art is fantastic.  The rest of the series has great art design and above average animation though at times stiff, thus the deserved 8 rating, but these two things pushed it to a 9.  \\n\\n\r\nSound:  8\\n\r\nThe OP and ED are both good choices with the OP being the better of the two.  The ED was a little strange for most people though I enjoyed the live action perspective and thought he video was interesting.  The OP, however, is a beautiful number that really captures the mood with a somber score that is also, surprisingly, serene.  The voice acting was good other than the fact that I kept finding myself being irritated with Dalian's pronunciations.  For some reason, the way she strongly pronounced the ending syllables of her sentences rubbed me the wrong way and wore on my ears after a while.\\n\\n\r\nCharacter:  7\\n\r\nThe lack of plot development resulted in a general lack of character development.  We see Dalian and Huey go through various adventures with each other but I never once really felt that their relationship had matured.  There standing seemed the same in episode 2 as it did in episode 11.  Only in the last episode do we see some emotion/connection between the two, but this is lost within the whirlwind of plot being flung at the viewer.  Other characters are either abandoned or relegated to a mere mention in the closing episodes.  There is never a strong tie connecting main characters to side characters and thus everything feels loose and unorganized.  Also, as a personal note, I found Dalian to be a little too much tsundere, border-line childish.  Scratch that, she WAS childish.  Just not cute enough to overcome it.\\n\\n\r\nEnjoyment:  7\\n\r\nI mostly enjoyed this anime for the art and the idea of books being used as weapons.  This was somewhat lost in the chaos that was the last episode, but none-the-less, I still found this enjoyable enough.  I wouldn't recommend unless I was sure someone else had the affinity for Goth Loli/Victorian style that I have.",
            "date": "2011-10-08T04:47:00+00:00",
            "helpful_count": 11,
            "mal_id": 45083,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/14820.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VTOtaku",
                "username": "VTOtaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=45083"
        },
        {
            "content": "I had high hopes for this show, mostly because I love books, and it sounded like an interesting concept. However, that interesting concept was shunted into a villain-of-the-week formula that soon grew tiresome. While it is possible to do that formula well, these plots ranged from boring to inane. In addition to the stand-alone plots of the episodes was a feeble attempt at an overarching plot, which really failed spectacularly at tying anything together. The ending did little to actually end anything, or explain anything, or give even the least sense of closure.\r\nWhich brings me to the characters. This was by far the most negativeelement of the show: the complete lack of character development. Dalian was your generic bitchy little girl who actually cares more than she lets on. Huey was just plain bland. Some of the side characters, such as Huey's friend with the strange wardrobe choices, were cute, but ultimately lacked any sort of depth. The mysterious figure with the braid who we kept seeing is another example of a character wasted: he shows up at the very end, does something crazy for no apparent reason, and then the show ends. Who is he? Why is he such a dick? We don't know. Nothing was explained. Not to mention the mysterious pigtailed girl in the library. We spent so little time with her that it was really hard to give a crap about her when she showed up again in the last episode.\\n\\n\r\nThe show's artwork, while polished, was as bland as the characters. I sometimes found it difficult to tell characters apart. There was an exception, however, in the episode with the apprentice medicine woman or whatever she was. The art in that was truly beautiful, and I wish the entire show could've looked like that. In comparison to that high point is the climax to the musical episode, which they chose not to animate but instead to just show us a bunch of stills of the \"thrilling\" conclusion. It was really jarring considering the quality of animation in the rest of the show.\\n\\n\r\nDantalian no Shoka had a lot of potential, but just failed to deliver in almost every aspect. I wouldn't waste my time with this one.",
            "date": "2011-10-02T11:51:00+00:00",
            "helpful_count": 10,
            "mal_id": 44647,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5847.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/nerdypants",
                "username": "nerdypants"
            },
            "url": "https://myanimelist.net/reviews.php?id=44647"
        },
        {
            "content": "Dantalian no Shoka: Ten reasons why.\r\n1. Great anime.\r\n2. Great concept.\r\n3. Spectacular characters. (Although, the development of some characters lacked that oomph.)\r\n4. Great storyline.\r\n5. Plenty of action, plot twists and books.\r\n6. Loli AND tsundere. Lol. I know tons of people who would watch this anime for that.\r\n7. Blonde guy in trenchcoat + book ftw.\r\n8. Is it just me, or is the part where he sticks his hand into her chest amusing?\r\n9. EPIC AND DAZZLING EFFECTS, AUDIO AND ART.\r\n10. Hey, what's not to love about a dramatic ending?\r\nAnd that's my story. (Your cue to say, \"Cool story, bro.\")",
            "date": "2012-01-23T13:27:00+00:00",
            "helpful_count": 10,
            "mal_id": 52397,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1113635.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lina-chan87",
                "username": "Lina-chan87"
            },
            "url": "https://myanimelist.net/reviews.php?id=52397"
        },
        {
            "content": "Dantalian no Shoka is potentially a polarizing anime. It has few downfalls, though some may be quick to point out that they impact the show heavily. It has many redeeming factors, which some may not like in the least. Overall, it is a great show if you know what you're getting into: an interesting (but at some points confusing) plot in an episodic nature, beautiful aesthetics, and incredibly likable characters.\r\nStory - Good\r\nThe story of a girl who is the key to a library of magical books is not ground-breaking in the slightest. However, Dantalian no Shoka almost acknowledges this with its episodic nature. Instead offocusing on progressing an overarching plot, individual episodes are more concerned with providing entertainment. This is a double-edged sword, of course. You can argue that a nonprevelant story makes the show weaker. However, the individual episodes' stories are very interesting and captivating. In one episode, the duo enter a book. In another, a city is replaced with dolls. Each episode is unique and brings something new to the table.\\n\\n\\n\r\nCharacter - Great\\n\r\nThe characters fit stereotypical anime roles, yet the small but significant divergences from the mold make then exceptional.\\n\r\nDalian: Everything about Dalian is done amazingly. The way she becomes visibly disheveled when eating sweets. The way her voice actor conveys emotion with a haughty voice. Her pretentious nature, which is accentuated by moments where she loses her composure. Dalian is a stereotypical female lead done right, for good or bad.\\n\r\nHuey: A man in every definition of the word. He shoots first and asks questions later. He's always prepared to protect his lady, Dalian, when danger presents itself. He's never flustered or unsure about what to do next. Huey is a protagonist done right, though one could point out that lack of scenes of him failing is detrimental to his character development. I personally did not find this an issue.\\n\\n\r\nNo other characters play as big of a role as Dalian and Huey. There are reoccuring characters such as Camilla and Armand, but they do not play a big role in either the episodes they appear in nor the overarching story. These episodic characters are often developed well, sometimes through flashbacks or monologues, and sometimes with a good ol' gunfight.\\n\\n\\n\r\nAesthetics - Great / Very Good\\n\r\nThe art style and music fit the setting very well. Characters are drawn in detail, with a noticeably large amount of attention paid to Dalian. Buildings and clothing not only look authentic, but also give the impression of age and even quaintness. The slow, almost classical music set to the historical Europe setting transitions into upbeat melodies when the action picks up. The OP has received a lot of criticism for not being the usual JPop techno dance mashup. Personally, I think the eerie combination of Yucca's voice and the bits of action shown work well. The art and animation quality is not as good, though. Details are sometimes skimped on when the scenes have smaller objects, and animation is choppy when fast-moving, though oddly it is not a problem in action scenes, which are fluid and beautiful.\\n\\n\\n\r\nEnjoyment - Great\\n\r\nI will admit, I may be biased here. The way Dalian says \"yes,\" the way she runs while holding up her dress, the way her porcelain white face portrays emotion are some of my favorite parts of Dantalian no Shoka. The action scenes with dramatic action sequences (and dramatic book-reading) are highlights of every episode. The brief comedy moments at the beginning and end of each episode keep the show fresh, and provide satisfying conclusions to each episode.\\n\\n\\n\r\nOverall - Great\\n\r\nDantalian no Shoka is more than the sum of its parts. There's some strange \"X factor\" that made it the show I looked forward to the most each week. Could it be the characters with their detailed designs? The fluid, fast-paced action scenes? Or maybe it's simply Dalian?\\n\\n\r\nI think that overthinking why one likes a show is often a bad idea. Dantalian no Shoka goes with a tried and true formula. Dantalian no Shoka shows that you don't need to do things differently to be exceptional. You just need to do things right. If you don't mind a relatively weak story partially due to its episodic nature, Dantalian no Shoka is an amazing show with lovable characters, engaging plot, and blood-pumping action.",
            "date": "2011-10-02T00:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 44609,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/wavedashh",
                "username": "wavedashh"
            },
            "url": "https://myanimelist.net/reviews.php?id=44609"
        },
        {
            "content": "Dantalian no Shoka is a show about of books. Therefore, if you don't have an interest in literature (e.g. poetry, books, etc), this show probably won't resonate with you. The story progresses at a relaxing pace which can also throw people off. Has a soundtrack that I am very fond of. That art style isn't amazing but is still done well.\r\nIf you're wanting to see a \"Should you watch this show\" type of thing, then I would say: watch the pilot and see for yourself Mr.I'm-to-cool-to-watch-the-pilot-of-a-show-that-I-don't-know-because-I-read-MAL-reviews.",
            "date": "2015-01-03T21:08:00+00:00",
            "helpful_count": 9,
            "mal_id": 176033,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3837607.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AkumuX",
                "username": "AkumuX"
            },
            "url": "https://myanimelist.net/reviews.php?id=176033"
        },
        {
            "content": "This is my first review. Be gentle guise.\r\nP.s I'm only on the second episode.\r\nI'm really liking this anime for the art and story. beautiful character design, intresting plot so far. Young male inherets grandfather's Mansion and large collection of book's. Not as thurough a reader as his grandfather but seeming still intrested.  Apon ariving at the mansion, he walks inside to find that the library is completly of books. >.> where could the books be. End's up being led to an underground celler where his grandfather apprently kept his books close by at a table and a chair. And siting in this chair isthe next chapter in this man's life. Great anime, I reccomend it to anyone who loves a story that isn't exactly outlined in the begining. Thank's for reading.",
            "date": "2011-10-15T18:18:00+00:00",
            "helpful_count": 7,
            "mal_id": 45615,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/543211.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SilentAmarok",
                "username": "SilentAmarok"
            },
            "url": "https://myanimelist.net/reviews.php?id=45615"
        },
        {
            "content": "This is a must watch anime. Everything is so perfect here. I am a huge fan of Agatha Christie. I love to read novels like Agatha Christie's Poirot and Miss Marple. I would gladly recommend this anime to any fan of Agatha Christie or anyone who likes detective novels and movies. But I have to say that it is not so good as Gosick and Death Note. Those two are on the top of my list. \r\nFirst I'll start with the story. I give it a 9/10. It has a really interesting plot. After Huey's grandfather dies he was told to take the custody ofthe Bibliotheca Mystica de Dantalian in order to inherit his estate. He was also given a key. He later meets Dalian who is the Black Bibioprincess. It is also known that Huey's grandfather was a Keykeeper.  So after his grandfather's death he becomes the keykeeper. The archieve contains Phantom books which stores forbidden knowledge. Both Dalian and Huey set out on a journey to stop people from misusing the Phantom books in order to restore peace. Those two really have an interesting relationship. I can't say that there is any romance in it though. But I ship them anyway. I will not go any further because if I do they may contain spoilers. \\n\r\nAs for the art, I give it a 10/10. There's nothing much to say about this. I just have to say that the art was great. \\n\r\nFor the sound I'll give 10/10.  \\n\r\nI'll give a 10/10 for character.\\n\r\nI'll give a 9/10 for enjoyment. The story just keeps you wondering what is going to happen next. You will be entertained until the last minute. \\n\r\nOverall I give this anime a 9/10. I just loved it! I would recommend this anime to anyone.",
            "date": "2016-01-05T02:50:00+00:00",
            "helpful_count": 7,
            "mal_id": 207801,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4984048.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AhiruArima",
                "username": "AhiruArima"
            },
            "url": "https://myanimelist.net/reviews.php?id=207801"
        },
        {
            "content": "Dantalian no Shoka is a perfect representation of what history actually is. History can be beautiful, serious, mysterious and sometimes down-right brutal. This show does not hide its colors, but emphasizes them. To truly know history you must know every nook and cranny and even the stuff you wish you had never found out. Dantalian no Shoka, shows no mercy.\r\nThis is pretty much a random story line, but still has some underlying connections (like relationships). As a young boy Huey, finds and befriends a lonely librarian who watches over a library filled with more than 600,000 books, but that catch is that the library ismystical/magical. Then the show starts with Huey being an adult and befriending another young lady named Dantalian. She and Huey go through many adventures both happy ones and gruesome ones. Will they survive?\\n\\n\r\nStory 8/10\\n\r\nI don’t usually like historical stuff, but this really hit the spot for me. I really liked the full tone art-style and the historical feel that is so beautifully presented. However, on some of the adventures, I often found myself getting a little upset or queasy. I directly recall episode four; there was a scene where some of the characters were continuously killed over and over and to make it worse, it was execution style with a bullet in the head. That is something I definitely didn’t want to watch, but that is also a representation of how history isn’t always happy and fun. Overall, there was a slight romance tone, but there really wasn’t anything that connected everything together. And of course the series ended in a way that would allow a second season to be made if ever warranted.\\n\\n\r\nCharacters 7/10\\n\r\nThe characters are not very unique. Quite frankly, all of them seem a bit dense. You have your usual short-cute tsundere girl in an amazingly complex looking dress, an idiot girl who loves to dress up, an annoying friend who can’t find true love and Huey, a man who was once an army pilot and killed his best friend.\\n\\n\r\nThat doesn’t sound very different from other characters does it?\\n\\n\r\nArt 8/10\\n\r\nThe art is fantastic, there is a great blend of colors when action happens, but overall the colors are usually dark and the art style is usually full toned (no missing borders, no missing backgrounds etc…).\\n\\n\r\nSounds 10/10\\n\r\nThe OST for this series is just amazing. The opening scenes have a great song that I just had to have and the music that was played throughout the series was just amazing. The focus on instruments was tremendous and I really loved the episode where a famous instrumentalist played in a concert. (Seeing how I am a violinist, this can be very bias).\\n\\n\r\nEnjoyment 8/10\\n\r\nBesides the gruesome-brutal executions, I think the series was pretty enjoyable. The show has a perfect blend of mystery and action while introducing a couple unique aspects that hasn’t been put in an anime before. I commend the use of music and the dialogue is also quite good, but if the brutality is any worse than it was so far, I might not watch the second season if it ever gets made.\\n",
            "date": "2011-10-02T20:10:00+00:00",
            "helpful_count": 7,
            "mal_id": 44705,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/266635.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Romie-chan",
                "username": "Romie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=44705"
        },
        {
            "content": "\" - I ask of thee, art thou human?\r\n- No, I'm heaven. The heaven in the pot. \"\r\nIt is a misconception to think that this anime is only about books. Packed with mystery and supernatural elements where the living characters and story become alive from the books just by reading it. Much to my surprise, it's a similar concept to some movies that I've watched which are Inkheart and Goosebumps. The anime centers around a key keeper which holds a key to her heart, literally, the dark reading princess and archiving each phantom books that is revealed and uncovering the truth behind it.\r\nThe dark readingprincess, very knowledgeable on the phantom books, has a particular taste in sweet foods, especially friend breads covered with sugar serving with tea, and the like for stuffed bear, like a typical loli girl. She also make sarcastic remarks about other's 'idiocracy' so as to hider her true feelings which is cute in a way. The key keeper on the other hand, is always calm, has a certain knowledge in the history of the books, being an ex-pilot, he's good at both flying a war plane and firing a revolver. Like any lead male character, he is very protective of the princess, lurching towards her at the face of danger and carrying her around his arms, protecting her from danger with all his might. They both share a strong bond with power that requires the both of them and together, they make a great partner for supernatural cases.\\n\\n\r\nEach episode contains their new adventure, new story and a new phantom books that is waiting to be archived and the mystery to be conquered. There are also some interesting side characters with similar power but different objective. The interesting plot and side characters with their own personalities and their story will keep you going. The opening song is quite sorrowful that it can relate back to the story, and the lyrics has more meaning than you think.\\n\\n\r\nOverall, this is an anime with combination of mystery, a little bit of romance and supernatural elements with a mysterious atmosphere surrounding it, such as living mannequin that resembles the face of real human. It also shows the bond shared between Huey and Dalian with their many adventure. If you're interested in all that, hop on the train and join them with their supernatural adventure and witness their unlikely partnership as they archive each book.",
            "date": "2018-12-12T19:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 295685,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7568325.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ethan_07",
                "username": "Ethan_07"
            },
            "url": "https://myanimelist.net/reviews.php?id=295685"
        }
    ],
    [
        {
            "content": "These days we take the written word for granted, but for the majority of human history this has not been the case. Over the millennia, those with the ability to communicate using these strange markings have been viewed with awe and suspicion in almost equal measure, and many believed that anything written was magical in some way. It's only logical then, that people would begin to think that certain works were  holy writ handed down by a deity, held the secrets to immense power, or contained forbidden knowledge that would bring misfortune and death upon anyone who read them.\r\nEventually certain books were, for onereason or another, deemed too dangerous for the general public ...\\n\\n\r\nOriginally a light novel series by Mikumo Gakuto, Dantalian no Shoka (The Mystic Archives of Dantalian), takes place in England after World War 1. Hugh Anthony Disward (or Huey to his friends), returns to his ancestral home six months after receiving a letter informing him that his grandfather, Earl Wesley Disward, had been murdered by a burglar. According to the will, Huey can inherit the title, the estate, and everything contained within the mansion, but in return he must take over responsibility for the Bibliotheca Mystica de Dantalian, and look after Dalian as well.\\n\\n\r\nMagical books have long been a staple of the fantasy genre, but unlike the majority of tales dealing with them, the main focus of Dantalian no Shoka is to seal away those works that were never meant to exist, or have fallen into the wrong hands. It's a reasonably simple idea that can work very well with an episodic plot (Mushishi, Natsume Yuujinchou and Mokke use a similar method), but sadly that isn't the case here. The straightforward premise doesn't seem to have been enough for the writers, who have very clearly tried to cram as much as possible into twelve episodes. The story can often get sidetracked or bogged down in semantics, and there is a tendency towards over-explanation and melodrama. In addition to this, there are several characters who appear to have been included just to show how \"good\" Huey and Dalian are, and because of these issues it can often seem as though the narrative has been cobbled together with hobnails and glue.\\n\\n\r\nNow it may seem as though there's little of interest to be found in the story, but that's not actually the case. When the plot sticks to the point there's a surprisingly nice balance between the mystery and supernatural aspects, and there's a good deal of imagination in the way certain phantom books are used or affect people. The series also ventures into darker territory that suits the main theme of the show very well, but these occasions tend to be spoiled by some truly inane humour.\\n\\n\r\nThat said, while there are some major issues with the storyline, Gainax have done a decent job with the visuals. There are several different art styles on display that reflect the nature of certain episodes, especially in aspects like design and colouring. There are also some rather nice effects that work well with the detailed backgrounds to create some very atmospheric settings and scenery.\\n\\n\r\nThere are some issues that need to be raised though.\\n\\n\r\nFor some reason the animation tends to be rather simplistic, and while this seems to fit with one episode in particular, it does become a problem during action sequences. In addition to this, there's a certain \"stiffness\" to the character movements that may be an intentional dig at British reserve, but it's more likely due to carelessness or time/cost constraints. The character designs are unoriginal and uninspired, and while the clothing is somewhat reflective of the period, viewers will be forgiven for thinking that Dantalian no Shoka is nothing more than a copycat of Gosick.\\n\\n\r\nThe opening sequence is a decent montage that features the more prominent characters, some rather pleasant imagery, and a little action, all to the tune of \"Cras Numquam Scire\" (Tomorrow is Never to Know), by Yucca (featuring Ono Daisuke), a hauntingly choral track that is slightly reminiscent of \"Lilium\" - the opening song from Elfen Lied. The ending sequence is a short film about a little girl in a horned mask and white dress, walking barefoot through the forest while dragging a large trunk, and alongside the music box stylings of maRIONnetTe and their song \"Yes, prisoner\", the overall effect is decidedly ... unnerving.\\n\\n\r\nDantalian no Shoka is generally well served in the audio department, and there's a nice variety of classically themed tracks available, although it should be pointed out that the majority of the series is actually devoid of musical accompaniment. The effects are well choreographed, but rarely overbearing, and it seems that a conscious effort has been made to emphasize the quality of the script and the acting.\\n\\n\r\nFor the most part the dialogue is pretty decent, although there is a degree of immaturity about certain conversations, and the explanations can sometimes sound pompous and overbearing. Then again, the latter may be nothing more than a reflection of each role, especially as the actors deliver some good performance throughout the series.\\n\\n\r\nThere's something puzzling about the characters as there's very little in the way of actual development, but there's also not much definition given to them either. Aside from being unable to write off the supernatural as mere superstition, Huey doesn't actually grow in any way, and Dalian remains the stereotypical tsundere loli for much of the series. There's also very little attention given to the supporting roles, in particular to the people using or afflicted by the phantom books, and one has to wonder if this was due to the attempt to cram so many different elements into the plot.\\n\\n\r\nThere's also the issue of Dalian's connection to the pink haired girl living in the \"gourd\", but that raises a lot of other questions, especially about Raziel and Flamberge, so if you really want to know, just ask (or Google it).\\n\\n\r\nAside from the similarity in the character design and the fact both shows try to wade through various mysteries, Dantalian no Shoka has surprisingly little in common with Gosick, but that's both a good and bad thing. The general lack of detail about the characters means that there's very little justification for their actions, and aside from Huey, the lack of any real back story means that many of the roles lack the necessary depth needed to take the story seriously. There's also a surpisingly pro-censorship message built into the narrative, and this isn't helped by the fact that the male lead is a lord, while Hal Kamhout, the Libricide officer, looks like a priest.\\n\\n\r\nThe biggest problem with the series is that it tries to do far more than it should, and because of that viewer's may be left with a feeling of incompleteness come the end of the anime. While the story is interesting up to a point, the morass of people and events mean that there are no outstanding moments, and nothing to really capture the heart. There is entertainment to be had from Dantalian no Shoka, especially for those who like shows laden with symbolism, but this is nothing more than a veneer of \"intelligence\" that overlays the shallowness of the series as a whole.\\n\\n\r\nIt's a shame that more effort wasn't put into making this anime work as the concept is actually pretty good. The basic premise is sound, and if Gainax, the writers, and director Uemura Yutaka had taken the show more seriously, then Dantalian no Shoka could have been something truly interesting and entertaining.\\n\\n\r\nAnd for those of you wondering how an entire library can fit inside a person, here's an explanation from Sir Terry Pratchett's \"Discworld Companion\":\\n\\n\r\n\"Even big collections of ordinary books distort space and time, as can readily be proved by anyone who has been around a really old-fashioned second-hand bookshop, one of those that has more staircases than storeys and those rows of shelves that end in little doors that are surely too small for a full sized human to enter.\\n\\n\r\nThe relevant equation is Knowledge = Power = Energy = Matter = Mass; a good bookshop is just a genteel Black Hole that knows how to read. Mass distorts space into polyfractal L-space, in which Everywhere is also Everywhere Else.\\n\\n\r\nAll libraries are connected in L-space by the bookwormholes created by the strong space-time distortions found in any large collection of books.\"",
            "date": "2011-11-18T14:55:00+00:00",
            "helpful_count": 203,
            "mal_id": 47653,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=47653"
        },
        {
            "content": "Updated to Final Episode.\r\nI personally had this anime recommended to me by a friend, saying I might like it. (He had read the novels I believe.) So I came into this show knowing nothing at all since I had decided not to try to get any background on it to be unbiased about it.\r\nI was reasonably surprised by how good I actually found it to be. \r\nStory:\r\nPersonally I normally don't like dark atmosphere anime, yet this one does it in a way that I wanted to keep watching since it kept pulling me in to want to know more about the story and these PhantomBooks.\\n\\n\r\nOk, after episode two I find myself mildly lost. At first I thought that the Phantom Books were going to be a tool of destruction in the hands of people who could not control them. But if I understood correctly Huey used two in the episode as weapons. Guess they can be used as tools in the right hands.\\n\\n\r\nWith that said, the story feels a little rushed since there isn't continuity between the two episodes, so it looks like theres an overall theme, but different scenarios that don't continue on. Hopefully this doesn't persist and they take sometime to explain some more concepts or the anime is going to suffer with confusing concepts and butchered story telling. \\n\\n\r\nWell, they never slowed down one bit the entire anime, they just kept on chugging by without taking the time to explain concepts. They decided to go on an episodic route, which I had hoped they wouldn't, since a good linear story would probably have made more sense for this series. But I still liked each episode for what it put out, each being interesting and unique in its own way. The finale was especially well done, making up for some of the confusion along the way.\\n\\n\r\nArt: \\n\r\nVery neat realistic backgrounds. Pretty well designed cars and items from the time period the anime is set in. The backgrounds never cease to amaze me in this anime, they are extrordinarly well done, it looks very realistic for an anime that's for sure. The character designs go well with the backgrounds and settings. Huey has a nice design, and so does Dalian. Not much else to say about it.\\n\\n\r\nSound:\\n\r\nThe background music so far is very appropriate to the scenes it is used in. It doesn't seem out of place and just fits with the anime in general. With episode two I saw the opening, they did use it in episode one, but without the opening sequence. I think the opening is very appropriate for the anime, it goes with its theme of being a dark mysterious anime, which the opening reflects with its mellow somber tune. I stand by my perspective of episode one; the ending... IS strange, the music was creepy and the video is just really really creepy, I didn't particularly like it one bit. So for me the opening and background music is appealing, very appealing.\\n\\n\r\nCharacter: \\n\r\nHuey's character seems likeable to me. Seems like the kind of person that has an interesting past to say the least. Also seems to be well rounded, such as his knowledge with books and firearms, and piloting experience as well. Dalian, was enigmatic to say the least. She seems to be the kind of character you will learn more about slowly as the plot progress, but from what I've seen so far she is somewhat reserved and was brought up in a somewhat pampered state. I mainly say this because of the manner she bosses Huey around and her posture she witholds the air of someone that had been pampered or sheltered.\\n\\n\r\nEnjoyment:\\n\r\nI oddly enjoyed the first episode much to my surprise. At first I had thought that I might be a bit bored since this isn't typically a type of anime I would try. But I said what the heck and watched the first episode. This was a decision I do not regret since I am already hooked on the story, and want to know more about it. And I honestly enjoyed the comedy between Huey and Dalian in each episode since it is played out nicely and just works into character development well. \\n\\n\r\nOverall, I am mighty pleased that I picked up this show since it looks quite promising, I'm hoping that it doesn't disappoint me somewhere along the way. If the story picks up and pieces together some loose plot holes I still think this anime will be a fantastic watch. Sadly it didn't fill up every plot hole along the way, with certain things remaining murky. This seemed like the kind of anime that needed another 12 episodes to round itself off into what it could be. Hopefully a season 2 comes out to explain the loose ends, and instead of being episode by episode they chain it together into something that flows better.",
            "date": "2011-07-16T19:25:00+00:00",
            "helpful_count": 127,
            "mal_id": 39305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/473250.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KiritoKun",
                "username": "KiritoKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=39305"
        },
        {
            "content": "This is an anime about a loligoth tsundere and her generic male sidekick romping around a historically inaccurate yet picturesque England looking for magical books. It is a story perfectly exemplifying the phrase “golden mediocrity”. You can actually see how everything in this anime is just mediocre. Not bad, or at least, not all the time, but mediocre. You can almost feel how a talented touch would have raised this above the slush. Oh, well, better luck next time.\r\nStory:\r\nThe story format is episodic. This means that while there is a lot of diversity in tone and feeling, inevitably episodes will be hit or miss dependingon their chosen subject. Some episodes really caught my interest while in others I was constantly hitting the pause button so I could go do some important stuff like watch cat videos on my Internetz. \\n\r\nEverything in this show has to do with books. Magical books that have some weird superpowers. This is a nice concept and I would have been very pleased to see it delivered with more gothic subtlety and psychological horror stuff. Instead, most of the time the writers are pulling shit out of their asses that looks like it was googled on the spot and then put in the blender. I have to give them credit, though, for presenting this random hodgepodge of ideas and names as though it was actually true. \\n\r\nI guess the worst thing about this show is that it is so ridiculously over the top and crams so much corny stuff when a more subtle approach would have worked wonders for it. \\n\\n\r\nCharacters:\\n\r\nDalian: is a tsundere loligoth who loves reading and being snotty to others. She also has a magical lock on her chest, which makes for a pedo-creepy, sexual sequence that I guess the creators thought looked really cool but is actually pretty dumb. Anyway, Dalian is the keeper (one of the keepers? I don't know, I'm confused) of a mystical library of magic books. I must say, the most that can be said for her is that she is not as annoying as she first appears to be. But she is pretty annoying. Weak, too. She can neither fight nor cast any spells. To reduce the annoyance factor I suggest putting the magical lock on her mouth. Nothing interesting comes out of it anyway. \\n\r\nHuey McDuck: (demons in hell, who had the brilliant idea of naming this guy? I’ll just call him McDuck) is the generic male lead who does all the legwork. Aside from getting beaten up, shot at and drinking tea—which are all activities I enjoy watching characters do—there is nothing interesting about him. He is such a basic, unshaped mould of a character that he feels as bland as raw flour. \\n\r\nRandom episodic characters: to make up for the lameness of the main pair there are a bunch of interesting side characters making random appearances. I just realised that the episodes I liked the most focused on these other characters, like the guy burning the books and his sidekick in a straightjacket. Or the perky cosplaying heiress. Once again we have a show where the side characters are much more interesting than the leads. I suspect this is some kind of trolling trend in Japan. Along with frozen highschoolgirl panties or whatever. \\n\\n\r\nAnimation:\\n\r\nThis has the sort of glossy animation that's become popular recently. To save money, the studio used filtered photographs for backgrounds. It has a slightly jarring feel to it but nothing as eye-gouging as badly done CG. \\n\r\nThe thing that bugged me most about the animation was the style used at “magic” moments. Often, the visuals are totally inappropriate to the mood and setting. Enough with the stupid energy bolts and Technicolor seizure graphics! This ain't Power Rangers, dammit! Instead of going for dark, gothic and discreet they ruin the atmosphere and buildup with that wacky stuff. Hey, should I be expecting Ichigo to pop up with his new Bankai? \\n\\n\r\nSound:\\n\r\nThe soundtrack is quite competently put together. It has a sort of melancholy choir vibe going for it and a kind of music box tune. The people working on this knew where to put it to good use, that's for sure. \\n\r\nOP: a quite pretty and atmospheric ballad that ties in nicely with the graphics. In fact, it makes you believe you're about to watch a much better show. Ha! Joke’s on you!\\n\r\nED: some weird live-action sequence. I don't really like live-action in my anime so I never bothered to watch it to the end. I doubt it was something stellar though. \\n\\n\r\nOverview:\\n\r\nIt was a semi-chore to sit through this easily forgettable show. The best time to view it is when you're home and you are so bored out of your skull you have nothing better to do. Maybe some lazy Sunday afternoon. Not even loligoth fetishists would vote for this. \\n",
            "date": "2011-12-24T05:11:00+00:00",
            "helpful_count": 25,
            "mal_id": 50001,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56329.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Jigoku-n3ko",
                "username": "Jigoku-n3ko"
            },
            "url": "https://myanimelist.net/reviews.php?id=50001"
        },
        {
            "content": "Danatalian no Shoka or the Mystic Archives of Danatalian looked very promising, but to my disappointment so far,  hasn't shown us much of anything. \r\nStory: Well, the viewer isn't really introduced to or given much information to the main characters. You pretty much are thrown in from the first episode in a world filled with books that can cast forbidden spells that humans want to get their hands on. Hugh and Dalian, the two main characters, some how from episode 1 the episode where they just met(yes from episode 1) just plain decide to go after the phantom books. WTF? I mean doesn't Hughfind this at all strange? I've complained about some very slow story lines, but man this one takes the cake for just moving along too fast. I honestly don't know if this happens in the novel, etc, but it just seems mighty unrealistic for someone just to jump in and so \"okay Dalian let's go get these books now, when I just met you like 10 minutes ago.\" Yes the story has supernatural characteristics to it, but geez. Not only that. It turns out so far in 8 episodes we aren't really given much info about anything else other than there are other book holders like Dalian out there. Problem is that the format follows the \"monster of the week\" type and well, I'm pretty sure most people find that annoying and boring, I know I sure do. I give the story a 5. Weak.\\n\\n\r\nArt. Well I can't complain about it. It's just plain beautiful, though at times it can be a bit dark and you just can't see anything. The detail to the architecture (that is the designs) of the buildings, vehicles, etc is very nicely done. \\n\\n\r\nSound. Opening and Ending songs are very reminiscent of 18th/19th century folk songs. Usually one person singing in a chamber style type of song with accompanying instrumentation. Depending on the mood, the songs really do come out strong, though I must say it is not my cup of tea. Still I give it a decent 7.\\n\\n\r\nCharacters. Well, the Characters aren't particularly uninteresting, they just seem extremely unrealistic and well they seem to rip off other characters from other animes like for example Gosick. We have Victorique from Gosick who's short, blonde, wears nice dresses, likes to read and is tsundere and on the other side we have Dalia, black haired little girl, who likes to read books, wears nice dresses and is as well...a tsundere. I mean seriously? Well at least the male main lead isn't a chump like Kujo from Gosick. At least Hugh can stand up to himself instead of making just ridiculous claims \"I'll protect you, blah, blah\" and then ends up getting beat up like Kujo does. We are introduced to other characters like those guys from the burn books society (or something of that nature) and the most recent character Fiona (who acts a lot like Elizabeth from Gosick???). So okay the characters aren't that original, but at least, AT LEAST Hugh is cooler and tougher than that other fool from Gosick. I give it a high 6.\\n\\n\r\nOverall? Hmm...still kind of left wondering about this anime. It can be great, but it just seems to sit in mediocrity. It seems to copy a lot from another anime Gosick, which I didn't find particularly great (especially that terrible ending.) So I give this a fair 6. Maybe something else will come up in the next episodes, that might change my mind, but so far. It's pretty average.",
            "date": "2011-09-05T23:55:00+00:00",
            "helpful_count": 19,
            "mal_id": 42797,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=42797"
        },
        {
            "content": "~ May the doors of wisdom open ~\r\nIn essence, Dantalian no Shoka, or \"Dantalian\" as i will refer to it from here on is an anime that made the best of an unfortunate situation. If anime production meant compacting carbon at high temperatures, then Dantalian is a diamond that refused itself the right to form...\r\nA simple, yet vivid and interesting context of \"Magical Tomes\" makes up Dantalian, and allows it to attract an audience range primarily from both the mystery and fantasy realms. It's not revolutionary, though it's certainly a context that captures my attention much better than the majority of shows with similar paths.Literature is an important theme for Dantalian (not only due to the tomes), and generally the mystery genre as a whole. It serves to add some weight to this otherwise malnourished anime; allowing its slightly eccentric and expressive presentation to shine through, and so non-dialogue words also contribute towards Dantalian's distict \"richness\". \\n\\n\r\nThe implied scale of Dantalian's expansive fantasy context is just phenomenal. It's one that not only makes me curious enough to desire more, but the show as a whole is bathed in an ecstasy of wonderment. Behind Dantalian is an open-ended, unrestricted context, that is simply too much for a mere 12 episode production. I describe it as malnourished for this reason, and that is because the actual anime in question is plagued with unexplained concepts and gaping holes in character and plot development that rightfully throws viewers off course.\\n\\n\r\nThere are 2 ways to go into/look back at Dantalian. The first is to see the anime as a linear, chronological and summarizing plot line to represent the original \"Dantalian Story\" - a normal, continued story progression that you could expect from the majority of things you watch. Due to the massive imbalance of wonderful contextual weight that Dantalian brings, versus its minuscule 12 episode duration, seeing it in this way alone makes the anime not even worth watching. \\n\\n\r\nAlternately, you can choose to look at the anime, in the way that it actually (though unintentionally) turned out to be: a particularly episodic, and engaging production.\\n\r\nFor this review i have considered both viewpoints (slightly biasing towards the latter), and frustratingly concluded, that Dantalian as an anime is just upper-mediocre.\\n\\n\r\nThere are definitely some pull factors to be credited where credit is due, but for the most part: \"a potentially brilliant story that isn't given the proper amount of episode-time to develop\" will be the overriding message behind this review.\\n\\n\r\nThis leads me swiftly on to compliment Dantalian's presentation, and not only in terms of art and sound... The foreground animation is of a high standard, but it's the extreme realism of the softly and yet vividly represented backdrops, that contrast between each other; as though the characters' silhouettes dance effortlessly like an overlay. This artistic method emulates a macro photograph due to the varying contrasts i believe, and so Dantalian is certainly a feast for the eyes. In terms of audio: we get a really beautiful and warming, appropriately latin opening track for the \"old-style\" feel, that does well in the way it represents the mystery and literary ties of the show. Throughout, it seems to me that Dantalian maintains this classic-styled score, and uses audio relatively well to compliment the atmosphere of scenes. I'm not a big fan of the outro sequence, which for some reason seems to tell the story of someone being raped, through metaphorical and expressive presentation. The song sounds especially cold both with and without the visuals, and so in my opinion it is highly unfitting.\\n\\n\r\nThere is a good cohesion between art and sound in Dantalian, and so they don't act like separate unrelated entities. The show is really good at presenting the content in an organic way that comes across to me as especially immersive. This is definitely helped by the inclusion of \"small-talk\" accompanying the story development, which allows for a good contrast between light-hearted, and more dire situations. This contrast makes more prominent the show's drama, and so it does know exactly how to build up the appropriate atmosphere, and relaxed or heavy moody feelings in scenes. The presentation is perhaps the department with the least flaws, as i really do feel immersed in \"olden times\" when i watch...\\n\\n\r\nThe heart of any episodic mystery show, as i now identify Dantalian as, is the story.\\n\r\nStory being a reasonably formidable department also, i can safely say that there is a lot of substance, in the intricacies, and nature of the mysteries. It's quite clever how Dantalian stays away from deliberately overwhelming the viewer as some mystery shows have been known to do. Instead, Dantalian takes up some relatively straightforward concepts, and turns them into rather beautiful and wholesome \"episode-long\" mysteries, that slowly reveal their secrets, only to show how much of a morally driven and inspired story, the one of Dantalian is...\\n\\n\r\nThese are far from one-dimesional plot lines or tangents, as they also open up opportunities for us viewers to see the main duo develop, and deal with a range of situations. There is a definite sense of personality and passion in these \"arcs\", and this can even be felt from side characters. Perhaps this is thanks to the emphasis of morals, motives, and Dantalian's very able audiovisual ability.\\n\r\nAs for an overriding story, Dantalian seems as though it must be a summary of the original, as it comes to an abrupt conclusion, which ties all of the open-ends far too prematurely. Nevertheless, a conclusion is given to at least package the show into a neat bundle. It's a rather eccentrically presented one which goes back on the very first scene to establish some feeling of a \"journey\", as we are given a prequel or \"events leading up to the first episode\" related conclusion.\\n\\n\r\nI find it impossible to not be charmed by the character design, particularly the main duo. The many characters of Dantalian have a certain sense of realism, and a reliability to their plights in spite of the show's fantasy ties. When expressive presentation comes together with expressive and realistic characters, the viewers can attach themselves more to the stories, thus giving the show more power. The real development of Hugh, during one of the later episodes to give us some background to our male protagonist was quite good. It furthered the story's time-setting, and allowed me to appreciate him more. \\n\\n\r\nHowever, this was all still too little too late, as character development is always a department where it's easy to spot holes... For the most part, the character depth is limited just to their charm: the way they show unity as they go through this journey, and the way that their personalities shine through a little in the less eventful, atmosphere and character development committed scenes. It was certainly not enough to allow for the well-structured stories to pack pack much of a punch. There were many intense scenes for the duo, but asides from an internal gasp once or twice, i felt distanced from the characters. The anime was therefore unable to convey the extent of severity in situations, which you need to have, for viewers to be genuinely taken aback, and on the edge of their seats. The flaws are blatantly obvious, as i elaborated upon the show's restrictive time scale near the start. It means that all of the really good story design and effort into the presentation was quite wasted; as Dantalian wasn't given anywhere near enough funding for episodes that would be needed to provide some suitable coverage in relation to the wonderfully large-scale context. It also meant sacrificing character development, and therefore attachment, and therefore power and \"umph\" to the arcs. \\n\\n\r\nDantalian is a show that allows you \"oooh\" and \"ahhh\" at its context filled with wonderment, and really moody atmosphere. It brings you some well thought out story arcs which will have you questioning moral intention.\\n\r\nHowever, these 12 episodes only allow this anime with so much potential to stay knee-deep. There's no real power conveyed in this series of un-flowing arcs, that come to an abrupt end...\\n\\n\r\n~ \"There are things better left unknown\", is this always true? ~\\n",
            "date": "2015-05-10T13:45:00+00:00",
            "helpful_count": 19,
            "mal_id": 187527,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=187527"
        },
        {
            "content": "\"There are things better left unknown\"-Dalian \r\n  At first glance, Dantalian no Shoka seems like a mediocre anime,which is full of mysteries but I think it's more than that. \r\n  Story: 8/10 \r\n  Summary- The story follows Huey who inherits a mansion and a library with many valuable books from his grandfather but there happens something unexpected. He meets Dalian,the custodian of the Bibliotheca Mystica de Dantalian and he becomes Dalian's Keykeeper.  Bibliotheca Mystica of Dantalian is not an ordinary library. There are books that should not exist.      \r\n  Point of View- I think thatthe story was told pretty well. Even if the anime is episodic , the mystery is complex. The storyline is unique and interesting. I think  the pacing is pretty good. The ending is good too but you must understand it. \\n\\n\r\n  Art: 9/10 \\n\\n\r\n The art is incredible and the style is very realistic. I think the art style is fitting for the story and I love the colours used. The animation is fluid and the backgrounds are amazing. The gothic style fits the main characters.\\n\\n\r\n  Sound: 9/10 \\n\\n\\n\r\n  The opening is amazing.It's one of my favourite and I love that the opening is in latin.\\n\r\n   The ending is not my taste so I don't really liked it. The voice actors are great. I think that Dalian's voice actress and Huey's voice actor have done a great job. \\n\\n\r\n  Character: 8/10 \\n\\n\r\n  Although the anime doesn't have much character development,you can easily love the main characters.  \\n\r\n    I think that Dalian is smart,brave and bossy. She's a typical tsundere loli but she has some special features. I think she's pretty interesting. \\n\r\n   Huey is the most developed character in anime. His story is well explained. He's a kind character and he takes care of Dalian. \\n\r\n   Their relationship is often funny and they care about each other. All the characters react to situations in a very realistic way. \\n\\n\\n\r\n  Enjoyment:10/10 \\n\\n\r\n  I really like the anime because it has so many good moments . All episodes are interesting and the anime has some emotional moments. This anime really impressed me. \\n\\n\r\n  Overall: 9/10 \\n\\n\r\n  I think it's a great series. I am sure I 'll remember it in the future. \\n\r\n So if you like the mystery and the action,you should give it a try! \\n\\n\\n",
            "date": "2015-05-09T12:59:00+00:00",
            "helpful_count": 15,
            "mal_id": 187458,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4554339.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aoiy25",
                "username": "Aoiy25"
            },
            "url": "https://myanimelist.net/reviews.php?id=187458"
        },
        {
            "content": "I've always had this habit of picking up stuff to watch and read on a whim, and lately I have been doing that quite frequently. Without giving it a second thought, I put Dantalian no Shoka on download. Not that I was expecting anything much from it to begin with but to be honest, Dantalian no Shoka is a letdown. \r\n- STORY - \r\nAdapted from the light novel of the same, Dantalian no Shoka (also known as Bibliotheca Mystica de Dantalian or the Mystic Archives of Dantalian) is set in the backdrop of England after World War I. Hugh Anthony \"Huey\" Disward, a young manand ex-Pilot inherits a mansion including a vast library from his late grandfather. He encounters and soon befriends a mysterious, petite girl named Dalian who is the guardian of the Bibliotheca Mystica de Dantalian accommodating several thousands of 'phantom books'. Phantom books grant 'forbidden knowledge' which in the wrong hands can impose grave danger. Huey is proclaimed as the keykeeper to Dantalian's archives by Dalian, and together the pair must unravel incidents involving the misuse of the phantom books and restore peace and order.\\n\\n\r\nThe first thing that struck me is how similar its premise is to that of Gosick. Dalian, one of the two leads, is nothing more than just a copycat of Victorique. But that's not where the problem lies. The series is episodic with each episode dealing with a particular phantom book and the threat it poses to people including its owner, and the duo ultimately saving the day using their ability to access Dantalian's Archives. Most of the episodes are boring to say the least. I occasionally paused the video to check Facebook notifications. In other words, it failed to keep me hooked. To boot, some of the episodes felt absolutely stupid. For instance, the latter half of the eighth episode (Book of Relationship). \\n\r\nAnother flaw is the ambiguity. Many of the things are either not explained clearly or they're left totally unexplained which results in confusion and you don't know what is exactly going on. \\n\r\nIn the entire anime, the only episode I can call decent is the one involving the perfumer. Which episode was it again? Let me check. Okay, the seventh one. The rest of the episodes are not even worth mentioning. I remember having the urge to skip a few parts of them. \\n\\n\r\n- CHARACTERS - \\n\r\nThe cast failed to leave any impression on me. To a small degree, Dalian is interesting but then again, she is an imitation of Victorique from Gosick. Huey is decent. Among the supporting characters, Armand is easily the most annoying character following Camilla. There is nothing to say about the rest of the characters as they only appear in their respective episode, play their role and exit. \\n\\n\r\n- VISUALS - \\n\r\nThere are some instances when the art is gorgeous with rich textures and lighting effects. The backgrounds are pretty well detailed too. I remember there was this particular episode in which the art resembled illustrations from storybook. I liked that innovative art style. The character designs, on the other hand, are above average. \\n\\n\r\n- AUDIO - \\n\r\nThe best thing about Dantalian no Shoka is the OP 'Cras Numquam Scire'. Besides that, I don't remember any other soundtrack. Did anything even play in the background in the entire anime? Maybe it did but I failed to notice. The ED 'Yes, Prisoner' is so-so. Sawashiro Miyuki as Dalian's voice actress did a good job. \\n\\n\r\n- CONCLUSION - \\n\r\nI am at a loss of words here. I can't seem to find anything else other than 'mediocre' to describe Dantalian no Shoka because, well, that's what it is. Judging by the synopsis, you may expect something intriguing but to put it bluntly, that’s not the case. Well, you can still give it a shot if you can’t find anything better to watch. \\n",
            "date": "2012-07-09T23:11:00+00:00",
            "helpful_count": 14,
            "mal_id": 65891,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/503355.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/_Rika",
                "username": "_Rika"
            },
            "url": "https://myanimelist.net/reviews.php?id=65891"
        },
        {
            "content": "...yeah. What in the blue hell was that?\r\nI took a risk and did something I never ever do: watch a 12-24 episode anime while it's still airing. Why do I never do this? I want to know that I'm watching something of fine quality. I can only know that with a finished product. However, after the rare gem that was Stein's Gate, I thought \"hey maybe it's not so bad.\" I'm highly selective with my anime, you know, like Daniel Day Lewis is with movie roles, but hey enough about me.\r\nIn this case the risk did not pay off. This entire show was like atease. You have this uppity goth lolita, Dalian, and her lukewarm handler Huey. They travel about, hunting shadow books. And at the end of every episode he enters her and reads a magic book that asplodes the monster of the week. \\n\\n\r\nDalian was entertaining with her snarkiness, but she didn't really do anything but talk snarky and be kawaiidesu while eating bread (sounds familiar). I was hoping she had ninja powers or some shit. I guess it's hard to do much when you wear a tent dress everyday. They made it seem like there was gonna be some huge payoff to all this. But no. In the end I felt empty and unsatisfied, to say the least.\\n\\n\r\nWhat the hell was the point of it all? The second to last episode was basically some random shit about airplanes, and Hayami Show reading books on a plane with his manly Aizen voice. In the end, basically nothing in the murky plot is resolved, except \"Oh herp derp sorry your princess is in another castle lol.\" In fact, there's basically there's no tangible plot that I can see except \"hunt shadow books with some loli princess girls.\" \\n\\n\r\nI dunno if there's another season. If not then wow, so much wasted potential. There are so many ways they could have made this a good anime.",
            "date": "2011-10-01T22:01:00+00:00",
            "helpful_count": 13,
            "mal_id": 44583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/220276.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 9,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/AngerAndHate",
                "username": "AngerAndHate"
            },
            "url": "https://myanimelist.net/reviews.php?id=44583"
        },
        {
            "content": "'Art thou mankind?'  'Nay.  I am the world.  The world inside the gourd.'\r\nI came into The Mystic Archives of Dantalian/Dantalian no Shoka (Hereafter known simply as Dantalian) with no expectations.  The very first thing I noticed about the show was the art.  It was simply put gorgeous.  My eyes were fully engrossed with the shows beautiful use of color and artistry.  To be completely honest with you my readers, this anime is worth a try for the art alone.  If that were all I would say this was simply another run of the mill anime and that'sall, but not only that, but the music is simply fabulous.  Orchestral pieces throughout the entire series fit the dark and enigmatic presence of the series as a whole.  Making this a treat for both the eyes and the ears, where could this series go wrong?\\n\\n\r\nI ask you to take the following with a grain of salt.  \\n\r\nThe story starts with Hughey Anthony Disward arriving at a mansion, inherittance letter in hand to take over his recently deceased grandfather's estate.  With strict instructions to take care of the estate of the deceased bibliomaniac and his unfathomable collection of books, and to care for a being referred to in the letter only as Dalian.  Assuming that Dalian is a pet of some sort, Hughey is surprised to find not an animal of some sort but a young girl.\\n\\n\r\nAs the story progresses you find that his grandfather was in a sense gatekeeper of a mystic and legendary library housing books tht no human should ever know the contents of, granting to some great power, but to the unworthy, catastrophe, misery, despair and death.  Hughey proceeds to try to find as many of these books that his grandfather lent out as possible before they fall into the wrong hands or something horrible happens.\\n\\n\r\nAll in all, the premise is promising.  The powers and the outcomes of using these books are quite intriguing and unique.  But the series seems to rely on this alone as a driving point.  Other than the two main characters, none of the cast gets much if ANY developement.  And the only character that does seem to get any development is a very...unique character?  In the sense that his driving force is to woo women...at all times.  It introduces very unique themes and characters only to drop them or only include them in a few episodes.  This is mostly due to the episodic way the entire anime works, but with no development the characters seem to be lacking in the final episode, which does try to link some of the questions together, but only adds more mysteries to the mix.  Although I did love the two main characters, they both had...too little time to grow I suppose.  Hughey doesnt seemt o change at all while Dalians changes are very small and hard to read and the questions of how she links to the other girl(s) they keep showing keep getting more and more relevant.  I will have to say that if they don't add a second season, these questions will never be answered.\\n\\n\r\nThe only other qualm I have with this show is how hypocritical it is with the points that it makes.  It makes a point of saying how 'some things aren't meant to be seen' or know...or something along those lines.  Then saying about how the books are all meant for a certain person.  Also saying things such as there being no such thing as magic or curses then having the character that made that point say about the curse on -that- family, or having a true sorceror suddenly appear in one episode out of nowhere.\\n\\n\r\nAll in all if you are looking for a treat for both the eyes and the ears, I definitely DEFINITELY suggest you watch this anime.  I personally loved every minute of it and give it a 9 out of 10 as its good qualities are so outstanding that they far outweigh the bad.  I hope that some of you find this review helpful and that you enjoy the show when you get the chance to watch it.",
            "date": "2011-11-06T00:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 46923,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/261660.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Forganesolid",
                "username": "Forganesolid"
            },
            "url": "https://myanimelist.net/reviews.php?id=46923"
        },
        {
            "content": "Back in the days of post-WW1 era, books and written words were the main medium in passing down knowledge from one to another. However, some books contain knowledge that are too dangerous to the world.\r\nThese books were known as ‘phantom books’, and should be returned to their rightful place.\r\nStory – 6/10\r\nThe story revolves around Hugh Anthony Disward (Huey), a retired WW1 soldier who inherited his grandfather’s Bibliotheca Mystica no Dantalian, made contact with Dalian, who happens to be the library herself. They are to find those misplaced phantom books, and return them to the library.\r\nThis sets up to an episodic plot. Each episode features adifferent phantom book which is and affects its user and the world in various ways. The common issue of an episodic plot remains, some episodes may be absolutely genius, while some can be notably inferior, depending on the viewer’s taste. \\n\r\nThe story of Dantalian no Shoka can be so vast, as in there are too many things that a book can do. However, with only 12 episodes, there are many questions left unanswered, and there is no real resolution in the end.\\n\r\nOtherwise, the story would’ve been much more complete. \\n\\n\r\nArt – 8/10 \\n\r\nMade by the animation studio GAINAX (Neon Genesis Evangelion, Tengen Toppa Gurren Lagann), the artwork in Dantalian no Shoka is beautiful. The backgrounds were drawn in detailed, animation is fluid, and the character designs which are reminiscent to the post-WW1 setting are pleasant to see.\\n\\n\r\nSound – 7/10\\n\r\nMost of the soundtracks in Dantalian no Shoka are classical pieces which featured instruments such as violin, piano, etc. They aren’t particularly memorable, but fits into the scenes they are inserted into. \\n\r\nThe OP is a soprano latin song and the ED is a rather eerie and creepy song, both adds to the mysterious and ominous feel which reflects the nature of the phantom books, which is nice.\\n\r\nThe seiyuus did a great job in bringing the characters to life, particularly Miyuki Sawashiro, who really fleshed out Dalian’s character very well.\\n\\n\r\nCharacters – 6/10\\n\r\nDalian happens to be your stereotypical tsundere loli, while Huey is a kind, strong-willed and hardened man who has lots of resolve. Both are presented rather well and their relationship is enjoyable to watch. \\n\r\nNot much character development happens in Dantalian no Shoka, perhaps the most obvious would be Dalian becoming more and more concerned about Huey when he was exposed to danger. Huey himself, however, does not develop much.\\n\r\nThe problem with Dantalian no Shoka is that the side characters did not get enough screen time. While those minor ones which are shown in one episode but vanish thereafter were featured just enough to develop them well; those major ones such as Hal, Flamberge, Raziel and the unnamed Professor, we all know they are very important characters, but the lack of screen time did not disclose them enough, and viewers are left puzzled by their intentions and motives.\\n\r\nNot to mention the viewers would be guessing the mysterious identity of the girl inside the library world, who is frequently shown from time to time in the anime, but was never given an answer to her real identity.\\n\\n\r\nEnjoyment – 8/10\\n\r\nTo me, watching Dantalian no Shoka is almost as if I am reading a book. The anime itself is like a literature art. The subs were brilliantly written in Dantalian no Shoka, and this alone gave me tremendous enjoyment. Following the detective manner of the plot is great fun as well, with all the mystery and suspense going on.  Too bad the anime did not end well and left a sour note into my account. \\n\\n\r\nOther Thoughts\\n\r\nDantalian no Shoka is akin to literature, and as such, book lovers may love it, while those who are not fans of heavy words may not like it so much. \\n",
            "date": "2013-09-06T22:38:00+00:00",
            "helpful_count": 11,
            "mal_id": 112173,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2431015.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lord_Odous",
                "username": "Lord_Odous"
            },
            "url": "https://myanimelist.net/reviews.php?id=112173"
        },
        {
            "content": "Gothic and Lolita themed stories often present that vampiric charisma atmosphere that charms an audience so pleasantly. With a story of both Gothic and Lolita elements as Dantalian no Shoka, the remaining ingredient for a charming series lies in the characters. And yes, they did deliver. Although not on their own. As individuals, Hugh is only our calm, cool-keeping lead and Dalian is our standard tea sipping, pastry loving, tsundere loli. The key to the show's success was the interaction between these two as they developed through their journey.\r\nSpice and Wolf fans (and not for the furry aspect of the show), will enjoy Dantalian noShoka for the chemistry between the two lead characters. As a shift from the romance genre, Dantalian no Shoka steers clear of any suggested innuendos of perversion, or romantic love. That's not to say however, the character have no love for each other; in fact, not only do the characters share a strong bond, they also value others as human beings. Even for villains who are destroyed, Dalian and Hugh neither cheers nor turn a cold shoulder. Instead, an episode would takes a moment to reflect upon the moral dilemma caused by the Phantom Books and usually closes leaving somewhat of a melancholic atmosphere.\\n\\n\r\nWhile the chemistry of Hugh and Dalian does developed, expecting any slice-of-life action through the series may be a tad misleading as the characters themselves remain relatively unchanged from start to finish. The audience does however grow to love Dalian and Hugh in the process as they open up more to each other. Through the introduction of Hugh's friends and events of the Phantom Books, we learn that Dalian is less cold than her appearance and title, the Black Bibliopricess, may suggest. With the heart for those who have been misfortunated by the effects of the Phantom Books, and a soul of a child for sweets and pastry, Dalian becomes less monotonous as a character as the audience witness the multiple sides of her personality. For Hugh, rather then personality display, we learn about him through his past events as a soldier. Namely, his persistence to help and fight for his friends.\\n\\n\r\nBut the charm of merely two characters doesn't quite bring a show up to \"recommendable\". Particularly for an episodic series as many fall into that pitfall of each episode simple being a rehash of each other. Isn't that right, Hell Girl? For Dantalian no Shoka, the core formula for an episode remains unchanged: Something is amiss. A Phantom Book antagonist is suspected to be behind the corruption. Stop said antagonist. Go home. Drink tea. Enjoy some mild sauce tsundere. However, the Phantom Books themselves acts as a convenient plot device for altering this generic formula. Due to the various nature and power of each book, they cause one to question the value of life, the morals of deceit and white lies, and the limits of justice. Although such questions were subtle, an each episode leaves the viewer with some food for thought.\\n\\n\r\nAs enjoyable as Dantalian no Shoka may be, it's difficult to place any title equal to \"spectacular\" for the show. For the show itself did not lack any particular elements, it also was not outstanding in any particular elements. It's comedy and dialogue were kept at a minimal, for it was not a comedic based series. It's drama was not striking and sudden, for it was not a drama. It's mystery served just enough to create its enigmatic and dark atmosphere, for it was not Death Note. Conclusively, it was only a very enjoyable, charming, paced, and amusing series.",
            "date": "2011-10-31T10:52:00+00:00",
            "helpful_count": 11,
            "mal_id": 46571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/330213.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kartesian",
                "username": "kartesian"
            },
            "url": "https://myanimelist.net/reviews.php?id=46571"
        },
        {
            "content": "I started this series with high hopes and an understanding that they may not be met.  Unfortunately they weren't on all levels but were on a few.  An above average series for some, disappointing for most, but still something that I, in the end, enjoyed and liked, though I would only recommend to a niche audience.\r\nOverall:  7\r\nRead Below\r\nStory:  7\r\nThe idea in it's very basic form is nothing new.  A guy-girl duo out to save people from things they don't understand/are misusing to hurt others.  Despite this, I found it interesting still that \"phantom books\" were chosen as the tools.It's something different and in a sense, philosophical, to see that words are chosen as the weapon.  Anyways, the story starts off rather episodic with very little tying one episode to the next other than the main characters.  There isn't much plot development till the last few episodes which left me wondering why they either didn't attempt to turn this into a longer series or just start integrating the plot sooner.  There is a set of characters that don't make an appearance till the last two episodes and another set that are briefly glimpsed earlier than revisited in the last few episodes.  Also, an entire history/relationship between Huey and the pig-tailed girl is pretty much left unexplained.  In short, the story was generic yet refreshing at the same time, however, the plot development was weak and rushed.  Unless there is another season or a movie to be released, this is a big weakness in the series.  \\n\\n\r\nArt:  9\\n\r\nAs the rating suggests, I liked the art.  In all actuality, the art and animation deserves an 8 but I am rating a 9 for two different reasons.  1)  Baby The Stars Shine Bright's and Alice and the Pirates was involved in designing costumes for Dantalian and the cast.  I am a huge fan of Goth Loli (one of the secret reasons I picked up this series to begin with) and anyone who even has remote interest in Goth Loli should know this name or look it up.  2)  Episode 9.  Watch it.  The art is fantastic.  The rest of the series has great art design and above average animation though at times stiff, thus the deserved 8 rating, but these two things pushed it to a 9.  \\n\\n\r\nSound:  8\\n\r\nThe OP and ED are both good choices with the OP being the better of the two.  The ED was a little strange for most people though I enjoyed the live action perspective and thought he video was interesting.  The OP, however, is a beautiful number that really captures the mood with a somber score that is also, surprisingly, serene.  The voice acting was good other than the fact that I kept finding myself being irritated with Dalian's pronunciations.  For some reason, the way she strongly pronounced the ending syllables of her sentences rubbed me the wrong way and wore on my ears after a while.\\n\\n\r\nCharacter:  7\\n\r\nThe lack of plot development resulted in a general lack of character development.  We see Dalian and Huey go through various adventures with each other but I never once really felt that their relationship had matured.  There standing seemed the same in episode 2 as it did in episode 11.  Only in the last episode do we see some emotion/connection between the two, but this is lost within the whirlwind of plot being flung at the viewer.  Other characters are either abandoned or relegated to a mere mention in the closing episodes.  There is never a strong tie connecting main characters to side characters and thus everything feels loose and unorganized.  Also, as a personal note, I found Dalian to be a little too much tsundere, border-line childish.  Scratch that, she WAS childish.  Just not cute enough to overcome it.\\n\\n\r\nEnjoyment:  7\\n\r\nI mostly enjoyed this anime for the art and the idea of books being used as weapons.  This was somewhat lost in the chaos that was the last episode, but none-the-less, I still found this enjoyable enough.  I wouldn't recommend unless I was sure someone else had the affinity for Goth Loli/Victorian style that I have.",
            "date": "2011-10-08T04:47:00+00:00",
            "helpful_count": 11,
            "mal_id": 45083,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/14820.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VTOtaku",
                "username": "VTOtaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=45083"
        },
        {
            "content": "I had high hopes for this show, mostly because I love books, and it sounded like an interesting concept. However, that interesting concept was shunted into a villain-of-the-week formula that soon grew tiresome. While it is possible to do that formula well, these plots ranged from boring to inane. In addition to the stand-alone plots of the episodes was a feeble attempt at an overarching plot, which really failed spectacularly at tying anything together. The ending did little to actually end anything, or explain anything, or give even the least sense of closure.\r\nWhich brings me to the characters. This was by far the most negativeelement of the show: the complete lack of character development. Dalian was your generic bitchy little girl who actually cares more than she lets on. Huey was just plain bland. Some of the side characters, such as Huey's friend with the strange wardrobe choices, were cute, but ultimately lacked any sort of depth. The mysterious figure with the braid who we kept seeing is another example of a character wasted: he shows up at the very end, does something crazy for no apparent reason, and then the show ends. Who is he? Why is he such a dick? We don't know. Nothing was explained. Not to mention the mysterious pigtailed girl in the library. We spent so little time with her that it was really hard to give a crap about her when she showed up again in the last episode.\\n\\n\r\nThe show's artwork, while polished, was as bland as the characters. I sometimes found it difficult to tell characters apart. There was an exception, however, in the episode with the apprentice medicine woman or whatever she was. The art in that was truly beautiful, and I wish the entire show could've looked like that. In comparison to that high point is the climax to the musical episode, which they chose not to animate but instead to just show us a bunch of stills of the \"thrilling\" conclusion. It was really jarring considering the quality of animation in the rest of the show.\\n\\n\r\nDantalian no Shoka had a lot of potential, but just failed to deliver in almost every aspect. I wouldn't waste my time with this one.",
            "date": "2011-10-02T11:51:00+00:00",
            "helpful_count": 10,
            "mal_id": 44647,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5847.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/nerdypants",
                "username": "nerdypants"
            },
            "url": "https://myanimelist.net/reviews.php?id=44647"
        },
        {
            "content": "Dantalian no Shoka: Ten reasons why.\r\n1. Great anime.\r\n2. Great concept.\r\n3. Spectacular characters. (Although, the development of some characters lacked that oomph.)\r\n4. Great storyline.\r\n5. Plenty of action, plot twists and books.\r\n6. Loli AND tsundere. Lol. I know tons of people who would watch this anime for that.\r\n7. Blonde guy in trenchcoat + book ftw.\r\n8. Is it just me, or is the part where he sticks his hand into her chest amusing?\r\n9. EPIC AND DAZZLING EFFECTS, AUDIO AND ART.\r\n10. Hey, what's not to love about a dramatic ending?\r\nAnd that's my story. (Your cue to say, \"Cool story, bro.\")",
            "date": "2012-01-23T13:27:00+00:00",
            "helpful_count": 10,
            "mal_id": 52397,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1113635.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lina-chan87",
                "username": "Lina-chan87"
            },
            "url": "https://myanimelist.net/reviews.php?id=52397"
        },
        {
            "content": "Dantalian no Shoka is potentially a polarizing anime. It has few downfalls, though some may be quick to point out that they impact the show heavily. It has many redeeming factors, which some may not like in the least. Overall, it is a great show if you know what you're getting into: an interesting (but at some points confusing) plot in an episodic nature, beautiful aesthetics, and incredibly likable characters.\r\nStory - Good\r\nThe story of a girl who is the key to a library of magical books is not ground-breaking in the slightest. However, Dantalian no Shoka almost acknowledges this with its episodic nature. Instead offocusing on progressing an overarching plot, individual episodes are more concerned with providing entertainment. This is a double-edged sword, of course. You can argue that a nonprevelant story makes the show weaker. However, the individual episodes' stories are very interesting and captivating. In one episode, the duo enter a book. In another, a city is replaced with dolls. Each episode is unique and brings something new to the table.\\n\\n\\n\r\nCharacter - Great\\n\r\nThe characters fit stereotypical anime roles, yet the small but significant divergences from the mold make then exceptional.\\n\r\nDalian: Everything about Dalian is done amazingly. The way she becomes visibly disheveled when eating sweets. The way her voice actor conveys emotion with a haughty voice. Her pretentious nature, which is accentuated by moments where she loses her composure. Dalian is a stereotypical female lead done right, for good or bad.\\n\r\nHuey: A man in every definition of the word. He shoots first and asks questions later. He's always prepared to protect his lady, Dalian, when danger presents itself. He's never flustered or unsure about what to do next. Huey is a protagonist done right, though one could point out that lack of scenes of him failing is detrimental to his character development. I personally did not find this an issue.\\n\\n\r\nNo other characters play as big of a role as Dalian and Huey. There are reoccuring characters such as Camilla and Armand, but they do not play a big role in either the episodes they appear in nor the overarching story. These episodic characters are often developed well, sometimes through flashbacks or monologues, and sometimes with a good ol' gunfight.\\n\\n\\n\r\nAesthetics - Great / Very Good\\n\r\nThe art style and music fit the setting very well. Characters are drawn in detail, with a noticeably large amount of attention paid to Dalian. Buildings and clothing not only look authentic, but also give the impression of age and even quaintness. The slow, almost classical music set to the historical Europe setting transitions into upbeat melodies when the action picks up. The OP has received a lot of criticism for not being the usual JPop techno dance mashup. Personally, I think the eerie combination of Yucca's voice and the bits of action shown work well. The art and animation quality is not as good, though. Details are sometimes skimped on when the scenes have smaller objects, and animation is choppy when fast-moving, though oddly it is not a problem in action scenes, which are fluid and beautiful.\\n\\n\\n\r\nEnjoyment - Great\\n\r\nI will admit, I may be biased here. The way Dalian says \"yes,\" the way she runs while holding up her dress, the way her porcelain white face portrays emotion are some of my favorite parts of Dantalian no Shoka. The action scenes with dramatic action sequences (and dramatic book-reading) are highlights of every episode. The brief comedy moments at the beginning and end of each episode keep the show fresh, and provide satisfying conclusions to each episode.\\n\\n\\n\r\nOverall - Great\\n\r\nDantalian no Shoka is more than the sum of its parts. There's some strange \"X factor\" that made it the show I looked forward to the most each week. Could it be the characters with their detailed designs? The fluid, fast-paced action scenes? Or maybe it's simply Dalian?\\n\\n\r\nI think that overthinking why one likes a show is often a bad idea. Dantalian no Shoka goes with a tried and true formula. Dantalian no Shoka shows that you don't need to do things differently to be exceptional. You just need to do things right. If you don't mind a relatively weak story partially due to its episodic nature, Dantalian no Shoka is an amazing show with lovable characters, engaging plot, and blood-pumping action.",
            "date": "2011-10-02T00:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 44609,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/wavedashh",
                "username": "wavedashh"
            },
            "url": "https://myanimelist.net/reviews.php?id=44609"
        },
        {
            "content": "Dantalian no Shoka is a show about of books. Therefore, if you don't have an interest in literature (e.g. poetry, books, etc), this show probably won't resonate with you. The story progresses at a relaxing pace which can also throw people off. Has a soundtrack that I am very fond of. That art style isn't amazing but is still done well.\r\nIf you're wanting to see a \"Should you watch this show\" type of thing, then I would say: watch the pilot and see for yourself Mr.I'm-to-cool-to-watch-the-pilot-of-a-show-that-I-don't-know-because-I-read-MAL-reviews.",
            "date": "2015-01-03T21:08:00+00:00",
            "helpful_count": 9,
            "mal_id": 176033,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3837607.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AkumuX",
                "username": "AkumuX"
            },
            "url": "https://myanimelist.net/reviews.php?id=176033"
        },
        {
            "content": "This is my first review. Be gentle guise.\r\nP.s I'm only on the second episode.\r\nI'm really liking this anime for the art and story. beautiful character design, intresting plot so far. Young male inherets grandfather's Mansion and large collection of book's. Not as thurough a reader as his grandfather but seeming still intrested.  Apon ariving at the mansion, he walks inside to find that the library is completly of books. >.> where could the books be. End's up being led to an underground celler where his grandfather apprently kept his books close by at a table and a chair. And siting in this chair isthe next chapter in this man's life. Great anime, I reccomend it to anyone who loves a story that isn't exactly outlined in the begining. Thank's for reading.",
            "date": "2011-10-15T18:18:00+00:00",
            "helpful_count": 7,
            "mal_id": 45615,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/543211.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SilentAmarok",
                "username": "SilentAmarok"
            },
            "url": "https://myanimelist.net/reviews.php?id=45615"
        },
        {
            "content": "This is a must watch anime. Everything is so perfect here. I am a huge fan of Agatha Christie. I love to read novels like Agatha Christie's Poirot and Miss Marple. I would gladly recommend this anime to any fan of Agatha Christie or anyone who likes detective novels and movies. But I have to say that it is not so good as Gosick and Death Note. Those two are on the top of my list. \r\nFirst I'll start with the story. I give it a 9/10. It has a really interesting plot. After Huey's grandfather dies he was told to take the custody ofthe Bibliotheca Mystica de Dantalian in order to inherit his estate. He was also given a key. He later meets Dalian who is the Black Bibioprincess. It is also known that Huey's grandfather was a Keykeeper.  So after his grandfather's death he becomes the keykeeper. The archieve contains Phantom books which stores forbidden knowledge. Both Dalian and Huey set out on a journey to stop people from misusing the Phantom books in order to restore peace. Those two really have an interesting relationship. I can't say that there is any romance in it though. But I ship them anyway. I will not go any further because if I do they may contain spoilers. \\n\r\nAs for the art, I give it a 10/10. There's nothing much to say about this. I just have to say that the art was great. \\n\r\nFor the sound I'll give 10/10.  \\n\r\nI'll give a 10/10 for character.\\n\r\nI'll give a 9/10 for enjoyment. The story just keeps you wondering what is going to happen next. You will be entertained until the last minute. \\n\r\nOverall I give this anime a 9/10. I just loved it! I would recommend this anime to anyone.",
            "date": "2016-01-05T02:50:00+00:00",
            "helpful_count": 7,
            "mal_id": 207801,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4984048.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AhiruArima",
                "username": "AhiruArima"
            },
            "url": "https://myanimelist.net/reviews.php?id=207801"
        },
        {
            "content": "Dantalian no Shoka is a perfect representation of what history actually is. History can be beautiful, serious, mysterious and sometimes down-right brutal. This show does not hide its colors, but emphasizes them. To truly know history you must know every nook and cranny and even the stuff you wish you had never found out. Dantalian no Shoka, shows no mercy.\r\nThis is pretty much a random story line, but still has some underlying connections (like relationships). As a young boy Huey, finds and befriends a lonely librarian who watches over a library filled with more than 600,000 books, but that catch is that the library ismystical/magical. Then the show starts with Huey being an adult and befriending another young lady named Dantalian. She and Huey go through many adventures both happy ones and gruesome ones. Will they survive?\\n\\n\r\nStory 8/10\\n\r\nI don’t usually like historical stuff, but this really hit the spot for me. I really liked the full tone art-style and the historical feel that is so beautifully presented. However, on some of the adventures, I often found myself getting a little upset or queasy. I directly recall episode four; there was a scene where some of the characters were continuously killed over and over and to make it worse, it was execution style with a bullet in the head. That is something I definitely didn’t want to watch, but that is also a representation of how history isn’t always happy and fun. Overall, there was a slight romance tone, but there really wasn’t anything that connected everything together. And of course the series ended in a way that would allow a second season to be made if ever warranted.\\n\\n\r\nCharacters 7/10\\n\r\nThe characters are not very unique. Quite frankly, all of them seem a bit dense. You have your usual short-cute tsundere girl in an amazingly complex looking dress, an idiot girl who loves to dress up, an annoying friend who can’t find true love and Huey, a man who was once an army pilot and killed his best friend.\\n\\n\r\nThat doesn’t sound very different from other characters does it?\\n\\n\r\nArt 8/10\\n\r\nThe art is fantastic, there is a great blend of colors when action happens, but overall the colors are usually dark and the art style is usually full toned (no missing borders, no missing backgrounds etc…).\\n\\n\r\nSounds 10/10\\n\r\nThe OST for this series is just amazing. The opening scenes have a great song that I just had to have and the music that was played throughout the series was just amazing. The focus on instruments was tremendous and I really loved the episode where a famous instrumentalist played in a concert. (Seeing how I am a violinist, this can be very bias).\\n\\n\r\nEnjoyment 8/10\\n\r\nBesides the gruesome-brutal executions, I think the series was pretty enjoyable. The show has a perfect blend of mystery and action while introducing a couple unique aspects that hasn’t been put in an anime before. I commend the use of music and the dialogue is also quite good, but if the brutality is any worse than it was so far, I might not watch the second season if it ever gets made.\\n",
            "date": "2011-10-02T20:10:00+00:00",
            "helpful_count": 7,
            "mal_id": 44705,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/266635.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Romie-chan",
                "username": "Romie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=44705"
        },
        {
            "content": "\" - I ask of thee, art thou human?\r\n- No, I'm heaven. The heaven in the pot. \"\r\nIt is a misconception to think that this anime is only about books. Packed with mystery and supernatural elements where the living characters and story become alive from the books just by reading it. Much to my surprise, it's a similar concept to some movies that I've watched which are Inkheart and Goosebumps. The anime centers around a key keeper which holds a key to her heart, literally, the dark reading princess and archiving each phantom books that is revealed and uncovering the truth behind it.\r\nThe dark readingprincess, very knowledgeable on the phantom books, has a particular taste in sweet foods, especially friend breads covered with sugar serving with tea, and the like for stuffed bear, like a typical loli girl. She also make sarcastic remarks about other's 'idiocracy' so as to hider her true feelings which is cute in a way. The key keeper on the other hand, is always calm, has a certain knowledge in the history of the books, being an ex-pilot, he's good at both flying a war plane and firing a revolver. Like any lead male character, he is very protective of the princess, lurching towards her at the face of danger and carrying her around his arms, protecting her from danger with all his might. They both share a strong bond with power that requires the both of them and together, they make a great partner for supernatural cases.\\n\\n\r\nEach episode contains their new adventure, new story and a new phantom books that is waiting to be archived and the mystery to be conquered. There are also some interesting side characters with similar power but different objective. The interesting plot and side characters with their own personalities and their story will keep you going. The opening song is quite sorrowful that it can relate back to the story, and the lyrics has more meaning than you think.\\n\\n\r\nOverall, this is an anime with combination of mystery, a little bit of romance and supernatural elements with a mysterious atmosphere surrounding it, such as living mannequin that resembles the face of real human. It also shows the bond shared between Huey and Dalian with their many adventure. If you're interested in all that, hop on the train and join them with their supernatural adventure and witness their unlikely partnership as they archive each book.",
            "date": "2018-12-12T19:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 295685,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7568325.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ethan_07",
                "username": "Ethan_07"
            },
            "url": "https://myanimelist.net/reviews.php?id=295685"
        }
    ],
    [
        {
            "content": "Some people agree that having all the answers in the universe our lives would have meaning, however some other people agree that ignorance is bliss. The only way we find out which ones make a better point is by experience.\r\nThe Story spins around these mysterious items called Phantom Books which contain forbbiden knowledge left behind by their writers. One could read them and tap into a well of unimaginable powers. Tempting as far as normal lives go yet forbidden knowledge comes with a great price. It is the job of the two protagonists to solve the mysteries that these books shroud and recover as manyas possible.\\n\\n\r\nClassical Artwork emphasizes this series and its characters yet notable would be the backgrounds wich act more like a cardboard greenscreen. From some points it can be better, especially when the caracters are still talking. \\n\\n\r\nJapanese people have an inborn affinity for the piano and the intro of this series is proof of that along with many others and as well as the theme songs within the episodes themselves.\\n\\n\r\nCharacters have a stereotypical skeleton which adds a bit of backstory as the flesh. Their personalities of the protagonists complement each other and add up to the enjoyment of the series.\\n\\n\r\nIf you are a interested in a good story then this one is right for you, it does not have a lot of action scenes but the comments and cultural references are a great bonus.",
            "date": "2015-10-09T11:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 200834,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=200834"
        },
        {
            "content": "[English and Spanish review]\r\n[English]\r\nWhy you should watch Dantalian?\r\nIf you are a bookworm, like me, you must watch this show. The story, even though is simple and sometimes repetitive, leads you to increase your fascination about books, their magic and the wonderful worlds that are inside each one of them. Good short stories, with great character design, and the \"lovely\" Dalian, which is kind of my model to look up to. \r\nThe only thing I can complain about is that some of the characters are not well developed. I think it should have been a longer season, to fill up some holes in the story andin the link between characters, and to dig deeper in each one of them as well.\\n\\n\r\nWhy do I love it?\\n\r\nBecause everyone makes fun of you when you are a chronic reader. This anime is able to represent visually how I feel when I read a book, the chill on your skin when you are touched by the story on that paper. Finally, the opening is one of my favourites, and I love Daisuke Ono! \\n\\n\r\n[Spanish]\\n\\n\r\nPor qué hay que ver Dantalian?\\n\r\nSi eres un ratón de biblioteca como yo, entonces debes ver esta serie. La historia, si bien es un poco simple y a veces repetitiva, promueve la fascinación por los libros, su magia y los mundos maravillosos que existen dentro de cada uno de ellos. Buenas historias cortas, con diseños de personajes geniales, y la \"adorable\" Dalian, que es algo así como mi modelo a seguir.\\n\\n\r\nLa única cosa de la que me puedo quejar es que algunos de los personajes no están bien desarrollados. Creo que la temporada debería haber sido más larga, para llenar algunos espacios en blanco en la historia y en las conexiones entre los personajes, así como para profundizar en cada uno de ellos.\\n\\n\r\nPor qué me encanta?\\n\r\nPorque todos se ríen de ti cuando eres un lector empedernido. Este animé es capaz de representar visualmente cómo me siento cuando leo un libro, el escalofrío en tu piel cuando la historia en ese papel te conmueve. Finalmente, el opening es uno de mis favoritos, y me encanta Daisuke Ono!\\n\\n",
            "date": "2015-08-27T18:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 197248,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4802092.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pilar_S",
                "username": "Pilar_S"
            },
            "url": "https://myanimelist.net/reviews.php?id=197248"
        },
        {
            "content": "First things first:\r\nI liked Dantalian no Shoka quite a lot. BUT it is some sort of hate-love. At one point I almost threw my phone in pure anger at the wall. \r\nPlot:\r\nDantalian no Shoka follows the story of our two two main characters Dalian, a seemingly childisch, tsundere like but very mysterious and intelligent girl and an ex-military pilot, Hugh Anthony Disward, also known as Huey. Huey unexpectedly inherits a giant mansion from his uncle. As a former book lover he decides to visit it as soon as possible and quits his piloting job. Within the endless towers of books he finds a young girl,dressed in Gothic/Victorian dresses. She explains him, that she is the \"black princess of Dantalians mysterious library. On their quest to find and store socalled \"phantombooks\", Books and texts that contain paranormal powers all scattered around the world, they meet various persons. The entire story happens around 1918 and 1920 (estimated)\\n\\n\r\nDisclaimer:\\n\r\nThis review is       \"S P O I L E R     F R E E\" (excpetions of names and general informations)\\n\\n\\n\\n\\n\\n\r\nStory: \\n\r\nOh boy, where do I start. The story begann unbelievably strong. A first episode, that truely captured me with every frame. But as time passed by, more and more of the beautiful facade begann to cramble away and uncovered the very raw und undefined core of the story.\\n\r\nNot only do we encounter one stereotypical plottwist after another. We also beginn to ask ourselves: \"How? Why\". As the show tries to make our characters seem caring and prudent over their actions, it makes them seem fucking dumb. Especially Huey has to suffer under this decision, as he often is displayed as a very generic and kinda dense character. This is however a great contrast to his true nature, indicated at various points. \\n\r\nThe story is devided into 12 Arcs of their own, each covering one Phantombook. \\n\r\nAnd the arcs vary greatly in how pleasing their storytelling is. Some are truely fascinating, others are mere bullshit and pain for the viewer. I will not go into to much detail here, just keep in mind, that you will have to bring a lot - and I mean A LOT - of patience when watching this show. \\n\\n\r\nArt:\\n\r\nThis is kinda hard. I wanted to give the show a 9 for its art, then hesitated. Although there is a very consistent art and animation and some scenes are extremely beautiful, they seemed to be a bit lazy at times. Of course, reusing the same frames from time to time makes sense. However it is just lame to see the sequence of Huey accesing the mysterious library of Dantalia every episode in the exact same frames. They literarely just copy and pasted the sequence whenever he gets permission to use Dalian's Library. \\n\r\nBUT, take the op of the show as an example: its hard to deny, how beautiful the scenery is and the setting is an absolute beast in terms of ambiance.\\n\\n\r\nSound:\\n\r\nNothing to be added. The OST is phenomenal, probably one of the best I've ever heared. Listen for an example to the OP and this song:\\n\r\nhttps://youtu.be/j5VRIQtyQyU (from episode 12)\\n\r\nNow tell me, can an OST get any better?\\n\r\nI don't think so.\\n\\n\r\nCharacter:\\n\r\nHuey was a very interesting Character at first, but soon turned into your average, generic sidekick. On the other hand there was a very nice background story later revealed, that gave him some extra depth (and he needed it very badly)\\n\r\nDalian is a very cute character. I can understand that a lot of people may dislike her very tsundere like behaviour but I found it kinda fit her pretty well. Her Design was refreshing and fits my taste very well. On the other hand some may hate her for beeing that \"gothic loli with an eatingdissorder\". Thats up to you.\\n\\n\r\nEnjoyment:\\n\r\nI liked the show a lot, especially for its Mystery/Gothic theme (something that is sadly very rare in the world of anime). I recomend checking it out, but don't drop it after the 3 episodes rule: take your time and watch until episode 5 or so, then you'll be able to tell, if it fits your taste.\\n\\n\r\nOverall: \\n\r\nWell, I liked it. But it got a lot of deductions for its poor handle of the concept and the fairly dense huey (I really had my hopes up that he would be more than the sidekick)\\n\\n\r\nOverall this show tries to be a paranormal version of Gosick, but miserably fails at it. \\n\r\nIf you liked this show, you may also like:\\n\\n\r\n- Gosick\\n\r\n- Ergo Proxy\\n\r\n- Guilty Crown\\n\r\n- Shiki\\n\r\n- Rozen Maiden\\n\\n\r\nThats it for me folks. Cheers.",
            "date": "2018-02-25T10:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 272449,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5580758.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Arglos",
                "username": "Arglos"
            },
            "url": "https://myanimelist.net/reviews.php?id=272449"
        },
        {
            "content": "I honestly have no recollection of how I found this anime or why I started it, but I can say with certainty that I am very glad I did. \r\nDantalian no Shoka is one of my all time favorite anime. Don't let that line fool you however, this is by no means a masterpiece. It is simply a show that for some reason, resonated deeply with me. \r\nIt has a fairly interesting story concept in the form of a mystical, mysterious, magical girl, who happens to be the personification of an ancient mystical archive. Each episode of the show is its own story, following ourmain characters as they solve mysteries and recover phantom books. \\n\\n\r\nThe stories told in each individual episode are exciting, fun, and engaging. These qualities are backed up by solid animation, good artwork, excellent music, and a very strong dynamic between our main characters. It is this dynamic that will keep the stories interesting, and I would suggest that if you don't enjoy the main duo's dynamic, you should probably drop the show.\\n\\n\r\nIn the end I gave this anime a 9/10 mainly because of the sheer enjoyment I got out of it. The atmosphere created in the show, brought about by the time period chosen for the storytelling and accentuated by the excellent music, is what kept me engrossed in this show and the stories it had to tell me. \\n\\n\r\nI highly recommend this anime if you are a fan of short mysteries brought to you in an episodic format.\\n\\n\r\nPS: If you want more context for my scores out of 10, please visit my profile.",
            "date": "2017-12-31T20:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 267047,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2722777.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/shysaviorkun",
                "username": "shysaviorkun"
            },
            "url": "https://myanimelist.net/reviews.php?id=267047"
        },
        {
            "content": "Dantalian No Shoka is a Gainax anime. That’s all I really know about its background other than the fact it is based off of a light novel series, which seems readily apparent when watching any anime. It’s either based off of a manga, light novel, or visual novel. So either a book, a comic book, or a book with pictures that is a mixture of a manga and a book.\r\nIs this anime worth your time? Well, let me tell you.\r\nStory\r\nDantalian No Shoka is twelve episodes long and when I think of twelve episodes, I think of a cohesive plot that has a satisfying climax. DantalianNo Shoka is like the polar opposite of that. While the series does have a small amount of cohesive plot (a lot more during the final episode), most of the series is episodic in nature. The plot revolves around Hugh Anthony Disward, a Keykeeper for a mystical library inside of Dalian, who I think is some sort of doll come to life or something. This all takes place in Post World War I England which does give us a really nice, fresh setting. Each episode Dalian and Hugh go after books that can be used for a myriad of bad things. And that’s about it. The plot never expressly explains who Dalian really is, why she has a library inside of her, where Phantom Books really came from. I get the feeling that the biblioprincess’s (as Dalian and another girl later on are called) are the libraries of the archangel’s, but this only comes up once and is never stated as a fact. The last episode seems to explain a bit about how Dalian became a Biblioprincess (something about Pandora’s box and we see the minotaur of Crete as well), but once again we are never told anything and I guess we are meant to make assumptions ourselves.\\n\\n\r\nThere are two episodes that I need to talk about. One features a guy who burns Phantom Books but has a biblioprincess like companion with him. Whether she is or not, I don’t know. There is another episode where we meet the red biblioprincess. Both of these episodes seemed like filler until the very end when our heroes showed up for the final face off.\\n\\n\r\nThe last episode should have resolved something but instead leaves more questions, doesn’t resolve anything, and makes me want a second season.\\n\\n\r\nI also want to state that the vast majority of the episodes, maybe two are exceptions, focus on girls or women as the bad guys or as people taken advantage of. There are only two or three male bad guys in the whole show and the rest are crazy women. I don’t know why that bothered me, maybe it was the fact it made the show more predictable.\\n\\n\r\nSo it has a loose plot, but a good idea for episodic adventure. It’s just too short to be episodic.\\n\\n\r\nAnimation\\n\r\nIf there is one thing this show has going for it it is the spectacular animation. While characters look average at best, the backgrounds and setting are amazing looking. The colors are bright and vivid and the I heard that this was the only place that Gainax had anything to do with. The characters don’t look like Gainax characters particularly, but then again, Gainax tends to change things up every anime they do. There is one episode where the animation changes into something out of an older edition of a Lewis Carrol novel and it looks amazing.\\n\\n\r\nSound\\n\r\nThe opening theme is fantastic. The ending theme is also great. The music during the show is good as well. Voice work is good and sound effects are good. This sound section is hard to write a really long, compelling paragraph about most of the time…\\n\\n\r\nCharacters\\n\r\nHugh and Dalian are fun characters to follow around, although they are both fairly generic and their personalities can be seen in dozens of anime, especially Dalian’s. There are very few recurring characters. There is a girl that I guess is the love interest, but a complete idiot. There is Hugh’s friend, a womanizing guy who at one point is turned into a tree and set on fire. There is the book burning guy and his white haired companion chick. The companion chick is pretty awesome, but doesn’t get enough screen time. The red biblioprincess is kind of there, as is the main bad guy. The characters are all pretty static.\\n\\n\r\nOverall\\n\r\nDantalian no Shoka is good. But it’s bogged down by the fact there are only twelve episodes, there is not really a cohesive plot, and the ending begs a second season that I don’t know if we’ll ever see. It’s a solid anime, it’s got a lot of redeeming factors and has a lot of cool ideas, but I just don’t feel like it really accomplishes anything. As a weekly adventure, it was a fun watch. If you were to watch the episodes one after another though, you’d probably be bored. There is never a To Be Continued moment that leaves you on the edge and makes you keep watching.\\n\\n\r\nSo it’s good as a weekly show, not quite as much something to watch over an afternoon. On top of that, quite a few episodes are rather dull, boring, or feel like an episode from before.",
            "date": "2015-05-22T11:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 188536,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188536"
        },
        {
            "content": "Interesting dark 'n' mystic atmosphere. Perhaps I should say *this* is reminiscent of Amnesia (rather than Another) due to it being placed in a similar (I think?) era and with supernatural frights. Nowhere near as spooky, though I'm still with Diablo II's necromancer: I enjoy the darkness.\r\nWe of course need the ill-fitting, tsuntsun loli to bring in a wider audience, too. Mouthy, dinky and childish? Pedopaaaanderiiiing.\r\nThe gothic storybook ambiance makes it easy for me to forgive this being formulaic & monster-of-the-week (even if they weren't always \"monsters\"). Harder to forget this having Angel Beats!-levels of disjointedness, though.\r\nCould have been a lot better had they tiedthings together, did more digging into the interesting and potential-filled world they created, and relied much less on a bog-standard tsundere to charm the viewers and carry the show. (Charm the viewers and carry the show! Charm the view-- sorry, that line made me wanna SING) And she *was* charming, don't get me wrong, but we need more than that. They certainly got the FEEL right, now they just need an appropriate personality to match the looks.",
            "date": "2013-04-16T11:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 93945,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/UnculturedWhitey",
                "username": "UnculturedWhitey"
            },
            "url": "https://myanimelist.net/reviews.php?id=93945"
        },
        {
            "content": "l don't really understand how two shows so similar can be aired consequently. Of course you can say all shows are recycled copies of each other, but this coincidence this time almost seems intentional. \r\nAs a production of Gainax, I was hoping it would have something weird or grand, at least with the themes, but I haven't detected any stable themes yet. The story so far is about a proud girl Dalian with her protector Hugh fighting demons from books that cause humankind to turn evil. So far, the story is straightforward with no real twist to it, but I'm expecting more from this setting.I think it will give more.\\n\r\nThe vast amount of vagueness so far makes a twist in the end highly possible, but then the atmosphere and how the characters behave give me doubts. Beside the stereotypical characters and their interactions, I find all the names given to the books, minor characters, and places difficult to remember and hard to put together. But aside from all that, the story so far is faintly engrossing. \\n\r\nHowever, I don't see the mysteries surrounding the girl and her library enfolding in the next several episodes, so perhaps the show within the next few weeks will disappoint more fans. \\n\r\nBut I personally will continue watching it until I see some new layers.  \\n\\n\r\nI love the opening btw. It's very fitting.",
            "date": "2011-07-31T07:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 40447,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/526945.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/movoning",
                "username": "movoning"
            },
            "url": "https://myanimelist.net/reviews.php?id=40447"
        },
        {
            "content": "Please understand that this review is only my opinion about this show and I'm not trying to say that this is the only and absolute truth about the show.\r\nStory:\r\nThe story isn't anything really special. Each episode you have a different case which is handled pretty much same way everytime (of course there are exceptions). So there really doesn't develop anything deep for the story. The story really started to go intresting at the last episode and then it was already too late. Dantalian should've needed 12 episodes more because of this. \r\nArt/Animation:\r\nThe character designs are pretty mediocore. Really nothing you wouldn't have seen already. Iwould've hoped more originality in them. The style in the episode 9 (?) they used was much better (though the animation wasn't that good in that ep) . There really isn't that much originality in them. The animation isn't bad but it isn't particularly good either. I would've expected more from Gainax which usually makes something out of ordinary. That's why I was little disappointed with the animation.\\n\\n\r\nSound:\\n\r\nThe music is pretty classical oriented which works prefectly with old english mood. Although the opening is pretty horrible. The music doesn't fit with the video at all. And the ending is pretty creepy. Voice actors do what they do the best. Nothing to really complain.\\n\\n\r\nCharacters:\\n\r\nDalian was annoying 98% of the time. I didn't like her selfish attitude. Most of the characters were left pretty shallow and they would've told more about some characters past. Only Hugh's past were a little bit dealt. But for example other keykeepers were only introduced but nothing about their motives were told.\\n\\n\r\nEnjoyment:\\n\r\nFor me the enjoyment wasn't really that high. I prefer series that are placed in modern days or in the future and I'm not really fan with long enchantment lines.  Some of the cases were pretty intresting but there were also boring ones.\\n\\n\r\nOverall:\\n\r\nThis was a pretty mediocore show. It isn't anything special but it isn't bad either. Expecting something special because it's from Gainax is gonna make you disappointed. Of course if you are a fan of books, magic, old english style and Ono you are gonna love this show.",
            "date": "2011-10-02T02:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 44615,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/240637.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Shipuli",
                "username": "Shipuli"
            },
            "url": "https://myanimelist.net/reviews.php?id=44615"
        },
        {
            "content": "Story\r\nThe story line was completely mediocre with the introduction of a new mission/adventure or whatever in each episode that goes by so fast that there's no way to become emotionally invested in any trials and tribulations the two main protagonists go through throughout the series, especially because of the fact the show is limited in it's episodes and this type of format would probably take far longer to get used to.\r\nArt\r\nThe artwork in this show was also mediocrity, nothing really captivating at all about it. Just felt like some bland fantasy artwork with nothing much in the way of originality to offer.\r\nSound\r\nThe music and qualitythereof was completely forgettable and boring; the opening theme and ending theme were actually annoyingly bad.\\n\\n\r\nCharacters\\n\r\nThere are only two characters even worth mentioning because none of the others are even noteworthy;\\n\r\nThe main protagonist Huey lacks any form of personality whatsoever making him entirely uninteresting and impossible to, like with pretty much everything else in the show, invest any emotion into. Dalian has a bit more personality but that's not saying much at all because it's basically being compared to a lack thereof and on its' own becomes entirely apprehended by the fact that she's a total cunt. The interaction between the two is nothing more than thinly veiled euphemism for how terrible they are as individuals, which is showed in the fact that they know basically nothing about each other. And whoever the overall stronger person was, whoever saves who, was seemingly decided by flipping a coin before each scene which manages to blur the lines between their character roles and nearly leave them undefined. \\n\\n\r\nEnjoyment\\n\r\nNo.\\n\\n\r\nOverall \\n\r\n4/10 and dropped because it's poo poo.\\n\\n",
            "date": "2017-03-27T18:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 243740,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4425837.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/matt427",
                "username": "matt427"
            },
            "url": "https://myanimelist.net/reviews.php?id=243740"
        },
        {
            "content": "This history goes with Dalian (Black Biblioprincess) and Huey. It's about Victorian Age. The argument is acceptable, because is similar to another animes, so I liked it, is simple but curious. Both are connecting by Dalian's librarian. But nobody knows about that. Huey promised to the librarian rescue her. The relationship is cold and distant, but gradually they are approaching. The serie envolves you with the mistery and the tragedy -not much-, Dalian is a gotich lolita, in love with the books because grandfather's Huey adopted her when she was a little girl. I love this anime because mi favourite anime is Gosick and thegenre is the best for me. You can apreciate the fantasy -little-, but is a magical and surprising. Temporarily the friendship is consolidated -but I think not only de friendship-, I think the anime needs more chapters, but they did the best of them -I hope so-, the anime has 2 extra chapters about another characters with a Biblioprincess. \\n\r\nAnd the Final Episode was unexpected -for me-, i really would Huey would find a way to save her. I loved that final.",
            "date": "2017-01-25T11:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 239097,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4680600.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jikishi",
                "username": "Jikishi"
            },
            "url": "https://myanimelist.net/reviews.php?id=239097"
        },
        {
            "content": "Dantalian no Shoka is about Huey, a young man whose grandfather died and left him his house supposedly filled with books from demons and Dalian a seemingly young girl found in his grandfather's home. \r\nThe anime gets right into things and explains everything right off the bat, almost smothering you with information. Despite this it still allows for you to understand what's going on and how everything works while giving hints of everyone in the first episode.\r\nI'll be honest: Half of the anime is filler.\r\nThere is no exact goal established in the beginning so it's just them dealing with random situations involving the Phantom books,which grows tedious and boring. The story had much potential and could of been developed well--but, once again, because of the short amount of episodes it was compacted and had light focused in all the wrong places. \\n\\n\r\nI found it intriguing and would keep up with the episodes regularly in the beginning, checking on my crunchyroll app, however I soon realized that the anime wasn't very enjoyable and switched to the manga. \\n\\n\r\nIf you're interested more in the plot and goal, then this would be the wiser of the choices.\\n\\n\r\nStory:\\n\r\nIt could of been much more memorable and interesting if there weren't so much filler. At times I felt a bit likes this was like FMA, just because of the atmosphere in the episode with the writer.\\n\\n\r\nArt:\\n\r\nArt was beautiful and the animation was good. The environments were realistic and done well. The designs were unique and eye-catching as well.\\n\\n\r\nSound: \\n\r\nI love the music for this. It suited it very well--I was actually quite surprised with the ending theme but it felt suited to it. Not only was the music gorgeous, but it created a subtle environment that you could easily get into.\\n\\n\r\nVoice Acting:\\n\r\nAll the characters were well cast and fit into their roles with ease. \\n\\n\r\nCharacter:\\n\r\nAlthough Dalian sometimes acts a bit like a tsundere, she isn't pushy or angry 24-7 and is--dare I say it--quite classy, able to carry herself 'like a lady' without embarrassing herself or angering the audience with stupidity. She is mature, although she has the tendency to get fired up (not blow up, mind you) and is calm and collected the majority of the time, though easily swayed by sweets.\\n\\n\r\nHuey, the other main character, is a capable young man who did some service in the military. He's very similar to Dalian in some respects, having the same mannerisms but can be unexpectedly bold. He is intelligent and I don't think I've ever been irritated by his decisions. \\n\\n\r\nHis relationship with Dalian is almost sororal with how he treats her. He treats her like a woman, but cares for her almost like he would if she were his sister. Mind you, I said 'treats' not 'feels'. \\n\\n\r\nOverall the characters were excellent and I reccomend the manga instead of the anime unless you're looking for something short with a bit of a 'no strings attached relationship'.\\n\\n\r\nMind you, I still have not finished the anime, but I have read the manga.",
            "date": "2011-10-14T18:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 45553,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/748925.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Harmoniche",
                "username": "Harmoniche"
            },
            "url": "https://myanimelist.net/reviews.php?id=45553"
        },
        {
            "content": "After watching a couple of episodes of Dantalian no Shoka, I thought this series has a lot of potential as it is an anime with philosophic story-lines and fairy tale feeling in it. But even with more and more episodes coming out, Shoka couldn’t win my praise and sympathy for some reason; I still thought of it as a show with unopened potential. And now it is over. It could be good, but failed. And in my review I will try to understand why this happened.\r\nSo, the plot. Hugh Anthony Disward, the protagonist of the story, inherits a mansion from his suddenly deceased bibliophile grandfather.In this mansion he meets a girl named Dalian, who is the custodian of the Mystical Tomes. These magical books have varying powers: some can bring people back from the dead, others can turn the person who reads them insane, and so on. Lord Disward, understanding the danger the Mystical Tomes hold, joins up with Dalian in a quest to find and seal the Tomes away.\\n\\n\r\nDalian is a typical tsundere character, who is lovingly done with all reference to ISO 15129 Female Leads of the Anime Shows. She sips her tea, enjoys various sweets and cakes (oh man, excuse me for thinking about K-ON for a second) and scolds Lord Disward to work off her tsundere position. Nothing really new or inventive here. On the other hand, Lord Disward seems to be a lot more interesting character. He participated in war (not a soldier, merely a pilot, as he claims himself), and that’s actually a really attracting trait. When one think about a military pilot and books, the associations are quickly led to Antoine de Saint-Exupéry. Or maybe Richard Bach. That kind of people. Nevertheless, Lord Disward gets a certain romantic aureole right from the start with just one phrase.\\n\\n\r\nWhole nature of Dantalian no Shoka is episodic. All episodes are standalone stories, and most of the secondary characters appear only in one episode, so the cast is pretty much limited to Lord Disward and Dalian. The stories are usually very metaphorical and deal with a number of philosophical questions. The common themes are what can happen if the Mystical Tome falls into wrong hands, and the drawbacks of the magical books’ powers.\\n\\n\r\nAnd now pieces are set. As you can see, all those things make Shoka a promising anime. What can possibly go wrong, huh? Firstly, the pacing of the series is terrible. Shoka goes strictly with “one story — one episode” formula, so most episodes seem too rushed and messy with their stories being crumpled and not detailed. I can see this series tries to make the viewer think, but it just doesn’t give him time to reflect upon what happened, and it limits the plot to just “fancy things go around in Victorian England”.\\n\\n\r\nSecondly, the character development. Dalian, as ISO 15129 recommends us, is never affected by any events. Her character remains static during the whole run of the show, but that’s not an issue, since I never expected anything from her. The problem lies with Lord Disward. He is a capable protagonist at first glance, shooting enemies and all that, but he turns out to be really plain and undeveloped, usually just saying something trivial about episode’s outcome and not getting impressed with anything happened in it. Remember that stuff I said about military pilots and romantic aureole? It kicked only in one of the last episodes, and because of pacing problems even that episode failed to show the development of Lord Disward’s character.\\n\\n\r\nLet’s take Kino no Tabi for comparison. (I know it’s bad to compare anything with one of my favourite anime of all time, but please, bear with it for a second.) Kino no Tabi is episodic, was based on ranobe and has a lot of philosophy too. However, Kino no Tabi’s stories are wonderful and well-balanced. Its protagonist, Kino, seems to be emotionless, but one still can feel how various events have an impact on her character. Oh, and I think I got an idea why Shoka failed. The person in charge of Kino no Tabi was Nakamura Ryūtarō-shi, one of the most talented and distinctive anime directors. And the director of Dantalian no Shoka was Uemura Yutaka-shi, a newbie. I’m not saying he is a bad director. He was trying to tell us a good story, but he is just not experienced enough to do so. Probably, this project was too much for him to handle in right way.\\n\\n\r\nOkay, now I’m done with this review. Dantalian no Shoka could offer a lot but has too many issues to do it. I rate it 7 points, because the director actually tried and because it has beautiful violins in its soundtrack.",
            "date": "2011-10-02T14:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 44673,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/201858.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KatayokuTsuneki",
                "username": "KatayokuTsuneki"
            },
            "url": "https://myanimelist.net/reviews.php?id=44673"
        },
        {
            "content": "After finishing Gosick, I instantly went to it's MAL page and looked at the recommendations for similar series. I'm a huge sucker for Gothic/Victorian-esque anime that take place in the 1920s or late 1800s. Especially ones with a mystery element to it's story. I saw Dantalian no Shoka, or The Mystic Archives of Dantalian, and became really happy. It looked almost just like Gosick. Though... the only way it's similar to Gosick is the time it takes place, and the small mystery elements thrown in there. As well as characters. \r\nThis series is fairly episodic. It's about a man named Hugh, or Huey, who inheritshis grandfather's mansion. His grandfather was a book-addict, and had his own personal library. When Huey enters the library, he encounters a girl, whom he thinks to be a doll at first. \\n\r\nHe learns of mysterious entities known as \"Phantom Books\", which are like a piece of literature that causes magical happenings whenever they're read. Though, in this case, Phantom Books can come in the form of basically anything, even sound. Huey becomes this girl's, whose name is Dalian, Keykeeper. She explains that she is the gateway to a bookshelf of Phantom Books, keeping them away from humans. This way, they won't cause any harm. \\n\r\nThus, begins our series of Huey and Dalian as they search for these entities known as Phantom Books so they can store them away in Dantalian's Bookshelf. They don't travel much, so it's not an adventure series. Basically they hear or learn about mysterious happenings and then choose to investigate it to see if the cause of said happening is by a Phantom Book. \\n\r\nNow that I'm done summarizing the base of the plot, here is the actual review;\\n\r\nStory: 8 \\n\r\nNow, as much as I absolutely LOVED the concept of this story, there are some flaws. Mainly the only flaws are events or characters that aren't really explained. This girl that Huey wants to save... who is she? What is she? Why is she in that empty space, trapped for all time? You'll never know. (Unless you read the LN... if it is an LN. I believe it is.) It doesn't tell you. How did Huey meet her, as well? Another flaw in the story is certain characters arrive and never really... do anything drastic or important. Well, they do, in the last episode. There's an entire episode based on two characters; Hal and Flamberge, who are similar to Huey and Dalian in terms that they're both a Keykeeper and Gate to a bookshelf. They only come in during that episode, and then make one last appearance in the final episode. The final episode is when they actually do something important to the story. Same goes for another Keykeeper and Gate. None of these characters are really explained or don't really do anything important to what's happening around Huey and Dalian. \\n\r\nOther than these flaws, I loved the story. Very unique and creative. The story-telling style is similar to Mushishi in the sense that every episode is a new story where Dalian and Huey get involved and solve with their power and knowledge of the phantom books. Each story has something to do with a phantom book as well... obviously. The stories are creative and interesting, and I definitely wish the series was longer to show me more of them. \\n\r\nArt: 10\\n\r\nAs I said before, I am a sucker for the time this anime takes place in. It takes place in Europe. The show has an overall dark-ish Gothic feel to it, as well as some beautiful backgrounds of Victorian style buildings or castles. There is one episode, I believe episode 9, where the art changes drastically. Though, there is a reason. I found it kind of funny, actually, the reasoning behind the art change. At first I thought the studio was just lazy for that episode, but... I was wrong. You'll see. \\n\r\nSound: 10 \\n\r\nOh my goodness. I can't really explain how much I am IN LOVE with the music for this series. The opening... oh my, the opening, it's beautiful and it fits the show perfectly. It's a very unique opening. The background music, or OST, is also beautiful and keeps that Gothic feel to it. I'll definitely be looking into the soundtrack later. It may even become one of my favorite soundtracks ever. \\n\r\nCharacter: 10\\n\r\nNow, there aren't a lot of repeating characters in this series. I'd say there's four important repeating characters, as well as 4 others I mentioned before that don't get much background. The two main characters, Huey and Dalian, are very similar to the ones in Gosick; Kujou and Victorique. An ex-soldier, who comes across a small girl dressed in a Gothic dress in a library. Both Dalian and Victorique are very similar in terms of their personalities. Hell, they're both even similar to Shinku in Rozen Maiden. Both also are tsundere-ish who thinks they can tell the male character what to do, and they get cute when they see sweets. \\n\r\nEither way, enough comparing characters. Huey is an interesting one. He doesn't really have a personality I can explain, but it's most definitely not a boring one. Watching him and Dalian interact in front of other people is extremely precious and awesome. I loved seeing them talk back and forth with each other. You can clearly see that Huey learns how to deal being with and talking to Dalian more and more. There is some romance between them, but it's not really emphasized. Armand and Camilla are two other repeating characters and friends of Dalian and Huey. They come to them for help when dealing with phantom books, especially Armand. Armand's a fun character who calls Huey \"lieutenant\" and is always trying to find a girlfriend. (He's not one of those dudes who go after every pretty woman he sees, though.) Camilla always approaches Huey and Dalian dressed in \"strange\" outfits from other countries, and Dalian's opinions on them are always entertaining to hear. There are a bunch of other characters for each story, as well, that appear in one episode each. \\n\r\nEnjoyment: 9 \\n\r\nThe only thing that I didn't enjoy about this series is the missing explanations in certain characters and it's length. If this show was 24 episodes or even more, I probably would have marked it as one of my favorites if it managed to keep up it's amazingly unique feel throughout the entire show. \\n\r\nAnd the show is actually a bit more action-packed than it seems. It's not too crazy, but there are a good amount of well-animated fights with monsters or people. There's also a good amount of blood and gore, too! Which is always a plus! \\n\r\nMy Overall score is 9. If you like Gothic-themed Anime with a supernatural element to them, then give the show a try! I highly recommend it!",
            "date": "2014-04-27T11:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 141547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3671701.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hime-In-A-Box",
                "username": "Hime-In-A-Box"
            },
            "url": "https://myanimelist.net/reviews.php?id=141547"
        },
        {
            "content": "Maybe it was my great expectations for a Gainax work, but Dantalian no Shoka has come as something of a disappointment.  It starts with an interesting premise and really likeable characters--Huey Disward`s polite badass is quite infectuous, and though Dalian seems like a tsundere Index (from To Aru Majutsu no Index), she is also extremely cute (save for the quite atrocious  Meme, her tendency to say yes in painful gratuitous English).  The art is quite beautiful, and a setting in the 1920s-1930s is quite rare, seen only with Baccano and more historical pieces such as Senkou no Night Raid (a anime thatwas no longer subbed, though it was best described as X-men meets the Japanese Occupation of China, but I digress).  The opening showed great potential too, with other seemingly similar pairs of humans and phantom book keepers.  However, on the 9th Episode out of 12, these characters have yet to appear, and the plot has mainly consisted of episodic short stories that vary from quite brilliant to short, pointless and mundane (for example, in a short 8-minute episode, a group of children have attained all the wisdom of the world--and proceed to do absolutely nothing whatsoever.  In another, in a reference to that ebay stunt in which one guy traded a paper clip for a house, one of the characters starts with a paper clip and ends...with a Teddy Bear, with a slightly aged reference to President Teddy Roosevelt).  Even if the four other intriguing characters in the opening were to appear, it is likely that the plot will be rushed out of coherency.  And the live-action ending is absolutely atrocious, the music perhaps likeable enough if not for the creepy animation that in fact has little in common with the story.  All in all, Dantalian no Shoka had great potential, amazing art and a likeable characters, but has yet to make anything out of them.  I`ll keep watching in the hopes that a miracle will appear, but the only way that will happen will be if Huey pulls one out of Dalian`s chest.",
            "date": "2011-09-11T19:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 43161,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304909.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TimChan",
                "username": "TimChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=43161"
        },
        {
            "content": "There are quite much terms not accustomed to be heard by us when watching the show. But, I'll try to explain few terms here in order to make the readers understand what I'm going to explain in my review below. It's necessary because understanding can not run smoothly when these things are not mentioned before.\r\n    So, firstly, let's talk about \"what exactly is the main heroine?\" I didn't say it wrong, it is really \"what is\" not \"who is\". The pic above, is the main heroine named Dalian. A girl who wears sweet-gothic lolita dress and gorgeous long black hair--named Dalian-is aform of a gateway to Dantalian's bookshelf that lived along with the main hero's grandpa. She is well-known in the show as \"Black Biblioprincess\". The story starts when the main hero returns to his grandpa's mansion after the death of his grandpa and meet with Dalian in the basement of the mansion, dwelling herself in the library with a lot of books stored by his grandpa.\\n\r\nThe second is, \"the keykeeper\". The main hero, Hugh Anthony Disward, called Huey for short, becomes the keykeeper of Dalian after pronounced the pledge. There are also minor characters as keykeeper as well as the biblioprincess. But majority of the cases the story face about are episodic.\\n\r\nThen, related to the biblioprincess, there are \"Phantom Books\", the prohibited books of the demons. The biblioprincess position itself as the guardian of those Phantom Books. They wander from one place to another to get those books. Of course there are biblioprincesses and keykeepers who aren't using they power for wisdom.\\n\\n\r\n    I make the introduction for the story as short as possible lol. Since it's an episodic anime series, the viewers can't predict what kind of obstacle the hero(ine)s will bear. But really, it's awesome with its unique innate story. The probs viewers will face are the terms which are different each episodes. Gaze in awe to the terms! As complements for the story, the artworks are vital, and this series offers the details well-built. I can't say much about the artworks, since it's really captivating my eyes.\\n\\n\\n\r\n    Another aspects are characters and the music. The characters basically just around biblioprincesses and keykeepers such as Dalian and Huey. Together, on journey, obtain more and more Phantom Books to store to the bookshelf a.k.a biblioprincess. The characters give chills and enjoyment to the show. Kind of moe, gentle, funny (Huey's pals), tricky, temperamental etc. Then ta-da! The music review that makes me trembling, a bit just a bit really! The ending is damn terrifying yet fascinating while the opening theme is good and related to the theme of series.\\n\\n\r\nI enjoy watching the series both the frightening and moe scenes. I give rate 8.5! ꒰(@｀꒳´)꒱\\n\r\nPros:\\n\r\nUnique story\\n\r\nThe old-fashion and good details artwork\\n\r\nRemarkable music themes\\n\\n\r\nCons:\\n\r\nEpisodic story\\n\r\nUnrecognized terms\\n",
            "date": "2016-07-23T23:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 224818,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224818"
        },
        {
            "content": "This is an oddity. \r\nAt a glance it looks like it should be an amazing, melancholic story with gothic overtones. And it looks like the components are there - nice music, mystic stories, england in early 20th century.... except for some reason it doesn't work. At all. I finished the whole series and felt literally nothing. The events happen, sometimes they're clearly supposed to be dramatic, dark or fantastic, but they fail to deliver any impact properly. And I don't know why.\r\nDetailed breakdown below:\r\nStory: 5/10:\r\nThe story follows basic premise of finding and dealing with \"forbidden books\" which contain some secret knowledge which grant people strangeabilities. Usually there's a caveat involved. In a sense, it is somewhat similar to Mushishi except that instead of Mushi there are books. Most of the anime fail to follow any single theme, and the middle of it could've been watched in any order. The disappointing thing is... sometimes some possibly important events just... end. No conclusion. As if they wanted to pursue some story, but at the last moment decided \"nah, we're done. \" and wrapped it up quickly. This happens very often. They introduce some adversary, some sort of new book, and end the story at an inconclusive note, just pretty much declaring that the spisode is over. You see at the ending and see that there's a room for some sort of followup, or possible plot twist, or for some sort of continuation.... but it never happens. They just drop storylines without concluding them and never talk about the stories again. It is incredibly weird. \\n\\n\r\nArt: 6/10:\\n\r\nWell, few backgrounds look like they're processed photos. I'm not sure if they are actually processed photos, but they still kinda stand out and do not really match the art style of characters. On occasion there are art shifts, and in some of those occasions visuals look worse. I would say it is above average art, even though the characters could use a bit more detail.\\n\\n\r\nSound: 7/10: \\n\r\nThe ending theme is quite good, even though it is no \"Lilium\". There is nice melancholic music throughout the anime, but the thing is it somehow isn't harmonious with the actual story. This is the case where the music might be better than anime itself.\\n\\n\r\nCharacters: 5/10:\\n\r\nEverybody is odd and everything characters do is done half-heartedly. Dantalian herself, on occasion tries to act \"cute\" (not sure how to better put it), but it honestly looks forced and ab it out of place. Something is seriously wrong with acting in those series, although I'm not sure what exactly, and can't put my finger on it. I did like (at least, a bit) a certain character in a certain jacked which arrived only for a few episodes.... but that's about it.\\n\\n\r\nEnjoyment: 5/10:\\n\r\nI pretty much felt nothing while watching it. Wasn't impresed/fascinated with it, but also didn't hate. I suppose it means the title is okay?\\n\\n\r\nOverall: 5/10:\\n\\n\r\nIt is really, really, really, odd. There are many bits and pieces in this anime which suggest it was meant to be something astonishingly amazing. However, the pieces never play well together, so the amazing miracle doesn't happen. It is clearly supposed to be a drama, horror, horror, mystery... instead it looks like not very interesting slice of life movie. The conclusion doesn't help either. The beautiful ending theme hints at something dark, but the rest of the material doesn't deliver on the promise. Or something.\\n\\n\r\nSo, I can't really recommend it. You could check first few episodes, maybe?",
            "date": "2017-09-06T16:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 257024,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=257024"
        },
        {
            "content": "This was a decent anime, only thing that really got to me was that to use any powers of the book, you had to read like a whole paragraph. i mean by that time who ever is attacking you is going to attack you.... other than that the story itself was very interesting",
            "date": "2011-10-05T00:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 44877,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/172256.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Master7Zero",
                "username": "Master7Zero"
            },
            "url": "https://myanimelist.net/reviews.php?id=44877"
        },
        {
            "content": "So quite the under apreciated anime.\r\nThe Dark theme really suited well the athmosphere of the anime.\r\nStory wise , i felt like a bit rushed but was still motivating and still wanted to go to next episode.\r\nArt ,very well down, flows nicely in all of the anime, de dark colors help set the mod for the anime and Overall u can really fell dat grim atmosphere that the anime tries to pass.\r\nSound, really liked the opening, and in anime it was also very good.I didnt enjoyed the ending because dat is nightmarish bot the music and the video gave me the chills\r\nCharacter:Really like  Huey theman of all shores, he can shot, he can pilote he also has a grand variety of Knowledge\\n\r\nDalian wasnt such a great suprise since the first episode it was clear the type of characther she was the annoying one \\n\\n\r\nI like the series it keeps u hooked.\\n\\n\r\nOverall, if u want a anime with a darker theme this is a very good one , You should give a try",
            "date": "2017-08-09T13:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 255062,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4006839.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/danitao",
                "username": "danitao"
            },
            "url": "https://myanimelist.net/reviews.php?id=255062"
        },
        {
            "content": "Ignoring the tsundre loli female lead, the show was surprisingly good (relative to my expectations of it). It felt to me that she was that way for no obvious reason, and the development of the interpersonal relationship was somewhat weak. Call me old-school, but having aspects of characters simply for formulaic reasons and then not developing those aspects is a negative where I'm concerned. Also, it seemed like it was forced into 12 episodes when the storyline could have easily supported a 24-ep season. While there is a bit of the \"mission of the day\" feel to the show, there are also ongoing themes.\r\nHowever, themajor strike against the story is the lack of clarity around the ending. While it's not necessarily nonsensical, it seemed that there was a deeper interconnection between the various characters and their purposes for existence which is ill-captured in the truncated anime adaptation. Basically, at the end there are more loose threads than you could wave a stick at, to the point that I felt like I had watched some selected episodes from the first half of a show. \\n\\n\r\nStill, not a bad show, so I'll give it a well-earned 7. Add 1 if the art style really calls to you, because it is quite good quality.",
            "date": "2012-02-22T23:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 54549,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mindlink",
                "username": "mindlink"
            },
            "url": "https://myanimelist.net/reviews.php?id=54549"
        },
        {
            "content": "When I started watching Dantalian I was left speachless from the animation and the beauty of this anime...I thing it is a really good anime to watch. \r\n~Story~   9/10  \r\n The story is very interesting and it's a great match for this \"Old England\" themed anime. Although you know the most of the stuff that will happen, because every episode is like a motif, it is still pretty interesting to see diffrent character and diffrent situations.\r\n~Art~   10/10!!!!!\r\n Oh my God! Dantalian no Shoka is one of the most beautiful animated creations I have ever seen!\r\nEven if you are not keenby the story or anything, you should watch it just for the animation. It is stunning.\\n\\n\r\n~Sound~   10/10 \\n\r\n I thing both the Animation and the Music are beautiful. The opening is really really good, the background music gives you this old era feeling and the ending is pretty nice too.\\n\\n\r\n~Characters~   9/10 \\n\r\n I really liked the characters of Dantalian. I haven't seen a lot of anime to know the stereotypes and all, but I think that the characters of Dantalian no Shoka were all unique and likable.And the relationship between Dalian and Huey was developed perfectly (I just thought that they would turn it into a romance thing...thank godness they didn't).Oh...and Flam is such a great character with so little screentime...she is my favourite!!  \\n\\n\r\n~Enjoyment~   9/10 \\n\r\n I liked that series a lot! The whole setting, the characters, the music...ok the animation was something else.  Highly enjoyable series.\\n\\n\r\n~Overall~   9/10\\n\r\n Dantalian no Shoka is a great anime and I firmly believe that you sould watch it!! \\n\\n\\n\r\n*Thank you for reading my review ^^ I apologise for every mistake but english is not my mother tongue. Have an awsome day!! *\\n",
            "date": "2014-08-28T09:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 158245,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4001599.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Derels",
                "username": "Derels"
            },
            "url": "https://myanimelist.net/reviews.php?id=158245"
        }
    ],
    [
        {
            "content": "I really loved the whole concept of the show. The story has a gothic/historic feel to it and follows the journey of Huey and Dalion as they search for Phantom books and the dangers they face along the way. Overall I thought this was great series and it was very original. I highly recommend watching the series along with the ova.",
            "date": "2014-06-25T21:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 148653,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3735681.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LovelyKatie-chan",
                "username": "LovelyKatie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=148653"
        },
        {
            "content": "Sorry, but after watching very simple story \"Gosick\" I just CAN\"T STAND the voice of Dalian. This is so bad I don't want to watch this anime! Even if the plot is really interesting, I'm so discouraged to \"Dantalian no Shoka\" that I probably won't finish watching this anime.",
            "date": "2012-10-20T10:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 75411,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1219063.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yumi_Honey",
                "username": "Yumi_Honey"
            },
            "url": "https://myanimelist.net/reviews.php?id=75411"
        },
        {
            "content": "well From what I've seen so far the anime is Basically Gosick with a different cameo, now don't get me wrong. I'm enjoying it but I feel no difference in the story from Gosick to Dantalian. So far both anime start off with going to distant lands and meeting a loli with exceptional abilities that either of them have odd names of that are reminiscent of one another. The Vast wellspring of knowledge, Mystical Library of Dantalian (which is described as an archive of vast knowledge as well). I'll be sure to update this later if I see any changes but for now, Klox Worxseems to have rehashed Gosick in a nutshell.",
            "date": "2012-04-28T16:59:00+00:00",
            "helpful_count": 0,
            "mal_id": 59891,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1258297.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/xSanityControlx",
                "username": "xSanityControlx"
            },
            "url": "https://myanimelist.net/reviews.php?id=59891"
        },
        {
            "content": "I feel like this anime should have been longer. Things started to get pretty interesting plot wise in the last episode.\r\nThis anime combines two things that I love: a historical setting and books. The story is about Huey and Dalian as they go around collecting phantom books. Phantom books can be a variety of different types of books. They can make creatures from a book come to life, give a reader wisdom beyond their years, and anything in between. Some books are harmless while others can bring about distruction.\r\nI felt like the plot was a little too rush and not completely put together. It jumpedaround too much between a few episods and never really tied everything together at the end. For example, new characters were introduced during one episode and when they showed up again at the end it didn't really answer who they were or why they were there. The anime needed more episodes to resolve the plot in my opinion because it felt like it wanted to have an overall plot and not just a short story for each episode but nothing really came together in the end.\\n\\n\r\nThe music and art are georgous though! I could listen to the Opening and Ending songs all day. The only issue I had with the art was that the backgrounds sometimes were photographs/images and not animated. It feels out of place to me; not enough to completely take me out of a story but it is still a little annoying especially since the animated parts of this anime were so beautiful and actually drawing out the backgrounds would have been just as beautiful.\\n\\n\r\nOverall I did enjoy this anime and I hope that the story is able to continue with another season. I want to see what happens next!",
            "date": "2012-07-03T20:07:00+00:00",
            "helpful_count": 0,
            "mal_id": 65243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465966.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bluejay390",
                "username": "bluejay390"
            },
            "url": "https://myanimelist.net/reviews.php?id=65243"
        },
        {
            "content": "Here is what, I believe, anyone would say after watching this would... \r\nOh, okay. \r\nIt is sad to say such a great character such Dalian is present here but not much is revealed as to what she is. Actually that can be said about everything in this show, it needs a second season... or a 24 ep reboot to do it properly. As it would, in my opinion, be odd to go into a second season and just then have the episodes dedicated to introducing the characters adequately.\r\nEnjoyment is to be had here, but it is a shallow high.\r\nCharacters: \r\nThis series has a great, ohso great, gothic loli voiced by none other than Shinku from rozen maiden. It shows through but this voice is softer/less sharp, she is thoroughly enjoyable to listen to, and it ends there. Nothing is really revealed about her other than huey can plunge is hand into her chest and pull out books. There are other like her with their partners who also do similar things... but summing it up for everyone beyond Huey and Dalian is:\\n\\n\r\nWho the F*** are these people, and that only applies to the characters who stay alive, and to the next point.\\n\\n\r\nThe story:\\n\\n\r\nThis is why it needs more eps, there was no real story till the last ep and we were given but a taste. From the second to the second last episode we are throw throwaway characters that die within the episode they are introduced in other than 1 supporting female and 1 supporting male. The finale is interesting, but was nothing beyond that because it ended without so much as a whisper and a sigh of disappointment from your seat. \\n\\n\\n\r\nArt: \\n\\n\r\ngood, and leaving it at that is fine.\\n\\n\r\nSound:\\n\\n\r\nalso good.",
            "date": "2013-08-19T21:28:00+00:00",
            "helpful_count": 0,
            "mal_id": 110457,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/gezodiac",
                "username": "gezodiac"
            },
            "url": "https://myanimelist.net/reviews.php?id=110457"
        },
        {
            "content": "This show is, for the most part, successful in creating the mood it is going for.  I can’t really say much else in its favor.  This show is somewhat incomplete in character development and exposition.  The characters and the show carry an attitude of vague disinterest, which is likely to rub off on viewers.  In short, this show is boring.",
            "date": "2013-05-16T18:37:00+00:00",
            "helpful_count": 0,
            "mal_id": 97385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/639163.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/colonelpanic",
                "username": "colonelpanic"
            },
            "url": "https://myanimelist.net/reviews.php?id=97385"
        },
        {
            "content": "The Mystic Archives of Dantalian a.ka. Dantarian no Shoka was a fantastic but at times stressed watching. The story takes place in late Victorian era England right after WWI, but at times the technology is too modern, despite being supernatural and incorporating magic with science. The story begins with Hugh Anthony Disward, visting his dead uncle's estate to gain possesion of it. His uncle was a book collector with 90,000 and (coincedentally) 666 phantom books.There, he finds Dalian a \"Bibloprincess\" who can use \"Phantom Books\", which are books that contain forbidden knowledge. This is where the plot begins to show holes. It never actual tellsyou if the person uses magic and the book, or the book is purely magic itself. Why was there a child simply living on the estate? The following episodes all deal with phantom books, but the question is raised at to if these books are so secret and forbbiden why are they coincendentally keep finding themselves in these situations? The plots are extremley predictable and the story strives to show the wisdom of books but fails as it try to keep changing paces with traditional anime archtypes and genetic storylines. There is almost no character progressions and Dalian is a whiny little girl while Anthony is a overprotective father figure. The opening and ending theme song are actually very impressive, while the ending uses real people and perfectly illsustrates what the whole anime is trying to concieve. The ending perfectly fabricates the mystery and pecuilarness using black and white with gothic overtones. Fans of Black Butler will find something here with the victorian themed supernatural, light action series if they need a quick fix.",
            "date": "2012-02-12T09:17:00+00:00",
            "helpful_count": 0,
            "mal_id": 53731,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1143981.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zombie_che",
                "username": "zombie_che"
            },
            "url": "https://myanimelist.net/reviews.php?id=53731"
        }
    ]
]