[
    [
        {
            "content": "Story\r\nBetter than season 1, but still dismal.  I liked Yuki's post-traumatic stress behavior, which was the reason I gave this season a try.  It was a relief having her emotions at the forefront, instead of the previous season where she was constantly consoling the suicidal Zero.  I usually enjoy heroines in torment, but they didn't do much with it.  She continued obsessing over Zero and repeating the phrase, \"I cannot hurt Zero any more than this\" in her monotonous internal dialogues.  She also kept on chasing after Kaname, begging him to tell her about her past.  This dragged onWAY too long.  I can take only so many scenes of Yuki crying and pounding her fists against his chest while he goes, \"Yuuki,\" in his sad voice.  Unlike season 1, there was some buildup to the final events, the villain was decent, and there was some resolution.  However, the story was so boring and the characters' behavior so repetitive that by the climax, I just didn't care.\\n\\n\r\nArt\\n\r\nThe art was similar to season 1.  Decent, nothing special.  I was disappointed but not surprised by the cheesiness of the monsters and the lameness of the fight scenes.  One treat was how cute Chairman Kaien was once he let down his hair and took off his glasses.\\n\\n\r\nSound\\n\r\nAnother excellent soundtrack.  Just for the music, suffering through the two seasons was worthwhile.  I hate the intro, but the ending theme makes up for it.\\n\\n\r\nCharacter\\n\r\nYuki was unbearable.  She was as weak as ever, but much more intent on protecting everyone, even though she had ABSOLUTELY no capacity for doing so.  Watching her chase after the villain and put herself in danger was really irritating, especially because she endangered a lot of Kaname's lackeys in the process.  Kaname did improve somewhat; he was less opaque and we finally understood his attachment to Yuki.  Zero and Ichirou also gained some depth.  The twins may have been the most powerful, compelling plot element in the entire show.  \\n\\n\r\nEnjoyment\\n\r\nThey shouldn't have raised our expectations that Yuki would become strong if they weren't going to deliver.  They did nothing with her being the guardian.  If the main focus was the love triangle, then they should have put WAY more attention on developing the two relationships.  Yuki spent a lot of time with Kaname and Zero, but she didn't connect with Kaname until the end, and her scenes with Zero were just angsty melodrama.  I can't remember a single romantic scene in either season that I would rewatch, and I'm usually pretty enthusiastic about corny shoujo moments.\\n\\n\r\nOverall\\n\r\nI'm truly shocked by this show's popularity.",
            "date": "2009-06-19T23:30:00+00:00",
            "helpful_count": 145,
            "mal_id": 15907,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21756.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dorothea",
                "username": "Dorothea"
            },
            "url": "https://myanimelist.net/reviews.php?id=15907"
        },
        {
            "content": "First and foremost, I write from the perspective of a dissatisfied audience of Vampire Knight Guilty. It was due to my positive opinion of Vampire Knight that led to me to Vampire Knight Guilty and hence my judgement cannot make dichotomies of the two (so I hope you don't mind me making reference to Vampire Knight).\r\nAs you'll probably know, VKG continues right where VK left off, retaining much of VK's good qualities at first. The characters from VK/VKG are very well-built and generally three-dimensional enough for me as an audience to relate to and hence enjoy, with the exception of Kaname-kun, who was so perfectin his prestige, power and popularity that there was no room for him to be anything but an admirable and incomprehensible figure.\\n\\n\r\nThe artwork itself was generally quite well-done, although I felt the quality didn't follow through towards the end of VKG. In terms of sound, nothing stood out as being special but nevertheless, it complimented the plot and character developments.\\n\\n\r\nThe one thing that I really want to talk about is the storyline. The reason why VK was excellent in my opinion was its plot. The flow of the story introduces audience to a very different and intriguing world of vampires, and as you journey through the plot progression, mysteries of the world and its creatures unravels itself through introduction of new characters, philosophies and events, that spices up and quenches curiosity of the world whilst requiting the audience a greater interest in knowledge of vampires and their existence.\\n\\n\r\nAnd so VKG begins with this highly anticipated and built-up plot where most branches of side and main plots from VK was left wide open. However, as the story progresses in VKG, the pace of the story really dies down. Excluding a few snippets of fair back stories to some of the supporting characters, the main plot really felt mundane and hard to trudge through. \\n\\n\r\nDue to an overly pretentious overemphasis on subtle foreshadowing, the climax of VKG comes about in a very poor, but surprising way, which in its own was interesting. VKG was on a road to revival, bringing back the essences that made its preceder a success. Inevitably, due to lack of pacing in the story, VKG ran out of time to wrap up properly, failing to arrive at the respectable conclusion that VKG's climax opened up for. In all honesty, the conclusion simply felt rushed, as if the writers just ran out of time and whipped up a mediocre ending and forgot about all these other things.\\n\\n\r\nHaving enjoyed VK, it really was a pity that VKG did not follow through. VK felt like it created so much potential for VKG, who grabbed a single point of interest and neglected the rest of VK's successful elements. To sum VKG up, it centralises on one element of a good script, then patched a drawn-out and repetitive build up to its front and a short and undermined continuity to its back. \\n\\n\r\nIt was not bad, but the fact that it was a mere shadow of its former annoys me, and so I give it a 6/10 (it's simply my opinion). \\n\\n\r\nNevertheless, if you have seen VK, watch VKG with an open mind. (I don't take into account that I wasn't in it for a fanciful, mystical tale about pretty boys, which was part of what VK/VKG was marketed to be.)",
            "date": "2009-02-23T07:58:00+00:00",
            "helpful_count": 132,
            "mal_id": 12688,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46320.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/YuYu",
                "username": "YuYu"
            },
            "url": "https://myanimelist.net/reviews.php?id=12688"
        },
        {
            "content": "Note: Vampire Knight Guilty is a direct continuation of Vampire Knight more so than a sequel, so it is necessary to watch Vampire Knight first to truly understand Vampire Knight Guilty.  This review is only based on Vampire Knight Guilty.\r\nStory:  Vampire Knight Guilty is very much a traditional shoujo series about forbidden love.  However, through the inclusion of vampires, the series takes on a bit more of a gothic feel which is heavily relied on to hold the viewer's interest.  The story is mainly told from the point of view from the female protagonist, Yuuki, and her inner turmoil about herpast and her feelings about the two male main characters, a vampire Kaname and a vampire hunter Zero, are the main driving forces behind the story.  The story is also sometimes told from a third-person perspective, allowing the viewer to know details that Yuuki does not.  While the story in itself is quite good and probably one of the best gothic romance animes out there, due to the switching of perspectives, the plot pacing can sometimes feel excruciatingly slow and often very repetitive.  Yuuki continuously tries to tackle the same issues internally episode after episode to the point where it becomes very redundant; the actual story moves along much better when it is not dwelling on Yuuki's thoughts.   This also creates a conflict in the main point of the story, since it sometimes emphasizes the mystery shrouding Yuuki and the other main characters and other times seems to try to hold the viewer solely by building up (almost uneccessary) romantic tension to keep the viewer watching to see which character Yuuki will end up with.\\n\\n\r\nShort version: The story is conflicted in a way that it sometimes tries to be a mystery/suspense anime and other times simply a gothic shoujo/romance.  7/10\\n\\n\\n\r\nArt:  The main character designs are lovely for shoujo and done very well' some character features are a bit too over-exaggerated (Yuuki's eyes being one example), but this kind of character design is fairly normal for the shoujo genre. The background is also illustrated nicely and gives off a bit of an eerie feeling to lend to the gothic mood the anime is trying to create.  However, sometimes there are inconsistencies in the animation, many still frames, and skimping out on the details of background characters.  For the most part, this can be overlooked because the actual art direction is done very well, showing the right images at the right times.  Someone with a scruitinizing eye will definitely pick up on the flaws, but a casual viewer probably won't.  One flaw of sorts that almost any viewer would immediately pick out is the rather boring ending sequence that looks like it was thrown together in five minutes.\\n\\n\r\nShore version: Nice shoujo character designs and animation, but definitely not the best out there.  8/10\\n\\n\\n\r\nSound:  This is where Vampire Knight Guilty excels.  Although the opening song is nice, but nothing to rave over, the ending song by Wakeshima Kanon is excellent and really gives the series an extra nudge into the gothic genre.  The sound effects are also nicely done, as well as the background music which also gives the anime a rather eerie feeling, reminding you that you are watching something a bit darker than your average shoujo romance.  The voice acting overall is great, but it is Miyano Mamoru (Best Actor in the Seiyuu Awards of 2008 for Setsuna from Gundam 00) that really does an outstanding job by voicing two charcters, twins, and giving them their own distinct nuances.  Really excellent work.  10/10\\n\\n\\n\r\nCharacter: The main characters are all round, very well-developed characters (although their development severely slows the plot).  The anime almost forces you to get into the heads and try to exerience and feel the emotions of certain characters, particularly in Yuuki's case, while leavin other characters in an air of mystery.  You wouldn't be able to miss an instant of what Yuuki's thoughts and emotions are even if you tried.  On the other hand, not everything is given to you on a silver platter, other characters remain much more mysterious and it is up to the viewer to try to unravel the mystery behind those characters themselves.  It's a very stark contrast, but it works very well for the series.  10/10\\n\\n\\n\r\nEnjoyment:  If you are looking for a shoujo anime overflowing with romance, this show will definitely hook you.  It is filled with forbidden love, love-triangles, anguish, angst, unrequited love... just about any element you can think of that fits into the genre.  However it is unique in its dark atmosphere.  If you are looking for a shoujo anime and like the added bonus of a gothic edge and a bit of mystery, this is definitely the show to watch and would get a 10/10 in that regard.  On the other hand, if you are looking for something that is more solely along the lines of suspense or supernatural  without all the angsty romantic flare, give this one a pass.\\n\\n\\n\r\nOverall:  An enjoyable, well-animated and produced show that definitely stands out in the shoujo genre as something a bit more unique than others.  The added gothic edge and use of mystery will hook the lovers of the shoujo genre even more and probably pick up other casual viewers as well, since overall the show is better than your run-of-the-mill anime love story.  9/10   But, if you aren't a fan of the shoujo genre in the slightest and not interested in romance animes, you will want to give this one a pass.  Although the show does contain a bit of mystery, suspense, and vampires, the main emphasis is undoubtedly romance, and there is no way to disregard that shoujo romantic factor in this anime to just enjoy it for the mystery and suspense it contains.",
            "date": "2008-11-23T06:03:00+00:00",
            "helpful_count": 87,
            "mal_id": 9774,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/killbethy",
                "username": "killbethy"
            },
            "url": "https://myanimelist.net/reviews.php?id=9774"
        },
        {
            "content": "If you enjoyed Vampire Knight, you'll enjoy Vampire Knight Guilty. Mostly because it is the continuation of Vampire Knight, but also because it's more developed than Vampire Knight and contains a better story. It's not that I didn't like the story to Vampire Knight, but that I like the story to Vampire Knight Guilty better. \r\nStory: You know, the story here it's good. And I have told you that I liked the VKG (Vampire Knight Guilty) better than VK (Vampire Knight) It's, I find, very well thought-out. Like any other anime that is based on a manga, it follows the manga, though not always thesame. (It is in this case, but anyways.) The main subject really is about a love that can't happen; in this case between humans and vampires, friend and friend's enemy. Well, really, it's Zero and Yuuki, or Yuuki and Kaname, as the way I see it. It doesn't drag on like some of the animes I've watched, which usually makes the viewer get bored of the series and looses interest in the anime/manga. That has happened to me millions of times, but because this one gets to the point, or, just a lot of things happen in just a short while, and everytime we get to a better and better plot. That is one of the things you'll definitely like about VKG.\\n\\n\r\nArt: I find the guys have a bit of a feminine feature to them; particularly their eyes, which are basically just a smaller version of a female's, and the small curve when they wear their uniforms. Their faces are very.. pointy, may I say, at the end and actually just gives me a feminine vibe. Their hair is usually long, though some of them are shorter but is long, like most of manga guys. Most, not all, because some of them actually have short hair, like Naruto. But in this case, Zero, Kaname, Shiki, Ichijou, and a lot of other people have longer hair than usual. I find the eyes to the girls, which are what I find an enlarged version of the males', are a bit haunting. They have that weird impression, and it gives you the feeling that there really are vampires in this world. It just suits the main subject of this story; vampires. \\n\\n\r\nSound: It's good, I guess. I'm not one to judge about sound; but I find the openings and endings do fit the series, however. Also about the voices, it's okay. I don't really care about the voices, as long as they actually make sense, but I doubt someone will make an anime with voices that don't make sense.\\n\\n\r\nCharacter: This is where I'll rant. I don't like Yuuki's character. She's too innocent. And every guy seems to just want to flirt with her or something. Kaname loves her, in some way, and Zero; and if you notice, in one point of the story, Hanabusa is quite the flirt, too. It just seems that it's unfair to the other girls in the Night Class, plus the Day Class students. (But I don't really care about the Day Class students because they aren't REALLY critical to the story,) I'm not saying that they all love her the way Kaname and Zero like her, but everyone in the Night Class, males I mean, have a particular liking to her. They either want something to do with her, or regularly talk to her. Like, I'm not saying Akatsuki Kain wants to get married with her. I'm just saying that they have a particular liking to her. I'm glad Shiki isn't really, or actually not at all, having a liking to Yuuki. The girls in the Night Class are pretty well-made, too. Rima's character is my particular favourite, since she's mysterious and she's cute at the same time. Ruka is a strong girl, I know it, even though I dislike her... but only a bit.\\n\\n\r\nEnjoyment: I enjoy everything I see, really. If I don't like it, I'm not really going to watch it. That's the kind of person I am. Don't like it, don't care about it. I'm not going to review, or something else.\\n\r\nOther than that, I enjoy watching this anime 'cause it keeps catching my attention. It doesn't drag on, like I have said before, and keeps my interest in place.\\n\\n\r\nOverall: Yeah, it's great.",
            "date": "2008-11-25T16:45:00+00:00",
            "helpful_count": 34,
            "mal_id": 9844,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/114594.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/REVERIEExx",
                "username": "REVERIEExx"
            },
            "url": "https://myanimelist.net/reviews.php?id=9844"
        },
        {
            "content": "*SPOILER WARNING*\r\nWhat started out as a very good continuation of season one, and loyal companion to the manga (which I am sad to say, I did not know, too the exact same turn as transcribed here) ended up being a major disappointment in the way of a Shoujo anime. I don't normally affiliate with the genre, and this series reminded me why. The abrupt ending of Zero's affection for Yuuki given the circumstances involving her having been a pure blood vampire this entire time was nothing short of a kick in the teeth. To watch 26 full episodes of them going back and forth witheach other in one of the most twisted and abusive love triangles I have ever seen, only to find in the end because Yuuki was never who Zero thought she was he can no longer love her?\\n\r\nAdmittedly there is some bias to my words. I preferred Zero over Kaname only because the latter of the two was a self absorbed prick who's soul intent was roughly the same as Zero's later on in the series. I don't really feel that the story for both the manga and the anime were all that in depth as so many things could have been done to prevent the overall conclusion, everything just seemed to happen because one vampire wanted to be strong. For some reason, however, no one ever thought to band up and kill him all at the same time? And why exactly did he need to drink Yuuki's blood?\\n\r\nOverall, a very bad series that sadly had great potential.",
            "date": "2009-05-28T01:31:00+00:00",
            "helpful_count": 28,
            "mal_id": 15339,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66068.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kigeko",
                "username": "Kigeko"
            },
            "url": "https://myanimelist.net/reviews.php?id=15339"
        },
        {
            "content": "I was so excited when I learned they had made a second season but was greatly disappointed when I watched it. It varies from the manga too far. They fail to introduce an important character, that triggers a major scene with Yuki having to finally confront her feelings.\r\nPlus if you were looking forward to the big battle with the big bad uncle, prepare yourself, it bit! It was over in 2.5 seconds and Kaname is the major player instead of Yuki! It was total garbage and I wish they had just waited for the manga so the full 13 episodes could have been exact. Coursethat doesn't explain the earlier change to me.\\n\r\nIF IT AIN'T BROKE DON'T TRY TO FIX IT!",
            "date": "2009-09-06T21:42:00+00:00",
            "helpful_count": 20,
            "mal_id": 18477,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/32539.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Kuran_Yuki",
                "username": "Kuran_Yuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=18477"
        },
        {
            "content": "NOTE: I have not read the manga so my view on this anime may differ slighlty from those who have.\r\nVampire knight guilty is a continuation of the original series Vampire Knight. The series is set in a school that caters to both vampires and humans that are separated into the night and day classes respectively. The story revolves around a girl whose first memories she can remember is being attacked by a vampire and being saved by a pureblood vampire which is the highest rank. She starts to harbour feelings for both her good friend and vampire hunter Zero as well as the pureblood whosaved her which is currently in the school.\\n\\n\r\nI think the story was quite original from the usual vampires and stuff. Incorporating the shuojo genre very well. That is probably the main genre of ths series. Coupled with a bit of action here and there, suspense, drama and mystery to create a fairly good series. There are good twists in the show and the story is not so cliche in terms of the relationships between characters. However, the show can be rather dark at times, so if you prefer something more lightheated,comedic than prehaps this won't be the best choice of anime for you. Plot wise it may be a bit cliche, and don't expect heavy suspense or drama.\\n\\n\r\nThe art incorporates the typical shuojo style of drawing characters with big eyes and bishiounen(pretty boys). not necessarily the best i've seen but still of a decent quality.The background is mostly dull to help enhance the dark theme in tisi show. \\n\\n\r\nThe voice actors did a good job. Each voice fitting the characters perfectly. The OP and ED songs contribute to the gothic theme of the show. background music now and then also helps to enhance the atmosphere. But yet again, i would not say it was top-notch, there are better animes than this in the sound department.\\n\\n\r\nThe characters was what i was quite impressed in. Because they actually managed to cover a wide range of characters in the short span of 13 episodes. Of course some getting more depth and coverage than others but still the depth of each character can be seen clearly.\\n\\n\r\nI enjoyed the series as a romance fan though i think the ending was not to my liking. Some of you will probably be disappointed with the ending as well so be prepared.This series is definitely better than the first. Having more action, more interaction between characters and more twists. I would say it is the best vampire-romance anime i have seen. So those of you who are considering whether the secod season is worth watching, i'd say give it a shot.",
            "date": "2009-01-14T08:33:00+00:00",
            "helpful_count": 13,
            "mal_id": 11475,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65596.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ethann",
                "username": "ethann"
            },
            "url": "https://myanimelist.net/reviews.php?id=11475"
        },
        {
            "content": "[No Spoilers at all]\r\nVampire Knight Guilty is a continuation of the anime Vampire Knight, and that is all it is. It is not its own series, and it is rather unwatchable without watching the primary series.\r\nAs for the anime itself, it is absolutely one of the superior ones out there. The plot is exceptional and it has an inimitable outlook on vampires. Each episode ends with a cliffhanger making you fancy to gaze at the next one in the series without delay. Although there is awfully minute action, the drama is what keeps you going, so if you want an adventure shounen where the maincharacter progresses physically, go off and watch cartoon network.\\n",
            "date": "2008-11-14T14:24:00+00:00",
            "helpful_count": 12,
            "mal_id": 9473,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46688.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HardToName",
                "username": "HardToName"
            },
            "url": "https://myanimelist.net/reviews.php?id=9473"
        },
        {
            "content": "Usually 2nd season is worse than the 1st one. However, this does not apply to Vampire Knight Guilty. Almost in every category VKG was better than VK. The only thing I liked more in 1st season was OST. Music was good in VKG too, but not as fitting the mood of the story as the VK one.\r\nWhat was 1st season lacking the most, was not enough character introduction in my opinion. I was rather disappointed that only Zero's past was showed and explained while Kaname's and Yuuki's was left unknown. After watching VKG I can understand why didn't show their past in VK. It doesmake sense and it was a good decision.  \\n\\n\r\nSo yeah, we finally got to see their pasts, which also lead to see some better character development as well. If Yuuki was rather annoying and useless in VK, then in VKG she changed almost completely. At the beginning she still wasn't very contributing and as always Zero, Kaname or other Vampires had to take care of her, but she start to grow as a character in my eyes. Of course, that sudden event changed a lot, but she was already getting stronger before it.\\n\\n\r\nOn the other hand, I wasn't really expecting to see Kaname's true colors, but surprisingly we did get to see that. I thought he will be used as a mysterious character till the end, but here we got his past, we know why he's so caring about Yuuki and what are his future plans. I believe it was really well done, good timing I mean to do it. It was definitely shocking... I found his past even more harsh than what Zero had. No wonder Kaname was always so distant from everyone.\\n\\n\r\nVampire Knight Guilty in my eyes were already better when introduced antagonist early in the show instead of at last episodes like in VK. Although I wish he had more screen time. He did get more than enough screen time in the flashbacks, but a bit disappointing how short we got to see him in action during the current time. Yet, I am not really complaining about this as usually fights that take long are just irritating... I am not really fond of shows who drag fights, so I was rather happy how everything happened in VKG.\\n\\n\r\nAs I have already mentioned, the music wasn't as good as in Vampire Knight. However, I am not gonna lie, it was still very good. I gave 9/10 and only not a 10, because I know that it could have been better (VK as example). The whole OST was playing the right mood that characters of the series contained, so that was a great addition to the series.\\n\\n\r\nTo sum up, the VKG has definitely exceeded my expectations. I can honestly say that it's the first shoujo anime to me that was able to include some mystery and supernatural genre's very well. Another great thing about this anime is that it was unpredictable. Till the very end wasn't sure who will Yuuki choose if she will choose that is.\\n\\n\r\nWhether it was helpful or not, please do not hesitate and give me feedback ^^ I do want to improve writing reviews. Thank you for reading!",
            "date": "2013-06-15T10:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 101151,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/478082.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ovyda",
                "username": "Ovyda"
            },
            "url": "https://myanimelist.net/reviews.php?id=101151"
        },
        {
            "content": "I really got into this anime, loved the characters and the world created, but all hopes and dreams smashed with the ending! I don't need a happy skipping into the sunset ending, but after seeing this anime I was not only disappointed but scratching my head (spoiler: A school for human vampire coexistence, but neither interacts with the other nor even knows they are vampires, AND Zero goes through this whole experience just to decide to kill all the vampires???). \r\nMy hope is that the love story is completely dropped (even though the scythe weapon of Yuki's is really cool) and Zero gets his ownanime and manga, because the Bloody Rose gun is an awesome weapon and he's got a great background for his future of hunting down vampires.  I wish that this anime was only included as flashbacks for Zero the Vampire Hunter and not an anime all by itself.",
            "date": "2009-04-04T18:36:00+00:00",
            "helpful_count": 11,
            "mal_id": 13842,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/166682.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 2,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tacyttik17",
                "username": "tacyttik17"
            },
            "url": "https://myanimelist.net/reviews.php?id=13842"
        },
        {
            "content": "Having recovered from the injuries he had sustained, Zero returns to Cross Academy to resume his role as prefect. Though, not long after he resumes his role, members of the Supreme Vampire Council ambush Zero with the intent to execute him for the murder of the pureblood, Shizuka. Luckily when Kaname intervenes, he sends the council away and insists that they stay out of school affairs. However, whilst Kaname continues to hide the truth about Shizuka's death, there are others who grow suspicious of what happened that night and what the dorm president is hiding. Meanwhile, Yuuki begins to have flashbacks, leading her to investigateher blood-stained past: what will she find, and will she continue to be tempted by an offer from Kaname?\\n\\n\r\nNow on to the review and I hope you and enjoy reading this review and I hope it helps you's in anyway. Aha, late to the party I know. Anyways, lets get started:\\n\\n\r\nStory (7/10) \\n\r\nBuilt upon a sturdy foundation of shoujo clichés and pretty animation, Vampire Knight Guilty is a lot of fun without being particularly elegant. Moreover, as the second instalment in a successful dark shoujo series, it brings the story of mysterious vampires and tragic love to an agreeable conclusion.\\n\\n\r\nFor most, VKG’s main attraction will always be its contrivances, clichés, and ham-handed delivery of the romance. Consider the corniest scene involving vampires possible (OMG he licked her neck! *squeal*), then set it to repeat across several episodes. Throw in hints of homoeroticism for extra tang and some half-baked lore, and VKG gives the impression that it’s not so much animated as churned. Indeed, the series makes no claim to originality or wit, but it manages its cheese surprisingly well, and, on balance, turns out to be more interesting than irksome.\\n\\n\r\nNevertheless, buried amongst all the silly love triangle stuff, there’s still that core of well-executed mystery keeping the story afloat. Crucially, VKG knits together much of the political threads left hanging by the first season: after lurking in the shadows so long, the Vampire Council finally takes centre stage, as does a newly kick-arse Headmaster Cross, and Kaname’s true intentions become clear in a gasp-worthy twist.\\n\\n\r\nOne true disappointment, however, is that, despite wishing to portray a violent clash between the various factions, VKG’s battles look and feel anything but. The static sequences are usually over before they’ve begun, and attempts at spicing things up with flashy gimmicks just look forced. Even the finale can’t escape this flat-lining of tension as everything generally happens too fast and too easily.\\n\\n\r\nAs a final note, ardent fans of the manga should brace themselves for a slight but significant reinterpretation of Zero at the end. No doubt, it will send a few spitting in rage.\\n\\n\r\nArt (7/10)\\n\r\nLike Vampire Knight, VKG looks very pretty, with lush colours and attractive character designs perfectly catered towards the shoujo lovers. Regrettably, it also adopts VK’s disregard for movement. While VK is predominantly drama-based, VKG relies on fighting sequences during some of its climactic moments; the insufficient number of frames, straightforward camera angles, and uninventive choreography, therefore, only lessen their impact.\\n\\n\r\nSound (7/10)\\n\r\nThe cheap pop opening and closing themes add nothing to VKG’s charm. The score, on the other hand, though mostly generic (aimless tinkering on a piano, queer string instrumentals, that kind of thing), still holds one or two surprises. The most useful additions include the sound effects subtly used to heighten the spooky ambience; for example, the sudden rush of cymbals during particularly tense exchanges goes a little way to enrich the viewing experience.\\n\\n\r\nCharacters (6/10)\\n\r\nWith fewer comedic scenes to add colour to Yuuki’s personality, the effects of her clueless vulnerability and passive nature leap from uninspiring to outright disgusting. Taking the initiative and driving the story on her own merits is certainly beyond her as she stutters and sighs her way through every conversation. Most irritatingly, she’s the kind of contradictory character who speaks of saving others whilst constantly needing protection herself.\\n\\n\r\nAs such, providing entertainment falls to Kaname and Zero. While Kaname wields his mysteriousness like an expert by throwing a dark and truly unexpected spanner in the works, Zero escalates his catalogue moping (seemingly, just because he can). Neither ventures from his archetypal pigeon hole, but both remain engaging, nonetheless, because of their anguished backgrounds.\\n\\n\r\nThe other good news is that Kaname’s previously nameless hangers-on get fleshed out and become more relevant to the plot. In particular, I find the exploration of Aidou’s friendship with Kaname to be an interesting addition to the character development.\\n\\n\r\nOverall (7/10)\\n\r\nVKG will prove the perfect fix for fans addicted to a sugary diet of bishies, immature angst, and romanticised horror themes; competent central mystery aside, those elements are its forte. For anyone looking for substance and/or action, however, the show will leave a distinct ‘Is that it?’ feeling as anticlimactic fight scenes and an insipid cast dog the plot. On the whole, VKG may not feel as fresh and exciting as its predecessor, but it remains at all times a fun and easy romp to follow.",
            "date": "2012-07-25T04:17:00+00:00",
            "helpful_count": 9,
            "mal_id": 67675,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1399949.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DeSwitch",
                "username": "DeSwitch"
            },
            "url": "https://myanimelist.net/reviews.php?id=67675"
        },
        {
            "content": "to describe this season in 1 word it would be, disapointing,\r\n what really made the first season work for me was it had some amazing suspense, great cliffhangers and had a lot of twists, and even for how steriotypicaly emo zero was they handles him very well and he came off like a selfless teen that was willing to let him suffer and even die a slow painful death if he had to, to save yuuki or his father and even just people in general, and his hatred for vampires and yet him being one realy built up his charecter, why am i mentioning this,well i mentioning it cause zero is hardly even in the second season, and heres where the show starts to take a sudden downturn\\n\\n\r\nthis seaosn focused very much on kaname and yuuki, and befor ei go off i have to mention this, this show has the absoulte WORST TWIST EVER, you wont see it coming but when they reveal what it is and what they continue to do after words is just WTF worthy, but back on topic the show focuses much more kaname and yuuki, now this would of been the chance to make kaname more likable caus ein the first serise he is a total asshole that steals the spotlight and acts very high and mighty, basicly hes a asshole and the first time i saw guilty i though he was the villian cause they make him much much worse, he does some dasterdly things and he just come soff as evil till the very end and even then he still seems like he'd fuck over everyone for his own goal, which is protecting yuuki but his logic is \"ill kill everything but yuuki\" so yah kaname may have somehow become even more worse, yuuki isnt any different from the first serise at all\\n\\n\r\nand heres the biggets problem with guilty, theres no suspense, every build up leads to a let-down, a cop out, or they just drop the plot point all together, they build up this one villian who lasts about 20 seconds of fighting, i wish i were kidding, the show just doesnt have any good cliffhangers either and for a lack of a better word its just boring, not to sound like a fanboy/girl but when zeor comes in the show does get better, mainly cause some very emotional things happen and you want this guy to get what he wants but he has everyone int he world agianst him, ide say if it werent for scenes of zero and his brother the sow would have been a 4, \\n\\n\r\nthe actual ending does leave not really a cliffhanger but leaves alot of things open for the inevitable season 3, its a good ending and i want to see what happens next the ending fight is a letdown but the actual ending while not satisfying will leave you wondering what happens next, the next season really needs to work on making yuuki less of a idiot, make kaname stop doing worse things the actual villians do then season 3 wil lbe good. fingers crosse dit will work out\\n\\n\r\nalso before i leave i just have to comment on how dated and lazy this shows animaiton is, it seriously looks like its from 2003, whenever animaiton gets good it lasts for about 4 seconds then back to outdated animation, they need to fix that aswell",
            "date": "2011-06-09T19:16:00+00:00",
            "helpful_count": 9,
            "mal_id": 37712,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/486384.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ItsSoPringles",
                "username": "ItsSoPringles"
            },
            "url": "https://myanimelist.net/reviews.php?id=37712"
        },
        {
            "content": "I began watching the first season, and didn't think the story was very good in the first place--I never really knew what was going on, and overall it kinda sucked. But that is nothing compared to the second season, Vampire Knight Guilty.\r\nI must say, I expected this to get better, but it actually got appallingly worse. I tried to be fair with it, but when I look at it overall, it was just awful. The story barely made sense, the characters didn't have any development, and even if they did, it was really difficult to notice. It seems the creators got lost in trying tocreate something ambiguous, and 'cool' and misplaced the actual plot.\\n\\n\r\nAll of the minor characters seemed to want bigger parts, but, (for some reason) couldn't seem to 'budge their way in' going by the strange relationship with Yuki, Kaname, and Zero taking up a lot of the confusing screen time, and ended up getting written off. Multiple random things happened this season, including a kind of 'boss vampire' who barely fit in with the plot either, brought to you by one of the minor characters who can't seem the squeeze their way into the story whatsoever. All in all, there was no reason for the minor characters--the setup would've been more plausible if the 'boss vampire' came out from under the love-triangle and Kaname and Zero just punched it and went back to bickering. \\n\\n\r\nI say, if you wanna watch this anime for a laugh, by all means--I did. But don't watch the second season. The ending was disappointing and, frankly, tortuous. It's a wonder I got through it at all.",
            "date": "2015-03-21T19:33:00+00:00",
            "helpful_count": 9,
            "mal_id": 182998,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3471075.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/sokkas-boomerang",
                "username": "sokkas-boomerang"
            },
            "url": "https://myanimelist.net/reviews.php?id=182998"
        },
        {
            "content": "Vampire Knight: Guilty is the sequel of Vampire Knight.\r\nSomehow the story focuses more on Yuki and Kaname's past and how Zero struggles into turning a Level-E vampire. Yuki finally becomes a vampire and it is reveal that Kaname and Yuki are siblings.Rido Kuran shows up in this story and is the main antagonist for this season.\r\nSomehow the art is Amazing as ever! You can feel the not-so-typical shoujo atmosphere in it. And somehow, The art reminds me of Uragiri wa Boku no Namae wo Shitteiru. Yuki becomes more mature and you can see her resemblance to her beautiful mother Juri.\r\nThe story left as a cliffhangerin the end and I totally don't like it that much...If you don't like the ending I recommend you to read manga for better unerstanding!\\n\\n\r\nThe characters didn't annoy me at all in fact all of them are useful and has roles to play. I love the fight between Ruka and Aido cause It somehow provides the comedic enjoyment of this story.\\n\\n\r\nOverall I give Seven (7) for this anime, cause it didn't satisfy me at all. I recommend people to read the manga for better knowledge.",
            "date": "2012-06-30T00:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 64841,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1228745.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dawnkresher",
                "username": "dawnkresher"
            },
            "url": "https://myanimelist.net/reviews.php?id=64841"
        },
        {
            "content": "Vampire Knight : Guilty is one of those series that makes me want to stop watching deep animes and stick to silly romance animes where the ending is always happy. The first season was awesome, but the part 2 was a let down.\r\n[spoilers]\r\nWhat is the point for the ending? The ENTIRE series revolved around a certain goal. The school, the teachers, the bonds, the story itself had the same goal. Yet with the ending given, It completely makes no sense. 10 hours of episodes spent focusing on one goal, co-existence amongst all groups, yet zero's actions at the end doesn't do anything for that goal.\r\nTheentire series filled me with a sense of suspense and anticipation on what was to come. Could have been rated really high, but IMO the ending destroyed EVERYTHING that the series worked for.",
            "date": "2009-11-15T03:37:00+00:00",
            "helpful_count": 6,
            "mal_id": 20561,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/woodyfly",
                "username": "woodyfly"
            },
            "url": "https://myanimelist.net/reviews.php?id=20561"
        },
        {
            "content": "First this anime disappointed me because of the ridiculous ending. \r\nStory: 5\r\nI liked the story more than VK because it has stronger plot and darker atmosphere but still I don't think it's the best it could be more interesting. \r\nArt and sound: 8\r\nArt and sound are the best thing about this anime because they make me continue watching this anime. All characters were drawn perfect. Kaname,Zero and Aidou... Anime opening and ending was chosen perfect too because they reflect anime's gothic atmosphere well.\r\nCharacter: 6 (just for you Aidou)\r\nMy favorite character is Rima but don't ask me why because i don't know too i just reallyliked her. Okay the main girl Yuuki... I hate this girl so much! I know there are so much silly, weak female characters in shoujos but this girl is the weakest and silliest and i think there is no one likes her. Kaname, I have a love and hate relationship with him. Sometimes I died because of his beauty and his character but sometimes i really hated him. Zero, I loved this guy but he's not my best ,sorrynotsorry, I ship him with Kaname (yes Yuuki, you're not the one i ship with zero or kaname. You don't deserve these guys) Uh and at the end I literally had a heartbreak because of Zero. I've never wanted him to be sad and seeing him sad... Last but not least my cinnamon roll Aidou-senpai. He is the cutest of them all. Hahaha while watching the anime i was like the Day Class' girls. Aidou-senpai plz notice me !\\n\\n\r\nEnjoyment :6\\n\r\n I didn't say good things so much but i can't deny I like the anime until the last 1-2 episodes. Trust me this anime isn't boring.I watched the whole season in a day. \\n\\n\r\nOverall I liked the anime but Yuuki and the last episodes made me so angry.",
            "date": "2016-09-13T06:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 228953,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5532789.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/winterella",
                "username": "winterella"
            },
            "url": "https://myanimelist.net/reviews.php?id=228953"
        },
        {
            "content": "I thought the first series was pretty bad, but tolerable. The first half of this series was so bad that I wished I hadn't even watched any of it. I managed to push through to the big reveal (no spoilers in this review, sorry guys!), which managed to interest me enough to keep going. After all, the only reason I kept watching this in the first place was because of Zero, who I love for a myriad of reasons, even if he isn't written all that well. More on that in the character section. \r\nTo begin with, the story: Vampire Knight Guilty was a directcontinuation of the first series, Vampire Knight, though it was a pretty bad sequel in my opinion. The plot was bland and slow and nobody's motivations or goals were correctly explained. What were supposed to be plot twists just ended up confusing me and in all honesty, it made me feel horribly bored and irritated. \\n\\n\r\nThe art was tolerable. It wasn't very pretty (I personally hate the whole bug eyes trope for heroines) but it served its purpose. The backgrounds were drab and uninteresting and the colors were all dull and blended too much for me to focus well. The drawings seemed like they were barely even outlined, and the animation was choppy and a little unnatural. The body structures of the characters were unrealistic and angular and just most things about the art didn't sit right with me. \\n\\n\r\nThe sound was surprisingly alright. The opening and closing themes were gothic enough to fit the setting. I actually really liked the creepy feel of the closing theme. \\n\\n\r\nThe characters were kind of a mess. They tried to portray Kaname as some sort of evil mastermind like Ciel Phantomhive, Kyoya Ootori, L Lawliet, Light Yagami, or Lelouch Lamperouge, perhaps (wow, look at the alliteration... so many L's...), but nothing in his plan clicked or made any sense. His ideas of making people 'pawns' just seemed to be their natural actions and his motivations weren't clear either. Besides that, Yuki is always on my nerves. She claims to be strong but can't do anything herself and continuously gets into the worst of situations. There's nothing wrong with being weak-- after all, it's a very human trait, and it's very natural that a main character may be weak. My problem is with her attitude and how her weakness doesn't seem to make any sense in regards to her position and what she's expected to do. There's so many plot holes I really can't enjoy this. Zero, however was the only one I could tolerate (alone with Aido, just because he was funny :D) This was partly because I adore Vic, Zero's English voice actor. It was also because that in a world of screwed up people, he's the only one with even a silver of common sense, even if he's stupidly violent half the time. \\n\\n\r\nAnyways, I didn't really enjoy watching a lot of this. I just finished because I have this weird obsession with finishing everything I start. \\n\\n\r\nI would recommend this if you: like brocon, like heroines with no character, like love triangles, like heroines that are 'special' for some random reason, liked vampire knight\\n\\n\r\nI would NOT recommend this if you: are not into incest, like characters with real motivations, want a real plot, wanted something actually dark, did not like vampire knight\\n\\n\r\nI'm a little disappointed on who Yuki ends up with at the end of the show, but after some research apparently she ends up with the other guy in the manga, so I'm happy now. Still no spoilers, research for yourself :D \\n\\n\r\nHave a great day everyone!\\n\\n",
            "date": "2018-04-25T16:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 279009,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875883.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LeaOotori",
                "username": "LeaOotori"
            },
            "url": "https://myanimelist.net/reviews.php?id=279009"
        },
        {
            "content": "Allow me to begin by admitting that I thoroughly enjoyed Vampire Knight Guilty and its predecessor. In admitting this, I am also saying that my rating is incredibly biased. \r\nI was on the hedge when it came to Vampire Knight Guilty, more so than I was with the original series. Most of us can agree that sequels rarely live up to the original. In many cases, the original series is meant to establish characters, relations, and a foundation for the overarching plot. Sequels, then, are supposed to consist of the meat of the story. They are supposed to clear up all issues, ties up looseends, and leave the viewer satisfied at the end of the day. Unfortunately, this concept isn't always followed. Instead, a number of sequels are made to continue sucking revenue out of an already popular show. \\n\\n\r\nThis leads to that annoying filler we all know and hate. In series that air extensively, the filler can sometimes last entire arcs, for the dual purposes of lining pockets with greenbacks and to continue an anime with an on-going manga counterpart. \\n\\n\r\nBut this isn't new to many of us. We know and loathe the process, as it turns otherwise great shows into absolute travesties that we wish to never have experienced. \\n\\n\r\nVampire Knight Guilty, however, is one of those rare successes in a sea of failure. While there are elements of the plot that became... tedious to deal with, the developments were rather satisfying, and the intrigue hinted at in the original came to fruition. This installment was not perfect. It had its fair share of flaws, and some might express malcontent with the ending.\\n\\n\r\nI have read the other reviews here, and quite a few seem to hate the ending without the possibility of reconciliation. I personally enjoyed the twists presented, though the pacing was a bit odd. Vampire Knight Guilty deserved to be a longer series. Crammed into thirteen episodes, the viewer is given a steady plot progression over the first nine and then a race to the finish line for the last four. The final episode, though, did leave me satisfied. I can ignore a rushed end game if the actual ending is nice enough. \\n\\n\r\nHowever, I recognize that not everyone will appreciate the decisions made as I have. The best way to describe it without giving it away is to say that the end ties up all of the loose ends of the main character's relationships. Unlike some romance anime, Vampire Knight Guilty does not end with a wishy-washy \"let's all get along and love her equally\" type deal. Instead, it caters to both consummated and unrequited love. There are a few elements that some viewers may find tasteless, but that is a matter of perspective. The way those elements are presented in the anime make sense, and as such I can accept them. \\n\\n\r\nThere is a lack of catharsis, though, which may shock some of the viewers. I know that I was expecting a little tragedy to hit somewhere near the end. With all of the build-up, I was almost hoping for some death and despair. Even so, I can't say that I am dissatisfied with how events turned out.\\n\\n\r\nNow, die-hard fans of the manga will be quick to note that Vampire Knight Guilty does not live up to its counterpart, but I cannot personally vouch for that. Having never read the manga, my experience is limited solely to the anime. I can say that the manga is on-going, and the anime was created years ago. At the very least, I expect the manga to be paced more evenly, and to explain several of the developments that were only haphazardly touched upon. \\n\\n\r\nAt the end of the day, I can only say that I enjoyed Vampire Knight Guilty more than its predecessor. While I did enjoy the introductions of the characters, the ending of Vampire Knight Guilty won me over. The art and sound quality is the same in both, though I must note that the ending theme for Vampire Knight Guilty is one of my favorite EDs. It's one of the few that I was willing to listen to more than once as opposed to skipping right over it. \\n\\n\r\nI will say that if you watched Vampire Knight, you should watch Vampire Knight Guilty. Even if you wind up hating the ending, I cannot see how anyone can be satisfied with the state of affairs as they were left off in the original. If you did not enjoy Vampire Knight, however, you should stray away from Vampire Knight Guilty. It's in the same vein of entertainment, after all.",
            "date": "2012-01-17T21:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 52015,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1073743.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Resuki",
                "username": "Resuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=52015"
        },
        {
            "content": "So, the second part of Vampire Knight.\r\nStory 9/10\r\nSo, here now is where we slowly progress off of what happened last while Yuki in season 2 is desperate to know about her past and it slowly builds up between her and a main battle which happens later. Also some other things are discovered too. I enjoyed the second part of the story between.\r\nArt 10/10\r\nThe art didn't change obviously so I still enjoy it.\r\nSound 10/10\r\nMore music was added and sound effects which made the anime between. So, the anime wasn't repetitive which if it was I think that would've kept the viewer bored. \r\nCharacter 9/10\r\nThe characters improvedcompared to season one. Yuki is not so obsessed with Kaname and is more focused on her past with help but eventually does discover it with help.\\n\\n\r\nZero is slowly building up to becoming a level e but still does have help to try to keep his humanity which is still slipping though. More hatred for vampires starts to appear because of Yuki's past with Kaname.\\n\\n\r\nEnjoyment 8/10\\n\\n\r\nI enjoyed the story again but wasn't too big on the ending and feel like it could have ended better than it did. \\n\\n\r\nOverall I give this season 8/10.\\n",
            "date": "2016-08-28T15:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 227830,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4324067.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SailorUranus1996",
                "username": "SailorUranus1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=227830"
        },
        {
            "content": "Right away I can say that Zero was a lot more annoying in this season. He was obnoxious and not the Zero I knew and loved from the first season. His caring nature was changed into one more distant and I really didn't enjoy that at all. \r\nThe plot was just as good as the last season with the same amount of comedy and action. However, what really made me mad was the \"big reveal\" that showed who Yuuki really was. I was taken aback at first when these news were released, but nevertheless, I got over myself and continued watching the show.\r\nThe ending wasone of those \"things will never be the same\" endings. I personally hate those because it makes me want to know what everyone's lives are like after the show ends. \\n\\n\r\nOverall both seasons were amazing and a true pleasure to watch.",
            "date": "2017-02-13T16:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 240543,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545700.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NalarueAni",
                "username": "NalarueAni"
            },
            "url": "https://myanimelist.net/reviews.php?id=240543"
        }
    ],
    [
        {
            "content": "Story\r\nBetter than season 1, but still dismal.  I liked Yuki's post-traumatic stress behavior, which was the reason I gave this season a try.  It was a relief having her emotions at the forefront, instead of the previous season where she was constantly consoling the suicidal Zero.  I usually enjoy heroines in torment, but they didn't do much with it.  She continued obsessing over Zero and repeating the phrase, \"I cannot hurt Zero any more than this\" in her monotonous internal dialogues.  She also kept on chasing after Kaname, begging him to tell her about her past.  This dragged onWAY too long.  I can take only so many scenes of Yuki crying and pounding her fists against his chest while he goes, \"Yuuki,\" in his sad voice.  Unlike season 1, there was some buildup to the final events, the villain was decent, and there was some resolution.  However, the story was so boring and the characters' behavior so repetitive that by the climax, I just didn't care.\\n\\n\r\nArt\\n\r\nThe art was similar to season 1.  Decent, nothing special.  I was disappointed but not surprised by the cheesiness of the monsters and the lameness of the fight scenes.  One treat was how cute Chairman Kaien was once he let down his hair and took off his glasses.\\n\\n\r\nSound\\n\r\nAnother excellent soundtrack.  Just for the music, suffering through the two seasons was worthwhile.  I hate the intro, but the ending theme makes up for it.\\n\\n\r\nCharacter\\n\r\nYuki was unbearable.  She was as weak as ever, but much more intent on protecting everyone, even though she had ABSOLUTELY no capacity for doing so.  Watching her chase after the villain and put herself in danger was really irritating, especially because she endangered a lot of Kaname's lackeys in the process.  Kaname did improve somewhat; he was less opaque and we finally understood his attachment to Yuki.  Zero and Ichirou also gained some depth.  The twins may have been the most powerful, compelling plot element in the entire show.  \\n\\n\r\nEnjoyment\\n\r\nThey shouldn't have raised our expectations that Yuki would become strong if they weren't going to deliver.  They did nothing with her being the guardian.  If the main focus was the love triangle, then they should have put WAY more attention on developing the two relationships.  Yuki spent a lot of time with Kaname and Zero, but she didn't connect with Kaname until the end, and her scenes with Zero were just angsty melodrama.  I can't remember a single romantic scene in either season that I would rewatch, and I'm usually pretty enthusiastic about corny shoujo moments.\\n\\n\r\nOverall\\n\r\nI'm truly shocked by this show's popularity.",
            "date": "2009-06-19T23:30:00+00:00",
            "helpful_count": 145,
            "mal_id": 15907,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21756.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dorothea",
                "username": "Dorothea"
            },
            "url": "https://myanimelist.net/reviews.php?id=15907"
        },
        {
            "content": "First and foremost, I write from the perspective of a dissatisfied audience of Vampire Knight Guilty. It was due to my positive opinion of Vampire Knight that led to me to Vampire Knight Guilty and hence my judgement cannot make dichotomies of the two (so I hope you don't mind me making reference to Vampire Knight).\r\nAs you'll probably know, VKG continues right where VK left off, retaining much of VK's good qualities at first. The characters from VK/VKG are very well-built and generally three-dimensional enough for me as an audience to relate to and hence enjoy, with the exception of Kaname-kun, who was so perfectin his prestige, power and popularity that there was no room for him to be anything but an admirable and incomprehensible figure.\\n\\n\r\nThe artwork itself was generally quite well-done, although I felt the quality didn't follow through towards the end of VKG. In terms of sound, nothing stood out as being special but nevertheless, it complimented the plot and character developments.\\n\\n\r\nThe one thing that I really want to talk about is the storyline. The reason why VK was excellent in my opinion was its plot. The flow of the story introduces audience to a very different and intriguing world of vampires, and as you journey through the plot progression, mysteries of the world and its creatures unravels itself through introduction of new characters, philosophies and events, that spices up and quenches curiosity of the world whilst requiting the audience a greater interest in knowledge of vampires and their existence.\\n\\n\r\nAnd so VKG begins with this highly anticipated and built-up plot where most branches of side and main plots from VK was left wide open. However, as the story progresses in VKG, the pace of the story really dies down. Excluding a few snippets of fair back stories to some of the supporting characters, the main plot really felt mundane and hard to trudge through. \\n\\n\r\nDue to an overly pretentious overemphasis on subtle foreshadowing, the climax of VKG comes about in a very poor, but surprising way, which in its own was interesting. VKG was on a road to revival, bringing back the essences that made its preceder a success. Inevitably, due to lack of pacing in the story, VKG ran out of time to wrap up properly, failing to arrive at the respectable conclusion that VKG's climax opened up for. In all honesty, the conclusion simply felt rushed, as if the writers just ran out of time and whipped up a mediocre ending and forgot about all these other things.\\n\\n\r\nHaving enjoyed VK, it really was a pity that VKG did not follow through. VK felt like it created so much potential for VKG, who grabbed a single point of interest and neglected the rest of VK's successful elements. To sum VKG up, it centralises on one element of a good script, then patched a drawn-out and repetitive build up to its front and a short and undermined continuity to its back. \\n\\n\r\nIt was not bad, but the fact that it was a mere shadow of its former annoys me, and so I give it a 6/10 (it's simply my opinion). \\n\\n\r\nNevertheless, if you have seen VK, watch VKG with an open mind. (I don't take into account that I wasn't in it for a fanciful, mystical tale about pretty boys, which was part of what VK/VKG was marketed to be.)",
            "date": "2009-02-23T07:58:00+00:00",
            "helpful_count": 132,
            "mal_id": 12688,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46320.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/YuYu",
                "username": "YuYu"
            },
            "url": "https://myanimelist.net/reviews.php?id=12688"
        },
        {
            "content": "Note: Vampire Knight Guilty is a direct continuation of Vampire Knight more so than a sequel, so it is necessary to watch Vampire Knight first to truly understand Vampire Knight Guilty.  This review is only based on Vampire Knight Guilty.\r\nStory:  Vampire Knight Guilty is very much a traditional shoujo series about forbidden love.  However, through the inclusion of vampires, the series takes on a bit more of a gothic feel which is heavily relied on to hold the viewer's interest.  The story is mainly told from the point of view from the female protagonist, Yuuki, and her inner turmoil about herpast and her feelings about the two male main characters, a vampire Kaname and a vampire hunter Zero, are the main driving forces behind the story.  The story is also sometimes told from a third-person perspective, allowing the viewer to know details that Yuuki does not.  While the story in itself is quite good and probably one of the best gothic romance animes out there, due to the switching of perspectives, the plot pacing can sometimes feel excruciatingly slow and often very repetitive.  Yuuki continuously tries to tackle the same issues internally episode after episode to the point where it becomes very redundant; the actual story moves along much better when it is not dwelling on Yuuki's thoughts.   This also creates a conflict in the main point of the story, since it sometimes emphasizes the mystery shrouding Yuuki and the other main characters and other times seems to try to hold the viewer solely by building up (almost uneccessary) romantic tension to keep the viewer watching to see which character Yuuki will end up with.\\n\\n\r\nShort version: The story is conflicted in a way that it sometimes tries to be a mystery/suspense anime and other times simply a gothic shoujo/romance.  7/10\\n\\n\\n\r\nArt:  The main character designs are lovely for shoujo and done very well' some character features are a bit too over-exaggerated (Yuuki's eyes being one example), but this kind of character design is fairly normal for the shoujo genre. The background is also illustrated nicely and gives off a bit of an eerie feeling to lend to the gothic mood the anime is trying to create.  However, sometimes there are inconsistencies in the animation, many still frames, and skimping out on the details of background characters.  For the most part, this can be overlooked because the actual art direction is done very well, showing the right images at the right times.  Someone with a scruitinizing eye will definitely pick up on the flaws, but a casual viewer probably won't.  One flaw of sorts that almost any viewer would immediately pick out is the rather boring ending sequence that looks like it was thrown together in five minutes.\\n\\n\r\nShore version: Nice shoujo character designs and animation, but definitely not the best out there.  8/10\\n\\n\\n\r\nSound:  This is where Vampire Knight Guilty excels.  Although the opening song is nice, but nothing to rave over, the ending song by Wakeshima Kanon is excellent and really gives the series an extra nudge into the gothic genre.  The sound effects are also nicely done, as well as the background music which also gives the anime a rather eerie feeling, reminding you that you are watching something a bit darker than your average shoujo romance.  The voice acting overall is great, but it is Miyano Mamoru (Best Actor in the Seiyuu Awards of 2008 for Setsuna from Gundam 00) that really does an outstanding job by voicing two charcters, twins, and giving them their own distinct nuances.  Really excellent work.  10/10\\n\\n\\n\r\nCharacter: The main characters are all round, very well-developed characters (although their development severely slows the plot).  The anime almost forces you to get into the heads and try to exerience and feel the emotions of certain characters, particularly in Yuuki's case, while leavin other characters in an air of mystery.  You wouldn't be able to miss an instant of what Yuuki's thoughts and emotions are even if you tried.  On the other hand, not everything is given to you on a silver platter, other characters remain much more mysterious and it is up to the viewer to try to unravel the mystery behind those characters themselves.  It's a very stark contrast, but it works very well for the series.  10/10\\n\\n\\n\r\nEnjoyment:  If you are looking for a shoujo anime overflowing with romance, this show will definitely hook you.  It is filled with forbidden love, love-triangles, anguish, angst, unrequited love... just about any element you can think of that fits into the genre.  However it is unique in its dark atmosphere.  If you are looking for a shoujo anime and like the added bonus of a gothic edge and a bit of mystery, this is definitely the show to watch and would get a 10/10 in that regard.  On the other hand, if you are looking for something that is more solely along the lines of suspense or supernatural  without all the angsty romantic flare, give this one a pass.\\n\\n\\n\r\nOverall:  An enjoyable, well-animated and produced show that definitely stands out in the shoujo genre as something a bit more unique than others.  The added gothic edge and use of mystery will hook the lovers of the shoujo genre even more and probably pick up other casual viewers as well, since overall the show is better than your run-of-the-mill anime love story.  9/10   But, if you aren't a fan of the shoujo genre in the slightest and not interested in romance animes, you will want to give this one a pass.  Although the show does contain a bit of mystery, suspense, and vampires, the main emphasis is undoubtedly romance, and there is no way to disregard that shoujo romantic factor in this anime to just enjoy it for the mystery and suspense it contains.",
            "date": "2008-11-23T06:03:00+00:00",
            "helpful_count": 87,
            "mal_id": 9774,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/killbethy",
                "username": "killbethy"
            },
            "url": "https://myanimelist.net/reviews.php?id=9774"
        },
        {
            "content": "If you enjoyed Vampire Knight, you'll enjoy Vampire Knight Guilty. Mostly because it is the continuation of Vampire Knight, but also because it's more developed than Vampire Knight and contains a better story. It's not that I didn't like the story to Vampire Knight, but that I like the story to Vampire Knight Guilty better. \r\nStory: You know, the story here it's good. And I have told you that I liked the VKG (Vampire Knight Guilty) better than VK (Vampire Knight) It's, I find, very well thought-out. Like any other anime that is based on a manga, it follows the manga, though not always thesame. (It is in this case, but anyways.) The main subject really is about a love that can't happen; in this case between humans and vampires, friend and friend's enemy. Well, really, it's Zero and Yuuki, or Yuuki and Kaname, as the way I see it. It doesn't drag on like some of the animes I've watched, which usually makes the viewer get bored of the series and looses interest in the anime/manga. That has happened to me millions of times, but because this one gets to the point, or, just a lot of things happen in just a short while, and everytime we get to a better and better plot. That is one of the things you'll definitely like about VKG.\\n\\n\r\nArt: I find the guys have a bit of a feminine feature to them; particularly their eyes, which are basically just a smaller version of a female's, and the small curve when they wear their uniforms. Their faces are very.. pointy, may I say, at the end and actually just gives me a feminine vibe. Their hair is usually long, though some of them are shorter but is long, like most of manga guys. Most, not all, because some of them actually have short hair, like Naruto. But in this case, Zero, Kaname, Shiki, Ichijou, and a lot of other people have longer hair than usual. I find the eyes to the girls, which are what I find an enlarged version of the males', are a bit haunting. They have that weird impression, and it gives you the feeling that there really are vampires in this world. It just suits the main subject of this story; vampires. \\n\\n\r\nSound: It's good, I guess. I'm not one to judge about sound; but I find the openings and endings do fit the series, however. Also about the voices, it's okay. I don't really care about the voices, as long as they actually make sense, but I doubt someone will make an anime with voices that don't make sense.\\n\\n\r\nCharacter: This is where I'll rant. I don't like Yuuki's character. She's too innocent. And every guy seems to just want to flirt with her or something. Kaname loves her, in some way, and Zero; and if you notice, in one point of the story, Hanabusa is quite the flirt, too. It just seems that it's unfair to the other girls in the Night Class, plus the Day Class students. (But I don't really care about the Day Class students because they aren't REALLY critical to the story,) I'm not saying that they all love her the way Kaname and Zero like her, but everyone in the Night Class, males I mean, have a particular liking to her. They either want something to do with her, or regularly talk to her. Like, I'm not saying Akatsuki Kain wants to get married with her. I'm just saying that they have a particular liking to her. I'm glad Shiki isn't really, or actually not at all, having a liking to Yuuki. The girls in the Night Class are pretty well-made, too. Rima's character is my particular favourite, since she's mysterious and she's cute at the same time. Ruka is a strong girl, I know it, even though I dislike her... but only a bit.\\n\\n\r\nEnjoyment: I enjoy everything I see, really. If I don't like it, I'm not really going to watch it. That's the kind of person I am. Don't like it, don't care about it. I'm not going to review, or something else.\\n\r\nOther than that, I enjoy watching this anime 'cause it keeps catching my attention. It doesn't drag on, like I have said before, and keeps my interest in place.\\n\\n\r\nOverall: Yeah, it's great.",
            "date": "2008-11-25T16:45:00+00:00",
            "helpful_count": 34,
            "mal_id": 9844,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/114594.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/REVERIEExx",
                "username": "REVERIEExx"
            },
            "url": "https://myanimelist.net/reviews.php?id=9844"
        },
        {
            "content": "*SPOILER WARNING*\r\nWhat started out as a very good continuation of season one, and loyal companion to the manga (which I am sad to say, I did not know, too the exact same turn as transcribed here) ended up being a major disappointment in the way of a Shoujo anime. I don't normally affiliate with the genre, and this series reminded me why. The abrupt ending of Zero's affection for Yuuki given the circumstances involving her having been a pure blood vampire this entire time was nothing short of a kick in the teeth. To watch 26 full episodes of them going back and forth witheach other in one of the most twisted and abusive love triangles I have ever seen, only to find in the end because Yuuki was never who Zero thought she was he can no longer love her?\\n\r\nAdmittedly there is some bias to my words. I preferred Zero over Kaname only because the latter of the two was a self absorbed prick who's soul intent was roughly the same as Zero's later on in the series. I don't really feel that the story for both the manga and the anime were all that in depth as so many things could have been done to prevent the overall conclusion, everything just seemed to happen because one vampire wanted to be strong. For some reason, however, no one ever thought to band up and kill him all at the same time? And why exactly did he need to drink Yuuki's blood?\\n\r\nOverall, a very bad series that sadly had great potential.",
            "date": "2009-05-28T01:31:00+00:00",
            "helpful_count": 28,
            "mal_id": 15339,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66068.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kigeko",
                "username": "Kigeko"
            },
            "url": "https://myanimelist.net/reviews.php?id=15339"
        },
        {
            "content": "I was so excited when I learned they had made a second season but was greatly disappointed when I watched it. It varies from the manga too far. They fail to introduce an important character, that triggers a major scene with Yuki having to finally confront her feelings.\r\nPlus if you were looking forward to the big battle with the big bad uncle, prepare yourself, it bit! It was over in 2.5 seconds and Kaname is the major player instead of Yuki! It was total garbage and I wish they had just waited for the manga so the full 13 episodes could have been exact. Coursethat doesn't explain the earlier change to me.\\n\r\nIF IT AIN'T BROKE DON'T TRY TO FIX IT!",
            "date": "2009-09-06T21:42:00+00:00",
            "helpful_count": 20,
            "mal_id": 18477,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/32539.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Kuran_Yuki",
                "username": "Kuran_Yuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=18477"
        },
        {
            "content": "NOTE: I have not read the manga so my view on this anime may differ slighlty from those who have.\r\nVampire knight guilty is a continuation of the original series Vampire Knight. The series is set in a school that caters to both vampires and humans that are separated into the night and day classes respectively. The story revolves around a girl whose first memories she can remember is being attacked by a vampire and being saved by a pureblood vampire which is the highest rank. She starts to harbour feelings for both her good friend and vampire hunter Zero as well as the pureblood whosaved her which is currently in the school.\\n\\n\r\nI think the story was quite original from the usual vampires and stuff. Incorporating the shuojo genre very well. That is probably the main genre of ths series. Coupled with a bit of action here and there, suspense, drama and mystery to create a fairly good series. There are good twists in the show and the story is not so cliche in terms of the relationships between characters. However, the show can be rather dark at times, so if you prefer something more lightheated,comedic than prehaps this won't be the best choice of anime for you. Plot wise it may be a bit cliche, and don't expect heavy suspense or drama.\\n\\n\r\nThe art incorporates the typical shuojo style of drawing characters with big eyes and bishiounen(pretty boys). not necessarily the best i've seen but still of a decent quality.The background is mostly dull to help enhance the dark theme in tisi show. \\n\\n\r\nThe voice actors did a good job. Each voice fitting the characters perfectly. The OP and ED songs contribute to the gothic theme of the show. background music now and then also helps to enhance the atmosphere. But yet again, i would not say it was top-notch, there are better animes than this in the sound department.\\n\\n\r\nThe characters was what i was quite impressed in. Because they actually managed to cover a wide range of characters in the short span of 13 episodes. Of course some getting more depth and coverage than others but still the depth of each character can be seen clearly.\\n\\n\r\nI enjoyed the series as a romance fan though i think the ending was not to my liking. Some of you will probably be disappointed with the ending as well so be prepared.This series is definitely better than the first. Having more action, more interaction between characters and more twists. I would say it is the best vampire-romance anime i have seen. So those of you who are considering whether the secod season is worth watching, i'd say give it a shot.",
            "date": "2009-01-14T08:33:00+00:00",
            "helpful_count": 13,
            "mal_id": 11475,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65596.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ethann",
                "username": "ethann"
            },
            "url": "https://myanimelist.net/reviews.php?id=11475"
        },
        {
            "content": "[No Spoilers at all]\r\nVampire Knight Guilty is a continuation of the anime Vampire Knight, and that is all it is. It is not its own series, and it is rather unwatchable without watching the primary series.\r\nAs for the anime itself, it is absolutely one of the superior ones out there. The plot is exceptional and it has an inimitable outlook on vampires. Each episode ends with a cliffhanger making you fancy to gaze at the next one in the series without delay. Although there is awfully minute action, the drama is what keeps you going, so if you want an adventure shounen where the maincharacter progresses physically, go off and watch cartoon network.\\n",
            "date": "2008-11-14T14:24:00+00:00",
            "helpful_count": 12,
            "mal_id": 9473,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46688.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HardToName",
                "username": "HardToName"
            },
            "url": "https://myanimelist.net/reviews.php?id=9473"
        },
        {
            "content": "Usually 2nd season is worse than the 1st one. However, this does not apply to Vampire Knight Guilty. Almost in every category VKG was better than VK. The only thing I liked more in 1st season was OST. Music was good in VKG too, but not as fitting the mood of the story as the VK one.\r\nWhat was 1st season lacking the most, was not enough character introduction in my opinion. I was rather disappointed that only Zero's past was showed and explained while Kaname's and Yuuki's was left unknown. After watching VKG I can understand why didn't show their past in VK. It doesmake sense and it was a good decision.  \\n\\n\r\nSo yeah, we finally got to see their pasts, which also lead to see some better character development as well. If Yuuki was rather annoying and useless in VK, then in VKG she changed almost completely. At the beginning she still wasn't very contributing and as always Zero, Kaname or other Vampires had to take care of her, but she start to grow as a character in my eyes. Of course, that sudden event changed a lot, but she was already getting stronger before it.\\n\\n\r\nOn the other hand, I wasn't really expecting to see Kaname's true colors, but surprisingly we did get to see that. I thought he will be used as a mysterious character till the end, but here we got his past, we know why he's so caring about Yuuki and what are his future plans. I believe it was really well done, good timing I mean to do it. It was definitely shocking... I found his past even more harsh than what Zero had. No wonder Kaname was always so distant from everyone.\\n\\n\r\nVampire Knight Guilty in my eyes were already better when introduced antagonist early in the show instead of at last episodes like in VK. Although I wish he had more screen time. He did get more than enough screen time in the flashbacks, but a bit disappointing how short we got to see him in action during the current time. Yet, I am not really complaining about this as usually fights that take long are just irritating... I am not really fond of shows who drag fights, so I was rather happy how everything happened in VKG.\\n\\n\r\nAs I have already mentioned, the music wasn't as good as in Vampire Knight. However, I am not gonna lie, it was still very good. I gave 9/10 and only not a 10, because I know that it could have been better (VK as example). The whole OST was playing the right mood that characters of the series contained, so that was a great addition to the series.\\n\\n\r\nTo sum up, the VKG has definitely exceeded my expectations. I can honestly say that it's the first shoujo anime to me that was able to include some mystery and supernatural genre's very well. Another great thing about this anime is that it was unpredictable. Till the very end wasn't sure who will Yuuki choose if she will choose that is.\\n\\n\r\nWhether it was helpful or not, please do not hesitate and give me feedback ^^ I do want to improve writing reviews. Thank you for reading!",
            "date": "2013-06-15T10:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 101151,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/478082.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ovyda",
                "username": "Ovyda"
            },
            "url": "https://myanimelist.net/reviews.php?id=101151"
        },
        {
            "content": "I really got into this anime, loved the characters and the world created, but all hopes and dreams smashed with the ending! I don't need a happy skipping into the sunset ending, but after seeing this anime I was not only disappointed but scratching my head (spoiler: A school for human vampire coexistence, but neither interacts with the other nor even knows they are vampires, AND Zero goes through this whole experience just to decide to kill all the vampires???). \r\nMy hope is that the love story is completely dropped (even though the scythe weapon of Yuki's is really cool) and Zero gets his ownanime and manga, because the Bloody Rose gun is an awesome weapon and he's got a great background for his future of hunting down vampires.  I wish that this anime was only included as flashbacks for Zero the Vampire Hunter and not an anime all by itself.",
            "date": "2009-04-04T18:36:00+00:00",
            "helpful_count": 11,
            "mal_id": 13842,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/166682.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 2,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tacyttik17",
                "username": "tacyttik17"
            },
            "url": "https://myanimelist.net/reviews.php?id=13842"
        },
        {
            "content": "Having recovered from the injuries he had sustained, Zero returns to Cross Academy to resume his role as prefect. Though, not long after he resumes his role, members of the Supreme Vampire Council ambush Zero with the intent to execute him for the murder of the pureblood, Shizuka. Luckily when Kaname intervenes, he sends the council away and insists that they stay out of school affairs. However, whilst Kaname continues to hide the truth about Shizuka's death, there are others who grow suspicious of what happened that night and what the dorm president is hiding. Meanwhile, Yuuki begins to have flashbacks, leading her to investigateher blood-stained past: what will she find, and will she continue to be tempted by an offer from Kaname?\\n\\n\r\nNow on to the review and I hope you and enjoy reading this review and I hope it helps you's in anyway. Aha, late to the party I know. Anyways, lets get started:\\n\\n\r\nStory (7/10) \\n\r\nBuilt upon a sturdy foundation of shoujo clichés and pretty animation, Vampire Knight Guilty is a lot of fun without being particularly elegant. Moreover, as the second instalment in a successful dark shoujo series, it brings the story of mysterious vampires and tragic love to an agreeable conclusion.\\n\\n\r\nFor most, VKG’s main attraction will always be its contrivances, clichés, and ham-handed delivery of the romance. Consider the corniest scene involving vampires possible (OMG he licked her neck! *squeal*), then set it to repeat across several episodes. Throw in hints of homoeroticism for extra tang and some half-baked lore, and VKG gives the impression that it’s not so much animated as churned. Indeed, the series makes no claim to originality or wit, but it manages its cheese surprisingly well, and, on balance, turns out to be more interesting than irksome.\\n\\n\r\nNevertheless, buried amongst all the silly love triangle stuff, there’s still that core of well-executed mystery keeping the story afloat. Crucially, VKG knits together much of the political threads left hanging by the first season: after lurking in the shadows so long, the Vampire Council finally takes centre stage, as does a newly kick-arse Headmaster Cross, and Kaname’s true intentions become clear in a gasp-worthy twist.\\n\\n\r\nOne true disappointment, however, is that, despite wishing to portray a violent clash between the various factions, VKG’s battles look and feel anything but. The static sequences are usually over before they’ve begun, and attempts at spicing things up with flashy gimmicks just look forced. Even the finale can’t escape this flat-lining of tension as everything generally happens too fast and too easily.\\n\\n\r\nAs a final note, ardent fans of the manga should brace themselves for a slight but significant reinterpretation of Zero at the end. No doubt, it will send a few spitting in rage.\\n\\n\r\nArt (7/10)\\n\r\nLike Vampire Knight, VKG looks very pretty, with lush colours and attractive character designs perfectly catered towards the shoujo lovers. Regrettably, it also adopts VK’s disregard for movement. While VK is predominantly drama-based, VKG relies on fighting sequences during some of its climactic moments; the insufficient number of frames, straightforward camera angles, and uninventive choreography, therefore, only lessen their impact.\\n\\n\r\nSound (7/10)\\n\r\nThe cheap pop opening and closing themes add nothing to VKG’s charm. The score, on the other hand, though mostly generic (aimless tinkering on a piano, queer string instrumentals, that kind of thing), still holds one or two surprises. The most useful additions include the sound effects subtly used to heighten the spooky ambience; for example, the sudden rush of cymbals during particularly tense exchanges goes a little way to enrich the viewing experience.\\n\\n\r\nCharacters (6/10)\\n\r\nWith fewer comedic scenes to add colour to Yuuki’s personality, the effects of her clueless vulnerability and passive nature leap from uninspiring to outright disgusting. Taking the initiative and driving the story on her own merits is certainly beyond her as she stutters and sighs her way through every conversation. Most irritatingly, she’s the kind of contradictory character who speaks of saving others whilst constantly needing protection herself.\\n\\n\r\nAs such, providing entertainment falls to Kaname and Zero. While Kaname wields his mysteriousness like an expert by throwing a dark and truly unexpected spanner in the works, Zero escalates his catalogue moping (seemingly, just because he can). Neither ventures from his archetypal pigeon hole, but both remain engaging, nonetheless, because of their anguished backgrounds.\\n\\n\r\nThe other good news is that Kaname’s previously nameless hangers-on get fleshed out and become more relevant to the plot. In particular, I find the exploration of Aidou’s friendship with Kaname to be an interesting addition to the character development.\\n\\n\r\nOverall (7/10)\\n\r\nVKG will prove the perfect fix for fans addicted to a sugary diet of bishies, immature angst, and romanticised horror themes; competent central mystery aside, those elements are its forte. For anyone looking for substance and/or action, however, the show will leave a distinct ‘Is that it?’ feeling as anticlimactic fight scenes and an insipid cast dog the plot. On the whole, VKG may not feel as fresh and exciting as its predecessor, but it remains at all times a fun and easy romp to follow.",
            "date": "2012-07-25T04:17:00+00:00",
            "helpful_count": 9,
            "mal_id": 67675,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1399949.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DeSwitch",
                "username": "DeSwitch"
            },
            "url": "https://myanimelist.net/reviews.php?id=67675"
        },
        {
            "content": "to describe this season in 1 word it would be, disapointing,\r\n what really made the first season work for me was it had some amazing suspense, great cliffhangers and had a lot of twists, and even for how steriotypicaly emo zero was they handles him very well and he came off like a selfless teen that was willing to let him suffer and even die a slow painful death if he had to, to save yuuki or his father and even just people in general, and his hatred for vampires and yet him being one realy built up his charecter, why am i mentioning this,well i mentioning it cause zero is hardly even in the second season, and heres where the show starts to take a sudden downturn\\n\\n\r\nthis seaosn focused very much on kaname and yuuki, and befor ei go off i have to mention this, this show has the absoulte WORST TWIST EVER, you wont see it coming but when they reveal what it is and what they continue to do after words is just WTF worthy, but back on topic the show focuses much more kaname and yuuki, now this would of been the chance to make kaname more likable caus ein the first serise he is a total asshole that steals the spotlight and acts very high and mighty, basicly hes a asshole and the first time i saw guilty i though he was the villian cause they make him much much worse, he does some dasterdly things and he just come soff as evil till the very end and even then he still seems like he'd fuck over everyone for his own goal, which is protecting yuuki but his logic is \"ill kill everything but yuuki\" so yah kaname may have somehow become even more worse, yuuki isnt any different from the first serise at all\\n\\n\r\nand heres the biggets problem with guilty, theres no suspense, every build up leads to a let-down, a cop out, or they just drop the plot point all together, they build up this one villian who lasts about 20 seconds of fighting, i wish i were kidding, the show just doesnt have any good cliffhangers either and for a lack of a better word its just boring, not to sound like a fanboy/girl but when zeor comes in the show does get better, mainly cause some very emotional things happen and you want this guy to get what he wants but he has everyone int he world agianst him, ide say if it werent for scenes of zero and his brother the sow would have been a 4, \\n\\n\r\nthe actual ending does leave not really a cliffhanger but leaves alot of things open for the inevitable season 3, its a good ending and i want to see what happens next the ending fight is a letdown but the actual ending while not satisfying will leave you wondering what happens next, the next season really needs to work on making yuuki less of a idiot, make kaname stop doing worse things the actual villians do then season 3 wil lbe good. fingers crosse dit will work out\\n\\n\r\nalso before i leave i just have to comment on how dated and lazy this shows animaiton is, it seriously looks like its from 2003, whenever animaiton gets good it lasts for about 4 seconds then back to outdated animation, they need to fix that aswell",
            "date": "2011-06-09T19:16:00+00:00",
            "helpful_count": 9,
            "mal_id": 37712,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/486384.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ItsSoPringles",
                "username": "ItsSoPringles"
            },
            "url": "https://myanimelist.net/reviews.php?id=37712"
        },
        {
            "content": "I began watching the first season, and didn't think the story was very good in the first place--I never really knew what was going on, and overall it kinda sucked. But that is nothing compared to the second season, Vampire Knight Guilty.\r\nI must say, I expected this to get better, but it actually got appallingly worse. I tried to be fair with it, but when I look at it overall, it was just awful. The story barely made sense, the characters didn't have any development, and even if they did, it was really difficult to notice. It seems the creators got lost in trying tocreate something ambiguous, and 'cool' and misplaced the actual plot.\\n\\n\r\nAll of the minor characters seemed to want bigger parts, but, (for some reason) couldn't seem to 'budge their way in' going by the strange relationship with Yuki, Kaname, and Zero taking up a lot of the confusing screen time, and ended up getting written off. Multiple random things happened this season, including a kind of 'boss vampire' who barely fit in with the plot either, brought to you by one of the minor characters who can't seem the squeeze their way into the story whatsoever. All in all, there was no reason for the minor characters--the setup would've been more plausible if the 'boss vampire' came out from under the love-triangle and Kaname and Zero just punched it and went back to bickering. \\n\\n\r\nI say, if you wanna watch this anime for a laugh, by all means--I did. But don't watch the second season. The ending was disappointing and, frankly, tortuous. It's a wonder I got through it at all.",
            "date": "2015-03-21T19:33:00+00:00",
            "helpful_count": 9,
            "mal_id": 182998,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3471075.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/sokkas-boomerang",
                "username": "sokkas-boomerang"
            },
            "url": "https://myanimelist.net/reviews.php?id=182998"
        },
        {
            "content": "Vampire Knight: Guilty is the sequel of Vampire Knight.\r\nSomehow the story focuses more on Yuki and Kaname's past and how Zero struggles into turning a Level-E vampire. Yuki finally becomes a vampire and it is reveal that Kaname and Yuki are siblings.Rido Kuran shows up in this story and is the main antagonist for this season.\r\nSomehow the art is Amazing as ever! You can feel the not-so-typical shoujo atmosphere in it. And somehow, The art reminds me of Uragiri wa Boku no Namae wo Shitteiru. Yuki becomes more mature and you can see her resemblance to her beautiful mother Juri.\r\nThe story left as a cliffhangerin the end and I totally don't like it that much...If you don't like the ending I recommend you to read manga for better unerstanding!\\n\\n\r\nThe characters didn't annoy me at all in fact all of them are useful and has roles to play. I love the fight between Ruka and Aido cause It somehow provides the comedic enjoyment of this story.\\n\\n\r\nOverall I give Seven (7) for this anime, cause it didn't satisfy me at all. I recommend people to read the manga for better knowledge.",
            "date": "2012-06-30T00:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 64841,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1228745.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dawnkresher",
                "username": "dawnkresher"
            },
            "url": "https://myanimelist.net/reviews.php?id=64841"
        },
        {
            "content": "Vampire Knight : Guilty is one of those series that makes me want to stop watching deep animes and stick to silly romance animes where the ending is always happy. The first season was awesome, but the part 2 was a let down.\r\n[spoilers]\r\nWhat is the point for the ending? The ENTIRE series revolved around a certain goal. The school, the teachers, the bonds, the story itself had the same goal. Yet with the ending given, It completely makes no sense. 10 hours of episodes spent focusing on one goal, co-existence amongst all groups, yet zero's actions at the end doesn't do anything for that goal.\r\nTheentire series filled me with a sense of suspense and anticipation on what was to come. Could have been rated really high, but IMO the ending destroyed EVERYTHING that the series worked for.",
            "date": "2009-11-15T03:37:00+00:00",
            "helpful_count": 6,
            "mal_id": 20561,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/woodyfly",
                "username": "woodyfly"
            },
            "url": "https://myanimelist.net/reviews.php?id=20561"
        },
        {
            "content": "First this anime disappointed me because of the ridiculous ending. \r\nStory: 5\r\nI liked the story more than VK because it has stronger plot and darker atmosphere but still I don't think it's the best it could be more interesting. \r\nArt and sound: 8\r\nArt and sound are the best thing about this anime because they make me continue watching this anime. All characters were drawn perfect. Kaname,Zero and Aidou... Anime opening and ending was chosen perfect too because they reflect anime's gothic atmosphere well.\r\nCharacter: 6 (just for you Aidou)\r\nMy favorite character is Rima but don't ask me why because i don't know too i just reallyliked her. Okay the main girl Yuuki... I hate this girl so much! I know there are so much silly, weak female characters in shoujos but this girl is the weakest and silliest and i think there is no one likes her. Kaname, I have a love and hate relationship with him. Sometimes I died because of his beauty and his character but sometimes i really hated him. Zero, I loved this guy but he's not my best ,sorrynotsorry, I ship him with Kaname (yes Yuuki, you're not the one i ship with zero or kaname. You don't deserve these guys) Uh and at the end I literally had a heartbreak because of Zero. I've never wanted him to be sad and seeing him sad... Last but not least my cinnamon roll Aidou-senpai. He is the cutest of them all. Hahaha while watching the anime i was like the Day Class' girls. Aidou-senpai plz notice me !\\n\\n\r\nEnjoyment :6\\n\r\n I didn't say good things so much but i can't deny I like the anime until the last 1-2 episodes. Trust me this anime isn't boring.I watched the whole season in a day. \\n\\n\r\nOverall I liked the anime but Yuuki and the last episodes made me so angry.",
            "date": "2016-09-13T06:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 228953,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5532789.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/winterella",
                "username": "winterella"
            },
            "url": "https://myanimelist.net/reviews.php?id=228953"
        },
        {
            "content": "I thought the first series was pretty bad, but tolerable. The first half of this series was so bad that I wished I hadn't even watched any of it. I managed to push through to the big reveal (no spoilers in this review, sorry guys!), which managed to interest me enough to keep going. After all, the only reason I kept watching this in the first place was because of Zero, who I love for a myriad of reasons, even if he isn't written all that well. More on that in the character section. \r\nTo begin with, the story: Vampire Knight Guilty was a directcontinuation of the first series, Vampire Knight, though it was a pretty bad sequel in my opinion. The plot was bland and slow and nobody's motivations or goals were correctly explained. What were supposed to be plot twists just ended up confusing me and in all honesty, it made me feel horribly bored and irritated. \\n\\n\r\nThe art was tolerable. It wasn't very pretty (I personally hate the whole bug eyes trope for heroines) but it served its purpose. The backgrounds were drab and uninteresting and the colors were all dull and blended too much for me to focus well. The drawings seemed like they were barely even outlined, and the animation was choppy and a little unnatural. The body structures of the characters were unrealistic and angular and just most things about the art didn't sit right with me. \\n\\n\r\nThe sound was surprisingly alright. The opening and closing themes were gothic enough to fit the setting. I actually really liked the creepy feel of the closing theme. \\n\\n\r\nThe characters were kind of a mess. They tried to portray Kaname as some sort of evil mastermind like Ciel Phantomhive, Kyoya Ootori, L Lawliet, Light Yagami, or Lelouch Lamperouge, perhaps (wow, look at the alliteration... so many L's...), but nothing in his plan clicked or made any sense. His ideas of making people 'pawns' just seemed to be their natural actions and his motivations weren't clear either. Besides that, Yuki is always on my nerves. She claims to be strong but can't do anything herself and continuously gets into the worst of situations. There's nothing wrong with being weak-- after all, it's a very human trait, and it's very natural that a main character may be weak. My problem is with her attitude and how her weakness doesn't seem to make any sense in regards to her position and what she's expected to do. There's so many plot holes I really can't enjoy this. Zero, however was the only one I could tolerate (alone with Aido, just because he was funny :D) This was partly because I adore Vic, Zero's English voice actor. It was also because that in a world of screwed up people, he's the only one with even a silver of common sense, even if he's stupidly violent half the time. \\n\\n\r\nAnyways, I didn't really enjoy watching a lot of this. I just finished because I have this weird obsession with finishing everything I start. \\n\\n\r\nI would recommend this if you: like brocon, like heroines with no character, like love triangles, like heroines that are 'special' for some random reason, liked vampire knight\\n\\n\r\nI would NOT recommend this if you: are not into incest, like characters with real motivations, want a real plot, wanted something actually dark, did not like vampire knight\\n\\n\r\nI'm a little disappointed on who Yuki ends up with at the end of the show, but after some research apparently she ends up with the other guy in the manga, so I'm happy now. Still no spoilers, research for yourself :D \\n\\n\r\nHave a great day everyone!\\n\\n",
            "date": "2018-04-25T16:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 279009,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875883.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LeaOotori",
                "username": "LeaOotori"
            },
            "url": "https://myanimelist.net/reviews.php?id=279009"
        },
        {
            "content": "Allow me to begin by admitting that I thoroughly enjoyed Vampire Knight Guilty and its predecessor. In admitting this, I am also saying that my rating is incredibly biased. \r\nI was on the hedge when it came to Vampire Knight Guilty, more so than I was with the original series. Most of us can agree that sequels rarely live up to the original. In many cases, the original series is meant to establish characters, relations, and a foundation for the overarching plot. Sequels, then, are supposed to consist of the meat of the story. They are supposed to clear up all issues, ties up looseends, and leave the viewer satisfied at the end of the day. Unfortunately, this concept isn't always followed. Instead, a number of sequels are made to continue sucking revenue out of an already popular show. \\n\\n\r\nThis leads to that annoying filler we all know and hate. In series that air extensively, the filler can sometimes last entire arcs, for the dual purposes of lining pockets with greenbacks and to continue an anime with an on-going manga counterpart. \\n\\n\r\nBut this isn't new to many of us. We know and loathe the process, as it turns otherwise great shows into absolute travesties that we wish to never have experienced. \\n\\n\r\nVampire Knight Guilty, however, is one of those rare successes in a sea of failure. While there are elements of the plot that became... tedious to deal with, the developments were rather satisfying, and the intrigue hinted at in the original came to fruition. This installment was not perfect. It had its fair share of flaws, and some might express malcontent with the ending.\\n\\n\r\nI have read the other reviews here, and quite a few seem to hate the ending without the possibility of reconciliation. I personally enjoyed the twists presented, though the pacing was a bit odd. Vampire Knight Guilty deserved to be a longer series. Crammed into thirteen episodes, the viewer is given a steady plot progression over the first nine and then a race to the finish line for the last four. The final episode, though, did leave me satisfied. I can ignore a rushed end game if the actual ending is nice enough. \\n\\n\r\nHowever, I recognize that not everyone will appreciate the decisions made as I have. The best way to describe it without giving it away is to say that the end ties up all of the loose ends of the main character's relationships. Unlike some romance anime, Vampire Knight Guilty does not end with a wishy-washy \"let's all get along and love her equally\" type deal. Instead, it caters to both consummated and unrequited love. There are a few elements that some viewers may find tasteless, but that is a matter of perspective. The way those elements are presented in the anime make sense, and as such I can accept them. \\n\\n\r\nThere is a lack of catharsis, though, which may shock some of the viewers. I know that I was expecting a little tragedy to hit somewhere near the end. With all of the build-up, I was almost hoping for some death and despair. Even so, I can't say that I am dissatisfied with how events turned out.\\n\\n\r\nNow, die-hard fans of the manga will be quick to note that Vampire Knight Guilty does not live up to its counterpart, but I cannot personally vouch for that. Having never read the manga, my experience is limited solely to the anime. I can say that the manga is on-going, and the anime was created years ago. At the very least, I expect the manga to be paced more evenly, and to explain several of the developments that were only haphazardly touched upon. \\n\\n\r\nAt the end of the day, I can only say that I enjoyed Vampire Knight Guilty more than its predecessor. While I did enjoy the introductions of the characters, the ending of Vampire Knight Guilty won me over. The art and sound quality is the same in both, though I must note that the ending theme for Vampire Knight Guilty is one of my favorite EDs. It's one of the few that I was willing to listen to more than once as opposed to skipping right over it. \\n\\n\r\nI will say that if you watched Vampire Knight, you should watch Vampire Knight Guilty. Even if you wind up hating the ending, I cannot see how anyone can be satisfied with the state of affairs as they were left off in the original. If you did not enjoy Vampire Knight, however, you should stray away from Vampire Knight Guilty. It's in the same vein of entertainment, after all.",
            "date": "2012-01-17T21:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 52015,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1073743.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Resuki",
                "username": "Resuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=52015"
        },
        {
            "content": "So, the second part of Vampire Knight.\r\nStory 9/10\r\nSo, here now is where we slowly progress off of what happened last while Yuki in season 2 is desperate to know about her past and it slowly builds up between her and a main battle which happens later. Also some other things are discovered too. I enjoyed the second part of the story between.\r\nArt 10/10\r\nThe art didn't change obviously so I still enjoy it.\r\nSound 10/10\r\nMore music was added and sound effects which made the anime between. So, the anime wasn't repetitive which if it was I think that would've kept the viewer bored. \r\nCharacter 9/10\r\nThe characters improvedcompared to season one. Yuki is not so obsessed with Kaname and is more focused on her past with help but eventually does discover it with help.\\n\\n\r\nZero is slowly building up to becoming a level e but still does have help to try to keep his humanity which is still slipping though. More hatred for vampires starts to appear because of Yuki's past with Kaname.\\n\\n\r\nEnjoyment 8/10\\n\\n\r\nI enjoyed the story again but wasn't too big on the ending and feel like it could have ended better than it did. \\n\\n\r\nOverall I give this season 8/10.\\n",
            "date": "2016-08-28T15:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 227830,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4324067.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SailorUranus1996",
                "username": "SailorUranus1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=227830"
        },
        {
            "content": "Right away I can say that Zero was a lot more annoying in this season. He was obnoxious and not the Zero I knew and loved from the first season. His caring nature was changed into one more distant and I really didn't enjoy that at all. \r\nThe plot was just as good as the last season with the same amount of comedy and action. However, what really made me mad was the \"big reveal\" that showed who Yuuki really was. I was taken aback at first when these news were released, but nevertheless, I got over myself and continued watching the show.\r\nThe ending wasone of those \"things will never be the same\" endings. I personally hate those because it makes me want to know what everyone's lives are like after the show ends. \\n\\n\r\nOverall both seasons were amazing and a true pleasure to watch.",
            "date": "2017-02-13T16:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 240543,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545700.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NalarueAni",
                "username": "NalarueAni"
            },
            "url": "https://myanimelist.net/reviews.php?id=240543"
        }
    ],
    [
        {
            "content": "Vampire Knight Guilty is the second season of the series Vampire Knight. In the second season, the show is again really how much potential lies in it. Again, there are again many funny, sad, thoughtful, cheerful moments. In general, one is confronted with a lot of feelings for Vampire Knight. As an example, you can watch Yuki. She feels deep sympathy for Kaname, but do not know how to deal with it. Zero acts for them as if he was jealous. In order not to hurt the two, Yuki Kaname goes out of the way and tried to treat him normal. I recommend it further,that if you've seen the first season, starts directly with the second, because if you do not, could the boarding bit hard werden.Unter else I like about the anime so that he, too many scenes from the past shows and explains, this would explain why the easier to think and act the person. On the whole it was a very good season with an interesting end.",
            "date": "2016-10-14T19:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 231795,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5768963.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Anime-Tastisch",
                "username": "Anime-Tastisch"
            },
            "url": "https://myanimelist.net/reviews.php?id=231795"
        },
        {
            "content": "Be forewarned, spoilers ahead.\r\nI was wary of watching VK when I'd first heard of it. The vampire genre is often riddled with cliches and bad writing, especially concerning the teenage demographic where, in most cases, is just a bodice ripper. But I'm willing to give anything a shot. \r\nI started out liking VK, but when I got to VKG that started to change. The love triangle that started out as being unpredictable soon became blatantly obvious. The unexpected twist of Yuuki not only being a vampire who hadn't \"awakened\" yet, but was also was related to Kaname completely ruined it for me. It's like theyexchanged taboos - the forbidden vampire/human love becomes the forbidden vampire incest love. Like somehow it wouldn't be appealing if there weren't some sort of taboo involved. \\n\\n\r\nZero's reaction to Yuuki's unknown secret also got to me. His reaction seemed more convenient than anything else; if he no longer loves her, then she and Kaname can go and live happily ever after. Whoopee.\\n\\n\r\nGiven the first season where Yuuki is constantly in need of saving, I was hoping that the \"plot twist\" of her being a vampire would be a chance to redeem herself as the damsel in distress. It didn't. She still needed saving from her evil uncle. How disappointing.\\n\\n\r\nGiven Yuuki's potential as a strong, textured female character, it's sad to think that she could easily fall into the Mary Sue category.",
            "date": "2013-05-27T06:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 98599,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SerraSun",
                "username": "SerraSun"
            },
            "url": "https://myanimelist.net/reviews.php?id=98599"
        },
        {
            "content": "There are no spoilers in this review, so it can come off as vague, but I didn't want to spoil anything for those who may read it!\r\nIn my own list, I rated this as a 10 purely because I really, really loved it. But being more realistic, I think that in general, this anime is more like an 8 out of 10. \r\nI don't really understand the complaints about the romance. Yes, it's angsty at times, yes, it has some cliches. But this is literally a romance anime targeted at younger girls. If you have a problem with that, why would you watch it orrate it negatively? \\n\\n\r\nOk, so now that I have that out of the way, I guess I'll go more into the series itself. I watched the first season because someone recommended it to me. I wasn't aware of what it was about, or what shoujo even was. I was pleasantly surprised at the lack of cleavage shots and other annoying things that typically occur in popular anime. It started out a little slow, but I love vampires, so I kept watching, and I'm glad I did. \\n\\n\r\nThe first season was pretty good, but nothing special. In my person opinion, the second one blows it out of the water. It is NOT confusing if you pay attention. The characters DO have development. I really question whether the people who made these complaints were fully watching the show or not. This definitely captures the feel of a gothic romance anime, but it also has a really good plot and other things to draw you in besides the romance. \\n\\n\r\nThe second season did have some things that I would have preferred they explained more about because it would have been interesting. However, there were no huge plot holes that I could see or anything they left really unexplained that was necessary to the show. Maybe I'm dumb, but I found myself genuinely surprised by some of the discoveries the characters made and the plot itself, in a good way. I didn't find it overly predictable at all.\\n\\n\r\nWhile there is an antagonist, VKG is more about Yuki, the main character, discovering herself. It continues well from the first season and doesn't seem like a sloppy add-on like some second seasons do (cough cough Black Butler cough cough). \\n\\n\r\nI'd talk about the art but it's the same as VK. Pretty, with some exaggerations (Yuki's eyes for example). It also has background characters that get extremely basic designs, like VK. Nothing new.\\n\\n\r\nOne thing I don't like is how few girls/women are in this show. Perhaps people watching shoujo don't like having women in it? I'm not sure. It just disappointed me that one of the main girls, Luca, is mostly seen as a super jealous/stereotypically catty girl who doesn't like Yuki because of a dude. And the other main girl is the main character. Any other girls don't get big parts at all. But like I said, it's shoujo, so maybe I'm just ignorant of how the genre usually is since I've never watched it before.\\n\\n\r\nIf you like romance but you also like a good mystery/action/supernatural/gothic anime, I definitely recommend you watch this. It's not perfect if I look at it objectively, but I absolutely loved it, and can't find anything else that comes close to being as fun to watch as VKG, or anything that gives me the same feeling when I watch it.",
            "date": "2015-07-25T22:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 194337,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/koh98",
                "username": "koh98"
            },
            "url": "https://myanimelist.net/reviews.php?id=194337"
        },
        {
            "content": "You've read the synopsis, the story basically revolves around the main heroine, Cross Yuki; however, I think damsel is a far more fitting title.\r\nSo what I really think? Pure quintessential BS.\r\nSeriously.\r\nIt's so cliché and over melodramatic that it's practically excreting out hearts and tears.\r\nWhile it might sound harsh I can only be just that: truthfully, bluntly, harsh. However does it mean that I hate it? Well, no.\r\nIt’s a cliché and corny romance involving vampires and humans. You have the fluff, the love triangle and the forbidden love. Nothing really new. Simplistic plot pumped on melodramatic steroids with cheesy characters and bishi love interests. Pretty tolook at and easy to follow along.\\n\\n\r\nThe main protagonist Yuki can be quite unlikeable; she’s childish and selfish. Gasping, crying or complaining is not always cute - in fact I want to slap her a few times. Good god, grow a brain cell or two. I understand she was intentionally written to be 'a little dumb', but come on does she have to be one of those stereotypical damsel in distress? The weak demoiselle that has the need for either Kaname or Zero (the male heroes) – like in those classical romance novels, or in the more recent Teen Romance Vampire Novels (*cough Twilight cough*). You have the controlling, stalkerish males and the submissive damsel. This seems familiar. Although most vampire stories follow along those lines... so I guess I shouldn't just single out VK.\\n\\n\r\nThe problem with VK is that it can be so painfully annoying at times, drama added on top of the already overflowing melodrama – as I’ve been repeatedly saying because there’s no other way to explain it; it’s just there in your face all the time. Perhaps it’s best if I explain:\\n\\n\r\nYuki is bouncing back and forth between Kaname and Zero, she constantly thinks about Kaname and moans about feeling inferior. If she isn’t tearing up then she’s so shocked about everything because she’s too dense to see what’s right in front of her. While she's suppose to be a guardian, protecting the students from any impeding danger (aka Vampires snacking on them), she seems incapable and too weak to perform those duties. Instead 9 times out of 10 she's the one getting in trouble.\\n\\n\r\nZero is a plain broody b@st@r*, ok that’s a little harsh, but everything he does he does it with melancholic dismay (this is me sounding poetic). He's the anti-vampire-angry guy friend, who’s secretly lusting for Yuki.\\n\\n\r\nKaname, the elusive guy that enjoys sending mix signals – one moment he’s so friendly, next he’s lusty/touchy and then he clams up and becomes reclusive. Despite his supposed friendly persona he's a controlling, manipulative, liar.\\n\\n\r\nWoe is me. Every single scene feels so over the top, the reactions are just so Shakespearean…\\n\\n\r\nThere’s so many long winded angsty inner dialogue or people brooding or girls crying or blushing.\\n\\n\r\nLook, I like drama, it’s entertaining but when it’s always thrown in your face it gets trying. Yes I will admit some scenes are exciting, especially the showdowns involving Zero, he just adds to the angsty tense atmosphere. And while the characters are over-the-top they are at least fleshed out and given back stories.\\n\\n\r\nThe show tries to stay true to the gothic style, as seen with the architecture of the academy, the secrets, the supernatural element, the toned down colouring (black, white and red being the main colours), the stock characters, the soundtrack, etc, to name a few. However while it dabbles into the genre it fall flat and comes across as unsuccessful.\\n\\n\r\nBecause all that supposed Gothic style given to us is background, just background. They could have used it to their advantage, instead you don't pay too much mind to it. Instead it's mainly focused on the main characters - while not necessarily a bad thing - the gothic and supernatural feel just dwindles down to nothingness. A good vampire story would have uncomfortable, suspenseful and omniscient scenes, this does not, the drama and angst overshadows any semblance of mystery or suspense we're given. \\n\\n\r\nBut it is what it is; I know I can't really expect a convoluted plot with surprising twists. Sure the story did have some surprises, if you ignore the fact that it was heavily hinted.The story is just so predictable.\\n\\n\r\nI think VK is just genre confused, it doesn't know if it wants to be a romance comedy or a paranormal-romance (mystery, suspense, supernatural). It switches back and forth and tries to find a middle between the two. While I'm all up for having some humor, I find it ruins the atmosphere at times or plain unnecessary. With a tenser atmosphere it would probably appeal to a wider audience and not just vampire-loving-teens (sorry for the stereotype but it is its targeted audience).  I find there's little to no build-up of suspense or climax so you're left wanting more. \\n\\n\r\nNot to complete bash the whole thing like some raving flamer, the story does have its moments. It sucks you in like those cheesy Soap Opera your dad refuses to admit he loves watching with your mom. With the overused plot lines and over the top drama, you can't stop yourself from watching with sickening interest, anxiously waiting to see what happens next (even though you know how it will turn out) like some junkie waiting for his next fix. It's sickening but true, I'm guilty of being part of said population. It’s a guilty pleasure; it’s an easy read and fun to watch. I wouldn’t take the series too seriously.\\n\\n\r\nBut wait, I must have something else positive to say… like I said: easy to follow, pretty to look at, they are a few select scenes that are good and sometimes the jokes can be funny. It has good parts here and there. The plot isn’t so appalling and the manga does pick up in the later volumes.\\n\\n\r\nThe big problem I have with the anime of Vampire Knight is the wasted potential; instead of giving us a heroine that evolves we're stuck with a whiny, weak lead. There's also a lot of potential for darker themes: obsession, self-hate, jealousy, possessiveness and violence. It does dabble a bit in the dark themes but it simply never pulls through. Instead we're given predictable melodrama. \\n\\n\r\nThe obsession is downplayed to 'passionate' and 'eternal' love; the self-hate comes across being excessively broody and melancholic; the jealousy card is a main factor in the story but it's more like a high school debacle - which I suppose suits the story considering they are in an academy, but it has to be pointed out that story does involve vampires which I expect a more serious and dangerous tone to said jealousy. The possessiveness of Kaname is well played, he plays the role of the manipulative and controlling smooth-operator well; however, in the end the fact that Yuki is so accepting and submissive to him you can't help but feel the shojo-iness oozing out - it's sexy when a guy is possessive and controlling. :disbelief: Not the best role model for young girls. Finally the violence, well, it's there but it really isn't detailed and as obvious. It's really glazed over. \\n\\n\r\nI suppose you can say it's the Twilight of the Manga world, a love-hate relationship. Albeit personally I find it a cut above - at least the vampires don't sparkle.\\n\\n\r\nIn the end you’ll have those who hate it because it lacks substance and its overall predictable cheesiness, and you’ll have the fans who love the lovey-dovey teenage vampire romance (or the angsty drama). Would I recommend it? Sure, why not, despite all the short comings give it a go it can be quite enjoyable if you give the series a chance to grow on you. I give it a 6/10.",
            "date": "2013-06-13T17:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 100971,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/477202.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/hippokrys",
                "username": "hippokrys"
            },
            "url": "https://myanimelist.net/reviews.php?id=100971"
        },
        {
            "content": "Watching Vampire Knight Guilty is a must after watching Vampire Knight. While the story line develops a lot, it becomes really outlandish and strange. It seems like the creators wanted to \"surprise\" you with as much as they possibly could and some of those surprises made the entire concept of the show seem weird and quite frankly a bit perverted (and not in a good way). By the last few episodes, I had no idea what was going on anymore, and I had to force myself to finish it just so I could finish it.\r\nUnfortunately, I feel like I wasted my time watching this show.I loved the romance and the original concept and story, but where they took it...I do not want to go there ever again. >_____>\\n\\n\r\n5/10",
            "date": "2015-04-07T11:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 185057,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4479662.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sailor_meatball",
                "username": "sailor_meatball"
            },
            "url": "https://myanimelist.net/reviews.php?id=185057"
        },
        {
            "content": "Vampire Knight: Guilty is the continuation of Vampire Knight that picks up the story right where it left off, adding another 13 episodes of content to the anime. At least in my opinion Vampire Knight: Guilty is worse than Vampire knight and you really shouldn’t watch it, but on the off chance you are going to there may be some spoilers in this review. Now that that’s out of the way let's get into this.\r\nStory: \r\nThe story isn’t that bad per se, it’s just the way it’s executed that makes it seem bad. Things like the use of incest about half way through the animeand then the attempt to justify it make the story cringy at times. Pair that up with dry voice acting and this destroys what is a pretty good idea for an anime.\\n\\n\r\nArt:\\n\r\nThe art work in this anime feels kinda like Code Geass but a lot less colourful. I think that this style of art works really well for the anime and does a good job of expressing the moody feel that the environment would have in the world of Vampire Knight. \\n\\n\r\nMusic:\\n\r\nThe music in this anime is pretty bad. The opening was ok at best and ending was terrible. The music didn't really fit with that anime and the background music was so quiet I couldn't even hear it most of the time.\\n\\n\r\nCharacters:\\n\r\nThe characters are one of this shows biggest weaknesses. Out of the three main characters Yuki, Kaname, and Zero the only one who seems to have any personality is Zero, and he doesn’t have much of a personality in the first place. Rei from Neon Genesis Evangelion has more of a personality then Yuki and Kaname put together, and the whole point of her character is to not have a personality. The side characters aren't any better, they too have no personality or motives for that matter.\\n\\n\r\nIn short, this is probably one of the worst animes i've seen thus far and it’s not something you should waste your time on to any degree. \\n",
            "date": "2018-04-09T11:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 277541,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6541681.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 2,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TypicalWeeb",
                "username": "TypicalWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=277541"
        },
        {
            "content": "\"Vampire Knight Guilty\" is the bookend to the \"Vampire Knight\" series. It succeeds in some areas where it's predecessor failed, but still doesn't redeem the series to anything more than mediocrity.\r\nI was really, really, hoping for a spectacular conclusion. And while the second half is better than the first, I still feel left like I was a vampire given those blood tablets instead of the real thing. And that sucks. All puns intended.\r\nThe art, music, characters, and voice acting are still much the same. Japanese cast beats the English one, again. The story is a very much mixed bag. It had a pretty good twistat the end, but that was negated by the final big bad guy they had built up to being a flash in the pan. I was more interested in the side characters battles than the supposedly \"big\" one going on between the main characters.\\n\\n\r\nThe thing I hated most was the fail in character development that was Kaname Kuran. So bland. So boring. Trying so hard to be a bad ass. It was like watching Hayden Christensen if he was in \"Twilight\". I had such high hopes. Making up for it was the best part, the long-awaited emergence of Headmaster Kaien Cross as the total bad ass they always said he was. He will, by far, be the most memorable character of this show to me.\\n\\n\r\nThink of \"Vampire Knight Guilty\" as the end of a lousy day at work. Looking back, maybe it wasn't that bad. But, the best part about it is that it's over. So, we can just pop a cold one and think about what could have been done instead to avoid so much frustration. Sadly, all we can do is wonder. Cheers!",
            "date": "2016-06-03T23:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 219952,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5233934.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/GarlandReese",
                "username": "GarlandReese"
            },
            "url": "https://myanimelist.net/reviews.php?id=219952"
        },
        {
            "content": "Ok this one was much better, more action and more twists along the way. Zero falling and struggling but we get Kanames intervention for his own uses.I again love the art work and screen play the music not as good as the first. The story takes a surprising twist when yuki discovers who she is in relation to Kaname so dam to any hope of a love interest. Zero and his brother have an intresting meet up and eventually in a dark way his brther dies and Zero has to become like that he hates to survive. A darker force starts to take over theplot. oh one thing to the producers !!!! make another series everyones confused about the ending !!! but overal great anime to watch.",
            "date": "2010-06-17T22:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 27273,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/342838.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Elfsire",
                "username": "Elfsire"
            },
            "url": "https://myanimelist.net/reviews.php?id=27273"
        },
        {
            "content": "Story 8/10\r\nThe story actually got somewhat better in this season. But then BAMM. The end got a bit erm weird. But after some reaserch I realized they didn't explain everything in the Anime therfor if you watch this, you should look up what ever seems creepy in the manga.  \r\nArt. 9/10 \r\nWas also better in the season. Because I liked the how they drew and portrayed some of the scenes. \r\nSound. 9/10\r\nAgain better in the second season because I liked more of the music they used.\r\nCharacters. 8/10\r\nThey didn't really change much. Apart from Yuki, but I guess it was also an improvement.\r\nEnjoyment 8/10\r\nAll Ican say is it was much better than the first season. \\n\\n\r\nOverall 7/10\\n\\n\r\nSeriously, this is just something I would recomened if you wanted to pass the time. It's nothing that special, but it's not unbearable.",
            "date": "2013-06-01T12:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 99325,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2650533.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SecretAnimeLover",
                "username": "SecretAnimeLover"
            },
            "url": "https://myanimelist.net/reviews.php?id=99325"
        },
        {
            "content": "Story: \r\nThe previous series felt like a mad rush to lead up to this one, so this is slightly more mellowed out. Which I found good as since there was a little too much going on with the last series, there were some lose ends. Generally though the story is pretty tantalising and although it is mellower, it's all in a bid to the one penultimate moment, so for me it's forgiveable. I've read others complained of the pacing though for me it's not an issue as we're divulged into more character development. Though I found some aspects of the ending rather confusing, some ofit just seemed to be a convenient plot device without rhyme or reason. I'll put it simply, and without spoilers as much as I can with one word; weapons.\\n\\n\r\nArt: \\n\r\nJust fine, beautiful. But lacking in fluidity of movement and expressions in characters. I appreciate  a more artistic approach to some scenes. And given the Animators talent, I felt this could've been a possibility.\\n\\n\r\nSound: \\n\r\nIntro the same as last season but different ending song, very creepy still though, rather nice. I would've liked more expression of tension from some of the V.As.\\n\\n\r\nCharacter:\\n\r\nWe're taken more into the stories of the previously ignored characters, which I found enjoyable, Headmaster still provides comic relief. And some is still maintained by Yuki and Hanabusa. The plot thickens and we're provided with some interesting stories.\\n\\n\r\nAs I said for my review for the previous series. I wanted to enjoy it more than I did but unfortunately I was dissatisfied with some aspects. But there was still enough to keep me going to continue watching the series and keep me interested.\\n\\n\r\nSPOILERS: show less now.\\n\r\nI found it rather confusing, Zero's imminent depravity into Level E is somehow forgotten? As he makes a promise to Yuki in the last episode and I'm thinking, but won't he be dead soon? Perhaps it was subdued by the blow she delivered, but I cannot fathom it. It wasn't clear to me. Perhaps I missed something or it was lost in translation.\\n\r\nI'm also baffled by the Association President thirst for blood despite being human. And then shattering like glass?\\n\r\nPerhaps I'll find my answers in the Manga...",
            "date": "2015-11-19T02:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 203695,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4968534.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MagicalCadet",
                "username": "MagicalCadet"
            },
            "url": "https://myanimelist.net/reviews.php?id=203695"
        },
        {
            "content": "This will be a review for both seasons 1 and 2 of Vampire Knight.\r\nStill a better love story than Twilight... but let's face it, Vampire Knight is similar in a lot of ways, only the vampires don't sparkle, and there are no shirtless werewolves.\r\nVampire Knight was clichéd in a lot of ways. One girl, a bunch of sexy guys fighting to be her lover, plot twists, and corny lines... so many corny lines...  what we have here is the perfect example of what love stories should not be like if you're trying to make something original and enjoyable. But don't get me wrong, Ididn't hate the series, but I didn't love it.\\n\\n\r\nThe story goes like this: Yuuki Cross, a teenage girl who attends an academy whose classes are split up into 2 different sections, the Day Class (for the humans), and the Night Class (for the vampires). Being head of the disciplinary committee, it's her job to keep all the raving teenage girls from going all fangirl on all the gorgeous night class students, while holding back feelings for the leader of the night class, Kaname. By her side, her somewhat adopted brother (I guess, don't really know a better term for it...), Zero, helps her out with her job as a member of the disciplinary committee himself, although he in no way has any feelings towards vampires himself other than pure hatred. With all of these crazy things going on, it's basically a \"Who will Yuki choose in the end?\" deal. There are plenty of other anime with a similar plotline, although I feel like the ones without vampires would be about 10 times more interesting.\\n\\n\r\nStudio Deen! The studio that brought us hit anime such as \"Higurashi\", \"Dragon Crisis!\", \"Hetalia\", and the well known yaoi dream boat of an anime \"Junjō Romantica\", and in all honesty, there were some hints in there that made me think, \"Oh, of course Studio Deen would add some similar traits to Junjō Romantica in this...\". The art was one of the few redeeming qualities of Vampire Knight. The characters were well designed, enough to tell them apart at least, the scenery and effects were well done, and I liked the overall mood the design of the show gave off. One of the few things I can actually say I liked.\\n\\n\r\nEnglish Dub or Japanese Dub, whichever you prefer, both were alright in my opinion. Watched season 1 in English, watched season 2 in Japanese. Honestly, both were as good as the other. I liked Vic Mignogna as Zero in the english dub, and I liked Yui Horie as Yuuki in the japanese dub. For english dub fans, you won't be disappointed, and the same goes for the japanese dub fans. It's not extraordinary work, but it's nothing terrible like some anime.\\n\\n\r\nCharacters are what I had the biggest problem with. Characters are where I felt like I was watching Twilight with their behavior and their personalities. I was screaming at Yuuki to just pick someone to fall for instead of both giving me impressions that she wasn't even thinking about who she was gonna choose. Zero had issues. Plain and simple. He hates vampries, but he goes to school with them. He wants to murder them all, but he guards them. He loves Yuuki, but he's kind of a jerk to her. Which is it Zero, are you gonna be a jerk, or a man with feelings? And then... there's Kaname. I wanted him to just keep away from Yuuki so badly, cause he kept causing trouble for everyone it seemed, especially Zero. Zero is one of Yuuki's best friends, don't try and keep him away from her. Don't be a douche-nozzle... Sorry about the rant, I just have problems with some of the characters, mainly the main ones. As for the minor characters, like the rest of the vampires, I had no problems. They were funny, cool, and didn't cause much trouble, unlike the main characters.\\n\\n\r\nVampire Knight had it's moments. Mainly in the beginning, it was funny, with a little bit of a darker side every once in a while. Then it became a love triangle, plot twists, betrayal, and boom. Twilight. It wasn't terrible, but I gotta be honest, the main reasons I watched this series is because the fangirls in my class wouldn't stop yelling at me to watch it... next they want me to watch Free... God help me.",
            "date": "2014-07-01T10:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 149799,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=149799"
        },
        {
            "content": "I thought Vampire Knight was going to be ending! And I really disappointed.. I was wrong, and yet Vampire Knight has a second season with the same name Vampire Knight (2) well, I was happy after that!\r\nI thought the characters have changed! And no.. They weren't, Kuran Kaname is still fallin' in love with his pureblood little sister Kuran Yuuki, though Kiryuu Zero is falling in love with his childhood friend Yuuki but he pretend not to show his feeling\r\nif you don't yet to watch this anime, I suppose you should watch this anime right away, and it has manga with the same name, story,characters, plot, and arts!",
            "date": "2013-06-26T11:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 102513,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2522035.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AceraScaxe",
                "username": "AceraScaxe"
            },
            "url": "https://myanimelist.net/reviews.php?id=102513"
        },
        {
            "content": "This is the second half of the vampire knight series. \r\nIt's quite different from the manga however, it branches off nicely. Because there were only two seasons I thought that it ended well and adequately.\r\nThe main things stay the same however if you wanted to continue the story through the manga I would suggest reading the manga from the beginning because some important things are left in the anime.\r\nOverall, a great sequel and satisfying ending. It definitely lead me to read the manga because I got sucked in by the plot x)",
            "date": "2011-05-25T22:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 37322,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/488419.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/XDysphoria",
                "username": "XDysphoria"
            },
            "url": "https://myanimelist.net/reviews.php?id=37322"
        },
        {
            "content": "The following review is how I feel about the anime Vampire Knight, and its sequel, Vampire Knight Guilty.\r\n\"You must do what you must do.\" -Kaname Kuran \r\nThis remarkable quote, spoken by one of the best anime characters ever, demonstrates the careful thought that the writers put into this incredible show.\r\nI love everything about this show. One thing in particular that I love is how each character is not just there for the sake of being there. They all have their own importance to the plot development, and may I say that the plot is just phenomenal! I mean VAMPIRES!? LOVE TRIANGLES!? This anime right hereis both original, and creative.\\n\\n\r\nThe most admirable character, though each character is immensely admirable in their own right, is definitely Yuki, our heroine. She is so brave, and not even once doubted herself. (SPOILER WARNING) If I were to have a daughter, I would raise her to be just like Yuki-strong, easygoing, dependable, and a vampire. Her eyes never distracted me in the slightest, unlike the eyes of Brock. (Brock  is a character from the Pokemon franchise, if you've been living under a Brock. Haha get it? Rock, Brock?). Ok so anyway, this show is a must-watch for anyone looking for a compelling and engaging storyline. I have absolutely ZERO (buh-dum-ch) regrets about watching the show in its entirety. Unless you like cheesy and predictable \"dark\" shows aimed at a young female audience, and a \"heroine\" that constantly refers to practically everyone as \"__senpai,\" then PLEASE FOR THE LIVE OF ALL THINGS GOOD IN THIS WORLD skip it. \\n\\n\r\nMeaningful Moments/Quotes\\n\r\n1. Yuki: \"Headmaster!\"\\n\r\nHeadmaster: \"It's not headmaster. Call me father.\" \\n\r\nYuki: \"Father...\"\\n\r\n2. *Headmaster fights against Level E vampires that are attacking the academy*\\n\r\nYuki: \"He is trying to protect the academy.\"\\n\r\n3. \"You must do what you must do.\"\\n\r\n\"Kaname...senpai...\"\\n\r\nAnd, in the next episode, she  feels courageous all of a sudden and says \"Let's go.\" To which Aido replies, \"You sure?\" Then she says \"This is what I must do.\" DAT CHARACTER DEVELOPMENT DOE!!\\n\\n\r\nUnless you like cheesy and predictable \"dark\" shows aimed at a young female audience, and a \"heroine\" that constantly refers to practically everyone as \"__senpai,\" then PLEASE FOR THE LOVE OF ALL THINGS GOOD IN THIS WORLD skip it. Also, the ending stinks. I didn't like either of the male leads, but I guess I dislike Zero a little less than I dislike Kaname. This show is comparable to being given a bowl of glistening frosted flakes, but then once you get a taste of it, you realize that its stale.\\n\\n\r\nAll in all, this show is the pits. I'm only giving it a 2/10 because Kanon Waleshima is an awesome cellist and artist. \\n\\n\\n\\n\\n",
            "date": "2015-06-24T19:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 191173,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4685614.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Missyclaire",
                "username": "Missyclaire"
            },
            "url": "https://myanimelist.net/reviews.php?id=191173"
        },
        {
            "content": "Okay., I wonder why the vampire thingy has becoming one of the most preferred obsessions of this generation when it comes to anime,movies, and YA novels. It seems that somehow., we, the over-enthusiastic people really do wish that vampires exist!!! *talking about crazy fangirls* \r\nHonestly., the very reason why I gave myself a chance to see this very popular anime title*hmm., aside from the fact that I kinda like the story's plot* was all because of this certain character named Zero Kiryuu. Yeah., the super hot, white-haired guy who turns out to be a cold-blooded vampire!!! *damn you Yuuki!! how dare you bit my Zero!!He still hasn't gotten a bite on my neck!!!! *\\n\\n\r\nWell., Vampire Knight Guilty is the sequel., Vk being the first season. Actually., the second one is quite better than the first one, in my book. :)) Finally., it became clear to Yuki, as well as for us Vk addicts or just viewers, the truth behind her lost memories. and of course we learned about her family. *Oh Kaname., you know for yourself that you're handsome, and hot, and cool, and popular. But sorry dear, your charm didn't work on me. Zero beats you! * 0* \\n\\n\r\nAnyways., the art is just... just.. superb I guess. I loooove the blood!!! the *Zero bites Yuki--Kaname bites Yuki--Yuuki bites... herself, err.. Zero!thingamabob :PP *  VKG also offers plenty of stunning-looking characters!! \"Oh hail Ichiru and the Night Class students\" .< *spoiler!!! ---- Curse that second 'I think?' episode!!! Zero what the heck!! he almost kissed Yuki!! oh 'almost'... i hate you in this series!!!",
            "date": "2011-07-28T09:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 40179,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/517965.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lynchan",
                "username": "Lynchan"
            },
            "url": "https://myanimelist.net/reviews.php?id=40179"
        },
        {
            "content": "Story: 8/10\r\nI liked the story, it could have been better but i still liked it. The twins had a nice story with them in both series.\r\nArt: 10/10\r\nthe Art was awesome in my opnion.. i loved how all the characters were drawn.\r\nsound 8/10\r\nsound.. there wasnt a whole lot of musical moments. The themes were okay.\r\nCharacter 10/10\r\nokay yes they were awesome as well.. i love how some people say she got treated like crap by zero and yet he loved her.. THAT IS LOVE. Love isnt about getting treated like a princess 24 hours a day. \r\nEnjoyment: 10/10\r\ni loved this show. I love vampire shows, i lovethis type of story and art.. one of my favorites.\\n\\n\r\nOverall 9/10\\n\\n\r\ni didnt like the ending.. it seemed rushed but still loved the show.",
            "date": "2011-01-20T09:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 33904,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/376541.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Denessa",
                "username": "Denessa"
            },
            "url": "https://myanimelist.net/reviews.php?id=33904"
        },
        {
            "content": "They are back with more of their irresistible sexiness and gloomy yet cool looks.\r\nThis sequel is way even better from the previous season where it was more of an introduction and the story focused more on Zero. In this season, Kaname and Yuki’s real identities are reveal. Friendships and love as well are tested with the appearance of a new villain and huge revelations. We see how miserable and complicated the lives of the pureblood vampires. \r\nAgain, the characters are all gorgeous looking. Main characters, supporting, extra, and even the villains are so beautiful. Seriously, if I said in the previous season that I slightlydislike Yuki; in this sequel I extremely hate her. She keeps on doing stupid and unnecessary things. She does things which she thinks are heroic when she herself is weak and so end up being a bother to others. It is not cool at all. If you can’t help at all then you might as well stay away from danger as to not go in the way of others. That’s the least that you could do. She’s very dramatic, too. But what most irritates me is the very obvious fact that she’s also in love with Zero. To be honest, it really looks like to me that she both loves Kaname and Zero. When she found out her real identity, the very first thing that she worries is Zero. How Zero would feel about her and all that stuffs.  Compared to her relationship to Kaname, her bond with Zero is way stronger. It might be complicated but her feelings for Zero is so strong. Sometimes I even doubt her feelings to Kaname. Perhaps she loves them both but her feelings for Zero are stronger. Despite that, I don’t hate Zero. In fact, I pity him and Kaname as well. Both of them suffered a lot and because of that they are very lonely people. I seriously question why they are so head over heels with Yuki. Especially Kaname. He is the epitome of an enigmatic and cool guy. He’s not only strong but very smart as well. I’ve been in love with him for so many years now. But despite everything else; all of them are such lonely creatures. It just shows that despite having powers, wealth and eternal life, happiness is still not guaranteed. \\n\\n\r\nWith a very short distance from the time where the season one ended, the animation of this sequel is not so different from the previous one. Still, the animation is one of the best among all of today’s animes. The characters and scenes are very much well made. \\n\\n\r\nI am sure going to miss these guys. Even though I will follow them in manga, I still would want to see them more on the anime version.\\n",
            "date": "2012-12-09T07:56:00+00:00",
            "helpful_count": 0,
            "mal_id": 79626,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79626"
        },
        {
            "content": "This story had a great plot to begin with, it probably could hook almost any girl, and of course hooked me as well. After finishing this story, I immediately took to reading the manga, the plot had intrigued me despite the decent-at-best delivery of it in the anime. The manga is absolutely amazing! A tear jerker, with great character development. You feel so much more connected in the manga. I suggest anyone who is thinking or watching the anime or had already watched it to consider reading the manga.\r\nStory (6/10): The plot is very fascinating, and the way the characters are involved in the storyis also very interesting. Despite this great background and base, the anime did not really deliver it well. I love the plot line so much, but it didn't really appeal to me anymore throughout both the seasons of the anime.\\n\\n\r\nArt (6/10): It was decent, it was okay. It was extremely similar to the last season, not saying that that's a bad thing. The colors matched the theme and all, but it wasn't anything extraordinary. \\n\\n\r\nSound (8-9/10): The OSTs and all of the music used in both seasons are just absolutely amazing. If I were to tell you to stay for one thing, it would be the music.\\n\\n\r\nCharacter (7/10): Okay, I have to admit that there was character development, and the relationships between the characters are clearly shown and grown through all of the flashbacks. HOWEVER! I can't help but despise Yuki, the main character. She just ticks me off and annoys me so much. Zero and Kaname, among all of the other characters, are very well developed. They both have a... horrible past, and you can really see how it shaped them as characters, as well as shaped the other people around them. I'm just happy that they were main characters as well, or I would have ripped my hair out.\\n\\n\r\nEnjoyment (7/10): It wasn't bad, it wasn't amazing. It was a good past time. I gave the manga a chance because of the fact that I didn't hate the anime.\\n\\n\r\nOverall (7-8/10): I'm giving it the extra mark because of the manga. The manga is absolutely amazing, and it brought tears to my eyes. Both of happiness and sadness. The relief and the grief that accompanied the rollercoaster also known as the Vampire Knight manga was sooo worth it. The manga is amazing, the ending is just.... I don't even have words to describe it... Ugh, just ugh. It's simply one of the most satisfying, yet heart wrenching endings I have ever read/watched.",
            "date": "2014-10-03T09:42:00+00:00",
            "helpful_count": 0,
            "mal_id": 163405,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1389923.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/liidistorted",
                "username": "liidistorted"
            },
            "url": "https://myanimelist.net/reviews.php?id=163405"
        },
        {
            "content": "The double-edge swords with this anime is that 1): it takes too long to build up and 2): there's not enough action. Considering how the lot of animu nowadays consist of strong females (and pansy-arse males) for the lonely otaku audience, VampKnight Guilty's \"flaws\" can be overlooked.\r\nI'm not gonna dwell on what's obviously obvious in this show. But I will say that there's little hesitation when it comes to fang-sinking and blood-drinking. Which is AWESOMAGE orz and what needs to be seen in some entertainment piece about people who are vampires.",
            "date": "2011-10-06T12:41:00+00:00",
            "helpful_count": 0,
            "mal_id": 44955,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=44955"
        }
    ]
]