[
    [
        {
            "content": "When I first started watching this series, I originally thought, “Oh, it's just another anime with cool guys and girls using superpowers and flying around like Superman-wannabees.”. Of course, that was before I watched its parent story, Zettai Karen Children. But more so, it was before I fully embraced the  spinoff known as Zettai Karen Children: The Unlimited - Hyoubu Kyousuke. This new piece of work that Manglobe is presenting here could be defined as their latest line in their evolution of supernatural phenomenon. In fact, Zettai Karen Children: The Unlimited takes supernatural with a world of super powers and transforms it into profoundpsychic tale starring....\\n\\n\r\nThe one and only Hyoubu Kyousuke\\n\\n\r\nZettai Karen Children: The Unlimited - Hyoubu Kyousuke is a spinoff the original Zettai Karen Children. It is presented by Manglobe, a Japanese anime studio, who is known for some of its other works involving supernatural such as Deadman Wonderland, Ergo Proxy, and The World That God Only Knows. And now here we are with their latest presentation. Now, this series can spell out a lot of questions for potential fans. One of most common ones may be something along the line of, “Do I need to watch the original Zettai Karen Children?” From my perspective, it is not necessary but I would say that it can open some insight as well as background to this spinoff. But of course, this isn't the parent series. This is UNLIMITED featuring Hyoubu Kyousuke as the star of the show.\\n\\n\r\nThe way the series is adapted is quite a peculiar one from my point of view. Even from the starters, we can clearly see that Hyoubu Kyousuke is not your typical hero. Rather, he can be seen as an anti-hero with the way he dresses, the way he acts, the words he speaks, and the action he commits. With his silver jet hair and floating around the city, he is a man of many mysteries especially behind that devious smile. Even from the beginning, he seems to have devious plans from his head. For example, he has himself taken prisoner on purpose for the reason to save one of his own partners in crime. He often thinks before he acts and is calculating toward his goals. Additionally, Kyousuke seems to be a man with a brilliant mind and often plans strategically in order stay ahead of his adversaries. As the leader of the mysterious organization, P.A.N.D.R.A, Kyosuke shows why he is the leader with his ruthlessness when events calls for it. He really is a star of his own show here folks.\\n\\n\r\nHaving seen the original series, Zettai Karen Children, this spinoff originally put me on odds side with Kyousuke. In fact, he is an antagonist from the original title. Here, he is portrayed as a protagonist. (although I see him more as an anti-hero) I found out the easy way during the first few episodes when Kyousuke is able to pull off his plan in his own 'heroic' effort. With that, he even meets a new friend by the name of Andy Hinomiya. He has a mysterious power of his own that can be compared to a certain unlucky protagonist from another series. I won't spoil here so watch more to find out. At any rate, he is introduced as an anime original character who joins  P.A.N.D.R.A. His friendship with Kyousuke seems to be based on both fear and respect. Yet, they do work hand-in-hand and often times gets the job done. Speaking of anime original, there is the cute Yuugiri. She is a strange girl with the ability to read minds but that often puts her at odds with society. She is even viewed sometimes as a 'monster' for just being an esper. This isn't surprising though as the world often sees those who are special regarded as being a threat to society. Among others of the team includes includes some returning characters from the original series such as You Fujiura, Momiji Kanou, and Shirou Magi. They make up the firepower of the team and gives  P.A.N.D.R.A a reason to being so feared and dominant.\\n\\n\r\nSo, this spinoff takes the setting in a more dark city atmopshere as opposed to the 'family oriented' atmosphere that the original Zettai Karen bought to us years ago. Honestly, who remembers that stuff anyways? In most of today's anime series, the market often aims at viewers for fan service, gore, and those romance subplots. Thankfully, this series avoids most of that and aims directly towards the story along with its strong cast of characters. With his name being set as the title, it is no surprise that Kyousuke gets the most attention even through the flashback scenes we see in later episodes. The other characters aren't omitted either as they all get his or her own little spotlights.\\n\\n\r\nThe story focuses mainly on the organization that Kyosuke sets up. His idea is to save Espers of his own kind because the way society ostracizes them. In fact, Espers in this spinoff are not seen as saviors of the world but as harbingers of destruction. It can easily be taken the fact even from the pilot episode given Andy's treatment behind that prison. It's cruel for them just because they are “different” from others. The way I see this though is an utter misunderstanding. In fact, some of the people who treats the Espers themselves can be seen as the real monsters to society. It's irony at its very best. However, this shouldn't be entirely be blamed on such trivial accusations that Espers are evil. There have been facts which proves the existence of espers to be a threat in the case of criminals in the series. As a matter of fact, Kyosuke's father ran into a case many years ago that changed his outlook on espers forever. \\n\\n\r\nThe series seems to lack the ultimatum for its plot. I guess the long story short here is that this spinoff contains way too many mysteries. It starts off fast and keeps its pace here and there. As mentioned before, Kyousuke acts with a plan through his head and cunning strategies. But most of the time, I find that this is almost redundant. The guy is nearly unstoppable and presented as being a boss. His powers of flight, telekinesis, and super strength is overpowered as he takes the skies and dominates in most of his fights. Even from the original series, Kyousuke is calculating and manipulative with his actions. In this spinoff, he is no different and often plays his plans like a chessboard. The pieces are his organization but rather than using them, Kyousuke plays the role of a leader leading them through missions. \\n\\n\r\nThe action of the series is also full throttle and packed with explosive warfare. It doesn't run through egoistic dialogues and strange gags but gets straight to the point. Otherwise, it does occasionally lack a bit of flavor as it just seems stale. Additionally, I find the characters' designs to be a bit generic. With the lack of fan service, the characters' clothing makes its impression through..generic designs. Their seemingly lack of attractiveness in their outfits also makes their stance a bit dull. The result often leads to a repetitive fight scenes and in general, a lack of flavor. If they were so 'badass', why not go all out and make the skies your God? \\n\\n\r\nOh wait, they don't need to do that since being OP does all that for them already.\\n\\n\r\nIn terms of overall visuals, I thought the series did a great job here. Taken on the opposite side of the original series, Unlimited makes its way of with more of a cutting dark age background. It's not on a dystopian level but gets its point across in that the world the espers live in is not a paradise. The artwork of the city in fact reflects more of a 'gotham' like atmosphere, one where there are criminals and people who prejudices against others just based on personal outlooks.The characters' design in particular Kyousuke show that they are indeed not normal. I mean, look at that silver hair and you tell me if you see that often in real life. It's definitely not something you see every day. \\n\\n\r\nThe soundtrack of this spinoff makes a strong impression on me. Its organ plays and style of choice in using more of a dramatic tone enhances the theme of a dark series as opposed to the family-oriented Zettai Karen Children. In other words, most of the soundtrack is serious because the series makes its way of being darkier, edgier, and sexier. (in that Unlimited way) The OP song LΛST RESOLUTION (for some reason performed both in English and Japanese), shows the revolution in which Kyousuke sets towards those who are a threat to espers. Oh and those various ED songs? Pleasure to my ears.\\n\\n\r\nOverall, this underrated series gets a score of “8” from me. I don't know about you but Unlimited sure got my attention. No, it's not because I watched the original series so I can get a taste of the spinoff. But rather, the characters, setting, and the general mood of the story gives a more defined way of the psychic world. Despite having some generic/shounen fight styles, I feel that this series pulled it off right. It doesn't seemed to be forced and balances itself well between its subplots. Hell, even the flashback arc was an entertaining watch. Ultimately, I would like to ask people to give this series a shot. It's not perfect but a definitely a way to make your time pass by. At least it did for me. After all, time isn't unlimited so make use of it wisely. This series right here is something you should spent that time on.",
            "date": "2013-03-25T11:18:00+00:00",
            "helpful_count": 151,
            "mal_id": 90853,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=90853"
        },
        {
            "content": "I waited until the end of the series to write my review, and all I have to say: This is one of the most underrated and also best animes of this year. Yes, I know that it's only winter season, but I don't care, I am going to steadfastly stand by that declaration. I have been watching anime for quite some years now, and I've seen some really good ones and some really bad ones. I've seen some that touch my heart and some that make me cringe. However, I have never had one that has consistently from beginning to end, roped me in andhad me anticipating each and every episode with such excitement. I could literally feel the adrenaline rush while watching each episode, and held on to every moment.\\n\\n\r\nThe plot, the story, the characters, the development amongst them all, all top-notch. \\n\r\nThe animation was great, action scenes superb, and the music phenomenal, even the hidden messages within are thoughtful. \\n\\n\r\nWhat's this show about? It involves an alternate world where there are humans that are normal, and humans that have somehow evolved to the point of having ESP (telepathy, telekinesis, pyrokinesis, etc). Those super-powered people are known as \"espers\". However, as always, humanity has a hard time adjusting to things and people who are different and strange, and so espers have been treated with prejudice as monsters and freaks of nature the world-over. One such esper, with powers even beyond that of other espers, has been ravaged and scarred by such a bigoted society. His name is Major Kyosuke Hyobu and he has, in answer to the injustices against his people, formed an organization that strives to protect espers and their rights as human beings by any means necessary. This organization is known as PANDRA. However, when Major Hyobu meets a peculiar esper named Andy Hinomiya who has secrets of his own, dark storm clouds may soon be in the horizon for PANDRA.\\n\\n\r\nOne thing to know, is that I love X-Men, and as you can tell, the synopsis sounds very similar to the world that the X-Men live in. Hyobu is often compared to Magneto in many ways, with PANDRA alike to the Brotherhood of Evil Mutants. However, I like Hyobu even more, as the man is more powerful, but also more complex, having layers to his psyche and to his character. The other main character of this show, Andy, is the stand-in for the audience and he plays his part well, as one of the most interesting and likable characters in the show.\\n\\n\r\nThis series is 12 episodes long and while the ending was quite satisfying, I cannot deny that I deeply wish for a sequel. This show was so underrated because of the fact that it is touted as a \"spin-off\" show from a under-performing less-popular 2008 anime, known as Zettai Karen Children or \"Psychic Squad\" in the States. However, this show can stand very well on its own and does not need the other show for exposition. It is completely different in tone and style and the only thing really similar is the setting and characters that have now been transferred to a completely different plot line. Many thought that you had to watch the original series in order to watch this one, and as the original series is 55+ episodes, no one was truly willing to go through that. However, I am here to tell you that I started this show without ever having even heard of Zettai Karen Children. You DO NOT need to see the original show to see this one. You can easily understand everything without having read or watched any original material. \\n\\n\r\nOkay, I think I have droned on enough, but I can't stress more how awesome this show is. I loved every minute of it and I hope that anyone who looks at it as well will get as much enjoyment out of it as I did. I sincerely hope there will be a second season as 12 episodes just isn't enough.\\n\\n\r\nNow get out of here and go WATCH IT!",
            "date": "2013-03-25T20:49:00+00:00",
            "helpful_count": 99,
            "mal_id": 90921,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2211315.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Irenesharda",
                "username": "Irenesharda"
            },
            "url": "https://myanimelist.net/reviews.php?id=90921"
        },
        {
            "content": "Why is know one watching this show? Literally not one person i know has even considered it.\r\nI've not watched much of the original Zettai Karen Children, the age of the cast, and tone of the show, suggested i wasn't going to get remotely near 50+ episode interest levels.  \r\nBut both short comings are now gone, the show is an appealing 12 episodes, the original cast are all several years older and supporting characters, with a significantly older cast put in place, and the tone seems far more serious. Think the difference between Fate Zero and Fate/Stay Night.\r\nAny prior knowledge of the franchise seems completelyoptional, I've had no trouble following the events and characters to this point, the pacing is fast and entertaining, the art is reasonable enough, people regularly die, and most of the main cast seem less than indispensable. Theres a reasonable story going on, with the character loyalties remaining up in the air, and lots of morality themes.\\n\\n\r\nNot unmissable, but far more people should give this show a try, any fans of action shows, or anything with espers/power users should find this a good watch.\\n",
            "date": "2013-02-04T10:35:00+00:00",
            "helpful_count": 57,
            "mal_id": 85819,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/107003.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nipsirc",
                "username": "Nipsirc"
            },
            "url": "https://myanimelist.net/reviews.php?id=85819"
        },
        {
            "content": "This anime is 12 episodes long. It's fast paced with lots of action scenes, sarcastic moments, sad moments, pretty much everything. When i first saw the first episode i knew i was going to enjoy this anime. It has that compassion side towards it, where not many action anime's have it so early into the anime. \r\nStory 9/10\r\nI've rated the story 9/10 because for starters, it's 12 episodes long. It's fast paced which i like especially for a short series. The plot makes sense, and the pace is very smooth.\r\nArt 10/10\r\nThe art you see in this anime may remind you of the newer animes, likeHamatora or Jormungand. They spice up the art to look exactly what you'd want! For an evil bad guy, or a good guy with hatred in his soul, they certainly focus to bring out the key details to make you want to go, \"WOW This anime Has it!\"\\n\\n\r\nSound 10/10\\n\\n\r\nI love the OST's. It's so filling, with every battle scene the background music is insane! Legit hype. Definitely lives up to having one of the best OST's out there.\\n\\n\r\nCharacter 7/10\\n\\n\r\nThe character development is fairly decent. At first you have your Main character, (DONT WORRY NO SPOILERS!) Who's trying to find his power. How do they go upon this? Well...he meets new people, and blah blah blah. . It goes on from there! I rated this a 7/10 solely because of how they went about to show how he develops, mainly towards the acting part and just...the way how they did it.\\n\\n\r\nEnjoyment 10/10\\n\\n\r\nI solely enjoyed this anime to the fullest! I've watched it all and I Absolutely Love it! It's just like Hamatora, HxH 2011, A hint of DBZ maybe, Jormungand, basically it's an all around perfect anime! Obviously there's more anime's i can name that are similar to this one, but that would just make this review too long xD.\\n\\n\r\nOverall 10/10\\n\\n\r\nYes it's true, a 10/10 Anime! Whoever watches this anime will come out loving it! The art, the humor, the plot, the characters, everything! Well. . . what really caught my attention was how the characters acts towards one another. It's not that usual anime where if somethings bothering one of our MC's, the other MC will just be like, oh, okay well hope you get better. NO! It's more than that! Its...Its...ART!",
            "date": "2015-02-17T19:41:00+00:00",
            "helpful_count": 34,
            "mal_id": 180678,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4103311.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/B3astpwn",
                "username": "B3astpwn"
            },
            "url": "https://myanimelist.net/reviews.php?id=180678"
        },
        {
            "content": "The Unlimited - Hyoubu Kyousuke: It Has Its Limits\r\nZettai Karen Children: The Unlimited was actually one of the more surprisingly good series I watched out of the Winter 2013 lineup. One of the nice things about this series is while it does have the Zettai Karen Children name slapped to this series, you don't actually have to watch the original Zettai Karen Children to understand the story. I certainly hope that didn't deter anyone from watching this series, because it nearly deterred me since I originally had no interest in the series. I originally thought you had to watch the first Zettai Karen Children tofollow the plot...and after hearing about how mediocre that series was, I wasn't looking forward to it. As I said, you fortunately don't have to sit through Zettai Karen Children to understand it since this is more an alternative setting that's connected to that series.\\n\\n\r\nThe story follows the story of a powerful anti-hero esper named Kyousuke Hyoubu that leads PANDRA, a band of espers against a society that generally doesn't accept espers equally. Espers are commonly imprisoned or used by government organizations for their own personal gain. The story begins with Kyousuke breaking into an esper prison to rescue one of his PANDRA members that had been imprisoned there. While in the prison, he receives assistance from an inmate named Andy Hinomiya. After successfully accomplishing the prison break, Andy decides to join PANDRA and assist Kyousuke with his goals of recruiting espers and trying to bring an end to humanity's rule over espers. However, it turns out Andy has a different goal in mind when he joins the group. Overall, I found the story to be fairly good and the plot itself to be outstanding. I was intrigued by the plot and found it to be an interesting set piece on how unforgiving society can be towards people that can be considered different.\\n\\n\r\nThe strongest aspect of The Unlimited was its animation. I found the animation to be downright gorgeous. The character designs were precise, clear cut, and reflected the personalities of each character rather well. However, where this series really shined was the atmospheric animation when an esper was releasing their power, like when Kyousuke or Yugiri were releasing their powers. It really did a great job of creating a feel that espers are all-powerful beings and provide a reason why they are feared in a normal human society. My jaw dropped at how gorgeous the animation was when Kyousuke turned off his limiter. I have to give credit to Manglobe, they are on their A-game when they create dark, atmospheric anime like this one. This is not a sunshine and rainbows series. The animation is dark, gritty, and can get downright graphic at times. While I wouldn't put it in the same category as a Deadman Wonderland for its grittiness or Ergo Proxy for its dark atmosphere, it seems to do a nice job of balancing the two. It's actually impressive considering Shishou Igarashi (Director) and Jun Takagi (Chief Animation Director) aren't the most experienced in anime directing. This was definitely a good stepping stone for their careers if they can continue to create animes as polished as this one from an animation standpoint. \\n\\n\r\nThe music and voice acting was also incredibly strong as well. The music really knew how to set the mood and I have to give a ton of credit to Koutarou Nakagawa for creating such an excellent soundtrack. Personally speaking, I have a lot of respect for his prior works that include Code Geass, Gosick, and Scryed to name a few. He brought out his best for this series as well and it paid off. The seiyuus were also remarkably well-cast, with most of the original Zettai Karen Children cast returning to their roles for this series. Kouji Yusa returned to his role of Kyousuke, which I must be glad for because he seemed to play the role of a mysterious, all-powerful esper perfectly. Junichi Suwabe played the role of the eccentric, but naive Andy quite well and the young, up-and-coming Nao Touyama's portrayal of Yugiri was downright adorable. I even got a laugh at how dynamic the castmembers were. Aya Hirano played both Kaoru from The Children AND a young Kyousuke from flashbacks...and the scary part was I couldn't even tell she was playing both roles until I read the cast listing. Just more proof that Aya Hirano is one of the best in the business. I will give Manglobe one thing, they do excellent cast work and even I have to admit, I got a chuckle out of the subtle Nostalgia Critic and Angry Video Game Nerd reference in one of the episodes.\\n\\n\r\nWhere The Unlimited fell a little short in my opinion, with the pun intended, was the length. Considering how detailed the plot was, it felt like there wasn't enough time to hash out the characters. It was slightly difficult to get attached to the other PANDRA members besides the leads because their exposure was limited and the supporting cast aboard the Catastrophe didn't get a whole lot of development. Although, perhaps they received that development in the original series and I just wasn't exposed to it, but it felt a little difficult to become attached to PANDRA's team dynamic. Considering the feel of the series, plot elements seemed slightly rushed at times. The team sort of jumped from one plot point to the next with little rhyme or reason. I also found the flashback back story to be a little out of place and slightly mundane. I didn't feel as though it added a whole lot to the story...or rather its focus didn't add much. It did play a big role in the story as it wore on, but I felt its focus was a bit off since it didn't seem to portray Saotome's character motivations very well. The way segments were edited during the series, it seemed as though this series was longer, but editorial mandate required things to be cut altogether. \"Cut-and-paste\" is really the best way I can describe this series at times. It didn't completely ruin my Unlimited viewing experience, but it was quite noticeable.\\n\\n\r\nOn the whole, The Unlimited is a REALLY good series to watch if you're looking for a supernatural shounen series. It has an awesome plot and an interesting cast of characters (albeit somewhat underdeveloped) with excellent animation and a very nice, atmospheric soundtrack. While I wouldn't call The Unlimited an amazing series, I would call it a rather pleasant surprise. I got a lot more than I expected when I started to watch it. It's a shame this series just wasn't a tad bit longer because there was quite a lot of material to work with. This series certainly had a ton of potential. I did feel this series ended on a pretty good note since it had a satisfying ending. It concluded rather well, but also left enough open to continue if Manglobe does decide to do so. If nothing else, this series certainly did a wonderful job of advertising for its predecessor. I am somewhat intrigued to watch Zettai Karen Children now despite it being considered a somewhat mediocre series by the general public. Perhaps if these two series tie in well together, it might alleviate some areas of mediocrity both series might have had. I would highly recommend this series if you enjoyed animes like To Aru Majutsu no Index or Deadman Wonderland. It has similar psychic elements compared to Index, but also has the beautifully atmospheric animation and social commentary comparable to Deadman Wonderland, although not as gritty. Overall, the Unlimited isn't an amazing series, but is still a fun watch for those that enjoy some exciting psychic-powered action.",
            "date": "2013-03-26T18:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 91053,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=91053"
        },
        {
            "content": "(First review so you know the drill with these. not going to go into sound art and the other stuff, cause quite frankly I can't judge them).\r\nWhen I first heard that Zettai Karen Children was getting a new anime I was delighted. Having read all the current chapters and watch the first series and OVA, I was disappointed to heard that it was going to be a spin-off. However that was soon changed after watching it. \r\nBased during the time skip of the manga (when they went from elementary to middle school), the story following Andy Hinomiya as he joins Pandra, a esper terrorist group.Essentially the group is like the X-men's comic Brotherhood of Mutant with Hyoubu being Magneto. And like Magneto you learn about his sad past and learn he is not all evil.\\n\\n\r\nThe story is a much darker story to the original series but it make it a standalone series. Do have to have watch the first series to watch this? No. Just read the synopsis  for it for figure out the back story.\\n\\n\r\nI recommend this is to anyone, whether your a fan of ZKC first series or not. The only reason I gave it a 9 instead of ten is because it's a spin-off (with a few manga chapter in it, Hyoubu's past). But that just the fan boy instead me.",
            "date": "2013-03-05T10:21:00+00:00",
            "helpful_count": 13,
            "mal_id": 88767,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/238353.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/komic",
                "username": "komic"
            },
            "url": "https://myanimelist.net/reviews.php?id=88767"
        },
        {
            "content": "This review will spoil nothing outside of the first episode.\r\nThat said, the first episode has a great twist at the end that will likely have you raising your eyebrows in curiosity and shock, hopefully hooking you into it as it did me. Additionally, it's a super introduction to the series, so check it out if you know absolutely nothing about this show or the characters; it introduces the main cast, provides a taste of the series' dark tone, has a stellar climax, and a plot twist at the end to boot. Give it a shot, and then come back if you want to know whatI think about the rest of the series.\\n\\n\\n\\n\\n\r\nFrom here on, the first episode, and only the first episode, will be spoiled.\\n\\n\\n\\n\\n\r\nSeries Overview:\\n\r\n\"Courtesy of Zettai Karen Children: The Unlimited - Hyoubu Kyousuke\" was known in the U.S. as \"Unlimited Psychic Squad\", but is better known as just \"The Unlimited - Hyoubu Kyousuke\". It is a 12 episode seinen spin-off of the shounen manga series \"Zettai Karen Children\" which itself received a 51 episode series and is an all-around fun time, but not much better than a 7 out of 10. While its predecessor is very light and almost shoujo in some aspects regarding its tone and writing, The Unlimited is quite the opposite; while it has its share of comedic and heartfelt moments, the series as a whole is very serious, and revels in the darkness portrayed by villains who will stop at nothing and stoop to any low to see the main characters, or really all espers, killed or experimented on. Thankfully, this show is rather shy on displays of gratuitous blood and violence, but it has its moments that are not for the faint of heart, just not nearly to the degree of another series animated by studio manglobe, Deadman Wonderland. Overall, The Unlimited - Hyoubu Kyousuke is, at least in my opinion, a hidden gem of an anime that anybody who has love for Marvel's X-men or = superhero anime as a whole will enjoy, but also anybody who understands the struggles of being different from those around him/her and feels the need to fight to maintain his/her identity and not be victimized by it.\\n\\n\r\nStory and Characters:\\n\r\nThis show is indeed a spin-off of a very long-running manga series, but fret not. Everything you could possibly need to know is explained in the first episode, and in well-written ways, not just overt exposition. Despite the amazing first episode, I feel obligated to summarize much of the series' opening act in this section. The setting is this: since shortly before World War II, people with supernatural ESP powers, also known as espers, have begun cropping up all over the world. One of our main characters is the leader of a quasi-terrorist pro-esper rights cell called P.A.N.D.R.A. That leader, Hyoubu Kyousuke, is an 80+ year-old man who is so overpowered he can literally make himself young and simultaneously dominate anyone who goes up against him. Most espers only have a single power, but he has a whole lineup of them, including hypnosis, telekinesis, teleportation, and even fire and lightning powers for a couple seconds. An easy analogy would be to compare P.A.N.D.R.A to Marvel's X-men, specifically the Brotherhood of Mutants and their crazy-powerful leader Magneto. Hyoubu is only the first of our main heroes, though. Andy Hinomiya is a Japanese-American who, at the end of the first episode, is invited to join P.A.N.D.R.A. as a junior member. What nobody knows is that he is actually an investigator for the United States Esper Investigations (USEI) and is attempting to bring the terrorist group P.A.N.D.R.A down from the inside while securing a secret device from them for his superiors. However, as Andy bonds with Hyoubu and the youngest member of P.A.N.D.R.A., an extremely powerful and vulnerable little girl named Yugiri, he calls the morals of his mission into question, and is caught between staying faithful to his esper-hating superiors and the new family that these apparent terrorists have built into their organization, a family to which he now belongs. Meanwhile, we get a deep dive into Hyoubu's psyche as well, allowing us to truly understand why he does what he does and how much he truly loves his people, whether they are with P.A.N.D.R.A. or not. Additionally, some characters from Zettai Karen Children appear, namely the titular Children and a few of their adult comrades, but they aren't really worth mentioning here, as while they do serve some roles in the plot, they aren't essential to the core of the story.\\n\r\nOverall, though, I absolutely loved (no pun intended) the plot of The Unlimited; it's dark and depressing, but also hopeful and endearing. It features characters having to make impossible decisions that have significant ramifications for those close to them, but also captures a familial sensation unlike most anime before it. The story is engaging, the characters are dynamic, the character interactions are brilliantly written, and it's heartwarming to see our heroes overcome the odds that are stacked astronomically against them, even with Hyoubu being vastly overpowered.\\n\\n\r\nArt and Animation:\\n\r\nSamurai Champloo is a brilliantly animated series, but manglobe have really outdone themselves with The Unlimited- Hyoubu Kyousuke. To see an example of how good this series looks, just watch the opening theme; the animation from the show itself, believe it or not, actually surpassing what is seen there (a bit more on this in the next section). And it's not just the animation that's fantastic, but also the artwork: crisp, detailed, totally unique character designs combined with some amazing backgrounds really sell the look's quality, and all of these come together beautifully, with little to no CG, by the way, in some of the most incredible action sequences in anime before shows like One Punch Man, HeroAca, and Mob Psycho 100 captured the spotlight. Even if the story doesn't interest you, or you find the characters boring, but still have an appreciation for top-notch animation quality, you would be remiss to pass up this show. It's that good.\\n\\n\r\nSound and Music:\\n\r\nHoo boy, where do I even begin? Well, let's start with the show's actual score: it's great. The music is extremely evocative of the moments' tones, be they light or dark, especially in action sequences, which don't necessarily raise the level of hype so much as accentuate the reasons for the fighting that takes place, an important theme of the series. But let's move on to the real meat of this section: the opening and ending themes. While the show's action may not be all that hyping, the opening song certainly is! Not only that, as the show's story progresses, the opening's animation style and colors change, showcasing different visuals, schemes, and filters that reflect what is happening in the story at that time. For example, episodes 7 and 8 focus on Hyoubu's past as soldier during WWII, and for that reason, in the opening theme, Japanese fighter planes are seen in the background, the entire opening is in black and white (save for a bit of red later on), and there is almost a filter of static over of the whole thing. It truly is incredible to compare these 4 versions of the opening's visuals. There are actually 2 versions of the song itself, an English, and a Japanese. There are also 8, that's right EIGHT, ending songs, and the animation for the episode that ends on the song \"ADVENT\" looks especially incredible. All of these songs, though, are sung with beautiful vocals, and many of them are done by the voice actors themselves.\\n\\n\r\nVoice Acting:\\n\r\nThere is no English dub for this show, but that suits me just fine. Much of the cast from the original series, Zettai Karen Children, reprise their roles for The Unlimited, and with they are all even better than before; Aya Hirano as Kaoru, in particular, was great in the preceding show, but was really captivating here. Aside from her, though, Kouji Yusa as Hyoubu and Junichi Suwabe were equally spectacular, as fitting for how their respective characters interact. Additionally, there have been something like 6 (maybe less, maybe more!? idk) different musical albums released for most of the characters, each with their own individual song(s). I highly recommend listening to as many of these as you can, because they really are amazingly done and catchy.\\n\\n\\n\r\nOverall:\\n\r\nIt really hurts me, wounds me, even, that this show is so criminally underrated and, worse yet, so overlooked. It's like the Scott Pilgrim vs The World of anime; everything you could possibly enjoy in an anime (well, except romance) in a single show, and practically nobody bothers to check it out. It's surprised me how low a score this series has on MAL, and I could just be overhyping this show to no end. But as I look back on it, rewatch it, read the manga adaptation of it, etc., I found that this series is just really special to me, and, more importantly, it has the capacity to be special to a lot of people. So, while I could be overhyping this show, I really don't think I am. I'm excitedly passionate about it and want more people to experience it because they could and probably would really enjoy it, too. It brings something to the world of anime that, while not entirely unique in concept, is unique enough in story, animation, music, and tone to satisfy a lot of anime watchers, casuals or serious. 10/10, guys, 10 out of freaking 10.",
            "date": "2018-02-27T14:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 272599,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6984301.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LightningComet",
                "username": "LightningComet"
            },
            "url": "https://myanimelist.net/reviews.php?id=272599"
        },
        {
            "content": "I got about halfway through this before I had to bail.\r\nREVIEW NOTE: I only remember the name of our first main character, Kyousuke and didn't really bother to go back and look the rest up. I may edit this review to reflect that later.\r\nThe show starts off really interesting, with one of our main characters being chased down by the military and taking down troops, tanks, and helicopters by himself with a barrage of psychic powers. This showed off the show's one truly great aspect- the animation good and the actions scenes are kickass. However, then this same guy turns himself in to a prisonspecifically for psychics for reasons I don't even remember, and winds up recruiting our duertagonist of the series along the way- who reveals that he had PLANNED for this to happen as part of an infiltration of their organization. All before the end of the first episode.\\n\\n\r\nI literally shouted \"Bullshit!\" at my screen. This sadly happens a few more times when watching this show.\\n\\n\r\nI've seen the \"undercover cop infiltrates a criminal organization\" plot before, but the way this one was set up was bizarre, inconsistent, left me with a lot of questions, and it didn't even have the decency to own how crazy and improbable the events of the first episode were- you're expected to take this completely seriously.\\n\\n\r\nThankfully this is (mostly) the weirdest it gets plot-wise and most of the rest of the show up until the point I stopped watching is an interesting but somewhat weird show about a group of criminals who fight for the rights of oppressed psychics. Then the plot showed up and I spent the rest of the ride lost and confused and my issues with this show became a bit less annoying and more problematic:\\n\\n\r\n1) The actual plot apparently involves our two main characters nominally on opposite ends of a plot to raise the status of psychic people. I say nominally because they're rarely in actual conflict. Kyosuke's plan is to put in place a new world ruler with his chosen \"Queen\" being someone who wants absolutely nothing to do with this plan and how he plans to ensure her compliance is never explained at least as far as I watched. Anyone who's seen the show in full and knows details I don't is free to clarify this.\\n\\n\r\n2) The psychic powers this series revolves around aren't really well explained. The show does a great job worldbuilding and we see what a society with people with weird-ass psychic powers is like (X-Men comes to mind here) however we don't know why they exist, the details of how they work, or why Kyousuke and a few other characters are so much stronger than everyone else. There's limiters that exist to help psychics dampen their powers but they don't seem NECESSARY as the only characters who use them have very solid control over their powers already. The only time we see them in action is when Kyousuke wants to show he's being serious and gets a \"power up\" animation for very little adequate reason.\\n\\n\r\n3) This is probably the worst one for me. There's a small girl on the team (Somewhere around six or seven) with uncontrollable powers. She doesn't get a limiter despite the cast making it a huge deal about having them and how important they are. The majority of her screen time is split two ways between being an adorable child that exists to make the viewer knows these are, in fact, the good guys and being placed in mildly compromising situations so the show can crassly make loli jokes at the duertagonist's expense purely for the sake of it.\\n\\n\r\nTaken individually, these three things were annoying and distracting, but not show-breaking. Together, I couldn't really sit around and finish it.",
            "date": "2019-01-31T13:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 300530,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6258783.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Setrin",
                "username": "Setrin"
            },
            "url": "https://myanimelist.net/reviews.php?id=300530"
        },
        {
            "content": "Zettai Karen Children: The Unlimited- Hyoubu Kyousuke is a shounen anime based on a manga by Shiina Takashi. The studio behind this adaptation of the series was handled by Manglobe, the studio behind Deadman's Wonderland, Samurai Champloo and Ergo Proxy, along with a bunch of things I haven't seen. I have no idea what to expect from this one. I'd describe that as intriguing, but the last time I expressed excitement at watching something completely unfamiliar I ended up watching Cheesesteak Suppository. Let's just take a look.\r\nThe story of Zettai Karen Children: Unlimited, henceforth referred to in this review as ZKC:U for the sake ofbrevity, opens with a silver-haired character named Hyoubu Kyousuke using ESP to wreck everything before allowing himself to be captured. He's taken to a prison camp for espers where he meets up with a young man named Hinomiya. The two start bonding and Hyoubu gives Hinomiya some of his food, which happens to be poisoned. Consequently, Hinomiya is taken to another facility. Hyoubu follows and the two escape along with a captured girl known as Yuugiri. Hyoubu offers Hinomiya a position in his organisation,  P.A.N.D.R.A, which is accepted. But Hinomiya has a secret which could threaten Hyoubu and his organisation. The story mainly focuses on Hyoubu, his organisation and their goals. There are some things it does well and some it doesn't. Let's start with the latter. The pacing in this is pretty bad. they put some flashback episodes that don't serve much purpose directly in the middle of the series, which interrupts \\n\r\nthe much more interesting action that's going on in the story's present and leaves less time to flesh out the ending. As a result the ending ends up rushed and kind of weak. On the positive side, the world they create is pretty interesting and the story is mostly effective. With everything following a logical progression. \\n\\n\r\nThe characters in this, with the exceptions of Hyoubu and Hinomiya, aren't particularly well developed. Most characters tend to get either really obvious arcs or be archetypal characters without much to set them apart. That being said, the character interactions are really well done. Hyoubu and Hinomiya are also really interesting characters. Although Hyoubu has some moments that make him seem kind of creepy and make you wonder if he likes little girls in an inappropriate way. Particularly during his dealings with Kaoru. To ZKC:U's credit, it's vague enough that that may or may not be what's going on, but you should never have valid reasons to suspect that your protagonist is a pedophile when they're portrayed in a generally sympathetic way.\\n\\n\r\nThe art in this is pretty impressive. The character designs look good. The effects when certain espers use their powers are pretty flashy but they never cross into the realm of the ridiculous. The action sequences are, mostly, well done. With the exception of one in particular that happens later on in the series and features antagonists with worse aim than the Stormtroopers in Star Wars. That one just comes across as kind of stupid. \\n\\n\r\nThe voice acting in this is pretty well done. Suwabe Junichi, Yusa Kouji, and Hirano Aya in particular. The one real weakness is Touyama Nao, who doesn't have any depth of emotion. Although, to be fair, her character is supposed to be emotionally stunted. The music is quite good. \\n\\n\r\nThe yuri factor is a 1/10. This has no yuri. \\n\\n\r\nMy final rating for ZKC:U is going to be a 6.4/10. It has some really interesting elements, but Hyoubu's semi-creepy scenes and the pacing do make it quite a bit less enjoyable than it could have been. With all things considered, it's still a decent series but not quite good. \\n\\n\r\nNext week I'll look at Gunslinger Girl: Il Teatrino.",
            "date": "2013-08-28T07:46:00+00:00",
            "helpful_count": 9,
            "mal_id": 111447,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=111447"
        },
        {
            "content": "Score: 8/10\r\n\"Hyoubu Kyousuke is just freaking cool\"\r\nI'm very surprised, at the lack of reviews for this anime avaliable at myanimelist.net. Since this is a pretty good show, evidenced by the average high score by the reviews at myanimelist.net\r\nMaybe viewers avoided this show due to the name \"Zettai Karen Children\". An anime with a more kiddy style, aiming for a lower age group. From what I have seen from \"Zettai\" (which isn't much to be honest). \"The Unlimited\" could almost be a separate anime itself, Art style, Pacing, Character Design and Music are all different. Maybe the action sequences are similar in that the battles arereally well animated and fluid.\\n\\n\r\nStory (8/10)\\n\r\nThe story revolves around 2 protaganists \"Hyoubu Kyousuke\" and undercover investigator \"Andy Hinomiya\". Hyoubu Kyousuke seems to be a major villain from the \"Zettai Karen Children\" anime, and seems his popularity was so high, he now has his own anime series!\\n\\n\r\nStory's pacing is well done, introducing the massive personality that is Hyoubu and then slowly showing us more and more of this villain's life. Stories written around villains are very very rare, this is one of those that probably depicts a tragic hero turned villain.\\n\\n\\n\r\nArt (8/10) \\n\r\nThe art style in \"The Unlimited\" is widely different from the more kiddy \"Zettai Karen Children\". The tones, colour and style is much darker and moodier, very fitting as Hyoubu and his organisation commits mass murder and destruction.... The emphasis was on the \"Cool\" factor of the characters and the battle scenes.\\n\\n\\n\r\nSound (8/10)\\n\r\nVoice acting is superb, Hyoubu really sounds like the cool, powerful, confident villain that he is. The voice acting of all the P.A.N.D.R.A terrorist members are well done too. Everyone of them sounds cool and composed, butchering tens and hundreds of enemies like its just another day in the office. Andy Hinomiya sounds exactly like a unconfident, but heroic self sacrificing investigator, and Yugiri sounds like a pure loli trap.\\n\\n\\n\r\nCharacter (9/10)\\n\r\nLike my opening statement said, \"Hyoubu Kyousuke\" is so cool, that I think he is the coolest anime character I have ever seen. \\n\\n\r\n\" Hyoubu sits relaxed in his chair, calm and uncaring, eyes half closed with a half smile on his lips. He lazily snaps his fingers, and suddenly everything and everyone around him blows up in a vortex of psychic powers.... At the end of it all, Hyoubu still sits, eyes half closed with a half smile on his lips, untouched......\"\\n\\n\r\nThe above scene personifies Hyoubu and this anime, dangerous, cool and confident of his powers. Hyoubu could probably dominate many girls' wet dreams, his aura of danger, confidence, and intelligence combined is massively alluring. He also shows compassion and humanity, adding to his dark charm and charisma that just oozes from the screen.\\n\\n\r\nAndy Hinomiya is the exact counterpart of Hyoubu. Unsure of his enemy,but noble and self sacrificing. Self sacrificing enough to go undercover into a terrorist organisation of mind reading psychics who can kill you with a snap of their fingers.\\n\r\nAndy's character design is slightly weak in my opinion, maybe he will feature more in the later stages. However Andy's lack of confidence and flaws work to emphasize Hyoubu Kyousuke's coolness.\\n\\n\r\nOverall (8/10)\\n\r\nOverall a highly enjoyable action anime. It is rare to see animes with murdering villains as their protagonist, and \"The Unliimited\" pulls this off perfectly. From the lack of reviews my guess is that due to the Zettai Karen Children label, viewers aren't even checking out episode 1. I highly recommend action anime fans to check this out. This anime is cool, action heavy with fluid battle scenes. Viewers don't need to have watched \"Zettai Karen Children\" to enjoy this anime. \\n\\n\r\nThis anime could be the sleeper hit among the spring 2013 anime season releases.\\n\r\nBeing bad now seems oh so cool...... \\n\\n",
            "date": "2013-02-14T00:25:00+00:00",
            "helpful_count": 9,
            "mal_id": 86755,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fate25",
                "username": "Fate25"
            },
            "url": "https://myanimelist.net/reviews.php?id=86755"
        },
        {
            "content": "First things first: \r\nThis is a standalone anime. By no means do you have to know anything about the original series to understand or enjoy this one. In fact, I never had even heard of the original series, and when I did look into it, it seemed totally out of my interest zones due to the Loli and little girl bullshit. I hate cutesy anime, and I don't even really like typical Shonen/fighting anime, so I don't plan on watching it anytime soon. \r\nThe unlimited is, sadly, relatively unknown and therefore under appreciated. \r\nIt's equal parts mystery, fighting and alternative history, and it does almosteverything right. \\n\\n\r\nA recent show that actually has gotten much hype and critical acclaim that I could compare The Unlimited to would be Bungo Stray Dogs- more the second season than the first, as the first season of BSD was riddled with randomness and unfunny jokes, while the second season was darker and more character oriented. This show is very character oriented, and towards the middle and end delves into particular characters history and psyche very admirably. \\n\\n\r\nAlthough it is sometimes seemingly episodic, there is a definite main story that never fails to entertain. Although much of the second half of the show is serious, and sometimes the show can even get quite dark, the family-like dynamic that builds between the characters always keeps things light enough to be enjoy as a casual show as well. \\n\\n\r\nThe cliffhangers between episodes made it so I finished this show in just a few days. It's quite short, but it doesn't waste a minute, so the story is actually well rounded and doesn't disappoint near the end- like so many anime that are front-loaded with intriguing story, but fail to deliver and eventually feel like a waste of time. \\n\\n\r\nThis show was obviously a labor of love for the crew behind it, and the quality of the show shines through in every episode. \\n\\n\r\nThere are definitely some original X-men cartoon vibes here, but not nearly as much as some other reviewers have suggested. I'd go so far as to say this show outshines anything in the x-men universe anyway. \\n\\n\r\nMystery, espers, WWII, modern day Japan, a magic ship 🚢 and some government agents, plus a tight knit group of friends - what do they have in common? \\n\\n\r\nThe Unlimited, of course.",
            "date": "2017-02-07T16:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 240125,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5732373.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ketamigo",
                "username": "Ketamigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=240125"
        },
        {
            "content": "I was browsing crunchyroll one day and cane across the unlimited Hyoubu Kyousuke. The description had sold me when it mentioned a silver hair, which for me Silver/white hair is my favorite color of hair. I had no idea what to expect when entering this series.\r\nSo what I got was awesome. Hyobu is an extremely entertaining character who is not only OP he also tends to be a bit of a troll. Though his can character can be very serious at times in the later parts.\r\nThe co-star of our story is Andy Hinomiya (a guy who looks strangely like Shun Asanaga from Endride), a characterHyobu found in jail(presumably because of Endride) and adds to his crew of loyal followers and a cute little girl.\\n\\n\r\nthe rest of the crew isn't really that important, except for the little girl Yugiri, whose the shy type. The other side characters are the main characters of the show this is a spin-off of, Zettai Karen Children or Psychic Squad. These characters oddly felt much more important than the other members of the crew(especially near the end).\\n\\n\r\nOne thing I really liked in this anime was the music, I love this soundtrack. The opening is all forms of awesome, and the ending themes(yes I said themes) are spectacular, special props to Darkness Night, which sets up some of the darker tones. One problem I find with having multiple endings though is that unless your that you'd have to re-watch a bit, as there is one ending that lasts only an episode.\\n\\n\r\nThe animation is also really good for an anime original. This anime, along with Kabaneri of the iron fortress, and a few other shows, is raising my hopes for anime originals.\\n\\n\r\nI can say that this show is a must watch, though there is some plot brought up that you would probably need to read the manga to view.",
            "date": "2016-06-20T16:29:00+00:00",
            "helpful_count": 7,
            "mal_id": 221334,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5413433.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NG_Chloe",
                "username": "NG_Chloe"
            },
            "url": "https://myanimelist.net/reviews.php?id=221334"
        },
        {
            "content": "First: I didnt watch more then 1 ep of  the original \"Zettai Karen Children\" and in my opinion it is not necessary to do so. This spinoff is nothing like it. \r\nThe Anime has an overall \"Dark\" feeling, and you will like to watch it if you like :\r\n→  mysterious powers \r\n→  badass (esper) guys fighting, maybe not for the world peace, but for esper freedom ^^ \r\n→  to solve the secret behind unlimited Power! \r\n→  a great storyline and explanation about how espers got introduced into the present society\r\n Its the story about Hyobu, and how he started tobe what he is: An esper with Unlimited Powers, and a leader of an esp criminal organization. It still means that hes a bad guy, but it explains why hes like that. \\n\\n\r\n(slight spoiler)\\n\r\nThe presented world has many conflicts between espers and government - the governments of Japan and USA, want to use espers for their purposes, while Hyobu tries to free the espers completely from the Governments Control with every means possible. \\n\r\nThat is,  in fact, kill the \"normals\".\\n\r\nSo the conflict between esp users and \"normals\" has to be solved somehow. \\n\\n\\n\r\n ( more Spoilers alert! )\\n\\n\r\n Andy Hinomiya, an human with the power to negate esp powers in a certain radius, is told to infiltrate the Catastrophe, Hyobu Kyousukes ship, with a mission from the US Governnment. \\n\r\nThere is a prediction of a \"Queen of Catastrophe\" that will rule over the espers and finally give them freedom, and while Hyobu tries to do everything possible to make the prediction come true, other people want to hinder his plans.\\n\r\n Everything is for the purpose of changing  the Future of human and esper interaction.\\n",
            "date": "2013-03-29T00:43:00+00:00",
            "helpful_count": 7,
            "mal_id": 91389,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2315611.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Arixaya",
                "username": "Arixaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=91389"
        },
        {
            "content": "Unlimited Hyobu Kyosuke is a spinoff to Zettai Karen Children that tones down on much of the comedy to the series, focuses more on its darker and serious elements, and shifts major focus from the Children of BABEL to our series titular anti-hero and his comrades among the esper resistance organization known as PANDRA. An esper by the name of Andy Hinomiya with the power to negate esper powers winds up joining PANDRA during one of Kyosuke's missions, being a secret agent sent to infiltrate the organization and finding his loyalties to come into question as he becomes more acquainted with PANDRA's familial environment andoperations.\\n\\n\r\nWith Unlimited's more serious bent and the focus shifted on Kyosuke, it is more focused on exploring the hostility between espers and humans from his perspective as we come to learn more of the operations and treatment of his fellow espers that our lead is committed to with his organization. This creates some nice intrigue throughout the first half of the series as Kyosuke and PANDRA butt heads with the Children and BABEL at points, serving as nice foil to the differing ideologies that both organizations have regarding the treatment of espers since both sides would be justified in their actions due to the differing circumstances that both groups arose out of. A couple episodes in the second half of the series even provide back story into Kyosuke's past with how he developed his beliefs against humans during World War II. The addition of Andy to the mix lends more to the story as well where we see his character's internal conflict over whether or not to back Kyosuke's cause as he performs his mission due to feeling neglected by both humans and espers due to his negating abilities. Still for those who did enjoy Zettai Karen Children, the Children do pop up alongside the members of BABEL at points throughout this series and there are occasional comedic bits to lighten the mood which don't detract too badly from Unlimited's more darker storytelling.\\n\\n\r\nIn spite of my praises though, the series does have its flaws. The final quarter of the series does take a hit a bit quality-wise when the fun gray moral storytelling crosses into more typical \"save the world\" territory when an enemy from Kyosuke's past makes his emergence felt in spite of no explanation being provided as to how he survived against Kyosuke decades earlier during the war. The ending felt like a bit of a cop-out as well where the series teased of some dire problems that Kyosuke was facing toward the second half of the series yet the final episode to Unlimited hand waves this issue aside to maintain much of the status quo that the series had from its start. Also, Unlimited isn't really breaking any new ground for an anime as there have been a decent number of titles made in recent years depicting dark and serious storytelling mixed with morally grey implications, notable ones being Black Lagoon and Gunslinger Girl.\\n\\n\r\nPresentation-wise, Unlimited is an improvement over Zettai Karen Children as the series sports a bigger animation budget. Character designs and scenery shots sport more detail and the color shading is noticeably darker to compliment the title's more serious storytelling. In addition, the battle scenes are a treat as many of them feature fluid movement taking place as espers either fight one another using their powers or unleash them against fleets of military forces. There are occasions where the series cuts on some corners with its animation with shortcuts, but it is nowhere as frequent as what Zettai Karen Children did. To flow with the darker storytelling, Unlimited sports a mix of dramatic and J-rock tracks that do their part to compliment key scenes throughout the show's run, though the tracks lack much in the way of subtlety for the type of mood that it wants you to believe that Unlimited has.\\n\\n\r\nOverall, Unlimited Hyobu Kyosuke makes for a decent alternative to Zettai Karen Children as the focus on Kyosuke lends it some more morally grey implications and offers a solid amount of intrigue over both justifying whether BABEL or PANDRA's objectives are right on the esper-human conflict and new series character Andy becoming conflicted over whom he desires to ally with. It does have its bumps in quality for its second half and it doesn't break any new ground as titles with dark, serious and morally grey storytelling have been done before. But if you are looking for a psychic-action title that is a decent time killer, then Unlimited offers just that.",
            "date": "2015-05-08T07:32:00+00:00",
            "helpful_count": 7,
            "mal_id": 187368,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=187368"
        },
        {
            "content": "I have yet to finish the original but The Unlimited H.K. is pretty stand alone as its spin-off focusing on Kyousuke, a sort of enigmatic criminal from Zettai Karen Children. Despite the somewhat lack of depth in plot, character development and just not exploring all the settings to the full extent, there're a few things I really like in this series. \r\nFirst the protagonist is ideally imperfect, strong and likable. His character is significantly enriched through the 2 episodes about his past as well as throughout the entire anime where he takes on a lot of burden to protect his crew. Here, the flashbacks areused perfectly for the purpose of augmenting the understanding of his motives. There's a lot of potential to this character yet he somehow puts all of his hope in the \"Queen of Catastrophe\". It is a mystery whether he is a true prophet or just a fool. On the other hand, his powers (and the other characters') and mission plans (especially in the first half) are not explained at all. Although this is not necessary the fault of his character, the quality of the show as an independent piece is quite reduced due to the confusion caused by the lack of explanation. \\n\\n\r\nThe newly added protagonists are not too thoroughly developed to my disappointment. Especially, the whole set up of the protagonist, Hinomiya, is made to seem like a coincidence and a farce with his superb naivety. It's not like he fully trusts his organization in the first place and yet, as fishy as the orders sound, he still goes and does something unwarranted. Also, him being not really ESPer and not completely Normal would've added more depth on his part but wasn't delved into at all. Yuugiri's role is also not fulfilled for the majority of the show despite being a main character. It is another mystery how she ended up in the prism in the first place.\\n\\n\r\nRegarding the story, I really expected much more than what it delivers. The unraveling of the climax is too straightforward and predictable. Also, I find the ending somewhat vague. On a grander look, there's not enough light shed on the future where the ESPers and Normals will hold together. I think the main set-back of this anime is the narrow minded psyche as well as the isolation in settings especially since it focuses on a social, cultural and political revolution for the ESPers and for *peace of humanity. Whatever that is. \\n\\n\r\nWith consideration of the topic's complexity, it's understandable that the development is unsatisfying. This aspect is similar to X-Men from Marvel. \\n\\n\r\nSecondly, from a director's standpoint, the pacing and scene cuts are really well done. The op really gets me hyped up and the hue changes depending on the content of each episode. The graphics is standard and character designs are somewhat interesting. \\n\\n\r\nCompares to the original, the spin-off is a lot less childish and contains somewhat sophisticated elements such as war, human rights, experimentation... Although I still feel that the anime is aimed for 12 year-olds with the avoidance of exploring gore and death, lousy scientific foundations, flashy action scenes. and weak military defense.\\n\\n\r\nDespite its obvious flaws and lack of exploring its full potential, perhaps it has been a little underrated. I would watch it for Kyousuke's awesomeness and for a good kill-time but don't expect it to be mind blowing.",
            "date": "2013-06-11T13:40:00+00:00",
            "helpful_count": 7,
            "mal_id": 100755,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2630561.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Notalice",
                "username": "Notalice"
            },
            "url": "https://myanimelist.net/reviews.php?id=100755"
        },
        {
            "content": "One of the most important things that I loved about this series was that although it was a spin-off, you did not need to watch the original series, Zettai Karen Children, to understand the storyline. In fact, having not watched the original may make this series all the more enjoyable to watch because everything will be new and you’ll be able to watch without previously formed opinions.\r\nThe artwork is extremely visually appealing. It leaved the childish, overly cartoon-like appearance of the original Zettai Karen Children and enters a more realistic and alluring style. The characters are drawn with dramatic features that draw you in andemphasize the mysteriousness of the storyline.\\n\\n\r\nThe characters themselves are seriously one of a kind. Hyoubu, leader of P.A.N.D.R.A. and one of the main characters, is a bit silly, somewhat immature but adamant in his belief. He is strong-willed and cares deeply for his people. Andy is the newest member of P.A.N.D.R.A. his past is very mysterious. Andy gains a lot of attention either for his fighting or for being ridiculed. You’ll find yourself questioning him frequently. Yugiri is a child with abilities stronger than imagined. She provides a sense of innocence and a common ground for Hyoubu and Andy.\\n\\n\r\nThe storyline is amazing. The main storyline leaves you wanting the next episode to come sooner. While they also present a side storyline, by constantly highlighting the mysteriousness of Hyoubu’s past and his life presently. The events of his past and childhood are tastefully revealed and weaved into the main plot carefully and thoughtfully. The series does not waste a single episode, and uses its episode frame effectively as to pack in everything without rushing the plot. The ending definitely leaves you satisfied.\\n\\n\r\nThe series was definitely a great must-watch that kept me anxious every week for the newest episode. There is just so much to love and enjoy; from the artwork to the storyline.\\n",
            "date": "2013-04-21T20:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 94541,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2358249.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/rightyjen",
                "username": "rightyjen"
            },
            "url": "https://myanimelist.net/reviews.php?id=94541"
        },
        {
            "content": "Zettai Karen Children: The Unlimited - Hyoubu Kyousuke.\r\nSuch a long name for this short anime :P.\r\nAnyways I enjoyed every bit. :)\r\nIf you like some super strong Main Characters with Super Powers, Fighting for there own kind, You will surely like ZKC: The Unlimited.\r\nThe Story was good, Not gonna complain on that. I gave it a passing 7.\r\nThe Art was good, Nicely designed. Colorful, Beautiful Environment.\r\nA big 7.\r\nSound, I liked the OST, The sounds we're good. Not much to say about it. 7.\r\nThe Characters, They we're Okay. Different. Unique, But I didn't enjoy them as much I did for some other Anime, Although, I gave ita 7. They weren't bad, Just not on top.\\n\\n\r\nEnjoyment, I enjoyed the Anime, Was fun to watch, Was entertaining. There was some long parts though, but not a big deal. I give it an 8.\\n\\n\\n\r\nOverall, Almost Every note was 7. So the Anime was Good Overall, A good Anime, To Watch, Not the best, but definately a Good one. So Overall note, 7.\\n\\n\r\nI recommend this anime for some people who Likes Over Powered Characters with Super Powers Fighting for there own kind, It is also a Spin-Off of Zettai Karen Children. If you like that, You will surely like The Unlimited. \\n\r\nIt is also similar to Code:Breaker I find. So if you Liked Code:Breaker, You should give ZKC: The Unlimited a try.\\n\\n\r\nThanks :)",
            "date": "2013-03-26T20:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 91061,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1932138.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kruh",
                "username": "Kruh"
            },
            "url": "https://myanimelist.net/reviews.php?id=91061"
        },
        {
            "content": "ok what i can say.. \r\nfirst of all the one thing that made me gave those high rates is Hyoubu Kyousuke and no one but him.. \r\nthe story really not that fabulous or interesting at all, I was able to completeits the Series bc of kyosuke  -this guy make go crazy xD literally-\r\ni enjoyed watching kyusuke, listen to his voice, looking at his eyes and believing in his words (︶ω︶)\r\ni actually don't Recommend it , BUT if you like character with white hair evil eyes and with yusa kouji voice >v< than you must watch it!",
            "date": "2014-05-15T15:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 143391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2905417.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/icloudy",
                "username": "icloudy"
            },
            "url": "https://myanimelist.net/reviews.php?id=143391"
        },
        {
            "content": "I am really enjoying this anime. It is visually awesome, the story is pretty good and the characters are likeable for the most part. I have only just watched episode 7 so cant really say its great just yet as it could all go horribly wrong but the end of the series...I hope not.\r\nIts a bit of fun, nothing to take seriously and an easy watch - so far 8-9/10",
            "date": "2013-02-27T13:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 88061,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2239305.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Aloha101",
                "username": "Aloha101"
            },
            "url": "https://myanimelist.net/reviews.php?id=88061"
        },
        {
            "content": "Wow....the unlimited - Hyobu Kyousuke..... I watched the first episode and I was just immediately hooked. I must admit though that I did not see the mother show, Zettai Karen Children. I had found this and just thought that I had to watch, even though I am still unaware what the mother story actually brought to the table. \r\nStory:\r\nOk, I gave the story an 8,  but don't expect the most intricate storyline ever. So don't expect a puella magi madoka magica. but it's actually not that bad, a little standard but also some little twists to keep everyone hooked. I was and I can'tstand slow and boring storylines =P \\n\\n\r\nArt:\\n\r\nWOW, just wow. the colours are so vivid it's astounding and the animation is top notch. smooth, colourful and just pure awesome. \\n\\n\r\nsound: \\n\r\nyou can sort of tell by the music that it was never really meant as a story on itself. The series has 9 endings if I counted correctly, so +/- 1 or so in real probably. the opening scenes also change but the song stayes the same. The music adds to the series and it's wonderfully done, but personally no real chill down the spine sound that caught my attention. Still, quality is amazing so way to go. \\n\\n\r\nCharacters:\\n\r\nit's a 12 episode series, so how deep can you go with character development. We still are unaware of some backgrounds and the side characters are hastily explained. The main characters, however, do get a proper background story and development on their part is surely not disappointing. We have all sorts of personalities, which is a +, and of course we have Yugiri whom we all just want to hug and cuddle and she's just too cute. Of course Hyobu is someone you quickly get to love too, wondefully made character and non-faked personality.\\n\\n\r\nenjoyment: \\n\r\nwell, I think I've said it all really. I LOVED the unlimited, couldn't stop watching. enjoyment is a 10+. \\n\\n\r\nso overal, really not bad guys. must watch if you ask me! ;)",
            "date": "2013-04-08T10:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 93053,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/436056.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KelseyWhiteleaf",
                "username": "KelseyWhiteleaf"
            },
            "url": "https://myanimelist.net/reviews.php?id=93053"
        }
    ],
    [
        {
            "content": "When I first started watching this series, I originally thought, “Oh, it's just another anime with cool guys and girls using superpowers and flying around like Superman-wannabees.”. Of course, that was before I watched its parent story, Zettai Karen Children. But more so, it was before I fully embraced the  spinoff known as Zettai Karen Children: The Unlimited - Hyoubu Kyousuke. This new piece of work that Manglobe is presenting here could be defined as their latest line in their evolution of supernatural phenomenon. In fact, Zettai Karen Children: The Unlimited takes supernatural with a world of super powers and transforms it into profoundpsychic tale starring....\\n\\n\r\nThe one and only Hyoubu Kyousuke\\n\\n\r\nZettai Karen Children: The Unlimited - Hyoubu Kyousuke is a spinoff the original Zettai Karen Children. It is presented by Manglobe, a Japanese anime studio, who is known for some of its other works involving supernatural such as Deadman Wonderland, Ergo Proxy, and The World That God Only Knows. And now here we are with their latest presentation. Now, this series can spell out a lot of questions for potential fans. One of most common ones may be something along the line of, “Do I need to watch the original Zettai Karen Children?” From my perspective, it is not necessary but I would say that it can open some insight as well as background to this spinoff. But of course, this isn't the parent series. This is UNLIMITED featuring Hyoubu Kyousuke as the star of the show.\\n\\n\r\nThe way the series is adapted is quite a peculiar one from my point of view. Even from the starters, we can clearly see that Hyoubu Kyousuke is not your typical hero. Rather, he can be seen as an anti-hero with the way he dresses, the way he acts, the words he speaks, and the action he commits. With his silver jet hair and floating around the city, he is a man of many mysteries especially behind that devious smile. Even from the beginning, he seems to have devious plans from his head. For example, he has himself taken prisoner on purpose for the reason to save one of his own partners in crime. He often thinks before he acts and is calculating toward his goals. Additionally, Kyousuke seems to be a man with a brilliant mind and often plans strategically in order stay ahead of his adversaries. As the leader of the mysterious organization, P.A.N.D.R.A, Kyosuke shows why he is the leader with his ruthlessness when events calls for it. He really is a star of his own show here folks.\\n\\n\r\nHaving seen the original series, Zettai Karen Children, this spinoff originally put me on odds side with Kyousuke. In fact, he is an antagonist from the original title. Here, he is portrayed as a protagonist. (although I see him more as an anti-hero) I found out the easy way during the first few episodes when Kyousuke is able to pull off his plan in his own 'heroic' effort. With that, he even meets a new friend by the name of Andy Hinomiya. He has a mysterious power of his own that can be compared to a certain unlucky protagonist from another series. I won't spoil here so watch more to find out. At any rate, he is introduced as an anime original character who joins  P.A.N.D.R.A. His friendship with Kyousuke seems to be based on both fear and respect. Yet, they do work hand-in-hand and often times gets the job done. Speaking of anime original, there is the cute Yuugiri. She is a strange girl with the ability to read minds but that often puts her at odds with society. She is even viewed sometimes as a 'monster' for just being an esper. This isn't surprising though as the world often sees those who are special regarded as being a threat to society. Among others of the team includes includes some returning characters from the original series such as You Fujiura, Momiji Kanou, and Shirou Magi. They make up the firepower of the team and gives  P.A.N.D.R.A a reason to being so feared and dominant.\\n\\n\r\nSo, this spinoff takes the setting in a more dark city atmopshere as opposed to the 'family oriented' atmosphere that the original Zettai Karen bought to us years ago. Honestly, who remembers that stuff anyways? In most of today's anime series, the market often aims at viewers for fan service, gore, and those romance subplots. Thankfully, this series avoids most of that and aims directly towards the story along with its strong cast of characters. With his name being set as the title, it is no surprise that Kyousuke gets the most attention even through the flashback scenes we see in later episodes. The other characters aren't omitted either as they all get his or her own little spotlights.\\n\\n\r\nThe story focuses mainly on the organization that Kyosuke sets up. His idea is to save Espers of his own kind because the way society ostracizes them. In fact, Espers in this spinoff are not seen as saviors of the world but as harbingers of destruction. It can easily be taken the fact even from the pilot episode given Andy's treatment behind that prison. It's cruel for them just because they are “different” from others. The way I see this though is an utter misunderstanding. In fact, some of the people who treats the Espers themselves can be seen as the real monsters to society. It's irony at its very best. However, this shouldn't be entirely be blamed on such trivial accusations that Espers are evil. There have been facts which proves the existence of espers to be a threat in the case of criminals in the series. As a matter of fact, Kyosuke's father ran into a case many years ago that changed his outlook on espers forever. \\n\\n\r\nThe series seems to lack the ultimatum for its plot. I guess the long story short here is that this spinoff contains way too many mysteries. It starts off fast and keeps its pace here and there. As mentioned before, Kyousuke acts with a plan through his head and cunning strategies. But most of the time, I find that this is almost redundant. The guy is nearly unstoppable and presented as being a boss. His powers of flight, telekinesis, and super strength is overpowered as he takes the skies and dominates in most of his fights. Even from the original series, Kyousuke is calculating and manipulative with his actions. In this spinoff, he is no different and often plays his plans like a chessboard. The pieces are his organization but rather than using them, Kyousuke plays the role of a leader leading them through missions. \\n\\n\r\nThe action of the series is also full throttle and packed with explosive warfare. It doesn't run through egoistic dialogues and strange gags but gets straight to the point. Otherwise, it does occasionally lack a bit of flavor as it just seems stale. Additionally, I find the characters' designs to be a bit generic. With the lack of fan service, the characters' clothing makes its impression through..generic designs. Their seemingly lack of attractiveness in their outfits also makes their stance a bit dull. The result often leads to a repetitive fight scenes and in general, a lack of flavor. If they were so 'badass', why not go all out and make the skies your God? \\n\\n\r\nOh wait, they don't need to do that since being OP does all that for them already.\\n\\n\r\nIn terms of overall visuals, I thought the series did a great job here. Taken on the opposite side of the original series, Unlimited makes its way of with more of a cutting dark age background. It's not on a dystopian level but gets its point across in that the world the espers live in is not a paradise. The artwork of the city in fact reflects more of a 'gotham' like atmosphere, one where there are criminals and people who prejudices against others just based on personal outlooks.The characters' design in particular Kyousuke show that they are indeed not normal. I mean, look at that silver hair and you tell me if you see that often in real life. It's definitely not something you see every day. \\n\\n\r\nThe soundtrack of this spinoff makes a strong impression on me. Its organ plays and style of choice in using more of a dramatic tone enhances the theme of a dark series as opposed to the family-oriented Zettai Karen Children. In other words, most of the soundtrack is serious because the series makes its way of being darkier, edgier, and sexier. (in that Unlimited way) The OP song LΛST RESOLUTION (for some reason performed both in English and Japanese), shows the revolution in which Kyousuke sets towards those who are a threat to espers. Oh and those various ED songs? Pleasure to my ears.\\n\\n\r\nOverall, this underrated series gets a score of “8” from me. I don't know about you but Unlimited sure got my attention. No, it's not because I watched the original series so I can get a taste of the spinoff. But rather, the characters, setting, and the general mood of the story gives a more defined way of the psychic world. Despite having some generic/shounen fight styles, I feel that this series pulled it off right. It doesn't seemed to be forced and balances itself well between its subplots. Hell, even the flashback arc was an entertaining watch. Ultimately, I would like to ask people to give this series a shot. It's not perfect but a definitely a way to make your time pass by. At least it did for me. After all, time isn't unlimited so make use of it wisely. This series right here is something you should spent that time on.",
            "date": "2013-03-25T11:18:00+00:00",
            "helpful_count": 151,
            "mal_id": 90853,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=90853"
        },
        {
            "content": "I waited until the end of the series to write my review, and all I have to say: This is one of the most underrated and also best animes of this year. Yes, I know that it's only winter season, but I don't care, I am going to steadfastly stand by that declaration. I have been watching anime for quite some years now, and I've seen some really good ones and some really bad ones. I've seen some that touch my heart and some that make me cringe. However, I have never had one that has consistently from beginning to end, roped me in andhad me anticipating each and every episode with such excitement. I could literally feel the adrenaline rush while watching each episode, and held on to every moment.\\n\\n\r\nThe plot, the story, the characters, the development amongst them all, all top-notch. \\n\r\nThe animation was great, action scenes superb, and the music phenomenal, even the hidden messages within are thoughtful. \\n\\n\r\nWhat's this show about? It involves an alternate world where there are humans that are normal, and humans that have somehow evolved to the point of having ESP (telepathy, telekinesis, pyrokinesis, etc). Those super-powered people are known as \"espers\". However, as always, humanity has a hard time adjusting to things and people who are different and strange, and so espers have been treated with prejudice as monsters and freaks of nature the world-over. One such esper, with powers even beyond that of other espers, has been ravaged and scarred by such a bigoted society. His name is Major Kyosuke Hyobu and he has, in answer to the injustices against his people, formed an organization that strives to protect espers and their rights as human beings by any means necessary. This organization is known as PANDRA. However, when Major Hyobu meets a peculiar esper named Andy Hinomiya who has secrets of his own, dark storm clouds may soon be in the horizon for PANDRA.\\n\\n\r\nOne thing to know, is that I love X-Men, and as you can tell, the synopsis sounds very similar to the world that the X-Men live in. Hyobu is often compared to Magneto in many ways, with PANDRA alike to the Brotherhood of Evil Mutants. However, I like Hyobu even more, as the man is more powerful, but also more complex, having layers to his psyche and to his character. The other main character of this show, Andy, is the stand-in for the audience and he plays his part well, as one of the most interesting and likable characters in the show.\\n\\n\r\nThis series is 12 episodes long and while the ending was quite satisfying, I cannot deny that I deeply wish for a sequel. This show was so underrated because of the fact that it is touted as a \"spin-off\" show from a under-performing less-popular 2008 anime, known as Zettai Karen Children or \"Psychic Squad\" in the States. However, this show can stand very well on its own and does not need the other show for exposition. It is completely different in tone and style and the only thing really similar is the setting and characters that have now been transferred to a completely different plot line. Many thought that you had to watch the original series in order to watch this one, and as the original series is 55+ episodes, no one was truly willing to go through that. However, I am here to tell you that I started this show without ever having even heard of Zettai Karen Children. You DO NOT need to see the original show to see this one. You can easily understand everything without having read or watched any original material. \\n\\n\r\nOkay, I think I have droned on enough, but I can't stress more how awesome this show is. I loved every minute of it and I hope that anyone who looks at it as well will get as much enjoyment out of it as I did. I sincerely hope there will be a second season as 12 episodes just isn't enough.\\n\\n\r\nNow get out of here and go WATCH IT!",
            "date": "2013-03-25T20:49:00+00:00",
            "helpful_count": 99,
            "mal_id": 90921,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2211315.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Irenesharda",
                "username": "Irenesharda"
            },
            "url": "https://myanimelist.net/reviews.php?id=90921"
        },
        {
            "content": "Why is know one watching this show? Literally not one person i know has even considered it.\r\nI've not watched much of the original Zettai Karen Children, the age of the cast, and tone of the show, suggested i wasn't going to get remotely near 50+ episode interest levels.  \r\nBut both short comings are now gone, the show is an appealing 12 episodes, the original cast are all several years older and supporting characters, with a significantly older cast put in place, and the tone seems far more serious. Think the difference between Fate Zero and Fate/Stay Night.\r\nAny prior knowledge of the franchise seems completelyoptional, I've had no trouble following the events and characters to this point, the pacing is fast and entertaining, the art is reasonable enough, people regularly die, and most of the main cast seem less than indispensable. Theres a reasonable story going on, with the character loyalties remaining up in the air, and lots of morality themes.\\n\\n\r\nNot unmissable, but far more people should give this show a try, any fans of action shows, or anything with espers/power users should find this a good watch.\\n",
            "date": "2013-02-04T10:35:00+00:00",
            "helpful_count": 57,
            "mal_id": 85819,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/107003.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nipsirc",
                "username": "Nipsirc"
            },
            "url": "https://myanimelist.net/reviews.php?id=85819"
        },
        {
            "content": "This anime is 12 episodes long. It's fast paced with lots of action scenes, sarcastic moments, sad moments, pretty much everything. When i first saw the first episode i knew i was going to enjoy this anime. It has that compassion side towards it, where not many action anime's have it so early into the anime. \r\nStory 9/10\r\nI've rated the story 9/10 because for starters, it's 12 episodes long. It's fast paced which i like especially for a short series. The plot makes sense, and the pace is very smooth.\r\nArt 10/10\r\nThe art you see in this anime may remind you of the newer animes, likeHamatora or Jormungand. They spice up the art to look exactly what you'd want! For an evil bad guy, or a good guy with hatred in his soul, they certainly focus to bring out the key details to make you want to go, \"WOW This anime Has it!\"\\n\\n\r\nSound 10/10\\n\\n\r\nI love the OST's. It's so filling, with every battle scene the background music is insane! Legit hype. Definitely lives up to having one of the best OST's out there.\\n\\n\r\nCharacter 7/10\\n\\n\r\nThe character development is fairly decent. At first you have your Main character, (DONT WORRY NO SPOILERS!) Who's trying to find his power. How do they go upon this? Well...he meets new people, and blah blah blah. . It goes on from there! I rated this a 7/10 solely because of how they went about to show how he develops, mainly towards the acting part and just...the way how they did it.\\n\\n\r\nEnjoyment 10/10\\n\\n\r\nI solely enjoyed this anime to the fullest! I've watched it all and I Absolutely Love it! It's just like Hamatora, HxH 2011, A hint of DBZ maybe, Jormungand, basically it's an all around perfect anime! Obviously there's more anime's i can name that are similar to this one, but that would just make this review too long xD.\\n\\n\r\nOverall 10/10\\n\\n\r\nYes it's true, a 10/10 Anime! Whoever watches this anime will come out loving it! The art, the humor, the plot, the characters, everything! Well. . . what really caught my attention was how the characters acts towards one another. It's not that usual anime where if somethings bothering one of our MC's, the other MC will just be like, oh, okay well hope you get better. NO! It's more than that! Its...Its...ART!",
            "date": "2015-02-17T19:41:00+00:00",
            "helpful_count": 34,
            "mal_id": 180678,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4103311.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/B3astpwn",
                "username": "B3astpwn"
            },
            "url": "https://myanimelist.net/reviews.php?id=180678"
        },
        {
            "content": "The Unlimited - Hyoubu Kyousuke: It Has Its Limits\r\nZettai Karen Children: The Unlimited was actually one of the more surprisingly good series I watched out of the Winter 2013 lineup. One of the nice things about this series is while it does have the Zettai Karen Children name slapped to this series, you don't actually have to watch the original Zettai Karen Children to understand the story. I certainly hope that didn't deter anyone from watching this series, because it nearly deterred me since I originally had no interest in the series. I originally thought you had to watch the first Zettai Karen Children tofollow the plot...and after hearing about how mediocre that series was, I wasn't looking forward to it. As I said, you fortunately don't have to sit through Zettai Karen Children to understand it since this is more an alternative setting that's connected to that series.\\n\\n\r\nThe story follows the story of a powerful anti-hero esper named Kyousuke Hyoubu that leads PANDRA, a band of espers against a society that generally doesn't accept espers equally. Espers are commonly imprisoned or used by government organizations for their own personal gain. The story begins with Kyousuke breaking into an esper prison to rescue one of his PANDRA members that had been imprisoned there. While in the prison, he receives assistance from an inmate named Andy Hinomiya. After successfully accomplishing the prison break, Andy decides to join PANDRA and assist Kyousuke with his goals of recruiting espers and trying to bring an end to humanity's rule over espers. However, it turns out Andy has a different goal in mind when he joins the group. Overall, I found the story to be fairly good and the plot itself to be outstanding. I was intrigued by the plot and found it to be an interesting set piece on how unforgiving society can be towards people that can be considered different.\\n\\n\r\nThe strongest aspect of The Unlimited was its animation. I found the animation to be downright gorgeous. The character designs were precise, clear cut, and reflected the personalities of each character rather well. However, where this series really shined was the atmospheric animation when an esper was releasing their power, like when Kyousuke or Yugiri were releasing their powers. It really did a great job of creating a feel that espers are all-powerful beings and provide a reason why they are feared in a normal human society. My jaw dropped at how gorgeous the animation was when Kyousuke turned off his limiter. I have to give credit to Manglobe, they are on their A-game when they create dark, atmospheric anime like this one. This is not a sunshine and rainbows series. The animation is dark, gritty, and can get downright graphic at times. While I wouldn't put it in the same category as a Deadman Wonderland for its grittiness or Ergo Proxy for its dark atmosphere, it seems to do a nice job of balancing the two. It's actually impressive considering Shishou Igarashi (Director) and Jun Takagi (Chief Animation Director) aren't the most experienced in anime directing. This was definitely a good stepping stone for their careers if they can continue to create animes as polished as this one from an animation standpoint. \\n\\n\r\nThe music and voice acting was also incredibly strong as well. The music really knew how to set the mood and I have to give a ton of credit to Koutarou Nakagawa for creating such an excellent soundtrack. Personally speaking, I have a lot of respect for his prior works that include Code Geass, Gosick, and Scryed to name a few. He brought out his best for this series as well and it paid off. The seiyuus were also remarkably well-cast, with most of the original Zettai Karen Children cast returning to their roles for this series. Kouji Yusa returned to his role of Kyousuke, which I must be glad for because he seemed to play the role of a mysterious, all-powerful esper perfectly. Junichi Suwabe played the role of the eccentric, but naive Andy quite well and the young, up-and-coming Nao Touyama's portrayal of Yugiri was downright adorable. I even got a laugh at how dynamic the castmembers were. Aya Hirano played both Kaoru from The Children AND a young Kyousuke from flashbacks...and the scary part was I couldn't even tell she was playing both roles until I read the cast listing. Just more proof that Aya Hirano is one of the best in the business. I will give Manglobe one thing, they do excellent cast work and even I have to admit, I got a chuckle out of the subtle Nostalgia Critic and Angry Video Game Nerd reference in one of the episodes.\\n\\n\r\nWhere The Unlimited fell a little short in my opinion, with the pun intended, was the length. Considering how detailed the plot was, it felt like there wasn't enough time to hash out the characters. It was slightly difficult to get attached to the other PANDRA members besides the leads because their exposure was limited and the supporting cast aboard the Catastrophe didn't get a whole lot of development. Although, perhaps they received that development in the original series and I just wasn't exposed to it, but it felt a little difficult to become attached to PANDRA's team dynamic. Considering the feel of the series, plot elements seemed slightly rushed at times. The team sort of jumped from one plot point to the next with little rhyme or reason. I also found the flashback back story to be a little out of place and slightly mundane. I didn't feel as though it added a whole lot to the story...or rather its focus didn't add much. It did play a big role in the story as it wore on, but I felt its focus was a bit off since it didn't seem to portray Saotome's character motivations very well. The way segments were edited during the series, it seemed as though this series was longer, but editorial mandate required things to be cut altogether. \"Cut-and-paste\" is really the best way I can describe this series at times. It didn't completely ruin my Unlimited viewing experience, but it was quite noticeable.\\n\\n\r\nOn the whole, The Unlimited is a REALLY good series to watch if you're looking for a supernatural shounen series. It has an awesome plot and an interesting cast of characters (albeit somewhat underdeveloped) with excellent animation and a very nice, atmospheric soundtrack. While I wouldn't call The Unlimited an amazing series, I would call it a rather pleasant surprise. I got a lot more than I expected when I started to watch it. It's a shame this series just wasn't a tad bit longer because there was quite a lot of material to work with. This series certainly had a ton of potential. I did feel this series ended on a pretty good note since it had a satisfying ending. It concluded rather well, but also left enough open to continue if Manglobe does decide to do so. If nothing else, this series certainly did a wonderful job of advertising for its predecessor. I am somewhat intrigued to watch Zettai Karen Children now despite it being considered a somewhat mediocre series by the general public. Perhaps if these two series tie in well together, it might alleviate some areas of mediocrity both series might have had. I would highly recommend this series if you enjoyed animes like To Aru Majutsu no Index or Deadman Wonderland. It has similar psychic elements compared to Index, but also has the beautifully atmospheric animation and social commentary comparable to Deadman Wonderland, although not as gritty. Overall, the Unlimited isn't an amazing series, but is still a fun watch for those that enjoy some exciting psychic-powered action.",
            "date": "2013-03-26T18:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 91053,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=91053"
        },
        {
            "content": "(First review so you know the drill with these. not going to go into sound art and the other stuff, cause quite frankly I can't judge them).\r\nWhen I first heard that Zettai Karen Children was getting a new anime I was delighted. Having read all the current chapters and watch the first series and OVA, I was disappointed to heard that it was going to be a spin-off. However that was soon changed after watching it. \r\nBased during the time skip of the manga (when they went from elementary to middle school), the story following Andy Hinomiya as he joins Pandra, a esper terrorist group.Essentially the group is like the X-men's comic Brotherhood of Mutant with Hyoubu being Magneto. And like Magneto you learn about his sad past and learn he is not all evil.\\n\\n\r\nThe story is a much darker story to the original series but it make it a standalone series. Do have to have watch the first series to watch this? No. Just read the synopsis  for it for figure out the back story.\\n\\n\r\nI recommend this is to anyone, whether your a fan of ZKC first series or not. The only reason I gave it a 9 instead of ten is because it's a spin-off (with a few manga chapter in it, Hyoubu's past). But that just the fan boy instead me.",
            "date": "2013-03-05T10:21:00+00:00",
            "helpful_count": 13,
            "mal_id": 88767,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/238353.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/komic",
                "username": "komic"
            },
            "url": "https://myanimelist.net/reviews.php?id=88767"
        },
        {
            "content": "This review will spoil nothing outside of the first episode.\r\nThat said, the first episode has a great twist at the end that will likely have you raising your eyebrows in curiosity and shock, hopefully hooking you into it as it did me. Additionally, it's a super introduction to the series, so check it out if you know absolutely nothing about this show or the characters; it introduces the main cast, provides a taste of the series' dark tone, has a stellar climax, and a plot twist at the end to boot. Give it a shot, and then come back if you want to know whatI think about the rest of the series.\\n\\n\\n\\n\\n\r\nFrom here on, the first episode, and only the first episode, will be spoiled.\\n\\n\\n\\n\\n\r\nSeries Overview:\\n\r\n\"Courtesy of Zettai Karen Children: The Unlimited - Hyoubu Kyousuke\" was known in the U.S. as \"Unlimited Psychic Squad\", but is better known as just \"The Unlimited - Hyoubu Kyousuke\". It is a 12 episode seinen spin-off of the shounen manga series \"Zettai Karen Children\" which itself received a 51 episode series and is an all-around fun time, but not much better than a 7 out of 10. While its predecessor is very light and almost shoujo in some aspects regarding its tone and writing, The Unlimited is quite the opposite; while it has its share of comedic and heartfelt moments, the series as a whole is very serious, and revels in the darkness portrayed by villains who will stop at nothing and stoop to any low to see the main characters, or really all espers, killed or experimented on. Thankfully, this show is rather shy on displays of gratuitous blood and violence, but it has its moments that are not for the faint of heart, just not nearly to the degree of another series animated by studio manglobe, Deadman Wonderland. Overall, The Unlimited - Hyoubu Kyousuke is, at least in my opinion, a hidden gem of an anime that anybody who has love for Marvel's X-men or = superhero anime as a whole will enjoy, but also anybody who understands the struggles of being different from those around him/her and feels the need to fight to maintain his/her identity and not be victimized by it.\\n\\n\r\nStory and Characters:\\n\r\nThis show is indeed a spin-off of a very long-running manga series, but fret not. Everything you could possibly need to know is explained in the first episode, and in well-written ways, not just overt exposition. Despite the amazing first episode, I feel obligated to summarize much of the series' opening act in this section. The setting is this: since shortly before World War II, people with supernatural ESP powers, also known as espers, have begun cropping up all over the world. One of our main characters is the leader of a quasi-terrorist pro-esper rights cell called P.A.N.D.R.A. That leader, Hyoubu Kyousuke, is an 80+ year-old man who is so overpowered he can literally make himself young and simultaneously dominate anyone who goes up against him. Most espers only have a single power, but he has a whole lineup of them, including hypnosis, telekinesis, teleportation, and even fire and lightning powers for a couple seconds. An easy analogy would be to compare P.A.N.D.R.A to Marvel's X-men, specifically the Brotherhood of Mutants and their crazy-powerful leader Magneto. Hyoubu is only the first of our main heroes, though. Andy Hinomiya is a Japanese-American who, at the end of the first episode, is invited to join P.A.N.D.R.A. as a junior member. What nobody knows is that he is actually an investigator for the United States Esper Investigations (USEI) and is attempting to bring the terrorist group P.A.N.D.R.A down from the inside while securing a secret device from them for his superiors. However, as Andy bonds with Hyoubu and the youngest member of P.A.N.D.R.A., an extremely powerful and vulnerable little girl named Yugiri, he calls the morals of his mission into question, and is caught between staying faithful to his esper-hating superiors and the new family that these apparent terrorists have built into their organization, a family to which he now belongs. Meanwhile, we get a deep dive into Hyoubu's psyche as well, allowing us to truly understand why he does what he does and how much he truly loves his people, whether they are with P.A.N.D.R.A. or not. Additionally, some characters from Zettai Karen Children appear, namely the titular Children and a few of their adult comrades, but they aren't really worth mentioning here, as while they do serve some roles in the plot, they aren't essential to the core of the story.\\n\r\nOverall, though, I absolutely loved (no pun intended) the plot of The Unlimited; it's dark and depressing, but also hopeful and endearing. It features characters having to make impossible decisions that have significant ramifications for those close to them, but also captures a familial sensation unlike most anime before it. The story is engaging, the characters are dynamic, the character interactions are brilliantly written, and it's heartwarming to see our heroes overcome the odds that are stacked astronomically against them, even with Hyoubu being vastly overpowered.\\n\\n\r\nArt and Animation:\\n\r\nSamurai Champloo is a brilliantly animated series, but manglobe have really outdone themselves with The Unlimited- Hyoubu Kyousuke. To see an example of how good this series looks, just watch the opening theme; the animation from the show itself, believe it or not, actually surpassing what is seen there (a bit more on this in the next section). And it's not just the animation that's fantastic, but also the artwork: crisp, detailed, totally unique character designs combined with some amazing backgrounds really sell the look's quality, and all of these come together beautifully, with little to no CG, by the way, in some of the most incredible action sequences in anime before shows like One Punch Man, HeroAca, and Mob Psycho 100 captured the spotlight. Even if the story doesn't interest you, or you find the characters boring, but still have an appreciation for top-notch animation quality, you would be remiss to pass up this show. It's that good.\\n\\n\r\nSound and Music:\\n\r\nHoo boy, where do I even begin? Well, let's start with the show's actual score: it's great. The music is extremely evocative of the moments' tones, be they light or dark, especially in action sequences, which don't necessarily raise the level of hype so much as accentuate the reasons for the fighting that takes place, an important theme of the series. But let's move on to the real meat of this section: the opening and ending themes. While the show's action may not be all that hyping, the opening song certainly is! Not only that, as the show's story progresses, the opening's animation style and colors change, showcasing different visuals, schemes, and filters that reflect what is happening in the story at that time. For example, episodes 7 and 8 focus on Hyoubu's past as soldier during WWII, and for that reason, in the opening theme, Japanese fighter planes are seen in the background, the entire opening is in black and white (save for a bit of red later on), and there is almost a filter of static over of the whole thing. It truly is incredible to compare these 4 versions of the opening's visuals. There are actually 2 versions of the song itself, an English, and a Japanese. There are also 8, that's right EIGHT, ending songs, and the animation for the episode that ends on the song \"ADVENT\" looks especially incredible. All of these songs, though, are sung with beautiful vocals, and many of them are done by the voice actors themselves.\\n\\n\r\nVoice Acting:\\n\r\nThere is no English dub for this show, but that suits me just fine. Much of the cast from the original series, Zettai Karen Children, reprise their roles for The Unlimited, and with they are all even better than before; Aya Hirano as Kaoru, in particular, was great in the preceding show, but was really captivating here. Aside from her, though, Kouji Yusa as Hyoubu and Junichi Suwabe were equally spectacular, as fitting for how their respective characters interact. Additionally, there have been something like 6 (maybe less, maybe more!? idk) different musical albums released for most of the characters, each with their own individual song(s). I highly recommend listening to as many of these as you can, because they really are amazingly done and catchy.\\n\\n\\n\r\nOverall:\\n\r\nIt really hurts me, wounds me, even, that this show is so criminally underrated and, worse yet, so overlooked. It's like the Scott Pilgrim vs The World of anime; everything you could possibly enjoy in an anime (well, except romance) in a single show, and practically nobody bothers to check it out. It's surprised me how low a score this series has on MAL, and I could just be overhyping this show to no end. But as I look back on it, rewatch it, read the manga adaptation of it, etc., I found that this series is just really special to me, and, more importantly, it has the capacity to be special to a lot of people. So, while I could be overhyping this show, I really don't think I am. I'm excitedly passionate about it and want more people to experience it because they could and probably would really enjoy it, too. It brings something to the world of anime that, while not entirely unique in concept, is unique enough in story, animation, music, and tone to satisfy a lot of anime watchers, casuals or serious. 10/10, guys, 10 out of freaking 10.",
            "date": "2018-02-27T14:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 272599,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6984301.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LightningComet",
                "username": "LightningComet"
            },
            "url": "https://myanimelist.net/reviews.php?id=272599"
        },
        {
            "content": "I got about halfway through this before I had to bail.\r\nREVIEW NOTE: I only remember the name of our first main character, Kyousuke and didn't really bother to go back and look the rest up. I may edit this review to reflect that later.\r\nThe show starts off really interesting, with one of our main characters being chased down by the military and taking down troops, tanks, and helicopters by himself with a barrage of psychic powers. This showed off the show's one truly great aspect- the animation good and the actions scenes are kickass. However, then this same guy turns himself in to a prisonspecifically for psychics for reasons I don't even remember, and winds up recruiting our duertagonist of the series along the way- who reveals that he had PLANNED for this to happen as part of an infiltration of their organization. All before the end of the first episode.\\n\\n\r\nI literally shouted \"Bullshit!\" at my screen. This sadly happens a few more times when watching this show.\\n\\n\r\nI've seen the \"undercover cop infiltrates a criminal organization\" plot before, but the way this one was set up was bizarre, inconsistent, left me with a lot of questions, and it didn't even have the decency to own how crazy and improbable the events of the first episode were- you're expected to take this completely seriously.\\n\\n\r\nThankfully this is (mostly) the weirdest it gets plot-wise and most of the rest of the show up until the point I stopped watching is an interesting but somewhat weird show about a group of criminals who fight for the rights of oppressed psychics. Then the plot showed up and I spent the rest of the ride lost and confused and my issues with this show became a bit less annoying and more problematic:\\n\\n\r\n1) The actual plot apparently involves our two main characters nominally on opposite ends of a plot to raise the status of psychic people. I say nominally because they're rarely in actual conflict. Kyosuke's plan is to put in place a new world ruler with his chosen \"Queen\" being someone who wants absolutely nothing to do with this plan and how he plans to ensure her compliance is never explained at least as far as I watched. Anyone who's seen the show in full and knows details I don't is free to clarify this.\\n\\n\r\n2) The psychic powers this series revolves around aren't really well explained. The show does a great job worldbuilding and we see what a society with people with weird-ass psychic powers is like (X-Men comes to mind here) however we don't know why they exist, the details of how they work, or why Kyousuke and a few other characters are so much stronger than everyone else. There's limiters that exist to help psychics dampen their powers but they don't seem NECESSARY as the only characters who use them have very solid control over their powers already. The only time we see them in action is when Kyousuke wants to show he's being serious and gets a \"power up\" animation for very little adequate reason.\\n\\n\r\n3) This is probably the worst one for me. There's a small girl on the team (Somewhere around six or seven) with uncontrollable powers. She doesn't get a limiter despite the cast making it a huge deal about having them and how important they are. The majority of her screen time is split two ways between being an adorable child that exists to make the viewer knows these are, in fact, the good guys and being placed in mildly compromising situations so the show can crassly make loli jokes at the duertagonist's expense purely for the sake of it.\\n\\n\r\nTaken individually, these three things were annoying and distracting, but not show-breaking. Together, I couldn't really sit around and finish it.",
            "date": "2019-01-31T13:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 300530,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6258783.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Setrin",
                "username": "Setrin"
            },
            "url": "https://myanimelist.net/reviews.php?id=300530"
        },
        {
            "content": "Zettai Karen Children: The Unlimited- Hyoubu Kyousuke is a shounen anime based on a manga by Shiina Takashi. The studio behind this adaptation of the series was handled by Manglobe, the studio behind Deadman's Wonderland, Samurai Champloo and Ergo Proxy, along with a bunch of things I haven't seen. I have no idea what to expect from this one. I'd describe that as intriguing, but the last time I expressed excitement at watching something completely unfamiliar I ended up watching Cheesesteak Suppository. Let's just take a look.\r\nThe story of Zettai Karen Children: Unlimited, henceforth referred to in this review as ZKC:U for the sake ofbrevity, opens with a silver-haired character named Hyoubu Kyousuke using ESP to wreck everything before allowing himself to be captured. He's taken to a prison camp for espers where he meets up with a young man named Hinomiya. The two start bonding and Hyoubu gives Hinomiya some of his food, which happens to be poisoned. Consequently, Hinomiya is taken to another facility. Hyoubu follows and the two escape along with a captured girl known as Yuugiri. Hyoubu offers Hinomiya a position in his organisation,  P.A.N.D.R.A, which is accepted. But Hinomiya has a secret which could threaten Hyoubu and his organisation. The story mainly focuses on Hyoubu, his organisation and their goals. There are some things it does well and some it doesn't. Let's start with the latter. The pacing in this is pretty bad. they put some flashback episodes that don't serve much purpose directly in the middle of the series, which interrupts \\n\r\nthe much more interesting action that's going on in the story's present and leaves less time to flesh out the ending. As a result the ending ends up rushed and kind of weak. On the positive side, the world they create is pretty interesting and the story is mostly effective. With everything following a logical progression. \\n\\n\r\nThe characters in this, with the exceptions of Hyoubu and Hinomiya, aren't particularly well developed. Most characters tend to get either really obvious arcs or be archetypal characters without much to set them apart. That being said, the character interactions are really well done. Hyoubu and Hinomiya are also really interesting characters. Although Hyoubu has some moments that make him seem kind of creepy and make you wonder if he likes little girls in an inappropriate way. Particularly during his dealings with Kaoru. To ZKC:U's credit, it's vague enough that that may or may not be what's going on, but you should never have valid reasons to suspect that your protagonist is a pedophile when they're portrayed in a generally sympathetic way.\\n\\n\r\nThe art in this is pretty impressive. The character designs look good. The effects when certain espers use their powers are pretty flashy but they never cross into the realm of the ridiculous. The action sequences are, mostly, well done. With the exception of one in particular that happens later on in the series and features antagonists with worse aim than the Stormtroopers in Star Wars. That one just comes across as kind of stupid. \\n\\n\r\nThe voice acting in this is pretty well done. Suwabe Junichi, Yusa Kouji, and Hirano Aya in particular. The one real weakness is Touyama Nao, who doesn't have any depth of emotion. Although, to be fair, her character is supposed to be emotionally stunted. The music is quite good. \\n\\n\r\nThe yuri factor is a 1/10. This has no yuri. \\n\\n\r\nMy final rating for ZKC:U is going to be a 6.4/10. It has some really interesting elements, but Hyoubu's semi-creepy scenes and the pacing do make it quite a bit less enjoyable than it could have been. With all things considered, it's still a decent series but not quite good. \\n\\n\r\nNext week I'll look at Gunslinger Girl: Il Teatrino.",
            "date": "2013-08-28T07:46:00+00:00",
            "helpful_count": 9,
            "mal_id": 111447,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=111447"
        },
        {
            "content": "Score: 8/10\r\n\"Hyoubu Kyousuke is just freaking cool\"\r\nI'm very surprised, at the lack of reviews for this anime avaliable at myanimelist.net. Since this is a pretty good show, evidenced by the average high score by the reviews at myanimelist.net\r\nMaybe viewers avoided this show due to the name \"Zettai Karen Children\". An anime with a more kiddy style, aiming for a lower age group. From what I have seen from \"Zettai\" (which isn't much to be honest). \"The Unlimited\" could almost be a separate anime itself, Art style, Pacing, Character Design and Music are all different. Maybe the action sequences are similar in that the battles arereally well animated and fluid.\\n\\n\r\nStory (8/10)\\n\r\nThe story revolves around 2 protaganists \"Hyoubu Kyousuke\" and undercover investigator \"Andy Hinomiya\". Hyoubu Kyousuke seems to be a major villain from the \"Zettai Karen Children\" anime, and seems his popularity was so high, he now has his own anime series!\\n\\n\r\nStory's pacing is well done, introducing the massive personality that is Hyoubu and then slowly showing us more and more of this villain's life. Stories written around villains are very very rare, this is one of those that probably depicts a tragic hero turned villain.\\n\\n\\n\r\nArt (8/10) \\n\r\nThe art style in \"The Unlimited\" is widely different from the more kiddy \"Zettai Karen Children\". The tones, colour and style is much darker and moodier, very fitting as Hyoubu and his organisation commits mass murder and destruction.... The emphasis was on the \"Cool\" factor of the characters and the battle scenes.\\n\\n\\n\r\nSound (8/10)\\n\r\nVoice acting is superb, Hyoubu really sounds like the cool, powerful, confident villain that he is. The voice acting of all the P.A.N.D.R.A terrorist members are well done too. Everyone of them sounds cool and composed, butchering tens and hundreds of enemies like its just another day in the office. Andy Hinomiya sounds exactly like a unconfident, but heroic self sacrificing investigator, and Yugiri sounds like a pure loli trap.\\n\\n\\n\r\nCharacter (9/10)\\n\r\nLike my opening statement said, \"Hyoubu Kyousuke\" is so cool, that I think he is the coolest anime character I have ever seen. \\n\\n\r\n\" Hyoubu sits relaxed in his chair, calm and uncaring, eyes half closed with a half smile on his lips. He lazily snaps his fingers, and suddenly everything and everyone around him blows up in a vortex of psychic powers.... At the end of it all, Hyoubu still sits, eyes half closed with a half smile on his lips, untouched......\"\\n\\n\r\nThe above scene personifies Hyoubu and this anime, dangerous, cool and confident of his powers. Hyoubu could probably dominate many girls' wet dreams, his aura of danger, confidence, and intelligence combined is massively alluring. He also shows compassion and humanity, adding to his dark charm and charisma that just oozes from the screen.\\n\\n\r\nAndy Hinomiya is the exact counterpart of Hyoubu. Unsure of his enemy,but noble and self sacrificing. Self sacrificing enough to go undercover into a terrorist organisation of mind reading psychics who can kill you with a snap of their fingers.\\n\r\nAndy's character design is slightly weak in my opinion, maybe he will feature more in the later stages. However Andy's lack of confidence and flaws work to emphasize Hyoubu Kyousuke's coolness.\\n\\n\r\nOverall (8/10)\\n\r\nOverall a highly enjoyable action anime. It is rare to see animes with murdering villains as their protagonist, and \"The Unliimited\" pulls this off perfectly. From the lack of reviews my guess is that due to the Zettai Karen Children label, viewers aren't even checking out episode 1. I highly recommend action anime fans to check this out. This anime is cool, action heavy with fluid battle scenes. Viewers don't need to have watched \"Zettai Karen Children\" to enjoy this anime. \\n\\n\r\nThis anime could be the sleeper hit among the spring 2013 anime season releases.\\n\r\nBeing bad now seems oh so cool...... \\n\\n",
            "date": "2013-02-14T00:25:00+00:00",
            "helpful_count": 9,
            "mal_id": 86755,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fate25",
                "username": "Fate25"
            },
            "url": "https://myanimelist.net/reviews.php?id=86755"
        },
        {
            "content": "First things first: \r\nThis is a standalone anime. By no means do you have to know anything about the original series to understand or enjoy this one. In fact, I never had even heard of the original series, and when I did look into it, it seemed totally out of my interest zones due to the Loli and little girl bullshit. I hate cutesy anime, and I don't even really like typical Shonen/fighting anime, so I don't plan on watching it anytime soon. \r\nThe unlimited is, sadly, relatively unknown and therefore under appreciated. \r\nIt's equal parts mystery, fighting and alternative history, and it does almosteverything right. \\n\\n\r\nA recent show that actually has gotten much hype and critical acclaim that I could compare The Unlimited to would be Bungo Stray Dogs- more the second season than the first, as the first season of BSD was riddled with randomness and unfunny jokes, while the second season was darker and more character oriented. This show is very character oriented, and towards the middle and end delves into particular characters history and psyche very admirably. \\n\\n\r\nAlthough it is sometimes seemingly episodic, there is a definite main story that never fails to entertain. Although much of the second half of the show is serious, and sometimes the show can even get quite dark, the family-like dynamic that builds between the characters always keeps things light enough to be enjoy as a casual show as well. \\n\\n\r\nThe cliffhangers between episodes made it so I finished this show in just a few days. It's quite short, but it doesn't waste a minute, so the story is actually well rounded and doesn't disappoint near the end- like so many anime that are front-loaded with intriguing story, but fail to deliver and eventually feel like a waste of time. \\n\\n\r\nThis show was obviously a labor of love for the crew behind it, and the quality of the show shines through in every episode. \\n\\n\r\nThere are definitely some original X-men cartoon vibes here, but not nearly as much as some other reviewers have suggested. I'd go so far as to say this show outshines anything in the x-men universe anyway. \\n\\n\r\nMystery, espers, WWII, modern day Japan, a magic ship 🚢 and some government agents, plus a tight knit group of friends - what do they have in common? \\n\\n\r\nThe Unlimited, of course.",
            "date": "2017-02-07T16:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 240125,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5732373.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ketamigo",
                "username": "Ketamigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=240125"
        },
        {
            "content": "I was browsing crunchyroll one day and cane across the unlimited Hyoubu Kyousuke. The description had sold me when it mentioned a silver hair, which for me Silver/white hair is my favorite color of hair. I had no idea what to expect when entering this series.\r\nSo what I got was awesome. Hyobu is an extremely entertaining character who is not only OP he also tends to be a bit of a troll. Though his can character can be very serious at times in the later parts.\r\nThe co-star of our story is Andy Hinomiya (a guy who looks strangely like Shun Asanaga from Endride), a characterHyobu found in jail(presumably because of Endride) and adds to his crew of loyal followers and a cute little girl.\\n\\n\r\nthe rest of the crew isn't really that important, except for the little girl Yugiri, whose the shy type. The other side characters are the main characters of the show this is a spin-off of, Zettai Karen Children or Psychic Squad. These characters oddly felt much more important than the other members of the crew(especially near the end).\\n\\n\r\nOne thing I really liked in this anime was the music, I love this soundtrack. The opening is all forms of awesome, and the ending themes(yes I said themes) are spectacular, special props to Darkness Night, which sets up some of the darker tones. One problem I find with having multiple endings though is that unless your that you'd have to re-watch a bit, as there is one ending that lasts only an episode.\\n\\n\r\nThe animation is also really good for an anime original. This anime, along with Kabaneri of the iron fortress, and a few other shows, is raising my hopes for anime originals.\\n\\n\r\nI can say that this show is a must watch, though there is some plot brought up that you would probably need to read the manga to view.",
            "date": "2016-06-20T16:29:00+00:00",
            "helpful_count": 7,
            "mal_id": 221334,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5413433.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NG_Chloe",
                "username": "NG_Chloe"
            },
            "url": "https://myanimelist.net/reviews.php?id=221334"
        },
        {
            "content": "First: I didnt watch more then 1 ep of  the original \"Zettai Karen Children\" and in my opinion it is not necessary to do so. This spinoff is nothing like it. \r\nThe Anime has an overall \"Dark\" feeling, and you will like to watch it if you like :\r\n→  mysterious powers \r\n→  badass (esper) guys fighting, maybe not for the world peace, but for esper freedom ^^ \r\n→  to solve the secret behind unlimited Power! \r\n→  a great storyline and explanation about how espers got introduced into the present society\r\n Its the story about Hyobu, and how he started tobe what he is: An esper with Unlimited Powers, and a leader of an esp criminal organization. It still means that hes a bad guy, but it explains why hes like that. \\n\\n\r\n(slight spoiler)\\n\r\nThe presented world has many conflicts between espers and government - the governments of Japan and USA, want to use espers for their purposes, while Hyobu tries to free the espers completely from the Governments Control with every means possible. \\n\r\nThat is,  in fact, kill the \"normals\".\\n\r\nSo the conflict between esp users and \"normals\" has to be solved somehow. \\n\\n\\n\r\n ( more Spoilers alert! )\\n\\n\r\n Andy Hinomiya, an human with the power to negate esp powers in a certain radius, is told to infiltrate the Catastrophe, Hyobu Kyousukes ship, with a mission from the US Governnment. \\n\r\nThere is a prediction of a \"Queen of Catastrophe\" that will rule over the espers and finally give them freedom, and while Hyobu tries to do everything possible to make the prediction come true, other people want to hinder his plans.\\n\r\n Everything is for the purpose of changing  the Future of human and esper interaction.\\n",
            "date": "2013-03-29T00:43:00+00:00",
            "helpful_count": 7,
            "mal_id": 91389,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2315611.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Arixaya",
                "username": "Arixaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=91389"
        },
        {
            "content": "Unlimited Hyobu Kyosuke is a spinoff to Zettai Karen Children that tones down on much of the comedy to the series, focuses more on its darker and serious elements, and shifts major focus from the Children of BABEL to our series titular anti-hero and his comrades among the esper resistance organization known as PANDRA. An esper by the name of Andy Hinomiya with the power to negate esper powers winds up joining PANDRA during one of Kyosuke's missions, being a secret agent sent to infiltrate the organization and finding his loyalties to come into question as he becomes more acquainted with PANDRA's familial environment andoperations.\\n\\n\r\nWith Unlimited's more serious bent and the focus shifted on Kyosuke, it is more focused on exploring the hostility between espers and humans from his perspective as we come to learn more of the operations and treatment of his fellow espers that our lead is committed to with his organization. This creates some nice intrigue throughout the first half of the series as Kyosuke and PANDRA butt heads with the Children and BABEL at points, serving as nice foil to the differing ideologies that both organizations have regarding the treatment of espers since both sides would be justified in their actions due to the differing circumstances that both groups arose out of. A couple episodes in the second half of the series even provide back story into Kyosuke's past with how he developed his beliefs against humans during World War II. The addition of Andy to the mix lends more to the story as well where we see his character's internal conflict over whether or not to back Kyosuke's cause as he performs his mission due to feeling neglected by both humans and espers due to his negating abilities. Still for those who did enjoy Zettai Karen Children, the Children do pop up alongside the members of BABEL at points throughout this series and there are occasional comedic bits to lighten the mood which don't detract too badly from Unlimited's more darker storytelling.\\n\\n\r\nIn spite of my praises though, the series does have its flaws. The final quarter of the series does take a hit a bit quality-wise when the fun gray moral storytelling crosses into more typical \"save the world\" territory when an enemy from Kyosuke's past makes his emergence felt in spite of no explanation being provided as to how he survived against Kyosuke decades earlier during the war. The ending felt like a bit of a cop-out as well where the series teased of some dire problems that Kyosuke was facing toward the second half of the series yet the final episode to Unlimited hand waves this issue aside to maintain much of the status quo that the series had from its start. Also, Unlimited isn't really breaking any new ground for an anime as there have been a decent number of titles made in recent years depicting dark and serious storytelling mixed with morally grey implications, notable ones being Black Lagoon and Gunslinger Girl.\\n\\n\r\nPresentation-wise, Unlimited is an improvement over Zettai Karen Children as the series sports a bigger animation budget. Character designs and scenery shots sport more detail and the color shading is noticeably darker to compliment the title's more serious storytelling. In addition, the battle scenes are a treat as many of them feature fluid movement taking place as espers either fight one another using their powers or unleash them against fleets of military forces. There are occasions where the series cuts on some corners with its animation with shortcuts, but it is nowhere as frequent as what Zettai Karen Children did. To flow with the darker storytelling, Unlimited sports a mix of dramatic and J-rock tracks that do their part to compliment key scenes throughout the show's run, though the tracks lack much in the way of subtlety for the type of mood that it wants you to believe that Unlimited has.\\n\\n\r\nOverall, Unlimited Hyobu Kyosuke makes for a decent alternative to Zettai Karen Children as the focus on Kyosuke lends it some more morally grey implications and offers a solid amount of intrigue over both justifying whether BABEL or PANDRA's objectives are right on the esper-human conflict and new series character Andy becoming conflicted over whom he desires to ally with. It does have its bumps in quality for its second half and it doesn't break any new ground as titles with dark, serious and morally grey storytelling have been done before. But if you are looking for a psychic-action title that is a decent time killer, then Unlimited offers just that.",
            "date": "2015-05-08T07:32:00+00:00",
            "helpful_count": 7,
            "mal_id": 187368,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=187368"
        },
        {
            "content": "I have yet to finish the original but The Unlimited H.K. is pretty stand alone as its spin-off focusing on Kyousuke, a sort of enigmatic criminal from Zettai Karen Children. Despite the somewhat lack of depth in plot, character development and just not exploring all the settings to the full extent, there're a few things I really like in this series. \r\nFirst the protagonist is ideally imperfect, strong and likable. His character is significantly enriched through the 2 episodes about his past as well as throughout the entire anime where he takes on a lot of burden to protect his crew. Here, the flashbacks areused perfectly for the purpose of augmenting the understanding of his motives. There's a lot of potential to this character yet he somehow puts all of his hope in the \"Queen of Catastrophe\". It is a mystery whether he is a true prophet or just a fool. On the other hand, his powers (and the other characters') and mission plans (especially in the first half) are not explained at all. Although this is not necessary the fault of his character, the quality of the show as an independent piece is quite reduced due to the confusion caused by the lack of explanation. \\n\\n\r\nThe newly added protagonists are not too thoroughly developed to my disappointment. Especially, the whole set up of the protagonist, Hinomiya, is made to seem like a coincidence and a farce with his superb naivety. It's not like he fully trusts his organization in the first place and yet, as fishy as the orders sound, he still goes and does something unwarranted. Also, him being not really ESPer and not completely Normal would've added more depth on his part but wasn't delved into at all. Yuugiri's role is also not fulfilled for the majority of the show despite being a main character. It is another mystery how she ended up in the prism in the first place.\\n\\n\r\nRegarding the story, I really expected much more than what it delivers. The unraveling of the climax is too straightforward and predictable. Also, I find the ending somewhat vague. On a grander look, there's not enough light shed on the future where the ESPers and Normals will hold together. I think the main set-back of this anime is the narrow minded psyche as well as the isolation in settings especially since it focuses on a social, cultural and political revolution for the ESPers and for *peace of humanity. Whatever that is. \\n\\n\r\nWith consideration of the topic's complexity, it's understandable that the development is unsatisfying. This aspect is similar to X-Men from Marvel. \\n\\n\r\nSecondly, from a director's standpoint, the pacing and scene cuts are really well done. The op really gets me hyped up and the hue changes depending on the content of each episode. The graphics is standard and character designs are somewhat interesting. \\n\\n\r\nCompares to the original, the spin-off is a lot less childish and contains somewhat sophisticated elements such as war, human rights, experimentation... Although I still feel that the anime is aimed for 12 year-olds with the avoidance of exploring gore and death, lousy scientific foundations, flashy action scenes. and weak military defense.\\n\\n\r\nDespite its obvious flaws and lack of exploring its full potential, perhaps it has been a little underrated. I would watch it for Kyousuke's awesomeness and for a good kill-time but don't expect it to be mind blowing.",
            "date": "2013-06-11T13:40:00+00:00",
            "helpful_count": 7,
            "mal_id": 100755,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2630561.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Notalice",
                "username": "Notalice"
            },
            "url": "https://myanimelist.net/reviews.php?id=100755"
        },
        {
            "content": "One of the most important things that I loved about this series was that although it was a spin-off, you did not need to watch the original series, Zettai Karen Children, to understand the storyline. In fact, having not watched the original may make this series all the more enjoyable to watch because everything will be new and you’ll be able to watch without previously formed opinions.\r\nThe artwork is extremely visually appealing. It leaved the childish, overly cartoon-like appearance of the original Zettai Karen Children and enters a more realistic and alluring style. The characters are drawn with dramatic features that draw you in andemphasize the mysteriousness of the storyline.\\n\\n\r\nThe characters themselves are seriously one of a kind. Hyoubu, leader of P.A.N.D.R.A. and one of the main characters, is a bit silly, somewhat immature but adamant in his belief. He is strong-willed and cares deeply for his people. Andy is the newest member of P.A.N.D.R.A. his past is very mysterious. Andy gains a lot of attention either for his fighting or for being ridiculed. You’ll find yourself questioning him frequently. Yugiri is a child with abilities stronger than imagined. She provides a sense of innocence and a common ground for Hyoubu and Andy.\\n\\n\r\nThe storyline is amazing. The main storyline leaves you wanting the next episode to come sooner. While they also present a side storyline, by constantly highlighting the mysteriousness of Hyoubu’s past and his life presently. The events of his past and childhood are tastefully revealed and weaved into the main plot carefully and thoughtfully. The series does not waste a single episode, and uses its episode frame effectively as to pack in everything without rushing the plot. The ending definitely leaves you satisfied.\\n\\n\r\nThe series was definitely a great must-watch that kept me anxious every week for the newest episode. There is just so much to love and enjoy; from the artwork to the storyline.\\n",
            "date": "2013-04-21T20:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 94541,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2358249.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/rightyjen",
                "username": "rightyjen"
            },
            "url": "https://myanimelist.net/reviews.php?id=94541"
        },
        {
            "content": "Zettai Karen Children: The Unlimited - Hyoubu Kyousuke.\r\nSuch a long name for this short anime :P.\r\nAnyways I enjoyed every bit. :)\r\nIf you like some super strong Main Characters with Super Powers, Fighting for there own kind, You will surely like ZKC: The Unlimited.\r\nThe Story was good, Not gonna complain on that. I gave it a passing 7.\r\nThe Art was good, Nicely designed. Colorful, Beautiful Environment.\r\nA big 7.\r\nSound, I liked the OST, The sounds we're good. Not much to say about it. 7.\r\nThe Characters, They we're Okay. Different. Unique, But I didn't enjoy them as much I did for some other Anime, Although, I gave ita 7. They weren't bad, Just not on top.\\n\\n\r\nEnjoyment, I enjoyed the Anime, Was fun to watch, Was entertaining. There was some long parts though, but not a big deal. I give it an 8.\\n\\n\\n\r\nOverall, Almost Every note was 7. So the Anime was Good Overall, A good Anime, To Watch, Not the best, but definately a Good one. So Overall note, 7.\\n\\n\r\nI recommend this anime for some people who Likes Over Powered Characters with Super Powers Fighting for there own kind, It is also a Spin-Off of Zettai Karen Children. If you like that, You will surely like The Unlimited. \\n\r\nIt is also similar to Code:Breaker I find. So if you Liked Code:Breaker, You should give ZKC: The Unlimited a try.\\n\\n\r\nThanks :)",
            "date": "2013-03-26T20:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 91061,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1932138.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kruh",
                "username": "Kruh"
            },
            "url": "https://myanimelist.net/reviews.php?id=91061"
        },
        {
            "content": "ok what i can say.. \r\nfirst of all the one thing that made me gave those high rates is Hyoubu Kyousuke and no one but him.. \r\nthe story really not that fabulous or interesting at all, I was able to completeits the Series bc of kyosuke  -this guy make go crazy xD literally-\r\ni enjoyed watching kyusuke, listen to his voice, looking at his eyes and believing in his words (︶ω︶)\r\ni actually don't Recommend it , BUT if you like character with white hair evil eyes and with yusa kouji voice >v< than you must watch it!",
            "date": "2014-05-15T15:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 143391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2905417.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/icloudy",
                "username": "icloudy"
            },
            "url": "https://myanimelist.net/reviews.php?id=143391"
        },
        {
            "content": "I am really enjoying this anime. It is visually awesome, the story is pretty good and the characters are likeable for the most part. I have only just watched episode 7 so cant really say its great just yet as it could all go horribly wrong but the end of the series...I hope not.\r\nIts a bit of fun, nothing to take seriously and an easy watch - so far 8-9/10",
            "date": "2013-02-27T13:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 88061,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2239305.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Aloha101",
                "username": "Aloha101"
            },
            "url": "https://myanimelist.net/reviews.php?id=88061"
        },
        {
            "content": "Wow....the unlimited - Hyobu Kyousuke..... I watched the first episode and I was just immediately hooked. I must admit though that I did not see the mother show, Zettai Karen Children. I had found this and just thought that I had to watch, even though I am still unaware what the mother story actually brought to the table. \r\nStory:\r\nOk, I gave the story an 8,  but don't expect the most intricate storyline ever. So don't expect a puella magi madoka magica. but it's actually not that bad, a little standard but also some little twists to keep everyone hooked. I was and I can'tstand slow and boring storylines =P \\n\\n\r\nArt:\\n\r\nWOW, just wow. the colours are so vivid it's astounding and the animation is top notch. smooth, colourful and just pure awesome. \\n\\n\r\nsound: \\n\r\nyou can sort of tell by the music that it was never really meant as a story on itself. The series has 9 endings if I counted correctly, so +/- 1 or so in real probably. the opening scenes also change but the song stayes the same. The music adds to the series and it's wonderfully done, but personally no real chill down the spine sound that caught my attention. Still, quality is amazing so way to go. \\n\\n\r\nCharacters:\\n\r\nit's a 12 episode series, so how deep can you go with character development. We still are unaware of some backgrounds and the side characters are hastily explained. The main characters, however, do get a proper background story and development on their part is surely not disappointing. We have all sorts of personalities, which is a +, and of course we have Yugiri whom we all just want to hug and cuddle and she's just too cute. Of course Hyobu is someone you quickly get to love too, wondefully made character and non-faked personality.\\n\\n\r\nenjoyment: \\n\r\nwell, I think I've said it all really. I LOVED the unlimited, couldn't stop watching. enjoyment is a 10+. \\n\\n\r\nso overal, really not bad guys. must watch if you ask me! ;)",
            "date": "2013-04-08T10:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 93053,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/436056.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KelseyWhiteleaf",
                "username": "KelseyWhiteleaf"
            },
            "url": "https://myanimelist.net/reviews.php?id=93053"
        }
    ],
    [
        {
            "content": "A very short Review - \r\nIn terms of story I think it's a pretty simple, quite easy to follow and understand what's going on at least the majority of the time as long as you learn what the names of things are like 'P.A.N.D.R.A', you will understand. 12 episodes doesn't feel like long enough though, I have 1 episode to go now and I dont feel like the whole thing will be concluded in just 23 minutes, but I dont know yet. \r\nThe Art is very modern, and for me that's a good thing but really this is dependant on preference. It's somewhat different tothe parent storys art, 'sharper' I'd say, but I really like it. \\n\\n\r\nThe characters are what make this for me, Hyoubu being the main is much more interesting than the children in the main story, he has an interesting past and a goal, problems and personality and doesn't seem to stray far from what we saw of him in the parent story with maybe the exception of his strength. We also finally find out what Fujiyuras power is and the threes relationship to Hyoubu. The New character Andy also adds to the plot making it just that bit interesting with his own agender. \\n\\n\r\nAs a spin off I actually much prefer it to the Parent story, probably because of the main character and the fact the 'children' are grown and, well frankly less annoying. For me it's one of those animes I really love and simply can barely contain myself waiting on the next episode. Those of you who dont have to wait, well...you lucky Buggers lol.",
            "date": "2013-03-21T15:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 90369,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483718.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/green2griffin",
                "username": "green2griffin"
            },
            "url": "https://myanimelist.net/reviews.php?id=90369"
        },
        {
            "content": "Great anime. The way the plot twists, without any spoilers, is amazing, and how it is retelling past events in a way bigger than the anime itself, without collapsing on itself. The only problem with it is its humour and some of its script is strictly dictated by manga-logic. I didn't read the manga but its manga-esque which is a good thing because you have to watch it alllllll. IF YOU READ THIS YOU HAVE TO WATCH. p.s. music is bad",
            "date": "2014-05-27T11:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 144719,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3803857.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 4,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BluecometZola",
                "username": "BluecometZola"
            },
            "url": "https://myanimelist.net/reviews.php?id=144719"
        },
        {
            "content": "At first I made the mistake to avoid this anime like the plague because of the \"Courtesy of Zettai Karen Children\" part of the name. I watched the original series and hated it with a passion. After looking at this animss art I decided to give it a chance...and was blown away. \r\nThe first episode already starts with explosive action. The watcher isn't slowly introduced to the series, like we know from many other shows, but thrown right in the middle of a (very one-sided) battle. And it doesn't stop there. \r\nEvery episode up until the middle is pretty much P.A.N.D.RA. wiping the floor withtheir enemies until the show suddenly takes a turn into the department of drama. They remind us again that, no matter how strong you are, you are never invincible.\\n\r\nAll in all, this anime has everything. There is action, comedy, intrigues, angst, drama, the psychic powers of course and nothing overly excessive. And even though The Children show up a couple of times, they don't steal the show and don't act like the little spoiled brats they really are.\\n\r\nI loved this anime and can only recommend it to others.\\n",
            "date": "2013-04-13T11:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 93619,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/650781.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KazeNoChikara",
                "username": "KazeNoChikara"
            },
            "url": "https://myanimelist.net/reviews.php?id=93619"
        },
        {
            "content": "Well,where to start.\r\nthis one took me completely by surprise,it was executed just so well.to start with,i had not watched the parent series9it is 51 or so episodes long!)i also found it was a bit too...cute for me.it seemed to be a lighthearted anime,and i did not like the idea of watching a cute version of x-men.but this,its spin-off,this was just great!now i am not skilled in writing reviews which are detailed and well,good.so i will be haphazard in my writing.without spelling out the story,as you can see from the description,our protagonist is the head of an esper organisation P.A.N.D.R.A.the children,who are the main protagonists inthe parent anime,are present,though in a supporting role rather than as leads.hyobu is humanised,everyone seems to care for his wellbeing genuinely.the relationship between him and his sister could have been made better.i would love to see them reconciled in a way.and i would love a second season.this one is short,at 12 episodes.nowhere doe the narrative seem stretched.the pacing is very well.if you enjoyed x-men,chances are that you will like this too.even though i have not seen the parent version,i enjoyed this immensely.there is no need to watch that.on the contrary,i can confidently say that this is definitely better than its parent version.",
            "date": "2014-04-15T22:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 140109,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3644167.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Maggot_Brain",
                "username": "Maggot_Brain"
            },
            "url": "https://myanimelist.net/reviews.php?id=140109"
        }
    ]
]