[
    [
        {
            "content": "\"Why are girls more susceptible to same sex or bi-sexual orientation? Who knows, but it sure does make a good source of comedy material in the anime world\"\r\nYuru Yuri (literal translation Easy-Going or Slow Yuri) is a Japanese manga series written and illustrated by Namori about three schoolgirls... wait am I missing someone? Guess not. They took over the former room of the tea ceremony club (may I add how manly tea is?) to form their own \"amusement club\" Yea because in Japanese highschools it isn't illegal to just take over another club room for your own amusement. I know I used to make theboy's toilet my secret base. (It's ok, guys doesn't even like to use our toilets) Cause seriously which guy hadn't secretly used the girls toilet because he can't stand the odor in the guy's toilet. That is until they see the huge pool of blood and get traumatize for life.\\n\\n\r\nYuru Yuri is a generic \"moe-slice-of-life\" anime with those moments of dialogue and acting that could be interpreted as overly homoerotic, but not as much if you know the real context. As funny as it is, the whole \"X girls just hanging out and having fun\" where X denotes the number of the main cast (which is normally the Four Girl Ensemble), is nothing new to the anime scene. But some people, even myself, enjoy this moment or repetitiveness. \\n\\n\r\nSo as the story progresses more girls join the main casts to form the ultimate Lesbian Full Cast in their hilarious mishaps. You can never have enough middle school girls in one story right? I hope I don't sound like a pedo here...\\n\r\nWorry not as eventhough with the introduction of new characters, the 3 main girls are still the stars of the plot. (Seriously, I feel like I'm forgetting someone)\\n\\n\r\nArt wise, on a scale of 1 to 10 on the moe-art-meter, this anime scored an 11. Seriously, if you do not even smile or give a faint grin on your face when you see their big beady, glowing eyes then you sir, HAVE NO SOUL! The character  were filled of emotions. Heck, I wish I could understand Japanese so I wouldn't have to read the subs and miss all those visual cues. Overall, the character designs makes you go Uguuuuuu~ even if you're not a pedophile.\\n\\n\r\nAs for sound, definitely hands down, my favorite opening and ending theme for this season. No. Possibly for this year so far. It's catchy, it's upbeat, and it never gets old for me for some reason. If you get on a public bus or you're taking the subway train and you see a guy with headphones on bobbing his head, that would probably be me listening to the opening and ending theme song. Eventhough most of the seiyuus are new or haven't been given sufficient roles, they were able to execute their characters personalities quite well.\\n\\n\r\nCharacters! Because the whole selling point of Yuru Yuri is their characters!\\n\\n\r\nTOSHINO KYOUKO! \\n\r\nIt's a universal rule that if you want to mention her name you must shout her name in a harsh tone. This lovable girl is the center of all the comedy that is happening in Yuru Yuri. Smart, talented, manipulative and downright annoying but in an amusing way. Her sexual orientation is still questionable though. She's supposedly the main character but I keep forgetting there was someone there in the spotlight before her.\\n\\n\r\nFunami Yui\\n\r\nShe plays the older sister role within the whole cast. Indepent, reliable, you know the type that end up being the \"Yuri Target\" by the female cast. She's very vulnerable to jokes involving word play. On a plus point she's a bit like a kuudere with her monotonous voice and attitude over her friends.\\n\\n\r\nYoshikawa, Chinatsu\\n\r\nCute at first sight but holds a deeper alter ego who is actually very intolerant. She's in the centre for the love triangle between Yui and TOSHINO KYOUKO!\\n\r\nWell I wouldn't put it as a triangle because it's more like a straight line. \\n\r\nTOSHINO KYOUKO! ---> Chinatsu --->Yui\\n\r\nHer sexual orientation, though, is confirmed to be lenient towards yuri.\\n\\n\r\nOther casts includes \\n\r\nSugiura Ayano who is the student council president and fierce rival of TOSHINO KYOUKO! eventhough the latter doesn't really acknowledge it.\\n\r\nThough, she herself might be falling in love with TOSHINO KYOUKO!\\n\\n\r\nIkeda Chitose\\n\r\nThis woman single handedly taught me the power that bestowed upon people with low vision. The ability to fantasize in real time using your other senses as your vision sense is low, your other senses such as hearing is magnified. Her fantasies and nose bleed had become a running gag in the series involving Ayano and TOSHINO KYOUKO!\\n\\n\r\nHimawari Furutani and Sakurako Ohmuro \\n\r\nGuess what's more annoying than a tsundere girl? Two tsundere girls! Seriously, this two childhood friends forms the tsundere couple which is funny but a sight for sore eyes as well. Oh and both of them revolves around the whole \"Boob Gag\" which is the whole Big breast vs Flat Chest.\\n\\n\r\nOverall, from what I first expected from the season preview, this anime beats beyond my expectation. I'm no fan of yuri, I've never even watched any yuri anime before this. So it' safe to say that even if you're  homophobic, you would still enjoy this anime to the fullest. The comedy aspect is great as it covers a huge range of variety from Comedic Sociopathy to breaking the fourth wall with the audience. Not to mention the entertaining 10 seconds running cycle between every intermission is somewhat entertaining. As the title suggest it, Slow Yuri because on a yuri scale of 1 to 10, this anime would probably score a 4 as the yuri theme is only as suggestive as the audience would imply it to be. \\n\\n\r\nHaremu Kingu,\\n\r\nSigning out...\\n\\n\r\nSeriously, I still have a feeling I left someone out. Can someone please tell me who it is?",
            "date": "2011-08-31T22:02:00+00:00",
            "helpful_count": 520,
            "mal_id": 42517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=42517"
        },
        {
            "content": "Azuriin~!\r\nHai! Yuru Yuri review, hajimaru yo~!\r\n“Meh, here’s another god damn moe blob slice-of-life. I don’t understand why people like shit like this…”\r\nIf this is your mindset, then even without saying it, you know you should pass up on the offer; however, if you have do have an interest in slice-of-life anime, comedies, or shoujo ai (You should note that shoujo ai is not a major genre. It doesn’t have as much yuri as you would expect from its title), then go for it. I started watching Yuru Yuri thinking it would be fantastic, and do you know how it turned out? Yuru Yuri absolutely amazedme by how it was more than fantastic, it was glorious! I do not even remember the last time I have laughed so much. I know that I laughed in every episode and I loved every minute of it. Do you know what else? I am actually quite sad that the show is over, but as they say, “all good things come to an end.”\\n\\n\r\nWhat is anime? Anime is a form of entertainment. If you find anime unentertaining, maybe you should pick up another hobby (I’m looking at you, Mister “I rate everything 5s and below”) and think about it. Next question: Does entertainment need things like “plot”, “development”, or “climax”? The answer is no. Entertainment is something that entertains you. It is most does not have to have any of those things. Recently, many anime watchers are too stuck up in their ideals that all slice-of-life shows are bad because they lack a plot. I can only reply by saying that slice-of-life entertains me to no end. Tying this all back to Yuru Yuri, I can clearly say that Yuru Yuri gave me such an abundance of enjoyment that I can only agree that Yuru Yuri is indeed a good anime.\\n\\n\r\nSo does Yuru Yuri have a story? Does Yuru Yuri have development? Does Yuru Yuri have a climax? It probably does not more than it does, but does that stop it from being entertaining? You can bet it does not. If you think you could enjoy Yuru Yuri, if you are not a slice-of-life hater, you will enjoy Yuru Yuri. If you watch the beginning of the first episode, you may think it looks exactly like a stereotypical slice-of-life, but don’t be fooled! That opinion will change very quickly! Every episode made me laugh. Some episodes made me surprised, some episodes left me shocked, and some even left me sad. Yuru Yuri can definitely bring out all of these emotions and more, but still have you smiling at the very end of each episode.\\n\\n\r\nOpinions are always hard to form on art style and quality. You can hate it, love it, or don’t mind it. If you’re like me, art doesn’t play that big of a role and you’re excepting of most art styles. So how is the art style for Yuru Yuri? It’s fantastic to me. The character designs are pretty darn cute and the animation flows nicely and sometimes reminds me of Gurren Lagann. Art actually takes a big role despite being your typical anime. The art switches to fit the mood, and in one episode in particular, the art is definitely interesting… I won’t explain though, as I don’t wish to spoil the fun, but it definitely left me laughing. Bottom line? The art style is cute and definitely fitting (The facial expressions always make me laugh), and the animation certainly flows smoothly.\\n\\n\r\nAnd what do we have for characters? Surprise, it’s your typical four cute girls doing cute things, right? Yes and no. If you continue to watch the show, there’s only three main characters… no wait… uh… In any case, there are more than just your four main characters. We also have the four members of the student council that frequently (almost every episode, so they might as well be main characters) appears and interacts with your four main girls who are members of the Amusement Club. Our lovely protagonist is Akari, who appears at the start of each episode, actually has the least amount of presence. You may think it’s a bad thing, but it’s not because that’s the joke. It’s referenced to in every episode and it’s a genius joke that never ceases to make me laugh. If we were to name the true main character, it would most likely be Kyouko, our hyperactive and fearless leader. She’s hilarious and makes everything enjoyable. Yui, her close friend, plays the straight man and gets embarrassed easily leading to very laughable situations. Chinatsu, our typical pink haired character, has a somewhat nasty personality, but her cosplay and hilarious art makes up for it. Finally, we have our student council members who are recurring characters for each episode. Ayano, the vice president, has a love interest, the most prominent source of Yuri in the show, with Kyouko. Ayano’s a bit of tsundere making her a likable character, but she also has a hilarious way of speaking where she will put the first syllable of the word at the end. Next, we have Chitose who has nosebleeds and is fond of KyoukoxAyano. Her twin sister, Chizuru has a drooling obsession for ChitosexAyano. Chitose has much more of cheerful personality in contrast to Chizuru who is cold. Chitose has much more aire time than her younger sister does, though. Finally, we have the two first year members of the student council, Sakuraku, who is a “baka” tsundere, and Himawari, who is the breast/ojou-sama factor. Hilariously, Sakuraku and Himawari are tsundere for each other leading to endless hilarity. Furthermore, the creator of the series went as far as submitting a marriage proposal under their names. Truly, that’s genius!\\n\\n\r\nYuriyurarararayuruyuri~ The OP and ED are hilarious and are more of an acquired taste. If you don’t like them, you’ll either end up finding them annoying or end up loving them. I personally find the use of the anime title in any OP genius. The soundtrack was fantastic, there wasn’t any piece of music that made me want to kill myself; furthermore, the music smoothly fits each scene to ensure the viewer receives the right emotions. And how about that voice acting cast? First, we have the pro, Toyosaki Aki (Chitose), returning for another voicing role as well as another well-known voice actress, Fujita Saki (Ayano), who is famous for Miku’s voice if you didn’t know; however, the four main characters are all voiced by fairly brand new voice actresses who are only taking on their first or second roles. And how did it turn out? These girls did a fantastic job. Their voices were brilliant. I can absolutely see them, Ootsubo Yuka (Kyouko) especially, rising to the top in the future because she did a marvelous job.\\n\\n\r\nSo did I enjoy this series? You can sure bet I did. And you know? If you have any interest at all, you’ll enjoy it too and end up laughing hysterically! I promise. To those of you who have actually stuck around to the end of this review, I thank you graciously for taking the time to read it. To those of you who are reading this after finishing Yuru Yuri and disagree with me, I only wish you tell me a few things:\\n\\n\r\nTell me you didn’t laugh when you saw what was in Akari’s sister’s room in episode one.\\n\\n\r\nTell me you didn’t laugh when Akari is totally blocked/loses her presence in the beginning of the episode three.\\n\\n\r\nTell me you didn’t smile at the Higurashi reference, or tell me you weren’t shocked at the sudden development in episode five.\\n\\n\r\nTell me you weren’t scared as hell in episode six.\\n\\n\r\nTell me the presence jokes don’t continue to make you laugh in episode ten.\\n\\n\r\nTell me you didn’t almost cry in episode eleven.\\n\\n\r\nTell me you didn’t enjoy Yuru Yuri.",
            "date": "2011-09-20T16:17:00+00:00",
            "helpful_count": 292,
            "mal_id": 43849,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/255317.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AzureHakua",
                "username": "AzureHakua"
            },
            "url": "https://myanimelist.net/reviews.php?id=43849"
        },
        {
            "content": "2018 EDIT: I wrote this review when I was about 15. So please excuse my bad writing and total misunderstanding of certain things. Also I’d like to especially apologise for the casually homophobic remarks. I mean, still find this show boring as hell, but for that I would totally deck 15 year old me in the face too.\r\n.\r\n.\r\n.\r\n.\r\nSince K-On! came by in 2009, every animation studio and their dog has tried to emulate their success. Some fail miserably and make downright awful shows that have no chance of being successful. Some make shows that are just as marketable as K-On!. But the one reason whyK-On! is still number one is because along with being a huge cash cow, it was a good show to boot. Animation studio  Dogakobo's attempt at jumping on the bandwagon is a comedy series that tries to mix things up by adding lesbianism into the mix. Yes, these types of shows have hints at relationships between the same sex but Yuru Yuri is the first of these kind of shows to come right out and say it. It's a bold move but does can the show stick out with boldness alone. No. No it can't.\\n\\n\r\nThe show's formula is somewhere between Lucky Star and K-On. The structure is mostly a bunch of loosely connected gags like Lucky Star but less random and more coherent like K-On. Unfortunately, its not nearly as good as either. It feels empty even compared to the boring parts in Lucky Star. Just like Lucky Star the story is non existent but it's not funny enough to excuse the lack of cohesiveness. The creators probably just thought, 'We'll add in a bunch of clichés, put in one tiny defining trait and call it a day'. It has the interesting (And a little creepy (I'm not homophobic by the way)[Yes you ARE 15 year old Seibaa - Sincerely, bi 21 year old Seibaa]) angle of the characters actually being lesbians but where do they go from there? nowhere. It's just the same sort of thing you see in every one of these shows. \\n\\n\r\nThe art is basic but serves its purpose of showing incredibly bland lesbians doing incredibly bland stuff. It's basically exactly what you expect from this type of show. Though I give the creators credit for not going for a Kyoani esque moe art style. The animation is just there to make the boring pictures come to life in a boring matter. Just like the rest of the show, it does what it needs to do and does nothing more. The character designs are actually not bad with each girl having a lot of distinctive features. The colours aren't vibrant but they are quite nice to look at. The show certainly has its own art style (Unlike most of these types of shows) but it isn't all that interesting. It just does what it needs to do and goes to the back room for a smoke.\\n\\n\r\nThe opening and closing are catchy but not in a good way. When I say catchy I mean that its so annoyingly bad that you can't get it out of your head. Apart from some odd lyrics (Seriously, look them up) It sounds exactly the same as the opener to Lucky Star, Kanamemo and a pretty much every show in the genre. Background music is incredibly forgettable. I can not remember a single song from this. You think with in a show with nothing going on you'd get more acquainted with the music. That's one of the reasons why these carbon copies almost always fail. In Lucky Star and K-On! they had great background music that you came to enjoy after watching the show for a while. Whereas all of these shows just throw together a bunch of forgettable crap and hope you remember at least one of them. \\n\\n\r\nAnyway back onto the subject, I did really like the music in the eye catchers. In fact I just really love them. It's up their with some of my favourite shows for eye catchers like Cowboy Bebop and Gurren Lagann. It's the best part about the show by far. If only the rest of it was that good. The voices, like a lot of things in the show, lack any defining traits. I swear to god that it was Ayana Taketatsu (The voice actor for Azusa from K-On!) voicing Chinatsu. The cast still has a few recognisable names such as Emiri Kato (Kagami from Lucky Star), Aki Toyosaki (Yui from K-On!) and Aoi Yuuki (Madoka Magica). Oh and Ayana Taketatsu still has a voice role in the show.\\n\\n\r\nUnless you haven't already put one and two together, you could probably guess how the characters are. Yep that's right. Bland and generic with no defining traits. It's all based on character types. There's Energetic Spice, Quiet Spice, Frequently Ignored Spice and Stalker Spice. God the Spice Girls are awful. Where was I going again? Oh yeah! The characters in this show suck. But if the main cast is bland, perhaps the background characters could be interesting. No dice. There's the pervert, the tsundere, Hell Girl, the tsundere, the tsundere and the tsundere. Oh yeah, and they're all lesbians\\n\\n\r\nOverall, this show is just another show. It has nothing to differentiate itself as its own show. Its style of comedy is 'borrowed' heavily from much better shows like Azumanga Daioh and K-On!. I've know I've been repeating myself for most of the review but my point still remains valid. This show is incredibly unoriginal. It has ideas on how to do it differently with a few alright running gags and an atmosphere that's ripe with opportunities for comedy but all that potential is just wasted. I did think that the second to last episode was pretty good but the rest of the show is incredibly forgettable. If you like these types of shows, than you'll probably like this show. If you aren't, ignore it and move along.",
            "date": "2012-07-09T09:02:00+00:00",
            "helpful_count": 64,
            "mal_id": 65819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1191091.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/SeibaaHomu",
                "username": "SeibaaHomu"
            },
            "url": "https://myanimelist.net/reviews.php?id=65819"
        },
        {
            "content": "I'll just add the obligatory disclaimer now. This is my first review so I hope I've done it right.\r\nIf you've seen anything like Lucky Star or perhaps K-On then you're no stranger to the \"Cute girls doing cute things\" genre that has been shorthand called Moeblob anime. Yuru Yuri is the same as those except there is one difference. Everyone in this anime is by some degree wanting to do various sexual things to the same sex.\r\nLets start with introducing the basic cast. From the left in the picture up top we have Funami Yui a sort of Tomboy and Responsible character. She's close friendswith Toshinou Kyouko and Akaza Akari. Next is the Blonde Toshinou Kyouko, she's a wild sort of character but ultimately Yui manages to keep her in check which kind of helps when she tries to molest Akari or Chinatsu. Akaza Akari is the anime's main character I guess however she suffers from not being able to stand out very much and ends up being ignored. She's a year younger than Kyouko or Yui but that hasn't stopped them being friends.  And lastly is Yoshikawa Chinatsu the newcomer to the group who admiration for Yui touches on romantic feelings while rejecting the many advances Kyouko tries to make towards her. Other characters include the student council which includes the vice president who has a deep rivalry with Kyouko but is in fact just wanting to be her friend(Can you say Tsundere), a girl who enjoys immersing herself in lesbian delusions of the vice president and Kyouko in various risque situations and two girls who fight between themselves for the position of Vice President however they really appreciate eachothers companionship(Once again Tsundere)\\n\\n\r\nThe art isn't bad but it's not good either. As common for moeblob characters they have large heads and absurdly big eyes.\\n\\n\r\nThe Music is pretty generic but for some reason the Opening theme is quite catchy. I found myself quickly humming along to it\\n\\n\r\nLets face it there's little to no plot in this show so if you're going to be watching it you'll be watching it because you either enjoy the genre or because you want something to just sit down and enjoy without thinking too hard. It's for this exact reason that I think I myself enjoy Yuru Yuri so much as I have enjoyed A-Channel in the previous season.\\n",
            "date": "2011-07-26T07:47:00+00:00",
            "helpful_count": 62,
            "mal_id": 40033,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/135360.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Xoraan14",
                "username": "Xoraan14"
            },
            "url": "https://myanimelist.net/reviews.php?id=40033"
        },
        {
            "content": "“Yuri your way to success! Vol. 1” -Now with footnotes! \r\nApproximately 12 years ago, we were introduced to a certain J.C.Staff series about a  girl from Osaka and her five friends. A couple of years latter, KyoAni presented to us a self-entitled otaku and her friends: the twin-sisters and the smart-but-clumsy bishoujo¹. Those stories would go around these girls and their (barely average) easygoing high-school paradise.\r\nInteresting? Entertaining? What is the point? It doesn't really matter, deshou? \r\nIt just happened that the community saw it was good, the industry saw it was profitable, and from that on, we started watching shows about cute girls doingcute stuff for no apparent reason (both us and the cute girls).\\n\\n\r\nThe story:\\n\r\nOh... the story! Yuru Yuri main plot is the daily events of Akari, Yui, Kyouko, Chinatsu (don't forget to add the -chan!). As middle-school students without a serious goal to achieve, YuruYuri focus on showing these girls having... fun! As the opening song itself explain \"My real job is to 'student'! What's with that?\" so all the key events of this series are pretty predicable and are related somehow to their school/hang out activities. The typical school slice-of-life.\\n\r\nBut this isn't the real reason why 90% of us watches it anyway.\\n\r\nI bet you interpreted “fun” on the previous paragraph in a malicious way, huh? \\n\r\nWhile those easygoing and relaxing events of their daily life would give a fair amount of entertainment, seeing cute girls expressing their affection to each other in a PG-13 way is also pretty entertaining! And perhaps the key part of it: delivering such a thing without the inclusion of a douche male protagonist neither having to label the series as he-he-hentai! is what draws the attention of crowds to it. That said, straight from the first episode, it becomes clear that \"Yuri\"² moments are one of the key components of Yuru...YURI storyline.\\n\r\nBesides from being astonishingly cute and having these girl-love moments, the series strongly bets on their visual gags, practical jokes and references as save-points, keeping the viewers from being bored during long scenes or dialogues. A proof that it works can be easily found online, it's the amount of internet “memes” that were created from scenes of YuruYuri.³\\n\r\nAnyway, I digress. \\n\r\nThere's no point into further developing this topic. Someone who is reading this didn't got here by accident and most likely have a backlog on series like this. If YOU happen to be one of these people and is now nodding in agreement, the reviewer thanks you for cooping with it. *brofist* \\n\\n\r\nFollowing the same idea of the story, characters of YuruYuri are what one would expect of a show about easygoing school-girls. In a nutshell: They're patterned. \\n\r\nWe have the clumsy, resident airhead MC; the admirable, dependable senpai; the polite, dependable \"notice me senpai!\" kouhai and finally the over-hyped, loose cannon senpai.\\n\r\nNot to mention they are all, obviously, CUTE.\\n\r\nWhy are they always four? ...who is producing this, anyway!?\\n\r\nOh, not to be forgotten, there are also the often forgotten supportive characters! They are there to add a bit of spice to the overall sweetness, some even have a separated story arc just for them which is great considering the flow of the story since it helps to keep the attention level. To be honest, these characters even get more screen-time than a certain MC ...you'd find out sooner or later.\\n\r\nAlong the story progression, some other characteristics of theses girls become easy to notice and the classical tsundere/yandere/dandere⁴  action finally shows up.\\n\r\nHahi, That was it!? Actually, there isn't much to digress about... giving a further explanation on these characters would spoil the first two episodes and completely ruin the mood. But still we want you to believe this is character driven so.... can we pretend we explained why, and you pretend you got it? *pshhh! No mod's gonna see this!*\\n\\n\r\nIn the era of moe, what isn't moe is a pagan non-believer!⁵ \\n\r\nThe artwork! Oh yes! *nosebleed* did I already mention it is... cute?\\n\r\nWhat kind of reviewer describes every aspect of the show with one single word?\\n\r\nWell, watch it and then we can discuss. \\n\r\nJust like its ancestors mentioned in the beginning of this review, YuruYuri's artwork is simple but well colored and surprisingly detailed at close ups. The “moe” factor is obviously part of it, which means, you won't find a character that is “ugly” at all.\\n\r\nWorth mention: animators did a very good job with characters' eye design. They doesn't have that artificial feeling to them neither artificial lightening, which makes it really fit the overall coloring.\\n\\n\r\nyuriyurararara yuruyuri yuriyurararara yuruyuri yuriyurararara da-i-ji-ke-n!\\n\r\nAin't I missing a “Kyarun!★~”!?\\n\r\nIt doesn't takes much to create a OST for a slow paced school slic- *stabbed*\\n\r\nStill, it wouldn't be a lie ...to some extend.\\n\r\nThe OST really matches the pace of the story, meaning, we get lot of relaxed synthetic instrumentals AND some funky remixed opening/ending. If you think you've heard these songs before, it's not a problem at all. Since this kind of series always use the same tempo and arrangement for their songs, sounding similar is just part of ride. Both the OP and ED are also performed by the main characters' seyuu-tachi. They're at the same time hilarious and addicting... during the first 5 episodes. Later on it gets really annoying and you'll just skip it all together.\\n\\n\r\nOverall, YuruYuri is way more enjoyable than it seems. Really.\\n\r\nNot because it later turns into a full ecchi yuri R+ hardcore anime (!?), but because it manages to -somehow- make you laugh for 288 minutes. Who would imagine a school slice-of-life about pure teenager girls could be this fun? I wouldn't.\\n\r\nSo, if you're wondering about watching or not, accept the challenge and get started on it already. The entertainment value may vary from person to person, however, it will absolutely manage to take a laugh from you, even if it's just with a short Higurashi⁶ reference (Heh, is that a glace of curiosity?) or a quick reference joke with the YuruYuri Akari x Aria Saga Akari and her signature expressions \"waaay!\" \"hahi!\".\\n\r\nSecure your loli and prepare for impact! A furious ride into the amusement world of these girls is about to begin!\\n\\n\r\nThe Footnotes:\\n\r\n¹ – extremely beautiful, cute, amusing, girl. Notorious examples: Anything Key/Visual Arts produces in collaboration with KyoAni.\\n\r\n² – Yuri is a modest synonym of Shoujo Ai, girls love, lesbianism, girl-on-girl action, etc.\\n\r\n³ – Seriously, YuruYuri related memes were all around /a/ by the time it aired. Ask Mr. Google.\\n\r\n⁴ – Japanese slang used to describe one's characteristics. (e.g: the tsundere is the girl who is violent (tsun) but loving (dere) towards the one she cares about.\\n\r\n⁵ – Yes!!! YuruYuri is 100% MOE, meaning, they can't possibly be less cute. UrbanDictionary gives a pretty neat explanation: “Moe is when your heart gets a boner.“.\\n\r\n⁶ – Higurashi no Naku Koro ni. Cute series.\\n\r\nobs: credits to @MAL Ikusagami for the insight of the review title.",
            "date": "2014-03-05T10:22:00+00:00",
            "helpful_count": 57,
            "mal_id": 134797,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/339221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xbobx",
                "username": "xbobx"
            },
            "url": "https://myanimelist.net/reviews.php?id=134797"
        },
        {
            "content": "Pros:\r\n—Fleeting moments of amusement and marginal hilarity\r\n—Very occasional heartwarming moments\r\nCons:\r\n—Characters comprise a bog-standard mix of moe show cliches\r\n—Running jokes that either aren't amusing to begin with, too quickly become tired, or both\r\n—A permeating sense of predictability\r\n—Mildly disturbing yuri theme. There's nothing wrong with that in and of itself. But how is it so universally widespread, and why do the recipients of one-way lust accept it without second thought? Is there no room for platonic friendship in this universe? You would be right in thinking this sort of thinking is too deep for a show like this. It just feels rather out of place in thissort of comedy anime, and it wore on me pretty fast. But maybe that's my personal taste. \\n\\n\\n\r\nI consider myself a fairly forgiving judge of anime. Though my volume of intake is pretty far below average (at least judging by MAL users), I generally know what type of shows I like and seek them out accordingly, so I'm rarely too disappointed.\\n\\n\r\nMoreover, I'm a fan of slice-of-life, slower, and what otherwise might be called—though without ill regard—“aimless” shows.\\n\\n\r\nHowever, Yuru Yuri inspired me to write my first review, in order to warn others of its overwhelming mediocrity.\\n\\n\r\nAt only 12 episodes, the more dedicated among you may want to give it a shot anyway, having already cleared the tens (hundreds?) of better shows of this nature.\\n\\n\r\nFor those of you more discerning with your time or taste, I'd skip it.",
            "date": "2013-04-05T06:45:00+00:00",
            "helpful_count": 37,
            "mal_id": 92487,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5384.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/GBKeroberos",
                "username": "GBKeroberos"
            },
            "url": "https://myanimelist.net/reviews.php?id=92487"
        },
        {
            "content": "Yuru Yuri is a shoujo ai anime that focuses on 4 school girls as they form an amusement club. The cast is stretched out shortly after to more characters, and with the exception of Ayano and Chitose, who become the most reacurring characters with the exception of the four mains ones; Kyouko, Yui, Chinatsu, and Akari.\r\nThe main joke of the story is Akari, and the fact that she is considered to be the main character of the show but never stands out. She is noticed for being unoticed, even making jokes about her having the power of invisibility.\r\nToshinou Kyouko is the main focus of theshow. She reminds me of myself, a crazy and relentlessly random girl who could shout out or come up with any weird or wacky idea on the spot. Toshinou is just plain loveable, the very basic term to describe her.\\n\\n\r\nYui, the tough one or guardian in the group. She is not necessarily a barbarian or roughian, nor could she be considered a tough-guy kinda girl, however she maintains a type of quiet atmosphere around here, and often acts as the voice of reason or the keeper of order of the group\\n\\n\r\nChinatsu is the mean and somewhat snobby one of the group. She makes no attempt to hide her feelings for Yui, and is often seen rejecting Kyouko. I didn't really like Chinatsu that much, and infact i would classify her as the least liked character in general, of the four, however yuru yuri wouldn't be the same without her.\\n\\n\r\nAs for the opening and ending songs, I have never, and I mean ever, seen a more enjoyable opening and ending for anything, let alone any anime. This is the only anime i would look up on youtube just to watch, and the ending is really catchy as well. Both are well suited for the spirit of the show.\\n\\n\r\nAnd that brings me to plot, there isn't much in the way of plot, the show revolves around the characters, what they do, how they react with eachother, and over all it works. The comedy in the show is great, I have laughed myself to tears on a number of occasions, and well besides the cuteness of the show, there isn't much else to say except job well done. For what would be considered another generic slice of life anime, i loved it from start to finish. 10/10 and it is at the top of my list of favourite animes.\\n\\n\r\nI would also class this as one of the best Shoujo Ai animes released in a long time. I think this was very well balanced, they kept the shoujo ai element but didn't make it the centerpiece, which most shoujo ai animes do.",
            "date": "2011-10-12T18:04:00+00:00",
            "helpful_count": 22,
            "mal_id": 45419,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/308481.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lunarchy",
                "username": "Lunarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=45419"
        },
        {
            "content": "Trashy Pandas\r\n“Hey, want to hear about the new anime I started?”-Me\r\n“Yeah sure. What's it about?”-Mitch\r\n“It's a show about a group of ravenous lesbian-”-Me\r\n“NOPE!”-Mitch\r\n\tSo goes a short conversation with my pal Mitchell. I started watching Yuru Yuri just a short while ago and I was able to come to the conclusion that “Yuru Yuri is a show about a group of ravenous lesbian middle-school girls who do zany things while staying semi-PG or mostly PG-13.” (Me) Yuru Yuri is a great anime when it comes to sound track, characters, and animation style because the characters are impossible to hate, the sound track fits perfectly with themood, and the animation style just works.\\n\r\n“Yuru Yuri.. Hajimaru yo!” — Akari Akaza \\n\\n\r\nI Characters\\n\r\n\tFirst of all, the characters are really enjoyable to watch and listen to. Each girl has her own kind of cuteness and adorable personality. Akari and her “lack of presence” in the anime is humorous and I personally think it's cute. Kyouko has her flamboyantly hyperactive personality which makes her stand out more than any other character. Chinatsu is just straight adorable. Yui on the other hand is much more tame than the rest of the Amusement Club and has a very level head. She is definitely my favorite of the group. As for the other characters, I can say that I love them just as much: Chitose with her extreme amount of fantasies, Ayano with her little tough facade that she always puts up, and Sakurako and Himawari (shipped so very hard by me) who I swear love each other but don't want the other to know. All in all, the characters are each unique and interesting to watch.\\n\\n\r\nII Soundtrack.\\n\r\n\t “Yuriyurararara Yuru Yuri!”(YY OP). The OP for Yuru Yuri was the strongest attention getter for the anime; I found myself downloading it within the first few episodes and not being able to wait to hear it again. The OP does a wonderful job of setting the mood for the anime: lively, friendly and  silly. The tempo is very upbeat and the song mostly uses high notes, which emphasize the characters of the anime. High pitched, upbeat OP for a show about cute middle-school girls. Works like a charm. As for the soundtrack during the anime, I can't say that it really stood out that much. I honestly don't even remember any musical moments. The ED was pretty good. I didn't pay much attention to it because I was busy sorting out pictures and screenshots that I took during the episode. In the end, the OP is what really makes the entire soundtrack for Yuru Yuri. \\n\\n\r\nIII Animation Style\\n\r\n\tThe animation style of Yuru Yuri fit wonderfully with everything and works to make the show stand out. As anyone would expect, a show about cute girls would have a cartoony, cute animation style. Effects were handled nicely whenever some silly scene would come up: exaggerated and over-the-top cartoony style made scenes really pop out.  However, I found the character designs to be rather lackluster. Each girl had the same exact school uniform on, which is not necessarily a bad thing, but it got a little boring after a while. The only thing that made the girls able to be physically differentiated was the hairstyle, color, and accessories. I did like the hairstyles, but I feel very meh about it. The art/animation style did great work at making the anime feel exactly how it was meant to be: silly and cute.\\n\\n\r\nIV Plot\\n\r\n\tThere is not a whole lot to say about the plot except that it has no real depth, but manages to work for the anime. For a show about lesbian middle-school girls that love each other, partake in silly adventures, and do crazy things with each other, the plot fits well despite having little depth. The plot is defined in the first episode and then takes a backseat while the Amusement Club has its fun. Yes, the plot is the formation of the Amusement Club and it could be argued that the plot is around the entire time. Beyond the forming of the Club in the first episode, the plot takes no real direction beside the “sub-plots” (adventures) for the girls and their cute romance-esque “stories”.  \\n\\n\r\nV Romance\\n\r\n\tThe romances for Yuru Yuri were pulled off extremely well by showing that cute girls could love each other without being explicitly sexual. While some sexual situations are hinted at through Chitose's fantasies and through most of the episodes, there is nothing explicitly sexual about the girls. While there is a lot of emphasis on Himawari's large breasts, there is no explicit images of her or any other girl. I really love the lack of sexually explicit material because the show would have had an entirely different feel if the material was in the show. Please do note that I am referring to sexually explicit as in graphic nudity like in Sekirei or High School DxD or ect. As for the romances themselves, they are very adorable and will make anyone smile.\\n\\n\r\nVI Theme\\n\r\n\tThe only real theme that I could pick out is loving your friends and cherishing the time you get to spend with them. Clearly displayed in each episode, the girls love each other and enjoy the time they spend together. There isn't much more to say about this. Love you friends and love the time you get to spend with them.\\n\\n\r\nIn conclusion, Yuru Yuri gets a 9/10 and the Pandas Seal of Approval for its excellent characters, art/animation style, soundtrack, romance and superb kawaiiness.",
            "date": "2014-05-20T16:09:00+00:00",
            "helpful_count": 18,
            "mal_id": 143953,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3781599.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TrashyPandas",
                "username": "TrashyPandas"
            },
            "url": "https://myanimelist.net/reviews.php?id=143953"
        },
        {
            "content": "So this anime is basicly Japanese lesbian middle-schoolers doing cute and entertaining stuff (the yuri stuff never gets past sort-of unintentional kiss). If this sounds entertaining or fun to you, then congratulations. You will probably find this anime very enjoyable.\r\nThere is honestly not too much else to say about this anime. The characters are charismatic and likable. The interactions between them are well written and feel very natural. The overall art and animation are nice, good on the eye and quite a joy to watch. The opening and ending is good. \r\nHonestly there is not much to say about this show, which of course doesnot make it bad. At it's core it is a very well written, well executed, funny and relaxing slice of life anime. As I said if you found the first sentince to be to your taste, than you will love it. If you are not into these kind of things well....there is nothing to see here for you. \\n\\n\r\nThis anime is a difinition of a relaxing and joyful slice of life anime done right...with a bit of soft yuri.",
            "date": "2015-06-12T04:37:00+00:00",
            "helpful_count": 14,
            "mal_id": 190145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4468529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zelos7",
                "username": "zelos7"
            },
            "url": "https://myanimelist.net/reviews.php?id=190145"
        },
        {
            "content": "After watching this anime I had to do a review on it. This anime gave me a good laugh over all. All the main  and side characters are funny in there own way. This anime reminds of the anime Strawberry Marshallows more than any other anime, if you havent watch it or read it, do so and you see what I mean. I personally enjoy shoujo ai/ school life/ Moe anime so i automatically fell in love with this anime, Plus the comedy, wrap it all up in one. The first two episodes may start off slow but i guarantee you gonna enjoy italot after the first three episodes passes. Definitely a must watch anime, that if you like comedy, school life or shoujo anime or all three.",
            "date": "2012-01-06T18:30:00+00:00",
            "helpful_count": 14,
            "mal_id": 51117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/367183.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/piplub",
                "username": "piplub"
            },
            "url": "https://myanimelist.net/reviews.php?id=51117"
        },
        {
            "content": "1) This show has \"Yuri\" in its title, it's comedy, and it's slice of life\r\n2) I like yuri, I like comedy and I like slice of life\r\n3) Well, the third step is obvious, isn't it? I just had to give this a shot.\r\n4) .......\r\nOkay, maybe some things don't mix after all. Yuri and slice of life don't make a fusion as good as I hoped it would.\r\nFirst of all, I found this show boring. Nothing really happens in it. Okay, some of my favorite anime don't have much going on (it is slice of life after all), but when an anime doesn't have much goingon, it doesn't automatically mean it'll be boring. Sadly, that is the case with Yuru Yuri.\\n\\n\r\nThen it's the characters. They're all just bland and uninteresting. Sure, they look pretty, but their personalities didn't appeal to me. Except Kyouko, who is a bit interesting as a character (a bit), the others were boring, or just plain annoying.\\n\\n\r\nYes, I like yuri and that haven't changed after watching this. But this show taught me that there is a time and a place for yuri, and that it doesn't fit just everywhere. Yes, while watching Yuru Yuri, I was actually bothered by the yuri element.\\n\\n\r\nWhy, you ask? Well, I was annoyed by the fact that all girls here were lesbians, bisexual, or at least curious. Not only it doesn't work that way in real life (yes, I'm a realist when it comes to this type of stuff; I may be wrong but that how I work), it's just unnecessary. I really don't mind lesbian characters, on the contrary, but not when everyone is hinted to be a lesbian, and nothing is actually revealed (their sexualities or... some actual \"action\" except harmless kissing). Oh, and I also felt uncomfortable at some forced kissing scenes, especially since the girls are underage.\\n\\n\r\nAlso, there was this running gag with the chick who takes off her glasses and fantasizes about yuri moments while watching her friends, then gets nosebleeds. And everyone else seems to be cool with it. Okay, it was funny the first time, the second, the third... but after the tenth time, it became annoying. Not only that, but she also has a twin, and we even had some slight incest hints. Some fat perverted otaku will probably find it cool and hot, but I just found it repulsive. I don't mind that stuff either when I'm watching hentai, but here, it just seemed wrong.\\n\\n\r\nTo be honest, I didn't really hate this show; if I did, I would've rated it lower. It has some funny moments and situations, some episodes were slightly better than the others, and I just can't hate the yuri element, even if I'm annoyed with it, which was the case here.\\n\\n\r\nAt the end, I must say this: just because I wasn't thrilled with it doesn't mean it's bad, or that it isn't for you. I'm very well aware that Yuru Yuri is fairly popular, and that many people like it, and I respect that. This was just my personal opinion of it (and I have a very, very specific taste), so I can't say I wouldn't recommend it to you. If you like yuri, comedy and slice of life and if you think that they can mix (unlike me), try watching it. Chances are, you'll like it more than I did.",
            "date": "2015-10-21T14:26:00+00:00",
            "helpful_count": 11,
            "mal_id": 201702,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4704003.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/daky-kun",
                "username": "daky-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=201702"
        },
        {
            "content": "From an aspect of ゆり, expect lots and lots of make out scenes with cute little girls. If you are into that stuff, this is the kind of hentai for you. We are talking softcore action going on here.\r\nHa, pervert. Bet you just went to go look up some scenes and you were about to call my review misleading, huh? That is, if you kept reading anyway, you are also probably curious as to what the rest of my review is about after that line I delivered.\r\nAlright, so actually, this anime has a very misleading name. If you reread it, it is not called \"ゆりゆり\"it is called \"ゆるゆり\" and the \"ゆる\" part actually means calm, loose, leisurely; that kind of stuff. It is basically implying that they are going to show you lots of close scenes to girls kissing, but for the most part will just tease the more perverted viewer. And it also means that their friendships are close enough to be considered ゆり nature, but still a lot more ゆる in them.\\n\\n\r\nMy review will be one of those ones that actually avoids spoiling things, but still gives off some information that will convince you to watch at least one episode. That way, some other reviewer does not ruin the experience for you. But, when you do watch this one, what you will truly get out of this anime is a surprisingly good comedy, characters and setting.\\n\\n\r\nIt is definitely similar to Lucky Star in terms of calmness and its humor feeling so natural that you would very well believe that the voice actors themselves are fighting when their characters do. It even has a few points from ぱにぽにだっしゅ with some rapid-fire comedy; something I never thought I would see outside that particular anime.\\n\\n\r\nIt delivers a sense of natural jokes that do not feel forced like most anime do and it even has a tone of randomness that does not come off as annoying; another rare trait to see in an anime. Its twists will also give you at least one laugh if you are not a very happy person. This is one of the few that says it delivers what it does and successfully does so, but even more. Do not scoff this one off if you are looking for a natural, random comedy. Especially if you have seen Lucky Star, I recommend this one right away.\\n\\n\r\nYou would be lucky to find an anime similar to its style. At least, in terms of its natural humor to be specific. This one also continues beyond its original seasons as of recently, so you are in for the long run if you begin watching this. I believe it is even close to entering mainstream status due to its very positive reception which means it could go on for a while. But, it is one of those rare mainstream anime that is not just popular because it is popular, but because it is actually funny. It even has a spin-off as well.\\n\\n\r\nIf you are expecting some light hentai action here, then you are for sure out of luck. It only has close moments and maybe (...) but you just have to watch it to see. If you are expecting the same as your private time videos, then I would just go ahead and pass this anime by.\\n\\n\r\nBut, If you are looking for a nice, calm comedy that can deliver just as much randomness as it can natural humor, you better start watching ゆるゆり right away as it delivers plenty of what you seek in this genre.",
            "date": "2015-08-09T01:07:00+00:00",
            "helpful_count": 11,
            "mal_id": 195597,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=195597"
        },
        {
            "content": "When you put a bunch of girls, many of whom have questionable sexual orientations, in a club aimed solely at the entertainment of themselves, what do you get? Yuru Yuri! \r\nQuite honestly I was questioning myself for a while whether I should watch this series or not. After reading the title and understanding the literal translation of the title, \"Slow Yuri\", my first impression was less than favorable. I'm not a huge fan or ecchi or yuri, in fact I tend to shy away from these anime genres that I usually perceive as taboo. I decided to give this series a go and watch itparallel with A-Channel (which is also a very good series in my opinion). What does this have to do with anything? I was actually able to appreciate this anime a lot more while watching this anime with A-Channel. \\n\\n\r\nIt seems like the mold for Slice-of-Life lately is four girls hanging out together doing random things while hilarity ensues. Actually this isn't always the case. While watching Yuru Yuri, I was laughing hysterically from the beginning to the end of every episode in contrast to my feeling of warmth and content after watching a channel of A-Channel. What I'm trying to get across here is that each slice of life anime has a different style and evokes a different type of emotion that makes you feel good in the end. This is important because I see many reviews and critics giving critical comments against a certain series because it \"doesn't compare to anime giants like K-On!\" I dislike this immensely because they don't appreciate the series for what it's worth. For Yuru Yuri, the series is supposed to make you laugh until your stomach hurts. I mean, a bunch of moe girls with questionable sexual orientations attempting normal tasks in the most ludicrous ways is absolutely hilarious. Of course you begin to question your status of pedophilia after realizing you're watching a bunch of moe middle schoolers, but hey! They can make you smile on the worst of days. In the beginning I thought I would be disgusted, but in the end I absolutely loved the series and have no regrets watching this series.\\n\\n\r\nBefore I go into the review, I want to point out that this is a Slice-of-Life anime. If you're not entertained by characters doing everyday things or cute character designs then avoid this. You should also avoid this if you are revolted by even the slightest bit of yuri or ecchi content, because about 70% of the series is driven by yuri or ecchi comedy.\\n\\n\r\nOnward with the review:\\n\\n\r\nStory (6): Let me clarify this. This is not a gauge of how much I enjoyed this series. It's the actual story itself. Slice-of-Life anime are notorious for having little or no plot that drives the series, just comedy or that warm fuzzy feeling inside after watching to friends make up after a fight. Slice-of-Life comedies always focus on multiple subplots that only serve as a means to bring about laughter from its viewers. At times there might be a sense of reflection, even deep reflection from one or two of the characters, but these are not necessarily the plot drivers you see in series like Madoka Magica. In Yuru Yuri, the story focuses on fours girls who are part of the \"amusement club\" that seeks to entertain its members by doing fun things. This isn't really a plot, but more a setting of both what the characters are like and what they will do in terms of their actions. Of course, this is not story, just setting. So I gave the series the fair rating like I do with all the other Slice-of-Life anime I've seen come up lately, because it's all the same setup.\\n\\n\r\nArt (7): This and character can really affect the actual popularity of Slice-of-Life series. Okay, so the artist can put together a bunch of girls in the usual after school club doing hilarious things. However, the questions about defining the series begin to appear: Can the artist make the characters and art stand out? Can the artist compliment the characters with appropriate settings and background that can help bring out the character's colors and design? There is no doubt about those facts here. Pony Canyon did an excellent job here animating these adorably kawaii girls together. The backdrop and general setting of when and where this series takes place is simple. This keeps the lighthearted and comedic mood of the series. It never hurt my eyes, and I was always smiling with the cute designs of the moe characters in Yuru Yuri.\\n\\n\r\nSound (7): I must say I really enjoyed the music of the series, especially the Character Songs, the OP song. and the ED song. All of the songs were upbeat and happy. It was like reliving the Caramell Dansen period of my life. I really enjoyed the songs here a lot. The sound effects and background music during the actually show were the same to me as any other Slice-of-Life anime. It's not bad at all, in fact it compliments the scene and action that the characters are in. However, that same statement can be applied to a lot of other anime so again I'm going to say sound effects and background music are good, but don't amazingly stand out.\\n\\n\r\nCharacter (10): I really liked the characters here. I find it similar to the characters in Lucky Star where characters fill in some sort of niche role in order to satirize the otaku community. We all know Yuru Yuri isn't a satire, but the writer of the series made a colorful cast of characters and uses them in amazingly hilarious ways. \\n\r\nWe have Toshinou Kyouko, the Genki Girl, who likes to go about doing her own things selfishly and blantantly who of course is stopped by the Bokukko, Funami Yui who serves as the voice of reason. \\n\r\nWe have the Yandere, Yoshikawa Chinatsu who is completely obsessed with Yui-senpai and despises everyone else. \\n\r\nThe Ikeda twins, the Meganekkos who are also perverts as well, revealing their fantasies at critical moments creating anti-climax or creating a lot of chaos in their wake.\\n\r\n Sugiura Ayano, the glorious student council VP and tsundere about Kyouko (both whom Chitose always yuri fantasizes about). \\n\r\nThe tsundere pair of Furutani Himawari and Ohmuro Sakurako who fill the roles of dekapai and pettanko respectively and play the role of the humorous takahashi couple.\\n\r\nThere's more to the characters here than what I've described, but with these details and more character depth, this motley crew of characters will have hilarity following after them like a dog chasing after a squirrel.\\n\r\nI feel like I'm forgetting something. Oh well time to move on with the rest of the review! xD\\n\\n\r\nEnjoyment (9): Again the sense of comedy is just awesome. Putting the most generic characters of anime together as moe middle school girls in an ecchi and yuri comedy is simply genius. I frowned at it before, but now I find myself entertained and generally lighthearted after watching the series.\\n\\n\r\nOverall (8): Pretty much everything I said above in a nutshell. I liked this series a lot because of the comedy and laughter brought about by the cute, yet refreshing cast of characters in the series. The jokes and gags are satisfyingly devious and can make you smile any day. If you're looking for some quick, cute, and devious comedy, Yuru Yuri is definitely your best bet.\\n",
            "date": "2011-12-12T21:46:00+00:00",
            "helpful_count": 10,
            "mal_id": 49075,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/454420.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LightningHound",
                "username": "LightningHound"
            },
            "url": "https://myanimelist.net/reviews.php?id=49075"
        },
        {
            "content": "Welcome, lovely fans. It's a new year and you know what that means. Yes, it's time to start the year out right with yuri anime month. Okay, so some of you may remember that last year I dedicated January to reviews of anime involving the peerless, titanic-ally talented Hayashibara Megumi. Yes, I could do that again, but this year I'm going to watch yuri instead. Let's start the month with something I actually haven't seen. Written by Namori and brought to the screen by Dogakobo Studio, this is Yuru Yuri. \r\nThe anime opens with three girls starting middle school. After classes they get together inthe tea club room because the tea club got disbanded and they decided to use the room for their amusement club. So you have a small group of girls going through school and humour based on their everyday lives. It's sort of like A-Channel if all of the characters were lesbians. Wait... something's not right about that sentence. After staring at it for twenty four seconds, I've figured it out. Let me rephrase that. It's sort of like A-Channel if the characters were more obvious lesbians who got to snog a bit. Now, the reason I'm not comparing it to K-on, Azumanga Daioh or Manabi Straight is that Yuru Yuri has the same sense of humour as A-channel. No, that doesn't mean that the jokes are the same, they're actually both pretty unique in that regard, but the aesthetic that makes up the humour is the same. The jokes may be different but the sense of comedic timing and the definitions of what qualifies as funny seem pretty identical. And no,I will not explain what an aesthetic is, you should already know it. Seriously, it's one of the basic principles they teach you in your first year of highschool literature. Now, if you really don't know it, Google is your friend. Sorry, but it would take longer to explain in detail than the review is probably going to be. Okay, so the story is the same one you get in virtually every comedic slice of life school story. But, it's a comedy so what I'm really going to look at is whether or not it's funny. Well, most of the time it is. I compared its sense of humour to A-Channel, and there's a reason for that. There are some repeated setups that are funny most of the time due to varying punch lines. For instance, there's a repeated gag where a member of the student council, Chitose, gets a bloody nose because she's fantasizing as a result of two girls being homoerotic. What generally makes it funny are either her fantasies, which are always based on what the girls happen to be doing at the moment and never get overly fan-servicey or explicit, (yes this anime has a sense of class) or the humour comes from the reaction that the other girls have to her. That isn't to say that the jokes always work. There are a few that fall short and two that are more facepalm worthy than anything else. Still, altogether the unfunny jokes would probably only be around half an episode long, which leaves you with eleven and a half episodes worth of material that ranges from decent to hilarious and that's pretty good. \\n\\n\r\nNow, I know I've made a lot of comparisons to A-Channel, so you might be glad to know that I'm going to refrain from doing that when talking about characters. Honestly, there isn't much to compare. The characters in Yuru Yuri aren't anything like the characters from A-Channel. If I were going to compare the characters to any other anime cast it would have to be Koihime Musou, another yuri comedy from Dogakobo. This isn't to say that they're exactly identical, but both anime have characters with very particular quirks who may not be the strongest on their own, but have really great interactions that make them shine and lead to some really funny moments. So, I do like the characters in this. They wouldn't be sufficient for a deep character driven piece like Monster, but for a semi-zany comedy they're pretty close to ideal. \\n\\n\r\nLet's talk about the art. I know, I've said this every time I've reviewed an anime with a similar art style, but I don't care for the art in this. It's not quite as basic as A-Channel's, there are some finer details that Yuru Yuri includes that it didn't, but the art is pretty close to the same. The characters still have plain features with different hairstyles, no noses or noses that are just dots, and I still don't know how they keep their glasses on, very basic backdrops and items. Now, let me stress that it never looks bad. It is bright and vibrant, which does arguably suit the series and, arguably, since it's set in middle school rather than high school, it might work a bit better in Yuru Yuri than it does in other school anime that use a similar style while being set in highschool. Still, I don't care for the art style as a matter of preference. I think it's too basic and kind of lazy. Not just in Yuru Yuri, but in every anime I watch with a similar style. If you're fond of the general style, fine you might like this anime, A-Channel, Manabi Straight and some others a little more than I do as a consequence, but I can't really help not liking the art. How much do you want to bet that a fanboy is going to send me a long, whiny message about how I shouldn't review anime with that art style if I don't care for it because they end up not liking the final score? Because, you know, I base my entire rating on the art. Wait... what? \\n\\n\r\nYuru Yuri has a really strong cast. Now, I can't speak for some of the cast in general since this is my first exposure to some of them, such as Ookubo Rumi and Ootsubo Yuka. In fact, most of the main cast doesn't have a lot of roles outside of this. It's kind of a pity since they do a really good job and I do hope they all get plenty more work in future. The music is... fun, I guess would be the best way to describe it. It's cheerful, upbeat and vibrant. The only real complaint I have about it is that the opening theme is audibly auto-tuned. It's still fun to listen to, in fact I'm listening to the full version while I write this (It's just so bloody catchy), but I do find that a little annoying. \\n\\n\r\nThe yuri factor is a whopping 9/10. There are girls with stated crushes on one another, girls kissing each other at several points and just a lot of general homoeroticism. Now, with that said the reason I didn't give it a full 10 is simply that there aren't any actual lesbian couples. There are girls who flirt back and forth and may very well end up as couples in the next season, but no actual couples in this, in spite of the occasional kiss scene. I understand why they did it that way, since these are middle school students and most middle school kids don't end up in serious relationships, but I still think that an anime needs a canonical lesbian couple to get a full yuri rating. Now, there might be that kind of relationship between the student council president and the science teacher... eww, but I really can't tell with this one. Nishigaki sensei says they have a forbidden relationship as \"explosion buddies\" but I can't tell if it's entirely literal or literal and metaphorical. I kind of hope they're just on friendly terms since it would be pretty messed up otherwise. \\n\\n\r\nSo, all I can really say in closing is that Yuru Yuri is energetic, funny, yuririffic and it has some great character interactions. On the downside, some of the les-yay is potentially squicky, thankfully there's not much of that though, and the humour does fall short on occasion. If you enjoy A-Channel you'll probably like this as well since they do operate under the same humour aesthetic. As for me, I liked this a little more. I thought the humour and characters were just a little stronger overall. My final rating is a 7.5/10. If you're a fan of school comedies like Azumanga Daioh, Manabi Straight, or especially A-Channel, give this a go. If you don't care for school comedies, this probably isn't going to change your mind, unless your only complaint about school comedies is that they need canonical lesbianism instead of the heavy subtext most of them have. If that is your sole reason for not liking school comedies this might be what you're looking for. Next week, yuri anime month will continue with a look at a pink-haired maid and the girl with glasses she loves.",
            "date": "2013-01-09T01:34:00+00:00",
            "helpful_count": 10,
            "mal_id": 83126,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=83126"
        },
        {
            "content": "\"Yuri yura ra ra ra ra yuru yuri, yuri yura ra ra ra ra yuru yuri daijiken!\"\r\nNice.\r\n\"Itsumo MIRAKURU shinjite MIRAKURU kokoro ha harebare mankai\"\r\nEven nicer.\r\nFrom the title itself, Yuru Yuri has the things you can, will and have expected in it. Lots of girls and absolutely no boys, either. You can expect a wholesome of yuri scenes which are.....truly....truly.....GREAT! From the first time I saw the title, I immediately watched the first season. As usual from my other reviews, the anime was a MASTERPIECE to me.\r\nThe story centers around four girls with the names Akari, Kyouko, Yui and Chinatsu. They seem to be in anall-girls school and seem to be a part of an Amusement Club that secretly holds their activities in the disbanded Tea Club's clubroom. From that point, lots of fun, relaxing and comedic routines are perpetuated by them, thoroughly making the show truly superb.\\n\\n\r\nAlthough Yuru Yuri doesn't have a central plot in its story as it is a slice-of-life, it focuses on the girls' daily lives at school, at home and in their social lives. The way the characters are portrayed are totally amusing to the point that I will keep wanting more and more at the end of each episode. Makes me think sometimes: Is it wrong to be a yuri fan? Is it? But it's so exciting. I don't know. Sakura Trick? Now, how is that related? Hehehe.\\n\\n\r\nAgain, even it has no central plot, the story, or flow, was fantastic. The various comedic routines were great. Lots of scenes to die for, lots of yuri scenes, and Chitose’s fantasies for Ayano and Kyouko were too awesome. It was so praiseworthy that I wish I can nosebleed like her. But I don't think so. That would remove me of my pride as a man, won’t it? I don’t know.\\n\\n\r\nFirst, I would like to apologize for I have ran out of positive synonymous words for great. The words are now repetitive. Shall I use litotes, then?\\n\\n\r\nThe arts and designs were also great. The arts utilized in the making of the development of the story was something truly satisfying that I kept screen shooting some of the scenes, converted it into a high quality and made it my desktop background. And I am not joking about that. I also commend the explosion scenes due to the failed experiments by their science teacher, Nishigaki. Is there any kissing scenes? You'll know.\\n\\n\r\nThe character designs for the characters (obviously) were also great. The four protagonists, the supporting characters, even the background characters were very satisfying. I can't say anymore. Need I say more?\\n\\n\r\nStop and read the first part of the review again. They were the lyrics of the opening and closing themes of the first season. That alone signifies my satisfaction in the sounds used in the anime, in the first season alone. The songs, OSTs and the sound effects were astounding that I got an earworm (that condition when you can't stop listening to a song. A cure? If you listen to it many times enough, you will gradually grow tired of it. Like a baby playing with its rattle). I will also stress about the music pertaining to a certain character, especially played when signaling a commercial. Those were truly great.\\n\\n\r\nThe characters were great. They each have their distinct personalities. Imagine being classmates with a tsundere student council vice president, a dependable upperclassman, a hyper and energetic blonde who's super attractive, a pair of bonafide fantasizers who either nosebleeds or drools as a result of their fantasies, a pink haired girl with fluffy, monstrous pigtails, a red haired girl with removable buns, a girl with larger breasts than what they should be at her age, a girl dependent beyond all doubt, and many more. Life would be truly fantastic to me. Especially if I get to be close with them. Trust me. They're too good to be true. They aren't. What a waste.\\n\\n\r\nExciting? What kind of question is that? Even if people have many preferences, I prefer anime like this: Slice of life, comedy, and somehow yuri.  I am thoroughly excited after each episode. I am happy to have been born on this era.\\n\\n\r\nOverall, the ANIME WAS GREAT TO THE POINT I CAN'T EVEN THINK any more synonymous words for great. Great (again) art, music, and scenes that truly make the anime outstanding in its entirety.  I would recommend this to people who like yuri. End of discussion.\\n",
            "date": "2017-07-31T02:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 254306,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6297554.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlexPaulLEWZ",
                "username": "AlexPaulLEWZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=254306"
        },
        {
            "content": "STORY - 8\r\nART - 8\r\nSOUND - 8\r\nCHARACTER - 9\r\nENJOYMENT - 9\r\nOkay. Let me first say that the gayness in Yuru Yuri is more of a thing to embellish the main comedic core than what I'd call real romance. But hey, it's still a fun CGDCT show! And the other dated definition of gay means cheerful anyways, which fits the show, so yeah...I guess it's actually quite gay!\r\nWhen there's a school club, and it's rightfully termed the Amusement Club, you know a whole lotta mischiefs are awaiting ahead of you. Mischiefs inside their club room. Mischiefs in the comfort of their homes. Mischiefs pretty much everywhere!For Kyouko, the founder of this amusing club, all she wants in life is to simply have fun and do whatever she wants. And you can bet that wild antic of hers ain't stopping anytime soon, as she drags Yui, Chinatsu, Ayano, Chitose, Sakurako, Himawari, and more girls down her fun-filled life. Little did they know they're about to undergo the wonderful process of yurification...\\n\\n\r\nAh right, there's Akarin too. Let's be sure not to forget about this poor girl~\\n\\n\r\nAnywho...where was I? The characters? Souka. Yuru Yuri is basically a hilarious mash-up of personalities given life in true moe fashion. Messing about and triggering all kinds of silly gags, those are really the only things they do each episode. It's just like what the name of their club implies: a show dedicated solely to amuse us and themselves, or well, Kyouko mostly. Because all these fun hilarities are emphasized against your typical slice-of-life setting, it's easy to indulge in their playful banters and get a giggle or two here and there...at worst! At best, you might wanna relax your lungs in case an uncontrollable laughter is about to ensue.\\n\\n\r\nAs if the comedy isn't enough already, the show thrives on its sweet girl-love moments, giving extra amusements, increased affections, and...uhh...some suggestively lewd stuff through Chitose's poor vision and nosebleeds. But I promise, it's nothing too extreme! About the only sexual thing outside the realm of imagination is with the whole oppai gag between the love-hate Sakurako and Himawari. Other than that, the yuri undertones here multiply the endearment to a whole another level. Packed full with flusters and blushes, the show is definitely not afraid to crumble me down with the power of kawaii.\\n\\n\r\nWhile all these dimwits are great comically, I'm also fond of those heartwarming bits where things tone down slightly. You know, unless you love to be on the verge of death laughing all day long. Yuru Yuri's more level-headed girls, such as Yui and Ayano, have their moments where they talk good things about their friends and it's wholesome to see these slices of warmth. Even Chinatsu, a cute girl who may or may not be harboring some crazy personality, has her own moments too. It's not much, but it's certainly enough to get me more attached to them.\\n\\n\r\nAnd life wouldn't be so much fun without its colorful shapes and sounds! Eyes so round they'll put a circle to shame. Voices so cute hearing one episode is enough to meet your daily sugar intake. Expressions so funny you'll...well, I'm sure you get what I mean already. All I'm saying is the chibi-looking art style, smooth animation, visual gags, emotive voice acting, and light background tunes work well together to create such a fun atmosphere. Even if they didn't put in any heart effects, it still feels like you can see hearts all over your screen. Truly the works of Moe Moe Kyun!\\n\\n\r\nBy the way, beware of the catchy opening and ending songs. The use of consonance with the show's name may give you earworms.\\n\\n\r\nSo yeah! What else are you waiting for? Go on and enter the Amusement Club and meet all the amusing girls of Yuru Yuri as they spend their days doing fun things together, with some enjoyable bits of homo-cuteness of course! It's about time Akarin greets you on the title scre—Oh...\\n\\n\r\nI forgot to talk about her, didn't I? Whoopsie~!",
            "date": "2019-01-23T06:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 299841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=299841"
        },
        {
            "content": "Best CGDCT (cute girls doing cute things). I will not speak in general terms why opinion is subjetive. In my opinion, Yuru Yuri has a perfect combination of all that I like (yuri, cute childish schoolgirls, comedy). There's no drama or other unnecesary things. It's perfect!\r\nmaybe if there more yuri, would have a 10   \r\n-Story? lol, there's no exist and is good\r\n-Art (8/10): Namori have a cute art, perfect for lesbian cute schoolgirls\r\n-Character (9/10): Very cute and funny characters. A irreverent otaku, a lovely (but creepy sometimes) pink-haired girl, a siscon/lolicon pervert onee-chan, a modest and mature tomboy, a  \"invisible\" girl, ayurijoshi whose nose is bleeding, etc\\n\r\n-Enjoyment (10/10): Is necessary say more? \\n",
            "date": "2018-07-23T09:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 284592,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467351.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MaryMcKaylaMcCan",
                "username": "MaryMcKaylaMcCan"
            },
            "url": "https://myanimelist.net/reviews.php?id=284592"
        },
        {
            "content": "AAAAAKARIIIIIIN!\r\nHAAAAAAAAAAAAAAI Jebus reviews Yuru Yuri, hajimatte yo!\r\nSo when I first started watching this show, I thought to myself \"oh no, here we go, middle school girls thinking they're lesbians so they go and do lesbian things with other lesbians that are friends of said lesbian\" and you know what? I was right. Now mind you, this was when I found the idea of lesbians being funny just ridiculous so I didn't really enjoy it like others did. I watched the first episode just out of curiosity and I was bored to tears and just found myself getting angry with every lesbian joke that came outof this show. I turned it off and never looked back. This was when it aired.\\n\\n\r\n...then I watched episode 2 three years later after lightening up a bit.\\n\\n\r\nMy god, how this show managed to slip through my radar is incredible. Every character has feeling and emotion and just fun qualities about them that it's impossible not to enjoy and love at least one of these characters. Whether you love the rowdy and carefree TOSHINO KYOUKO, the bratty and sometimes caring Chinatsu, the caring and bold Yui or the one-you-just-can't-help-but-feel-sorry-for Akarin, there is someone to love in this show.\\n\\n\r\nNow to be fair, this show isn't for everyone. If you are not a fan of the slice of life genre, or you just don't find the same running jokes funny after 5 times in a row, you will not enjoy YuruYuri. If you like girls who work off each other to pull off some of the greatest situations in SOL history, you will love the hell out of YuruYuri.\\n\\n\r\nAlso, this is the first show in many anime that I found the supporting cast to be just as fun and wonderful as the main cast and sometimes they get more screen time than the main four, but boy, does it pay off. Ayano is a girl who is totally tsundere for Kyouko and whether she wants to admit it or not, everyone else can tell. Another character (and when I talked about running jokes) Chitose is a running joke all by herself. Taking off her glasses will make her mind imagine two girls that she sees infront of her engage in a yuri-esque situation and thus, she gets a nosebleed. I do admit, sometimes the joke can be overused but sometimes it works wonderfully when used at the right moments.\\n\\n\r\nOVERALL: The show is a balance of fun and curiosity between the cast and even though the show gives off a vibe of \"lesbian only\" jokes, most of the jokes are anything but. Most of the time, the jokes are just simple SOL jokes you would find in classics like Azumanga Daioh and School Rumble. The setting is simple but it barely plays a part in the show's overall feel. However, like I said, this show is not meant for everyone so try to keep an open mind when going into it. Also, I really advise you to skip episode 1 and head straight into 2 as that is when the show kicks it up a notch.\\n\\n\r\nJebus gives Yuru Yuri 4 curiosities out of 5.",
            "date": "2014-03-08T14:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 135097,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/318254.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JebusMatoi",
                "username": "JebusMatoi"
            },
            "url": "https://myanimelist.net/reviews.php?id=135097"
        },
        {
            "content": "If you think your too good, or much of 'cool' guy to watch cute moe anime, your missing out!\r\nStory 9/10: It's slice of life, so not much of a plot. Each episode is pretty straight forward, with your usual school themed stories. However it's so funny and so well written it doesn't feel cliche at all. \r\nArt 9/10: Yeah it's cute moe art, I didn't think I'd like it but it grew on me and I thinks it's adorable! So the moral, don't judge a book or in this case anime by looks alone.\r\nSound 10/10: Oh that opening theme, it's so catchy! I find myselfhumming it all the time, it just a wonderful theme!\\n\\n\r\nCharacters 10/10: The characters are what really make this show. There all very original for the most part, like an MC who lacks presence so much she's not really the MC. One girl who is a slightly perverted doujin artist and has a huge crush on another girl who looks like her favorite anime character. Another girl who nose bleeds everytime she takes her glasses off because of her Yuri fantasies. We also have a Tsundere, well three in fact, and two of them like each other! A Tsundere crushing on another Tsundere... how does that not sound hilarious! The cast is just great and will always make you laugh.\\n\\n\r\nEnjoyment 10/10: I haven't laughed this much at an anime since I watched the early Fairy Tail episodes, this anime is comedy gold. It's also filled to the brim with girl x girl love and inuendo. It's just fun, it's just impossible to not have fun watching this anime!\\n\\n\r\nOverall 9/10: Yuru Yuri is a barrel of laughs with more then plenty Shujo Ai! If you like to laugh and love your Yuri/Shoujo Ai, you will love this anime!",
            "date": "2015-10-23T08:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 201802,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4945214.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DarkLordofYuri",
                "username": "DarkLordofYuri"
            },
            "url": "https://myanimelist.net/reviews.php?id=201802"
        },
        {
            "content": "Yuri Yura Rarara Yuru Yuri (x3)\r\nDI-IE CHI-CKE-N (actually dai jiken)\r\nI can never unhear that…\r\nYuru Yuri is a very fun anime. I really enjoyed it, and yes, I approve the amount of yuri present (no it is not a yuri anime, but still does not disappoint the title ;p)\r\nStory: The story of Yuru Yuri follows the four main characters; Kyouko, Yui, Chinatsu, and, uh… the other one, as they have fun middle school adventures. The overarching story of this season leaves something to be desired, as it does not have much to draw back onto, and instead relies on more of an, episode by episode formula,with strong characters and occasional callbacks. I’m gonna relate this to Nichijou somewhat through this review (yes I know I should be judging it on its own merits, and I am, it’s more for comparison’s sake), as they have similar segments throughout the episode, or series, that are made for specific gags and do not really contribute to any overarching plot points, so marking such shows on story is somewhat hard. That being said, I’ll give this a 6.5/10, and bloat it to a 7/10. It’s good, nothing special, nothing bad, just good.\\n\\n\r\nArt/Animation: This is not one o my strong suits (neither is sound) and other reviews will cover this better, but: The art and animation used are generally fluid and well animated. The art is at a consistent quality throughout the duration of the anime, and the style is not simplistic. They also, at times, employ other animation styles to add to the current scene which is always welcome if correctly employed. Overall, an 8.5/10 for animation, rounding it to a 9/10.\\n\\n\r\nSound: The sound is well employed in the OP/ED and the general background music used it phonetically pleasing and always used to accent a scene, never drawing away from it, or failing at its job. There were a couple of standout pieces and the OP/ED are always fun to listen to (and watch), and employs one of my favourite techniques, yet rarely used ones (at least in what I’ve seen), where the cast is used to sing the songs (typically in character). Overall an 8.5/10 for sound, rounding again to a 9/10. Side Note: That OP is a great tongue twister when you’re first learning it and want to pronounce it properly. (Side Side Note: It also has a 'light novel'-esque title. As in, crazy long, which I actually enjoy).\\n\\n\r\nCharacters: This category is tricky. Yuru Yuri does have solid characters that it builds up, but for the most part of this season, a couple of them (namely 3, but I won’t give names as some are joke centralised), are reduced at times to become their defining character trait that is subject to jokes. While this can work, it is (not always in this but in media) used for cheap and unearned laughs most of the time. That being said, a couple points would need to be subtracted to compensate, so Yuru Yuri is getting a 7.5/10 for character, rounding to an 8.\\n\\n\r\nEnjoyment: I REALLY enjoyed watching our three protagonists’ shenanigans throughout these episodes. Much of the comedic timing was spot on, and although some of the jokes can be seen off in the distance before they arrive, they are still amusing when they do so. All in all, I would give this season of Yuru Yuri a solid 9/10 for the enjoyment factor, as it really is quite good a lot of the time, and I was sad to see it end.\\n\\n\r\nOverall: Overall, Yuru Yuri is a good anime, it’s jokes rarely fall flat and occasionally even got me to actually laugh. The writing behind them is typically well done (something I am glad I finally get to talk about), and the character designs are on point. Coupling that with solid animation and great sound and you land a solid anime with an 8.4/10, rounding down to an 8/10 for its final overall score. I’d recommend this anime to anyone who enjoys comedy anime (and isn’t a comedy snob), or people who like the slice of life genre, as this also doubles down on that, with of course, a touch here and there of the more extreme.\\n\\n\r\nI feel like I forgot to properly mention someone important though…\\n",
            "date": "2018-04-07T19:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 277317,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6559723.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Springball64",
                "username": "Springball64"
            },
            "url": "https://myanimelist.net/reviews.php?id=277317"
        }
    ],
    [
        {
            "content": "\"Why are girls more susceptible to same sex or bi-sexual orientation? Who knows, but it sure does make a good source of comedy material in the anime world\"\r\nYuru Yuri (literal translation Easy-Going or Slow Yuri) is a Japanese manga series written and illustrated by Namori about three schoolgirls... wait am I missing someone? Guess not. They took over the former room of the tea ceremony club (may I add how manly tea is?) to form their own \"amusement club\" Yea because in Japanese highschools it isn't illegal to just take over another club room for your own amusement. I know I used to make theboy's toilet my secret base. (It's ok, guys doesn't even like to use our toilets) Cause seriously which guy hadn't secretly used the girls toilet because he can't stand the odor in the guy's toilet. That is until they see the huge pool of blood and get traumatize for life.\\n\\n\r\nYuru Yuri is a generic \"moe-slice-of-life\" anime with those moments of dialogue and acting that could be interpreted as overly homoerotic, but not as much if you know the real context. As funny as it is, the whole \"X girls just hanging out and having fun\" where X denotes the number of the main cast (which is normally the Four Girl Ensemble), is nothing new to the anime scene. But some people, even myself, enjoy this moment or repetitiveness. \\n\\n\r\nSo as the story progresses more girls join the main casts to form the ultimate Lesbian Full Cast in their hilarious mishaps. You can never have enough middle school girls in one story right? I hope I don't sound like a pedo here...\\n\r\nWorry not as eventhough with the introduction of new characters, the 3 main girls are still the stars of the plot. (Seriously, I feel like I'm forgetting someone)\\n\\n\r\nArt wise, on a scale of 1 to 10 on the moe-art-meter, this anime scored an 11. Seriously, if you do not even smile or give a faint grin on your face when you see their big beady, glowing eyes then you sir, HAVE NO SOUL! The character  were filled of emotions. Heck, I wish I could understand Japanese so I wouldn't have to read the subs and miss all those visual cues. Overall, the character designs makes you go Uguuuuuu~ even if you're not a pedophile.\\n\\n\r\nAs for sound, definitely hands down, my favorite opening and ending theme for this season. No. Possibly for this year so far. It's catchy, it's upbeat, and it never gets old for me for some reason. If you get on a public bus or you're taking the subway train and you see a guy with headphones on bobbing his head, that would probably be me listening to the opening and ending theme song. Eventhough most of the seiyuus are new or haven't been given sufficient roles, they were able to execute their characters personalities quite well.\\n\\n\r\nCharacters! Because the whole selling point of Yuru Yuri is their characters!\\n\\n\r\nTOSHINO KYOUKO! \\n\r\nIt's a universal rule that if you want to mention her name you must shout her name in a harsh tone. This lovable girl is the center of all the comedy that is happening in Yuru Yuri. Smart, talented, manipulative and downright annoying but in an amusing way. Her sexual orientation is still questionable though. She's supposedly the main character but I keep forgetting there was someone there in the spotlight before her.\\n\\n\r\nFunami Yui\\n\r\nShe plays the older sister role within the whole cast. Indepent, reliable, you know the type that end up being the \"Yuri Target\" by the female cast. She's very vulnerable to jokes involving word play. On a plus point she's a bit like a kuudere with her monotonous voice and attitude over her friends.\\n\\n\r\nYoshikawa, Chinatsu\\n\r\nCute at first sight but holds a deeper alter ego who is actually very intolerant. She's in the centre for the love triangle between Yui and TOSHINO KYOUKO!\\n\r\nWell I wouldn't put it as a triangle because it's more like a straight line. \\n\r\nTOSHINO KYOUKO! ---> Chinatsu --->Yui\\n\r\nHer sexual orientation, though, is confirmed to be lenient towards yuri.\\n\\n\r\nOther casts includes \\n\r\nSugiura Ayano who is the student council president and fierce rival of TOSHINO KYOUKO! eventhough the latter doesn't really acknowledge it.\\n\r\nThough, she herself might be falling in love with TOSHINO KYOUKO!\\n\\n\r\nIkeda Chitose\\n\r\nThis woman single handedly taught me the power that bestowed upon people with low vision. The ability to fantasize in real time using your other senses as your vision sense is low, your other senses such as hearing is magnified. Her fantasies and nose bleed had become a running gag in the series involving Ayano and TOSHINO KYOUKO!\\n\\n\r\nHimawari Furutani and Sakurako Ohmuro \\n\r\nGuess what's more annoying than a tsundere girl? Two tsundere girls! Seriously, this two childhood friends forms the tsundere couple which is funny but a sight for sore eyes as well. Oh and both of them revolves around the whole \"Boob Gag\" which is the whole Big breast vs Flat Chest.\\n\\n\r\nOverall, from what I first expected from the season preview, this anime beats beyond my expectation. I'm no fan of yuri, I've never even watched any yuri anime before this. So it' safe to say that even if you're  homophobic, you would still enjoy this anime to the fullest. The comedy aspect is great as it covers a huge range of variety from Comedic Sociopathy to breaking the fourth wall with the audience. Not to mention the entertaining 10 seconds running cycle between every intermission is somewhat entertaining. As the title suggest it, Slow Yuri because on a yuri scale of 1 to 10, this anime would probably score a 4 as the yuri theme is only as suggestive as the audience would imply it to be. \\n\\n\r\nHaremu Kingu,\\n\r\nSigning out...\\n\\n\r\nSeriously, I still have a feeling I left someone out. Can someone please tell me who it is?",
            "date": "2011-08-31T22:02:00+00:00",
            "helpful_count": 520,
            "mal_id": 42517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=42517"
        },
        {
            "content": "Azuriin~!\r\nHai! Yuru Yuri review, hajimaru yo~!\r\n“Meh, here’s another god damn moe blob slice-of-life. I don’t understand why people like shit like this…”\r\nIf this is your mindset, then even without saying it, you know you should pass up on the offer; however, if you have do have an interest in slice-of-life anime, comedies, or shoujo ai (You should note that shoujo ai is not a major genre. It doesn’t have as much yuri as you would expect from its title), then go for it. I started watching Yuru Yuri thinking it would be fantastic, and do you know how it turned out? Yuru Yuri absolutely amazedme by how it was more than fantastic, it was glorious! I do not even remember the last time I have laughed so much. I know that I laughed in every episode and I loved every minute of it. Do you know what else? I am actually quite sad that the show is over, but as they say, “all good things come to an end.”\\n\\n\r\nWhat is anime? Anime is a form of entertainment. If you find anime unentertaining, maybe you should pick up another hobby (I’m looking at you, Mister “I rate everything 5s and below”) and think about it. Next question: Does entertainment need things like “plot”, “development”, or “climax”? The answer is no. Entertainment is something that entertains you. It is most does not have to have any of those things. Recently, many anime watchers are too stuck up in their ideals that all slice-of-life shows are bad because they lack a plot. I can only reply by saying that slice-of-life entertains me to no end. Tying this all back to Yuru Yuri, I can clearly say that Yuru Yuri gave me such an abundance of enjoyment that I can only agree that Yuru Yuri is indeed a good anime.\\n\\n\r\nSo does Yuru Yuri have a story? Does Yuru Yuri have development? Does Yuru Yuri have a climax? It probably does not more than it does, but does that stop it from being entertaining? You can bet it does not. If you think you could enjoy Yuru Yuri, if you are not a slice-of-life hater, you will enjoy Yuru Yuri. If you watch the beginning of the first episode, you may think it looks exactly like a stereotypical slice-of-life, but don’t be fooled! That opinion will change very quickly! Every episode made me laugh. Some episodes made me surprised, some episodes left me shocked, and some even left me sad. Yuru Yuri can definitely bring out all of these emotions and more, but still have you smiling at the very end of each episode.\\n\\n\r\nOpinions are always hard to form on art style and quality. You can hate it, love it, or don’t mind it. If you’re like me, art doesn’t play that big of a role and you’re excepting of most art styles. So how is the art style for Yuru Yuri? It’s fantastic to me. The character designs are pretty darn cute and the animation flows nicely and sometimes reminds me of Gurren Lagann. Art actually takes a big role despite being your typical anime. The art switches to fit the mood, and in one episode in particular, the art is definitely interesting… I won’t explain though, as I don’t wish to spoil the fun, but it definitely left me laughing. Bottom line? The art style is cute and definitely fitting (The facial expressions always make me laugh), and the animation certainly flows smoothly.\\n\\n\r\nAnd what do we have for characters? Surprise, it’s your typical four cute girls doing cute things, right? Yes and no. If you continue to watch the show, there’s only three main characters… no wait… uh… In any case, there are more than just your four main characters. We also have the four members of the student council that frequently (almost every episode, so they might as well be main characters) appears and interacts with your four main girls who are members of the Amusement Club. Our lovely protagonist is Akari, who appears at the start of each episode, actually has the least amount of presence. You may think it’s a bad thing, but it’s not because that’s the joke. It’s referenced to in every episode and it’s a genius joke that never ceases to make me laugh. If we were to name the true main character, it would most likely be Kyouko, our hyperactive and fearless leader. She’s hilarious and makes everything enjoyable. Yui, her close friend, plays the straight man and gets embarrassed easily leading to very laughable situations. Chinatsu, our typical pink haired character, has a somewhat nasty personality, but her cosplay and hilarious art makes up for it. Finally, we have our student council members who are recurring characters for each episode. Ayano, the vice president, has a love interest, the most prominent source of Yuri in the show, with Kyouko. Ayano’s a bit of tsundere making her a likable character, but she also has a hilarious way of speaking where she will put the first syllable of the word at the end. Next, we have Chitose who has nosebleeds and is fond of KyoukoxAyano. Her twin sister, Chizuru has a drooling obsession for ChitosexAyano. Chitose has much more of cheerful personality in contrast to Chizuru who is cold. Chitose has much more aire time than her younger sister does, though. Finally, we have the two first year members of the student council, Sakuraku, who is a “baka” tsundere, and Himawari, who is the breast/ojou-sama factor. Hilariously, Sakuraku and Himawari are tsundere for each other leading to endless hilarity. Furthermore, the creator of the series went as far as submitting a marriage proposal under their names. Truly, that’s genius!\\n\\n\r\nYuriyurarararayuruyuri~ The OP and ED are hilarious and are more of an acquired taste. If you don’t like them, you’ll either end up finding them annoying or end up loving them. I personally find the use of the anime title in any OP genius. The soundtrack was fantastic, there wasn’t any piece of music that made me want to kill myself; furthermore, the music smoothly fits each scene to ensure the viewer receives the right emotions. And how about that voice acting cast? First, we have the pro, Toyosaki Aki (Chitose), returning for another voicing role as well as another well-known voice actress, Fujita Saki (Ayano), who is famous for Miku’s voice if you didn’t know; however, the four main characters are all voiced by fairly brand new voice actresses who are only taking on their first or second roles. And how did it turn out? These girls did a fantastic job. Their voices were brilliant. I can absolutely see them, Ootsubo Yuka (Kyouko) especially, rising to the top in the future because she did a marvelous job.\\n\\n\r\nSo did I enjoy this series? You can sure bet I did. And you know? If you have any interest at all, you’ll enjoy it too and end up laughing hysterically! I promise. To those of you who have actually stuck around to the end of this review, I thank you graciously for taking the time to read it. To those of you who are reading this after finishing Yuru Yuri and disagree with me, I only wish you tell me a few things:\\n\\n\r\nTell me you didn’t laugh when you saw what was in Akari’s sister’s room in episode one.\\n\\n\r\nTell me you didn’t laugh when Akari is totally blocked/loses her presence in the beginning of the episode three.\\n\\n\r\nTell me you didn’t smile at the Higurashi reference, or tell me you weren’t shocked at the sudden development in episode five.\\n\\n\r\nTell me you weren’t scared as hell in episode six.\\n\\n\r\nTell me the presence jokes don’t continue to make you laugh in episode ten.\\n\\n\r\nTell me you didn’t almost cry in episode eleven.\\n\\n\r\nTell me you didn’t enjoy Yuru Yuri.",
            "date": "2011-09-20T16:17:00+00:00",
            "helpful_count": 292,
            "mal_id": 43849,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/255317.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AzureHakua",
                "username": "AzureHakua"
            },
            "url": "https://myanimelist.net/reviews.php?id=43849"
        },
        {
            "content": "2018 EDIT: I wrote this review when I was about 15. So please excuse my bad writing and total misunderstanding of certain things. Also I’d like to especially apologise for the casually homophobic remarks. I mean, still find this show boring as hell, but for that I would totally deck 15 year old me in the face too.\r\n.\r\n.\r\n.\r\n.\r\nSince K-On! came by in 2009, every animation studio and their dog has tried to emulate their success. Some fail miserably and make downright awful shows that have no chance of being successful. Some make shows that are just as marketable as K-On!. But the one reason whyK-On! is still number one is because along with being a huge cash cow, it was a good show to boot. Animation studio  Dogakobo's attempt at jumping on the bandwagon is a comedy series that tries to mix things up by adding lesbianism into the mix. Yes, these types of shows have hints at relationships between the same sex but Yuru Yuri is the first of these kind of shows to come right out and say it. It's a bold move but does can the show stick out with boldness alone. No. No it can't.\\n\\n\r\nThe show's formula is somewhere between Lucky Star and K-On. The structure is mostly a bunch of loosely connected gags like Lucky Star but less random and more coherent like K-On. Unfortunately, its not nearly as good as either. It feels empty even compared to the boring parts in Lucky Star. Just like Lucky Star the story is non existent but it's not funny enough to excuse the lack of cohesiveness. The creators probably just thought, 'We'll add in a bunch of clichés, put in one tiny defining trait and call it a day'. It has the interesting (And a little creepy (I'm not homophobic by the way)[Yes you ARE 15 year old Seibaa - Sincerely, bi 21 year old Seibaa]) angle of the characters actually being lesbians but where do they go from there? nowhere. It's just the same sort of thing you see in every one of these shows. \\n\\n\r\nThe art is basic but serves its purpose of showing incredibly bland lesbians doing incredibly bland stuff. It's basically exactly what you expect from this type of show. Though I give the creators credit for not going for a Kyoani esque moe art style. The animation is just there to make the boring pictures come to life in a boring matter. Just like the rest of the show, it does what it needs to do and does nothing more. The character designs are actually not bad with each girl having a lot of distinctive features. The colours aren't vibrant but they are quite nice to look at. The show certainly has its own art style (Unlike most of these types of shows) but it isn't all that interesting. It just does what it needs to do and goes to the back room for a smoke.\\n\\n\r\nThe opening and closing are catchy but not in a good way. When I say catchy I mean that its so annoyingly bad that you can't get it out of your head. Apart from some odd lyrics (Seriously, look them up) It sounds exactly the same as the opener to Lucky Star, Kanamemo and a pretty much every show in the genre. Background music is incredibly forgettable. I can not remember a single song from this. You think with in a show with nothing going on you'd get more acquainted with the music. That's one of the reasons why these carbon copies almost always fail. In Lucky Star and K-On! they had great background music that you came to enjoy after watching the show for a while. Whereas all of these shows just throw together a bunch of forgettable crap and hope you remember at least one of them. \\n\\n\r\nAnyway back onto the subject, I did really like the music in the eye catchers. In fact I just really love them. It's up their with some of my favourite shows for eye catchers like Cowboy Bebop and Gurren Lagann. It's the best part about the show by far. If only the rest of it was that good. The voices, like a lot of things in the show, lack any defining traits. I swear to god that it was Ayana Taketatsu (The voice actor for Azusa from K-On!) voicing Chinatsu. The cast still has a few recognisable names such as Emiri Kato (Kagami from Lucky Star), Aki Toyosaki (Yui from K-On!) and Aoi Yuuki (Madoka Magica). Oh and Ayana Taketatsu still has a voice role in the show.\\n\\n\r\nUnless you haven't already put one and two together, you could probably guess how the characters are. Yep that's right. Bland and generic with no defining traits. It's all based on character types. There's Energetic Spice, Quiet Spice, Frequently Ignored Spice and Stalker Spice. God the Spice Girls are awful. Where was I going again? Oh yeah! The characters in this show suck. But if the main cast is bland, perhaps the background characters could be interesting. No dice. There's the pervert, the tsundere, Hell Girl, the tsundere, the tsundere and the tsundere. Oh yeah, and they're all lesbians\\n\\n\r\nOverall, this show is just another show. It has nothing to differentiate itself as its own show. Its style of comedy is 'borrowed' heavily from much better shows like Azumanga Daioh and K-On!. I've know I've been repeating myself for most of the review but my point still remains valid. This show is incredibly unoriginal. It has ideas on how to do it differently with a few alright running gags and an atmosphere that's ripe with opportunities for comedy but all that potential is just wasted. I did think that the second to last episode was pretty good but the rest of the show is incredibly forgettable. If you like these types of shows, than you'll probably like this show. If you aren't, ignore it and move along.",
            "date": "2012-07-09T09:02:00+00:00",
            "helpful_count": 64,
            "mal_id": 65819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1191091.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/SeibaaHomu",
                "username": "SeibaaHomu"
            },
            "url": "https://myanimelist.net/reviews.php?id=65819"
        },
        {
            "content": "I'll just add the obligatory disclaimer now. This is my first review so I hope I've done it right.\r\nIf you've seen anything like Lucky Star or perhaps K-On then you're no stranger to the \"Cute girls doing cute things\" genre that has been shorthand called Moeblob anime. Yuru Yuri is the same as those except there is one difference. Everyone in this anime is by some degree wanting to do various sexual things to the same sex.\r\nLets start with introducing the basic cast. From the left in the picture up top we have Funami Yui a sort of Tomboy and Responsible character. She's close friendswith Toshinou Kyouko and Akaza Akari. Next is the Blonde Toshinou Kyouko, she's a wild sort of character but ultimately Yui manages to keep her in check which kind of helps when she tries to molest Akari or Chinatsu. Akaza Akari is the anime's main character I guess however she suffers from not being able to stand out very much and ends up being ignored. She's a year younger than Kyouko or Yui but that hasn't stopped them being friends.  And lastly is Yoshikawa Chinatsu the newcomer to the group who admiration for Yui touches on romantic feelings while rejecting the many advances Kyouko tries to make towards her. Other characters include the student council which includes the vice president who has a deep rivalry with Kyouko but is in fact just wanting to be her friend(Can you say Tsundere), a girl who enjoys immersing herself in lesbian delusions of the vice president and Kyouko in various risque situations and two girls who fight between themselves for the position of Vice President however they really appreciate eachothers companionship(Once again Tsundere)\\n\\n\r\nThe art isn't bad but it's not good either. As common for moeblob characters they have large heads and absurdly big eyes.\\n\\n\r\nThe Music is pretty generic but for some reason the Opening theme is quite catchy. I found myself quickly humming along to it\\n\\n\r\nLets face it there's little to no plot in this show so if you're going to be watching it you'll be watching it because you either enjoy the genre or because you want something to just sit down and enjoy without thinking too hard. It's for this exact reason that I think I myself enjoy Yuru Yuri so much as I have enjoyed A-Channel in the previous season.\\n",
            "date": "2011-07-26T07:47:00+00:00",
            "helpful_count": 62,
            "mal_id": 40033,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/135360.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Xoraan14",
                "username": "Xoraan14"
            },
            "url": "https://myanimelist.net/reviews.php?id=40033"
        },
        {
            "content": "“Yuri your way to success! Vol. 1” -Now with footnotes! \r\nApproximately 12 years ago, we were introduced to a certain J.C.Staff series about a  girl from Osaka and her five friends. A couple of years latter, KyoAni presented to us a self-entitled otaku and her friends: the twin-sisters and the smart-but-clumsy bishoujo¹. Those stories would go around these girls and their (barely average) easygoing high-school paradise.\r\nInteresting? Entertaining? What is the point? It doesn't really matter, deshou? \r\nIt just happened that the community saw it was good, the industry saw it was profitable, and from that on, we started watching shows about cute girls doingcute stuff for no apparent reason (both us and the cute girls).\\n\\n\r\nThe story:\\n\r\nOh... the story! Yuru Yuri main plot is the daily events of Akari, Yui, Kyouko, Chinatsu (don't forget to add the -chan!). As middle-school students without a serious goal to achieve, YuruYuri focus on showing these girls having... fun! As the opening song itself explain \"My real job is to 'student'! What's with that?\" so all the key events of this series are pretty predicable and are related somehow to their school/hang out activities. The typical school slice-of-life.\\n\r\nBut this isn't the real reason why 90% of us watches it anyway.\\n\r\nI bet you interpreted “fun” on the previous paragraph in a malicious way, huh? \\n\r\nWhile those easygoing and relaxing events of their daily life would give a fair amount of entertainment, seeing cute girls expressing their affection to each other in a PG-13 way is also pretty entertaining! And perhaps the key part of it: delivering such a thing without the inclusion of a douche male protagonist neither having to label the series as he-he-hentai! is what draws the attention of crowds to it. That said, straight from the first episode, it becomes clear that \"Yuri\"² moments are one of the key components of Yuru...YURI storyline.\\n\r\nBesides from being astonishingly cute and having these girl-love moments, the series strongly bets on their visual gags, practical jokes and references as save-points, keeping the viewers from being bored during long scenes or dialogues. A proof that it works can be easily found online, it's the amount of internet “memes” that were created from scenes of YuruYuri.³\\n\r\nAnyway, I digress. \\n\r\nThere's no point into further developing this topic. Someone who is reading this didn't got here by accident and most likely have a backlog on series like this. If YOU happen to be one of these people and is now nodding in agreement, the reviewer thanks you for cooping with it. *brofist* \\n\\n\r\nFollowing the same idea of the story, characters of YuruYuri are what one would expect of a show about easygoing school-girls. In a nutshell: They're patterned. \\n\r\nWe have the clumsy, resident airhead MC; the admirable, dependable senpai; the polite, dependable \"notice me senpai!\" kouhai and finally the over-hyped, loose cannon senpai.\\n\r\nNot to mention they are all, obviously, CUTE.\\n\r\nWhy are they always four? ...who is producing this, anyway!?\\n\r\nOh, not to be forgotten, there are also the often forgotten supportive characters! They are there to add a bit of spice to the overall sweetness, some even have a separated story arc just for them which is great considering the flow of the story since it helps to keep the attention level. To be honest, these characters even get more screen-time than a certain MC ...you'd find out sooner or later.\\n\r\nAlong the story progression, some other characteristics of theses girls become easy to notice and the classical tsundere/yandere/dandere⁴  action finally shows up.\\n\r\nHahi, That was it!? Actually, there isn't much to digress about... giving a further explanation on these characters would spoil the first two episodes and completely ruin the mood. But still we want you to believe this is character driven so.... can we pretend we explained why, and you pretend you got it? *pshhh! No mod's gonna see this!*\\n\\n\r\nIn the era of moe, what isn't moe is a pagan non-believer!⁵ \\n\r\nThe artwork! Oh yes! *nosebleed* did I already mention it is... cute?\\n\r\nWhat kind of reviewer describes every aspect of the show with one single word?\\n\r\nWell, watch it and then we can discuss. \\n\r\nJust like its ancestors mentioned in the beginning of this review, YuruYuri's artwork is simple but well colored and surprisingly detailed at close ups. The “moe” factor is obviously part of it, which means, you won't find a character that is “ugly” at all.\\n\r\nWorth mention: animators did a very good job with characters' eye design. They doesn't have that artificial feeling to them neither artificial lightening, which makes it really fit the overall coloring.\\n\\n\r\nyuriyurararara yuruyuri yuriyurararara yuruyuri yuriyurararara da-i-ji-ke-n!\\n\r\nAin't I missing a “Kyarun!★~”!?\\n\r\nIt doesn't takes much to create a OST for a slow paced school slic- *stabbed*\\n\r\nStill, it wouldn't be a lie ...to some extend.\\n\r\nThe OST really matches the pace of the story, meaning, we get lot of relaxed synthetic instrumentals AND some funky remixed opening/ending. If you think you've heard these songs before, it's not a problem at all. Since this kind of series always use the same tempo and arrangement for their songs, sounding similar is just part of ride. Both the OP and ED are also performed by the main characters' seyuu-tachi. They're at the same time hilarious and addicting... during the first 5 episodes. Later on it gets really annoying and you'll just skip it all together.\\n\\n\r\nOverall, YuruYuri is way more enjoyable than it seems. Really.\\n\r\nNot because it later turns into a full ecchi yuri R+ hardcore anime (!?), but because it manages to -somehow- make you laugh for 288 minutes. Who would imagine a school slice-of-life about pure teenager girls could be this fun? I wouldn't.\\n\r\nSo, if you're wondering about watching or not, accept the challenge and get started on it already. The entertainment value may vary from person to person, however, it will absolutely manage to take a laugh from you, even if it's just with a short Higurashi⁶ reference (Heh, is that a glace of curiosity?) or a quick reference joke with the YuruYuri Akari x Aria Saga Akari and her signature expressions \"waaay!\" \"hahi!\".\\n\r\nSecure your loli and prepare for impact! A furious ride into the amusement world of these girls is about to begin!\\n\\n\r\nThe Footnotes:\\n\r\n¹ – extremely beautiful, cute, amusing, girl. Notorious examples: Anything Key/Visual Arts produces in collaboration with KyoAni.\\n\r\n² – Yuri is a modest synonym of Shoujo Ai, girls love, lesbianism, girl-on-girl action, etc.\\n\r\n³ – Seriously, YuruYuri related memes were all around /a/ by the time it aired. Ask Mr. Google.\\n\r\n⁴ – Japanese slang used to describe one's characteristics. (e.g: the tsundere is the girl who is violent (tsun) but loving (dere) towards the one she cares about.\\n\r\n⁵ – Yes!!! YuruYuri is 100% MOE, meaning, they can't possibly be less cute. UrbanDictionary gives a pretty neat explanation: “Moe is when your heart gets a boner.“.\\n\r\n⁶ – Higurashi no Naku Koro ni. Cute series.\\n\r\nobs: credits to @MAL Ikusagami for the insight of the review title.",
            "date": "2014-03-05T10:22:00+00:00",
            "helpful_count": 57,
            "mal_id": 134797,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/339221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xbobx",
                "username": "xbobx"
            },
            "url": "https://myanimelist.net/reviews.php?id=134797"
        },
        {
            "content": "Pros:\r\n—Fleeting moments of amusement and marginal hilarity\r\n—Very occasional heartwarming moments\r\nCons:\r\n—Characters comprise a bog-standard mix of moe show cliches\r\n—Running jokes that either aren't amusing to begin with, too quickly become tired, or both\r\n—A permeating sense of predictability\r\n—Mildly disturbing yuri theme. There's nothing wrong with that in and of itself. But how is it so universally widespread, and why do the recipients of one-way lust accept it without second thought? Is there no room for platonic friendship in this universe? You would be right in thinking this sort of thinking is too deep for a show like this. It just feels rather out of place in thissort of comedy anime, and it wore on me pretty fast. But maybe that's my personal taste. \\n\\n\\n\r\nI consider myself a fairly forgiving judge of anime. Though my volume of intake is pretty far below average (at least judging by MAL users), I generally know what type of shows I like and seek them out accordingly, so I'm rarely too disappointed.\\n\\n\r\nMoreover, I'm a fan of slice-of-life, slower, and what otherwise might be called—though without ill regard—“aimless” shows.\\n\\n\r\nHowever, Yuru Yuri inspired me to write my first review, in order to warn others of its overwhelming mediocrity.\\n\\n\r\nAt only 12 episodes, the more dedicated among you may want to give it a shot anyway, having already cleared the tens (hundreds?) of better shows of this nature.\\n\\n\r\nFor those of you more discerning with your time or taste, I'd skip it.",
            "date": "2013-04-05T06:45:00+00:00",
            "helpful_count": 37,
            "mal_id": 92487,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5384.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/GBKeroberos",
                "username": "GBKeroberos"
            },
            "url": "https://myanimelist.net/reviews.php?id=92487"
        },
        {
            "content": "Yuru Yuri is a shoujo ai anime that focuses on 4 school girls as they form an amusement club. The cast is stretched out shortly after to more characters, and with the exception of Ayano and Chitose, who become the most reacurring characters with the exception of the four mains ones; Kyouko, Yui, Chinatsu, and Akari.\r\nThe main joke of the story is Akari, and the fact that she is considered to be the main character of the show but never stands out. She is noticed for being unoticed, even making jokes about her having the power of invisibility.\r\nToshinou Kyouko is the main focus of theshow. She reminds me of myself, a crazy and relentlessly random girl who could shout out or come up with any weird or wacky idea on the spot. Toshinou is just plain loveable, the very basic term to describe her.\\n\\n\r\nYui, the tough one or guardian in the group. She is not necessarily a barbarian or roughian, nor could she be considered a tough-guy kinda girl, however she maintains a type of quiet atmosphere around here, and often acts as the voice of reason or the keeper of order of the group\\n\\n\r\nChinatsu is the mean and somewhat snobby one of the group. She makes no attempt to hide her feelings for Yui, and is often seen rejecting Kyouko. I didn't really like Chinatsu that much, and infact i would classify her as the least liked character in general, of the four, however yuru yuri wouldn't be the same without her.\\n\\n\r\nAs for the opening and ending songs, I have never, and I mean ever, seen a more enjoyable opening and ending for anything, let alone any anime. This is the only anime i would look up on youtube just to watch, and the ending is really catchy as well. Both are well suited for the spirit of the show.\\n\\n\r\nAnd that brings me to plot, there isn't much in the way of plot, the show revolves around the characters, what they do, how they react with eachother, and over all it works. The comedy in the show is great, I have laughed myself to tears on a number of occasions, and well besides the cuteness of the show, there isn't much else to say except job well done. For what would be considered another generic slice of life anime, i loved it from start to finish. 10/10 and it is at the top of my list of favourite animes.\\n\\n\r\nI would also class this as one of the best Shoujo Ai animes released in a long time. I think this was very well balanced, they kept the shoujo ai element but didn't make it the centerpiece, which most shoujo ai animes do.",
            "date": "2011-10-12T18:04:00+00:00",
            "helpful_count": 22,
            "mal_id": 45419,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/308481.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lunarchy",
                "username": "Lunarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=45419"
        },
        {
            "content": "Trashy Pandas\r\n“Hey, want to hear about the new anime I started?”-Me\r\n“Yeah sure. What's it about?”-Mitch\r\n“It's a show about a group of ravenous lesbian-”-Me\r\n“NOPE!”-Mitch\r\n\tSo goes a short conversation with my pal Mitchell. I started watching Yuru Yuri just a short while ago and I was able to come to the conclusion that “Yuru Yuri is a show about a group of ravenous lesbian middle-school girls who do zany things while staying semi-PG or mostly PG-13.” (Me) Yuru Yuri is a great anime when it comes to sound track, characters, and animation style because the characters are impossible to hate, the sound track fits perfectly with themood, and the animation style just works.\\n\r\n“Yuru Yuri.. Hajimaru yo!” — Akari Akaza \\n\\n\r\nI Characters\\n\r\n\tFirst of all, the characters are really enjoyable to watch and listen to. Each girl has her own kind of cuteness and adorable personality. Akari and her “lack of presence” in the anime is humorous and I personally think it's cute. Kyouko has her flamboyantly hyperactive personality which makes her stand out more than any other character. Chinatsu is just straight adorable. Yui on the other hand is much more tame than the rest of the Amusement Club and has a very level head. She is definitely my favorite of the group. As for the other characters, I can say that I love them just as much: Chitose with her extreme amount of fantasies, Ayano with her little tough facade that she always puts up, and Sakurako and Himawari (shipped so very hard by me) who I swear love each other but don't want the other to know. All in all, the characters are each unique and interesting to watch.\\n\\n\r\nII Soundtrack.\\n\r\n\t “Yuriyurararara Yuru Yuri!”(YY OP). The OP for Yuru Yuri was the strongest attention getter for the anime; I found myself downloading it within the first few episodes and not being able to wait to hear it again. The OP does a wonderful job of setting the mood for the anime: lively, friendly and  silly. The tempo is very upbeat and the song mostly uses high notes, which emphasize the characters of the anime. High pitched, upbeat OP for a show about cute middle-school girls. Works like a charm. As for the soundtrack during the anime, I can't say that it really stood out that much. I honestly don't even remember any musical moments. The ED was pretty good. I didn't pay much attention to it because I was busy sorting out pictures and screenshots that I took during the episode. In the end, the OP is what really makes the entire soundtrack for Yuru Yuri. \\n\\n\r\nIII Animation Style\\n\r\n\tThe animation style of Yuru Yuri fit wonderfully with everything and works to make the show stand out. As anyone would expect, a show about cute girls would have a cartoony, cute animation style. Effects were handled nicely whenever some silly scene would come up: exaggerated and over-the-top cartoony style made scenes really pop out.  However, I found the character designs to be rather lackluster. Each girl had the same exact school uniform on, which is not necessarily a bad thing, but it got a little boring after a while. The only thing that made the girls able to be physically differentiated was the hairstyle, color, and accessories. I did like the hairstyles, but I feel very meh about it. The art/animation style did great work at making the anime feel exactly how it was meant to be: silly and cute.\\n\\n\r\nIV Plot\\n\r\n\tThere is not a whole lot to say about the plot except that it has no real depth, but manages to work for the anime. For a show about lesbian middle-school girls that love each other, partake in silly adventures, and do crazy things with each other, the plot fits well despite having little depth. The plot is defined in the first episode and then takes a backseat while the Amusement Club has its fun. Yes, the plot is the formation of the Amusement Club and it could be argued that the plot is around the entire time. Beyond the forming of the Club in the first episode, the plot takes no real direction beside the “sub-plots” (adventures) for the girls and their cute romance-esque “stories”.  \\n\\n\r\nV Romance\\n\r\n\tThe romances for Yuru Yuri were pulled off extremely well by showing that cute girls could love each other without being explicitly sexual. While some sexual situations are hinted at through Chitose's fantasies and through most of the episodes, there is nothing explicitly sexual about the girls. While there is a lot of emphasis on Himawari's large breasts, there is no explicit images of her or any other girl. I really love the lack of sexually explicit material because the show would have had an entirely different feel if the material was in the show. Please do note that I am referring to sexually explicit as in graphic nudity like in Sekirei or High School DxD or ect. As for the romances themselves, they are very adorable and will make anyone smile.\\n\\n\r\nVI Theme\\n\r\n\tThe only real theme that I could pick out is loving your friends and cherishing the time you get to spend with them. Clearly displayed in each episode, the girls love each other and enjoy the time they spend together. There isn't much more to say about this. Love you friends and love the time you get to spend with them.\\n\\n\r\nIn conclusion, Yuru Yuri gets a 9/10 and the Pandas Seal of Approval for its excellent characters, art/animation style, soundtrack, romance and superb kawaiiness.",
            "date": "2014-05-20T16:09:00+00:00",
            "helpful_count": 18,
            "mal_id": 143953,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3781599.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TrashyPandas",
                "username": "TrashyPandas"
            },
            "url": "https://myanimelist.net/reviews.php?id=143953"
        },
        {
            "content": "So this anime is basicly Japanese lesbian middle-schoolers doing cute and entertaining stuff (the yuri stuff never gets past sort-of unintentional kiss). If this sounds entertaining or fun to you, then congratulations. You will probably find this anime very enjoyable.\r\nThere is honestly not too much else to say about this anime. The characters are charismatic and likable. The interactions between them are well written and feel very natural. The overall art and animation are nice, good on the eye and quite a joy to watch. The opening and ending is good. \r\nHonestly there is not much to say about this show, which of course doesnot make it bad. At it's core it is a very well written, well executed, funny and relaxing slice of life anime. As I said if you found the first sentince to be to your taste, than you will love it. If you are not into these kind of things well....there is nothing to see here for you. \\n\\n\r\nThis anime is a difinition of a relaxing and joyful slice of life anime done right...with a bit of soft yuri.",
            "date": "2015-06-12T04:37:00+00:00",
            "helpful_count": 14,
            "mal_id": 190145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4468529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zelos7",
                "username": "zelos7"
            },
            "url": "https://myanimelist.net/reviews.php?id=190145"
        },
        {
            "content": "After watching this anime I had to do a review on it. This anime gave me a good laugh over all. All the main  and side characters are funny in there own way. This anime reminds of the anime Strawberry Marshallows more than any other anime, if you havent watch it or read it, do so and you see what I mean. I personally enjoy shoujo ai/ school life/ Moe anime so i automatically fell in love with this anime, Plus the comedy, wrap it all up in one. The first two episodes may start off slow but i guarantee you gonna enjoy italot after the first three episodes passes. Definitely a must watch anime, that if you like comedy, school life or shoujo anime or all three.",
            "date": "2012-01-06T18:30:00+00:00",
            "helpful_count": 14,
            "mal_id": 51117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/367183.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/piplub",
                "username": "piplub"
            },
            "url": "https://myanimelist.net/reviews.php?id=51117"
        },
        {
            "content": "1) This show has \"Yuri\" in its title, it's comedy, and it's slice of life\r\n2) I like yuri, I like comedy and I like slice of life\r\n3) Well, the third step is obvious, isn't it? I just had to give this a shot.\r\n4) .......\r\nOkay, maybe some things don't mix after all. Yuri and slice of life don't make a fusion as good as I hoped it would.\r\nFirst of all, I found this show boring. Nothing really happens in it. Okay, some of my favorite anime don't have much going on (it is slice of life after all), but when an anime doesn't have much goingon, it doesn't automatically mean it'll be boring. Sadly, that is the case with Yuru Yuri.\\n\\n\r\nThen it's the characters. They're all just bland and uninteresting. Sure, they look pretty, but their personalities didn't appeal to me. Except Kyouko, who is a bit interesting as a character (a bit), the others were boring, or just plain annoying.\\n\\n\r\nYes, I like yuri and that haven't changed after watching this. But this show taught me that there is a time and a place for yuri, and that it doesn't fit just everywhere. Yes, while watching Yuru Yuri, I was actually bothered by the yuri element.\\n\\n\r\nWhy, you ask? Well, I was annoyed by the fact that all girls here were lesbians, bisexual, or at least curious. Not only it doesn't work that way in real life (yes, I'm a realist when it comes to this type of stuff; I may be wrong but that how I work), it's just unnecessary. I really don't mind lesbian characters, on the contrary, but not when everyone is hinted to be a lesbian, and nothing is actually revealed (their sexualities or... some actual \"action\" except harmless kissing). Oh, and I also felt uncomfortable at some forced kissing scenes, especially since the girls are underage.\\n\\n\r\nAlso, there was this running gag with the chick who takes off her glasses and fantasizes about yuri moments while watching her friends, then gets nosebleeds. And everyone else seems to be cool with it. Okay, it was funny the first time, the second, the third... but after the tenth time, it became annoying. Not only that, but she also has a twin, and we even had some slight incest hints. Some fat perverted otaku will probably find it cool and hot, but I just found it repulsive. I don't mind that stuff either when I'm watching hentai, but here, it just seemed wrong.\\n\\n\r\nTo be honest, I didn't really hate this show; if I did, I would've rated it lower. It has some funny moments and situations, some episodes were slightly better than the others, and I just can't hate the yuri element, even if I'm annoyed with it, which was the case here.\\n\\n\r\nAt the end, I must say this: just because I wasn't thrilled with it doesn't mean it's bad, or that it isn't for you. I'm very well aware that Yuru Yuri is fairly popular, and that many people like it, and I respect that. This was just my personal opinion of it (and I have a very, very specific taste), so I can't say I wouldn't recommend it to you. If you like yuri, comedy and slice of life and if you think that they can mix (unlike me), try watching it. Chances are, you'll like it more than I did.",
            "date": "2015-10-21T14:26:00+00:00",
            "helpful_count": 11,
            "mal_id": 201702,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4704003.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/daky-kun",
                "username": "daky-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=201702"
        },
        {
            "content": "From an aspect of ゆり, expect lots and lots of make out scenes with cute little girls. If you are into that stuff, this is the kind of hentai for you. We are talking softcore action going on here.\r\nHa, pervert. Bet you just went to go look up some scenes and you were about to call my review misleading, huh? That is, if you kept reading anyway, you are also probably curious as to what the rest of my review is about after that line I delivered.\r\nAlright, so actually, this anime has a very misleading name. If you reread it, it is not called \"ゆりゆり\"it is called \"ゆるゆり\" and the \"ゆる\" part actually means calm, loose, leisurely; that kind of stuff. It is basically implying that they are going to show you lots of close scenes to girls kissing, but for the most part will just tease the more perverted viewer. And it also means that their friendships are close enough to be considered ゆり nature, but still a lot more ゆる in them.\\n\\n\r\nMy review will be one of those ones that actually avoids spoiling things, but still gives off some information that will convince you to watch at least one episode. That way, some other reviewer does not ruin the experience for you. But, when you do watch this one, what you will truly get out of this anime is a surprisingly good comedy, characters and setting.\\n\\n\r\nIt is definitely similar to Lucky Star in terms of calmness and its humor feeling so natural that you would very well believe that the voice actors themselves are fighting when their characters do. It even has a few points from ぱにぽにだっしゅ with some rapid-fire comedy; something I never thought I would see outside that particular anime.\\n\\n\r\nIt delivers a sense of natural jokes that do not feel forced like most anime do and it even has a tone of randomness that does not come off as annoying; another rare trait to see in an anime. Its twists will also give you at least one laugh if you are not a very happy person. This is one of the few that says it delivers what it does and successfully does so, but even more. Do not scoff this one off if you are looking for a natural, random comedy. Especially if you have seen Lucky Star, I recommend this one right away.\\n\\n\r\nYou would be lucky to find an anime similar to its style. At least, in terms of its natural humor to be specific. This one also continues beyond its original seasons as of recently, so you are in for the long run if you begin watching this. I believe it is even close to entering mainstream status due to its very positive reception which means it could go on for a while. But, it is one of those rare mainstream anime that is not just popular because it is popular, but because it is actually funny. It even has a spin-off as well.\\n\\n\r\nIf you are expecting some light hentai action here, then you are for sure out of luck. It only has close moments and maybe (...) but you just have to watch it to see. If you are expecting the same as your private time videos, then I would just go ahead and pass this anime by.\\n\\n\r\nBut, If you are looking for a nice, calm comedy that can deliver just as much randomness as it can natural humor, you better start watching ゆるゆり right away as it delivers plenty of what you seek in this genre.",
            "date": "2015-08-09T01:07:00+00:00",
            "helpful_count": 11,
            "mal_id": 195597,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=195597"
        },
        {
            "content": "When you put a bunch of girls, many of whom have questionable sexual orientations, in a club aimed solely at the entertainment of themselves, what do you get? Yuru Yuri! \r\nQuite honestly I was questioning myself for a while whether I should watch this series or not. After reading the title and understanding the literal translation of the title, \"Slow Yuri\", my first impression was less than favorable. I'm not a huge fan or ecchi or yuri, in fact I tend to shy away from these anime genres that I usually perceive as taboo. I decided to give this series a go and watch itparallel with A-Channel (which is also a very good series in my opinion). What does this have to do with anything? I was actually able to appreciate this anime a lot more while watching this anime with A-Channel. \\n\\n\r\nIt seems like the mold for Slice-of-Life lately is four girls hanging out together doing random things while hilarity ensues. Actually this isn't always the case. While watching Yuru Yuri, I was laughing hysterically from the beginning to the end of every episode in contrast to my feeling of warmth and content after watching a channel of A-Channel. What I'm trying to get across here is that each slice of life anime has a different style and evokes a different type of emotion that makes you feel good in the end. This is important because I see many reviews and critics giving critical comments against a certain series because it \"doesn't compare to anime giants like K-On!\" I dislike this immensely because they don't appreciate the series for what it's worth. For Yuru Yuri, the series is supposed to make you laugh until your stomach hurts. I mean, a bunch of moe girls with questionable sexual orientations attempting normal tasks in the most ludicrous ways is absolutely hilarious. Of course you begin to question your status of pedophilia after realizing you're watching a bunch of moe middle schoolers, but hey! They can make you smile on the worst of days. In the beginning I thought I would be disgusted, but in the end I absolutely loved the series and have no regrets watching this series.\\n\\n\r\nBefore I go into the review, I want to point out that this is a Slice-of-Life anime. If you're not entertained by characters doing everyday things or cute character designs then avoid this. You should also avoid this if you are revolted by even the slightest bit of yuri or ecchi content, because about 70% of the series is driven by yuri or ecchi comedy.\\n\\n\r\nOnward with the review:\\n\\n\r\nStory (6): Let me clarify this. This is not a gauge of how much I enjoyed this series. It's the actual story itself. Slice-of-Life anime are notorious for having little or no plot that drives the series, just comedy or that warm fuzzy feeling inside after watching to friends make up after a fight. Slice-of-Life comedies always focus on multiple subplots that only serve as a means to bring about laughter from its viewers. At times there might be a sense of reflection, even deep reflection from one or two of the characters, but these are not necessarily the plot drivers you see in series like Madoka Magica. In Yuru Yuri, the story focuses on fours girls who are part of the \"amusement club\" that seeks to entertain its members by doing fun things. This isn't really a plot, but more a setting of both what the characters are like and what they will do in terms of their actions. Of course, this is not story, just setting. So I gave the series the fair rating like I do with all the other Slice-of-Life anime I've seen come up lately, because it's all the same setup.\\n\\n\r\nArt (7): This and character can really affect the actual popularity of Slice-of-Life series. Okay, so the artist can put together a bunch of girls in the usual after school club doing hilarious things. However, the questions about defining the series begin to appear: Can the artist make the characters and art stand out? Can the artist compliment the characters with appropriate settings and background that can help bring out the character's colors and design? There is no doubt about those facts here. Pony Canyon did an excellent job here animating these adorably kawaii girls together. The backdrop and general setting of when and where this series takes place is simple. This keeps the lighthearted and comedic mood of the series. It never hurt my eyes, and I was always smiling with the cute designs of the moe characters in Yuru Yuri.\\n\\n\r\nSound (7): I must say I really enjoyed the music of the series, especially the Character Songs, the OP song. and the ED song. All of the songs were upbeat and happy. It was like reliving the Caramell Dansen period of my life. I really enjoyed the songs here a lot. The sound effects and background music during the actually show were the same to me as any other Slice-of-Life anime. It's not bad at all, in fact it compliments the scene and action that the characters are in. However, that same statement can be applied to a lot of other anime so again I'm going to say sound effects and background music are good, but don't amazingly stand out.\\n\\n\r\nCharacter (10): I really liked the characters here. I find it similar to the characters in Lucky Star where characters fill in some sort of niche role in order to satirize the otaku community. We all know Yuru Yuri isn't a satire, but the writer of the series made a colorful cast of characters and uses them in amazingly hilarious ways. \\n\r\nWe have Toshinou Kyouko, the Genki Girl, who likes to go about doing her own things selfishly and blantantly who of course is stopped by the Bokukko, Funami Yui who serves as the voice of reason. \\n\r\nWe have the Yandere, Yoshikawa Chinatsu who is completely obsessed with Yui-senpai and despises everyone else. \\n\r\nThe Ikeda twins, the Meganekkos who are also perverts as well, revealing their fantasies at critical moments creating anti-climax or creating a lot of chaos in their wake.\\n\r\n Sugiura Ayano, the glorious student council VP and tsundere about Kyouko (both whom Chitose always yuri fantasizes about). \\n\r\nThe tsundere pair of Furutani Himawari and Ohmuro Sakurako who fill the roles of dekapai and pettanko respectively and play the role of the humorous takahashi couple.\\n\r\nThere's more to the characters here than what I've described, but with these details and more character depth, this motley crew of characters will have hilarity following after them like a dog chasing after a squirrel.\\n\r\nI feel like I'm forgetting something. Oh well time to move on with the rest of the review! xD\\n\\n\r\nEnjoyment (9): Again the sense of comedy is just awesome. Putting the most generic characters of anime together as moe middle school girls in an ecchi and yuri comedy is simply genius. I frowned at it before, but now I find myself entertained and generally lighthearted after watching the series.\\n\\n\r\nOverall (8): Pretty much everything I said above in a nutshell. I liked this series a lot because of the comedy and laughter brought about by the cute, yet refreshing cast of characters in the series. The jokes and gags are satisfyingly devious and can make you smile any day. If you're looking for some quick, cute, and devious comedy, Yuru Yuri is definitely your best bet.\\n",
            "date": "2011-12-12T21:46:00+00:00",
            "helpful_count": 10,
            "mal_id": 49075,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/454420.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LightningHound",
                "username": "LightningHound"
            },
            "url": "https://myanimelist.net/reviews.php?id=49075"
        },
        {
            "content": "Welcome, lovely fans. It's a new year and you know what that means. Yes, it's time to start the year out right with yuri anime month. Okay, so some of you may remember that last year I dedicated January to reviews of anime involving the peerless, titanic-ally talented Hayashibara Megumi. Yes, I could do that again, but this year I'm going to watch yuri instead. Let's start the month with something I actually haven't seen. Written by Namori and brought to the screen by Dogakobo Studio, this is Yuru Yuri. \r\nThe anime opens with three girls starting middle school. After classes they get together inthe tea club room because the tea club got disbanded and they decided to use the room for their amusement club. So you have a small group of girls going through school and humour based on their everyday lives. It's sort of like A-Channel if all of the characters were lesbians. Wait... something's not right about that sentence. After staring at it for twenty four seconds, I've figured it out. Let me rephrase that. It's sort of like A-Channel if the characters were more obvious lesbians who got to snog a bit. Now, the reason I'm not comparing it to K-on, Azumanga Daioh or Manabi Straight is that Yuru Yuri has the same sense of humour as A-channel. No, that doesn't mean that the jokes are the same, they're actually both pretty unique in that regard, but the aesthetic that makes up the humour is the same. The jokes may be different but the sense of comedic timing and the definitions of what qualifies as funny seem pretty identical. And no,I will not explain what an aesthetic is, you should already know it. Seriously, it's one of the basic principles they teach you in your first year of highschool literature. Now, if you really don't know it, Google is your friend. Sorry, but it would take longer to explain in detail than the review is probably going to be. Okay, so the story is the same one you get in virtually every comedic slice of life school story. But, it's a comedy so what I'm really going to look at is whether or not it's funny. Well, most of the time it is. I compared its sense of humour to A-Channel, and there's a reason for that. There are some repeated setups that are funny most of the time due to varying punch lines. For instance, there's a repeated gag where a member of the student council, Chitose, gets a bloody nose because she's fantasizing as a result of two girls being homoerotic. What generally makes it funny are either her fantasies, which are always based on what the girls happen to be doing at the moment and never get overly fan-servicey or explicit, (yes this anime has a sense of class) or the humour comes from the reaction that the other girls have to her. That isn't to say that the jokes always work. There are a few that fall short and two that are more facepalm worthy than anything else. Still, altogether the unfunny jokes would probably only be around half an episode long, which leaves you with eleven and a half episodes worth of material that ranges from decent to hilarious and that's pretty good. \\n\\n\r\nNow, I know I've made a lot of comparisons to A-Channel, so you might be glad to know that I'm going to refrain from doing that when talking about characters. Honestly, there isn't much to compare. The characters in Yuru Yuri aren't anything like the characters from A-Channel. If I were going to compare the characters to any other anime cast it would have to be Koihime Musou, another yuri comedy from Dogakobo. This isn't to say that they're exactly identical, but both anime have characters with very particular quirks who may not be the strongest on their own, but have really great interactions that make them shine and lead to some really funny moments. So, I do like the characters in this. They wouldn't be sufficient for a deep character driven piece like Monster, but for a semi-zany comedy they're pretty close to ideal. \\n\\n\r\nLet's talk about the art. I know, I've said this every time I've reviewed an anime with a similar art style, but I don't care for the art in this. It's not quite as basic as A-Channel's, there are some finer details that Yuru Yuri includes that it didn't, but the art is pretty close to the same. The characters still have plain features with different hairstyles, no noses or noses that are just dots, and I still don't know how they keep their glasses on, very basic backdrops and items. Now, let me stress that it never looks bad. It is bright and vibrant, which does arguably suit the series and, arguably, since it's set in middle school rather than high school, it might work a bit better in Yuru Yuri than it does in other school anime that use a similar style while being set in highschool. Still, I don't care for the art style as a matter of preference. I think it's too basic and kind of lazy. Not just in Yuru Yuri, but in every anime I watch with a similar style. If you're fond of the general style, fine you might like this anime, A-Channel, Manabi Straight and some others a little more than I do as a consequence, but I can't really help not liking the art. How much do you want to bet that a fanboy is going to send me a long, whiny message about how I shouldn't review anime with that art style if I don't care for it because they end up not liking the final score? Because, you know, I base my entire rating on the art. Wait... what? \\n\\n\r\nYuru Yuri has a really strong cast. Now, I can't speak for some of the cast in general since this is my first exposure to some of them, such as Ookubo Rumi and Ootsubo Yuka. In fact, most of the main cast doesn't have a lot of roles outside of this. It's kind of a pity since they do a really good job and I do hope they all get plenty more work in future. The music is... fun, I guess would be the best way to describe it. It's cheerful, upbeat and vibrant. The only real complaint I have about it is that the opening theme is audibly auto-tuned. It's still fun to listen to, in fact I'm listening to the full version while I write this (It's just so bloody catchy), but I do find that a little annoying. \\n\\n\r\nThe yuri factor is a whopping 9/10. There are girls with stated crushes on one another, girls kissing each other at several points and just a lot of general homoeroticism. Now, with that said the reason I didn't give it a full 10 is simply that there aren't any actual lesbian couples. There are girls who flirt back and forth and may very well end up as couples in the next season, but no actual couples in this, in spite of the occasional kiss scene. I understand why they did it that way, since these are middle school students and most middle school kids don't end up in serious relationships, but I still think that an anime needs a canonical lesbian couple to get a full yuri rating. Now, there might be that kind of relationship between the student council president and the science teacher... eww, but I really can't tell with this one. Nishigaki sensei says they have a forbidden relationship as \"explosion buddies\" but I can't tell if it's entirely literal or literal and metaphorical. I kind of hope they're just on friendly terms since it would be pretty messed up otherwise. \\n\\n\r\nSo, all I can really say in closing is that Yuru Yuri is energetic, funny, yuririffic and it has some great character interactions. On the downside, some of the les-yay is potentially squicky, thankfully there's not much of that though, and the humour does fall short on occasion. If you enjoy A-Channel you'll probably like this as well since they do operate under the same humour aesthetic. As for me, I liked this a little more. I thought the humour and characters were just a little stronger overall. My final rating is a 7.5/10. If you're a fan of school comedies like Azumanga Daioh, Manabi Straight, or especially A-Channel, give this a go. If you don't care for school comedies, this probably isn't going to change your mind, unless your only complaint about school comedies is that they need canonical lesbianism instead of the heavy subtext most of them have. If that is your sole reason for not liking school comedies this might be what you're looking for. Next week, yuri anime month will continue with a look at a pink-haired maid and the girl with glasses she loves.",
            "date": "2013-01-09T01:34:00+00:00",
            "helpful_count": 10,
            "mal_id": 83126,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=83126"
        },
        {
            "content": "\"Yuri yura ra ra ra ra yuru yuri, yuri yura ra ra ra ra yuru yuri daijiken!\"\r\nNice.\r\n\"Itsumo MIRAKURU shinjite MIRAKURU kokoro ha harebare mankai\"\r\nEven nicer.\r\nFrom the title itself, Yuru Yuri has the things you can, will and have expected in it. Lots of girls and absolutely no boys, either. You can expect a wholesome of yuri scenes which are.....truly....truly.....GREAT! From the first time I saw the title, I immediately watched the first season. As usual from my other reviews, the anime was a MASTERPIECE to me.\r\nThe story centers around four girls with the names Akari, Kyouko, Yui and Chinatsu. They seem to be in anall-girls school and seem to be a part of an Amusement Club that secretly holds their activities in the disbanded Tea Club's clubroom. From that point, lots of fun, relaxing and comedic routines are perpetuated by them, thoroughly making the show truly superb.\\n\\n\r\nAlthough Yuru Yuri doesn't have a central plot in its story as it is a slice-of-life, it focuses on the girls' daily lives at school, at home and in their social lives. The way the characters are portrayed are totally amusing to the point that I will keep wanting more and more at the end of each episode. Makes me think sometimes: Is it wrong to be a yuri fan? Is it? But it's so exciting. I don't know. Sakura Trick? Now, how is that related? Hehehe.\\n\\n\r\nAgain, even it has no central plot, the story, or flow, was fantastic. The various comedic routines were great. Lots of scenes to die for, lots of yuri scenes, and Chitose’s fantasies for Ayano and Kyouko were too awesome. It was so praiseworthy that I wish I can nosebleed like her. But I don't think so. That would remove me of my pride as a man, won’t it? I don’t know.\\n\\n\r\nFirst, I would like to apologize for I have ran out of positive synonymous words for great. The words are now repetitive. Shall I use litotes, then?\\n\\n\r\nThe arts and designs were also great. The arts utilized in the making of the development of the story was something truly satisfying that I kept screen shooting some of the scenes, converted it into a high quality and made it my desktop background. And I am not joking about that. I also commend the explosion scenes due to the failed experiments by their science teacher, Nishigaki. Is there any kissing scenes? You'll know.\\n\\n\r\nThe character designs for the characters (obviously) were also great. The four protagonists, the supporting characters, even the background characters were very satisfying. I can't say anymore. Need I say more?\\n\\n\r\nStop and read the first part of the review again. They were the lyrics of the opening and closing themes of the first season. That alone signifies my satisfaction in the sounds used in the anime, in the first season alone. The songs, OSTs and the sound effects were astounding that I got an earworm (that condition when you can't stop listening to a song. A cure? If you listen to it many times enough, you will gradually grow tired of it. Like a baby playing with its rattle). I will also stress about the music pertaining to a certain character, especially played when signaling a commercial. Those were truly great.\\n\\n\r\nThe characters were great. They each have their distinct personalities. Imagine being classmates with a tsundere student council vice president, a dependable upperclassman, a hyper and energetic blonde who's super attractive, a pair of bonafide fantasizers who either nosebleeds or drools as a result of their fantasies, a pink haired girl with fluffy, monstrous pigtails, a red haired girl with removable buns, a girl with larger breasts than what they should be at her age, a girl dependent beyond all doubt, and many more. Life would be truly fantastic to me. Especially if I get to be close with them. Trust me. They're too good to be true. They aren't. What a waste.\\n\\n\r\nExciting? What kind of question is that? Even if people have many preferences, I prefer anime like this: Slice of life, comedy, and somehow yuri.  I am thoroughly excited after each episode. I am happy to have been born on this era.\\n\\n\r\nOverall, the ANIME WAS GREAT TO THE POINT I CAN'T EVEN THINK any more synonymous words for great. Great (again) art, music, and scenes that truly make the anime outstanding in its entirety.  I would recommend this to people who like yuri. End of discussion.\\n",
            "date": "2017-07-31T02:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 254306,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6297554.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlexPaulLEWZ",
                "username": "AlexPaulLEWZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=254306"
        },
        {
            "content": "STORY - 8\r\nART - 8\r\nSOUND - 8\r\nCHARACTER - 9\r\nENJOYMENT - 9\r\nOkay. Let me first say that the gayness in Yuru Yuri is more of a thing to embellish the main comedic core than what I'd call real romance. But hey, it's still a fun CGDCT show! And the other dated definition of gay means cheerful anyways, which fits the show, so yeah...I guess it's actually quite gay!\r\nWhen there's a school club, and it's rightfully termed the Amusement Club, you know a whole lotta mischiefs are awaiting ahead of you. Mischiefs inside their club room. Mischiefs in the comfort of their homes. Mischiefs pretty much everywhere!For Kyouko, the founder of this amusing club, all she wants in life is to simply have fun and do whatever she wants. And you can bet that wild antic of hers ain't stopping anytime soon, as she drags Yui, Chinatsu, Ayano, Chitose, Sakurako, Himawari, and more girls down her fun-filled life. Little did they know they're about to undergo the wonderful process of yurification...\\n\\n\r\nAh right, there's Akarin too. Let's be sure not to forget about this poor girl~\\n\\n\r\nAnywho...where was I? The characters? Souka. Yuru Yuri is basically a hilarious mash-up of personalities given life in true moe fashion. Messing about and triggering all kinds of silly gags, those are really the only things they do each episode. It's just like what the name of their club implies: a show dedicated solely to amuse us and themselves, or well, Kyouko mostly. Because all these fun hilarities are emphasized against your typical slice-of-life setting, it's easy to indulge in their playful banters and get a giggle or two here and there...at worst! At best, you might wanna relax your lungs in case an uncontrollable laughter is about to ensue.\\n\\n\r\nAs if the comedy isn't enough already, the show thrives on its sweet girl-love moments, giving extra amusements, increased affections, and...uhh...some suggestively lewd stuff through Chitose's poor vision and nosebleeds. But I promise, it's nothing too extreme! About the only sexual thing outside the realm of imagination is with the whole oppai gag between the love-hate Sakurako and Himawari. Other than that, the yuri undertones here multiply the endearment to a whole another level. Packed full with flusters and blushes, the show is definitely not afraid to crumble me down with the power of kawaii.\\n\\n\r\nWhile all these dimwits are great comically, I'm also fond of those heartwarming bits where things tone down slightly. You know, unless you love to be on the verge of death laughing all day long. Yuru Yuri's more level-headed girls, such as Yui and Ayano, have their moments where they talk good things about their friends and it's wholesome to see these slices of warmth. Even Chinatsu, a cute girl who may or may not be harboring some crazy personality, has her own moments too. It's not much, but it's certainly enough to get me more attached to them.\\n\\n\r\nAnd life wouldn't be so much fun without its colorful shapes and sounds! Eyes so round they'll put a circle to shame. Voices so cute hearing one episode is enough to meet your daily sugar intake. Expressions so funny you'll...well, I'm sure you get what I mean already. All I'm saying is the chibi-looking art style, smooth animation, visual gags, emotive voice acting, and light background tunes work well together to create such a fun atmosphere. Even if they didn't put in any heart effects, it still feels like you can see hearts all over your screen. Truly the works of Moe Moe Kyun!\\n\\n\r\nBy the way, beware of the catchy opening and ending songs. The use of consonance with the show's name may give you earworms.\\n\\n\r\nSo yeah! What else are you waiting for? Go on and enter the Amusement Club and meet all the amusing girls of Yuru Yuri as they spend their days doing fun things together, with some enjoyable bits of homo-cuteness of course! It's about time Akarin greets you on the title scre—Oh...\\n\\n\r\nI forgot to talk about her, didn't I? Whoopsie~!",
            "date": "2019-01-23T06:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 299841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=299841"
        },
        {
            "content": "Best CGDCT (cute girls doing cute things). I will not speak in general terms why opinion is subjetive. In my opinion, Yuru Yuri has a perfect combination of all that I like (yuri, cute childish schoolgirls, comedy). There's no drama or other unnecesary things. It's perfect!\r\nmaybe if there more yuri, would have a 10   \r\n-Story? lol, there's no exist and is good\r\n-Art (8/10): Namori have a cute art, perfect for lesbian cute schoolgirls\r\n-Character (9/10): Very cute and funny characters. A irreverent otaku, a lovely (but creepy sometimes) pink-haired girl, a siscon/lolicon pervert onee-chan, a modest and mature tomboy, a  \"invisible\" girl, ayurijoshi whose nose is bleeding, etc\\n\r\n-Enjoyment (10/10): Is necessary say more? \\n",
            "date": "2018-07-23T09:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 284592,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467351.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MaryMcKaylaMcCan",
                "username": "MaryMcKaylaMcCan"
            },
            "url": "https://myanimelist.net/reviews.php?id=284592"
        },
        {
            "content": "AAAAAKARIIIIIIN!\r\nHAAAAAAAAAAAAAAI Jebus reviews Yuru Yuri, hajimatte yo!\r\nSo when I first started watching this show, I thought to myself \"oh no, here we go, middle school girls thinking they're lesbians so they go and do lesbian things with other lesbians that are friends of said lesbian\" and you know what? I was right. Now mind you, this was when I found the idea of lesbians being funny just ridiculous so I didn't really enjoy it like others did. I watched the first episode just out of curiosity and I was bored to tears and just found myself getting angry with every lesbian joke that came outof this show. I turned it off and never looked back. This was when it aired.\\n\\n\r\n...then I watched episode 2 three years later after lightening up a bit.\\n\\n\r\nMy god, how this show managed to slip through my radar is incredible. Every character has feeling and emotion and just fun qualities about them that it's impossible not to enjoy and love at least one of these characters. Whether you love the rowdy and carefree TOSHINO KYOUKO, the bratty and sometimes caring Chinatsu, the caring and bold Yui or the one-you-just-can't-help-but-feel-sorry-for Akarin, there is someone to love in this show.\\n\\n\r\nNow to be fair, this show isn't for everyone. If you are not a fan of the slice of life genre, or you just don't find the same running jokes funny after 5 times in a row, you will not enjoy YuruYuri. If you like girls who work off each other to pull off some of the greatest situations in SOL history, you will love the hell out of YuruYuri.\\n\\n\r\nAlso, this is the first show in many anime that I found the supporting cast to be just as fun and wonderful as the main cast and sometimes they get more screen time than the main four, but boy, does it pay off. Ayano is a girl who is totally tsundere for Kyouko and whether she wants to admit it or not, everyone else can tell. Another character (and when I talked about running jokes) Chitose is a running joke all by herself. Taking off her glasses will make her mind imagine two girls that she sees infront of her engage in a yuri-esque situation and thus, she gets a nosebleed. I do admit, sometimes the joke can be overused but sometimes it works wonderfully when used at the right moments.\\n\\n\r\nOVERALL: The show is a balance of fun and curiosity between the cast and even though the show gives off a vibe of \"lesbian only\" jokes, most of the jokes are anything but. Most of the time, the jokes are just simple SOL jokes you would find in classics like Azumanga Daioh and School Rumble. The setting is simple but it barely plays a part in the show's overall feel. However, like I said, this show is not meant for everyone so try to keep an open mind when going into it. Also, I really advise you to skip episode 1 and head straight into 2 as that is when the show kicks it up a notch.\\n\\n\r\nJebus gives Yuru Yuri 4 curiosities out of 5.",
            "date": "2014-03-08T14:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 135097,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/318254.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JebusMatoi",
                "username": "JebusMatoi"
            },
            "url": "https://myanimelist.net/reviews.php?id=135097"
        },
        {
            "content": "If you think your too good, or much of 'cool' guy to watch cute moe anime, your missing out!\r\nStory 9/10: It's slice of life, so not much of a plot. Each episode is pretty straight forward, with your usual school themed stories. However it's so funny and so well written it doesn't feel cliche at all. \r\nArt 9/10: Yeah it's cute moe art, I didn't think I'd like it but it grew on me and I thinks it's adorable! So the moral, don't judge a book or in this case anime by looks alone.\r\nSound 10/10: Oh that opening theme, it's so catchy! I find myselfhumming it all the time, it just a wonderful theme!\\n\\n\r\nCharacters 10/10: The characters are what really make this show. There all very original for the most part, like an MC who lacks presence so much she's not really the MC. One girl who is a slightly perverted doujin artist and has a huge crush on another girl who looks like her favorite anime character. Another girl who nose bleeds everytime she takes her glasses off because of her Yuri fantasies. We also have a Tsundere, well three in fact, and two of them like each other! A Tsundere crushing on another Tsundere... how does that not sound hilarious! The cast is just great and will always make you laugh.\\n\\n\r\nEnjoyment 10/10: I haven't laughed this much at an anime since I watched the early Fairy Tail episodes, this anime is comedy gold. It's also filled to the brim with girl x girl love and inuendo. It's just fun, it's just impossible to not have fun watching this anime!\\n\\n\r\nOverall 9/10: Yuru Yuri is a barrel of laughs with more then plenty Shujo Ai! If you like to laugh and love your Yuri/Shoujo Ai, you will love this anime!",
            "date": "2015-10-23T08:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 201802,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4945214.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DarkLordofYuri",
                "username": "DarkLordofYuri"
            },
            "url": "https://myanimelist.net/reviews.php?id=201802"
        },
        {
            "content": "Yuri Yura Rarara Yuru Yuri (x3)\r\nDI-IE CHI-CKE-N (actually dai jiken)\r\nI can never unhear that…\r\nYuru Yuri is a very fun anime. I really enjoyed it, and yes, I approve the amount of yuri present (no it is not a yuri anime, but still does not disappoint the title ;p)\r\nStory: The story of Yuru Yuri follows the four main characters; Kyouko, Yui, Chinatsu, and, uh… the other one, as they have fun middle school adventures. The overarching story of this season leaves something to be desired, as it does not have much to draw back onto, and instead relies on more of an, episode by episode formula,with strong characters and occasional callbacks. I’m gonna relate this to Nichijou somewhat through this review (yes I know I should be judging it on its own merits, and I am, it’s more for comparison’s sake), as they have similar segments throughout the episode, or series, that are made for specific gags and do not really contribute to any overarching plot points, so marking such shows on story is somewhat hard. That being said, I’ll give this a 6.5/10, and bloat it to a 7/10. It’s good, nothing special, nothing bad, just good.\\n\\n\r\nArt/Animation: This is not one o my strong suits (neither is sound) and other reviews will cover this better, but: The art and animation used are generally fluid and well animated. The art is at a consistent quality throughout the duration of the anime, and the style is not simplistic. They also, at times, employ other animation styles to add to the current scene which is always welcome if correctly employed. Overall, an 8.5/10 for animation, rounding it to a 9/10.\\n\\n\r\nSound: The sound is well employed in the OP/ED and the general background music used it phonetically pleasing and always used to accent a scene, never drawing away from it, or failing at its job. There were a couple of standout pieces and the OP/ED are always fun to listen to (and watch), and employs one of my favourite techniques, yet rarely used ones (at least in what I’ve seen), where the cast is used to sing the songs (typically in character). Overall an 8.5/10 for sound, rounding again to a 9/10. Side Note: That OP is a great tongue twister when you’re first learning it and want to pronounce it properly. (Side Side Note: It also has a 'light novel'-esque title. As in, crazy long, which I actually enjoy).\\n\\n\r\nCharacters: This category is tricky. Yuru Yuri does have solid characters that it builds up, but for the most part of this season, a couple of them (namely 3, but I won’t give names as some are joke centralised), are reduced at times to become their defining character trait that is subject to jokes. While this can work, it is (not always in this but in media) used for cheap and unearned laughs most of the time. That being said, a couple points would need to be subtracted to compensate, so Yuru Yuri is getting a 7.5/10 for character, rounding to an 8.\\n\\n\r\nEnjoyment: I REALLY enjoyed watching our three protagonists’ shenanigans throughout these episodes. Much of the comedic timing was spot on, and although some of the jokes can be seen off in the distance before they arrive, they are still amusing when they do so. All in all, I would give this season of Yuru Yuri a solid 9/10 for the enjoyment factor, as it really is quite good a lot of the time, and I was sad to see it end.\\n\\n\r\nOverall: Overall, Yuru Yuri is a good anime, it’s jokes rarely fall flat and occasionally even got me to actually laugh. The writing behind them is typically well done (something I am glad I finally get to talk about), and the character designs are on point. Coupling that with solid animation and great sound and you land a solid anime with an 8.4/10, rounding down to an 8/10 for its final overall score. I’d recommend this anime to anyone who enjoys comedy anime (and isn’t a comedy snob), or people who like the slice of life genre, as this also doubles down on that, with of course, a touch here and there of the more extreme.\\n\\n\r\nI feel like I forgot to properly mention someone important though…\\n",
            "date": "2018-04-07T19:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 277317,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6559723.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Springball64",
                "username": "Springball64"
            },
            "url": "https://myanimelist.net/reviews.php?id=277317"
        }
    ],
    [
        {
            "content": "I love the fact that people are writing serious reviews about the first season of Yuru Yuri. Why. Why are you doing this. If you are the type of person who filters everything through your anime trope-and-convention sieve and very little gets past, avoid this show. On the other hand, if you can turn your brain off, just watch something without overthinking it, and enjoy it for what it is, this is for you.\r\nThis is a show about cute Japanese schoolgirls that have a club where they do fun stuff. That's it. It's slice-of-life, comedy, and a little bit of yuri teasing. There's no plot,there's no conflict, there's no character development. \\n\\n\r\nThis is show is a giant bowl of potato chips. Delicious but totally lacking any substance whatsoever, a complete joy to consume, and once you're done you will have completely forgotten it and are ready to do it all over again.\\n\\n\r\nThe music is ridiculously upbeat, the animation is acceptable, and the voice acting is fantastic. I give it two stars to the back of the head.",
            "date": "2018-04-01T11:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 276350,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7019349.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hematospermia",
                "username": "Hematospermia"
            },
            "url": "https://myanimelist.net/reviews.php?id=276350"
        },
        {
            "content": "I dont get why Japan has such a weird fantasy with Yuri animes... but whenever they do it its good. \r\nThis one is no exception. Very funny. Could not stop laughing throughout the entire series. I love these kind of casual, school life, comedy anime. And i dont mind the Yuri touch too. In fact, it adds to the comedy of the show. \r\nSo yea, not a bad anime for me if it keeps me laughing and entertained throughout. I do love the characters especially Akari and Ayano. Great character development for these 2.\r\nThe one thing which it could improve on is perhaps the animationand the storyline. Too much randomness happening.",
            "date": "2018-02-14T01:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 271481,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6872532.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tringapore_98",
                "username": "Tringapore_98"
            },
            "url": "https://myanimelist.net/reviews.php?id=271481"
        },
        {
            "content": "This anime is very good my boi\r\nit is funny ,it has yuri and it has good characters.\r\nIf you like yuri and comedy you should check this out.\r\nAbout story  it was enough i think? this anime is comedy so I don't really care as long as it is funny. The yuri was mostly comedy element. Most of the yuri was there thanks to a character's fantasies. About art it was ok. Sound was ok too.\r\nCharacters were very good in my opinion, they all have different personalities\r\nand they didn't fell unnesesary ( but this review being this long is unnesesary)\r\n I don't really have anythingto say but my animelist says write this review longer sooo\\n\r\n I watched this show in 2017 but it didn't feel old.\\n",
            "date": "2017-04-24T22:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 246266,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5754544.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zombono",
                "username": "zombono"
            },
            "url": "https://myanimelist.net/reviews.php?id=246266"
        },
        {
            "content": "Yuru Yuri is one of those shows I was curious about, wondering why it was so popular. I decided to give it a go, and I can't really understand why so many people like it so much.\r\nMy biggest issue is two things: The characters are incredibly bland and annoying, and it's not very funny... At least to me.\r\nHonestly, it was difficult finding any of the characters likeable. The only two I enjoyed throughout the whole run were Kyoko and Akarin. Everyone else is basically a walking stereotype like Ayano, Yui, or Chitose. Ayano is your textbook tsundere and really loves Kyoko for no real goodreason. Sakurakou and Himawari are just there for the breast jokes. Chitose only exists to impliment some yuri fanservice... Do you see what I'm getting at here? Everyone feels like they're simply pawns to make an unfunny and predictable joke. It was so one-note and by the book that I had a hard time laughing at anything.\\n\\n\r\nI really disliked Chinatsu in particular because she ended up being so unlikeable. A very stuck-up and pretentious girl who's only defining trait is hating Kyoko and being madly in love with Yui. I'm not exaggerating when I say that's what happens when the show tries focusing on her, one of those two things happen. Or maybe both. There also was a part in episode 11 that made me dislike her even more, but I won't spoil it. Nothing about her is a good character to me, and the show would have been much better if she wasn't part of the main cast.\\n\\n\\n\\n\\n\r\nNow for the jokes, which unfortunately don't land well most of the time. Like I said earlier, a lot of the comedy stems from the characters which are all very stereotypical so you can see what's coming a mile away. What's worse is that they like to really hammer in the same jokes over and over across the entire season. Was Chitose getting a nosebeleed and fantasizing about Ayano and Kyoko being together not funny the first time? Well too bad, because it's going to happen many, many other times! You can really tell what's going to come up just because it all is painfully predictable. There were a few times were they threw curveballs and made me laugh, but it was very few and far between. There's one joke in particular which just felt way too mean spirited, which is Akarin barely having any screen time despite being the supposed protagonist. It's a cute funny joke at first, but overtime it just ends up being kinda hard to watch because it feels like the world is against her and nothing goes her way.  There are even times where she doesn't appear for an entire episode just because of a short gag in the beginning. Maybe I'm looking too deep into it, but I really didn't find that funny and just became grating after a while.\\n\\n\\n\r\nSo overall, I really wanted to like Yuru Yuri, but just ended up really bored and wanting it to be over near the end. The characters did absolutely no favors as they made the show very bland and predictable, and hardly any of the jokes landed for me.",
            "date": "2017-11-18T01:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 263464,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4631635.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SuspiciousScout",
                "username": "SuspiciousScout"
            },
            "url": "https://myanimelist.net/reviews.php?id=263464"
        },
        {
            "content": "Honestly nothing particularly stands out with this, but if you're watching it for what it is, it is perfect. A lighthearted and silly anime. Lacking complex characters and depth, this anime aligns the little it has to provide humour (this is how it's really spelled spellcheck!!) and simple stories that are brief without being underwhelming. This is by no means a masterpiece, but it is still a work of art. Pleasing to the eye, and warming to the heart.\r\nApparently reviews need to be longer, but I think this is enough to express my opinion. Thank you for reading my first review.",
            "date": "2019-02-11T12:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 301432,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/444288.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Loki13",
                "username": "Loki13"
            },
            "url": "https://myanimelist.net/reviews.php?id=301432"
        },
        {
            "content": "What does one expect when he starts watching anime about middle school girls which are starting an enjoyment club? Well I dont know what you dirty minds expected but I wanted to have fun and that exactly what I got, nothing less nothing more.\r\nThis show has no deep story, no character progression, but it has really nice moe art and sence of humor. It is best show to watch after something deep and challenging like  Steins;Gate, you will just turn off your brain and have fun.\r\nIt is based on short stories, situations and interaction between four main heroines and few other girls which areliving their normal middle school lives. \\n\\n\r\nThose main characters ( I really cant remeber any boy featuring in this show) are quite different, and so their interaction has quite funny element in it. few of them follow classic types like tsundere, yandere etc. but most of them are original (its basicaly because of their youth and naivety).\\n\\n\r\nI dont think there is really anything more to add, if you want to just have fun based on spoken and visual humor, turn of your brain and enjoy, this is anime for you.\\n\\n\r\n8/10 Would relax again",
            "date": "2015-06-17T06:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 190462,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4229129.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/qub4honor",
                "username": "qub4honor"
            },
            "url": "https://myanimelist.net/reviews.php?id=190462"
        },
        {
            "content": "If you're wondering what Yuruyuri is about, the title really says it all. The girls go to school and do something \"fun.\" The girls bring in some lesbian jokes in the premise.Outside of providing a silly, outrageous good time, that is. It's all deeply stupid and quite fun.\r\n        Yuru Yuri is pretty pointless and episodic. There's no chance to make a compelling arc. A club the purpose of which is to facilitate the doing of nothing.\r\n        The Characters of this show are simplysketched, and are distinctively cliche. Akari is the nice girl type with a \"not so main character-ish\" presence, Yui is the smart, cool one, Chinatsu is similar to Akari but poses a dangerous threat of sadism, and Kyouko is the energetic and irresponsible one and so on. Much fun is similarly had with the three tsunderes in the student council, and the glass girl Chitose, who often takes off her glasses to nosebleed-fantasize about her classmates. There's so little variation on the usual character themes that whenever there's any crossover it gets hard to tell characters apart. It takes a particular kind of viewer to enjoy something like Chitose's fantasies, during which things are pretty normal until she takes those damned glasses off, but if you're that kind of viewer, you're unlikely to find a funnier series with better characters than this.Characters are quickly and simply sketched, and are distinctively cliche. Akari is the nice girl type with a \"not so main character-ish\" presence, Yui is the smart, cool one, Chinatsu is similar to Akari but poses a dangerous threat of sadism, and Kyouko is the energetic and irresponsible one and so on. Much fun is similarly had with the three tsunderes in the student council, and the glass girl Chitose, who often takes off her glasses to nosebleed-fantasize about her classmates. There's so little variation on the usual character themes that whenever there's any crossover it gets hard to tell characters apart. It takes a particular kind of viewer to enjoy something like Chitose's fantasies, during which things are pretty normal until she takes those damned glasses off, but if you're that kind of viewer, you're unlikely to find a funnier series with better characters than this.\\n\r\n      Yuruyuri Character designs, objectively speaking, are standard to the point of plainness - the way they are used being far more interesting than their appearance. Backgrounds, particularly the Yui's apartment and the Amusement Club room, are well-detailed and fully sufficient to their purpose, but they're given to little scene time to be called impressive. There's fanservice to be sure and plenty of naughty, but not dirty,particularly involves Himawari's boobie gags and Chitose's delusional fantasies\\n\r\n       Overall Yuruyuri is a cliche and pretty dumb show, but delivers good enough to make everyone laugh.",
            "date": "2014-11-15T21:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 168763,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4157753.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Monjoex",
                "username": "Monjoex"
            },
            "url": "https://myanimelist.net/reviews.php?id=168763"
        },
        {
            "content": "Going into Yuru Yuri, I thought that it was going to a slice of life anime with heavy yuri in the middle of it. I was kind of right, and in the process, I found one of my favorite slice of life animes.\r\nStory:\r\nThere is no real story in Yuru Yuri. It has that Hidamari Sketch feel where you just see the main characters do whatever comes up, talk to each other and just live their lives. Pacing is a bit slow on the first couple of episodes and they didn't get down their comedic timing yet, but it picks up real quickly. Depending on thetype of person you are, you're either gonna love or hate the fact that nothing really happens. Me, I personally don't mind, as long as I laugh, it's all good, and you're definitely laugh. So it's an 8 for me\\n\\n\r\nArt:\\n\r\nArt is great, each episode, you'll find another sort of anime-y face which will make of course, make you laugh. It's pretty simplistic in it's art, nothing too amazing, but that's good because it won't distract you from what you're suppose to pay attention to, which is the characters and the interactions. The characters all have vastly different hair styles with a different hair color so you can tell them apart easily, which is good since there's 8 main characters you follow. Not much to say from me, just loved the anime faces they make, 10.\\n\\n\r\nSound:\\n\r\nThe seiyuu's do a great job to match the voices of their respected characters. Whether it be aloof, a tsundere, or a pervert, they do the voices well and it helps distinguish their personalities. The background music is pretty chill and sometimes silly which fits the anime, so I have no complaints. The OP and ED is pretty damn good, both catchy and the seiyuu's do a good job singing them. To me, 9\\n\\n\r\nCharacters:\\n\r\nAs said before, they're all distinct due to hairstyles hair colors and personalities. You've got your typical aloof characters, tsundere girl, dumb character, \"notice me senpai\" character and all the sorts, but one character sort of rubbed me the wrong way and that's a character who imagines yuri between two characters. You will either tolerate it or sort of find it uncomfortable which I did because the yuri scenes happened pretty frequently in the early episodes and was pretty long. Thankfully, the whole yuri imaginations slowed that and made it better by making it less. Other than that, I still remember all the characters, I can name all of them and they're all memorable. Just cause they didn't know how to make their characters work together, I give it an 8.\\n\\n\r\nEnjoyment:\\n\r\nDefinitely one of my favorite slice of life animes, great comedy, fun characters and I can always just go back to a random episode if I feel like just seeing it again. Anyone can jump into it if they don't mind seeing a bit of yuri. Enjoyed the songs too, both very catchy and worth listening to cause it makes me dance. Fun anime, 9. \\n\\n\\n\\n",
            "date": "2015-10-24T15:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 201874,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4798040.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/magicalkittycat",
                "username": "magicalkittycat"
            },
            "url": "https://myanimelist.net/reviews.php?id=201874"
        },
        {
            "content": "I began watching Yuru Yuri yesterday and so far it's pretty good.  The op is really catchy and very cute.  The art style is ok, it's really bright and cheerful, since this isn't much of a serious anime at all.  The character design is decent, the characters are really adorable.  All the girls are 13 and 14, middle school, and alot of them seem to be lesbians.  As far as I've seen, there are no male characters in this series.  The characters personalities are pretty decent. Akari is the good girl, Yui is the mature girl, Kyouko is theotaku, and Chinatsu is the innocent girl.  Chinatsu also looks up to Yui is a posisble romantic way.  Kyouko also makes Chinatsu cosplay as Kyouko's favorite anime character, Little Witch Miraku-run, since Chinatsu looks so much like Miraku.  It's just a cute school life/comedy anime with some yuri intentions in it.  If you like moe,  school life, or yuri then I recommend checking it out.",
            "date": "2011-08-11T14:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 41297,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/536543.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Alice21Tamaki",
                "username": "Alice21Tamaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=41297"
        },
        {
            "content": "Despite the \"Yuri\" in its title, this show doesn't even come close to being a Yuri anime show. It's more on a Shoujou Ai side but there are no lesbian relationships here. \r\n[Story]: (7/10)\r\nAfter finishing Middle School, Akari Akaza joins the the tea ceremony club along with her two childhood friends, Toshino Kyouko and Yui Funami. Soon, a 4th member joins named Chinatsu Yoshikawa.\r\nOk, doesn't that synopsis remind you of some slice-of-life show that you most likely have heard of or have watched already? I think it was that show from Kyoto Animation...That's right..K-On!. I really don't want to compare both shows even though thesimilarities are obvious so I'm moving on. \\n\\n\r\nThe story of the show is.....Well....nothing. It's just a simple slice-of-life \"cute girls doing cute things\" kind of show except most, if not, all the characters are lesbians. Although, like I said in the opener, there are no lesbian relationships here so if you're here for that then this is not the show for you. There are occasional scenes where they would tease the viewers, showing the 2 characters being lovey dovey towards each other but that's it. The show will not go as far as dating. \\n\\n\r\nThe comedy is what you'd mostly expect in a lesbian anime show..For example, Chitose having a nosebleed due to her yuri fantasies, Toshino being obsessed with Chinatsu, Chinatsu being obsessed with Yui, a lesbian tsundere acting like a tsundere. The question is are the jokes funny? Ehh, the jokes are decent but not the funniest.  \\n\\n\r\nMost of my review will be on the \"Characters\" category so this section will be short. \\n\r\n______________________________________________________________\\n\r\n[Art/Animation]: (7.5/10)\\n\r\nThe animation isn't really anything special or even great..The background just looks so plain and it lacks details and the character designs are average at best. In short, it's decent. Then again, this is a slice-of-life show so..... \\n\\n\r\nWhat I do love is the \"Akarin\" intro. The Akarin intros are just so cute and every episode, I looked forward to it even though it was only about 15 or more seconds. \\n\r\n______________________________________________________________\\n\r\n[Sound]: (8/10)\\n\r\nThe soundtrack isn't really anything special either. The OST's that would play in the background when they're fooling around or when they're having a normal conversation aren't worth mentioning. Now the OP and ED theme song(s)\\n\\n\r\nThe OP theme song is Yuriyurarararayuruyuri Daijiken\" by Nanamori Chu?Goraku Bu and the ED theme song is My Pace de Ikimashou\" by Nanamori Chu?Goraku Bu. The OP theme song is not the greatest OP I've ever heard but it is damn catchy. Especially when the \"Sakura saki\" lyrics plays, that gets me everytime. The ED theme song is also pretty catchy..I just love Yui and Toshino's voice. \\n\r\n______________________________________________________________\\n\r\n[Characters]: (8/10)\\n\r\nWhat you have here are 4 main characters who all happens to be lesbians. There are no boys in this world and everyone in this universe is a lesbian. Ohh, the joys of living in a world with no boys...I'm going to leave that to your imagination. Time to talk about the characters.. \\n\\n\r\nFirst, we have Akari, a protagonist who gets treated like a side character. She has a hair dumplings that can supposedly come off and can turn invincible when the word \"Akarin\" is shouted. I honestly feel bad for her character because of how she is treated in the show. Then there's Toshino Kyouko, a supposed protagonist of the show. She is an otaku, an energetic girl and she can't shut up for even a single second. Toshino = Best Girl! period. She's the main driving force of the show and she's just hilarious. Although, her jokes can get somewhat repetitive. She also \"loves\" Chinatsu. Then there's Yui, the calm, leader/senpai-like of the group. She's the one who keeps Toshino in check. Finally, there's Chinatsu, a girl who later joined the tea club. She's like an evil mini-yandere..She'll do everything to get close to Yui. \\n\\n\r\nThen there's a bunch of side characters that are forgettable NOT!. To be honest, I love all the side characters. Each of the side characters are funny and likable in their own way like Ayano's tsundere side and her puns that somehow makes Yui laugh, Chitose's yuri fantasy of Toshino and Ayano and her nosebleeds, Himawari and Sakurako's constant arguments. and etc. \\n\r\n______________________________________________________________\\n\r\n[Enjoyment]: (8/10)\\n\r\nI'm a fan of Shoujou Ai shows and even though this anime didn't have any lesbian relationships, I still love this show. It's a nice slice-of-life to watch like K-On except they're all lesbians. \\n\r\n______________________________________________________________\\n\r\n[VERDICT]\\n\r\n\"Yuru Yuri\" is a great slice-of-life series with a supposedly Shoujou Ai scenes. If you like watching \"cute girls doing cute things\" or you're a fan of it then this is a must watch show. Just don't hold your expectations high on the comedy because it's average at best. \\n\\n\r\n[OVERALL]: (8/10)\\n\\n\r\nPros:\\n\r\n+Great Slice-of-life show \\n\r\n+A show Shoujou Ai fans can enjoy\\n\r\n+Average comedy\\n\r\n+All main and side characters are great in their own way\\n\\n\r\nCons:\\n\r\n-Plain Animation\\n",
            "date": "2016-01-26T15:00:00+00:00",
            "helpful_count": 6,
            "mal_id": 209421,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=209421"
        },
        {
            "content": "\"Cute girls doing cute things is truly the best thing that has ever happened to this timeline\"\r\nLet me preface this bad review by saying that i think most anime is trash but i hate myself for enjoying it all so much. Often i find the plot synopsis of most of animes absolutely stupid to no end. Yuru Yuri being a perfect example. A bunch of overly cute young schoolgirls hanging around drinking tea and bumbling about sounds like just another mediocre series that will print money for the studio behind it and make westerners even more embarrassed to confess they like the whole anime medium.\r\nIwas hesitant to start watching Yuru Yuri, but i'm sure glad i did. 3 seasons later and a newly gained interest for rum-raisin ice cream has solidified Yuru Yuri as my favourite anime. Who could think that an anime without a plot could be so captivating.\\n\\n\r\nThe characters are all quirky but consistent. The neatly written character development archs keeps you in your seat and the absolutely adorable girl-on-girl love scenarios warms my cold bitter heart to it's core.\\n\r\nAt times it's really stupid and has made me laugh out loud at times. However, it's always in a perfect amount and has not gotten embarrassing once. The fact that they introduce a character as the main character and quickly forgets about her vital role is absolutely hilarious and shows that the studio and the people behind the series have a good amount of self awareness.\\n\\n\r\nYuru Yuri excels at what it's trying to be. It knows it's stupid and that's what makes it great.\\n\\n\r\nWhat i'm trying to say is that i hate myself and that you should watch Yuru Yuri and treasure the time you have with this fun and adorable anime.\\n\\n\r\nAlso, if any of the story writers read this, i expect at least 3 marriage proposals in the next season.",
            "date": "2017-08-11T12:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 255207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6458636.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/fuccintrash",
                "username": "fuccintrash"
            },
            "url": "https://myanimelist.net/reviews.php?id=255207"
        },
        {
            "content": "【 The following is a review of : Yuru Yuri, Yuru Yuri: Happy Go Lily ♪♪, Yuru Yuri Nachuyachumi! (OVA), Yuru Yuri Nachuyachumi!+ (OVA), and Yuru Yuri San☆Hai! 】\r\nYuru Yuri is one of the best of its kind. Speaking for the moe genre and the absurd humor portion. If you think that one night, Teekyu and K-On got shit-faced, slept together, and had a bastard childーthis series would be their love child.\r\n\t• I initially dropped this series when it first started airing in 2011. The main heroine’s older sister, Akane, is rabidly obsessed to her imouto to a serial killer-like degree, so when Akari’s friendscome to pick her up from school and they accidentally wander into her sister’s room, seeing pairs of Akari’s panties splayed all over the place, grotesquely, and pictures of her everywhere and they are shock-still with terror. This moment is quickly swept under the rug with Akari making a punchline comment about not being able to find her underwear. \\n\\n\r\n\t• At that point, I was disenchanted and didn’t the rest of the first episode a fair chance, because I thought that kind of behavior was being glorified, and maybe it was? There’s an on-going joke later after Chinatsu forces Akari to kiss her and she has dead, rape-victim eyes, so the anime has wandered into some pretty bleak fields of vision, with its humor.\\n\\n\r\n\t• I don’t know and frankly, I don’t care, because I like Yuru Yuri. I like the main cast of characters and their synergy with each other. It has really good visuals for its time and all of the girls are super cute, but have flaws like real human beings. You would appreciate the humor, if you like 4chan, trollsy, 4th dimension, stoner humor.\\n\\n\r\n\t• There’s not any REAL yuri in Yuru Yuri. Like, I said before, there’s a couple of scenes where the girls kiss and some of them obviously have crushes on other girls, but nothing happens. And watching this series makes you feel okay with thatーyou’re okay with the complacency and the surrealism and the chubby-cheeked quartet of school girls being goofy. \\n\\n\r\n\t• That being said, seasons one and three have roughly the same rating for me. Liked them both, but Yuru Yuri: Go Lily happened and added an entirely new layer to the series. I already had Akari as my favorite character, but this season confirmed my attachment to her.\\n\\n\r\n\t• In the second season, there’s an introduction to each episode in which it’s pretty much like, “Hey, look! It’s our main character, Akari!” and then another character swoops in and over-shadows her because she has zero presence. \\n\\n\r\n\t• You think that’s just a gag and nothing’s going to happen, not going to spoil anything, but you find out that all of those scenes are reoccurring for a reason. And there’s an episode that addresses it, and it made me cry, and Akari has a full-blown existential crisis over her identity as a wallflower. Remember, this is a moe show. So, wow. Just, wow.\\n\\n\r\n\t• Overall, Yuru Yuri deserves its spot as one of the kings, or queens (whichever you prefer), of moe. It’s definitely garnered a spot as one of my favorite “cute girls doing cute things” shows, along with Girls und Panzer. I give the first season of Yuru Yuri a 6/10, the second a 7/10, and the third a 7/10. The two OVAs that have been dropped are also jubilent little gems, I affectionately rated them both 7/10 as well! Please look past the initial creepiness and give it a second chance like I did, if Akari’s sister deterred you from watching.",
            "date": "2018-09-08T22:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 288533,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5154479.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LunaPrecure",
                "username": "LunaPrecure"
            },
            "url": "https://myanimelist.net/reviews.php?id=288533"
        },
        {
            "content": "- Hello, guys, finally I bring you my review of Yuri Yuri, starting with the story that could not be simpler, the story is basically the day to day of several girls, and although extremely simple, it is still very fun to follow the episodes. the work has very good moments of comedy, and this is what I admire in an anime, I admire when they transform something extremely simple, something fun and great to pass the time, anyway, there is not much to talk about the story of Yuri Yuri, it's a simple story but a lot of fun.\r\n- On the technical side, doesnot have much to say, being a Slice of Life the technical part does not stand out so much, not that bad, on the contrary the technical part until it is good, the animation is decent, the visual is simple however flashy, the colors are vivid and well defined, in short it is a good technical part; now on the direction, this is a point that stands out in Yuru Yuri, the direction is excellent, it manages to create excellent comedy scenes, and the anime can be fun from beginning to end, of course I found some episodes weaker than others, however it goes a lot of the sense of humor of each person, but overall the direction is excellent.\\n\\n\r\n- Soundtrack, this one is a difficult point to explain, because in general, the soundtrack is very good in some episodes, already in other episodes I thought it could have been better, varies a lot, but honestly until it is good, it does not have much to speak, even because soundtrack is not a strong of Yuri Yuri, what stands out even are the characters of the work.\\n\\n\r\n- And finally we arrive at the strongest point of the play, the cast of characters, seriously the characters of Yuru Yuri are extremely charismatic, one more crazy than the other, and although some are stereotype, there are still some that stand out such as the character Kyouko Toshinou, undoubtedly the most charismatic character of Yuru Yuri, and also my favorite character, in short, the secondary characters are also very charismatic, in general the cast is excellent, they are captivating characters, charismatic and very fun, together with an excellent Yuri can be fun from beginning to end.\\n\\n\r\n- In conclusion, Yuri Yuri may not have the best technical side of the world, not the most innovative anime ever made, but the series manages to fulfill its proposal with mastery, delivering extremely entertaining episodes, as well as an excellent cast of characters together of a very good soundtrack and a great direction, anyway for sure I recommend Yuri Yuri, especially for those who like Slice of Life with extremely funny moments 💘😉🌸😍🌟 !!  \\n\\n\r\n- My favorite song by Yuri Yuri 💘: www.youtube.com/watch?v=TygnoaptaCc&t=108s\\n\\n\r\n- My page about animes on facebook 💜: www.facebook.com/pg/AnimeSpaceBR.050/posts/?ref=page_internal\\n\\n\r\n🌸😊🌟💜😍 !! \\n\\n\\n",
            "date": "2018-08-22T09:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 287131,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6962737.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Helivelton100",
                "username": "Helivelton100"
            },
            "url": "https://myanimelist.net/reviews.php?id=287131"
        },
        {
            "content": "Ok, the first thing I should say, is that dogakobo's Yuru Yuri is a parody of the slice of life genre and the yuri in general.\r\nAll the characters must be taken as ridicule to the stereotypes that exist in the characters of the series of this genre, especially Akari.\r\nThe situations in this anime series are so surrealistic and ridicolous, nobody in the series take seriously the situations.\r\nThe most better developed characters, or better written, are Kyoko and Chinatsu.\r\nKyoko is a silly girl, her interestings are manga, anime, rum raisin, and a lot of fun, although it can be described as a selfish character, since shedoes whatever it takes to get her friends to do what she wants.\\n\\n\r\nNext, we've Akari, the non-presence character. Her personality it's very beautiful, she is kind, considerate, innocent, a dreamer, and a good friend, but she is always overshadowed by the constant teasing of her friends, especially Kyoko.\\n\\n\r\nYui is the character without personality, has no development as such being a totally boring character, and that may be the reason why she always accedes to the whims of Kyoko, because without Kyoko, Yui is a character without identity or purpose.\\n\\n\r\nChinatsu is a very interesting character, because she looks like an innocent girl, but she isn't. She feels a pretty big attraction towards Yui, an insane attraction, since she practically wants Yui with her basest instincts. Her personality it's so variated, and this is the most interesting quality of her. It's so maniac.\\n\\n\r\nThe other characters are so charismatic, specially Chitose... Gosh, I love that girl.\\n\\n\r\nWith a lot of jokes and references to another series, this and the second season are the best in animation, because it's more a parody than a series of the genre.",
            "date": "2018-05-08T21:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 280096,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5791248.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheAdminJJ",
                "username": "TheAdminJJ"
            },
            "url": "https://myanimelist.net/reviews.php?id=280096"
        },
        {
            "content": "Yay! Cute girls doing cute things now in lesbian middle school girls-edition! \r\nWhen I first found out about Yuru Yuri I was trying to look for something that is kind of against the norm of just presenting cute girls doing cute things. Something that would spice things up a bit. Of course my first intention for such a thing was not Yuri and I also legitimately thought at first that the whole Yuri-theme was just some joke despite the obvious title. \r\nWell let's take a look at what Yuru Yuri has in stock.\r\nStorywise there really isn't anything happening which hasn't been done before - exceptfor maybe the seemingly homosexual main cast consisting of cute girls. This does not add any real substance to either story or change anything severely in character development. The worst thing which could happen is that one girl would attempt an obvious flirt but the comedy kicks in most of the time right after that to destroy any chance of an actual relationship happening between either of the characters. The whole Yuri-theme is mostly downplayed to mostly lame comedy instead of being the cornerstone for seriously romantic themes. But I doubt this was the creator’s intention. It was rather there - as said - for the jokes and the fan service which wasn't really a letdown for me personally since I didn't expect anything in terms of relationship building beforehand. Just at the end thinking about it, it was kind of a bummer but nothing severely.\\n\r\nIn general the story sticks to the norm and so does the setting. We have a beach episode, a school trip, hot springs episodes, ... .People looking for your average school comedy set pieces and events will not be disappointed.\\n\\n\r\nLooking at Yuru Yuri was one of the most pleasing things this show had to offer for me; Bright, cheerful colors as well as not really original but still adorable character designs and a constant level of quality. Not really much to praise or anything that would stand out in one way or another.\\n\\n\r\nIn terms of voice acting and soundtrack though, Yuru Yuri is way more confident with talented voice actresses and a - in my opinion - great and catchy opening as well as an ending theme which even ended up on my phone. As for the background melody Yuru Yuri plays it safer here but manages to set the mood quite well, maybe even because it is being so conservative at this topic.\\n\\n\r\nComing to the characters there is pretty much every archetype and trope involved in this happening. You have your silent and surprisingly unremarkable and heterosexual main character Akari who is in the role of the comical relief character and gets all of the writers bullying he had in stock. Not even lying there, Akari literally gets bullied by the writing of this show. From getting into accidents, not even getting noticed or simply ignored it was sometimes even painful looking at it. Then we have the hyperactive and manga obsessed Kyoko, who has a passion for manga and even works on own doujin and serves as the story's second main character with and endless stomach. Next up on the main cast is Yui Funami who is mostly your typical tomboy with a more cold side and last but not least my least favorite character of the bunch Chinatsu Yoshikawa. She is pretty standard in everything and seems to be into... forced stuff?\\n\\n\r\nOverall the characters are neither the most original or best developed ones but still manage to come off as pretty likeable for the most part, in my opinion.\\n\\n\r\nIn conclusion Yuru Yuri is a pretty solid entry in the Cute-Girls-Doing-Cute-Things-genre. It had me laughing quite some time and it was highly enjoyable watching the silly main cast and what happened to them in the course of the time. Maybe the characters aren't really self-aware of their own sexuality yet - what is counter proven though looking at certain… Ahem delusions and things they are talking about - but it would have been nice to see any actual relationships happening instead of using the Yuri-theme to attract fans and reducing meaningful character development to merely one or two episodes at best.\\n\\n\r\nStill. If you like those kind of shows and have nothing against some Yuri-themes and a girls-only-cast, make sure to give Yuru Yuri a try.\\n",
            "date": "2014-06-24T09:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 148371,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3120465.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Nachteule",
                "username": "Nachteule"
            },
            "url": "https://myanimelist.net/reviews.php?id=148371"
        },
        {
            "content": "Yuru Yuri is dedicated to the Slice of Life genre, and while that may account for a lack of story depth, it isn't an excuse for a show such as this to have no depth whatsoever. \r\nIt pains me to say this, as the show is really quite charming and likable, but essentially... There is no plot, it's just a \"pleasant\" 12 episode series of (very) mild Shoujo Ai, Comedy and SoL filler.\r\nIn terms of Art and Sound, as i expected from Pony Canyon, it was top notch! The animation style and audio couldn't be more fitting for presenting the unfortunately uneventful subject matter. \r\nThecharacters, though some very typical anime stereotypes are all well introduced, and somehow without lots of back story, they're easily likable, acquaint-able, and... kawaii. What does this DO for Yuru Yuri? Well, this combination of top presentation and likable characters, with decent dialogue makes for a pleasant viewing experience. That's pretty much it though.\\n\\n\r\nI've JUST finished watching and apart from a few glimpses of drama, it was all a bit of a blur, as there's nothing really to hone in on. \\n\\n\r\nThe comedy is a bit bland and rehashed throughout, contrary to popular belief the show doesn't make any kind of moving/touching statement about homosexuality, it just utilities it as a tool to make up mildly amusing scenarios.\\n\\n\r\nWho would want to watch this?\\n\r\nWell... If you're looking for something relaxing, something stress-free, a touch of humor and \"cute girlies doing cute things\" - BINGO! you've found your anime!\\n\\n\\n",
            "date": "2014-12-24T16:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 174091,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104713.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Micsupreeme",
                "username": "Micsupreeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=174091"
        },
        {
            "content": "Slice of life is one of my favorite genres, and if you're reading this review then I assume you at least have some interest in the genre. If not, then I have to ask you: Why are you reading reviews for slice-of-life anime if you dislike slice of life?\r\nBut anyways, moving on.\r\nStory: 8\r\nSlice-of-life stories have to be rated on a completely different scale than most other ones. It's unfair to complain about lack of depth or the plot being boring and nonexistent when the whole purpose of a slice of life is to have no plot. In shows like this, all focus is on thecharacters, not the story.\\n\r\nWith that, I think this show's story is a bit better than most. There's not a lot to go off of, but I personally like the idea of seizing an abandoned club room to form a fake club so the girls can hang out. Otherwise, the story is nothing special, even for the genre; the scene changes usually between the club room, the school, and every now and then someone's house. There are episodes where it'll change to a beach or Okinawa or something, but that's about it. Typical genre locations.\\n\r\nIf you want a somewhat absurd but still more dynamic story, there is a doujin crossover of Yuru Yuri and Fate/Zero. Yeah, don't ask. Do go read it though, it's surprisingly not bad.\\n\\n\r\nArt: 9\\n\r\nCute girls doing cute things with cute expressions and cute school uniforms. Really, that's all there is to be said. No flashy special effects or cool looking designs, just cute. Everywhere.\\n\r\nIf I'm not wrong, Doga Kobo is the studio behind Yuru Yuri. They aren't as well known as studios such as Madhouse or KyoAni, but their animation style is solid. I, for one, love the cutesy character design and the simplicity of it. The color palette isn't being abused to create girls with vibrant and strangely odd hair colors, everybody is normal. Just normal.\\n\r\nIn short, there's nothing wrong with it. Points because it's cute, not a masterpiece because there's nothing special about it.\\n\\n\r\nSound: 8\\n\r\nWhile I'm not a huge fan of the opening and ending music, that can be foregone. With most shows, music is used during episodes to set the atmosphere and played during action scenes or montages or whatever, and with slice-of-life anime, it's generally just used to build up to a punch line. It isn't really something to be harped on, I found myself enjoyed most of the music from the show, and I especially liked the short music clips during the half-time.\\n\r\nI've never and will never be picky about sound. The only exception to this rule is when there's something definitely off about them.\\n\\n\r\nCharacter: 9\\n\r\n\"What makes a character interesting is their personality. What makes them unique is the way they interact with the people around them.\" It's probably been said before, but those are my own words. I believe it's true because if you go by personality alone, there will *never* be a character that is completely unique. There will always be many other \"tsundere\" characters, or many other airhead characters, or many other stoic characters, and it's no easy feat to design a character that is wholly unparalleled.\\n\r\nWith that being said, the characters are cute. None of them really seem boring, although they aren't exactly in-depth. There's little quirks and traits that make them who they are, and if not then there's a relationship with someone else that makes them stand out. For Akari, her lack of presence. For Kyouko, her relationship with Yui. For Chitose, her OTP shipping (that causes nosebleeds) of Kyouko x Ayano. Yui is usually the \"tsukkomi,\" but there's more to her than just reacting to the punchline.\\n\r\nAll in all, I loved the characters. There's no need to have truly unique characters to have a good cast. As long as they all interact together and have at least some sort of defining trait, that's good enough for me.\\n\\n\r\nEnjoyment: 10\\n\r\nHey, I love slice-of-life shows, and this isn't an exception. When you need a break from all the dramatic action and supernatural, just pick up a show like this and relax. It works for me!\\n\r\nThis show in particular wasn't anything new or amazing, but the characters are cute and it doesn't get boring (first episode of Lucky Star, anyone?). I thoroughly enjoyed it, and I'm looking forward to watching the next seasons and OVAs and specials and whatnot.\\n\\n\r\nOverall: 9\\n\r\nIt's nothing special, as I've said many times, but this show is worth a watch if you're a fan of slice of life. I found it cute, funny, relaxing, and surprisingly dark at times (episode 4, for example). Still, it was a good watch and I'm glad that someone recommended this to me.",
            "date": "2015-12-30T12:49:00+00:00",
            "helpful_count": 5,
            "mal_id": 207322,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3606903.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Symantra",
                "username": "Symantra"
            },
            "url": "https://myanimelist.net/reviews.php?id=207322"
        },
        {
            "content": "What sound DOES a panda make?\r\nStory:\r\nI read somewhere that Yuru Yuri can be translated as \"relaxed lesbians\". That's pretty much what this is. It's a cute little slice of life comedy...with lesbians. That doesn't mean we get to see tons of fanservice or breast-grabbing or butt-touching, it's just the setting for this anime. There are a couple of girls that do have a crush on each other, which makes for some of the comedy, but much of it comes from the characters themselves, disregarding their sexuality. Actually, it's much tamer than I expected it to be, which I'm okay with. But putting the yuri baitaside, is it funny? In my opinion, yes.\\n\r\n8/10\\n\\n\r\nArt:\\n\r\nIt's moe-style. That should tell you everything you need to know, but writing nothing else would make this paragraph look pretty pathetic. There are a few cases of art shift, especially with the girls faces, which are hilarious. I liked it for its colorfulness and slightly wacky animation.\\n\r\n7/10\\n\\n\r\nSound:\\n\r\nWhen an opening is so damn catchy you sing it at work and make everybody around you give you weird looks, you've done it right. I usually bitch about random j-pop songs used for anime, but for a show like this, what would be more fitting? Same goes for the ending song, which is almost as catchy. The voice acting is fine, there was no role that I'd say didn't work.\\n\r\n9/10\\n\\n\r\nCharacters:\\n\r\nAre they stock characters? Probably. But that doesn't have to be a bad thing if they are used right and in this case, they are. Akari is so incredibly stereotype that she becomes an effective parody of a main character. Kyouko is a lot of fun, though she can be a bit too much from time to time. Yui is a great straight \"man\" to the madness and Chinatsu is a bitch in sheep's clothing, which is not groundbreaking, but not common enough to be boring. The side characters were likeable too. For some reason I especially liked Ayano, even though I'm anything but a fan of tsunderes (maybe it's because most are just terribly written?).\\n\r\n9/10\\n\\n\r\nEnjoyment:\\n\r\nYuru Yuri was a lot of fun to watch. I liked the comedy, I liked the characters, I liked the pacing and I even looked forward to watching/hearing the opening and ending, which is something I usually don't do. It was a good idea to divide the series into multiple 12 episode seasons, so you can portion it and not overdose yourself with it (what I surely would have done). Absolute recommendation for anybody who's looking for a slice of life and/or comedy anime. I'll only give it a 9 though, because if I DID watch more than 12 episodes in a row, the whole thing might grow stale on me sooner or later.\\n\r\n9/10\\n\\n\r\nOverall:\\n\r\n8.4/10",
            "date": "2016-04-14T09:57:00+00:00",
            "helpful_count": 5,
            "mal_id": 216369,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=216369"
        },
        {
            "content": "You know, when you have a title with the literal translation \"Easygoing Lesbians\", it's kind of obvious what you're going to encounter.  Easygoing as in no serious plot, and lesbians as in yuri central.  With that in mind, let's get onto the actual review because long winded beginnings are stupid.\r\nStory (7.01/10):  The story of Yuru yuri is about our fabulous main protagonist Akari Akuza as she begins her fabulous new journey into middle school with her second year friends, Kyouko and Yui.  At least, that's what I would say if it wasn't for the Akari's lack of presence.\r\nTo be honest, thisstory is nothing new/special.  The idea itself been done MANY a time by hundreds of other animes, and this show is no different.  There's no significant plot, since the whole series is episodic to all hell, and there is no real character development throughout the entire series, since no of the gags or characters actually change in terms of personality or how they act.  This series has the exact same formula as lucky star, Nichijou, Acchi Kocchi, GJ-Bu, Seitokai no Ichizon, etc.  That being said, whenever an anime is one of these slice of life's with no real meat in the story, you have to make it up in comedy, and that is exactly what this show does.\\n\\n\r\nAs I said before, this show has Yuri in it, and a lot of it.  All of it is in a perfectly comical sense, and that's what makes the show different from others.  (Sure there's the Kagami x Konata one in Lucky Star, but that's a non-canon thing.)  Unlike other slice of life shows, the yuri in this is blatantly there, and makes up the show as a whole, seeing as how we have some of the characters attempt to kiss other characters, and the obvious crushes that some of them possess.  \\n\\n\r\nOther then that, the comedy that's not about the Yuri, (mainly Akari's lack of presence), brings the show full circle with its comedy as well, seeing as how I most definitely giggled and laughed when the funny parts showed up.\\n\\n\r\nWhat I like the show as well, is the fact that this anime ended with a bang, literally.  It was that sort of over the top ending that didn't push its boundaries, while doing something completely unexpected.  All in all, while the actual story was nothing to be proud of in terms of originality, the comedy made it up in full.\\n\\n\r\nOverview\\n\r\n+  VERY funny comedy (at least to my tastes)\\n\r\n+  Very blatant and obvious about what it was about\\n\r\n-   Not very original plot point.  (Like this would matter in the long run.)\\n\\n\r\nCharacters (7.75/10):  There is one thing that I think you should know if you're going to watch this.  This series is a Vaganime.  What is that?  It's essentially a term used to describe an entire anime cast, who is female.  Yuru Yuri, true to its name, has zero male characters, focusing mainly on the female gender, and the sexual relationships within said gender.  \\n\\n\r\nUp first is the most important character in the series, Kyouko.  Or, as Ayano would say, TOSHINO KYOUKO!!!  She is the utterly the most important character of the show, due to the fact that she is one of the most sporadic and most random in the series.  The thing is, it works.  Her eccentric personality can only be rivaled to that of Haruhi and Konata, making her the show's favorite.  It is to the point that the show relies on her so much for pulling the show together, that they even make an episode on what would've happened if that personality that basically anyone who watches this show loves, was gone.  Personally, I find her to be quite entertaining and a rather interesting character due to how stupid and awesome she can be.\\n\\n\r\nUp next is Yui, the cool character in the group.  Yui plays as the mature one in the group, always trying to reel in Kyouko from her unnaturally high tangents, as well as being one of the more \"normal\" members of the cast, since there aren't very many of them.  Regardless, she still plays a very good role of being a very good friend towards all of her friends, and supports them for whatever they do, unless it's a stupid thing that you probably shouldn't do.  \\n\\n\r\nChinatsu, as the more moe/chibi character of the show is presented to be that first year that everyone can adore.  She has a HUGE crush on Yui, (remember, this is a yuri show), and does whatever she can to impress her elder and is hopeful to marry her.  Nice to have dreams, ain't it?  Beyond that, I don't really see much in terms of her personality other than resenting Kyouko, but she is a nice addition to this cast.  \\n\\n\r\nNow...before I mention the side characters, am I missing someone.  Hmm...let's see, Kyouko, Yui, Chinatsu...nope don't seem to be missing anyone.\\n\\n\r\nAkari: \"What about me?!\"\\n\\n\r\nHuh?  Who're you?\"\\n\\n\r\nAkari: \"I'm Akari, the main character!  You know, the main protagonist?\"\\n\\n\r\nAkari Akuza is well...a joke, in a good way.  As the first character introduced, as the main character in the series, Akari is the happy-go-lucky girl who starts her middle school adventure.  Only to be shoved to the back of the cast and forgotten.  Throughout the series, she is told by the other characters that she is very...plain, and the fact that she has no real outstanding characteristics, so her presence is sort of, unnoticed.  (Seriously though, there are some members of the SUPPORTING cast that get more screentime than her.)  While I find this quite sad and hilarious at the same time, Akari is more or less that one character that everyone makes fun due to the fact that she goes unnoticed.  (I feel you, Akari)\\n\\n\r\nThe supporting cast in this series is one of the more enjoyable ones, I feel, due to the fact that we have such a wide range of characters that have differing characteristics, and represent different troupes, all of which have their special place in the series.  While some appear so often that they should be considered main, (i.e. Ayano and Chitose), and others that rarely appear and only serve to play a gag or two, (i.e. Himawari and Sakurakou), the supporting cast definitely fits the show's energy and purpose.  \\n\\n\r\nOverview\\n\r\n+  Enjoyable main characters\\n\r\n+  Large supporting cast of various importance\\n\r\n-   Main character turned out to be a creator troll\\n\\n\r\nArt and Sound (7.31/10 and 7.84/10):  The art is very light, colorful, and above all, very moe.  While the art itself is never overly detailed and generally on the white gradient side, the actual art style is one of the more key aspects of the show.  For starters, the biggest thing to note about how this show is moe, are the eyes.  Pretty much every character has these very large, round eyes, and unless you like moe, or don't mind moe, this will probably be your worst nightmare because every character is that cute.  \\n\\n\r\nOn a music note, the soundtrack of this music reflects the show very well, having a very catchy OST that repeats the show's name many, many times, involving an upbeat tune.  So upbeat in fact, that it is one of those songs you will never, ever get out of your head.  (Like Lucky Star or Haruhi.)  The ED was the same thing, just in a different tune and lyrics.  It's still upbeat and happy, much like the show it comes from, and is definitely a plus for the show.  \\n\\n\r\nOverview\\n\r\n+  Nice amount of detail on art\\n\r\n+  Not overly complicated\\n\r\n+  VERY upbeat tracks\\n\r\n-   Extremely moe art style.  (This minus is only for those who don't like moe.)\\n\\n\r\nPersonal Enjoyment (8.88/10):  I admit, I'm a guy, and I enjoyed this wayyyyy too much.  While I was watching this, I really enjoyed how well executed the comedy was, as it was a nice balance between absurd comedy, yuri, and the actual plot line.  Regardless of my previous statement before about the show not having an original idea, I liked this show a lot due to how enjoyable this was.\\n\\n\r\nSlice of life comedy shows are one of those shows that you can watch without any remorse, as you can just watch one episode, and pick up a week later, without forgetting the plot.  Personally, I liked how the series presented itself in a nonchalant matter, and I throughly enjoyed it all the way to the end.  I recommend this series to anyone who wants to just sit down and enjoy a pointless anime without any plot.  A good stress reliever I find.  However, unless you're not a fan of...\\n\\n\r\n- slice of life shows \\n\r\n- comedy shows \\n\r\n- shows without any male characters period \\n\r\n- yuri\\n\r\n- yuri fantasies\\n\r\n- moe\\n\r\n- moe comedy\\n\r\n- or a hyper energetic girl that steals the whole show...you will not like this at all.  (Seriously, if you don't like any of the mentioned things above, this isn't something you'd like.)\\n\\n\r\nOverall score: (7.32/10)",
            "date": "2014-03-31T21:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 138151,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=138151"
        },
        {
            "content": "Before watching Yuru Yuri, I first had to get through the tongue twister title. Ahh, but after that, I was already watching the first Akari~~~n opening. With that said...Hajimaru Yo (始まるよ)!!\r\nLet's begin with those that are learning Japanese  I rate Yuru Yuri a 2/5.JAPANESE LEARNERS (2/5) Easy to Understand)\\n\\n\r\nFortunately, this anime is easy to understand without subtitles if you are at the intermediate or above level, there will be some advanced words or grammar phrases that will actually be used, and you should have no trouble watching this anime without subtitles. If you are a beginner Japanese learner, you will learn a lot of phrases and words without the subtitles so use this anime as an excellent learning tool.\\n\\n\r\n                                                STORY\\n\\n\r\nThe girls want to start a club. They get a club. They get members. The end. That’s the story, but where do does 12 episodes actually take us, though. I like to think of Yuru Yuri as one of those Japanese Cop dramas where every episode is different yet gives us a little bit of a plot. Unfortunately, if you wanted a good story like a Shonen Jump anime, you won’t find one here. However, one should not watch the anime because of that reason alone. Each episode is amazing and unique in its own way. There is one episode where the girls go to the beach and one where they go to a hotel in Kyoto. This is how the anime is presented. Although you won’t get a story, you will get plenty of laughs along the way.\\n\\n\r\n                                               ART/ANIMATION\\n\\n\r\nAh, how I adore cute anime characters. The good thing is that Yuru Yuri is not short of any cutesy-want-to-squeeze- characters. I also love how each character is drawn. They are drawn perfectly to fit their type, except probably Kyouko, who is drawn cute but is a total crazy girl. I will say however not to expect any awesome cgi or whatnot because the animation is typical of your regular slice of life anime.\\n\\n\r\n                                               SOUND\\n\\n\r\nUpon writing this review, the only music I remembered where the opening and ending song and those were pretty darn good. Actually, they were so good that I downloaded the songs. Aside from the theme songs, I didn’t think that any of the anime songs were of memorable nor of any particular interest.\\n\\n\r\n                                                CHARACTERS\\n\\n\r\nLesbians. Lesbians everywhere. This is where this anime truly shines at. The characters all like another character and they show jealousy for each other, which is hilarious.\\n\\n\r\nEach character has her own unique personality. From the clumsy Akari, adorable Chinatsu, and the nosebleed crazy Chitose, we are given a lot of characters to love and hate in this anime. If it wasn’t for these characters, I’m afraid that this anime would have been a disaster.\\n\\n\r\n                                             ENJOYMENT\\n\\n\r\nFunny characters and an amazing opening and ending theme song is what keeps this anime so great in my book.  The story and sound are lacking, but I think that since this anime is a shoujo-ai and slice of life anime, none of those things are particular needed, but they are welcomed. Also, if you know a lot about Japanse culture, then you will most certainly find puns and mimicrys everywhere. I laughed on every episode because of them. If you enjoy any slice of life or shoujo-ai anime and don’t care about the story, I recommend you give this a watch.",
            "date": "2015-11-30T19:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 204541,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5022776.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ghostfromjapan",
                "username": "ghostfromjapan"
            },
            "url": "https://myanimelist.net/reviews.php?id=204541"
        }
    ],
    [
        {
            "content": "Cute comedy! \r\nThis was a great sitcom type show about an all girl cast (really I think there might have been one background guy that mad an appearance in season 2) who basically make their own club and have little interactions with other girls in the school. They develop some \"interesting\" relationships. Overall very light and easy to watch, although season 3 does get a bit touchy/feely, recommend watching all of it if you do decide to take this one on. \r\nSTORY:\r\nWell like I said this is a sitcom there are lot of random episodes like one where everyone just goes on dates and onewhere one of the main characters goes back in time... Some things blow up and some girls have a bunch of fantasies that makes her nose bleed. If you watch all the seasons and start to like all the characters then really the little story that is there will be good enough. I felt like the first two seasons were full of great ideas with funny things happening in each episodes plot. Then once they get to season 3 they find a way to conclude it on a really happy note so you won't be wondering what really happened. A very satisfying feeling instead of the \"omg wtf just happened\" feeling...\\n\\n\r\nART:\\n\\n\r\nCute. Yeah it was really cute the way they made this anime, the reactions of the characters and different personalities and showcased well by the artists. And I really like the colours!! The colours they choose to use in an anime really sets the overall mood and with Yuri Yuri its all bright, cute, girly colours. Each character has a different coloured hair and when I think about the anime I think pink, yellow, light blue, really appealing.\\n\\n\r\nSOUND:\\n\\n\r\nI really liked the songs they choose, I think I must have watched the opening majority of the time since I liked to hear it again and again. Puts you in a really happy mood and sets you up for the show pretty well. All the voices were unique to each character, nothing seemed out of place.\\n\\n\r\nCHARACTER:\\n\\n\r\nThis is what the show is really about! It's like watching Friends or Seinfeld but about a group of teenage girls in a club house who drink tea and do random stuff together. I think its pretty cool looking back on it because they really incorporated so many different personalities of girls into the show. They area all so different that you can associate traits from girls you know to each of them. There are four main characters who are basically a confident tom-boy, a creative, a creepy-cute girl, and a cute-normal girl (with not much presence but everyone likes her anyways). They balance each others personalities really well and then the dynamic between them and the other 5-6 girls in school (and some of their weird sisters makes each episode really easy to watch. I personally like to watch shows because of the characters and their relationships so I think this was a great show because of it.",
            "date": "2019-01-19T09:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 299460,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2828511.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Taylor5wift",
                "username": "Taylor5wift"
            },
            "url": "https://myanimelist.net/reviews.php?id=299460"
        },
        {
            "content": "Akarin! Haaaai~ Yuru Yuri Review Hajimeruzou!\r\nYuru Yuri or Easygoing Yuri is a story about four junior high school girls mostly spending their time in the Amusement Club. What is the Amusement Club you ask? The Amusement Club is where these girls are having fun and mostly do whatever they want. \r\nPretty much like Lucky Star, Kiniro Mosaic, and other Moe-Slice-of-Life animes, Yuru Yuri does not have a deep storyline or eye-gazing character actions throughout the series. What makes Yuru Yuri worth to watch then? As the title suggests, Yuru Yuri will feature some lesbian scenes that is not overly sexualized or anything like that. Thesescenes are pretty cute and funny at times and the character behaviors really shine through to bring us watchers some good comedy.\\n\\n\r\nStory : 7\\n\r\nWith having no deep storyline or anything out of ordinary, I believe Yuru Yuri should get a lower rating than 7. But then again, it isn't quite fair when you compare the story of Yuru Yuri with the story of Sword Art Online, it's like you compare oranges to potato chips. With that being said, I decided to give Yuru Yuri's story a 7 because it just seems the fair thing to do.\\n\\n\r\nArt : 7\\n\r\nThe artwork for the series is okay. Not too much but not too shabby as well which in my opinion is fine for a Moe-Slice-of-Life type of anime. It's colorful at times which is essential for the series.\\n\\n\r\nSound : 8\\n\r\nThe OP and ED songs was stuck on my head for some while. It has a really catchy tune that probably you can sing along before the anime really starts or really ends. It's also really cheerful which fits in the genre.\\n\\n\r\nCharacter : 9\\n\r\nYes, I am a total sucker for moe girls and if you're the same as I am then I'm pretty sure you are going to enjoy it as well. Almost all of the characters inside Yuru Yuri is full of moe and is very different from each other. From first glance, I can already differentiate which girl is which despite having a huge lineup of girls in the series. Some character behaviors are unique or maybe very unique which is really funny at times. \\n\\n\r\nEnjoyment : 9\\n\r\nThe comedy and character behaviors being fresh and new, I really enjoy watching Yuru Yuri and hoped there will always be a continuation of it (which is impossible I know). The moe element also helps me enjoy watching the series over and over. I wished Yuru Yuri would put a bit of reference to other anime though or it would've been perfect.\\n\\n\r\nOverall : 8\\n\r\nYuru Yuri can be confusing if you are pretty new to watching anime, but overall it is a very enjoyable series if you watch them all. For the frequent anime watchers, Yuru Yuri can be one of the anime that brings you a smile and a laugh when things in life gets a bit rough.",
            "date": "2014-04-30T05:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 141829,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2957023.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kappamikez",
                "username": "kappamikez"
            },
            "url": "https://myanimelist.net/reviews.php?id=141829"
        },
        {
            "content": "When it comes to cute girls doing cute things (CGDCT) metagenre, Yuru Yuri is one of the tops. Story, as usual, is pretty much nothing. It's just bunch of cute girls going on about their daily lives. But Yuru Yuri is not failure of enterntainment like almost all others in this metagenre, since it is so funny. One of the very few animes that make me literally laugh out loud every single episode multiple times, it's just golden. Production values are very good, so it is not failing on execution aspect either. As always in this metagenre, characters are the deciding factor since show isbuilt completely around their interactions. And this is where Yuru Yuri steps up the game. \\n\\n\r\nCharacters are actually extremely generic in the sense that every CGDCT has pretty much the same character types. You get the hyperactive idiot, bland sensible girl, big sister type, mild and meek one, and assortment of supporting cast. Such it is in Yuru Yuri, too. It's just that the joke timing, voice acting, expressions and how jokes fit the characters so perfectly. Yuru Yuri avoids the common pitfall of attempting to actually develop the characters or give them surprising new dimensions. It's 100% pure refined fun instead. It is competely unapolegic about being yet another CGDCT and even makes fun of how generic it is by partially driving the stereotypes to brink of hyperbole. That is why they are so good. They completely fit the comedic fun of the show without slipping even once to moralization or some kind of lecturing about life's realities. Simply do away with such things and insert another dose of pure fun.\\n\\n\r\nOh, and one brilliant comedic effect this show frequently uses is showing a side of characters to viewer another character doesn't know, then having those interact in a way where the other character is completely oblivious to the true meaning and intention of another character's actions which viewer of course knows. Confusion and chuckles abound.  \\n\\n\r\nThe title implies some heavy Yuri, and this is where show clearly makes fun of itself. For one, there are no males in the entire show which is a joke in itself. Secondly, yuri action happens only in delusions of one character. The rest of yuri-ness is so completely overboard in hard to explain way, that it simply becomes part of characters. If you are looking for gay girl romance, forget it. Let's just say I ignored this gem of a comedy for long time, expecting just that plus some boring SoL with light comedy here and there. Don't make my mistake: if you want fun times, just go and watch this!",
            "date": "2016-02-23T12:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 211542,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/317171.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/dariken",
                "username": "dariken"
            },
            "url": "https://myanimelist.net/reviews.php?id=211542"
        },
        {
            "content": "I like Yuru Yuri, although I'm not a comedy fan, because it makes me laughs sometimes -I find specially hilarious Toshino Kyoko- and I see all the characters as \"kawaii lesbians\". Also, I think it's great that you can ship anyone with anyone. What I don't like about the show is the ostracism Akaza Akari suffers; I know it's super common in comedies for certain characters to be ignored or bullied without a reason, but I really can't help to hate that.",
            "date": "2014-11-11T03:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 168185,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4246073.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/YURIGRRL",
                "username": "YURIGRRL"
            },
            "url": "https://myanimelist.net/reviews.php?id=168185"
        },
        {
            "content": "Okay, as far as cute goes, this is anime is cuter than a speckled puppy riding a unicorn through toyland.  But does it make for a good anime? Let's find out, this is YuruYuri.\r\nStory: 5/10\r\nDoes this even have a story? Well, yes and no.  It's a slice of life anime, so it follows the lives of a group of middle school girls who join clubs, do club activities, and hang out with their friends.  Now I know what you're thinking: \"This has to be borderline pornography with a title like YuruYuri...\"  Well, it's not.  The moments of yuri that arein it are meant to be comedic and ARE very funny.  It does have a few cliche episodes, which is probably the reason I rated the story a 5/10.  I don't know what it is about anime, but come on, does every anime REALLY need a beach episode!?  Over all, it doesn't really follow a plot, so the story isn't it's strongest aspect, but it doesn't need to be, the characters are what pushed this show forward.\\n\\n\r\nArt: 8/10\\n\\n\r\nWell, I'm a sucker for cute girls, and the art is absolutely adorable.  Sometimes it looks a little weird, you'll know what I'm talking about if you decide to give it a watch.  The colors are bright, and honestly, the character designs made me smile.\\n\\n\r\nSound: 9/10\\n\\n\r\nFirst of all, the OP and ED are AWESOME! If you don't like them when you hear them at first, you will by episode 3 or 4, they grow on you like crazy.  The voice acting is also very good as well. Though Ayano calling Kyoko \"Tashino Kyoko\" all the time sounded a bit weird to me, I can't say I didn't find it cute.\\n\\n\r\nCharacters: 9/10\\n\\n\r\nSince this IS a character drivin show, the characters needed to be intersting in order to keep you entertained, and damn, did it do a great job.  All the characters are interesting and funny.  The four main cast made me laugh so hard half the time it was difficult to read the subtitles.  The supporting characters are all equally as interesting and even getting an episode or two dedicated to them.  In my personal opinion, it's the main cast's relationships with the supporting characters is what made them all so memorable.\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nNow, I enjoyed every single second of this show from begining to end.  When it first started I figured it was going to be another slice of life anime that went through all the regular cliches.  Don't get me wrong, this show has a few of the cliches in it as well, but every episode is hilarous.  I pretty much marathoned this (you'll notice I finished it within 2 days) because I couldn't stop watching it, only thing stopped me from marathoning it all in one sitting was the fact that I had to get up for work.  This show was a great ride and I was hooked from the first episode.\\n\\n\r\nOverall: 8/10\\n\\n\r\nAll in all, if You like SoLs this will probably find it's way into your favorites.  The story, or lack there of, is entertaining, and the characters are hilarious.  Honestly, I'd highly recommend you give this show a watch.  It truely is, in my opnion, what a slice of life anime should be.",
            "date": "2012-04-12T19:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 58643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1142457.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ImPico",
                "username": "ImPico"
            },
            "url": "https://myanimelist.net/reviews.php?id=58643"
        },
        {
            "content": "This review will be covering BOTH seasons of the series\r\nI sat around thinking for a while how I'd go about writing a review for Yuru Yuri, or in that case, any slice of life moe series.  When it comes down to it, they're all the same thing.  A bunch of girls run around doing school stuff and being friends.  A-Channel, Lucky Star, K-On!, and those are just the main ones.  It's then when it became obvious that the reason one mainly enjoys these kinds of series is the characters and their interactions with one another.  So far, I feel YuruYuri portrays these interactions better than any other series in this genre.\\n\\n\r\n-  In terms of the story, there isn't a whole lot to say.  If you've seen a slice of life moe series, then you already know exactly what to expect.  Cute days at school, cute days going out, cute days at the beach, and all that fun stuff that you absolutely love in this genre.\\n\\n\r\n-  The art in Yuru Yuri has to be one of the best I've seen in the genre.  There weren't any points when I felt the animation was being lazy.  All of the characters were animated beautifully and were full of movement, especially Kyoko of course.  I didn't once see an image that made me feel as if they were taking the cheap way out.\\n\\n\r\n- The music that's played throughout the series doesn't entirely stand out, with the exception of the character songs that play during the commercial cutaway point in the middle of each episode, and the Opening and Ending songs for both seasons, ESPECIALLY season 1's opening song which is one of the catchiest songs I've EVER heard. \\n\\n\r\n- The characters are definitely what make this series worth watching.  Each character has their anime stereotype trait, and they play their parts perfectly.  there's the hyper one, the cute one, the mature one, the tsundere one, and so much more.  The interactions between the characters are very funny and to be honest, this is the only series (other than the currently-airing Watamote) to make me actually laugh out loud, and that's thanks to these characters having excellent dialogue and getting themselves into hilarious situations.  My favorite interactions are usually between Ayano and Kyoko, which often results in Chitose removing her glasses and having a yuri fantasy about the two of them, which always gets a great laugh.\\n\\n\r\n-The enjoyment factor of this series is very high.  Comparing it to other Slice of Life moe series, I must say, the amount of jokes that this series throws at you is very high, and a majority of them hit bullseyes.  Compared to series like K-On! or A-Channel, where the jokes aren't highly consistent throughout the episodes, if you're looking for something that's straight up comedy and nothing else, this is it.\\n\\n\r\nOverall, this anime scores high across the board for me.  It offers fun episodic stories with incredible visuals, catchy music, fun, adorable characters, and the addictive-ness to keep you watching more. I say this series is certainly deserving of being one of the best Slice of Life moe series out there and highly recommend it to anyone who loves cute anime girls, comedy, and fun.",
            "date": "2013-07-21T04:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 106197,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2880643.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/trunk10",
                "username": "trunk10"
            },
            "url": "https://myanimelist.net/reviews.php?id=106197"
        },
        {
            "content": "Al principio creí que era un anime yuri por el nombre, de hecho, lo comencé a ver por que estaba buscando animes yuri para ver, pero me encontré con una agradable sorpresa, un anime relajado de recuentos de la vida con toques de comedia y yuri ligero, cada personaje es muy agradable y te encariñas con cada uno de ellos, en especial la protagonista, que aunque dice no tener atención en el anime, es uno de los mejores personajes por sus reacciones ante las cosas que le suceden, seguida de el resto de los miembros del club de te y sus locuras, la primera ysegunda temporada son las mejores.",
            "date": "2018-09-27T20:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 290212,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6909499.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EzaguiDark",
                "username": "EzaguiDark"
            },
            "url": "https://myanimelist.net/reviews.php?id=290212"
        },
        {
            "content": "Yuru Yuri is a must for those who like cute slice of life comedies and just love to watch a bunch of girls enjoy their afterschool together; it would probably not add anything new to your experience of this genre (except for a big and actually entertaining love polygon), but it won't fail to make you giggle during all the 12 episodes.\r\nThe story, as always, is very simple: the four girls that compose the (unofficial) Amusement Club hang out in the club room, visit each other's houses, go to the beach, have fun with the girls from the student council, etc...; the characters are alsopretty standard, with the exception of Akari as the protagonist with no presence whatsoever, a fact that's paradoxically remarked constantly throughout the series, even in some \"break-the-fourth-wall\" instances. What is particular about Yuru Yuri and adds quite a bit to both story and characters is in fact the yuri announced in the title, which touches nearly everyone and affects nearly every relationship in the show: probably in real life this long chain of crushes (Chinatsu loves Yui, Kyouko loves Chinatsu, Ayano loves Kyouko and so on) would destroy the group but here its presence actually strengthen the bonds among the girls; there is a slow but steady evolution in the show where everybody gets gradually closer to each other thanks to it, although it's probably better executed in later seasons where for plot reasons the \"improbable couples\" episodes are more frequent, but anyway it's evident that all of them simply really like to spend time together despite and/or thanks to all the different love interests within the group.\\n\\n\r\nOn the technical side, the art is good and all the characters are drawn cutely, as expected from this type of anime (and they sure were good at creating the horrendous Chinatsu drawings, it has to be said, they were genuinely terrifying); the background music is ok, nothing special, and the opening song is quite catchy.\\n\\n\r\nIn the end Yuru Yuri is a very good choice if you're entertained by cute girls doing cute things and you're not annoyed by girl love, of which you'll have plenty, I can assure you.",
            "date": "2016-02-21T02:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 211359,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4669530.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bernstein",
                "username": "Bernstein"
            },
            "url": "https://myanimelist.net/reviews.php?id=211359"
        },
        {
            "content": "To say Yuru Yuri should be taken seriously, is like telling a vegetarian to eat at McDonald's. Yuru Yuri is not just over-the-top, it's completely mad with a side order of bonkers. What I'm getting at, is that Yuru Yuri is insane, and that's exactly what it needs to be in order to stand out.\r\nYuru Yuri is about four girls who take over the tea club room at an all-girls school because nobody uses it anymore and hi-jinks ensue. Before you write this off a moe Haruhi rip-off, I will remind you that Yuru Yuri doesn't have a story so messy that it makes whata tornado does look like the work of a Cleaning-Nazi, or much of a story at all. The description I gave you is the extent of the plot, and is really more of a set up to the events that happen throughout. The story really works, because it fucks around at any and all given opportunities. The title is the first sign, because anything that has \"Yuri\" in the title, aside it being straight-up hentai, is not going to have any serious cards in its deck. If that doesn't do it for you, then allow me to tell you, the second joke in the series is a Big-Lipped Alligator Moment. Now, when you pull one of those that early in the series, that says you're not fucking around when it comes to fucking around.\\n\\n\r\nThis series is all for fucking around, and that's exactly why it's worth watching. It's a series that's trying to make you laugh, and each attempt is so over-the-top, and well-executed, that you can't help but laugh. The best part of it, is most of the jokes are self-aware and self-parody, and it's all so insanely cartoon-ish that you just know to not think about this in a serious  light, because it certainly isn't. It also uses irony to its advantage, the biggest example I'll get to later, and it's not smug about it, rather it's just as loopy as the rest of the humor. The jokes are so unpredictable and immersive that, even though you think it can't get any funnier, it somehow manages to do so, so basically Yuru Yuri is to fucking around what Serial Experiments Lain is to fucking your brain.\\n\\n\r\nThe thing about the story is, it's not afraid to evolve itself either. In the midst of its humorous crusade, it looks at itself and decides to mix up the formula a bit. It takes its humor to new heights, even including some dark humor near the end, so the characters aren't the only ones experimenting in this anime, the anime itself experiments with itself as well, which means that you are allowed into the science lab when you're residing in the loony bin, despite not getting access to any of the sharp tools. The best example of this is in the second-to-last episode, where one of the characters is out of character because they hit their head and doesn't sexually harass a character she usually does, and the other character gets upset about it. \"Wow\" I thought. \"Not only is this some seriously funny shit, this is some good characterization.\"\\n\\n\r\nThe characters themselves are just as crazy as the story, more-so perhaps. They're each a style parody of characters of the genre, and are willing to take whatever joke they have to its new extreme. You could say a lot of the humor comes from character interactions and implications that are blown out of proportion. As established already, there is yuri in the show, if the title didn't tip you off, but it's not perverted, as much as it is both adorable and fucking hilarious. The humor keeps moving to more levels of funny, but it never loses its charm, and that's why it works. However, sexual orientation jokes are not the only ones the characters partake in. There are a lot of jokes about the character's main traits that are funny in more ways than one. Now, the biggest irony in the show deals with the main character, Akari. She is the butt-monkey of the series because the rest of the cast always point out she is not a very memorable character, making her one of the more memorable characters in the show, making each joke all the more funnier. The entire cast is very well-developed, and well-characterized and are willing to make jokes that characterize the series.\\n\\n\r\nSo far, I have been saying good things about this show, but what about the bad? Well, for starters, the music and art are seemingly generic. The art especially has this problem, because it has just decent backgrounds and decent character designs. Now, I have said mundane artwork works with series before, but that's not the case here. They worked, because it reflects the nature of the show's normality, and there's nothing normal about Yuru Yuri. It just feels like it could have tried harder in the art department. As for the music, it mostly feels unimportant. Yes, it's very good, but it doesn't feel like it wants to be noticed. That is, aside from the catchiest opening theme this side of Working!!, thanks in part by the studio that made it Dogakobo, who only other previous work I've seen (Myself;Yourself) also had a very catchy opening. The ending is also quite good, though not as catchy as the opening.\\n\\n\r\nThe story also has some problems. You see, while it's not afraid to experiment with what it has and reaching new heights with it, it is afraid of expanding to new territory. It feels like it only wants to parody the specific genre it's in and hardly anything else, and I feel an opportunity was missed to  gain more jokes out the whole experience by limiting the material it parodies to what it knows. Though, I suppose if the nice people who help you at the asylum won't let you near the pointy objects, asking for a bulldozer to expand your territory is really pointless. Another thing about the story I don't like is the habit of bringing up plot points and then never mentioning them again, or in layman's terms, having too many Big-Lipped Alligator moments. Don't get me wrong, I love a good Big-Lipped Alligator moment, but this series abuses how many one can have before it starts to get irritating. Still, this doesn't have a very big effect on the rest of the story, and you can still enjoy it all, but it is quite bothersome at some points.\\n\\n\r\nOverall: Yuru Yuri is fun and enjoyable. The amount of self-parody is uncanny and in good proportion. If you're looking for something mindless and funny, than this is it. Yuru Yuri really knows what it is, and what it is, is totally, mouth-breathingly, paste-eatingly, chasing the girls around the playground with a piece of pooingly stupid. And I wouldn't have it any other way. 8/10",
            "date": "2012-04-10T18:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 58495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/444190.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/VGCKenny",
                "username": "VGCKenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=58495"
        },
        {
            "content": "Since its an average anime i will give an average review :P\r\nI mean this anime story  wise is only parodies upon parodies and the shoujoai or yuri esc about it is same no matther how deep i go into the story. Its forgettable and only have some highlights that you might remember. \r\nart and sound nothing special really the entire music was pretty boring imo. \r\nI mean i didnt feel any connection of fun with many of the characters. \r\nI mean Toshino kyoko is fun at times but she never really change in any way or show anything else and the same goes forthe rest of the cast the love some characters have for each other is very plain eventhough they try their best to seduce or push themselves on eachother but it feels like there is nothing there in anyway. \\n\\n\r\nI mean i could have watched this anime  very randomly and i dont feel i had lose much by skipping one or two episodes it the story is just filled with parodies and cliches that it gets old and boring as the anime goes. \\n\\n\r\nI might be picky but nothing about this anime gives me a need to rewatch it in anyway its a one time there i watch it and think ok but i dont think i will remember much other than random parodies and characters who rarely shows progress. If you need a random yurish/shujoai anime this might be one for you but i dont want to get peoples expectations too high",
            "date": "2017-07-17T16:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 253096,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5327546.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Geddon616",
                "username": "Geddon616"
            },
            "url": "https://myanimelist.net/reviews.php?id=253096"
        },
        {
            "content": "Yuru Yuri is one of the best slices of life i've ever seen, my second favourite in fact. The comedy is super hilarious. It will ALWAYS crack you up. The art-style is super moe and the characters are amazing, each one of them is super lovable and they all have their own perfectly defined style. regarding the plot, well it's what you would expect from a slice of life anime, but this one takes a lot of continuity to all the events that occur during every single episode and the newest season is really developing the yuri factor that wasn't quite used how it should'vein the first two seasons.\\n\r\nEven if you don't like moe stuff, you gotta check Yuru Yuri out, you'll legit laugh until your lungs stop working.",
            "date": "2015-12-17T11:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 205820,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4984274.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KomanoOhta",
                "username": "KomanoOhta"
            },
            "url": "https://myanimelist.net/reviews.php?id=205820"
        },
        {
            "content": "I really liked this series, but my only complaint is the romance. I was hoping there wouldn't be so much romance, but if you are looking for a cute & funny slice of life anime and don't mind the romance, then you might enjoy Yuri Yuri.",
            "date": "2013-02-24T14:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 87791,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2223219.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kiyyep0ny",
                "username": "kiyyep0ny"
            },
            "url": "https://myanimelist.net/reviews.php?id=87791"
        },
        {
            "content": "My rating is dependent on my enjoyment of Slice of life comedy's.\r\nYuru Yuri, is similar to most Slice of life animes centralised around girls. But the thing that made it unique, was that it doesn't focus on a single group. Instead it focused on 2 groups, and gradually introduces new characters who are all quite interesting in their own way.\r\nI also enjoy how similar some aspects are to Danshi kokosei no Nichijou, Like the would be protaganist becoming less and less important.\r\nThe Characters are all quite interesting and weird. Kyouko was definately funny and enjoyable to watch. Chitoses Fantasy modes are funny. Even Chinatsu whoI thought was going to be annoying, ended up being quite entertaining.\\n\\n\r\nThe art style matches the characters, and the voice acting is pretty good.\\n\r\nI enjoyed it alot and had moments where I was laughing so hard my stomach hurt. \\n\\n\r\nOverall I enjoyed it to the max.",
            "date": "2013-03-18T06:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 90075,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/179801.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shintai88",
                "username": "shintai88"
            },
            "url": "https://myanimelist.net/reviews.php?id=90075"
        },
        {
            "content": "Story (8): This is the story summed up: 4 middle schoolers who hang out in a tea room and have fun. If you like Lucky Star, you will also like Yuru Yuri.\r\nArt (9): Although there is no shading, the lineart makes up for it by, like, a lot. The artist draws hands amazingly.\r\nSound (8): The themes are just as cheerful and fun as the anime itself, and the voices match the characters' personalities perfectly.\r\nCharacter (10): The characters have cute designs, and none of them are Mary-Sues (a female character who has absolutely NO flaws and everyone love her. You won't find any in Yuru Yuri.).\r\nEnjoyment(10): I like that how each episode is similar yet different. Also, I enjoy the preview that one of the characters gives a preview for the next episode at the end of each episode.\\n\\n\r\nOverall, I give this anime a 9 and I recommend it! :D\\n\\n",
            "date": "2013-05-11T15:01:00+00:00",
            "helpful_count": 0,
            "mal_id": 96749,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2550127.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nomnom210",
                "username": "nomnom210"
            },
            "url": "https://myanimelist.net/reviews.php?id=96749"
        }
    ]
]