[
    [
        {
            "content": "Ah... the final installment of Jigoku Shoujo.  Sadly, all good things come to an end, but some ends are uglier than others.\r\n*If you haven't seen Futakomori (season two), stop reading now and watch that first.  If you haven't seen Jigoku Shoujo (season one), why are you even here?\r\nMitsuganae is like a monkey on a unicycle:  At the beginning, it looks cool and interesting--until you realize it doesn't make much sense (plot holes and discontinuity issues).  But then, the monkey starts throwing its poop at you.  Then (starting at episode 13), it starts using its tail to try to clean thepoop off your face.  Finally (starting at episode 20 or so), the monkey takes you out to a 5-star restaurant to apologize.  It gets better and better until you finish off with an amazing dessert.\\n\\n\r\nIf that analogy didn't make sense to you, try this simpler one:  It's like Obama's bailout, except it actually works.\\n\\n\r\nSo I'm gonna mix things up and only talk about the first 12 episodes; I'll just call them \"The 12\" for simplicity's sake.  ***BE WARNED:  This is a wall of text, but it's a very important wall of text.***  To put it bluntly:  They are terrible.  The characters are SO retarded they seem to be participating in some unspoken contest to see who can collect the most drool in a bucket.  I think they all played together in the same idiot ball pit as kids.  \"The 12\" has the most instances of facepalm-tastic plot-induced stupidity I've ever witnessed.  And that's saying a LOT.  People seem to find the most retarded reasons imaginable to send someone to Hell.  This isn't aided at all by the fact that characters regularly make the absolute dumbest decisions imaginable in any given situation, and tiny communication failures seem to have catastrophic consequences.  There are times when it's impossible to tell who of the two at conflict is actually worse; both seem they could be worthy of going to Hell.  There's a scene that gets repeated over and over again (that I won't spoil) that reminds me of the sequence from Darker Than Black: Gemini of the Meteor (in concept, execution, and repetitive, redundant usage) where Suo's gun appears from her necklace.  Well, if you've seen that, make it like 8 times longer, 10 times more disturbing, and a hundredth as meaningful, and you have what I'm talking about.  In episode 12, when a target is being tormented, the scene is done entirely with real-life paper cutouts.  I felt like I got trolled.  Also in said episode are not one, but TWO nose bleads (you know what I'm talking about).  The torture sequences are now nothing more than some ball-tripping sequence; nothing worse than some pothead would see.  They are absolute jokes, and any suffering the victim seems to be going through is contrived BS.  Most people would probably just be laughing and/or confused.\\n\\n\r\nEpisode 1 is important only for setting the stage.  The rest of \"The 12\" are complete shit and I HIGHLY recommend you skip them.  You'll be saving yourself time and, if you liked seasons one and two, tears.  You won't miss anything at all.  The only good parts are the occasional comical narcisstic moments from Ren and Wanyuudo.  Episode 13 is where things actually start getting interesting.  I swear they had some mentally unstable director during \"The 12\"; the series would be so much better if they just didn't exist.\\n\\n\r\n-------------------------------\\n\\n\r\nNow that that's over with, let's talk about the REST of the series, where things start to actually get good.  (This portion IGNORES \"The 12.\")\\n\\n\r\nStory: 9.  Being forced to believe WITHOUT EXPLANATION that Ai is back to continue during her job, even after the events at the end of Futakomori, is pretty hard.  But once you get over that, it's actually really interesting--although again, it isn't majorly developed until the end (the last 7 episodes this time).  During these 7, it slowly escalates until it crescendos in an explosive conclusion, and it's INSANELY entertaining.\\n\\n\r\nArt: 9.  Mitsuganae improves upon the previous two installments yet again with quite crisp, clear, and fresh-looking visuals.  But some scenes--which happened to coincide with critical plot development--were simply breath-taking.  Motions are animated pretty well, bar a few exceptions.\\n\\n\r\nSound: 8.  Still a great OST, just as before: some classic oldies, some remakes, and lots of good new stuff.  However, the OP and ED tracks are pretty mediocre comparatively speeking.  Voice acting is still good as always.\\n\\n\r\nCharacter: 8.  I really like Yuzuki and her back story, but at some points, she seems to function solely as a moe-blob (just tilting her head and making soft moe noises, like \"eh?\").  Some of the characters are pretty stupid sometimes.  Pretty good character design overall, even though some of them look like familiar faces from the previous two seasons.  We also get Yamawaro's back story (the newbie in Ai's gang).\\n\\n\r\nEnjoyment: 9.  Most of my enjoyment stemmed from the plot and character (Yuzuki and Ai) development this time.  I was disappointed by the lack of torture sequences of people being sent to Hell, but sometimes, it was okay, because the person being sent sometimes didn't deserve it at all.  (I think this was why.)  I was disappointed at the inclusion of some unnecessary Yuri fan service scenes.\\n\\n\r\nOverall: 8.  See below.\\n\\n\r\n-------------------------------\\n\\n\r\n\"The 12\" made it automatically lose a point.  It should've taken off more, but the final 7 episodes are REALLY f***in' good.  (Is my bailout analogy starting to make sense now?)  Basically, they try to fix the shit you'd been forced to eat so far at the end.\\n\\n\r\nThis series seriously had the potential to be a 10.  Easy.  It could've easily topped the last two seasons.  But it was severly hampered by \"The 12,\" major plotholes (that could've at least been hand waved with some explanation), and... well, lack of explanation--especially of plot-critical points.\\n\\n\r\nAll in all:  If you liked the first two seasons, I recommend this BUT, skip episodes 2-12.  If you choose not to... well, I warned you.\\n\\n\r\nAnd now, the decision rests with you~",
            "date": "2011-12-20T01:09:00+00:00",
            "helpful_count": 72,
            "mal_id": 49627,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557765.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DraconisMarch",
                "username": "DraconisMarch"
            },
            "url": "https://myanimelist.net/reviews.php?id=49627"
        },
        {
            "content": "Maybe not as good as Futakomori, but still a must watch for every fan of Enma Ai.\r\nThe story is pretty much similar to what we have seen in the two previous seasons, people are being sent to hell and hatred is released, though this time hatred gives birth to more hatred.\r\nThroughout the season it can be noticed that the creators have decided to use the ideas the fans found rather pleasing in the past. Once again someone tries to make a stand against the jigoku tsuushin, similarly to what has happened in the first season of the series. While new characters are introduced stories abouttheir past are told to eplain their bonds with Ai, this has already been ecountered in Futakomori.\\n\\n\r\nThere is however something fresh about the series, the element of possesion. It is not only an interesting concept, but it plays a vital role in the story throughout the season and builds up the tension until the very last episode.\\n\\n\r\nUnfortunately, what seems to be a great material has it's downside. Some of the grudges people hold against each other are simply speaking too typical and therefore boring. While watching some episodes I actually had the feeling that they were nothing more than mere fillers, which had to be squeezed in so that the series would be 26 episodes long.\\n\\n\r\nArt-wise, we get the same old esthetic and mysterious animation as before, which perfectly fits with the nature of the show as well as the score playing along. In one episode though we get even more than that. While watching the finale one might say that the creators have implemented an inexplicably eccentric idea into the show. The effect is awkward, but it gives you something new to look at therefore adding value to the experience.\\n\\n\r\nWhat I found the most pleasing aspect of season three is the sound. Although when it comes to opening themes I preffered SnoW, the music in Mitsuganae is outstanding! It fits the feelings which play a crucial part of the show more than ever before. Some of the themes are actually worth listening to even without the video and voice play.\\n\\n\r\nThe newly introduced chracters are great, they are intresting and as a viewer I was actually interested what was going on in their minds while watching the series. I was pleased to see how the bond between Ai and her companions thightens. The single-episode chracters were pretty well designed as well, some of them were pitiful, others scary. Several however were completely forgettable and tasteless like a bad meal.\\n\\n\r\nOn one hand, Mitsuganae combined all the best ideas of the first two seasons. On the other, some of the typical strictly grudge based episodes were not as entertaining as in the past.\\n\\n\r\nMitsuganae is a must watch for every fan of Emma Ai. For the rest, it's a good, or maybe even very good, way of wasting some spare time, while waiting for the next episode of your favourite series.",
            "date": "2009-06-29T14:07:00+00:00",
            "helpful_count": 61,
            "mal_id": 16254,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/naganje",
                "username": "naganje"
            },
            "url": "https://myanimelist.net/reviews.php?id=16254"
        },
        {
            "content": "I'll be straightforward. If you loved futakomori, don't watch this one. It would be very dissapointing, referring to the plot and the story of course. The cases are not that intriguing, relevant and amusing this time around. And the main plot is just not as good as the one in its prequel. But still, the sound and art is great. And you still get to see the lovely enma ai. Try watching it if you want to see enma ai that badly. But do not even try if you don't want to keep comparing it to it's past seasons.",
            "date": "2010-05-20T17:06:00+00:00",
            "helpful_count": 35,
            "mal_id": 26236,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/meikira14",
                "username": "meikira14"
            },
            "url": "https://myanimelist.net/reviews.php?id=26236"
        },
        {
            "content": "Story:\r\nBasically the frame of each episode is the same as season 1 and 2 *people sending other people to hell*, but the new twist of Ai being reborn with Yuzuki as the medium is very interesting. It get's interesting with every episode because it unfolds the deeper story of Yuzuki's involvement with Ai.\r\nArt:\r\nEffects are basically the same as 1 and 2 but I love Ai's new kimono. The effects of it is really great. Opening and closing vids are amazingly colorful.\r\nSound:\r\nTiming and choice of sound effects add the eerie effect at key points of the story. Making you anticipate something coming.\r\nCharacter:\r\nThough old characters retained theirpersonalities, they have matured more, especially Ai, and how she depicts herself. Kikuri, have had a major change of personality, she is no longer the manifestation of the Lord of Hell, with a body borrowed from a toy *based on episodes watched*. Kikuri, now has a CHILDISH character. Though for me, with 3 episodes to go. Kikuri's personality is still bound for change. A new addition to Ai's disciples is Yamawaro who's origin is hidden from the start, though it is shown that he is very submissive to the very annoying Kikuri.\\n\r\nYuzuki, the girl whom Ai was reborn is a character who's the center of Mitsuganae, why and how is she deeply involved with Jigoku Shoujo and the Jigoku Tsushiin is what you have to watch for in Mitsuganae.\\n\\n\r\nEnjoyment:\\n\r\nVery enjoyable, though some episodes are plain and boring. You can always get enjoyment from the very annoying Kikuri *why I keep saying Kikuri is annoying is what you have to find out for yourself :)*.\\n\\n\r\nOverall it gets a rating of 8.6, I would definitely recommend that you watch this.",
            "date": "2009-04-13T05:21:00+00:00",
            "helpful_count": 32,
            "mal_id": 14105,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/154872.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mrsjunmatsumoto",
                "username": "mrsjunmatsumoto"
            },
            "url": "https://myanimelist.net/reviews.php?id=14105"
        },
        {
            "content": "Quick Review (For lazy readers!):\r\nThinking back to the time I watched the other Jigoku Shoujo seasons, I guess this was the one that took me the longest to finish. I just didn't feel like it, and it seemed worse than the other 2.\r\nYou can probably get bored of it, after all it is really similar to what we have seen so far. The last episodes were pretty good though.\r\nA- for fans, and probably an C+/B for other people watching it.\r\nWorth watching. Overall: 8/10\r\n------------------------------\r\nStory (6/10):\r\nThis is surely the worst season of the 3. The story was not BAD, but it was rather boring because you mostlygot more of the same: People make bad stuff, People get frustrated about it, People get sent to hell. I think I could make it a 7, if the anime was 13 episodes long, but 26 was just too much. The reasons to sent people to hell were also really plain, and you mostly knew who would send who after watching 2/3 minutes of each episode (Except for some rare occasions).\\n\\n\r\nArt (8/10):\\n\r\nI guess I like JS' art a bit, but some times I get the feeling that some characters look retarded. About the backgrounds and so on, I have nothing to point out; they were good. The production quality was good in my opinion, and if you watched one of the other season, you already know what to expect.\\n\\n\r\nSound (9/10):\\n\r\nThe biggest score I gave to JS3 was in the sound department, because I simply love it. It fits the series, and what is happening. You never feel like the music is in the wrong place. The OP was really good in my opinion, and the ED, even though it wasn't one that I like really much, was good for the series it was in.\\n\\n\r\nCharacter (7/10):\\n\r\nYou already know almost every one that appears in this series from the last 2 seasons, and there was not much of a improvement over what we knew before. Enma Ai was great once again, and her servants remain the same they were before. The characters we were introduced to were bland, and some of the older characters also get some new personalities. You'll understand once you see them.\\n\\n\r\nEnjoyment (7/10):\\n\r\nAs I already stated before, the series was really boring and repetitive, so for the most time I wasn't really interested in it. I mostly kept on watching because of two things:\\n\r\n1st: I try to never, EVER, drop an anime unless I really hate it. Some of my favorite animes were almost dropped, so I don't drop anything anymore [Higurashi no Naku Koro Ni...]\\n\r\n2nd: The other 2 seasons left most of the plot developments to the 2nd half, so I was waiting for them to appear. It took a little more time than I expected though....\\n\r\nAnyway, I'm glad I did keep on watching it, because the ending was quite good. But it wasn't always that interesting thanks to bad reasons to send people to hell, and a lack of plot (most of the time at least). If you loved the other 2 seasons though, or if you just like seeing people go to hell and/or the bad of society, you can probably make this a 8 or a 9.\\n\\n\r\nOverall (8/10):\\n\r\nAs said in the Quick Review, this was probably the worst of the 3 seasons. It wasn't as good (plot-wise) as Jigoku Shoujo Futakomori, and if feels boring compared to the 1st season. Also, most of the time, people were sent to hell for 'no reason'. I guess that it would be better if the series was shorter... =)",
            "date": "2009-05-07T11:11:00+00:00",
            "helpful_count": 26,
            "mal_id": 14858,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/12212.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Fye_DX",
                "username": "Fye_DX"
            },
            "url": "https://myanimelist.net/reviews.php?id=14858"
        },
        {
            "content": "First of all, I would like to thank you for reading this review because you actually took time to\r\nread this post. :) \r\n\"Would you like to try dying once?\" - Enma Ai\r\nOkay, so I recommend that you would watch this series chronologically. By that I mean from Jigoku Shoujo -> Jigoku Shoujo Futakamori -> (finally) Jigoku Shoujo Mitsuganae. It should be in this order for you to understand the story of Enma Ai and her job as Jigoku Shoujo.\r\nThis season in particular, has the most messed-up characters because of the reasons why they send\r\nthe people who they hate \r\n-SPOILER ALERT- \r\nEPISODE 4 = that boysent his \"hero\" to hell because he wasn't able to live up to the \"hero\" title. LIKE SERIOUSLY. WATDAHELL. it's not his fault you know -swt-\\n\\n\r\nAnywho,\\n\\n\r\nThe series is really worth watching in my opinion, because it continues on the story of Enma Ai.\\n\r\nI also read one of the reviews and that reviewer typed that you shouldn't watch episodes 2-12 because it's a complete waste of time. But YOU SHOULD REALLY WATCH IT BECAUSE it really is worth the wait. Like I did.  It wasn't as bad except for Episode 4. Though in episodes 1-14, it was \\n\r\nreally painful for me to watch Enma Ai coming out of Yuzuki, that must've hurt.\\n\\n\\n\r\n* mwatch \\n\\n\r\nepisode 25\\n\\n\r\nI SWEAR. THIS EPISODE MADE ME CRY LIKE AN EPISODE FROM CLANNAD AFTER STORY. Like WOAH. And this is really the episode that would make you remember the 3rd & Final season of Jigoku Shoujo. \\n\\n\r\nSo thank you people ( if you'll ever read this ) and to the creators of JIGOKU SHOUJO. without you, I would've never watched this anime ( well duhhh that's why they made it for people to watch it )\\n\\n\\n\r\nI LOVE JIGOKU SHOUJO & I HOPE YOU'LL LOVE IT TOO. :)",
            "date": "2012-05-04T12:02:00+00:00",
            "helpful_count": 14,
            "mal_id": 60501,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/308881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/gdjdelacruz",
                "username": "gdjdelacruz"
            },
            "url": "https://myanimelist.net/reviews.php?id=60501"
        },
        {
            "content": "Enma Ai has really gotten creative this time. She has resurrected herself in a young girl, Yuzuki Mikage. This season's people who sent people to Hell, and people who get sent to Hell are very interesting. But pointless. Most people that get sent to Hell don't deserve to, in this season of Jigoku Shoujo. Most of the people who want to send a certain person to Hell is just jealous, or doesn't like how they do things. It's never for the right reasons. Except for Episode 5, whereas the person actually deserved to die.\r\nStory: Most of the people who want to send a certain personto Hell is just jealous, or doesn't like how they do things. It's never for the right reasons. Except for Episode 5, whereas the person actually deserved to die. The stories are basically mostly the same, and if you look closely, you could see similarity between Jigoku Shoujo, Jigoku Shoujo Futakomori and Mitsuganae. Of course, they all want people to die, but seriously, it's all mostly the same thing. Basically. Like in a picture, the outline of it would be the same, but if you add some meat and colour to it, I'm sure it's going to be a different picture.\\n\\n\r\nArt: The art is the same, too. Many of the girls look similar, but I guess it's the author's style of drawing. The art is nice, anyhow. I like the distinct features of the kids, and of the little girl. (The one with big eyes who helps Enma Ai? Her name?) She's a cute and unique girl who has a great personality. \\n\\n\r\nSound: Uh... I never could judge the sound, but the music is great. Gives a creep and eerie feeling to the anime.\\n\\n\r\nCharacter: They're great, let me tell you! Yuzuki is cool, and shy, she reminds me of all those typical, shy, anime girls. But, Itsuko is my favourite! She is energetic, but she is also quiet at times. She can be serious, and she is Yuzuki's best friend. The other characters, like Ren, are awesome, too. They are funny, and good-hearted, even if they are working for Hell. Totally different from what'd you expect from Hell's descendants. The other ones, the victims and the suspects, they really show the bad side and good side of people; especially when they use Jigoku Tsuuchin. It shows that even the shiest, quietest of people can hold a grudge. It shows that everyone has a rebellious side to them, no matter how good-two-shoes they are.\\n",
            "date": "2008-11-15T19:09:00+00:00",
            "helpful_count": 13,
            "mal_id": 9519,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/114594.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/REVERIEExx",
                "username": "REVERIEExx"
            },
            "url": "https://myanimelist.net/reviews.php?id=9519"
        },
        {
            "content": "Hell Girl is one of my favorite anime of all time, it was a nice change of pace from your typical shonen or comedy show and it really did a great job at showing the cruelty of the world. Now, I never really brought myself to see the sequels to it until this year, so I had no clue of how it was altogether. Now that I have done so, I can come to a final critic about the series in general, but I'm not someone that does anime reviews, at all. However, this season was so \"special\" I just had to give it sucha privilege.Both sequels have a subtitle instead of simply calling it Hell Girl 2 and 3, those being “Two Mirros” and “Three Vessels”…. You know, I just noticed it seems they purposely chose the number of items in the subtitle purposely based on it’s season. What would they call the fourth season if it was ever conceived, four seals? Anyways, the season that I’ll focus on reviewing is the latest, “Jigoku Shoujo Mitsuganae” or 3 Vessels. \\n\\n\r\nIf you know Hell Girl well, then you’ll notice there’s not a clear main point, there are plenty of cases but they rarely ever connect, the closest you’ll get to a plot point is the beginning with this new girl whose name I can’t remember, but we’ll get into the characters later. It all stars with the closest thing to an antagonist in the previous season, Kikuri, calling Ai Enma assistants to reunite as “she’s returning” as she puts it. You see (spoiler alerts) Ai was killed in the end of the previous season, something that made for a pretty good (although sad) conclusion to the series, which already makes a sequel pretty pointless, but it seems we still got it regardless. Ai lost her body, but no her soul, so while obtaining a new one, she requires to possess this girl. The way she enters in her is…..suggestive, to say the least. If there was something I respected about this show, was the absolute lack of pointless fanservice scenes and even of huge breasts girls, but this was absolutely destroyed in one of the first scenes were this new random girl and Ai kiss naked in some kind of nether world lake. Is that really necessary? There’s so many ways to show how a spirit could possess a body this feels the most retarded I have ever seen or heard, it just looks as an attempt to attract desperate teenagers to watch something the might find “hot”. The worst part it seems the producers really like this scene and overuses it both in flashbacks and the actual opening of the show, ugh…\\n\r\nIf that isn’t enough, every time someone calls the hell girl to fulfill her purpose and send someone to hell there’s a incredibly disgusting scene showing how this girl turns into Ai. I seriously have no words to describe how awful it is, the only way to understand how terrible it is would be watching it, but not doing so would be doing yourself a great favor. All of this continues until Ai recovers an actual body and the new girl takes a role similar to the one of the Shibatas in season 1 trying to stop others from using the Jigoku Tsuushin. She fails so miserably at this task that it isn’t funny, it seems she barely attempts communicating with the persons contacting Ai and ends up further motivating them to use it or talk to them about the site.  \\n\r\nOnto the actual cases, most of them are pretty damn bad. I often called the second season cases to be a bit rushed, by the time the persons used to call hell girl they ended up using the doll slightly after this event, whereas in the first season they called her right from the start and further developed the problem and why they decide to use it. Here there’s a even worse problem, the cases are even more rushed as nearly everyone pulls the string from the very moment they get the doll on their hands. If that’s not enough, the reasons for using this last resort is completely retarded 90% of the times. There’s rarely a good reason to access such a desperate weapon, most of the times it merely involves stupidity or minor jealousy, is it really worth going to hell just because your boyfriend couldn’t stand against a thief? Or because your brother doesn’t want to marry you (yes you heard right)? The development is so stupid it makes my brain suffer due to the absolute lack of logic. This drives to another problem, the executions before being sent to hell, they mostly feel….silly. There’s rarely any presentation of cruelty or revenge in every death, it’s almost as the henchmen decided to make it this way to just have some fun. With all that said, the story is terrible and it barely tries to add any variety to Hell Girl, repeating the same basic formula for cases starts feeling stale after two seasons, you know. \\n\r\nLet’s move onto the characters now, everyone from the Futakomori hell girl crew makes a return and adds a new face, a young kid called Yamawaro. One of the absolute reasons that make me hate this season so much is how they massively butchered everyone that returned. Not only they no longer feel mysterious at all, but it feels as if they merely added them for comedy purposes, who the hell would laugh in a series were atrocities such as rape, animal violence, child abuse and human discrimination are present?\\n\r\nThe only character that this was acceptable with was Kikuri as she was a brand new addition and served as a nice plot twist at the end of Futakomori, and even then this felt out of place plenty of times during the mentioned season. Ai has also been greatly butchered, between her new tendencies to appear in suggestive yuri scenes and wearing new fashions such as a soccer uniform, I can no longer take her seriously. Most of her dialogues were also reduced and feel a bit weak, forget about the imposing girl that had the power to send you to hell, she’s know a geek like many people here spending endless hours on her computer from the 70’s. But lets move onto the new character, Yamawaro. His personality is pretty generic, sure he’s gentle and loyal, but that’s about it. It’s later shown his back story, and it’s just….weird. Not good or bad, just weird and pretty forgettable if you ask me, unless you enjoy of disgusting science projects.\\n\r\nSo that’s pretty much everything about the Ai Enma and friends crew, all what’s left is the new girl that serves as the “victim” of this season and should cause conflict to the Jigoku Tsuushin. Now let me tell you this, if this was an attempt to create another Shibata, it failed, miserably. She’s plain as all hell, nothing in her personality feels unique and, in fact, she’s pretty undeveloped, and with all the episodes they could have used to do this, it’s inexcusable to leave the lead character to be as interesting as a cardboard box. She also feels pretty obnoxious due to her ideals of “sending to hell others is horrible” when she barely does anything to avoid this, let alone to understand why some people access to such a service. Her main hobbies include sleeping and taking baths at the worst moments possible, and that’s about everything I can say about her. She’s generic, boring and dull. In case anyone wonders how the characters involved in cases are, you’ll be better without knowing. They are all incredibly stupid and selfish beings for the most part that just want to get rid of things on the easy way or lack any sort of logical fundamentals.\\n\r\nThe music is…..forgettable, none of the new songs were memorable or fitting in my eyes, which is pretty damn disappointing considering I loved both of the previous seasons opening themes. \\n\r\nThe only thing I can praise about this season is the art style, it still holds the charm of the series, but it feels slightly worse due to the poor atmosphere presented at times.\\n\r\nIn the end, Jigoku Shoujo Mitsuganae is nothing but a disappointing piece of trash with no redeeming quality. It offers nothing new to the series, the cases are terrible, the characters are highly dislikeable, certain scenes are just plain unnecessary and disgusting to watch and it just feels like it drags on forever. I have no clue if this holds a good set of final episodes as season 2 did since I gave up on episode 23, but it’s impossible that could have happened. This has easily become one of my official least favorite anime of all time, right there alongside Neon Genesis Evangelion and Ikki Tousen. I’ll give Mitsuganae an abysmal 1/10, and just because I can’t go any lower in this site, otherwise, I’d consider using even negative digits.\\n",
            "date": "2011-10-08T19:21:00+00:00",
            "helpful_count": 13,
            "mal_id": 45133,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/368533.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/nunchuk28",
                "username": "nunchuk28"
            },
            "url": "https://myanimelist.net/reviews.php?id=45133"
        },
        {
            "content": "I've been a fan of both anime producers and anime songs(artists). but for this season, i did like the fact that enma is back. but the fact that she possessed a girl to take her form(enma form) i didnt like it. same w/ the op of the anime. i think Snow can make a better song for it. but it's worth watching for the sake of curiosity.",
            "date": "2008-10-24T02:40:00+00:00",
            "helpful_count": 11,
            "mal_id": 8898,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99282.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/huhahu68",
                "username": "huhahu68"
            },
            "url": "https://myanimelist.net/reviews.php?id=8898"
        },
        {
            "content": "First of All, watch Jigoku Shoujo Mitsuganae if..\r\n- You are JS or Ai Enma fan\r\n- You have seen both the season, and want some 'hell-grudge' stuff\r\n- You are not bored of people going to hell\r\nJigoku Shoujo Mitsuganae follows after the second season of the Jigoku shoujo Series. As spectacular the first and second season were, the third fails to appeal to that level. Even though this season has its own appeals, its not THAT great!\r\n-------------------------------------------------------------------------------------------\r\nto elaborate:-\r\nSTORY\r\nBasically, JS3 continues from the 2nd season. As the season starts  Ai Enma doesn't have her body, so she passes judgement through the body of a girl, yuzuki. asthe same People are going to hell in lots! and thats 2 for no particular reason. if your hate is enough, even the innocent go to hell. that's particulraly happening here!! Yuzuki is able to see people going to hell, and helpless when she finds out the reality. She is later told to be the future Ai Enma, thtas her destiny (good cliche 4 Ai Enma LOvers).... so in the end,.. Ai enma is the life-saver and takes the burden on herself saving Yuzuki.... \\n\r\nhow? watch the series (that's if Ur curious enough)\\n\r\nThe series has its own twist and turns but has tonnes of fillers filled in. i you skip those its almost a short series of 10-12 series, thats all! \\n\\n\r\nART and SOUND\\n\r\nThe art is magnificent as ever. The animation has improved and is very appealing to the show.. at least that keeps you glued to the screen. Even the OST of the series is nice. the OP is good, but i prefer Snow's OP style as the have done in the previous series. the ending is also quite spooky. \\n\\n\r\nCHARACTER\\n\r\nhere is the new parts. Ai Enma has a new member,Yamawaro  along with her three companions, Hone Onna, Wanyūdō, Ren and Kikuri.  Yuzuki's part is dull, but her life is full of twist-turns. she has a past quite similar to Ai and is always connceted to the hell corresspondence website or to the people using it . and what else, new characters and new short stories in every episode. Intrestingly, Tsugumi Shibata, the daughter of the journalist in the first season has her apperance in the season and a vital role.\\n\\n\r\nENJOYMENT\\n\r\nNot as much as the previous seasons, but it still is entertaining is you like the entire concept and set-up. you get to see various emotions that tend people to send people to hell. \\n\\n\r\nOVERALL\\n\r\nBeing an JS fan, i enjoyed the season. i suggest you don't keep much expectation with the series, at least don't compare it with the previous seasons, to enjoy the season to its fullest. this season has its own stage set up, characters placed and concept running, just sit back and watch people going to hell for stupid and irrelevant reasons. Enjoy the wrap-up season of Jigoku shoujo becoz i don't think more will be coming!\\n\\n\r\ni give, Jigoku Shoujo Mitsuganae- ******* stars!\\n\r\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\\n\\n",
            "date": "2011-12-06T00:18:00+00:00",
            "helpful_count": 8,
            "mal_id": 48663,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/464043.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ambertsarina",
                "username": "Ambertsarina"
            },
            "url": "https://myanimelist.net/reviews.php?id=48663"
        },
        {
            "content": "This season of Hell Girl felt like a step down in quality compared to the quality of the second season. Mitsuganae retains the elements you would find in the first two seasons of Hell Girl where a victim browses the Hell Correspondence site to send their tormentor to hell, thinks over the decision and sends said tormentor to hell when they reach a breaking point. The elements of flawed and sympathetic elements found between the victim and tormentor of each episode are retained from the second season as well. Anyone expecting a change from the same repetitious developments found in Hell Girl's past two seasonswill be disappointed to know that the series leaves them intact. This season introduces a new companion for Ai's group in the form of Yamawaro, whose character gets his focus in a later episode of the series.\\n\\n\r\nMitsuganae also creates a more ongoing story focus between Ai and new character Yuzuki when Ai possesses the body of the middle school girl to resume her duties as Hell Girl. Yuzuki finds herself pushed to her breaking point throughout this season as she gains a role somewhat similar to the Shibatas from season one which she tries and fails to prevent anyone from making use of the services of Hell Correspondence, as well as developing a supernatural connection to Ai. Hints are dropped throughout the season that Yuzuki's life is not as it seems as Ai exposes her more to the harsh realities of man's most selfish traits.\\n\\n\r\nIt does become apparent at points that Hell Girl is starting to run out of fresh ideas for this season of the series, particularly with the role of Yuzuki's character and what we eventually learn of her past. Compared to the past two seasons, the tragic dilemma with Yuzuki connecting her to Ai is poorly contrived and skewers into melodramatic territory compared to the Shibatas from season one and Takuma from season two. In addition, a number of the punishments that Ai and her companions inflict upon tormentors before sending them to hell were a bit on the silly and ridiculous side, not consistent with the horrific images they left said tormentors from earlier seasons. It is these major reasons that make me rate Hell Girl's third season at a lower rating compared to the last season.\\n\\n\r\nHell Girl Mitsuganae retains the colorful and detailed visuals found throughout the past two seasons with animated highlights shown through a number of the punishments Ai's companions are involved with and a new one in the form of Yuzuki's transformation into Ai while she is possessed. Much like the past two seasons, there are reused animation frames apparent during these scenes as a result of said repetitious developments. Some of the show's musical tracks from the prior two seasons are retained for this season, though the OP and ED musical choices do well at complementing the tense and mellow moods respectively found throughout the series.\\n\\n\r\nWhile Hell Girl Mitsuganae does introduce a couple new characters connected to Ai, this season of the series doesn't really offer up much new from what the prior two seasons provided to me and carries some significant flaws compared to the second season. Still if you have pressed on with Hell Girl for this long and are still interested in continuing the franchise, this season is a decent look provided that you understand that it still offers up much of the same thing from the prior two seasons.",
            "date": "2011-06-22T09:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 38143,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=38143"
        },
        {
            "content": "I've seen the 1st and 2nd seasons of Jigoku Shoujo, so upon learning that there was a 3rd, I immediately made sure that I get a copy... Unfortunately, it took me some time to get all the episodes...\r\nMain Characters: Enma Ai, Hone Onna, Ichimoku Ren, Wanyuudou, Kikuri, Yamawaro and Yuzuki\r\nStory: 6/10 - the ways on how people were put to hell were still interesting... however, it gets boring since the flow of the episodes are the same... it was not necessary to drag the story to 26eps... i think 12eps will suffice... this is the first time i had to fast-forward an anime just tosee the ending... \\n\\n\r\nArt: 7/10 - i'd say the art/drawing is not too colorful but not really bleak... i guess they had to consider that this is a horror genre... 1 thing i noticed though, they focused too much on the eyes that sometimes you cannot see the mouth anymore... i think the story of the manga artist and how he was put to hell was uniquely funny...\\n\\n\r\nSound: 6/10 - BG is okay... eerie but not to the point of scary... not loving any of the OP/ED songs...\\n\\n\r\nCharacters: 6/10 - i love Enma Ai and her team (esp Ren)... i still love their bond and i'm all for the Hell Team... but for the 3rd installment, there was nothing new... Yuzuki's story was so slow that i lost interest in her until the last part... \\n\\n\r\nEnjoyment/Overall: 7/10 - if not for the ending and the re-telling of Yuzuki's past, i would've rated this as 6... \\n\\n\r\nI think this series was intended for the bullies, the corrupt, the selfish and the hopeless people... the bad guys get sent to hell by the hopeless ones -- well, one can dream, right?!\\n\\n\r\nHow I wish we have our own Hell Hotline...  :)\\n",
            "date": "2011-08-02T07:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 40635,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/519987.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BBHood22",
                "username": "BBHood22"
            },
            "url": "https://myanimelist.net/reviews.php?id=40635"
        },
        {
            "content": "This is a review talking about all three seasons of Hell Girl. (There are some spoilers of the first two seasons and the main points of what this season has. And this is mixed with my opinion)\r\nIf you want to avoid spoilers, read the conclusion which gives you an advice.\r\nThis is my first time (and probably only time) writing a review. \r\nFirst season is where the story started with some intriguing/interesting stories (As a bonus, there were 2 supernatural episodes) about revenge, then the Shibata’s make an entrance and the story will make you hooked to know what will happen. It introduced the Shibatas’ andEnma Ai’s backstories.\\n\\n\r\nSecond season is where it continues, again with some (but few that had quality) interesting episodic stories of revenge. This time, there wasn’t an opposite side who tried to stop Enma unfortunately, but it introduced her companions’ backstories (2 episodes hinting at them and 3 where they actually tell you about them). This season continues until one of the characters (involved in the episodic stories) starts getting the after-effects of Enma’s actions which eventually led Enma into reacting to the situation. This was followed by a conclusion to Enma’s story. Not a great ending but still good nonetheless, with a scene or two as a cliffhanger.\\n\\n\r\nThis is it. This is where you should stop. If there was something added to Hell Girl, it should be a movie, OVAs or a “Director’s Cut” version of the last episode to omit the cliffhangers to make it look like a proper conclusion. If there was any sequel, one would like to know who’s the Grandma? Will we see her? What did she say to Shibata that one time? Will we see that psychic guy from the 1st season? Will the spider stop from creating another Hell Girl? Did the Shibatas’ had a happy ending? Will Enma’s companions stay free? \\n\\n\r\nHeck. I can ignore all these questions and be content with that ending. But guess what? Here comes the 3rd season which answers to all of those questions by a ‘No!’\\n\\n\r\nThird season has, like, only 3 episodic stories that made me interested excluding the plot/main character related episodes (Yes, three. I counted them and this is just me). Oh you want to know about the main story? There was none, of course! This season introduced 2 new main characters, and, all it did was this:\\n\\n\r\n>\tIntroduce the backstory of the one of the new MCs (Yamawaro). (+)\\n\r\n>\tTells you the situation of one of the returning MCs (Tsugumi), and it was (imo) a bad ending. (Not to the point of death or being sent to hell) (-)\\n\r\nAll the information about their status was already implied in the last season (Tsugumi being alone which only means one thing), so nothing new apart from ruining her good ending from the first season. (-)\\n\r\n>\tIntroduce the backstory of the second new character (Yuzuki) (+) and from here, it led to the ending that ruins Enma’s conclusion from the last season. (-)\\n\\n\r\n… And, that’s it.\\n\\n\r\nI don’t know what was the point of this season. Maybe they were planning on making another sequel which was cancelled? Even if it was cancelled. Couldn’t they release something (like I said before) to remove the bridge toward the 3rd season from the 2nd season’s last episode? Anyway, I’ll just pretend that this season doesn’t exist.\\n\\n\r\nConclusion: Hell Girl is a great series. I recommend watching the first 2 seasons and you have your complete story. You didn’t have enough of Hell Girl, maybe? It’s your choice, just lower your expectations and consider this season as a non-canon extra.",
            "date": "2016-10-04T01:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 231065,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5332631.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Raccoon_Citizen",
                "username": "Raccoon_Citizen"
            },
            "url": "https://myanimelist.net/reviews.php?id=231065"
        },
        {
            "content": "i didn't like the plot of story in Jigoku Shojo Mitsuganae that much, that Emma Ai come back, but i like that she got more emotional in the third season. and the cause in this season it not good as the last 2 season. this season the client pull the string because of jut hate ppl.",
            "date": "2009-03-25T13:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 13468,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105345.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kikuchimera",
                "username": "kikuchimera"
            },
            "url": "https://myanimelist.net/reviews.php?id=13468"
        },
        {
            "content": "This is a review for those who've watched the first two seasons of hell girl, if you haven't watched hellgirl by now you need to start with season 1.\r\nEverything about Mitsuganae is mediocre compared to the first two seasons.   While the first season wasn't perfect by a long shot and many critics had lots of issues with it, Mitsuganae (the third season) is a disaster compared to it.  With season 2 being the best.\r\nThe problem is that the third season has the same problems as the first, except this time it's obvious the writers ran out of ideas.  The repetitive plot/ revenge structure with an episodic nature comes to dominate mitsuganae once again with a \"main plot\" that is just so poorly written into the vast 26 episodes that the plot comes out nonsensical.\\n\\n\r\nMost of the 26 episodes of the show is filled with filler material.  There are maybe 6 episodes total that have anything to do with the main plot and the rest can be skipped.  The 'new plot' they came up with for season 3 is just hackneyed.  The plot is basically hell girl possesses human girl and hell girl has to save the girl she possesses.  The problem here is that hell girls finale in season 2 was having hell girl be released from her role as hell girl and finally getting to die.  So the plot begins with a deus ex machina, which is just amateur level writing.  They never came up with a believable reason for why she is back.\\n\\n\r\nThe producers also went and made huge radical changes to the characters and cast so it throws off the FEEL of the characters they established in the hell girl universe. \\n\\n\r\nThe plot involving possession is just so forced and convoluted that it turns off the long time fan.  Each episode of mitsuganae feels rushed and it feels rushed because the characters and their motives were not written well at all.   The main problem with mitsuganae is the characters in each episode take revenge for the dumbest and most unbelievable reasons.   Hell girl and mitsuganae relies on characters in each episode beside the main cast never appearing again.   So the fact that the characters are not believable goes a long way to making the whole show a tired excercise of you trying to tolerate its badness to find the good episodes that make any kind of sense instead of wasting your time.\\n\\n\r\nIf you're a hell girl fan watch season 1 and 2 and skip 3 in order for you to not end up with a bitter aftertaste in your mouth.",
            "date": "2012-12-11T08:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 79938,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/super88",
                "username": "super88"
            },
            "url": "https://myanimelist.net/reviews.php?id=79938"
        },
        {
            "content": "I don't normally feel the need to write reviews, but I felt rather, disgruntled, after watching this through to the end. Maybe this is the sort of, wait a day after watching then see if you want to write a review sort of situation? Eh, screw it. If you enjoy the main focus of the story, the 'calling upon Hell Girl and watching her banish people' no matter how trivial or silly some of the reasons become, then you will still like this. However, if that isn't all you are looking for, then you will be disappointed. I know I was, despite wanting to likeit.\\n\\n\r\nMaybe we should start with what was good? First of all, the sound and the art were good. The visuals, sound effects, and music, were really quite nice and add something special to this show. When it comes to the 'the person is going to hell, here is the pseudo-torture scene' sections, they got a bit lazy. However, they also recycled the 'transformation' scene just like they did with the 'flying flaming carriage' scene in the first two series. That got kinda tiresome. The music was nice, but there was little to no variation to it, and if you -actually- listened to it long enough, it got boring.\\n\\n\r\nThe characters are all still as you remembered them, with an extra side character added to Ai's cast of servants. Yamawaro gets a single episode to flesh out his backstory, like the others, but gets little to no other sources of exposure like Ren, Hone Onna, and Wanyuudo did in the other series, and do in this one, acting as her eyes and ears. He is mostly just there to support the most annoying character in the entire world, Kikuri. Why they added her in I do not know. The show would be vastly improved if she was gone. Seriously, we know who she is now, we found out in the second season, why is she back? There is no reason for her to be back.\\n\\n\r\nAnyways, lets get to what I wanted to talk about, and what really annoyed me: the story. If you are reading this without watching the series first, just know that it is bad, and move on. It is bad. That is it, its bad.\\n\\n\r\n*Warning, Spoilers*\\n\\n\r\nThere is a glaring plot hole, in the very first episode. After the last series Ai is no longer the Hell Girl, she became human, then died. So, why is she back? It is never actually explained. You can make a few guesses. She is back because she hasn't truly left her hatred behind, and so cannot go to heaven or hell? She is back because the master of Hell has pulled her back into doing her old job? She is back because she has to pick a successor? She is back because the plot gods demanded so for a third season? All I know is that this annoyed me throughout the series.\\n\\n\r\nIn the end it seems it is because she has to pick a successor? Maybe? If you take a leap of faith and make that assumption, because they still don't explain it to you. But even if that is the case, why? Why does -she- have to? That isn't really explained either. Can't the master of Hell just pick a new Hell Girl like he picked Ai? Why couldn't he have shown Yuzuki the truth about her life, and created a new Hell Girl? Seriously, that is what Ai did and it worked, but it took 26 episodes. The first 12 of which have nothing to do with the plot at all. Maybe they are there so that you start feeling for Yuzuki, and her friend Akie, you know, drive the character development along, but that fails. She does exactly what Hajime and Tsugumi do in the first season, which is fail at trying to prevent everything from happening, and even at times, helping it to happen!\\n\\n\r\nOH, and speaking of useless returning characters, guess who is back? Tsugumi. Yeah, it was neat seeing her in the second season for that short amount of time, a brief cameo appearance, but now she is back as a character (for the latter half of the series) and does absolutely nothing. Nothing. In fact, she is almost more annoying than Kikuri because she does about as much, and isn't a cute loli anymore. She has two important scenes, the first is at the festival at the portal/gateway, the second is explaining to Yuzuki that her life is a lie. Both scenes could have been done by other characters, easily. Especially the latter example, because Ai goes and explains it to her anyways, revealing her past.\\n\\n\r\nTurns out Yuzuki's life is a lie, and she is a ghost. Nice, a Sixth Sense move. Somehow though she is living and participating in human society. Her friend Akie comes over, but doesn't realize the building is derelict? Her teachers don't realize that there is no paperwork on her, because she died a decade ago? Somehow she lives the normal life of a middle-schooler without anyone around her noticing? This isn't explained very well. Just that everything has been 'an illusion'. But then why does she care about Akie? Why does Akie become her companion? It all just -almost- makes sense, and -almost- works, but it just doesn't get there. That is what got me so upset. I watched 26 episodes waiting for it to get better, after the first 12 it does get better, yay! Validation! But wait, then it starts to go downhill. Then it ends like it does: like a lukewarm beverage on a hot day. Not satisfying in the least.\\n\\n\r\nI hope you enjoyed my angry inane ramblings that I have written at 3:30 in the morning.",
            "date": "2017-04-12T00:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 245299,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/459610.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/RanmaChanFC",
                "username": "RanmaChanFC"
            },
            "url": "https://myanimelist.net/reviews.php?id=245299"
        },
        {
            "content": "If you're a fan of the Jigoku Shoujo series, you gotta watch this one!  It still deals with people being sent to hell, but Ai Enma got resurrected to Yuzuki's body. One thing I didn't like about the series is that the main plot starts again late in the series. They didn't also explain how did Ai came back... But I still enjoyed it especially in terms of the OST's... (The ones being played when Ai is about to send a person to hell)...",
            "date": "2009-06-10T21:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 15659,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/189324.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nalferd",
                "username": "nalferd"
            },
            "url": "https://myanimelist.net/reviews.php?id=15659"
        },
        {
            "content": "Enma Ai returns with Season 3! After the events of the previous season, Hell Girl will have to find a body to work. Yuzuki Mikage was living an ordinary life until Ai possessed her. Now, Yuzuki will have to see the job of Hell Girl personally and so begins another battle between the Hell Girl and an individual who wants her to stop.\r\nVery similar to season 1, Mitsuganae will still bring you the stuff you want. The possession part is new, but won't be too much of a change to the overall story. The old team of Hone Onna, Ren and Wanyudo will return, butnot without the annoying brat Kikuri. A new follower Yamawaro, a young boy whose past will be revealed soon, is also introduced. Also a familiar face will return.\\n\\n\\n\r\nI will note one thing and this can be a spoiler as well: the story will develop very differently from the 13th episode. Apart from this, I really can't comment much. Like the previous seasons, better seen than read! Go and watch it.\\n\\n",
            "date": "2010-10-01T03:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 30954,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hangbin9",
                "username": "hangbin9"
            },
            "url": "https://myanimelist.net/reviews.php?id=30954"
        },
        {
            "content": "***This review contains spoilers for prequels of the series***\r\nSo it is recommended to ones who finished 1st and 2nd seasons\r\nThe third season of Jigoku Shoujo is still conceptually the same, keeping rather dark atmosphere with faint rays of hope glowing, and then fading. But this time it is getting really absurd, I mean it not in a bad way though it is hard to get the point, the situations pictured here are now even more absurd. Yeah, people tend to act irrationally, especially being filled with hate and wrath, and the consequence are not pleasant at all. But what for are we shown that? Tomake us hate hell correspondence? Or to laugh at those [tragic] scenes?\\n\\n\r\nStory is still episodic, but now we again get a character who is opposing Enma Ai. Her name is Mikage Yuzuki and she is a little resembling Shibata Tsugumi. And the narration is shifted to the perspective of the new character. Rules are still the same, not changed from first season. We see Mikage Yuzuki attempting to meddle and change the situation for the better, but you probably guessed that it's futile.\\n\\n\r\nWe have already been shown impressing stuff, like episode 23 of the first season where innocent girl is being sent to hell, where even usually emotionless Enma Ai is wavering. This episode really meant that Hell Girl is the thing that better not to be in this world. I wish they did more explanations and development of the story at that side, but this was cut with a short phrase \"it is not up to us to decide this\". In the end of second season we saw people in one town massively accessed Jigoku Tsuushin, which merely caused whole town's extinction. But now we get stories where people have very weird motivation of sending others to hell despite immense cost, going to hell after the death in afterlife. It really often made me think that people need not Jigoku Shoujo services, but a psychologist and/or psychiatrist. Because the root of the problem is within themselves and not in the outside world. So it is like they try solving every problem with it. In fact in previous seasons there also were such stories.\\n\\n\r\nThe incongruity I still cannot understand, the idea that only people possessing strong hate can call Jigoku Shoujo, it must have eliminated above mentioned absurd cases, but why it did not? Possibly that it is based on person's initial hate, at the moment of getting straw doll. Often case is almost resolved without untying red thread and the hate seems to be gone, but there is still a bad ending [straw doll used].\\n\\n\r\nThis time art is having just a minor changes, but I think they did too many repeating scenes, most events take place in one town so there is a limited amount of great view scenes. I don't mean that it is bad here, it is on the same level with previous seasons.\\n\\n\r\nMusic is good and atmospheric, like the previous seasons, but just this time I didn't like OP and ED soundtrack enough not to skip it. Seiyuu are doing a great job.\\n\\n\r\nIn the end you expect to see some philosophy of Jigoku Shoujo and Jigoku Tsuushin existence that everything here wasn't meaningless and vain, but disappointingly they throw some vague ideas. Though they do point positive sides of it's existence, but it doesn't sound solid, neither making you believe it. If you liked previous seasons, I recommend you to watch the 3rd as it has various interesting points of view.",
            "date": "2017-01-07T12:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 237721,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4090177.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/highfeel",
                "username": "highfeel"
            },
            "url": "https://myanimelist.net/reviews.php?id=237721"
        },
        {
            "content": "The series exploring certain states of the humans psyches, which when collided, lead to conflicts, unrest, suffering, and eventualy, \" pulling THE red string \", that ultimately only brings the prosperity of Hell, through the job of the Hell Corespondence and it's 'employees', Enma Ai and Co. ; Jigoku Shoujo, continues with it's 3rd season. \r\n( Story and Characters ) After her...disturbing departure at the end of the last season. Enma Ai, supernatural maiden, contractor of souls, once again does her stuff in this realm, this time, without a body of her own, having to manifest herself using a school girl asa medium. Most of the events are centered around the school this girl attends. Oh school, thou eternal setting of the japanese animes, smoked and resmoked till the fucktop heights of clisheeic glory !  \\n\r\nYet rightfully a decisive moment in the lives of all, and the place for so many tragedies to unfold.\\n\r\nHer old, more or less, equally hellish companions, now with a new recruit, arrive as well and reunite, sensing their old mistress around. Usually only cool spectators ( untill they had to do their part of the contract ), they are more humanized than ever before in this season, sometimes showing human like empathy towads the protagonists of the episodical \"plays\".\\n\r\n\" Episodical plays \", meaning the format hasn't changed, it's still one story per episode, exception making the plot episodes, which are strategically scattered throughout the season, but mostly bunch up in the last quarter of the anime. \\n\\n\r\nAs for the music, I can't help but imagine at times, a mother bird, that, through a trill of tragical beauty, deplores the cruel fate of it's helpless children, that unknowngly condamn themselves to reliving the play of damnation, the one that ever repeats itself in essence, with only the dolls changed...\\n\r\nOther times, it seems like it's fate, laughing without discern behind the humans' backs. This contrast, this creepying feeling draws attention. So do the sound effects, the sound is very well created. \\n\r\nThe art also does its part well. I specifically remarked the vividity of the colours, which, when placed on a faded background, again, create a contrast that draws attention. The red colour is especially vivid in key moments, contributing to the omonious feeling. The intensity of light and contrast also suffer sudden changes, amplifying the effect even further. Sure, we've seen that in the first 2 seasons as well, but in this season, they've really pushed the music and the art + animation one step further. \\n\\n\r\nThis 3rd season distinguishes itself from the first two, mainly through the originality of the conflicts. There's no clear black and white anymore, with white pulling the string, and the black getting what they deserved. Instead, things get a lot murkier, as Jigoku Shoujo is exploring lesser known parts of the human psyche. Oftenly, keeping the suspense, the doll pops late, and from where you expect the least. This aproach breaths some fresh air into a concept that's grown rather old over two seasons. \\n\\n\r\nThese series come to show how human feelings can be mistaken, and can determine impulsive actions, which can't be undone.\\n\\n\r\nOverall, if you're here, you must've already watched the first two seasons, case in which, I see no reason not to recommend to give this one a try, and end the \" trilogy \". But if you've already beared with Enma Ai and Co., for two whole seasons, you'll probably do the same even without me telling you that. \\n",
            "date": "2014-01-02T16:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 126871,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304863.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AkaenX",
                "username": "AkaenX"
            },
            "url": "https://myanimelist.net/reviews.php?id=126871"
        }
    ],
    [
        {
            "content": "Ah... the final installment of Jigoku Shoujo.  Sadly, all good things come to an end, but some ends are uglier than others.\r\n*If you haven't seen Futakomori (season two), stop reading now and watch that first.  If you haven't seen Jigoku Shoujo (season one), why are you even here?\r\nMitsuganae is like a monkey on a unicycle:  At the beginning, it looks cool and interesting--until you realize it doesn't make much sense (plot holes and discontinuity issues).  But then, the monkey starts throwing its poop at you.  Then (starting at episode 13), it starts using its tail to try to clean thepoop off your face.  Finally (starting at episode 20 or so), the monkey takes you out to a 5-star restaurant to apologize.  It gets better and better until you finish off with an amazing dessert.\\n\\n\r\nIf that analogy didn't make sense to you, try this simpler one:  It's like Obama's bailout, except it actually works.\\n\\n\r\nSo I'm gonna mix things up and only talk about the first 12 episodes; I'll just call them \"The 12\" for simplicity's sake.  ***BE WARNED:  This is a wall of text, but it's a very important wall of text.***  To put it bluntly:  They are terrible.  The characters are SO retarded they seem to be participating in some unspoken contest to see who can collect the most drool in a bucket.  I think they all played together in the same idiot ball pit as kids.  \"The 12\" has the most instances of facepalm-tastic plot-induced stupidity I've ever witnessed.  And that's saying a LOT.  People seem to find the most retarded reasons imaginable to send someone to Hell.  This isn't aided at all by the fact that characters regularly make the absolute dumbest decisions imaginable in any given situation, and tiny communication failures seem to have catastrophic consequences.  There are times when it's impossible to tell who of the two at conflict is actually worse; both seem they could be worthy of going to Hell.  There's a scene that gets repeated over and over again (that I won't spoil) that reminds me of the sequence from Darker Than Black: Gemini of the Meteor (in concept, execution, and repetitive, redundant usage) where Suo's gun appears from her necklace.  Well, if you've seen that, make it like 8 times longer, 10 times more disturbing, and a hundredth as meaningful, and you have what I'm talking about.  In episode 12, when a target is being tormented, the scene is done entirely with real-life paper cutouts.  I felt like I got trolled.  Also in said episode are not one, but TWO nose bleads (you know what I'm talking about).  The torture sequences are now nothing more than some ball-tripping sequence; nothing worse than some pothead would see.  They are absolute jokes, and any suffering the victim seems to be going through is contrived BS.  Most people would probably just be laughing and/or confused.\\n\\n\r\nEpisode 1 is important only for setting the stage.  The rest of \"The 12\" are complete shit and I HIGHLY recommend you skip them.  You'll be saving yourself time and, if you liked seasons one and two, tears.  You won't miss anything at all.  The only good parts are the occasional comical narcisstic moments from Ren and Wanyuudo.  Episode 13 is where things actually start getting interesting.  I swear they had some mentally unstable director during \"The 12\"; the series would be so much better if they just didn't exist.\\n\\n\r\n-------------------------------\\n\\n\r\nNow that that's over with, let's talk about the REST of the series, where things start to actually get good.  (This portion IGNORES \"The 12.\")\\n\\n\r\nStory: 9.  Being forced to believe WITHOUT EXPLANATION that Ai is back to continue during her job, even after the events at the end of Futakomori, is pretty hard.  But once you get over that, it's actually really interesting--although again, it isn't majorly developed until the end (the last 7 episodes this time).  During these 7, it slowly escalates until it crescendos in an explosive conclusion, and it's INSANELY entertaining.\\n\\n\r\nArt: 9.  Mitsuganae improves upon the previous two installments yet again with quite crisp, clear, and fresh-looking visuals.  But some scenes--which happened to coincide with critical plot development--were simply breath-taking.  Motions are animated pretty well, bar a few exceptions.\\n\\n\r\nSound: 8.  Still a great OST, just as before: some classic oldies, some remakes, and lots of good new stuff.  However, the OP and ED tracks are pretty mediocre comparatively speeking.  Voice acting is still good as always.\\n\\n\r\nCharacter: 8.  I really like Yuzuki and her back story, but at some points, she seems to function solely as a moe-blob (just tilting her head and making soft moe noises, like \"eh?\").  Some of the characters are pretty stupid sometimes.  Pretty good character design overall, even though some of them look like familiar faces from the previous two seasons.  We also get Yamawaro's back story (the newbie in Ai's gang).\\n\\n\r\nEnjoyment: 9.  Most of my enjoyment stemmed from the plot and character (Yuzuki and Ai) development this time.  I was disappointed by the lack of torture sequences of people being sent to Hell, but sometimes, it was okay, because the person being sent sometimes didn't deserve it at all.  (I think this was why.)  I was disappointed at the inclusion of some unnecessary Yuri fan service scenes.\\n\\n\r\nOverall: 8.  See below.\\n\\n\r\n-------------------------------\\n\\n\r\n\"The 12\" made it automatically lose a point.  It should've taken off more, but the final 7 episodes are REALLY f***in' good.  (Is my bailout analogy starting to make sense now?)  Basically, they try to fix the shit you'd been forced to eat so far at the end.\\n\\n\r\nThis series seriously had the potential to be a 10.  Easy.  It could've easily topped the last two seasons.  But it was severly hampered by \"The 12,\" major plotholes (that could've at least been hand waved with some explanation), and... well, lack of explanation--especially of plot-critical points.\\n\\n\r\nAll in all:  If you liked the first two seasons, I recommend this BUT, skip episodes 2-12.  If you choose not to... well, I warned you.\\n\\n\r\nAnd now, the decision rests with you~",
            "date": "2011-12-20T01:09:00+00:00",
            "helpful_count": 72,
            "mal_id": 49627,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557765.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DraconisMarch",
                "username": "DraconisMarch"
            },
            "url": "https://myanimelist.net/reviews.php?id=49627"
        },
        {
            "content": "Maybe not as good as Futakomori, but still a must watch for every fan of Enma Ai.\r\nThe story is pretty much similar to what we have seen in the two previous seasons, people are being sent to hell and hatred is released, though this time hatred gives birth to more hatred.\r\nThroughout the season it can be noticed that the creators have decided to use the ideas the fans found rather pleasing in the past. Once again someone tries to make a stand against the jigoku tsuushin, similarly to what has happened in the first season of the series. While new characters are introduced stories abouttheir past are told to eplain their bonds with Ai, this has already been ecountered in Futakomori.\\n\\n\r\nThere is however something fresh about the series, the element of possesion. It is not only an interesting concept, but it plays a vital role in the story throughout the season and builds up the tension until the very last episode.\\n\\n\r\nUnfortunately, what seems to be a great material has it's downside. Some of the grudges people hold against each other are simply speaking too typical and therefore boring. While watching some episodes I actually had the feeling that they were nothing more than mere fillers, which had to be squeezed in so that the series would be 26 episodes long.\\n\\n\r\nArt-wise, we get the same old esthetic and mysterious animation as before, which perfectly fits with the nature of the show as well as the score playing along. In one episode though we get even more than that. While watching the finale one might say that the creators have implemented an inexplicably eccentric idea into the show. The effect is awkward, but it gives you something new to look at therefore adding value to the experience.\\n\\n\r\nWhat I found the most pleasing aspect of season three is the sound. Although when it comes to opening themes I preffered SnoW, the music in Mitsuganae is outstanding! It fits the feelings which play a crucial part of the show more than ever before. Some of the themes are actually worth listening to even without the video and voice play.\\n\\n\r\nThe newly introduced chracters are great, they are intresting and as a viewer I was actually interested what was going on in their minds while watching the series. I was pleased to see how the bond between Ai and her companions thightens. The single-episode chracters were pretty well designed as well, some of them were pitiful, others scary. Several however were completely forgettable and tasteless like a bad meal.\\n\\n\r\nOn one hand, Mitsuganae combined all the best ideas of the first two seasons. On the other, some of the typical strictly grudge based episodes were not as entertaining as in the past.\\n\\n\r\nMitsuganae is a must watch for every fan of Emma Ai. For the rest, it's a good, or maybe even very good, way of wasting some spare time, while waiting for the next episode of your favourite series.",
            "date": "2009-06-29T14:07:00+00:00",
            "helpful_count": 61,
            "mal_id": 16254,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/naganje",
                "username": "naganje"
            },
            "url": "https://myanimelist.net/reviews.php?id=16254"
        },
        {
            "content": "I'll be straightforward. If you loved futakomori, don't watch this one. It would be very dissapointing, referring to the plot and the story of course. The cases are not that intriguing, relevant and amusing this time around. And the main plot is just not as good as the one in its prequel. But still, the sound and art is great. And you still get to see the lovely enma ai. Try watching it if you want to see enma ai that badly. But do not even try if you don't want to keep comparing it to it's past seasons.",
            "date": "2010-05-20T17:06:00+00:00",
            "helpful_count": 35,
            "mal_id": 26236,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/meikira14",
                "username": "meikira14"
            },
            "url": "https://myanimelist.net/reviews.php?id=26236"
        },
        {
            "content": "Story:\r\nBasically the frame of each episode is the same as season 1 and 2 *people sending other people to hell*, but the new twist of Ai being reborn with Yuzuki as the medium is very interesting. It get's interesting with every episode because it unfolds the deeper story of Yuzuki's involvement with Ai.\r\nArt:\r\nEffects are basically the same as 1 and 2 but I love Ai's new kimono. The effects of it is really great. Opening and closing vids are amazingly colorful.\r\nSound:\r\nTiming and choice of sound effects add the eerie effect at key points of the story. Making you anticipate something coming.\r\nCharacter:\r\nThough old characters retained theirpersonalities, they have matured more, especially Ai, and how she depicts herself. Kikuri, have had a major change of personality, she is no longer the manifestation of the Lord of Hell, with a body borrowed from a toy *based on episodes watched*. Kikuri, now has a CHILDISH character. Though for me, with 3 episodes to go. Kikuri's personality is still bound for change. A new addition to Ai's disciples is Yamawaro who's origin is hidden from the start, though it is shown that he is very submissive to the very annoying Kikuri.\\n\r\nYuzuki, the girl whom Ai was reborn is a character who's the center of Mitsuganae, why and how is she deeply involved with Jigoku Shoujo and the Jigoku Tsushiin is what you have to watch for in Mitsuganae.\\n\\n\r\nEnjoyment:\\n\r\nVery enjoyable, though some episodes are plain and boring. You can always get enjoyment from the very annoying Kikuri *why I keep saying Kikuri is annoying is what you have to find out for yourself :)*.\\n\\n\r\nOverall it gets a rating of 8.6, I would definitely recommend that you watch this.",
            "date": "2009-04-13T05:21:00+00:00",
            "helpful_count": 32,
            "mal_id": 14105,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/154872.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mrsjunmatsumoto",
                "username": "mrsjunmatsumoto"
            },
            "url": "https://myanimelist.net/reviews.php?id=14105"
        },
        {
            "content": "Quick Review (For lazy readers!):\r\nThinking back to the time I watched the other Jigoku Shoujo seasons, I guess this was the one that took me the longest to finish. I just didn't feel like it, and it seemed worse than the other 2.\r\nYou can probably get bored of it, after all it is really similar to what we have seen so far. The last episodes were pretty good though.\r\nA- for fans, and probably an C+/B for other people watching it.\r\nWorth watching. Overall: 8/10\r\n------------------------------\r\nStory (6/10):\r\nThis is surely the worst season of the 3. The story was not BAD, but it was rather boring because you mostlygot more of the same: People make bad stuff, People get frustrated about it, People get sent to hell. I think I could make it a 7, if the anime was 13 episodes long, but 26 was just too much. The reasons to sent people to hell were also really plain, and you mostly knew who would send who after watching 2/3 minutes of each episode (Except for some rare occasions).\\n\\n\r\nArt (8/10):\\n\r\nI guess I like JS' art a bit, but some times I get the feeling that some characters look retarded. About the backgrounds and so on, I have nothing to point out; they were good. The production quality was good in my opinion, and if you watched one of the other season, you already know what to expect.\\n\\n\r\nSound (9/10):\\n\r\nThe biggest score I gave to JS3 was in the sound department, because I simply love it. It fits the series, and what is happening. You never feel like the music is in the wrong place. The OP was really good in my opinion, and the ED, even though it wasn't one that I like really much, was good for the series it was in.\\n\\n\r\nCharacter (7/10):\\n\r\nYou already know almost every one that appears in this series from the last 2 seasons, and there was not much of a improvement over what we knew before. Enma Ai was great once again, and her servants remain the same they were before. The characters we were introduced to were bland, and some of the older characters also get some new personalities. You'll understand once you see them.\\n\\n\r\nEnjoyment (7/10):\\n\r\nAs I already stated before, the series was really boring and repetitive, so for the most time I wasn't really interested in it. I mostly kept on watching because of two things:\\n\r\n1st: I try to never, EVER, drop an anime unless I really hate it. Some of my favorite animes were almost dropped, so I don't drop anything anymore [Higurashi no Naku Koro Ni...]\\n\r\n2nd: The other 2 seasons left most of the plot developments to the 2nd half, so I was waiting for them to appear. It took a little more time than I expected though....\\n\r\nAnyway, I'm glad I did keep on watching it, because the ending was quite good. But it wasn't always that interesting thanks to bad reasons to send people to hell, and a lack of plot (most of the time at least). If you loved the other 2 seasons though, or if you just like seeing people go to hell and/or the bad of society, you can probably make this a 8 or a 9.\\n\\n\r\nOverall (8/10):\\n\r\nAs said in the Quick Review, this was probably the worst of the 3 seasons. It wasn't as good (plot-wise) as Jigoku Shoujo Futakomori, and if feels boring compared to the 1st season. Also, most of the time, people were sent to hell for 'no reason'. I guess that it would be better if the series was shorter... =)",
            "date": "2009-05-07T11:11:00+00:00",
            "helpful_count": 26,
            "mal_id": 14858,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/12212.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Fye_DX",
                "username": "Fye_DX"
            },
            "url": "https://myanimelist.net/reviews.php?id=14858"
        },
        {
            "content": "First of all, I would like to thank you for reading this review because you actually took time to\r\nread this post. :) \r\n\"Would you like to try dying once?\" - Enma Ai\r\nOkay, so I recommend that you would watch this series chronologically. By that I mean from Jigoku Shoujo -> Jigoku Shoujo Futakamori -> (finally) Jigoku Shoujo Mitsuganae. It should be in this order for you to understand the story of Enma Ai and her job as Jigoku Shoujo.\r\nThis season in particular, has the most messed-up characters because of the reasons why they send\r\nthe people who they hate \r\n-SPOILER ALERT- \r\nEPISODE 4 = that boysent his \"hero\" to hell because he wasn't able to live up to the \"hero\" title. LIKE SERIOUSLY. WATDAHELL. it's not his fault you know -swt-\\n\\n\r\nAnywho,\\n\\n\r\nThe series is really worth watching in my opinion, because it continues on the story of Enma Ai.\\n\r\nI also read one of the reviews and that reviewer typed that you shouldn't watch episodes 2-12 because it's a complete waste of time. But YOU SHOULD REALLY WATCH IT BECAUSE it really is worth the wait. Like I did.  It wasn't as bad except for Episode 4. Though in episodes 1-14, it was \\n\r\nreally painful for me to watch Enma Ai coming out of Yuzuki, that must've hurt.\\n\\n\\n\r\n* mwatch \\n\\n\r\nepisode 25\\n\\n\r\nI SWEAR. THIS EPISODE MADE ME CRY LIKE AN EPISODE FROM CLANNAD AFTER STORY. Like WOAH. And this is really the episode that would make you remember the 3rd & Final season of Jigoku Shoujo. \\n\\n\r\nSo thank you people ( if you'll ever read this ) and to the creators of JIGOKU SHOUJO. without you, I would've never watched this anime ( well duhhh that's why they made it for people to watch it )\\n\\n\\n\r\nI LOVE JIGOKU SHOUJO & I HOPE YOU'LL LOVE IT TOO. :)",
            "date": "2012-05-04T12:02:00+00:00",
            "helpful_count": 14,
            "mal_id": 60501,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/308881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/gdjdelacruz",
                "username": "gdjdelacruz"
            },
            "url": "https://myanimelist.net/reviews.php?id=60501"
        },
        {
            "content": "Enma Ai has really gotten creative this time. She has resurrected herself in a young girl, Yuzuki Mikage. This season's people who sent people to Hell, and people who get sent to Hell are very interesting. But pointless. Most people that get sent to Hell don't deserve to, in this season of Jigoku Shoujo. Most of the people who want to send a certain person to Hell is just jealous, or doesn't like how they do things. It's never for the right reasons. Except for Episode 5, whereas the person actually deserved to die.\r\nStory: Most of the people who want to send a certain personto Hell is just jealous, or doesn't like how they do things. It's never for the right reasons. Except for Episode 5, whereas the person actually deserved to die. The stories are basically mostly the same, and if you look closely, you could see similarity between Jigoku Shoujo, Jigoku Shoujo Futakomori and Mitsuganae. Of course, they all want people to die, but seriously, it's all mostly the same thing. Basically. Like in a picture, the outline of it would be the same, but if you add some meat and colour to it, I'm sure it's going to be a different picture.\\n\\n\r\nArt: The art is the same, too. Many of the girls look similar, but I guess it's the author's style of drawing. The art is nice, anyhow. I like the distinct features of the kids, and of the little girl. (The one with big eyes who helps Enma Ai? Her name?) She's a cute and unique girl who has a great personality. \\n\\n\r\nSound: Uh... I never could judge the sound, but the music is great. Gives a creep and eerie feeling to the anime.\\n\\n\r\nCharacter: They're great, let me tell you! Yuzuki is cool, and shy, she reminds me of all those typical, shy, anime girls. But, Itsuko is my favourite! She is energetic, but she is also quiet at times. She can be serious, and she is Yuzuki's best friend. The other characters, like Ren, are awesome, too. They are funny, and good-hearted, even if they are working for Hell. Totally different from what'd you expect from Hell's descendants. The other ones, the victims and the suspects, they really show the bad side and good side of people; especially when they use Jigoku Tsuuchin. It shows that even the shiest, quietest of people can hold a grudge. It shows that everyone has a rebellious side to them, no matter how good-two-shoes they are.\\n",
            "date": "2008-11-15T19:09:00+00:00",
            "helpful_count": 13,
            "mal_id": 9519,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/114594.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/REVERIEExx",
                "username": "REVERIEExx"
            },
            "url": "https://myanimelist.net/reviews.php?id=9519"
        },
        {
            "content": "Hell Girl is one of my favorite anime of all time, it was a nice change of pace from your typical shonen or comedy show and it really did a great job at showing the cruelty of the world. Now, I never really brought myself to see the sequels to it until this year, so I had no clue of how it was altogether. Now that I have done so, I can come to a final critic about the series in general, but I'm not someone that does anime reviews, at all. However, this season was so \"special\" I just had to give it sucha privilege.Both sequels have a subtitle instead of simply calling it Hell Girl 2 and 3, those being “Two Mirros” and “Three Vessels”…. You know, I just noticed it seems they purposely chose the number of items in the subtitle purposely based on it’s season. What would they call the fourth season if it was ever conceived, four seals? Anyways, the season that I’ll focus on reviewing is the latest, “Jigoku Shoujo Mitsuganae” or 3 Vessels. \\n\\n\r\nIf you know Hell Girl well, then you’ll notice there’s not a clear main point, there are plenty of cases but they rarely ever connect, the closest you’ll get to a plot point is the beginning with this new girl whose name I can’t remember, but we’ll get into the characters later. It all stars with the closest thing to an antagonist in the previous season, Kikuri, calling Ai Enma assistants to reunite as “she’s returning” as she puts it. You see (spoiler alerts) Ai was killed in the end of the previous season, something that made for a pretty good (although sad) conclusion to the series, which already makes a sequel pretty pointless, but it seems we still got it regardless. Ai lost her body, but no her soul, so while obtaining a new one, she requires to possess this girl. The way she enters in her is…..suggestive, to say the least. If there was something I respected about this show, was the absolute lack of pointless fanservice scenes and even of huge breasts girls, but this was absolutely destroyed in one of the first scenes were this new random girl and Ai kiss naked in some kind of nether world lake. Is that really necessary? There’s so many ways to show how a spirit could possess a body this feels the most retarded I have ever seen or heard, it just looks as an attempt to attract desperate teenagers to watch something the might find “hot”. The worst part it seems the producers really like this scene and overuses it both in flashbacks and the actual opening of the show, ugh…\\n\r\nIf that isn’t enough, every time someone calls the hell girl to fulfill her purpose and send someone to hell there’s a incredibly disgusting scene showing how this girl turns into Ai. I seriously have no words to describe how awful it is, the only way to understand how terrible it is would be watching it, but not doing so would be doing yourself a great favor. All of this continues until Ai recovers an actual body and the new girl takes a role similar to the one of the Shibatas in season 1 trying to stop others from using the Jigoku Tsuushin. She fails so miserably at this task that it isn’t funny, it seems she barely attempts communicating with the persons contacting Ai and ends up further motivating them to use it or talk to them about the site.  \\n\r\nOnto the actual cases, most of them are pretty damn bad. I often called the second season cases to be a bit rushed, by the time the persons used to call hell girl they ended up using the doll slightly after this event, whereas in the first season they called her right from the start and further developed the problem and why they decide to use it. Here there’s a even worse problem, the cases are even more rushed as nearly everyone pulls the string from the very moment they get the doll on their hands. If that’s not enough, the reasons for using this last resort is completely retarded 90% of the times. There’s rarely a good reason to access such a desperate weapon, most of the times it merely involves stupidity or minor jealousy, is it really worth going to hell just because your boyfriend couldn’t stand against a thief? Or because your brother doesn’t want to marry you (yes you heard right)? The development is so stupid it makes my brain suffer due to the absolute lack of logic. This drives to another problem, the executions before being sent to hell, they mostly feel….silly. There’s rarely any presentation of cruelty or revenge in every death, it’s almost as the henchmen decided to make it this way to just have some fun. With all that said, the story is terrible and it barely tries to add any variety to Hell Girl, repeating the same basic formula for cases starts feeling stale after two seasons, you know. \\n\r\nLet’s move onto the characters now, everyone from the Futakomori hell girl crew makes a return and adds a new face, a young kid called Yamawaro. One of the absolute reasons that make me hate this season so much is how they massively butchered everyone that returned. Not only they no longer feel mysterious at all, but it feels as if they merely added them for comedy purposes, who the hell would laugh in a series were atrocities such as rape, animal violence, child abuse and human discrimination are present?\\n\r\nThe only character that this was acceptable with was Kikuri as she was a brand new addition and served as a nice plot twist at the end of Futakomori, and even then this felt out of place plenty of times during the mentioned season. Ai has also been greatly butchered, between her new tendencies to appear in suggestive yuri scenes and wearing new fashions such as a soccer uniform, I can no longer take her seriously. Most of her dialogues were also reduced and feel a bit weak, forget about the imposing girl that had the power to send you to hell, she’s know a geek like many people here spending endless hours on her computer from the 70’s. But lets move onto the new character, Yamawaro. His personality is pretty generic, sure he’s gentle and loyal, but that’s about it. It’s later shown his back story, and it’s just….weird. Not good or bad, just weird and pretty forgettable if you ask me, unless you enjoy of disgusting science projects.\\n\r\nSo that’s pretty much everything about the Ai Enma and friends crew, all what’s left is the new girl that serves as the “victim” of this season and should cause conflict to the Jigoku Tsuushin. Now let me tell you this, if this was an attempt to create another Shibata, it failed, miserably. She’s plain as all hell, nothing in her personality feels unique and, in fact, she’s pretty undeveloped, and with all the episodes they could have used to do this, it’s inexcusable to leave the lead character to be as interesting as a cardboard box. She also feels pretty obnoxious due to her ideals of “sending to hell others is horrible” when she barely does anything to avoid this, let alone to understand why some people access to such a service. Her main hobbies include sleeping and taking baths at the worst moments possible, and that’s about everything I can say about her. She’s generic, boring and dull. In case anyone wonders how the characters involved in cases are, you’ll be better without knowing. They are all incredibly stupid and selfish beings for the most part that just want to get rid of things on the easy way or lack any sort of logical fundamentals.\\n\r\nThe music is…..forgettable, none of the new songs were memorable or fitting in my eyes, which is pretty damn disappointing considering I loved both of the previous seasons opening themes. \\n\r\nThe only thing I can praise about this season is the art style, it still holds the charm of the series, but it feels slightly worse due to the poor atmosphere presented at times.\\n\r\nIn the end, Jigoku Shoujo Mitsuganae is nothing but a disappointing piece of trash with no redeeming quality. It offers nothing new to the series, the cases are terrible, the characters are highly dislikeable, certain scenes are just plain unnecessary and disgusting to watch and it just feels like it drags on forever. I have no clue if this holds a good set of final episodes as season 2 did since I gave up on episode 23, but it’s impossible that could have happened. This has easily become one of my official least favorite anime of all time, right there alongside Neon Genesis Evangelion and Ikki Tousen. I’ll give Mitsuganae an abysmal 1/10, and just because I can’t go any lower in this site, otherwise, I’d consider using even negative digits.\\n",
            "date": "2011-10-08T19:21:00+00:00",
            "helpful_count": 13,
            "mal_id": 45133,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/368533.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/nunchuk28",
                "username": "nunchuk28"
            },
            "url": "https://myanimelist.net/reviews.php?id=45133"
        },
        {
            "content": "I've been a fan of both anime producers and anime songs(artists). but for this season, i did like the fact that enma is back. but the fact that she possessed a girl to take her form(enma form) i didnt like it. same w/ the op of the anime. i think Snow can make a better song for it. but it's worth watching for the sake of curiosity.",
            "date": "2008-10-24T02:40:00+00:00",
            "helpful_count": 11,
            "mal_id": 8898,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99282.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/huhahu68",
                "username": "huhahu68"
            },
            "url": "https://myanimelist.net/reviews.php?id=8898"
        },
        {
            "content": "First of All, watch Jigoku Shoujo Mitsuganae if..\r\n- You are JS or Ai Enma fan\r\n- You have seen both the season, and want some 'hell-grudge' stuff\r\n- You are not bored of people going to hell\r\nJigoku Shoujo Mitsuganae follows after the second season of the Jigoku shoujo Series. As spectacular the first and second season were, the third fails to appeal to that level. Even though this season has its own appeals, its not THAT great!\r\n-------------------------------------------------------------------------------------------\r\nto elaborate:-\r\nSTORY\r\nBasically, JS3 continues from the 2nd season. As the season starts  Ai Enma doesn't have her body, so she passes judgement through the body of a girl, yuzuki. asthe same People are going to hell in lots! and thats 2 for no particular reason. if your hate is enough, even the innocent go to hell. that's particulraly happening here!! Yuzuki is able to see people going to hell, and helpless when she finds out the reality. She is later told to be the future Ai Enma, thtas her destiny (good cliche 4 Ai Enma LOvers).... so in the end,.. Ai enma is the life-saver and takes the burden on herself saving Yuzuki.... \\n\r\nhow? watch the series (that's if Ur curious enough)\\n\r\nThe series has its own twist and turns but has tonnes of fillers filled in. i you skip those its almost a short series of 10-12 series, thats all! \\n\\n\r\nART and SOUND\\n\r\nThe art is magnificent as ever. The animation has improved and is very appealing to the show.. at least that keeps you glued to the screen. Even the OST of the series is nice. the OP is good, but i prefer Snow's OP style as the have done in the previous series. the ending is also quite spooky. \\n\\n\r\nCHARACTER\\n\r\nhere is the new parts. Ai Enma has a new member,Yamawaro  along with her three companions, Hone Onna, Wanyūdō, Ren and Kikuri.  Yuzuki's part is dull, but her life is full of twist-turns. she has a past quite similar to Ai and is always connceted to the hell corresspondence website or to the people using it . and what else, new characters and new short stories in every episode. Intrestingly, Tsugumi Shibata, the daughter of the journalist in the first season has her apperance in the season and a vital role.\\n\\n\r\nENJOYMENT\\n\r\nNot as much as the previous seasons, but it still is entertaining is you like the entire concept and set-up. you get to see various emotions that tend people to send people to hell. \\n\\n\r\nOVERALL\\n\r\nBeing an JS fan, i enjoyed the season. i suggest you don't keep much expectation with the series, at least don't compare it with the previous seasons, to enjoy the season to its fullest. this season has its own stage set up, characters placed and concept running, just sit back and watch people going to hell for stupid and irrelevant reasons. Enjoy the wrap-up season of Jigoku shoujo becoz i don't think more will be coming!\\n\\n\r\ni give, Jigoku Shoujo Mitsuganae- ******* stars!\\n\r\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\\n\\n",
            "date": "2011-12-06T00:18:00+00:00",
            "helpful_count": 8,
            "mal_id": 48663,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/464043.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ambertsarina",
                "username": "Ambertsarina"
            },
            "url": "https://myanimelist.net/reviews.php?id=48663"
        },
        {
            "content": "This season of Hell Girl felt like a step down in quality compared to the quality of the second season. Mitsuganae retains the elements you would find in the first two seasons of Hell Girl where a victim browses the Hell Correspondence site to send their tormentor to hell, thinks over the decision and sends said tormentor to hell when they reach a breaking point. The elements of flawed and sympathetic elements found between the victim and tormentor of each episode are retained from the second season as well. Anyone expecting a change from the same repetitious developments found in Hell Girl's past two seasonswill be disappointed to know that the series leaves them intact. This season introduces a new companion for Ai's group in the form of Yamawaro, whose character gets his focus in a later episode of the series.\\n\\n\r\nMitsuganae also creates a more ongoing story focus between Ai and new character Yuzuki when Ai possesses the body of the middle school girl to resume her duties as Hell Girl. Yuzuki finds herself pushed to her breaking point throughout this season as she gains a role somewhat similar to the Shibatas from season one which she tries and fails to prevent anyone from making use of the services of Hell Correspondence, as well as developing a supernatural connection to Ai. Hints are dropped throughout the season that Yuzuki's life is not as it seems as Ai exposes her more to the harsh realities of man's most selfish traits.\\n\\n\r\nIt does become apparent at points that Hell Girl is starting to run out of fresh ideas for this season of the series, particularly with the role of Yuzuki's character and what we eventually learn of her past. Compared to the past two seasons, the tragic dilemma with Yuzuki connecting her to Ai is poorly contrived and skewers into melodramatic territory compared to the Shibatas from season one and Takuma from season two. In addition, a number of the punishments that Ai and her companions inflict upon tormentors before sending them to hell were a bit on the silly and ridiculous side, not consistent with the horrific images they left said tormentors from earlier seasons. It is these major reasons that make me rate Hell Girl's third season at a lower rating compared to the last season.\\n\\n\r\nHell Girl Mitsuganae retains the colorful and detailed visuals found throughout the past two seasons with animated highlights shown through a number of the punishments Ai's companions are involved with and a new one in the form of Yuzuki's transformation into Ai while she is possessed. Much like the past two seasons, there are reused animation frames apparent during these scenes as a result of said repetitious developments. Some of the show's musical tracks from the prior two seasons are retained for this season, though the OP and ED musical choices do well at complementing the tense and mellow moods respectively found throughout the series.\\n\\n\r\nWhile Hell Girl Mitsuganae does introduce a couple new characters connected to Ai, this season of the series doesn't really offer up much new from what the prior two seasons provided to me and carries some significant flaws compared to the second season. Still if you have pressed on with Hell Girl for this long and are still interested in continuing the franchise, this season is a decent look provided that you understand that it still offers up much of the same thing from the prior two seasons.",
            "date": "2011-06-22T09:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 38143,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=38143"
        },
        {
            "content": "I've seen the 1st and 2nd seasons of Jigoku Shoujo, so upon learning that there was a 3rd, I immediately made sure that I get a copy... Unfortunately, it took me some time to get all the episodes...\r\nMain Characters: Enma Ai, Hone Onna, Ichimoku Ren, Wanyuudou, Kikuri, Yamawaro and Yuzuki\r\nStory: 6/10 - the ways on how people were put to hell were still interesting... however, it gets boring since the flow of the episodes are the same... it was not necessary to drag the story to 26eps... i think 12eps will suffice... this is the first time i had to fast-forward an anime just tosee the ending... \\n\\n\r\nArt: 7/10 - i'd say the art/drawing is not too colorful but not really bleak... i guess they had to consider that this is a horror genre... 1 thing i noticed though, they focused too much on the eyes that sometimes you cannot see the mouth anymore... i think the story of the manga artist and how he was put to hell was uniquely funny...\\n\\n\r\nSound: 6/10 - BG is okay... eerie but not to the point of scary... not loving any of the OP/ED songs...\\n\\n\r\nCharacters: 6/10 - i love Enma Ai and her team (esp Ren)... i still love their bond and i'm all for the Hell Team... but for the 3rd installment, there was nothing new... Yuzuki's story was so slow that i lost interest in her until the last part... \\n\\n\r\nEnjoyment/Overall: 7/10 - if not for the ending and the re-telling of Yuzuki's past, i would've rated this as 6... \\n\\n\r\nI think this series was intended for the bullies, the corrupt, the selfish and the hopeless people... the bad guys get sent to hell by the hopeless ones -- well, one can dream, right?!\\n\\n\r\nHow I wish we have our own Hell Hotline...  :)\\n",
            "date": "2011-08-02T07:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 40635,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/519987.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BBHood22",
                "username": "BBHood22"
            },
            "url": "https://myanimelist.net/reviews.php?id=40635"
        },
        {
            "content": "This is a review talking about all three seasons of Hell Girl. (There are some spoilers of the first two seasons and the main points of what this season has. And this is mixed with my opinion)\r\nIf you want to avoid spoilers, read the conclusion which gives you an advice.\r\nThis is my first time (and probably only time) writing a review. \r\nFirst season is where the story started with some intriguing/interesting stories (As a bonus, there were 2 supernatural episodes) about revenge, then the Shibata’s make an entrance and the story will make you hooked to know what will happen. It introduced the Shibatas’ andEnma Ai’s backstories.\\n\\n\r\nSecond season is where it continues, again with some (but few that had quality) interesting episodic stories of revenge. This time, there wasn’t an opposite side who tried to stop Enma unfortunately, but it introduced her companions’ backstories (2 episodes hinting at them and 3 where they actually tell you about them). This season continues until one of the characters (involved in the episodic stories) starts getting the after-effects of Enma’s actions which eventually led Enma into reacting to the situation. This was followed by a conclusion to Enma’s story. Not a great ending but still good nonetheless, with a scene or two as a cliffhanger.\\n\\n\r\nThis is it. This is where you should stop. If there was something added to Hell Girl, it should be a movie, OVAs or a “Director’s Cut” version of the last episode to omit the cliffhangers to make it look like a proper conclusion. If there was any sequel, one would like to know who’s the Grandma? Will we see her? What did she say to Shibata that one time? Will we see that psychic guy from the 1st season? Will the spider stop from creating another Hell Girl? Did the Shibatas’ had a happy ending? Will Enma’s companions stay free? \\n\\n\r\nHeck. I can ignore all these questions and be content with that ending. But guess what? Here comes the 3rd season which answers to all of those questions by a ‘No!’\\n\\n\r\nThird season has, like, only 3 episodic stories that made me interested excluding the plot/main character related episodes (Yes, three. I counted them and this is just me). Oh you want to know about the main story? There was none, of course! This season introduced 2 new main characters, and, all it did was this:\\n\\n\r\n>\tIntroduce the backstory of the one of the new MCs (Yamawaro). (+)\\n\r\n>\tTells you the situation of one of the returning MCs (Tsugumi), and it was (imo) a bad ending. (Not to the point of death or being sent to hell) (-)\\n\r\nAll the information about their status was already implied in the last season (Tsugumi being alone which only means one thing), so nothing new apart from ruining her good ending from the first season. (-)\\n\r\n>\tIntroduce the backstory of the second new character (Yuzuki) (+) and from here, it led to the ending that ruins Enma’s conclusion from the last season. (-)\\n\\n\r\n… And, that’s it.\\n\\n\r\nI don’t know what was the point of this season. Maybe they were planning on making another sequel which was cancelled? Even if it was cancelled. Couldn’t they release something (like I said before) to remove the bridge toward the 3rd season from the 2nd season’s last episode? Anyway, I’ll just pretend that this season doesn’t exist.\\n\\n\r\nConclusion: Hell Girl is a great series. I recommend watching the first 2 seasons and you have your complete story. You didn’t have enough of Hell Girl, maybe? It’s your choice, just lower your expectations and consider this season as a non-canon extra.",
            "date": "2016-10-04T01:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 231065,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5332631.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Raccoon_Citizen",
                "username": "Raccoon_Citizen"
            },
            "url": "https://myanimelist.net/reviews.php?id=231065"
        },
        {
            "content": "i didn't like the plot of story in Jigoku Shojo Mitsuganae that much, that Emma Ai come back, but i like that she got more emotional in the third season. and the cause in this season it not good as the last 2 season. this season the client pull the string because of jut hate ppl.",
            "date": "2009-03-25T13:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 13468,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105345.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kikuchimera",
                "username": "kikuchimera"
            },
            "url": "https://myanimelist.net/reviews.php?id=13468"
        },
        {
            "content": "This is a review for those who've watched the first two seasons of hell girl, if you haven't watched hellgirl by now you need to start with season 1.\r\nEverything about Mitsuganae is mediocre compared to the first two seasons.   While the first season wasn't perfect by a long shot and many critics had lots of issues with it, Mitsuganae (the third season) is a disaster compared to it.  With season 2 being the best.\r\nThe problem is that the third season has the same problems as the first, except this time it's obvious the writers ran out of ideas.  The repetitive plot/ revenge structure with an episodic nature comes to dominate mitsuganae once again with a \"main plot\" that is just so poorly written into the vast 26 episodes that the plot comes out nonsensical.\\n\\n\r\nMost of the 26 episodes of the show is filled with filler material.  There are maybe 6 episodes total that have anything to do with the main plot and the rest can be skipped.  The 'new plot' they came up with for season 3 is just hackneyed.  The plot is basically hell girl possesses human girl and hell girl has to save the girl she possesses.  The problem here is that hell girls finale in season 2 was having hell girl be released from her role as hell girl and finally getting to die.  So the plot begins with a deus ex machina, which is just amateur level writing.  They never came up with a believable reason for why she is back.\\n\\n\r\nThe producers also went and made huge radical changes to the characters and cast so it throws off the FEEL of the characters they established in the hell girl universe. \\n\\n\r\nThe plot involving possession is just so forced and convoluted that it turns off the long time fan.  Each episode of mitsuganae feels rushed and it feels rushed because the characters and their motives were not written well at all.   The main problem with mitsuganae is the characters in each episode take revenge for the dumbest and most unbelievable reasons.   Hell girl and mitsuganae relies on characters in each episode beside the main cast never appearing again.   So the fact that the characters are not believable goes a long way to making the whole show a tired excercise of you trying to tolerate its badness to find the good episodes that make any kind of sense instead of wasting your time.\\n\\n\r\nIf you're a hell girl fan watch season 1 and 2 and skip 3 in order for you to not end up with a bitter aftertaste in your mouth.",
            "date": "2012-12-11T08:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 79938,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/super88",
                "username": "super88"
            },
            "url": "https://myanimelist.net/reviews.php?id=79938"
        },
        {
            "content": "I don't normally feel the need to write reviews, but I felt rather, disgruntled, after watching this through to the end. Maybe this is the sort of, wait a day after watching then see if you want to write a review sort of situation? Eh, screw it. If you enjoy the main focus of the story, the 'calling upon Hell Girl and watching her banish people' no matter how trivial or silly some of the reasons become, then you will still like this. However, if that isn't all you are looking for, then you will be disappointed. I know I was, despite wanting to likeit.\\n\\n\r\nMaybe we should start with what was good? First of all, the sound and the art were good. The visuals, sound effects, and music, were really quite nice and add something special to this show. When it comes to the 'the person is going to hell, here is the pseudo-torture scene' sections, they got a bit lazy. However, they also recycled the 'transformation' scene just like they did with the 'flying flaming carriage' scene in the first two series. That got kinda tiresome. The music was nice, but there was little to no variation to it, and if you -actually- listened to it long enough, it got boring.\\n\\n\r\nThe characters are all still as you remembered them, with an extra side character added to Ai's cast of servants. Yamawaro gets a single episode to flesh out his backstory, like the others, but gets little to no other sources of exposure like Ren, Hone Onna, and Wanyuudo did in the other series, and do in this one, acting as her eyes and ears. He is mostly just there to support the most annoying character in the entire world, Kikuri. Why they added her in I do not know. The show would be vastly improved if she was gone. Seriously, we know who she is now, we found out in the second season, why is she back? There is no reason for her to be back.\\n\\n\r\nAnyways, lets get to what I wanted to talk about, and what really annoyed me: the story. If you are reading this without watching the series first, just know that it is bad, and move on. It is bad. That is it, its bad.\\n\\n\r\n*Warning, Spoilers*\\n\\n\r\nThere is a glaring plot hole, in the very first episode. After the last series Ai is no longer the Hell Girl, she became human, then died. So, why is she back? It is never actually explained. You can make a few guesses. She is back because she hasn't truly left her hatred behind, and so cannot go to heaven or hell? She is back because the master of Hell has pulled her back into doing her old job? She is back because she has to pick a successor? She is back because the plot gods demanded so for a third season? All I know is that this annoyed me throughout the series.\\n\\n\r\nIn the end it seems it is because she has to pick a successor? Maybe? If you take a leap of faith and make that assumption, because they still don't explain it to you. But even if that is the case, why? Why does -she- have to? That isn't really explained either. Can't the master of Hell just pick a new Hell Girl like he picked Ai? Why couldn't he have shown Yuzuki the truth about her life, and created a new Hell Girl? Seriously, that is what Ai did and it worked, but it took 26 episodes. The first 12 of which have nothing to do with the plot at all. Maybe they are there so that you start feeling for Yuzuki, and her friend Akie, you know, drive the character development along, but that fails. She does exactly what Hajime and Tsugumi do in the first season, which is fail at trying to prevent everything from happening, and even at times, helping it to happen!\\n\\n\r\nOH, and speaking of useless returning characters, guess who is back? Tsugumi. Yeah, it was neat seeing her in the second season for that short amount of time, a brief cameo appearance, but now she is back as a character (for the latter half of the series) and does absolutely nothing. Nothing. In fact, she is almost more annoying than Kikuri because she does about as much, and isn't a cute loli anymore. She has two important scenes, the first is at the festival at the portal/gateway, the second is explaining to Yuzuki that her life is a lie. Both scenes could have been done by other characters, easily. Especially the latter example, because Ai goes and explains it to her anyways, revealing her past.\\n\\n\r\nTurns out Yuzuki's life is a lie, and she is a ghost. Nice, a Sixth Sense move. Somehow though she is living and participating in human society. Her friend Akie comes over, but doesn't realize the building is derelict? Her teachers don't realize that there is no paperwork on her, because she died a decade ago? Somehow she lives the normal life of a middle-schooler without anyone around her noticing? This isn't explained very well. Just that everything has been 'an illusion'. But then why does she care about Akie? Why does Akie become her companion? It all just -almost- makes sense, and -almost- works, but it just doesn't get there. That is what got me so upset. I watched 26 episodes waiting for it to get better, after the first 12 it does get better, yay! Validation! But wait, then it starts to go downhill. Then it ends like it does: like a lukewarm beverage on a hot day. Not satisfying in the least.\\n\\n\r\nI hope you enjoyed my angry inane ramblings that I have written at 3:30 in the morning.",
            "date": "2017-04-12T00:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 245299,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/459610.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/RanmaChanFC",
                "username": "RanmaChanFC"
            },
            "url": "https://myanimelist.net/reviews.php?id=245299"
        },
        {
            "content": "If you're a fan of the Jigoku Shoujo series, you gotta watch this one!  It still deals with people being sent to hell, but Ai Enma got resurrected to Yuzuki's body. One thing I didn't like about the series is that the main plot starts again late in the series. They didn't also explain how did Ai came back... But I still enjoyed it especially in terms of the OST's... (The ones being played when Ai is about to send a person to hell)...",
            "date": "2009-06-10T21:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 15659,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/189324.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nalferd",
                "username": "nalferd"
            },
            "url": "https://myanimelist.net/reviews.php?id=15659"
        },
        {
            "content": "Enma Ai returns with Season 3! After the events of the previous season, Hell Girl will have to find a body to work. Yuzuki Mikage was living an ordinary life until Ai possessed her. Now, Yuzuki will have to see the job of Hell Girl personally and so begins another battle between the Hell Girl and an individual who wants her to stop.\r\nVery similar to season 1, Mitsuganae will still bring you the stuff you want. The possession part is new, but won't be too much of a change to the overall story. The old team of Hone Onna, Ren and Wanyudo will return, butnot without the annoying brat Kikuri. A new follower Yamawaro, a young boy whose past will be revealed soon, is also introduced. Also a familiar face will return.\\n\\n\\n\r\nI will note one thing and this can be a spoiler as well: the story will develop very differently from the 13th episode. Apart from this, I really can't comment much. Like the previous seasons, better seen than read! Go and watch it.\\n\\n",
            "date": "2010-10-01T03:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 30954,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hangbin9",
                "username": "hangbin9"
            },
            "url": "https://myanimelist.net/reviews.php?id=30954"
        },
        {
            "content": "***This review contains spoilers for prequels of the series***\r\nSo it is recommended to ones who finished 1st and 2nd seasons\r\nThe third season of Jigoku Shoujo is still conceptually the same, keeping rather dark atmosphere with faint rays of hope glowing, and then fading. But this time it is getting really absurd, I mean it not in a bad way though it is hard to get the point, the situations pictured here are now even more absurd. Yeah, people tend to act irrationally, especially being filled with hate and wrath, and the consequence are not pleasant at all. But what for are we shown that? Tomake us hate hell correspondence? Or to laugh at those [tragic] scenes?\\n\\n\r\nStory is still episodic, but now we again get a character who is opposing Enma Ai. Her name is Mikage Yuzuki and she is a little resembling Shibata Tsugumi. And the narration is shifted to the perspective of the new character. Rules are still the same, not changed from first season. We see Mikage Yuzuki attempting to meddle and change the situation for the better, but you probably guessed that it's futile.\\n\\n\r\nWe have already been shown impressing stuff, like episode 23 of the first season where innocent girl is being sent to hell, where even usually emotionless Enma Ai is wavering. This episode really meant that Hell Girl is the thing that better not to be in this world. I wish they did more explanations and development of the story at that side, but this was cut with a short phrase \"it is not up to us to decide this\". In the end of second season we saw people in one town massively accessed Jigoku Tsuushin, which merely caused whole town's extinction. But now we get stories where people have very weird motivation of sending others to hell despite immense cost, going to hell after the death in afterlife. It really often made me think that people need not Jigoku Shoujo services, but a psychologist and/or psychiatrist. Because the root of the problem is within themselves and not in the outside world. So it is like they try solving every problem with it. In fact in previous seasons there also were such stories.\\n\\n\r\nThe incongruity I still cannot understand, the idea that only people possessing strong hate can call Jigoku Shoujo, it must have eliminated above mentioned absurd cases, but why it did not? Possibly that it is based on person's initial hate, at the moment of getting straw doll. Often case is almost resolved without untying red thread and the hate seems to be gone, but there is still a bad ending [straw doll used].\\n\\n\r\nThis time art is having just a minor changes, but I think they did too many repeating scenes, most events take place in one town so there is a limited amount of great view scenes. I don't mean that it is bad here, it is on the same level with previous seasons.\\n\\n\r\nMusic is good and atmospheric, like the previous seasons, but just this time I didn't like OP and ED soundtrack enough not to skip it. Seiyuu are doing a great job.\\n\\n\r\nIn the end you expect to see some philosophy of Jigoku Shoujo and Jigoku Tsuushin existence that everything here wasn't meaningless and vain, but disappointingly they throw some vague ideas. Though they do point positive sides of it's existence, but it doesn't sound solid, neither making you believe it. If you liked previous seasons, I recommend you to watch the 3rd as it has various interesting points of view.",
            "date": "2017-01-07T12:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 237721,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4090177.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/highfeel",
                "username": "highfeel"
            },
            "url": "https://myanimelist.net/reviews.php?id=237721"
        },
        {
            "content": "The series exploring certain states of the humans psyches, which when collided, lead to conflicts, unrest, suffering, and eventualy, \" pulling THE red string \", that ultimately only brings the prosperity of Hell, through the job of the Hell Corespondence and it's 'employees', Enma Ai and Co. ; Jigoku Shoujo, continues with it's 3rd season. \r\n( Story and Characters ) After her...disturbing departure at the end of the last season. Enma Ai, supernatural maiden, contractor of souls, once again does her stuff in this realm, this time, without a body of her own, having to manifest herself using a school girl asa medium. Most of the events are centered around the school this girl attends. Oh school, thou eternal setting of the japanese animes, smoked and resmoked till the fucktop heights of clisheeic glory !  \\n\r\nYet rightfully a decisive moment in the lives of all, and the place for so many tragedies to unfold.\\n\r\nHer old, more or less, equally hellish companions, now with a new recruit, arrive as well and reunite, sensing their old mistress around. Usually only cool spectators ( untill they had to do their part of the contract ), they are more humanized than ever before in this season, sometimes showing human like empathy towads the protagonists of the episodical \"plays\".\\n\r\n\" Episodical plays \", meaning the format hasn't changed, it's still one story per episode, exception making the plot episodes, which are strategically scattered throughout the season, but mostly bunch up in the last quarter of the anime. \\n\\n\r\nAs for the music, I can't help but imagine at times, a mother bird, that, through a trill of tragical beauty, deplores the cruel fate of it's helpless children, that unknowngly condamn themselves to reliving the play of damnation, the one that ever repeats itself in essence, with only the dolls changed...\\n\r\nOther times, it seems like it's fate, laughing without discern behind the humans' backs. This contrast, this creepying feeling draws attention. So do the sound effects, the sound is very well created. \\n\r\nThe art also does its part well. I specifically remarked the vividity of the colours, which, when placed on a faded background, again, create a contrast that draws attention. The red colour is especially vivid in key moments, contributing to the omonious feeling. The intensity of light and contrast also suffer sudden changes, amplifying the effect even further. Sure, we've seen that in the first 2 seasons as well, but in this season, they've really pushed the music and the art + animation one step further. \\n\\n\r\nThis 3rd season distinguishes itself from the first two, mainly through the originality of the conflicts. There's no clear black and white anymore, with white pulling the string, and the black getting what they deserved. Instead, things get a lot murkier, as Jigoku Shoujo is exploring lesser known parts of the human psyche. Oftenly, keeping the suspense, the doll pops late, and from where you expect the least. This aproach breaths some fresh air into a concept that's grown rather old over two seasons. \\n\\n\r\nThese series come to show how human feelings can be mistaken, and can determine impulsive actions, which can't be undone.\\n\\n\r\nOverall, if you're here, you must've already watched the first two seasons, case in which, I see no reason not to recommend to give this one a try, and end the \" trilogy \". But if you've already beared with Enma Ai and Co., for two whole seasons, you'll probably do the same even without me telling you that. \\n",
            "date": "2014-01-02T16:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 126871,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304863.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AkaenX",
                "username": "AkaenX"
            },
            "url": "https://myanimelist.net/reviews.php?id=126871"
        }
    ],
    [
        {
            "content": "Compared to the previous two seasons, I found the third one to be lacking in story.\r\nAfter the initial episodes it wasn't hard to see that the writers only had a proper script for barely half the episodes and had to fill in the gaps with whatever they could pull out of their rear ends and call it an episode as people suddenly got banished for the most inane reasons. It wasn't enjoyable at all and I had to force myself to get to the good part, the climax build-up where the plot development sped up greatly and the pieces came together for the finale.\r\nWhile Idid like the first few episodes and the build-up leading to the satisfying climax, the episodes inbetween jumped between being interesting and pure garbage which severely lowered my thoughts about this season.",
            "date": "2015-05-21T04:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 188318,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Auralice",
                "username": "Auralice"
            },
            "url": "https://myanimelist.net/reviews.php?id=188318"
        },
        {
            "content": "Hell Girl is one of my favourite series, in fact in my top 5 list. Absolutely loved the first two seasons. While I was pretty reluctant to accept the fact that there is a new Hell Girl, I was also quite excited to see what would unravel. \r\nGuys, this was a major flop. If you had high hopes for this, just drop your expectations and watch this if you have time to kill. \r\n***SPOILER ALERT***\r\nThis is my personal opinion, you don't have to agree with me:\r\nYuzuki is incredibly naive, annoying and just hypocritical. She goes around telling people that accessing the Hell Correspondence isn't theonly way out yet she pushes for Azusa's Hell Sending. After seeing so many people wanting revenge, does she not even realize that these people were actually suffering? Also, she pushes for people NOT to pull the string because (in my point of view), that's what she thinks is right to HER. People are influenced by strong emotions so of course they'll want the fast way out when it comes to pain. Yuzuki also doesn't do her research on Hell and Hell Girl but just forces her way through everything - a routine for hundreds of years cannot be changed by a random Hell Girl \"reincarnate\".\\n\\n\r\nThat's about it. Anyway, all I liked was the animation for Ai - her eyes are goddamn beautiful as always, and the flowers at the ending.",
            "date": "2017-08-27T11:15:00+00:00",
            "helpful_count": 0,
            "mal_id": 256354,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/282158.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/sjsheying",
                "username": "sjsheying"
            },
            "url": "https://myanimelist.net/reviews.php?id=256354"
        },
        {
            "content": "But of course, as the last season is so much as a one hell of a cliffhanger, it is given that we want to see what really happened.\r\nThere’s a long review coming…………\r\nAbout the STORY\r\nJust when we thought the team was disbanded with the disappearance of our beloved “OJOU”, the team is gathered again for more revenge than ever. This time the drama is tripled and much theatrical than ever and when I say much theatrical as in way much theatrical compared to the previous ones. It even looks like they are actually enjoying it when it is more theatrical. And as weird as it seems,it is even funnier. Things are more complicated and twisted but so much more exciting when Enma Ai is seemingly retiring and actually has a replacement already. But of course, let’s not forget the revenge of the “CLIENTS” which are the most exciting part of this amazing series. It is a lot more anticipating, twisted, complicated, and exciting. Every story genuinely leveled up from the previous seasons. It’s a little bit different now as literally almost all the “REQUESTS” are happening in one place or at least around the one with the connection to Enma Ai. That is why the main characters are in one place all the time which never happened before. \\n\\n\r\nAbout the CHARACTERS\\n\r\nI am really dying to know what happened to the companions of Enma Ai after what transpired in the last season and to my delight they are living normal lives. Enma Ai’s family gets even bigger with the arrival of another mysterious being that also joins in their very theatrical revenge. There are very mysterious recurring characters such as the nurse who we should all be familiar with and of course the most mysterious of all, the girl who have a connection with Enma Ai much like what the mysterious nurse had when she was younger. Both had very unfortunate and tragic fates. There characters are very much intriguing and interesting. The bad doers are a lot nastier and as always there are more twists to their characters. The “CLIENTS’” backgrounds are more interesting because of more complicated and twisted things so it is more anticipating. If in season two, Kikuri was a lot creepier, oddly enough, this time she serves as a comic relief in the series. I just love it whenever Ai says some amazing yet so harsh lines. There is so much reality in her words which is why it really becomes so cool. \\n\\n\r\nAbout ENMA AI/JIGOKU SHOUJO\\n\r\nI think that Ai is still perfect for the role of Jigoku Shoujo because she knows very well that their work is neither a punishment nor justice. She doesn’t let any emotions cloud her judgment and put some crazy hypocrisy with their work. She knows that it is neither a noble nor a curse job. It just happens that it is their job, as simple as that. This is the very reason why I just love their group because they are not necessarily the best characters but at least they are not hypocrites that would put silver linings with what they do but still have pride about their work.\\n\\n\r\nAbout the ANIMATION\\n\r\nThe animation just keeps on getting better and better. There are a lot more artworks compared from the previous season particularly when Enma Ai and Yuzuki are separating during a revenge. They made sure to live up to the great animation of the previous ones. Oh! And let’s not forget the much anticipated change on Enma Ai’s beautiful KIMONO.\\n\\n\r\nFor the last time, let me just say that this series is not about whether it is right or wrong to have revenge because in reality the world is not as simple as right and wrong. It is way more complicated than that more importantly when it comes to human beings which I strongly believe what the series amazingly had shown us. Like what Enma Ai would always say that REAL HELL is inside of every each of us. A crazy reality checked that every character in this franchise learned in the most painful way when they tried to stop the revenge. And Tsugumi explained it amazingly with so much truth and reality into it.\\n\\n\r\nWell, THAT’S A WRAP EVERYBODY. This concludes to the very tragic yet still so amazing journey about grudges and revenge of human beings. No one showcased the human behavior like this franchise did. I am more intrigue, interested, and eager to study the human behavior even more. As much as I am hoping and praying that this series will never ends, this season really gave such an epic closure for this brilliant series. I am going to miss Enma Ai and her family so much.\\n",
            "date": "2012-12-10T05:34:00+00:00",
            "helpful_count": 0,
            "mal_id": 79758,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79758"
        }
    ]
]