[
    [
        {
            "content": "*A great entertaining product by SHAFT backed with hilarious out-of-the-blue jokes.*\r\n\"I-I don't even understand the letter C in Catholic!\" - Miyamae Kanako\r\nIf I was asked to describe Maria + Holic in one word, I believe “wordy” will suit this show perfectly. The amount of monologues in the show is tremendous! Plus the “rail gunning” of words shooting back and forth between the characters simply makes the anime difficult to follow without pauses in between (assuming you need to read the subtitles). And the occasional weird reference to various things also contributes to the complexity of the show for an average viewer. These issues may turnsome potential viewers away, but if you can get accustom to these minor issues, Maria + Holic is actually a rather unique experience.\\n\\n\r\nThe anime itself should be praised for following the manga closely. The entire series covers pretty much the first three volumes of the manga (out of a total of four serialized volumes so far). While certain episodes may seem like fillers, especially if they are not designed to advance the story in any way, these filler-like episodes actually are indeed part of the manga. It should be no surprise that these episodes still manage to be highly entertaining albeit a bit random in most cases.\\n\\n\r\nAs a SHAFT product, those who are familiar with the studio should know what to expect. But if you don’t have a clue, here is a general description. Maria + Holic have high quality animation with good looking characters. Background scenes tend to be overly simplistic to contrast with the detailed characters. What this mean is that while the character usually look professionally drawn, the background often seem like the work of an elementary kid. This may be strange for some viewers, but surprisingly the result is quite pleasant to watch.\\n\\n\r\nThe OP will most certainly take some time to get used to. It is so … unique. On the other hand, the ED makes use of voice changers and the effect turns out quite enjoyable. Frankly, the BGM in Maria + Holic are nothing unique like the OP or ED making them less memorable after the show is done. However, to counterbalance the “average” BGM, we have a few astonishingly stupendous seiyu that can make us forget the pain of the lack of good BGM. Out of the few bright stars in the anime, Yuu Kobayashi is particularly outstanding. In part due to her singing the OP, also her ability to change between two highly different male and female voices make her one of the biggest asset to the show.\\n\\n\r\nWe normally see the male protagonist having perverted thoughts on various female characters in an anime. Maria + Holic is no different except that the protagonist is a girl. And her lust for other girls is stronger than 99.9% of her male counterparts. Here is another good lesson to learn. Never judge anybody by physical appearance alone. Kanako may look like a regular big chest girl in your eyes, but deep down inside she is quite a frightful lady … in a perverted way. It should come as no surprise that she also an openly declared lesbian with a tendency to execute a nosebleed faster than you can say the word nosebleed. The cause of her nosebleed is often due to her encounter with an ecchi scene. In fact, she spurts so much blood that it became a regular routine for the viewers to see her in the school infirmary. \\n\\n\r\nNext we have a very cute looking babe plus an equally sexy voice. She has a good body proportion, excellent grade at school, and is loved by all her classmates. But she is a guy. Yup, you read that correctly. This hot babe is a guy proven and tested, through some grabbing, by our perverted female lead. Maria + Holic is full of interesting characters that will surely put a big happy smile on your face. It is unfortunate that the story has an open ending (since the manga is no where near done either), so fans will just have to be patient for the time being until someday a continuation to the series is announced.",
            "date": "2009-04-01T05:52:00+00:00",
            "helpful_count": 243,
            "mal_id": 13719,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=13719"
        },
        {
            "content": "Maria Holic is a series which starts out with unexpectedly great promise and expectations only to fall on its face and drown itself in a pool of its own blood (literally).\r\nI can’t say that the initial premise of this show intrigued me at all.  Cross-dressing sadists... again?  Honestly I just don’t understand the fascination Japan has with boys dressing up and pretending to be girls, and being creepily good at it too.  Yet when this show was airing, it had some unexpectantly good word of mouth and early reviews so I thought I would give it a chance.  Our protagonist isKanako, a transfer student to an all-girls Catholic school that her mother went to and met her father.  That should’ve have been a warning sign right off the bat but I was distracted by beautiful character designs and lovely artwork.  Kanako is \"allergic\" to men; she breaks out into hives when coming into physical contact with one, so using her logic going to an all-girls school to meet her destined lesbian lover seems like the right plan.  On the very first day though she accidently discovers the school idol, Mariya, is actually a man and he immediately begins tormenting her so she will not reveal his secret.\\n\\n\r\nThe comedic possibilities are there for an amusing series.  However though I was initially impressed with it after a few episodes it soon became quite apparent that the writers for Maria Holic only had about six gags.  So we get to see those same gags over, and over, and over, and over, and over.  Get the point?  The humor becomes repetitive and quickly boring.  While the humor is definitely on the dark side it’s just not funny.  Unless you think transsexuals, lesbians, and rape threats are uproariously hilarious that is.  The story... um what story?  That’s right it goes nowhere!  Maria Holic has a serious case of ADD as it just meanders around to its ending, or I should say its last episode, since there isn’t one.\\n\\n\r\nAs much as the story overall sucked, it doesn’t even compare to the steaming pile of turds that make up the characters.  Maria Holic succeeds in being one of the few shows with an entirely unlikeable cast.  Kanako is initially amusing and interesting but despite the horrible way she is treated not only by Mariya but almost every other character in the show, she still manages to be completely unsympathetic.  Mostly because she devolves into a walking cliché and stereotype.  Her lesbian delusions and resulting nosebleeds start off as being very funny but that is basically all there is to her character.  She becomes more and more creepy in her perversions and bleeds enough blood to fill the bodies of everyone at school.  There is no depth to her at all besides her breast measurements and she remains basically unchanged from beginning to end.  If you expected to learn more about why she is allergic to men or for her to mature as a character your watching the wrong show.  She doesn’t really care about anyone and fantasizes about anyone with breasts who talks to or even so much as walks near her.  To real lesbians I imagine she has to be one of the most offensive characters out there.\\n\\n\r\nMariya, I suppose would be the next most important character.   He/She/It is pretty much unlikeable from the start.  That’s not unusual but nothing happens in terms of character growth and development to make you change your mind.  He is as sick and twisted as you would expect of someone who is forced to dress up like a girl.  So in a sense he is probably the most real and non clichéd character in the series.  A real person in his situation is going to be probably extremely emotionally disturbed.  Much like Kanako he really doesn’t care about anyone and only thinks about how to torment them or how he can torment Kanako further.\\n\\n\r\nThe rest of the cast is just standard uninteresting stereotypes.  To top it off there are too many of them as well.  A short series doesn’t need this many characters.  Especially since over half the episodes are devoted to developing characters that aren’t important to the overall storyline and once we get this information the characters quickly fade into obscurity.  What was the point of providing backstory on them in the first place?  Most likely because the writers knew they couldn’t fill 12 episodes with nothing but lesbian jokes and nose bleeding fantasies (though they did give that a good try).\\n\\n\r\nArt and animation are the strongest aspect of the series.  I really did like all of the character models and the settings were stunning.  It’s a shame that such talented artists and animators were wasting on such a piece of crap story.  The acting is solid but again they aren’t given much to work with.  I did enjoy the OP and particularly the EN theme songs and thought they were pretty cute and original.\\n\\n\r\nOverall Maria Holic is one of the most disappointing titles I have seen to date.  Its initial promise is buried under the weight of overused and mean unfunny gags and a storyline that fails to deliver anything of substance.  I cannot recommend this series to anyone and suggest you stricken it from your list if you plan on watching it.  If, like me, you were unfortunate to see this as well.  My condolences.\\n",
            "date": "2009-07-20T06:35:00+00:00",
            "helpful_count": 200,
            "mal_id": 16969,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=16969"
        },
        {
            "content": "-= So far I've only seen 2 episodes, but please, read my review.=-\r\nStory: The plot, in my opinion, is actually original in some way. A innocent (or perverted) love struck Lesbian who gets hives from males and a cross dressing male who has a sick but yet genius (and or perverted) mind (and quite a secksi face ^-~) meets and conflicts with one another. There is no anime out there with a similar and interesting plot. :P\r\nArt: The art is quite good. The effects they put in work really well with the scene. The motion of the characters is also quite fluid. Also the chibiscenes really help display the comedy of the anime. Even the colors of and the backgrounds work really well together too put you in the mood the director wants you in. Oh yea, don't forget the angles of the scenes! Quite orgasmic. :P\\n\\n\r\nSound: First, the voice actors are very well synchronized with the characters and really bring out the tone of their personalities, also the tone of their voice acting is really good at displaying the feelings of their sorrow, excitement, anger, and etc. The sound effects and background music also really help develop the scenes.\\n\\n\r\nCharacters: As said earlier in &quot;Story,&quot; Mariya and Kanako are quite original and has been already explained why, but the characters can be really funny and entertaining.\\n\\n\r\nEnjoyment: With all those elements combined, of course I'm enjoying this anime. It's very entertaining and funny. :D\\n\\n\r\nOverall (or conclusion): Got five 9s' in a row out of me. It's been pretty fun to watch so far, and I was quite excited about the second episode after watching first. Original story, imagery is great, voices, sound effects and background music is great, characters are original and entertaining.",
            "date": "2009-01-16T13:53:00+00:00",
            "helpful_count": 45,
            "mal_id": 11571,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78404.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Unitedsticks",
                "username": "Unitedsticks"
            },
            "url": "https://myanimelist.net/reviews.php?id=11571"
        },
        {
            "content": "Keep in mind this is a review, not a summary! If you want a summary go to wikipedia.\r\nStory: The story in this show is actually somewhat unique. Dealing mainly with a rather funny (closet) lesbian lead character, Kanako, who has problems with guys (she actually contracts hives if she comes in contact with them) and another lead character, Mariya, who is actually a male cross dresser but looks rather feminine. The actual plot jumps around from episode to episode but has so far remained genuinely entertaining and by episode 6, the larger plot of the show all together is revealed to you.\r\nArt: The animation inthe show is superb, I have only found one scene in the first 6 episodes that the animation (a characters face)  looked just a tiny bit awkward. Maria†Holic has a great opening and the actual show all together has a very unique style to it as well, featuring vivid colors, interesting cut-scenes and slightly unorthodox backgrounds. (I mean that in a good way)\\n\\n\r\nSound: The voice acting is great, the actors voices fit the characters and sync well. Just what one would expect from any quality anime. The music does a nice job of supporting the story throughout the show and I think it fits very well with the overall \"feel\" of the show.\\n\\n\r\nCharacter: The characters are pretty interesting, the lead, Kanako, is damn funny at times while the other lead Mariya with her cruel, shameless humor keeps it interesting as well. They haven't really expanded much on any side characters as of yet, but none stand out to me to be particularly boring. (yet)\\n\\n\r\nEnjoyment: I haven't enjoyed a show this much for a while. Like I said before its quite unique and with some pretty funny moments. The last episode I watched, I must have laughed out loud at least 5 times. The same could be said for the other episodes I've seen.\\n\\n\r\nOverall: While its not the best show I've ever watched, it certainly was one of the funnier shows I've watched. Bottom line: If you like humor in your anime, try to sit down and watch this show, even if your uncertain about the whole lesbian and cross dresser thing, I can bet you will enjoy watching Maria†Holic. So stop reading this and go watch it! :P\\n\\n",
            "date": "2009-02-17T09:58:00+00:00",
            "helpful_count": 35,
            "mal_id": 12505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/92359.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GuitarHero",
                "username": "GuitarHero"
            },
            "url": "https://myanimelist.net/reviews.php?id=12505"
        },
        {
            "content": "“Yay! A gender bender, sort of” That was my original reaction after reading Maria+Holic’s summary. Twelve long episodes later the only words that could sum up what I felt was, “HUGE Disappointment”.\r\nThe story follows Kanako and leads us through her first day at, Ame no Kisaki Academy.  Like every first anything she’s nervous yet excited at being in an unknown place with unknown people.  To really understand this anime you have to know a little about our very own heroine.\r\nKanako is searching for what we all want, the perfect girl. Well, most of us, but true nonetheless. Being allergic to boys sinceshe was young- mainly due to them being “dirty,” and perverts which resulted in her breaking out in hives with any physical contact with them. Enrolling in the all girl academy her parents met at was a no brainier.  Don’t worry it’s explained how her parents met, because I can’t be the only one who misunderstood that line about her parents….\\n\r\nThe first day there, well first fifteen minutes to be exact, she meets the ideal girl, Maria. I know, what are the odds, right?\\n\r\nMaria is perfect. She is delicate, sweet, petite and so graceful. Maria kisses her on the cheek, Kanako swoons, gets hives, and they part for the afternoon. I noticed two things at this point:\\n\r\n1. Kanako isn’t the smartest fish in the barrel.\\n\r\n2. It was going to be a long ride.\\n\\n\r\nThe story from then it unravels pretty quickly in the next two episodes. By that I mean that, yes, Maria is a boy and Kanako does find out she is, he is, you get what I mean. Thus embarks our little Kanako in her lesbian quest. If at any point my words offend you, then this is definitely not the show for you.\\n\\n\r\nWhen you walk in on the girl of your dreams changing and instead see a him, putting on fake breast and girl clothes, eventually the wheels turn in your head and you make up two scenarios:  Aliens invaded Earth and took said girl and replaced her with a male version then disguised him as her to infiltrate an all girl school to brainwash one female at a time and make them their slaves. Or, and I know this might seem far fetched, she is actually a he and is lying.\\n\r\nAnd of course as soon as you realize that it is indeed NOT aliens, you will put your hand up his skirt and touch his manhood to prove your point. Oh wait, not every girl is Kanako. I think she just wanted to take a grab but what do I know.\\n\\n\r\nAfter some threats and ridiculous nose bleeds they are settled in their new room, together of course. The plot mostly stops at this point.\\n\\n\r\nWe see Kanako’s slow and painful process in making friends, and have some WTF moments in the process.\\n\r\nThe use of words like, homo, yuri, and lesbian is guaranteed since in just the first episode our very own Kanako get’s bullied by our very own Maria. It was such a great start too, it had pretty girls, guy in girl clothing and groping. Too bad it had no development and the relationship was too far of in the horizon. Watching Kanako’s internal monologues is enough to make anyone want to slam their head against a wall just to deviate from the fact that you understood whatever she just said. Or, for those less violent of us, at least hold our breaths long enough to make us  feel like we have a concussion. All through watching I kept needing to yell out a  “not all girls think that way!” At least not all the time. My chibi-me keeps a bottle of water around because talking makes her parched.\\n\\n\r\nEpisodes drag on and characters are  introduced and given no depth. The only ones who's past we get enough of a view to care about are Maria and Kanako, but barely and not enough. At the beginning you assume the plot would be about Maria and Kanako building this amazing friendship or even falling in love but alas, that’s not it either. Instead you get lots of nose bleeds from our very own protagonist wanting to see her classmates in her underwear or in bikinis. I am not ashamed to say in the least that Maria would have made an interesting lead girl and makes me wonder why she isn’t since her name is in the title. Maria was what saved this how with her sadistic nature and sharp tongue inducing humor. I really hope the second season is better because absolutely nothing happened on this one, no really, not twelve episodes worth anyway. We get it Kanako, you like girls.\\n\\n\r\nThe animation is something that was great, no matter how you slice it. The sceneries and characters were vivid and the color as per usual was amazing. The voice acting wasn’t annoying and I think Maria’s voice changing was great, and made more sense than when guys pretending to be girls or vice versa don’t change their voice. Always leaves me wondering, really? The intro song was weirdly addicting and it matched with the randomness of the episodes.\\n\\n\r\nThe characters are pretty, with nice animation and sound,  and playful banter that was downsized by all the blood and Kanakos’ horniness, making this one of those anime you watch on mute and make your own dialogue to.\\n\\n\r\nWould I watch it again? Sure, I mean, if I woke up tied to a chair and a voice recorder turns on and a voice says, “I want to play a game...”",
            "date": "2011-04-19T12:10:00+00:00",
            "helpful_count": 25,
            "mal_id": 36223,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400973.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Moon_Light",
                "username": "Moon_Light"
            },
            "url": "https://myanimelist.net/reviews.php?id=36223"
        },
        {
            "content": "Attracted by one of the main character of Maria Holic to watch the series, the infamous Mariya Shidou, only to know that he was actually a crossdressing guy was a heartbreaking moment for me. \r\nAfter the first few episodes of Maria Holic, a comedy/parody/drama anime, I got rather bored. At least 50% of the humor presented in the anime wasn't really that funny, sure it did make me smile or grin for a few times in some of the scenes but there were only handful of scenes that actually made me laugh.\r\nI was planning to drop the series entirely after first few episodes, but thenwhat made me continue to watch was the number of episodes it had; 12. \\n\\n\r\nSo in the end, I then completed the whole series in one sitting. Took me about 4-5 hours to complete the entire series. In those hours, just a couple of scenes were memorable for its funny moments and most of them were pretty much forgettable. Also, watching Miyamae Kanako, the protagonist, nosebleed due to her perverted fantasies  was hilarious, but only for few times. After watching it too many times, the humor gets pretty old. \\n\\n\r\nThe story? Miyamae Kanako transfers to a all-girls high school in order to find her true love. So she first meets up with the crossdressing boy Mariya Shidou then instantly falls for his charms. In fact, Kanako is actually allergic to men; she gets hives whenever she is touched by men. So? It's one of those anime with lots of random \"what the flying fuck?\" moments. So if you're looking for anime with good story, well, you can simply forget about it, cause this anime dont have any. So you're probably expecting ecchi scenes? There are ecchi scenes but only very little. Romance? Quite a lot. But all of the romance are often just within Kanako's perverted fantasies. So don't expect any \"real\" romance in this anime. And actually, I was hoping that Kanako was going to \"end up\" with a girl of her dreams...but she didn't, so that was quite saddening. Again, no romance here.\\n\\n\r\nThe visual? \"Why do many above-average anime have very good visuals?\" That was the first question that came to my head after watching the first couple of episodes. Yes, I have to say that the visuals of Maria Holic is absolutely beautiful. Beautifully drawn artwork and visuals deserves a praise. \\n\\n\r\nBut what surpised me was the studio...SHAFT? I thought the studio was well-known for it's continuously changing visuals(the faces of characters usually changes in some of the scenes that they look like someone else). I recalled the anime Mahou Shoujo Madoka Magica which was from the same studio, but then that anime had so many \"derp\" faces. Maria Holic's visuals, in terms of quality (no derp faces detected), are far more superior.\\n\\n\r\nThe Sound? Another strong point of the anime is the songs, both the Opening theme(Hanaji) and Ending theme(Kimi ni Mune Kyun) are pretty catchy songs. Especially, the Opening theme(Hanaji). If I had to describe the Opening theme with one word, I would go for \"Unique\".  It felt very weird watching it for the first time but then I wanted to watch it every time in all of the episodes. The background music in the episodes were really good too, some nice guitar riffs presented in some of the scenes.\\n\\n\r\nConclusion? So is Maria Holic actually watchable? For me, it was ok, but definitely not for everyone. If you're looking for anime with lots of random, nonsensical moments, then Maria Holic is a decent choice. If you're looking for an anime with lots of good humor,well, there are many better options out there.",
            "date": "2013-03-24T15:03:00+00:00",
            "helpful_count": 23,
            "mal_id": 90781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/34830.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Radeon",
                "username": "Radeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=90781"
        },
        {
            "content": "Ahh, Maria†Holic. Being a natural lover of anything SHAFT churns out of their brilliant studio, I decided to start watching it. If you've seen Sayonara Zetsubou Sensei, you'll instantly feel familiar with the eccentric art of Maria†Holic.\r\nStory - 7\r\nAnother thing you'll become familiar with if you've watched Sayonara Zetsubou Sensei is the story. Not because of how similar they are. No, they couldn't be any more different. You'll become familiar with the nonsensical, silly, parody-esque story immediately. \r\nNow, also like Sayonara Zetsubou Sensei, this anime doesn't take even its own story seriously. If you're looking for a story-driven, deep anime, this is not it. However,if you're looking for a light-hearted, funny story with little relevance but great amusement, this is the one for you.\\n\\n\r\nArt - 9\\n\\n\r\nWell, of course it is great, it's SHAFT!\\n\r\nIn all seriousness, I absoloutely adore SHAFT's animation styles. They employ many different animation styles in just one episode, and they do it comedy. The faces that some of the characters make are just priceless, ranging from chibi sad looking faces to serious, detailed, grizzled jaw and tough looking stares.\\n\r\nSome of the art might seem silly or not serious enough for some people, but as I said in the \"story\" section of the review, if you're going to take the anime to seriously, then don't watch it!!\\n\\n\r\nSound - 8\\n\\n\r\nThere are a few reasons I've given the sound an eight.\\n\r\n1) The OP and ED. They're marvellous. Coupled with more great art, the songs themselves are also really great.\\n\r\n2) Background music. There's always a different piece for each situation, and although it gets kinda repetitive sometimes as it seems to be reused quite often, it is almost always a pleasure to listen to it.\\n\r\n3) Voice acting. One performance that really sticks out for me is the portrayal of Mariya Shidou, voiced by Yuu Kobayashi, who voices Kaere in Sayonara Zetsubou Sensei, Nice Hollystone in Baccano! and Kannon in Umineko no Naku Koro Ni. She does a fantastic job of switching from the feminine voice of Mariya to the threatening tones of her more serious male persona. Of course, all the other seiyuu's do a brilliant job.\\n\\n\r\nCharacter -10\\n\\n\r\nSome of my favourite anime characters to have ever graced my screen. Kanoko and Mariya are pure brilliance. They're funny and well acted, and just great. There are, of course, a great cast of supporting characters to add to the hilarity, making for hilarious situations \\n\\n\r\nEnjoyment - 10\\n\\n\r\nI utterly adored this series... I enjoyed it thoroughly. For many reasons which I have listed above, but to paraphrase:\\n\r\n1) The characters\\n\r\n2) The performance\\n\r\n3) The art.\\n\r\n4) The nonsense story.\\n\\n\r\nOverall - 10!\\n\\n\r\nAnd to wrap up the review, I'll simply say this.\\n\r\nIf you're into Sayonara Zetsubou Sensei, you'll love this.\\n\r\nIf you're into SHAFT anime, you'll love this.\\n\r\nIf you're into comedy, you'll love this.\\n\r\nHeck, if you're into traps, you'll love this!\\n\r\nTruly, there is something for everyone in this gem of a series. I would recommend it to anyone who I thought wouldn't take it seriously, so if you think you're that person, then I whole-heartedly recommend you check it out.",
            "date": "2009-09-01T14:58:00+00:00",
            "helpful_count": 18,
            "mal_id": 18310,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/211875.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ConnorCrook",
                "username": "ConnorCrook"
            },
            "url": "https://myanimelist.net/reviews.php?id=18310"
        },
        {
            "content": "Orientation at Ame No Kisaki\r\nWe stand at the silver oak lined gates of Ame no Kisaki, a Catholic all-girls boarding school, where pretty girls mature into beautiful ladies from the nurturing of Mother Mary’s principles. Ame no Kisaki is a dream of any man, a garden flourishing with budding womanhood. It’s also to dream of any woman, who happens to be a lesbian. Enter Kanako, our token perverted lesbian. She has come to Ame no Kisaki, for one thing, to find her fated lover.\r\nOn her first day touring the grounds she meets Mariya Shidou, young, cute and blonde. Kanako instantly falls in love, befriending herimmediately. They seem to be a perfect match… at least in Kanako’s eyes. But just as fate giveth, it taketh as well. Kanako stumbles into Mariya and to her despair find out she is a boy. To keep Kanako quiet, Mariya takes over the poor lesbians life, torturing her emotionally to keep her mouth shut. \\n\\n\r\nThe setup for the plot was quite humorous. The situation seems incredibly hilarious. But the problem with the story as moves through the twelve episodes is that this situation becomes a sort of side note. The plot is utterly scatterbrained, strung together by small scenes between Mariya and Kanako. By the en of the series were left with the question: What was the point of all that?\\n\\n\r\nGenre \\n\\n\r\nMaria†Holic is mainly a black comedy. It has it funny moments, but the jokes feel over done by the twelfth episode. It somewhat succeeds as a parody of other lesbian anime but that success only lasts as long as the anime is funny. The irritating characters combined with maddening dialogue makes the series a bit of a failure as a comedy. The anime is a bit ecchi, but there is never anything quite stimulating. There is cleavage abounds, but all of it feels presented on a silver platter and unnatural.\\n\\n\r\nThemes\\n\\n\r\nSo sitting here writing this review, I pondered what the maelstrom of monologues and collage of confusing scenes could mean. It was about discovery…I guess. Kanako discovers the joy of camaraderie, surrounding herself with caring friends who were cute to boot. She discovers the tender side of men, collecting the small betrayals of Mariya’s kindness. Its about the discovery of alaria, a spongy algae that expands in water, and seeing how large it could grow in a storm. It’s about the discovery about a missing bra. Though at the end of the day it was about my discovery of the great mindf**k while watching this anime. \\n\\n\r\nStyle \\n\\n\r\nThe art is gorgeous in this anime. There hand painted backdrops look stunning against the colorful character design. The palette is bright and appealing. The use of different animation styles is amusing as in the span of one episode the art direction can switch from bright and cheery, to 300, to a noir film. The music is quite appropriate for a Catholic school, filled choral vocals, organs and violins. The production was one of the rough gems that didn’t lose its luster, as the rest of the anime became a mess, lost in the dirt. The voice acting is hit or miss. Kanako, as voiced by Asami Sanada, is a miss. Her long winded perverted monologues get grating on the nerves and lose their effect. Sanada’s voice is partially responsible, the timbre of her voice getting progressively annoying through each episode. \\n\\n\\n\r\nConclusion \\n\\n\r\nI was hopeful when beginning Maria†Holic. The premise seemed interesting, the characters dynamic and the production was top notch. But soon the dialogue became aggravating, spoken as trades of long monologues between characters. Most of the cast is one dimensional, most of which were unmemorable save for the Mariya's maid for her deadbeat humor. Episodes became more and more disjointed, becoming a hodgepodge collection of tedious scenes. The antics of Kanako and the cruelty of Mariya quickly got old and were not enough to hold the anime afloat for the twelve episodes it ran. I was disappointed to say the least. I could only recommend watching the first six episodes and getting an early transfer from Ame no Kisaki.",
            "date": "2009-09-19T12:24:00+00:00",
            "helpful_count": 17,
            "mal_id": 18926,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160559.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SamFury",
                "username": "SamFury"
            },
            "url": "https://myanimelist.net/reviews.php?id=18926"
        },
        {
            "content": "DON'T WATCH THIS CRAP. \r\nI usually enjoy watching series only for comic reliefs and for laughs but this I didn't have a single shred of enjoyment.\r\nI forced myself into completing the series since I usually complete a whole series whenever I start one but this anime is one of my worst experience.\r\nAll the characters annoying, no story not that it matters in this type of series but each and every time I watch an episode I just wanna hang myself.\r\nThis review is from my worst experience and I don't want others to experience the same so don't watch this anime.",
            "date": "2014-01-16T04:18:00+00:00",
            "helpful_count": 16,
            "mal_id": 128953,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3470409.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Nolifeking13",
                "username": "Nolifeking13"
            },
            "url": "https://myanimelist.net/reviews.php?id=128953"
        },
        {
            "content": "There are few things in the world more subject to taste than comedy, which makes grasping for the objective in an evaluation of maria holic a difficult task.  Take this review with more salt than usual.\r\nI tend to prefer the simple punchlines in the likes of Hyakko or 4 panel mangas.  Mariaholic has none of that, but has a nice balance of recurring gags, non sequiturs, references and self deprecating humor.  Kanako is a closet lesbian genuinely allergic to guys.  She thinks her life has taken a dramatic turn for the better when she steps foot in her new, all girlscatholic school.  The first girl she encounters strikes her fancy (though you will soon learn that just about any girl will do the same), but to her dismay, Kanako discovers this girl is actually a transvestite related to the founder of the school.  Mariya, the cross-dresser, pulls strings to live with Kanako so as to keep her trap shut.  Kanako's complacency makes her a nice toy for the sadistic Mariya.\\n\\n\r\nReading the synopsis, I feared deeply that this would somehow turn into a straight love story, with Kanako eventually overcoming lesbianism as if it were a disease.  Thank god that doesn't come to pass.  There isn't an ounce of genuine romantic tension between the two leads, that is, if you rule out Mariya's moe play that will momentarily seduces Kanako.  The bulk of the series is about Kanako's perversion.  Apparently all the girls at her school, teachers included, are shoujo or harem cliche's, and Kanako has a fetish for each and every one of them.  Nosebleeds and anemia ensue.  \\n\\n\r\nWhile the long soliloquies she'll bust out on the attractive qualities of each girl grow old quickly, along with the inevitable nosebleeds and nurse visits, the girls she fawns over usually lampoon themselves with sharp, self-aware jokes that are hilarious.  One character is socially inept, cold, but honest to a fault.  She'll keep her promises regardless of how inane.  This girl could easily be in the supporting cast of any cheesy shoujo manga, and Mariaholic highlights just how ridiculous her personality is.  She agrees to take care of Kanako, the way you might for any new student, but she takes it to an extreme, throwing herself into each and every one of Kanako's problems with the intention to resolve them, but exacerbates them instead.  To further the parody humor, the animation styles will briefly change, momentarily shifting to a look typical of the genre it is making fun of.\\n\\n\r\nThe whole series is based on Kanako's suffering.  Surprisingly, aside from a few very degrading insults, Mariya doesn't cause much of it.  He may set up a situation and watch Kanako's pain with smug satisfaction, but she's the one who digs her own grave.\\n\\n\r\nBy the end of the series, the parodies will have run their course, and Kanako's sex crazed nosebleeds will have long since grown old.  It may be a novel twist on a harem concept, but the nosebleed joke isn't any funnier for it, especially given how ubiquitous it is in Anime.  The non sequiturs though, kick to the end.  Mariaholic isn't deluged with them in Excel Saga or Pani Poni fashion, so their presence never becomes commonplace.  The dorm mistress who prefers to be called \"god\" is the primary dealer of randomness.  Her hilariously high pitched dog, Wakame seaweed, and a bag with a tentacled alien inside are other examples.  The key to non sequiturs in my view is their recurrence; it must be just as out-of-the-blue as their introduction, and Mariaholic nails this.  Just remembering the utter left field appearances of the alien bag makes me crack a smile.\\n\\n\r\nLike most Anime comedies, Mariaholic loses some of its luster by the end.  If it had continued another 12 episodes, I don't think I could have finished it.  12 episodes though, is a magic number for comedies.  By the time I became desensitized to, or even repulsed by some of its humor, it was close to the end, and the remaining bits of amusement carried me through the rest of it.",
            "date": "2009-09-26T16:19:00+00:00",
            "helpful_count": 15,
            "mal_id": 19135,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/230526.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ace52387",
                "username": "ace52387"
            },
            "url": "https://myanimelist.net/reviews.php?id=19135"
        },
        {
            "content": "Okay the thing is... I just don't get it. I don't get why they came up with such a crappy story as this. It's not very realistic, and it really tries to make you laugh. Which in my case...totally failed. \r\nWell the story is about a girl who's a lesbian that transfers to the school both her parents went to( even though it's a girls school, but I believe they said that her father was a teacher there or something). She transferred to that all-girls-school in the hope to find the love of her live, like her parents did. There is this beautiful girl( Mariya),in Kanako(the main character) her eyes, who turns out to be actually a guy. He saw through the fact that she actually likes girls and kind of blackmailed her. She couldn't tell anyone about it, or else he would expose the fact that she is a lesbian. Well, alright, until there I get the story perfectly. It didn't seem that bad and I thought I might enjoy it.\\n\r\nBut then they totally screwed it up. There wasn't really a story told in it, there were just random episodes of Mariya bullying Kanako in some \"friendly way\". They just throw a lot of random shit at you, that don't make sense at all. Kanako gets a nosebleed from almost EVERYTHING that has to do with girls. And it seems that she really likes EVERY kind of girl. \\n\r\nAs someone who likes girls herself, I found that kind of insulting. I didn't really like it and it gave me a really bad feeling. As if lesbians would just like every girl out there and would get constant nosebleeds from seriously everything( even totally ridiculous things). I just didn't like the image that she gave off of lesbians( and I guess bisexual girls too) at all. I felt totally annoyed watching this anime, the whole time. \\n\r\nI was annoyed because of almost every character in this series, honestly I guess I only liked a few supporting characters. \\n\r\nThere were just a few moments where I thought the story would maybe become a little interesting, but every time they screwed that up in a few minutes.\\n\r\nIt was really weird too that Kanako gets hives when touched by a boy, and the way things go just...weren't logical at all.\\n\r\nIt's really not my kind of anime.\\n\r\nI guess you would like it if you want a random anime that doesn't make sense at all, with some fanservice and just random comedy. It wasn't my kind of humor too, so I just really disliked this anime.\\n\\n\r\nThe only thing that I actually liked about this anime where the Opening and Ending Theme of this anime.",
            "date": "2012-10-23T20:24:00+00:00",
            "helpful_count": 13,
            "mal_id": 75795,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/310931.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/xMichi",
                "username": "xMichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=75795"
        },
        {
            "content": "I went into Maria Holic with mixed expectations. Everyone that I had talked about it with beforehand either told me it was a wonderful comedy that skewered a genre in need of some massive skewering, or it was too sick and dark to be labeled as such. \r\nAt first, I was in the latter camp. I found the humor to be lacking, with the abuse hurled towards Kanako almost being too much to bear. I couldn't describe it to a friend without making it sound like I stumbled upon the next School Days. Yet around the end, at about episode 8, I started to seeexactly what the series was getting at. At that point, the humor inherent in Kanako's position made sense, and I started to look forward to each subsequent episode. But this wouldn't be much of a review if I didn't go into the how and why, so strap in.\\n\\n\r\nMaria Holic is about Kanako, a tall, well endowed, not-so-closeted lesbian with a penchant for nosebleeds at the slightest sign of arousal, who transfers to an all girl's Catholic school. While exploring the campus, she meets up with a future student, Mariya Shidou. \\n\r\nMariya is the perfect Shoujo-Ai love interest: Soft spoken, polite, and beautiful. Fast forward a bit, and Kanako discovers that Mariya is really a boy. Mariya threatens blackmail, makes Kanako's life a living hell, and hilarity ensues... or rather it would if the entire thing weren't so utterly deranged. \\n\\n\r\nThe biggest turnoff about this show is the lack of grace with which this is handled. It's a parody of the Shoujo-Ai genre, but sometimes it's impossible to tell.\\n\r\nMariya's treatment of Kanako gets worse and worse as the episodes progress, even intruding on her monologues from time to time. If you're repulsed by the end of the second episode, when it really gets started, then it's advised to stop watching and find something that doesn't make a plot synopsis sound like a really freaky after school special.\\n\\n\r\nStrangely enough, despite the amount of abuse she hurls at Kanako and anyone else who gets in her way, Mariya ended up being the  best character. Yuu Kobayashi evidently had fun playing both the bubbly disguised Mariya, and her sinister male side, and it shows. Her two vocal ranges, especially when conversing with Mariya's loyal yet snarky maid, are a real treat to listen to.\\n\\n\r\nThe other characters, aside from the dorm mistress, are cardboard cutout archetypes, not really worth mentioning in particular. Kanako is a harem male lead protagonist in a girl's body, and all the associated personality traits apply.\\n\\n\r\nAnimation-wise, it's typical SHAFT: Detailed characters, sparse backgrounds. It works well in its favor, but the frequent character distortions can seem like an act of laziness at times.\\n\\n\r\nThe sound is easily the highlight, another special mention going to Kobayashi's voice, as well as the irritatingly catchy OP and ending themes. Unfortunately, the rest of the soundtrack isn't terribly memorable and falls by the wayside. \\n\\n\r\nThe question that has to be asked is whether you'll enjoy Maria Holic based on these merits. If you don't mind a constant bombardment of random gags and jokes of a visual nature (Most flopping), and an overdose of black humor, it's well worth checking out for Mariya alone. Sadly, it didn't live up to what it could've been.\\n\r\n Here's hoping the new season will pick up the slack and provide better jokes to match the splendid casting and scatterplot... plot. I'll definitely be watching.",
            "date": "2011-04-04T18:01:00+00:00",
            "helpful_count": 9,
            "mal_id": 35685,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372606.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Inushinde",
                "username": "Inushinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=35685"
        },
        {
            "content": "It's a Shaft anime, so yeah, blah blah art's good whatever. Watched half of this with a friend a good while ago because they know I like yuri, and I was sort of intrigued with the premise at first--despite the flaws of the series being evident from the start, and my younger self having less of a functioning bullshit detector, I thought there was something cool and maybe even groundbreaking about a female protagonist who is unabashed about her exclusive attraction to other women. This hope didn't last long. The show delights in tormenting lesbian protagonist Kanako and almost immediately devolves into a parade oftypical fetishist garbage: sadistic crossdresser, maid whatever, who gives a fuck. \\n\\n\r\nKanako isn't portrayed with depth and is actually one of the most grotesque stereotypes in the series, giving the impression that the creators don't really know what lesbians are like and have a reactionary view of lesbianism in general. Essentially, the formula is this: take the template a male \"pervert\" protagonist, Love Hina guy or Ataru from Urusei Yatsura or whatever, and make this character a female while changing nothing else. Have this character endure a bunch of threats of sexual assault from a male character for the \"crime\" of being lesbian, and have the reason this character is a lesbian be childhood trauma as if we're back in the 50s and reading discredited Freudian claptrap. Congratulations! We've created Maria Holic, and now we can start working on our mutual suicide pact to atone for our mortal sins.",
            "date": "2017-05-29T20:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 248848,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6277832.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/totalbodyworkout",
                "username": "totalbodyworkout"
            },
            "url": "https://myanimelist.net/reviews.php?id=248848"
        },
        {
            "content": "First off, for the sake of not getting bashed by other fans of this series,I would like to say that this is my first review i have ever written for THIS site...oh, people are still reading this? OK THEN!\r\nTake one love struck teenager of the same sex as the rest of the charecters who suffers chronic nosebleeds at the site of a female body, throw in a cross-dressing boy who looks as beautiful if not more beautiful than the rest of the FEMALE cast with a sadistic yet thoughtful personality, add a smart ,sarcastic, and monotone maid who does whatever the cross-dresser ask of her,kick-it-up-a-notch---(sorry Emeril)---with a love encassed priest who thinks all of Mozart's works are severe disieses, mix in a few great supporting cast members, and finally place a cat eared girl who looks younger than the rest of the cast as the dorm leader who is feared by all and is commonly refered to as \"GOD\" even by the narrator...ohh and have all take place in an all girls catholic school!\\n\\n\r\nThat pretty much is what maria+holic is all about...and it's great.\\n\\n\r\nSTORY: 10\\n\\n\r\nI gave the story a ten despite lacking significant character development because... when do you ever see a girl going all googly eyes over other girls to the piont that she needs blood transfusions and donations daily? Other than that, it is fairly straightforword... a reverse-lesbian harem? (ohh, and yes, i did just make the word reverse-lesbian)\\n\\n\r\nART: 8\\n\\n\r\nI'm not the greatest art critique, my opinion may change if there is a second season, but compared to animes with the new art styles this is bumped down a bit from 10... But the art is pretty good.\\n\\n\r\nSOUND: 10\\n\\n\r\nI LOVED THE OPENING THEM SONG!!!---there i said it and im proud that i did... the opening just grabed my soul and made me laugh as well as fail my math test at school because i couldn't get the damn song out of my head! I also thought the ending was decent, as well as the lip synchronizing.\\n\\n\r\nCHARECTERS: 9\\n\\n\r\nSEE ABOVE+ you have the whole basic and expansion pack== the tsundere, the ditz, the athletic and sporty, as well as a few surprises from \"GOD\".\\n\\n\r\nENJOYMENT: 10\\n\\n\r\nI loved this anime i really laughed alot  to the piont were i needed a gut transplant for some of the nosebleed scenes.\\n\\n\r\nOVERALL: 10\\n\\n\r\nI think that the concept was great and they really pulled me in with the hilarity and sarcasm... anyway if you want a good laugh give this a try... i hope you won't be dissapionted.\\n\\n\r\nSincerley,\\n\\n\r\nMelonLord",
            "date": "2009-09-20T20:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 18983,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/206444.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MelonLord1",
                "username": "MelonLord1"
            },
            "url": "https://myanimelist.net/reviews.php?id=18983"
        },
        {
            "content": "SO FAR SO GOOD! > If you know me, you know how much I pay attention to the sounds and I love the soundtrack played throughout the anime, especially during the melancholic sections > The story is easy to follow and has great twists and turns from the very first episode. > The art is well defined and the characters are so quirky and wacky its just hard not to love them. > I enjoyed it from the first episode so when I finish this episode, judging by what I've already watched - this may very well be a favorite in the near future. \r\nOverall10/10",
            "date": "2009-05-03T02:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 14741,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/84472.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/x3sonjae",
                "username": "x3sonjae"
            },
            "url": "https://myanimelist.net/reviews.php?id=14741"
        },
        {
            "content": "Perverted Lesbian + Evil Cross Dresser = Fun\r\nWithout Maria and Matsurika this series will become another post 1st season Sayonara Zetsubou Sensei.\r\nOn to the review:\r\nIn the tradition of the earlier Shaft comedies (Pani Poni Dash, Negima, Sayonara Zetsubou Sensei) this is an episodic comedy. As with most episodic comedies there isn't exactly a real story. In short this is all about the gags even though some of them are too overexplained and simply fail. \r\nKanako with Maria and Matsurika is comedy gold. Kanako with other characters who's names escape me usually equates to fail. The problem here is that Maria+Holic uses the KMM combo sparingly.I can't blame the anime since using this combo too much will probably wear out in the long run. \\n\\n\r\nCosmetics-wise: Maria+Holic shines both in animation quality and music. It doesn't take long for the Shaft brand to rear its head. It's Shaft. Nuff' said.\\n\\n\r\nEven though it had its dry spells Maria+Holic has kept me entertained throughout the 12 episodes so I would recommend this.\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2009-03-30T08:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 13612,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160071.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Unregistered00",
                "username": "Unregistered00"
            },
            "url": "https://myanimelist.net/reviews.php?id=13612"
        },
        {
            "content": "This is not your usual anime where it starts with some typical 16 year old male high school student.\r\nYou have a totally awesome sadistic crossdresser and a lesbian! Plus other fun characters (Dorm leader).\r\nThis just leaves me with asking for more.",
            "date": "2009-06-25T03:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 16118,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/195920.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kuroneko420",
                "username": "kuroneko420"
            },
            "url": "https://myanimelist.net/reviews.php?id=16118"
        },
        {
            "content": "Maria+Holic is... well its interesting. I love the idea of a yuri complex anime with a girl in an all girls school. Truly the humor in here is very satisfying until you see Kanako's fiftieth nosebleed. Humor in here is also very crude, but satisfying with that extra \"WTF?\" humor. Plus the violence in here is pretty amusing (more in a sadistic kind of way, but hey a joke isn't funny unless someone is hurt).\r\nBUT This anime has some major issues to work out! After the third episode, each episode is two stories, and both are pretty boring. Second, the supposed \"romance\" as described inthe genre, is non-existent, its more of a just a perverted woman's dreams. And last, its way too short. There you go!\\n\\n\r\nOverall 7/10, not really a ground breaking series. If it wasn't for the for the eccentric plot, there's no hook.",
            "date": "2009-04-06T14:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 13930,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13930"
        },
        {
            "content": "SHAFT really dropped the ball on this one. It was an anime about a blind maid and a transexual or something, there was almost no way it could have failed, and to top it all off: based SHAFT was behind it all. Of course I got hype. I still am hype even though the show isn't good.\r\nThe show isn't bad either because it was made by SHAFT. The issue is that if the animation was done by anyone other than SHAFT it wouldn't even be considered watchable because it is all just so slightly below average. Character are unadorned, stories are boring and cliche, andI didn't even care about the transexual after a few episodes.\\n\\n\r\n5/10 SHAFT does it again.",
            "date": "2015-01-25T14:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 178965,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1606911.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Doughkey",
                "username": "Doughkey"
            },
            "url": "https://myanimelist.net/reviews.php?id=178965"
        },
        {
            "content": "Do you think Catholic schoolgirl yuri is dumb and completely unbelievable?\r\nDo you think the premise of a guy convincingly crossdressing as a girl to satisfy some ridiculous pact at an exclusive private academy is dumb and completely unbelievable?\r\nDo you think massive nosebleeds are dumb and completely unbelievable?\r\nThat pretty much sums up the series, and its sequel. \r\nKanako is a lesbian schoolgirl who goes to the same all girls' private school where her parents met (worse than it sounds) to meet her true love and instead of indulging her depraved fantasies is sidelined by hot trap Mariya and her maid, Matsurika. Mariya correctly ascertains that Kanakois a threat to the school, herself, and humanity and makes it one of her goals to utterly shut her down before she harms the innocent.\\n\\n\r\nThe anime lampoons the Catholic yuri genre (how the writers have no idea what Catholicism is), hot traps (yes there is a pact or something but really Mariya just crossdresses because he and the audience like it), and the entire nosebleed/accidental pervert genre.\\n\\n\r\nAnimation, voice acting--especially during the particularly manic scenes, soundtrack, and character design are all top notch. The show tends to get bogged down only when it tries to give us some exposition and background into some of the girls at the academy. The best parts are where Mariya, oddly the straight man here, plays her sadism off of Kanako's idiocy with the help of her stoic maid. The nosebleeds are played straight, with Kanako often at a huge risk of bleeding out, and pretty much every relationship trope is shot down and the show even comments at how stupid each one is.\\n\\n\r\nAlso one of the priests is essentially Gintoki with red hair.\\n\\n\r\nIf you like Manzai series, Shaft, hot traps, and really really are sick of schoolgirl yuri you're probably really going to enjoy this. It's also aged really well over the years.",
            "date": "2018-12-31T20:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 297650,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5964017.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BadAshley",
                "username": "BadAshley"
            },
            "url": "https://myanimelist.net/reviews.php?id=297650"
        }
    ],
    [
        {
            "content": "*A great entertaining product by SHAFT backed with hilarious out-of-the-blue jokes.*\r\n\"I-I don't even understand the letter C in Catholic!\" - Miyamae Kanako\r\nIf I was asked to describe Maria + Holic in one word, I believe “wordy” will suit this show perfectly. The amount of monologues in the show is tremendous! Plus the “rail gunning” of words shooting back and forth between the characters simply makes the anime difficult to follow without pauses in between (assuming you need to read the subtitles). And the occasional weird reference to various things also contributes to the complexity of the show for an average viewer. These issues may turnsome potential viewers away, but if you can get accustom to these minor issues, Maria + Holic is actually a rather unique experience.\\n\\n\r\nThe anime itself should be praised for following the manga closely. The entire series covers pretty much the first three volumes of the manga (out of a total of four serialized volumes so far). While certain episodes may seem like fillers, especially if they are not designed to advance the story in any way, these filler-like episodes actually are indeed part of the manga. It should be no surprise that these episodes still manage to be highly entertaining albeit a bit random in most cases.\\n\\n\r\nAs a SHAFT product, those who are familiar with the studio should know what to expect. But if you don’t have a clue, here is a general description. Maria + Holic have high quality animation with good looking characters. Background scenes tend to be overly simplistic to contrast with the detailed characters. What this mean is that while the character usually look professionally drawn, the background often seem like the work of an elementary kid. This may be strange for some viewers, but surprisingly the result is quite pleasant to watch.\\n\\n\r\nThe OP will most certainly take some time to get used to. It is so … unique. On the other hand, the ED makes use of voice changers and the effect turns out quite enjoyable. Frankly, the BGM in Maria + Holic are nothing unique like the OP or ED making them less memorable after the show is done. However, to counterbalance the “average” BGM, we have a few astonishingly stupendous seiyu that can make us forget the pain of the lack of good BGM. Out of the few bright stars in the anime, Yuu Kobayashi is particularly outstanding. In part due to her singing the OP, also her ability to change between two highly different male and female voices make her one of the biggest asset to the show.\\n\\n\r\nWe normally see the male protagonist having perverted thoughts on various female characters in an anime. Maria + Holic is no different except that the protagonist is a girl. And her lust for other girls is stronger than 99.9% of her male counterparts. Here is another good lesson to learn. Never judge anybody by physical appearance alone. Kanako may look like a regular big chest girl in your eyes, but deep down inside she is quite a frightful lady … in a perverted way. It should come as no surprise that she also an openly declared lesbian with a tendency to execute a nosebleed faster than you can say the word nosebleed. The cause of her nosebleed is often due to her encounter with an ecchi scene. In fact, she spurts so much blood that it became a regular routine for the viewers to see her in the school infirmary. \\n\\n\r\nNext we have a very cute looking babe plus an equally sexy voice. She has a good body proportion, excellent grade at school, and is loved by all her classmates. But she is a guy. Yup, you read that correctly. This hot babe is a guy proven and tested, through some grabbing, by our perverted female lead. Maria + Holic is full of interesting characters that will surely put a big happy smile on your face. It is unfortunate that the story has an open ending (since the manga is no where near done either), so fans will just have to be patient for the time being until someday a continuation to the series is announced.",
            "date": "2009-04-01T05:52:00+00:00",
            "helpful_count": 243,
            "mal_id": 13719,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=13719"
        },
        {
            "content": "Maria Holic is a series which starts out with unexpectedly great promise and expectations only to fall on its face and drown itself in a pool of its own blood (literally).\r\nI can’t say that the initial premise of this show intrigued me at all.  Cross-dressing sadists... again?  Honestly I just don’t understand the fascination Japan has with boys dressing up and pretending to be girls, and being creepily good at it too.  Yet when this show was airing, it had some unexpectantly good word of mouth and early reviews so I thought I would give it a chance.  Our protagonist isKanako, a transfer student to an all-girls Catholic school that her mother went to and met her father.  That should’ve have been a warning sign right off the bat but I was distracted by beautiful character designs and lovely artwork.  Kanako is \"allergic\" to men; she breaks out into hives when coming into physical contact with one, so using her logic going to an all-girls school to meet her destined lesbian lover seems like the right plan.  On the very first day though she accidently discovers the school idol, Mariya, is actually a man and he immediately begins tormenting her so she will not reveal his secret.\\n\\n\r\nThe comedic possibilities are there for an amusing series.  However though I was initially impressed with it after a few episodes it soon became quite apparent that the writers for Maria Holic only had about six gags.  So we get to see those same gags over, and over, and over, and over, and over.  Get the point?  The humor becomes repetitive and quickly boring.  While the humor is definitely on the dark side it’s just not funny.  Unless you think transsexuals, lesbians, and rape threats are uproariously hilarious that is.  The story... um what story?  That’s right it goes nowhere!  Maria Holic has a serious case of ADD as it just meanders around to its ending, or I should say its last episode, since there isn’t one.\\n\\n\r\nAs much as the story overall sucked, it doesn’t even compare to the steaming pile of turds that make up the characters.  Maria Holic succeeds in being one of the few shows with an entirely unlikeable cast.  Kanako is initially amusing and interesting but despite the horrible way she is treated not only by Mariya but almost every other character in the show, she still manages to be completely unsympathetic.  Mostly because she devolves into a walking cliché and stereotype.  Her lesbian delusions and resulting nosebleeds start off as being very funny but that is basically all there is to her character.  She becomes more and more creepy in her perversions and bleeds enough blood to fill the bodies of everyone at school.  There is no depth to her at all besides her breast measurements and she remains basically unchanged from beginning to end.  If you expected to learn more about why she is allergic to men or for her to mature as a character your watching the wrong show.  She doesn’t really care about anyone and fantasizes about anyone with breasts who talks to or even so much as walks near her.  To real lesbians I imagine she has to be one of the most offensive characters out there.\\n\\n\r\nMariya, I suppose would be the next most important character.   He/She/It is pretty much unlikeable from the start.  That’s not unusual but nothing happens in terms of character growth and development to make you change your mind.  He is as sick and twisted as you would expect of someone who is forced to dress up like a girl.  So in a sense he is probably the most real and non clichéd character in the series.  A real person in his situation is going to be probably extremely emotionally disturbed.  Much like Kanako he really doesn’t care about anyone and only thinks about how to torment them or how he can torment Kanako further.\\n\\n\r\nThe rest of the cast is just standard uninteresting stereotypes.  To top it off there are too many of them as well.  A short series doesn’t need this many characters.  Especially since over half the episodes are devoted to developing characters that aren’t important to the overall storyline and once we get this information the characters quickly fade into obscurity.  What was the point of providing backstory on them in the first place?  Most likely because the writers knew they couldn’t fill 12 episodes with nothing but lesbian jokes and nose bleeding fantasies (though they did give that a good try).\\n\\n\r\nArt and animation are the strongest aspect of the series.  I really did like all of the character models and the settings were stunning.  It’s a shame that such talented artists and animators were wasting on such a piece of crap story.  The acting is solid but again they aren’t given much to work with.  I did enjoy the OP and particularly the EN theme songs and thought they were pretty cute and original.\\n\\n\r\nOverall Maria Holic is one of the most disappointing titles I have seen to date.  Its initial promise is buried under the weight of overused and mean unfunny gags and a storyline that fails to deliver anything of substance.  I cannot recommend this series to anyone and suggest you stricken it from your list if you plan on watching it.  If, like me, you were unfortunate to see this as well.  My condolences.\\n",
            "date": "2009-07-20T06:35:00+00:00",
            "helpful_count": 200,
            "mal_id": 16969,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=16969"
        },
        {
            "content": "-= So far I've only seen 2 episodes, but please, read my review.=-\r\nStory: The plot, in my opinion, is actually original in some way. A innocent (or perverted) love struck Lesbian who gets hives from males and a cross dressing male who has a sick but yet genius (and or perverted) mind (and quite a secksi face ^-~) meets and conflicts with one another. There is no anime out there with a similar and interesting plot. :P\r\nArt: The art is quite good. The effects they put in work really well with the scene. The motion of the characters is also quite fluid. Also the chibiscenes really help display the comedy of the anime. Even the colors of and the backgrounds work really well together too put you in the mood the director wants you in. Oh yea, don't forget the angles of the scenes! Quite orgasmic. :P\\n\\n\r\nSound: First, the voice actors are very well synchronized with the characters and really bring out the tone of their personalities, also the tone of their voice acting is really good at displaying the feelings of their sorrow, excitement, anger, and etc. The sound effects and background music also really help develop the scenes.\\n\\n\r\nCharacters: As said earlier in &quot;Story,&quot; Mariya and Kanako are quite original and has been already explained why, but the characters can be really funny and entertaining.\\n\\n\r\nEnjoyment: With all those elements combined, of course I'm enjoying this anime. It's very entertaining and funny. :D\\n\\n\r\nOverall (or conclusion): Got five 9s' in a row out of me. It's been pretty fun to watch so far, and I was quite excited about the second episode after watching first. Original story, imagery is great, voices, sound effects and background music is great, characters are original and entertaining.",
            "date": "2009-01-16T13:53:00+00:00",
            "helpful_count": 45,
            "mal_id": 11571,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78404.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Unitedsticks",
                "username": "Unitedsticks"
            },
            "url": "https://myanimelist.net/reviews.php?id=11571"
        },
        {
            "content": "Keep in mind this is a review, not a summary! If you want a summary go to wikipedia.\r\nStory: The story in this show is actually somewhat unique. Dealing mainly with a rather funny (closet) lesbian lead character, Kanako, who has problems with guys (she actually contracts hives if she comes in contact with them) and another lead character, Mariya, who is actually a male cross dresser but looks rather feminine. The actual plot jumps around from episode to episode but has so far remained genuinely entertaining and by episode 6, the larger plot of the show all together is revealed to you.\r\nArt: The animation inthe show is superb, I have only found one scene in the first 6 episodes that the animation (a characters face)  looked just a tiny bit awkward. Maria†Holic has a great opening and the actual show all together has a very unique style to it as well, featuring vivid colors, interesting cut-scenes and slightly unorthodox backgrounds. (I mean that in a good way)\\n\\n\r\nSound: The voice acting is great, the actors voices fit the characters and sync well. Just what one would expect from any quality anime. The music does a nice job of supporting the story throughout the show and I think it fits very well with the overall \"feel\" of the show.\\n\\n\r\nCharacter: The characters are pretty interesting, the lead, Kanako, is damn funny at times while the other lead Mariya with her cruel, shameless humor keeps it interesting as well. They haven't really expanded much on any side characters as of yet, but none stand out to me to be particularly boring. (yet)\\n\\n\r\nEnjoyment: I haven't enjoyed a show this much for a while. Like I said before its quite unique and with some pretty funny moments. The last episode I watched, I must have laughed out loud at least 5 times. The same could be said for the other episodes I've seen.\\n\\n\r\nOverall: While its not the best show I've ever watched, it certainly was one of the funnier shows I've watched. Bottom line: If you like humor in your anime, try to sit down and watch this show, even if your uncertain about the whole lesbian and cross dresser thing, I can bet you will enjoy watching Maria†Holic. So stop reading this and go watch it! :P\\n\\n",
            "date": "2009-02-17T09:58:00+00:00",
            "helpful_count": 35,
            "mal_id": 12505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/92359.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GuitarHero",
                "username": "GuitarHero"
            },
            "url": "https://myanimelist.net/reviews.php?id=12505"
        },
        {
            "content": "“Yay! A gender bender, sort of” That was my original reaction after reading Maria+Holic’s summary. Twelve long episodes later the only words that could sum up what I felt was, “HUGE Disappointment”.\r\nThe story follows Kanako and leads us through her first day at, Ame no Kisaki Academy.  Like every first anything she’s nervous yet excited at being in an unknown place with unknown people.  To really understand this anime you have to know a little about our very own heroine.\r\nKanako is searching for what we all want, the perfect girl. Well, most of us, but true nonetheless. Being allergic to boys sinceshe was young- mainly due to them being “dirty,” and perverts which resulted in her breaking out in hives with any physical contact with them. Enrolling in the all girl academy her parents met at was a no brainier.  Don’t worry it’s explained how her parents met, because I can’t be the only one who misunderstood that line about her parents….\\n\r\nThe first day there, well first fifteen minutes to be exact, she meets the ideal girl, Maria. I know, what are the odds, right?\\n\r\nMaria is perfect. She is delicate, sweet, petite and so graceful. Maria kisses her on the cheek, Kanako swoons, gets hives, and they part for the afternoon. I noticed two things at this point:\\n\r\n1. Kanako isn’t the smartest fish in the barrel.\\n\r\n2. It was going to be a long ride.\\n\\n\r\nThe story from then it unravels pretty quickly in the next two episodes. By that I mean that, yes, Maria is a boy and Kanako does find out she is, he is, you get what I mean. Thus embarks our little Kanako in her lesbian quest. If at any point my words offend you, then this is definitely not the show for you.\\n\\n\r\nWhen you walk in on the girl of your dreams changing and instead see a him, putting on fake breast and girl clothes, eventually the wheels turn in your head and you make up two scenarios:  Aliens invaded Earth and took said girl and replaced her with a male version then disguised him as her to infiltrate an all girl school to brainwash one female at a time and make them their slaves. Or, and I know this might seem far fetched, she is actually a he and is lying.\\n\r\nAnd of course as soon as you realize that it is indeed NOT aliens, you will put your hand up his skirt and touch his manhood to prove your point. Oh wait, not every girl is Kanako. I think she just wanted to take a grab but what do I know.\\n\\n\r\nAfter some threats and ridiculous nose bleeds they are settled in their new room, together of course. The plot mostly stops at this point.\\n\\n\r\nWe see Kanako’s slow and painful process in making friends, and have some WTF moments in the process.\\n\r\nThe use of words like, homo, yuri, and lesbian is guaranteed since in just the first episode our very own Kanako get’s bullied by our very own Maria. It was such a great start too, it had pretty girls, guy in girl clothing and groping. Too bad it had no development and the relationship was too far of in the horizon. Watching Kanako’s internal monologues is enough to make anyone want to slam their head against a wall just to deviate from the fact that you understood whatever she just said. Or, for those less violent of us, at least hold our breaths long enough to make us  feel like we have a concussion. All through watching I kept needing to yell out a  “not all girls think that way!” At least not all the time. My chibi-me keeps a bottle of water around because talking makes her parched.\\n\\n\r\nEpisodes drag on and characters are  introduced and given no depth. The only ones who's past we get enough of a view to care about are Maria and Kanako, but barely and not enough. At the beginning you assume the plot would be about Maria and Kanako building this amazing friendship or even falling in love but alas, that’s not it either. Instead you get lots of nose bleeds from our very own protagonist wanting to see her classmates in her underwear or in bikinis. I am not ashamed to say in the least that Maria would have made an interesting lead girl and makes me wonder why she isn’t since her name is in the title. Maria was what saved this how with her sadistic nature and sharp tongue inducing humor. I really hope the second season is better because absolutely nothing happened on this one, no really, not twelve episodes worth anyway. We get it Kanako, you like girls.\\n\\n\r\nThe animation is something that was great, no matter how you slice it. The sceneries and characters were vivid and the color as per usual was amazing. The voice acting wasn’t annoying and I think Maria’s voice changing was great, and made more sense than when guys pretending to be girls or vice versa don’t change their voice. Always leaves me wondering, really? The intro song was weirdly addicting and it matched with the randomness of the episodes.\\n\\n\r\nThe characters are pretty, with nice animation and sound,  and playful banter that was downsized by all the blood and Kanakos’ horniness, making this one of those anime you watch on mute and make your own dialogue to.\\n\\n\r\nWould I watch it again? Sure, I mean, if I woke up tied to a chair and a voice recorder turns on and a voice says, “I want to play a game...”",
            "date": "2011-04-19T12:10:00+00:00",
            "helpful_count": 25,
            "mal_id": 36223,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400973.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Moon_Light",
                "username": "Moon_Light"
            },
            "url": "https://myanimelist.net/reviews.php?id=36223"
        },
        {
            "content": "Attracted by one of the main character of Maria Holic to watch the series, the infamous Mariya Shidou, only to know that he was actually a crossdressing guy was a heartbreaking moment for me. \r\nAfter the first few episodes of Maria Holic, a comedy/parody/drama anime, I got rather bored. At least 50% of the humor presented in the anime wasn't really that funny, sure it did make me smile or grin for a few times in some of the scenes but there were only handful of scenes that actually made me laugh.\r\nI was planning to drop the series entirely after first few episodes, but thenwhat made me continue to watch was the number of episodes it had; 12. \\n\\n\r\nSo in the end, I then completed the whole series in one sitting. Took me about 4-5 hours to complete the entire series. In those hours, just a couple of scenes were memorable for its funny moments and most of them were pretty much forgettable. Also, watching Miyamae Kanako, the protagonist, nosebleed due to her perverted fantasies  was hilarious, but only for few times. After watching it too many times, the humor gets pretty old. \\n\\n\r\nThe story? Miyamae Kanako transfers to a all-girls high school in order to find her true love. So she first meets up with the crossdressing boy Mariya Shidou then instantly falls for his charms. In fact, Kanako is actually allergic to men; she gets hives whenever she is touched by men. So? It's one of those anime with lots of random \"what the flying fuck?\" moments. So if you're looking for anime with good story, well, you can simply forget about it, cause this anime dont have any. So you're probably expecting ecchi scenes? There are ecchi scenes but only very little. Romance? Quite a lot. But all of the romance are often just within Kanako's perverted fantasies. So don't expect any \"real\" romance in this anime. And actually, I was hoping that Kanako was going to \"end up\" with a girl of her dreams...but she didn't, so that was quite saddening. Again, no romance here.\\n\\n\r\nThe visual? \"Why do many above-average anime have very good visuals?\" That was the first question that came to my head after watching the first couple of episodes. Yes, I have to say that the visuals of Maria Holic is absolutely beautiful. Beautifully drawn artwork and visuals deserves a praise. \\n\\n\r\nBut what surpised me was the studio...SHAFT? I thought the studio was well-known for it's continuously changing visuals(the faces of characters usually changes in some of the scenes that they look like someone else). I recalled the anime Mahou Shoujo Madoka Magica which was from the same studio, but then that anime had so many \"derp\" faces. Maria Holic's visuals, in terms of quality (no derp faces detected), are far more superior.\\n\\n\r\nThe Sound? Another strong point of the anime is the songs, both the Opening theme(Hanaji) and Ending theme(Kimi ni Mune Kyun) are pretty catchy songs. Especially, the Opening theme(Hanaji). If I had to describe the Opening theme with one word, I would go for \"Unique\".  It felt very weird watching it for the first time but then I wanted to watch it every time in all of the episodes. The background music in the episodes were really good too, some nice guitar riffs presented in some of the scenes.\\n\\n\r\nConclusion? So is Maria Holic actually watchable? For me, it was ok, but definitely not for everyone. If you're looking for anime with lots of random, nonsensical moments, then Maria Holic is a decent choice. If you're looking for an anime with lots of good humor,well, there are many better options out there.",
            "date": "2013-03-24T15:03:00+00:00",
            "helpful_count": 23,
            "mal_id": 90781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/34830.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Radeon",
                "username": "Radeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=90781"
        },
        {
            "content": "Ahh, Maria†Holic. Being a natural lover of anything SHAFT churns out of their brilliant studio, I decided to start watching it. If you've seen Sayonara Zetsubou Sensei, you'll instantly feel familiar with the eccentric art of Maria†Holic.\r\nStory - 7\r\nAnother thing you'll become familiar with if you've watched Sayonara Zetsubou Sensei is the story. Not because of how similar they are. No, they couldn't be any more different. You'll become familiar with the nonsensical, silly, parody-esque story immediately. \r\nNow, also like Sayonara Zetsubou Sensei, this anime doesn't take even its own story seriously. If you're looking for a story-driven, deep anime, this is not it. However,if you're looking for a light-hearted, funny story with little relevance but great amusement, this is the one for you.\\n\\n\r\nArt - 9\\n\\n\r\nWell, of course it is great, it's SHAFT!\\n\r\nIn all seriousness, I absoloutely adore SHAFT's animation styles. They employ many different animation styles in just one episode, and they do it comedy. The faces that some of the characters make are just priceless, ranging from chibi sad looking faces to serious, detailed, grizzled jaw and tough looking stares.\\n\r\nSome of the art might seem silly or not serious enough for some people, but as I said in the \"story\" section of the review, if you're going to take the anime to seriously, then don't watch it!!\\n\\n\r\nSound - 8\\n\\n\r\nThere are a few reasons I've given the sound an eight.\\n\r\n1) The OP and ED. They're marvellous. Coupled with more great art, the songs themselves are also really great.\\n\r\n2) Background music. There's always a different piece for each situation, and although it gets kinda repetitive sometimes as it seems to be reused quite often, it is almost always a pleasure to listen to it.\\n\r\n3) Voice acting. One performance that really sticks out for me is the portrayal of Mariya Shidou, voiced by Yuu Kobayashi, who voices Kaere in Sayonara Zetsubou Sensei, Nice Hollystone in Baccano! and Kannon in Umineko no Naku Koro Ni. She does a fantastic job of switching from the feminine voice of Mariya to the threatening tones of her more serious male persona. Of course, all the other seiyuu's do a brilliant job.\\n\\n\r\nCharacter -10\\n\\n\r\nSome of my favourite anime characters to have ever graced my screen. Kanoko and Mariya are pure brilliance. They're funny and well acted, and just great. There are, of course, a great cast of supporting characters to add to the hilarity, making for hilarious situations \\n\\n\r\nEnjoyment - 10\\n\\n\r\nI utterly adored this series... I enjoyed it thoroughly. For many reasons which I have listed above, but to paraphrase:\\n\r\n1) The characters\\n\r\n2) The performance\\n\r\n3) The art.\\n\r\n4) The nonsense story.\\n\\n\r\nOverall - 10!\\n\\n\r\nAnd to wrap up the review, I'll simply say this.\\n\r\nIf you're into Sayonara Zetsubou Sensei, you'll love this.\\n\r\nIf you're into SHAFT anime, you'll love this.\\n\r\nIf you're into comedy, you'll love this.\\n\r\nHeck, if you're into traps, you'll love this!\\n\r\nTruly, there is something for everyone in this gem of a series. I would recommend it to anyone who I thought wouldn't take it seriously, so if you think you're that person, then I whole-heartedly recommend you check it out.",
            "date": "2009-09-01T14:58:00+00:00",
            "helpful_count": 18,
            "mal_id": 18310,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/211875.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ConnorCrook",
                "username": "ConnorCrook"
            },
            "url": "https://myanimelist.net/reviews.php?id=18310"
        },
        {
            "content": "Orientation at Ame No Kisaki\r\nWe stand at the silver oak lined gates of Ame no Kisaki, a Catholic all-girls boarding school, where pretty girls mature into beautiful ladies from the nurturing of Mother Mary’s principles. Ame no Kisaki is a dream of any man, a garden flourishing with budding womanhood. It’s also to dream of any woman, who happens to be a lesbian. Enter Kanako, our token perverted lesbian. She has come to Ame no Kisaki, for one thing, to find her fated lover.\r\nOn her first day touring the grounds she meets Mariya Shidou, young, cute and blonde. Kanako instantly falls in love, befriending herimmediately. They seem to be a perfect match… at least in Kanako’s eyes. But just as fate giveth, it taketh as well. Kanako stumbles into Mariya and to her despair find out she is a boy. To keep Kanako quiet, Mariya takes over the poor lesbians life, torturing her emotionally to keep her mouth shut. \\n\\n\r\nThe setup for the plot was quite humorous. The situation seems incredibly hilarious. But the problem with the story as moves through the twelve episodes is that this situation becomes a sort of side note. The plot is utterly scatterbrained, strung together by small scenes between Mariya and Kanako. By the en of the series were left with the question: What was the point of all that?\\n\\n\r\nGenre \\n\\n\r\nMaria†Holic is mainly a black comedy. It has it funny moments, but the jokes feel over done by the twelfth episode. It somewhat succeeds as a parody of other lesbian anime but that success only lasts as long as the anime is funny. The irritating characters combined with maddening dialogue makes the series a bit of a failure as a comedy. The anime is a bit ecchi, but there is never anything quite stimulating. There is cleavage abounds, but all of it feels presented on a silver platter and unnatural.\\n\\n\r\nThemes\\n\\n\r\nSo sitting here writing this review, I pondered what the maelstrom of monologues and collage of confusing scenes could mean. It was about discovery…I guess. Kanako discovers the joy of camaraderie, surrounding herself with caring friends who were cute to boot. She discovers the tender side of men, collecting the small betrayals of Mariya’s kindness. Its about the discovery of alaria, a spongy algae that expands in water, and seeing how large it could grow in a storm. It’s about the discovery about a missing bra. Though at the end of the day it was about my discovery of the great mindf**k while watching this anime. \\n\\n\r\nStyle \\n\\n\r\nThe art is gorgeous in this anime. There hand painted backdrops look stunning against the colorful character design. The palette is bright and appealing. The use of different animation styles is amusing as in the span of one episode the art direction can switch from bright and cheery, to 300, to a noir film. The music is quite appropriate for a Catholic school, filled choral vocals, organs and violins. The production was one of the rough gems that didn’t lose its luster, as the rest of the anime became a mess, lost in the dirt. The voice acting is hit or miss. Kanako, as voiced by Asami Sanada, is a miss. Her long winded perverted monologues get grating on the nerves and lose their effect. Sanada’s voice is partially responsible, the timbre of her voice getting progressively annoying through each episode. \\n\\n\\n\r\nConclusion \\n\\n\r\nI was hopeful when beginning Maria†Holic. The premise seemed interesting, the characters dynamic and the production was top notch. But soon the dialogue became aggravating, spoken as trades of long monologues between characters. Most of the cast is one dimensional, most of which were unmemorable save for the Mariya's maid for her deadbeat humor. Episodes became more and more disjointed, becoming a hodgepodge collection of tedious scenes. The antics of Kanako and the cruelty of Mariya quickly got old and were not enough to hold the anime afloat for the twelve episodes it ran. I was disappointed to say the least. I could only recommend watching the first six episodes and getting an early transfer from Ame no Kisaki.",
            "date": "2009-09-19T12:24:00+00:00",
            "helpful_count": 17,
            "mal_id": 18926,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160559.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SamFury",
                "username": "SamFury"
            },
            "url": "https://myanimelist.net/reviews.php?id=18926"
        },
        {
            "content": "DON'T WATCH THIS CRAP. \r\nI usually enjoy watching series only for comic reliefs and for laughs but this I didn't have a single shred of enjoyment.\r\nI forced myself into completing the series since I usually complete a whole series whenever I start one but this anime is one of my worst experience.\r\nAll the characters annoying, no story not that it matters in this type of series but each and every time I watch an episode I just wanna hang myself.\r\nThis review is from my worst experience and I don't want others to experience the same so don't watch this anime.",
            "date": "2014-01-16T04:18:00+00:00",
            "helpful_count": 16,
            "mal_id": 128953,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3470409.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Nolifeking13",
                "username": "Nolifeking13"
            },
            "url": "https://myanimelist.net/reviews.php?id=128953"
        },
        {
            "content": "There are few things in the world more subject to taste than comedy, which makes grasping for the objective in an evaluation of maria holic a difficult task.  Take this review with more salt than usual.\r\nI tend to prefer the simple punchlines in the likes of Hyakko or 4 panel mangas.  Mariaholic has none of that, but has a nice balance of recurring gags, non sequiturs, references and self deprecating humor.  Kanako is a closet lesbian genuinely allergic to guys.  She thinks her life has taken a dramatic turn for the better when she steps foot in her new, all girlscatholic school.  The first girl she encounters strikes her fancy (though you will soon learn that just about any girl will do the same), but to her dismay, Kanako discovers this girl is actually a transvestite related to the founder of the school.  Mariya, the cross-dresser, pulls strings to live with Kanako so as to keep her trap shut.  Kanako's complacency makes her a nice toy for the sadistic Mariya.\\n\\n\r\nReading the synopsis, I feared deeply that this would somehow turn into a straight love story, with Kanako eventually overcoming lesbianism as if it were a disease.  Thank god that doesn't come to pass.  There isn't an ounce of genuine romantic tension between the two leads, that is, if you rule out Mariya's moe play that will momentarily seduces Kanako.  The bulk of the series is about Kanako's perversion.  Apparently all the girls at her school, teachers included, are shoujo or harem cliche's, and Kanako has a fetish for each and every one of them.  Nosebleeds and anemia ensue.  \\n\\n\r\nWhile the long soliloquies she'll bust out on the attractive qualities of each girl grow old quickly, along with the inevitable nosebleeds and nurse visits, the girls she fawns over usually lampoon themselves with sharp, self-aware jokes that are hilarious.  One character is socially inept, cold, but honest to a fault.  She'll keep her promises regardless of how inane.  This girl could easily be in the supporting cast of any cheesy shoujo manga, and Mariaholic highlights just how ridiculous her personality is.  She agrees to take care of Kanako, the way you might for any new student, but she takes it to an extreme, throwing herself into each and every one of Kanako's problems with the intention to resolve them, but exacerbates them instead.  To further the parody humor, the animation styles will briefly change, momentarily shifting to a look typical of the genre it is making fun of.\\n\\n\r\nThe whole series is based on Kanako's suffering.  Surprisingly, aside from a few very degrading insults, Mariya doesn't cause much of it.  He may set up a situation and watch Kanako's pain with smug satisfaction, but she's the one who digs her own grave.\\n\\n\r\nBy the end of the series, the parodies will have run their course, and Kanako's sex crazed nosebleeds will have long since grown old.  It may be a novel twist on a harem concept, but the nosebleed joke isn't any funnier for it, especially given how ubiquitous it is in Anime.  The non sequiturs though, kick to the end.  Mariaholic isn't deluged with them in Excel Saga or Pani Poni fashion, so their presence never becomes commonplace.  The dorm mistress who prefers to be called \"god\" is the primary dealer of randomness.  Her hilariously high pitched dog, Wakame seaweed, and a bag with a tentacled alien inside are other examples.  The key to non sequiturs in my view is their recurrence; it must be just as out-of-the-blue as their introduction, and Mariaholic nails this.  Just remembering the utter left field appearances of the alien bag makes me crack a smile.\\n\\n\r\nLike most Anime comedies, Mariaholic loses some of its luster by the end.  If it had continued another 12 episodes, I don't think I could have finished it.  12 episodes though, is a magic number for comedies.  By the time I became desensitized to, or even repulsed by some of its humor, it was close to the end, and the remaining bits of amusement carried me through the rest of it.",
            "date": "2009-09-26T16:19:00+00:00",
            "helpful_count": 15,
            "mal_id": 19135,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/230526.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ace52387",
                "username": "ace52387"
            },
            "url": "https://myanimelist.net/reviews.php?id=19135"
        },
        {
            "content": "Okay the thing is... I just don't get it. I don't get why they came up with such a crappy story as this. It's not very realistic, and it really tries to make you laugh. Which in my case...totally failed. \r\nWell the story is about a girl who's a lesbian that transfers to the school both her parents went to( even though it's a girls school, but I believe they said that her father was a teacher there or something). She transferred to that all-girls-school in the hope to find the love of her live, like her parents did. There is this beautiful girl( Mariya),in Kanako(the main character) her eyes, who turns out to be actually a guy. He saw through the fact that she actually likes girls and kind of blackmailed her. She couldn't tell anyone about it, or else he would expose the fact that she is a lesbian. Well, alright, until there I get the story perfectly. It didn't seem that bad and I thought I might enjoy it.\\n\r\nBut then they totally screwed it up. There wasn't really a story told in it, there were just random episodes of Mariya bullying Kanako in some \"friendly way\". They just throw a lot of random shit at you, that don't make sense at all. Kanako gets a nosebleed from almost EVERYTHING that has to do with girls. And it seems that she really likes EVERY kind of girl. \\n\r\nAs someone who likes girls herself, I found that kind of insulting. I didn't really like it and it gave me a really bad feeling. As if lesbians would just like every girl out there and would get constant nosebleeds from seriously everything( even totally ridiculous things). I just didn't like the image that she gave off of lesbians( and I guess bisexual girls too) at all. I felt totally annoyed watching this anime, the whole time. \\n\r\nI was annoyed because of almost every character in this series, honestly I guess I only liked a few supporting characters. \\n\r\nThere were just a few moments where I thought the story would maybe become a little interesting, but every time they screwed that up in a few minutes.\\n\r\nIt was really weird too that Kanako gets hives when touched by a boy, and the way things go just...weren't logical at all.\\n\r\nIt's really not my kind of anime.\\n\r\nI guess you would like it if you want a random anime that doesn't make sense at all, with some fanservice and just random comedy. It wasn't my kind of humor too, so I just really disliked this anime.\\n\\n\r\nThe only thing that I actually liked about this anime where the Opening and Ending Theme of this anime.",
            "date": "2012-10-23T20:24:00+00:00",
            "helpful_count": 13,
            "mal_id": 75795,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/310931.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/xMichi",
                "username": "xMichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=75795"
        },
        {
            "content": "I went into Maria Holic with mixed expectations. Everyone that I had talked about it with beforehand either told me it was a wonderful comedy that skewered a genre in need of some massive skewering, or it was too sick and dark to be labeled as such. \r\nAt first, I was in the latter camp. I found the humor to be lacking, with the abuse hurled towards Kanako almost being too much to bear. I couldn't describe it to a friend without making it sound like I stumbled upon the next School Days. Yet around the end, at about episode 8, I started to seeexactly what the series was getting at. At that point, the humor inherent in Kanako's position made sense, and I started to look forward to each subsequent episode. But this wouldn't be much of a review if I didn't go into the how and why, so strap in.\\n\\n\r\nMaria Holic is about Kanako, a tall, well endowed, not-so-closeted lesbian with a penchant for nosebleeds at the slightest sign of arousal, who transfers to an all girl's Catholic school. While exploring the campus, she meets up with a future student, Mariya Shidou. \\n\r\nMariya is the perfect Shoujo-Ai love interest: Soft spoken, polite, and beautiful. Fast forward a bit, and Kanako discovers that Mariya is really a boy. Mariya threatens blackmail, makes Kanako's life a living hell, and hilarity ensues... or rather it would if the entire thing weren't so utterly deranged. \\n\\n\r\nThe biggest turnoff about this show is the lack of grace with which this is handled. It's a parody of the Shoujo-Ai genre, but sometimes it's impossible to tell.\\n\r\nMariya's treatment of Kanako gets worse and worse as the episodes progress, even intruding on her monologues from time to time. If you're repulsed by the end of the second episode, when it really gets started, then it's advised to stop watching and find something that doesn't make a plot synopsis sound like a really freaky after school special.\\n\\n\r\nStrangely enough, despite the amount of abuse she hurls at Kanako and anyone else who gets in her way, Mariya ended up being the  best character. Yuu Kobayashi evidently had fun playing both the bubbly disguised Mariya, and her sinister male side, and it shows. Her two vocal ranges, especially when conversing with Mariya's loyal yet snarky maid, are a real treat to listen to.\\n\\n\r\nThe other characters, aside from the dorm mistress, are cardboard cutout archetypes, not really worth mentioning in particular. Kanako is a harem male lead protagonist in a girl's body, and all the associated personality traits apply.\\n\\n\r\nAnimation-wise, it's typical SHAFT: Detailed characters, sparse backgrounds. It works well in its favor, but the frequent character distortions can seem like an act of laziness at times.\\n\\n\r\nThe sound is easily the highlight, another special mention going to Kobayashi's voice, as well as the irritatingly catchy OP and ending themes. Unfortunately, the rest of the soundtrack isn't terribly memorable and falls by the wayside. \\n\\n\r\nThe question that has to be asked is whether you'll enjoy Maria Holic based on these merits. If you don't mind a constant bombardment of random gags and jokes of a visual nature (Most flopping), and an overdose of black humor, it's well worth checking out for Mariya alone. Sadly, it didn't live up to what it could've been.\\n\r\n Here's hoping the new season will pick up the slack and provide better jokes to match the splendid casting and scatterplot... plot. I'll definitely be watching.",
            "date": "2011-04-04T18:01:00+00:00",
            "helpful_count": 9,
            "mal_id": 35685,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372606.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Inushinde",
                "username": "Inushinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=35685"
        },
        {
            "content": "It's a Shaft anime, so yeah, blah blah art's good whatever. Watched half of this with a friend a good while ago because they know I like yuri, and I was sort of intrigued with the premise at first--despite the flaws of the series being evident from the start, and my younger self having less of a functioning bullshit detector, I thought there was something cool and maybe even groundbreaking about a female protagonist who is unabashed about her exclusive attraction to other women. This hope didn't last long. The show delights in tormenting lesbian protagonist Kanako and almost immediately devolves into a parade oftypical fetishist garbage: sadistic crossdresser, maid whatever, who gives a fuck. \\n\\n\r\nKanako isn't portrayed with depth and is actually one of the most grotesque stereotypes in the series, giving the impression that the creators don't really know what lesbians are like and have a reactionary view of lesbianism in general. Essentially, the formula is this: take the template a male \"pervert\" protagonist, Love Hina guy or Ataru from Urusei Yatsura or whatever, and make this character a female while changing nothing else. Have this character endure a bunch of threats of sexual assault from a male character for the \"crime\" of being lesbian, and have the reason this character is a lesbian be childhood trauma as if we're back in the 50s and reading discredited Freudian claptrap. Congratulations! We've created Maria Holic, and now we can start working on our mutual suicide pact to atone for our mortal sins.",
            "date": "2017-05-29T20:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 248848,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6277832.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/totalbodyworkout",
                "username": "totalbodyworkout"
            },
            "url": "https://myanimelist.net/reviews.php?id=248848"
        },
        {
            "content": "First off, for the sake of not getting bashed by other fans of this series,I would like to say that this is my first review i have ever written for THIS site...oh, people are still reading this? OK THEN!\r\nTake one love struck teenager of the same sex as the rest of the charecters who suffers chronic nosebleeds at the site of a female body, throw in a cross-dressing boy who looks as beautiful if not more beautiful than the rest of the FEMALE cast with a sadistic yet thoughtful personality, add a smart ,sarcastic, and monotone maid who does whatever the cross-dresser ask of her,kick-it-up-a-notch---(sorry Emeril)---with a love encassed priest who thinks all of Mozart's works are severe disieses, mix in a few great supporting cast members, and finally place a cat eared girl who looks younger than the rest of the cast as the dorm leader who is feared by all and is commonly refered to as \"GOD\" even by the narrator...ohh and have all take place in an all girls catholic school!\\n\\n\r\nThat pretty much is what maria+holic is all about...and it's great.\\n\\n\r\nSTORY: 10\\n\\n\r\nI gave the story a ten despite lacking significant character development because... when do you ever see a girl going all googly eyes over other girls to the piont that she needs blood transfusions and donations daily? Other than that, it is fairly straightforword... a reverse-lesbian harem? (ohh, and yes, i did just make the word reverse-lesbian)\\n\\n\r\nART: 8\\n\\n\r\nI'm not the greatest art critique, my opinion may change if there is a second season, but compared to animes with the new art styles this is bumped down a bit from 10... But the art is pretty good.\\n\\n\r\nSOUND: 10\\n\\n\r\nI LOVED THE OPENING THEM SONG!!!---there i said it and im proud that i did... the opening just grabed my soul and made me laugh as well as fail my math test at school because i couldn't get the damn song out of my head! I also thought the ending was decent, as well as the lip synchronizing.\\n\\n\r\nCHARECTERS: 9\\n\\n\r\nSEE ABOVE+ you have the whole basic and expansion pack== the tsundere, the ditz, the athletic and sporty, as well as a few surprises from \"GOD\".\\n\\n\r\nENJOYMENT: 10\\n\\n\r\nI loved this anime i really laughed alot  to the piont were i needed a gut transplant for some of the nosebleed scenes.\\n\\n\r\nOVERALL: 10\\n\\n\r\nI think that the concept was great and they really pulled me in with the hilarity and sarcasm... anyway if you want a good laugh give this a try... i hope you won't be dissapionted.\\n\\n\r\nSincerley,\\n\\n\r\nMelonLord",
            "date": "2009-09-20T20:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 18983,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/206444.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MelonLord1",
                "username": "MelonLord1"
            },
            "url": "https://myanimelist.net/reviews.php?id=18983"
        },
        {
            "content": "SO FAR SO GOOD! > If you know me, you know how much I pay attention to the sounds and I love the soundtrack played throughout the anime, especially during the melancholic sections > The story is easy to follow and has great twists and turns from the very first episode. > The art is well defined and the characters are so quirky and wacky its just hard not to love them. > I enjoyed it from the first episode so when I finish this episode, judging by what I've already watched - this may very well be a favorite in the near future. \r\nOverall10/10",
            "date": "2009-05-03T02:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 14741,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/84472.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/x3sonjae",
                "username": "x3sonjae"
            },
            "url": "https://myanimelist.net/reviews.php?id=14741"
        },
        {
            "content": "Perverted Lesbian + Evil Cross Dresser = Fun\r\nWithout Maria and Matsurika this series will become another post 1st season Sayonara Zetsubou Sensei.\r\nOn to the review:\r\nIn the tradition of the earlier Shaft comedies (Pani Poni Dash, Negima, Sayonara Zetsubou Sensei) this is an episodic comedy. As with most episodic comedies there isn't exactly a real story. In short this is all about the gags even though some of them are too overexplained and simply fail. \r\nKanako with Maria and Matsurika is comedy gold. Kanako with other characters who's names escape me usually equates to fail. The problem here is that Maria+Holic uses the KMM combo sparingly.I can't blame the anime since using this combo too much will probably wear out in the long run. \\n\\n\r\nCosmetics-wise: Maria+Holic shines both in animation quality and music. It doesn't take long for the Shaft brand to rear its head. It's Shaft. Nuff' said.\\n\\n\r\nEven though it had its dry spells Maria+Holic has kept me entertained throughout the 12 episodes so I would recommend this.\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2009-03-30T08:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 13612,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160071.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Unregistered00",
                "username": "Unregistered00"
            },
            "url": "https://myanimelist.net/reviews.php?id=13612"
        },
        {
            "content": "This is not your usual anime where it starts with some typical 16 year old male high school student.\r\nYou have a totally awesome sadistic crossdresser and a lesbian! Plus other fun characters (Dorm leader).\r\nThis just leaves me with asking for more.",
            "date": "2009-06-25T03:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 16118,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/195920.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kuroneko420",
                "username": "kuroneko420"
            },
            "url": "https://myanimelist.net/reviews.php?id=16118"
        },
        {
            "content": "Maria+Holic is... well its interesting. I love the idea of a yuri complex anime with a girl in an all girls school. Truly the humor in here is very satisfying until you see Kanako's fiftieth nosebleed. Humor in here is also very crude, but satisfying with that extra \"WTF?\" humor. Plus the violence in here is pretty amusing (more in a sadistic kind of way, but hey a joke isn't funny unless someone is hurt).\r\nBUT This anime has some major issues to work out! After the third episode, each episode is two stories, and both are pretty boring. Second, the supposed \"romance\" as described inthe genre, is non-existent, its more of a just a perverted woman's dreams. And last, its way too short. There you go!\\n\\n\r\nOverall 7/10, not really a ground breaking series. If it wasn't for the for the eccentric plot, there's no hook.",
            "date": "2009-04-06T14:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 13930,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13930"
        },
        {
            "content": "SHAFT really dropped the ball on this one. It was an anime about a blind maid and a transexual or something, there was almost no way it could have failed, and to top it all off: based SHAFT was behind it all. Of course I got hype. I still am hype even though the show isn't good.\r\nThe show isn't bad either because it was made by SHAFT. The issue is that if the animation was done by anyone other than SHAFT it wouldn't even be considered watchable because it is all just so slightly below average. Character are unadorned, stories are boring and cliche, andI didn't even care about the transexual after a few episodes.\\n\\n\r\n5/10 SHAFT does it again.",
            "date": "2015-01-25T14:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 178965,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1606911.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Doughkey",
                "username": "Doughkey"
            },
            "url": "https://myanimelist.net/reviews.php?id=178965"
        },
        {
            "content": "Do you think Catholic schoolgirl yuri is dumb and completely unbelievable?\r\nDo you think the premise of a guy convincingly crossdressing as a girl to satisfy some ridiculous pact at an exclusive private academy is dumb and completely unbelievable?\r\nDo you think massive nosebleeds are dumb and completely unbelievable?\r\nThat pretty much sums up the series, and its sequel. \r\nKanako is a lesbian schoolgirl who goes to the same all girls' private school where her parents met (worse than it sounds) to meet her true love and instead of indulging her depraved fantasies is sidelined by hot trap Mariya and her maid, Matsurika. Mariya correctly ascertains that Kanakois a threat to the school, herself, and humanity and makes it one of her goals to utterly shut her down before she harms the innocent.\\n\\n\r\nThe anime lampoons the Catholic yuri genre (how the writers have no idea what Catholicism is), hot traps (yes there is a pact or something but really Mariya just crossdresses because he and the audience like it), and the entire nosebleed/accidental pervert genre.\\n\\n\r\nAnimation, voice acting--especially during the particularly manic scenes, soundtrack, and character design are all top notch. The show tends to get bogged down only when it tries to give us some exposition and background into some of the girls at the academy. The best parts are where Mariya, oddly the straight man here, plays her sadism off of Kanako's idiocy with the help of her stoic maid. The nosebleeds are played straight, with Kanako often at a huge risk of bleeding out, and pretty much every relationship trope is shot down and the show even comments at how stupid each one is.\\n\\n\r\nAlso one of the priests is essentially Gintoki with red hair.\\n\\n\r\nIf you like Manzai series, Shaft, hot traps, and really really are sick of schoolgirl yuri you're probably really going to enjoy this. It's also aged really well over the years.",
            "date": "2018-12-31T20:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 297650,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5964017.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BadAshley",
                "username": "BadAshley"
            },
            "url": "https://myanimelist.net/reviews.php?id=297650"
        }
    ],
    [
        {
            "content": "Maria Holic is an anime truly amazing with its contents yuri me \r\nsurprise since the first episode. Kanako is a girl who has just \r\nmoved into a women's religious school in order to find the \r\ngirl of his life XD is worse than a perverted male and falls in love \r\nalmost all his companions, Mary is the niece of former president of \r\nschool is a very pretty girl and very popular and admired the delicate \r\nschool ... but that hides a little secret is a guy XD XD. The two \r\ndiscover their secrets and founded an 'anime truly exceptional full \r\nof comedy, all sealed bymisunderstandings, exchange, romance and even a \\n\r\npinch of malice and mischief .... \\n\\n\r\nThis is definitely an'anime to see and follow.",
            "date": "2010-07-28T03:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 29024,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/191596.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Derek89",
                "username": "Derek89"
            },
            "url": "https://myanimelist.net/reviews.php?id=29024"
        },
        {
            "content": "Here it says something and the anime is an entirely different thing...\r\nOverall the anime is about this lesbian girl which i was hoping to see her being weird all the time and getting into troubles that wouldn't damage the anime. But the story is all about this guy who dresses as a girl i think to be able to attend to this school that is just for girls...\r\nI wouldn't have mind it up until, since he is the old chairman's grandson or granddaughter or whatever, starts to torment her to keep his secret to the point on making everyone think she is a rapist...\r\nSad ihad such hopes for this anime...\\n\r\nYet another \"Yuri\" anime failure...",
            "date": "2016-10-10T19:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 231550,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Buterbing",
                "username": "Buterbing"
            },
            "url": "https://myanimelist.net/reviews.php?id=231550"
        },
        {
            "content": "The story for Maria Holic I'd say was ok it the only thing I found unique about it was the fact that it mainly focused on a perverted teenage girl instead of a perverted teenage boy.  This is why I gave this anime's story a 7/10.\r\nThe artwork for Maria Holic I'd say was very good all the characters and scenery looked very well drawn. I'm not a art critic so I'll leave it at that and say what score I gave it  which is a 8/10.\r\nThe sound track for Maria Holic I'd say was average for during the anime however the opening themeand ending themes were very good, which is why is why I gave this a 8/10.\\n\r\nThe character development for Maria Holic I'd say was average, the reason I say this is the closet thing to character development I'd say that happened on a regular basis was finding out the various types of fetishes that Kanako had for other girls. Otherwise the way the characters start off is how they stay through out the entire anime, for the most part that is there's still some character development just not a lot. So this score I'm giving it might be a little generous, anyway the score I'm giving it is a 7/10.\\n\r\nThe enjoyment for Maria Holic I'd say was worthy of a 10/10 in my personal opinion, the reason I say this is there wasn't a single episode of this anime that didn't make me laugh a whole lot.\\n\r\nOverall I'd give Maria Holic a 8/10 the reason for this is for the story for this anime didn't really seem all that great, and the artwork was barely above average and same goes for the sound track. The character development however was only average. How ever this overall score is only based off of all the other scores averaged together, if I rate the overall score without averaging all the other scores I'd give Maria Holic a 10/10 because in my personal opinion its commedy gold.",
            "date": "2015-04-25T23:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 186479,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4081125.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DeamonLordZack",
                "username": "DeamonLordZack"
            },
            "url": "https://myanimelist.net/reviews.php?id=186479"
        },
        {
            "content": "Maria Holic is an hilariously funny show that I guarantee will get you addicted to it. I finished it in one day. Wonder how long it'll take ya'll.\r\nMaria Holic revolves around second year, Miyamae Kanako, a girl who just transferred to Ame no Kisaki, an all-girls missionary school, in hopes of meeting her true love. Now after reading that sentence you're probably like \"aww, that's so sweet\", but then it hits you, \"wait, she's trying to meet her true love in an all girls school?\" \"Is she a...\" If that's what you're thinking then congratulations people you win. \r\nKanako is attracted to the same sex,and hates the opposite sex so much, that whenever she comes in contact with boys, she breaks out in hives. Sound familiar (*cough *cough) Girls Bravo. Things are going well for Kanako, she's sharing a room in the dorm with the beautiful, strong Ryuken Ishima and the care taker of the dorms is this cute, young lady with cat ears, *note: I don't know if that cat ears are real or not, but who cares, sooo damn cute (≧∇≦) But the best of all is Mariya Shidou, a young first year girl with long blond hair and an infatuating smile, enough to make any man get a nose bleed or even Kanako for that manner. Beautiful, polite, intelligent, grandchild of the former school chairman, oh yeah there's just one other thing, she's a guy (≧∇≦)（⌒▽⌒)（　ﾟ Дﾟ)    (Ｔ▽Ｔ)\\n\\n\r\nYep a dude, and Kanako may have incidentally stumbled upon that little secret, but Mariya will make sure her little secret doesn't get out. Will Kanako be able to survive? A maniacal cross-dressing mastermind , a rude maid, a strange out of this world creature living inside of a gym bag, and also the fact that Kanako gets a nosebleed every five minutes because of the drop-dead gorgeous women there. I guarantee, after watching this, you may just become a holic for Maria Holic. Need a tissue anyone?",
            "date": "2013-07-11T20:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 104919,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2145317.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mcadogg1",
                "username": "Mcadogg1"
            },
            "url": "https://myanimelist.net/reviews.php?id=104919"
        },
        {
            "content": "Maria†Holic is a ridiculous comedy written by ridiculous people, for ridiculous people. Usually when I watch a comedy, it focuses on humor I've heard before and I'm usually left disappointed. However, Maria†Holic was a refreshing change. Featuring dark humor, pervert jokes, Yuri jokes, fan service, fan girls, and more.\r\n I'd also like to mention the many different styles of animation they used to transition between scenes. It made my watching experience all the more enjoyable. The characters were quite cute, and funny. Some of them were quite unique as well. My favorite character would have to be the dorm leader.\r\nI would recommend this anime toanyone who doesn't mind blood, and a comedy of the parody kind. Yes, I am being vague about the blood. Watch Maria†Holic to find out.",
            "date": "2013-12-26T19:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 125753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2487217.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dafauna",
                "username": "Dafauna"
            },
            "url": "https://myanimelist.net/reviews.php?id=125753"
        },
        {
            "content": "This seems to be one of those animes that likes to throw you curveball after curveball of random out of the blue humor. This isnt a bad thing, in fact the randomness was one of the main things that i really liked about this anime. I will say however that it was really lacking in plot-depth. to be completely honest sometimes i didnt really know what was the point of some entire episodes.\r\nbut if you're looking for a light, fun to watch, shorter series that shouldnt take more than a few days to get through i think you should go for it. :D",
            "date": "2009-07-14T17:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 16784,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207744.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Alexanderanime",
                "username": "Alexanderanime"
            },
            "url": "https://myanimelist.net/reviews.php?id=16784"
        },
        {
            "content": "I went through the first season of \"So Long, Mr. Despair.\" I read the first few volumes of the manga based on this show...\r\nIf the show had some upskirt panty shots, I'd give it a 5 instead of a 4. Because (and you have to pardon me) the so-called \"comedy\" herein is NOT funny.\r\nMariya, and his maid Matsurika, are douche bags. And I though I can laugh at Kanako (since she's the comic relief anyway); but at the end of the day I only became more miserable.\r\nI mean, seriously. Making fun of a lasting franchise is petty PERIOD. I didn't watch \"Maria Watches Over Us.\"And I thought \"Otome wa Boku ni Koishiteru\" was kinda meh. (How can a guy, dressed up like a girl, go to an all-girl school and not psychologically blow up IRL? Only Wapan can do this.)\\n\\n\r\nI'll add that Sentai/FUNi's English dub team really did a good job on something that is, IMMHO, another round of high-art garbage for otaku consumption.",
            "date": "2014-01-07T00:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 127639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=127639"
        },
        {
            "content": "Art: 7/10; Sound: 7/10\r\nThe opening video made me curious about Maria†Holic. But, after some time I realized that it was probably my favorite thing about this anime. Even though I found the art and sound pretty well done (opening, ending, and overall music in the anime was nice), it didn't really... get a hold on me. \r\nStory: 5/10; Character: 7/10\r\nIf you love comedy anime, with lots of unnecessary actions, screaming, shouting and jumping out of the screen, then this is the anime for you. If you, on the other hand, aren't a fan of pure comedy anime without any plot, character development or such, thenI wouldn't recommend it. \\n\\n\r\nEnjoyment: 6/10\\n\r\nI must say that the anime has its funny moments (even for someone who doesn't like pure comedy), and I enjoyed it 'till a certain point. BUT, after a few episodes I really grew tired of it, and with this huge lack of plot, I don't really think that it leads anywhere. \\n\r\nThe problem with anime that primary provide the watcher with funny scenes in a well known environment (like the school environment here), is that the makers would have to put a lot of work into it, in order to make it interesting the whole way through. This anime is, indeed, interesting, but it seems like they put SO much effort in it, that I needed mental rest after every episode I watched. It just drained my energy, I suppose.\\n\\n\r\nOverall: 6/10\\n\r\nI have to say that the anime isn't bad. It's probably just nothing for people who like it more when the comedy elements are embedded into a fascinating plot. If you like freaky, flashy and sometimes ridiculous comedy, with sexy-references, then (as I already said) this is definitely for you.",
            "date": "2014-01-25T17:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 130243,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3348773.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/akustir",
                "username": "akustir"
            },
            "url": "https://myanimelist.net/reviews.php?id=130243"
        },
        {
            "content": "I like the premise, i have a very wide span of interests, and it's pretty funny too!\r\nThere's not much to say about this show, its just ok. If you're into the synopsis, you'll most likely enjoy it, and if you're not, you won't. \r\nIf people have said this is like the reverse of Ouran, eh...sorta.\r\nTechnically yes. But ultimately no. It's just not as good.",
            "date": "2011-12-22T03:37:00+00:00",
            "helpful_count": 0,
            "mal_id": 49777,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TrappiTurtle",
                "username": "TrappiTurtle"
            },
            "url": "https://myanimelist.net/reviews.php?id=49777"
        }
    ]
]