[
    [
        {
            "content": "Welcome to tits the anime! Are you a filthy cave dwelling otaku who wants to watch a bunch of high school girls with large breasts swarm over one guy like moths to a flame without having any personality while at the same time remaining stagnant throughout the show? Then this is the anime for you!\r\nTo be perfectly honest this show lacks substance of any kind. It's a very basic ecchi show about a couple of high school students who are 'married' and live under the same roof together and hang out with their friends. Scenarios ensue in which the girls are either forced to removeas much clothing as possible or they find themselves in a situation in which they're groped by our main protagonist. That's it! It feels like a heavily condensed To-Love Ru. The characters don't really go through any development arcs and the story remains incredibly linear and dull. None of the characters feel as if they've grown all too much throughout the series either and it remains a very forgettable throughout.\\n\\n\r\n\"But LIQ, you cynical ass-hole, you hate everything anyway. Besides the seven minute length time doesn't allow for character development!!!1\"\\n\r\nTo that, I say you're half right (the ass-hole part anyway). However in regards to the second half, Space Patrol Luluco was also a seven minute anime but that show managed to do a whole of a lot more than this one while having fun and interesting characters with an actual over-arching story line so there is no excuse. This anime has no development of characters or narrative and is instead just a show in which borders on hentai without having any hentai at all. It's just an excuse to showcase a bunch of tits with nothing else and if that's the shows main purpose than I guess it achieved. The characters themselves could invoke a laugh or a smile out of me and I acknowledge that but you have to bust out the scale of justice to determine the shows worth and I can't help but rate this any higher since there are other shows of the same nature doing it much better. This show is vapid and has no substance nor did I have any fun while watching it. I found many of the characters to be either beyond annoying and every single one of these characters are the exact same in other shows done to a better effect.\\n\\n\r\nTo be fair they do attempt some character growth and development but it's not really much and is not given nearly enough time to develop or to flesh out characters since the show seems to need to fill a quota of stuffing about three hundred shots of tits and asses in our faces in the span of seven minutes.\\n\\n\r\nThe animation was pretty consistent and the character designs themselves were pretty good too so I can at least recommend this to people on a superficial level if they want to waste a little bit of time watching some guy grope some tits and the such but, to me, this always came across as a cock tease. If you really like ecchi shows then I'd say give it a shot but for everyone else I wouldn't waste your time on it. If you really want some tits go watch Kill la Kill or even better, a hentai!\\n\\n\r\n(Part of LIQfilms 12 Days of Christmas - Day 6)\\n",
            "date": "2016-12-18T09:54:00+00:00",
            "helpful_count": 29,
            "mal_id": 235747,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3420421.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LIQfilms",
                "username": "LIQfilms"
            },
            "url": "https://myanimelist.net/reviews.php?id=235747"
        },
        {
            "content": "This is the BEST ecchi anime I have ever seen, and trust me I have seen many. Good opening, wide variety of characters and superb ecchi scenes make it a must watch. The main advantage of this anime is that each episode is only 8 minutes long. \nOne of the rare anime which delivers what it promises.\nALL types of girls including tsundere , deredere , loli etc are included!\nIt also has a decent story and some scenes will make you unable to contain your laughter.\nThe ending episode is extremely good and will leave a warm feeling in your heart.\nI recommend you to not think muchand just ignore the rating and watch it, cause such anime are very hard to find!",
            "date": "2018-03-07T09:15:00+00:00",
            "helpful_count": 17,
            "mal_id": 273276,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6589953.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/SkydiverRed",
                "username": "SkydiverRed"
            },
            "url": "https://myanimelist.net/reviews.php?id=273276"
        },
        {
            "content": "Over the years, anime has given us a myriad of varying and powerful stories that chronicles the journeys of its characters through expressive and visual means that grasp and enthrall people with the wondrous worlds that they can create.  But you're not here for any of that.  Hell, if you're watching Okusama, you're here for one thing and one thing only.  Boobs.  \r\nStory: This second season of Okusama 'continues' off of the first season with relatively the same goals and ambitions of the first season with none of the progress.  At all.  What's presented as a second season ofthe series comes off as a dozen of 7 minute comedic OVAs with little to no continuity from episode to episode.  The formula for each episode starts with our protagonist Hayato Izumi engaging in some innocent situation with one or more members of the female cast (most commonly the two girls who are seen as his romantic interests), which eventually turns into a sexual situation that usually involves touching one's privates in some fashion or another, stopping before anything that constitutes as pornography can occur.  \\n\\n\r\nBeyond that, this virtually plotless piece of entertainment doesn't have anything else worth of value of mentioning.  Due to its nature as a seven minute short dedicated to entertaining whomever's watching with some relatively high sexual content, I don't really see much reason to go above and beyond with the show's minute nuances.  The high school and student council backdrop is a facade that doesn't get used that much, the characters are shallow and not much progress towards character development is actually made, and honestly, I don't see why anyone would actually watch this show for that things.  If you're watching this, you're watching this for boobs.  \\n\\n\r\nOverview:\\n\r\n+ Boobs (I can't not make this a positive, as it's...probably the two reasons why people watch this.)\\n\r\n-  Everything else is shallow.  (Plot, story, characters, everything.)\\n\\n\r\nCharacters:  The characters are the same.  Izumi's still holding in the urge to attack any piece of femininity that's hung in front of him, Ui still wants her fiance to notice, love, and probably deflower her, and Misumi's still that annoying tsundere character with too much pride as a morals committee member and jiggle physics.  Oh yeah, and I guess Karen, Niikuma, and Sawatari are there too.  You met them in season 1, and you'll see the exact same people in season 2 cause nothing changes.\\n\\n\r\nThe only new character we're introduced to is Saijou, the president of the photography club.  Presented as a comedic flirt who'll get the perfect shot by any means necessary, Saijou's character has the same pitfalls as everyone else, being a character that has no meaningful development or character, but is thrown in as a wrench in the works rather than a piece of meat for the male viewing audience to ogle over.  At least, not as much as the others.  So yeah, those're our characters.  Shallow examples of people with as much depth as a cardboard cutout.  Whoopee.\\n\\n\r\nOverview:\\n\r\n+/-  One dimensional people (It...kinda works?  Mostly cause the show doesn't give them enough time at all to even be remotely developed.)\\n\\n\r\nArt: Produced by Seven, a studio whose biggest accomplishments are Danna ga Nani and...various hentai (whoo, there's a spectrum), it doesn't come as a surprise that in terms of art quality, Okusama has some very average artwork mixed in with some surprisingly well done erotic scenes.  But unless you're here for a pair of mammary glands, don't expect the art to be all that spectacular.\\n\\n\r\nSound:  The music's not worth it.  Voice acting...you'll get quite a few moans, so fair warning, watch this with headphones, and with your computer facing away from the door.\\n\\n\r\nPersonal Enjoyment: To be completely honest, I don't really have much to say.  The manga piqued my interest, and I watched the corresponding anime.  Personally, nothing about this series really warrants me to like or despise it in a drastic manner.  I have my two cents, but in terms of overall enjoyment, I neither liked it nor hated it.\\n\\n\r\nDid I like this series?\\n\\n\r\nEh...Boobs were nice, I guess?  Boobs are always nice.  Jiggle physics are a bit laughable and improbable, but what the hell do you want?  It's anime.\\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nKaren, and...Misumi.  Their characters are annoying.  And because the characters are as shallow as a one foot pool, nothing about them will EVER change.  SO that's annoying, I suppose.\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nIf you really want to get something out of your system, or just really like boobs, then I suppose this is a good watch?  Keep in mind, the only thing you'll get outta this series is boobs.  Nothing more, nothing less.  If you want anything more than that, then watch some hentai; it's the next best thing.",
            "date": "2016-12-18T23:10:00+00:00",
            "helpful_count": 10,
            "mal_id": 235793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=235793"
        },
        {
            "content": "Ill first say this if your not a fan of a TON of ass and tits than just skip this otherwise lets get into it\r\nStory: honestly there really isnt a story in this season i just takes up from where season 1 left off really that Izumi and Ui are married again theres honestly nothing new too this season than the last one just a bunch of lewd and semi funny stuff \r\nArt: it was good the nipples and the boobs and ass were well good otherwise yeah \r\nSound: Op and Ed were decent but nothing id download or anything otherwise it was good\r\nCharacter: illfirst say all the side character were ok no one bothered me or anything like that. Izumi so hes pretty much the same in the 1st season he a pretty nice and chill guy but can also have that perverted side too him. Ui is pretty much the same as well from the 1st season a perverted but also heart warming person.\\n\\n\r\nEnjoyment: now too say i enjoyed this is kinda EH personally i didnt care for this season too me it was again like i said in the story semi-funny it was funny but mostly wasnt either and i feel they tried to throw tits and ass in your face too forget a story (if there was any story for that matter)\\n\\n\r\nOverall: Overall im giving this a 6 honestly u only need to see my enjoyment cause i feel like id copy paste what i said there in the overall part",
            "date": "2017-01-19T21:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 238660,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=238660"
        },
        {
            "content": "The art is good, the fan service is great, the voice acting and sound is great.\r\nBut.... to be honest... if you don't follow the manga... well... I wouldn't recommend this.\r\nWhile each chapter for the manga was short, it did have a nicely paced development, but this one just takes a few moments of the manga and animates them.\r\nAs a person who read the manga, this worked great, but it didn't feel great as a stand alone anime.\r\nAs a reader of the manga, this added feel for the manga and helped me enjoy the series as a whole more.\r\nBut it doesn't feel like an anime seriesrather than an OVA series for fans of the manga.\\n\\n\r\nOf course, if you like fan service and that is enough for you, then go ahead and watch this. You'd enjoy it.\\n\\n\r\nThe characters aren't unlikable, but they don't feel fleshed out if you take this series on its own.",
            "date": "2016-12-26T14:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 236585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2463757.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/deathmailrock",
                "username": "deathmailrock"
            },
            "url": "https://myanimelist.net/reviews.php?id=236585"
        },
        {
            "content": "It´s softcore pornography.\r\nEverything is as generic and bland as any other cookie cutter harem. \r\nYou got your tsunderes, your shy girls, your cunts, your inplausible character motivations and everyone involved being a one note character, that barely develops. Why the decent score though? This Anime delivers  something for  everyones pallet in terms of character design and personality, so anyone watching is inclined to find his/her [s]fap-material[/s] waifu.\r\nJust do not expect a compelling story or long lasting humor, the funniest part about this Anime, will be the comment section on the website you´ll watch it.\r\nAlso the comparably distinct artstyle and barely there cencorship helpalot.\\n\r\nWholeheartedly recommend it to openminded couples and perverts. Watch this if you want to skip foreplay with your girlfriend, or you want to bust a nut/clean the clam, to something less dirty than youporn.",
            "date": "2016-12-19T16:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 235858,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3231465.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Isterio",
                "username": "Isterio"
            },
            "url": "https://myanimelist.net/reviews.php?id=235858"
        },
        {
            "content": "What is there to say with this show huh?\r\nStory (1)\r\nI only give it a 1 because 0/10 doesn't exist on MAL. My reason why is well... IT DOES EVEN HAVE ONE ANYWAY. All it comes down to is either A. Izumi gets aroused and visualize the girl naked. or B. Have some more ecchi jokes and that's all there's to it. The whole purpose of the series was to establish a relationship with Ui and Izumi. They barely ever do that outside of the ecchiness that goes on there. I'll admit they did great things when comes to ecchi, but they fail at every thingelse. To add to injury, they made this into threesome adding Rin. Then adding more girls that amount to anything. \\n\\n\r\nCharacter (2)\\n\r\nThe only thing makes me prevent it from giving it a 1 is having attractive girls in the show and... that's it. No personality, no flair, no reason to relate to them. NOTHING! They are just there For Academic Purposes... nothing else. The Girls look good but their personality is generic as heck. And as for our MC, well he's became worse than he was in season 1. \\n\\n\r\nArt (7)\\n\r\nThe only thing I will give some positivity for the show. They make the girls look greater and better than season 1. The girls look beautiful naked (if only I could care about these characters) Lastly, I think the art improved compared to season 1 imo.\\n\\n\r\nSound (3)\\n\r\nIt's really nothing special. I normally don't listen to anime OP and ED since their not my style (unless they are really good) so I judge this by their OST and honestly their nothing for me to say that is interesting about the OST it's just generic as they come. \\n\\n\r\nOverall 13/40 (32.5%) F\\n\r\nRange: Bad\\n\r\nEnjoyment 1.5/5\\n\\n\r\nI like ecchi, I really do but I want to see it while establishing a great, consistent story. Okusama may deliver when it comes to ecchi but fails with story. If you wanna see a ecchi series while having a nice story and good romance I suggest you avoid this show and watch Freezing (despite being a battle harem it does so more results) otherwise watch Hentai cause that's how the show feels like at the end of the day.\\n\\n",
            "date": "2016-12-19T11:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 235827,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2816371.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/GalacticMagna",
                "username": "GalacticMagna"
            },
            "url": "https://myanimelist.net/reviews.php?id=235827"
        },
        {
            "content": "Honestly, this sequel was disappointing. I know it's an ecchi anime and that's the main focus, however this season turned it into a full-fledged harem anime. While the first season focused mainly on the wife-to-be, with a side tease of protests-too-much disciplinarian, this season focused /away/ from the main couple in favor of all the side characters. Quite frankly, it was a drop in quality from the previous season. Certain tropes, played a lot but not too much in the first season, are well overused to the point the story suffers and pushes it into the uncanny valley of comedy. I was thoroughly disappointed inthe movement from a cute ecchi couple series to ecchi harem series.",
            "date": "2018-04-16T16:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 278265,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4668707.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/gwennie-chan",
                "username": "gwennie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=278265"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nMy wonderful sister got married near the end of last year.\r\nHer husband (now my brother-in-law) are perfect for one another. They have each other’s backs, putting up with the other’s “baggage” despite their differences. And with him being one of the nicest guys that I know, and her being overly supportive, they are as compatible as can be.\r\nI know they’ll have a successful, happy marriage moving forward. At the minimum, they’ll be a lot better off than whatever Okusama ga Seitokaichou!+! presented.\r\nSTORY\r\nAs expected, Okusama contains similar content to that of the first season. Izumi andUi are shacked up, leading to the pair’s multitude of sexual romps. Unfortunately, Okusama also includes a ton of unnecessary elements that ultimately ruin the entire experience.\\n\\n\r\nChief among its problems is a refusal to let any of its sexual content play out. Not only in first-second-third base terms but also in emotional terms too. Izumi and Ui are about to passionately kiss? In barges Rin to stop it before it even happens. They’re about to get frisky in bed? Sorry, Izumi, but premature ejaculation would like a word. A Rin-and-Ui double feature ready and waiting? Whoops, Rin’s sister conveniently shows up to say a few words and derail the fornication.\\n\\n\r\nEven when the anime finally has the guts to show off its sexual content, much of it simply lacks spice or at least variety. One too many almost-touched-lips kisses with Izumi and groping without any flair lead from one boring sexual encounter to another. Izumi helping Ui take a suppository is as adventurous as the anime gets.\\n\\n\r\nThese events and the ones outside the realm of debauchery also go against Okusama’s previous season’s theme on marriage even more so than ever before. The anime constantly places Izumi in situations that don’t involve Ui whatsoever or simply don’t mesh with the marriage aspect of their relationship.\\n\\n\r\nFor instance, they raid the photography club’s clubroom, but it’s an event that has little (if anything) to do with how Ui and Izumi get along. What occurs, then, is a slew of scenes that should have never been allowed to happen in the first place since they continue to reinforce why the anime does not deserve to be titled My Wife Is the Student Council President.\\n\\n\r\nThe anime does keep its motif in mind on occasion, like when Ui complains about Izumi not giving her enough attention (and touching) or when Izumi eats the food Ui concocted despite its nefarious aura (because that’s what a man should do). Sadly, Okusama would much rather give Rin yet another unnecessary shot with the male lead, bringing the anime back towards polygamy.\\n\\n\r\nOkusama does have its small moments. The condom that Rin’s older sister gave to Izumi returns as a joke later in the season when Rin discovers it in his desk drawer, and the final episode proves that the anime didn’t forget about Ui’s parents from last season, giving them a miniscule cameo to cap off this this season. Plus, it does have the usual cute pouts and comedic jokes to fill the gaps between the promiscuous asides.\\n\\n\r\nUnfortunately, so much of the content is boring, aggravating, or otherwise lacking that whatever else Okusama attempts to do cannot heal its self-inflicted wounds.\\n\\n\r\nANIMATION\\n\\n\r\nIn this second season of Okusama, the amount of actual animation seems to have decreased. Characters will sometimes shift forward without moving their limbs, and the events themselves usually end up as just the characters speaking to one another while standing. Rin’s breasts do jiggle at every opportunity, but that’s not enough to justify how static a lot of the scenes feel. Especially when the sexual content refuses to give much more than Ui sucking Izumi’s finger or showcasing yet another still-framed picture of the girls as naked as possible.\\n\\n\r\nSpeaking of the sexual content, the anime at least (and once again) provides a censored and uncensored version.\\n\\n\r\nNaturally (and once again once again), the uncensored material is the biggest draw of the show and wins out over the censored material. Granted, all that’s really shown are nipples, and the explicit material that’s too tough to cover up with baby chicks is replaced with theatrics that aim for cute, comedic relief. But the crotch shots, despite their perversion, are why the audience are there in the first place, so uncensored is really the only way to go.\\n\\n\r\nThe artistry in general still doesn’t impress, but it gets the job done. While the fast-moving backgrounds and the talking-head bubbles are relied on more than usual, Rin and Ui still have their attractive designs, and the silly reactions with the squatter, comedic depictions of the characters invites the cuteness and the funniness with ease.\\n\\n\r\nCHARACTERS\\n\\n\r\nAs an ecchi, comedic short, Okusama doesn’t have the character depth that regular dramas tend to include. However, that doesn’t excuse the anime from a lot of choices it makes regarding its cast.\\n\\n\r\nFor example, Rin receives a lot more attention this season. Said attention is mostly going towards her chest, but Okusama also highlights her naivety when it comes to love and the difficulty she has in accepting Ui’s working theories on letting lust live. Thus, Rin starts to take part in the lasciviousness, letting Izumi release his pent-up hormones with her breasts or thinking about buying a black bra to satiate Izumi’s own desires.\\n\\n\r\nYet, during most of Rin’s sexual interactions with Izumi, the outcome is the same: punching him in the face. Despite initiating the situation herself, she’s the one who ends it (often in a violent manner).\\n\\n\r\nTo be fair, her even putting herself in those situations is arguably a big step forward for her, considering her role as the head of the disciplinary committee and her previously discussed naivety. But she never truly leaves this quasi state of liking-Izumi-but-not-really. Plus, it gets quite old quite fast to see her stop her progression for the umpteenth time when she was the one to start it in the first place.\\n\\n\r\nUi and Izumi are no better. Arguably, they are worse.\\n\\n\r\nAs a (supposed) couple, they don’t have very many scenes together. With Rin refusing to go away, the introduction of Honoka, and the comedy involving the side characters, Ui and Izumi rarely have any alone time. When they finally are alone, they almost never exchange words of love or commitment, and the relationship they do share does not rise above friends with benefits.\\n\\n\r\nIt gets worse. Looking at Ui and Izumi individually, they don’t help themselves or each other.\\n\\n\r\nUi constantly lets Izumi take part in situations with the other characters that will inevitably become sexually charged. She either has no idea, is oblivious, or, worst of all, simply doesn’t care.\\n\\n\r\nIzumi is similar. His instincts will eventually control him if pushed to his absolute limit, but these moments are rather uncommon. Sometimes, he himself won’t let their relationship move forward, like when he “has to go to the bathroom” when Ui says right to his face how she won’t run away from him, readying herself to kiss him outright.\\n\\n\r\nAs for everyone else, Okusama should get some credit for providing its side characters with a moment or two to shine. Ayane gets to see what it is like to have a boyfriend, Karen learns to not hate Izumi’s guts as much, and Honoka creates some scenarios for Izumi, Ui, and Rin to comingle within.\\n\\n\r\nBut even this credit is difficult to see as a positive when one realizes that they are also getting in the way of what is supposed to be a “marriage” between Ui and Izumi. Ayane gets somewhat tacked on as last-ditch option for Izumi, Karen’s episode doesn’t incorporate Ui to any large extent, and Honoka comes off as an unnecessary addition to the cast when she barely contributes to the plot besides snapping a few phots here and there.\\n\\n\r\nAgain, Okusama isn’t a “deep” anime, and the sole reason for watching it is to see some occasional boobies, so a lot of these gripes are “pointless.” Still, when the anime is arguably an anime about Ui and Izumi, and what’s presented is anything but, the show does not do itself any favors.\\n\\n\r\nSOUND\\n\\n\r\nThe opening track and the ending track are (understandably) small pieces that help to set the tone for Okusama.\\n\\n\r\nThe OP uses piano and drums to create a fast beat with a sense of nostalgia, but the grating instrumental in the background is way too distracting no matter how many bells go off. The ED is even shorter than the OP (twenty seconds versus thirty seconds), but it stands as the better of the two thanks to its happier feeling through blaring trumpets. Also, letting the voice actresses for Ui, Rin, and Honoka sing their own versions of the ED gives it more variety than its OP counterpart.\\n\\n\r\nThese voice actresses are Ayana Taketatsu, Minami Tsuda, and Sora Tokui (respectively). While Ms. Tokui does not have any notable scenes, Ms. Taketatsu knows how to pout, Ms. Tsuda has the authoritative drive, and the two can moan when needed.\\n\\n\r\n(And a small shout-out to the talking hormones, condoms, and erections that supported the show in comedic fashion.)\\n\\n\r\nThe rest of the original soundtrack remains the same as the first season. A light piano backs the romantic scenes and steps along for the sillier ones. And a nice acoustic guitar accompanies the quieter, simpler times.\\n\\n\r\nENJOYMENT\\n\\n\r\nOnce again, I find myself conflicted over an anime.\\n\\n\r\nOn the one hand, it’s frustrating to watch many of the scenes play out when they almost always conclude with some interruption or unnatural shove in the opposite direction. A lot of this interrupting and shoving derives from Rin, but Ui is no better when she fails to make any significant strides due to her odd choices. To be fair, Izumi is just as much at fault with everything as these two, but he at least has the excuse that he’s at their mercy most of the time.\\n\\n\r\nOn the other hand, I like both girls. Ui has the caring personality that I find very attractive, and Rin has the bombshell looks that get my head turning. Ui made me laugh with her huge pouts, Rin had me smiling at her blushes, and the two together were no doubt arousing when it came to their ecchi escapades (even if they weren’t exactly novel).\\n\\n\r\nI want to like this one more than I do, but the anime makes it hard to do so. The show should just go all the way in one direction with either Rin or Ui. Enough of the back-and-forth, maybe-maybe-not wishy-washiness. Because the anime is cute and funny and arousing – but it just doesn’t know what it ultimately wants to be.\\n\\n\r\nOkusama ga Seitokaichou!+! ends up worse off than its previous season. Further deviation from its marriage motif, less animation, and not enough focus on Ui and Izumi are its biggest mistakes. Its art and music remain consistent, but it’s a show that one will part with long before death.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, constant refusal to let events play out and even more unnecessary “polygamy” entirely defeat the purpose of the narrative\\n\\n\r\nAnimation: Fine, while less movement occurs, the uncensored material and the comedic portrayals keep the visuals both alluring and fun\\n\\n\r\nCharacters: Terrible, Ui and Izumi’s relationship goes nowhere as they and those around them impede their progress without fail\\n\\n\r\nSound: Fine, bad OP, okay ED, okay OST, and okay VA performances\\n\\n\r\nEnjoyment: Fine, Rin and Ui are likable, but having both together only makes things unlikable\\n\\n\r\nFinal Score: 3/10",
            "date": "2018-03-01T18:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 272773,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=272773"
        },
        {
            "content": "So uhhh...Okusama ga Seitokaichou! gotten several more layers of cake from this season and NOT in a good way.\r\nOkusama ga Seitokaichou!+!'s second season by all means did \"try\" to reel in the minor characters and give them a bit of screentime in comparison to the first season, characters such as Karen Fujisaki and Ayane Niikura while teasing the \"relationship\" between Hayato and Rin...in the most blatant fanservicey way possible. Hayato and Ui's relationship for this second season also seemed to have static pretty quickly what with Hayato's pseudo-harem formed and given their screentime, add in a new character in the form of Honoka Saijou voicedby Sora Tokui and we have a mess of a second season to the point LA was debating if the second season improved or not due to it's character development. It didn't. Why?\\n\\n\r\nBecause this may had just been LA but the fanservice aka. \"mild nudity\" this second season was ramped up to an eleven to the point of blatancy. The first season was more focused on Hayato and Ui's growing relationship with it's titillation and harem elements to the side, the second season on the other hand seems to be the reverse of it, flanderizing Hayato's closeted perverse nature and making blatant fanservice moments for the sake of it and again not even doing ANYTHING with Hayato and Ui's relationship besides the typical misunderstandings and sexual acts they get to.\\n\\n\r\nThe animation by Seven does is the same standard it took from it's first season from the chibified expressions and the more oddly detailed ecchi scenes so at least both seasons were consistent in it's animation at least.\\n\\n\r\nThe voice acting is like the first season is what you expect just like it's first season with Ayana Taketatsu doing her thing as per usual with Minami Tsuda's tsundere act so not much of a change from the first season in this department either.\\n\\n\r\nAs much as LA found Okusama ga Seitokaichou!+! rather disappointing and conflicting and because of that it's second season had a double-edged sword underneath it all, LA KNOWS that ecchi fans will like this second season, it's unbashed with it's fanservice with little care for it's *ahem* \"plot\", but on the other side what the first season had for it's foundation of having an interesting yet comedically quirky relationship reduced down to be outright flanderized because it's second seaosn's fanservice were ramped up intensely is also a problem.\\n\\n\r\nYes, LA is taking an ecchi anime short seriously, because at the very least the first season was interesting because of the perverse yet interesting relationship to our two main leads and ecchi fans can have it's cake and eat it too, this second season doesn't have that charm and bombards you with nudity ANY chance it gets making the cake TOO big soo we get sick of it rather quickly...if the cake metaphor is anything to go by.",
            "date": "2017-11-06T22:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 262702,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=262702"
        },
        {
            "content": "Hey folks! Whats up? You like tits? You like characters acting out of character in their second season of their 8 minute per episode show? Do you enjoy casual sexual assault? How about highly confusing relationship dynamics? If you said yes to all of these things please get professional help and stay away from drugs and/or alcohol. But if you did this anime is probably for you. \r\nBut if you are a person with any amount of morals, respect for women, or sense of story structure, it would probably just be better if you just go chill out in chernobyl if you want cancer. Itllbe less painful that way.",
            "date": "2018-01-17T00:42:00+00:00",
            "helpful_count": 0,
            "mal_id": 268801,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Alamojak",
                "username": "Alamojak"
            },
            "url": "https://myanimelist.net/reviews.php?id=268801"
        }
    ],
    [
        {
            "content": "Welcome to tits the anime! Are you a filthy cave dwelling otaku who wants to watch a bunch of high school girls with large breasts swarm over one guy like moths to a flame without having any personality while at the same time remaining stagnant throughout the show? Then this is the anime for you!\r\nTo be perfectly honest this show lacks substance of any kind. It's a very basic ecchi show about a couple of high school students who are 'married' and live under the same roof together and hang out with their friends. Scenarios ensue in which the girls are either forced to removeas much clothing as possible or they find themselves in a situation in which they're groped by our main protagonist. That's it! It feels like a heavily condensed To-Love Ru. The characters don't really go through any development arcs and the story remains incredibly linear and dull. None of the characters feel as if they've grown all too much throughout the series either and it remains a very forgettable throughout.\\n\\n\r\n\"But LIQ, you cynical ass-hole, you hate everything anyway. Besides the seven minute length time doesn't allow for character development!!!1\"\\n\r\nTo that, I say you're half right (the ass-hole part anyway). However in regards to the second half, Space Patrol Luluco was also a seven minute anime but that show managed to do a whole of a lot more than this one while having fun and interesting characters with an actual over-arching story line so there is no excuse. This anime has no development of characters or narrative and is instead just a show in which borders on hentai without having any hentai at all. It's just an excuse to showcase a bunch of tits with nothing else and if that's the shows main purpose than I guess it achieved. The characters themselves could invoke a laugh or a smile out of me and I acknowledge that but you have to bust out the scale of justice to determine the shows worth and I can't help but rate this any higher since there are other shows of the same nature doing it much better. This show is vapid and has no substance nor did I have any fun while watching it. I found many of the characters to be either beyond annoying and every single one of these characters are the exact same in other shows done to a better effect.\\n\\n\r\nTo be fair they do attempt some character growth and development but it's not really much and is not given nearly enough time to develop or to flesh out characters since the show seems to need to fill a quota of stuffing about three hundred shots of tits and asses in our faces in the span of seven minutes.\\n\\n\r\nThe animation was pretty consistent and the character designs themselves were pretty good too so I can at least recommend this to people on a superficial level if they want to waste a little bit of time watching some guy grope some tits and the such but, to me, this always came across as a cock tease. If you really like ecchi shows then I'd say give it a shot but for everyone else I wouldn't waste your time on it. If you really want some tits go watch Kill la Kill or even better, a hentai!\\n\\n\r\n(Part of LIQfilms 12 Days of Christmas - Day 6)\\n",
            "date": "2016-12-18T09:54:00+00:00",
            "helpful_count": 29,
            "mal_id": 235747,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3420421.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LIQfilms",
                "username": "LIQfilms"
            },
            "url": "https://myanimelist.net/reviews.php?id=235747"
        },
        {
            "content": "This is the BEST ecchi anime I have ever seen, and trust me I have seen many. Good opening, wide variety of characters and superb ecchi scenes make it a must watch. The main advantage of this anime is that each episode is only 8 minutes long. \nOne of the rare anime which delivers what it promises.\nALL types of girls including tsundere , deredere , loli etc are included!\nIt also has a decent story and some scenes will make you unable to contain your laughter.\nThe ending episode is extremely good and will leave a warm feeling in your heart.\nI recommend you to not think muchand just ignore the rating and watch it, cause such anime are very hard to find!",
            "date": "2018-03-07T09:15:00+00:00",
            "helpful_count": 17,
            "mal_id": 273276,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6589953.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/SkydiverRed",
                "username": "SkydiverRed"
            },
            "url": "https://myanimelist.net/reviews.php?id=273276"
        },
        {
            "content": "Over the years, anime has given us a myriad of varying and powerful stories that chronicles the journeys of its characters through expressive and visual means that grasp and enthrall people with the wondrous worlds that they can create.  But you're not here for any of that.  Hell, if you're watching Okusama, you're here for one thing and one thing only.  Boobs.  \r\nStory: This second season of Okusama 'continues' off of the first season with relatively the same goals and ambitions of the first season with none of the progress.  At all.  What's presented as a second season ofthe series comes off as a dozen of 7 minute comedic OVAs with little to no continuity from episode to episode.  The formula for each episode starts with our protagonist Hayato Izumi engaging in some innocent situation with one or more members of the female cast (most commonly the two girls who are seen as his romantic interests), which eventually turns into a sexual situation that usually involves touching one's privates in some fashion or another, stopping before anything that constitutes as pornography can occur.  \\n\\n\r\nBeyond that, this virtually plotless piece of entertainment doesn't have anything else worth of value of mentioning.  Due to its nature as a seven minute short dedicated to entertaining whomever's watching with some relatively high sexual content, I don't really see much reason to go above and beyond with the show's minute nuances.  The high school and student council backdrop is a facade that doesn't get used that much, the characters are shallow and not much progress towards character development is actually made, and honestly, I don't see why anyone would actually watch this show for that things.  If you're watching this, you're watching this for boobs.  \\n\\n\r\nOverview:\\n\r\n+ Boobs (I can't not make this a positive, as it's...probably the two reasons why people watch this.)\\n\r\n-  Everything else is shallow.  (Plot, story, characters, everything.)\\n\\n\r\nCharacters:  The characters are the same.  Izumi's still holding in the urge to attack any piece of femininity that's hung in front of him, Ui still wants her fiance to notice, love, and probably deflower her, and Misumi's still that annoying tsundere character with too much pride as a morals committee member and jiggle physics.  Oh yeah, and I guess Karen, Niikuma, and Sawatari are there too.  You met them in season 1, and you'll see the exact same people in season 2 cause nothing changes.\\n\\n\r\nThe only new character we're introduced to is Saijou, the president of the photography club.  Presented as a comedic flirt who'll get the perfect shot by any means necessary, Saijou's character has the same pitfalls as everyone else, being a character that has no meaningful development or character, but is thrown in as a wrench in the works rather than a piece of meat for the male viewing audience to ogle over.  At least, not as much as the others.  So yeah, those're our characters.  Shallow examples of people with as much depth as a cardboard cutout.  Whoopee.\\n\\n\r\nOverview:\\n\r\n+/-  One dimensional people (It...kinda works?  Mostly cause the show doesn't give them enough time at all to even be remotely developed.)\\n\\n\r\nArt: Produced by Seven, a studio whose biggest accomplishments are Danna ga Nani and...various hentai (whoo, there's a spectrum), it doesn't come as a surprise that in terms of art quality, Okusama has some very average artwork mixed in with some surprisingly well done erotic scenes.  But unless you're here for a pair of mammary glands, don't expect the art to be all that spectacular.\\n\\n\r\nSound:  The music's not worth it.  Voice acting...you'll get quite a few moans, so fair warning, watch this with headphones, and with your computer facing away from the door.\\n\\n\r\nPersonal Enjoyment: To be completely honest, I don't really have much to say.  The manga piqued my interest, and I watched the corresponding anime.  Personally, nothing about this series really warrants me to like or despise it in a drastic manner.  I have my two cents, but in terms of overall enjoyment, I neither liked it nor hated it.\\n\\n\r\nDid I like this series?\\n\\n\r\nEh...Boobs were nice, I guess?  Boobs are always nice.  Jiggle physics are a bit laughable and improbable, but what the hell do you want?  It's anime.\\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nKaren, and...Misumi.  Their characters are annoying.  And because the characters are as shallow as a one foot pool, nothing about them will EVER change.  SO that's annoying, I suppose.\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nIf you really want to get something out of your system, or just really like boobs, then I suppose this is a good watch?  Keep in mind, the only thing you'll get outta this series is boobs.  Nothing more, nothing less.  If you want anything more than that, then watch some hentai; it's the next best thing.",
            "date": "2016-12-18T23:10:00+00:00",
            "helpful_count": 10,
            "mal_id": 235793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=235793"
        },
        {
            "content": "Ill first say this if your not a fan of a TON of ass and tits than just skip this otherwise lets get into it\r\nStory: honestly there really isnt a story in this season i just takes up from where season 1 left off really that Izumi and Ui are married again theres honestly nothing new too this season than the last one just a bunch of lewd and semi funny stuff \r\nArt: it was good the nipples and the boobs and ass were well good otherwise yeah \r\nSound: Op and Ed were decent but nothing id download or anything otherwise it was good\r\nCharacter: illfirst say all the side character were ok no one bothered me or anything like that. Izumi so hes pretty much the same in the 1st season he a pretty nice and chill guy but can also have that perverted side too him. Ui is pretty much the same as well from the 1st season a perverted but also heart warming person.\\n\\n\r\nEnjoyment: now too say i enjoyed this is kinda EH personally i didnt care for this season too me it was again like i said in the story semi-funny it was funny but mostly wasnt either and i feel they tried to throw tits and ass in your face too forget a story (if there was any story for that matter)\\n\\n\r\nOverall: Overall im giving this a 6 honestly u only need to see my enjoyment cause i feel like id copy paste what i said there in the overall part",
            "date": "2017-01-19T21:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 238660,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=238660"
        },
        {
            "content": "The art is good, the fan service is great, the voice acting and sound is great.\r\nBut.... to be honest... if you don't follow the manga... well... I wouldn't recommend this.\r\nWhile each chapter for the manga was short, it did have a nicely paced development, but this one just takes a few moments of the manga and animates them.\r\nAs a person who read the manga, this worked great, but it didn't feel great as a stand alone anime.\r\nAs a reader of the manga, this added feel for the manga and helped me enjoy the series as a whole more.\r\nBut it doesn't feel like an anime seriesrather than an OVA series for fans of the manga.\\n\\n\r\nOf course, if you like fan service and that is enough for you, then go ahead and watch this. You'd enjoy it.\\n\\n\r\nThe characters aren't unlikable, but they don't feel fleshed out if you take this series on its own.",
            "date": "2016-12-26T14:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 236585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2463757.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/deathmailrock",
                "username": "deathmailrock"
            },
            "url": "https://myanimelist.net/reviews.php?id=236585"
        },
        {
            "content": "It´s softcore pornography.\r\nEverything is as generic and bland as any other cookie cutter harem. \r\nYou got your tsunderes, your shy girls, your cunts, your inplausible character motivations and everyone involved being a one note character, that barely develops. Why the decent score though? This Anime delivers  something for  everyones pallet in terms of character design and personality, so anyone watching is inclined to find his/her [s]fap-material[/s] waifu.\r\nJust do not expect a compelling story or long lasting humor, the funniest part about this Anime, will be the comment section on the website you´ll watch it.\r\nAlso the comparably distinct artstyle and barely there cencorship helpalot.\\n\r\nWholeheartedly recommend it to openminded couples and perverts. Watch this if you want to skip foreplay with your girlfriend, or you want to bust a nut/clean the clam, to something less dirty than youporn.",
            "date": "2016-12-19T16:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 235858,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3231465.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Isterio",
                "username": "Isterio"
            },
            "url": "https://myanimelist.net/reviews.php?id=235858"
        },
        {
            "content": "What is there to say with this show huh?\r\nStory (1)\r\nI only give it a 1 because 0/10 doesn't exist on MAL. My reason why is well... IT DOES EVEN HAVE ONE ANYWAY. All it comes down to is either A. Izumi gets aroused and visualize the girl naked. or B. Have some more ecchi jokes and that's all there's to it. The whole purpose of the series was to establish a relationship with Ui and Izumi. They barely ever do that outside of the ecchiness that goes on there. I'll admit they did great things when comes to ecchi, but they fail at every thingelse. To add to injury, they made this into threesome adding Rin. Then adding more girls that amount to anything. \\n\\n\r\nCharacter (2)\\n\r\nThe only thing makes me prevent it from giving it a 1 is having attractive girls in the show and... that's it. No personality, no flair, no reason to relate to them. NOTHING! They are just there For Academic Purposes... nothing else. The Girls look good but their personality is generic as heck. And as for our MC, well he's became worse than he was in season 1. \\n\\n\r\nArt (7)\\n\r\nThe only thing I will give some positivity for the show. They make the girls look greater and better than season 1. The girls look beautiful naked (if only I could care about these characters) Lastly, I think the art improved compared to season 1 imo.\\n\\n\r\nSound (3)\\n\r\nIt's really nothing special. I normally don't listen to anime OP and ED since their not my style (unless they are really good) so I judge this by their OST and honestly their nothing for me to say that is interesting about the OST it's just generic as they come. \\n\\n\r\nOverall 13/40 (32.5%) F\\n\r\nRange: Bad\\n\r\nEnjoyment 1.5/5\\n\\n\r\nI like ecchi, I really do but I want to see it while establishing a great, consistent story. Okusama may deliver when it comes to ecchi but fails with story. If you wanna see a ecchi series while having a nice story and good romance I suggest you avoid this show and watch Freezing (despite being a battle harem it does so more results) otherwise watch Hentai cause that's how the show feels like at the end of the day.\\n\\n",
            "date": "2016-12-19T11:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 235827,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2816371.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/GalacticMagna",
                "username": "GalacticMagna"
            },
            "url": "https://myanimelist.net/reviews.php?id=235827"
        },
        {
            "content": "Honestly, this sequel was disappointing. I know it's an ecchi anime and that's the main focus, however this season turned it into a full-fledged harem anime. While the first season focused mainly on the wife-to-be, with a side tease of protests-too-much disciplinarian, this season focused /away/ from the main couple in favor of all the side characters. Quite frankly, it was a drop in quality from the previous season. Certain tropes, played a lot but not too much in the first season, are well overused to the point the story suffers and pushes it into the uncanny valley of comedy. I was thoroughly disappointed inthe movement from a cute ecchi couple series to ecchi harem series.",
            "date": "2018-04-16T16:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 278265,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4668707.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/gwennie-chan",
                "username": "gwennie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=278265"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nMy wonderful sister got married near the end of last year.\r\nHer husband (now my brother-in-law) are perfect for one another. They have each other’s backs, putting up with the other’s “baggage” despite their differences. And with him being one of the nicest guys that I know, and her being overly supportive, they are as compatible as can be.\r\nI know they’ll have a successful, happy marriage moving forward. At the minimum, they’ll be a lot better off than whatever Okusama ga Seitokaichou!+! presented.\r\nSTORY\r\nAs expected, Okusama contains similar content to that of the first season. Izumi andUi are shacked up, leading to the pair’s multitude of sexual romps. Unfortunately, Okusama also includes a ton of unnecessary elements that ultimately ruin the entire experience.\\n\\n\r\nChief among its problems is a refusal to let any of its sexual content play out. Not only in first-second-third base terms but also in emotional terms too. Izumi and Ui are about to passionately kiss? In barges Rin to stop it before it even happens. They’re about to get frisky in bed? Sorry, Izumi, but premature ejaculation would like a word. A Rin-and-Ui double feature ready and waiting? Whoops, Rin’s sister conveniently shows up to say a few words and derail the fornication.\\n\\n\r\nEven when the anime finally has the guts to show off its sexual content, much of it simply lacks spice or at least variety. One too many almost-touched-lips kisses with Izumi and groping without any flair lead from one boring sexual encounter to another. Izumi helping Ui take a suppository is as adventurous as the anime gets.\\n\\n\r\nThese events and the ones outside the realm of debauchery also go against Okusama’s previous season’s theme on marriage even more so than ever before. The anime constantly places Izumi in situations that don’t involve Ui whatsoever or simply don’t mesh with the marriage aspect of their relationship.\\n\\n\r\nFor instance, they raid the photography club’s clubroom, but it’s an event that has little (if anything) to do with how Ui and Izumi get along. What occurs, then, is a slew of scenes that should have never been allowed to happen in the first place since they continue to reinforce why the anime does not deserve to be titled My Wife Is the Student Council President.\\n\\n\r\nThe anime does keep its motif in mind on occasion, like when Ui complains about Izumi not giving her enough attention (and touching) or when Izumi eats the food Ui concocted despite its nefarious aura (because that’s what a man should do). Sadly, Okusama would much rather give Rin yet another unnecessary shot with the male lead, bringing the anime back towards polygamy.\\n\\n\r\nOkusama does have its small moments. The condom that Rin’s older sister gave to Izumi returns as a joke later in the season when Rin discovers it in his desk drawer, and the final episode proves that the anime didn’t forget about Ui’s parents from last season, giving them a miniscule cameo to cap off this this season. Plus, it does have the usual cute pouts and comedic jokes to fill the gaps between the promiscuous asides.\\n\\n\r\nUnfortunately, so much of the content is boring, aggravating, or otherwise lacking that whatever else Okusama attempts to do cannot heal its self-inflicted wounds.\\n\\n\r\nANIMATION\\n\\n\r\nIn this second season of Okusama, the amount of actual animation seems to have decreased. Characters will sometimes shift forward without moving their limbs, and the events themselves usually end up as just the characters speaking to one another while standing. Rin’s breasts do jiggle at every opportunity, but that’s not enough to justify how static a lot of the scenes feel. Especially when the sexual content refuses to give much more than Ui sucking Izumi’s finger or showcasing yet another still-framed picture of the girls as naked as possible.\\n\\n\r\nSpeaking of the sexual content, the anime at least (and once again) provides a censored and uncensored version.\\n\\n\r\nNaturally (and once again once again), the uncensored material is the biggest draw of the show and wins out over the censored material. Granted, all that’s really shown are nipples, and the explicit material that’s too tough to cover up with baby chicks is replaced with theatrics that aim for cute, comedic relief. But the crotch shots, despite their perversion, are why the audience are there in the first place, so uncensored is really the only way to go.\\n\\n\r\nThe artistry in general still doesn’t impress, but it gets the job done. While the fast-moving backgrounds and the talking-head bubbles are relied on more than usual, Rin and Ui still have their attractive designs, and the silly reactions with the squatter, comedic depictions of the characters invites the cuteness and the funniness with ease.\\n\\n\r\nCHARACTERS\\n\\n\r\nAs an ecchi, comedic short, Okusama doesn’t have the character depth that regular dramas tend to include. However, that doesn’t excuse the anime from a lot of choices it makes regarding its cast.\\n\\n\r\nFor example, Rin receives a lot more attention this season. Said attention is mostly going towards her chest, but Okusama also highlights her naivety when it comes to love and the difficulty she has in accepting Ui’s working theories on letting lust live. Thus, Rin starts to take part in the lasciviousness, letting Izumi release his pent-up hormones with her breasts or thinking about buying a black bra to satiate Izumi’s own desires.\\n\\n\r\nYet, during most of Rin’s sexual interactions with Izumi, the outcome is the same: punching him in the face. Despite initiating the situation herself, she’s the one who ends it (often in a violent manner).\\n\\n\r\nTo be fair, her even putting herself in those situations is arguably a big step forward for her, considering her role as the head of the disciplinary committee and her previously discussed naivety. But she never truly leaves this quasi state of liking-Izumi-but-not-really. Plus, it gets quite old quite fast to see her stop her progression for the umpteenth time when she was the one to start it in the first place.\\n\\n\r\nUi and Izumi are no better. Arguably, they are worse.\\n\\n\r\nAs a (supposed) couple, they don’t have very many scenes together. With Rin refusing to go away, the introduction of Honoka, and the comedy involving the side characters, Ui and Izumi rarely have any alone time. When they finally are alone, they almost never exchange words of love or commitment, and the relationship they do share does not rise above friends with benefits.\\n\\n\r\nIt gets worse. Looking at Ui and Izumi individually, they don’t help themselves or each other.\\n\\n\r\nUi constantly lets Izumi take part in situations with the other characters that will inevitably become sexually charged. She either has no idea, is oblivious, or, worst of all, simply doesn’t care.\\n\\n\r\nIzumi is similar. His instincts will eventually control him if pushed to his absolute limit, but these moments are rather uncommon. Sometimes, he himself won’t let their relationship move forward, like when he “has to go to the bathroom” when Ui says right to his face how she won’t run away from him, readying herself to kiss him outright.\\n\\n\r\nAs for everyone else, Okusama should get some credit for providing its side characters with a moment or two to shine. Ayane gets to see what it is like to have a boyfriend, Karen learns to not hate Izumi’s guts as much, and Honoka creates some scenarios for Izumi, Ui, and Rin to comingle within.\\n\\n\r\nBut even this credit is difficult to see as a positive when one realizes that they are also getting in the way of what is supposed to be a “marriage” between Ui and Izumi. Ayane gets somewhat tacked on as last-ditch option for Izumi, Karen’s episode doesn’t incorporate Ui to any large extent, and Honoka comes off as an unnecessary addition to the cast when she barely contributes to the plot besides snapping a few phots here and there.\\n\\n\r\nAgain, Okusama isn’t a “deep” anime, and the sole reason for watching it is to see some occasional boobies, so a lot of these gripes are “pointless.” Still, when the anime is arguably an anime about Ui and Izumi, and what’s presented is anything but, the show does not do itself any favors.\\n\\n\r\nSOUND\\n\\n\r\nThe opening track and the ending track are (understandably) small pieces that help to set the tone for Okusama.\\n\\n\r\nThe OP uses piano and drums to create a fast beat with a sense of nostalgia, but the grating instrumental in the background is way too distracting no matter how many bells go off. The ED is even shorter than the OP (twenty seconds versus thirty seconds), but it stands as the better of the two thanks to its happier feeling through blaring trumpets. Also, letting the voice actresses for Ui, Rin, and Honoka sing their own versions of the ED gives it more variety than its OP counterpart.\\n\\n\r\nThese voice actresses are Ayana Taketatsu, Minami Tsuda, and Sora Tokui (respectively). While Ms. Tokui does not have any notable scenes, Ms. Taketatsu knows how to pout, Ms. Tsuda has the authoritative drive, and the two can moan when needed.\\n\\n\r\n(And a small shout-out to the talking hormones, condoms, and erections that supported the show in comedic fashion.)\\n\\n\r\nThe rest of the original soundtrack remains the same as the first season. A light piano backs the romantic scenes and steps along for the sillier ones. And a nice acoustic guitar accompanies the quieter, simpler times.\\n\\n\r\nENJOYMENT\\n\\n\r\nOnce again, I find myself conflicted over an anime.\\n\\n\r\nOn the one hand, it’s frustrating to watch many of the scenes play out when they almost always conclude with some interruption or unnatural shove in the opposite direction. A lot of this interrupting and shoving derives from Rin, but Ui is no better when she fails to make any significant strides due to her odd choices. To be fair, Izumi is just as much at fault with everything as these two, but he at least has the excuse that he’s at their mercy most of the time.\\n\\n\r\nOn the other hand, I like both girls. Ui has the caring personality that I find very attractive, and Rin has the bombshell looks that get my head turning. Ui made me laugh with her huge pouts, Rin had me smiling at her blushes, and the two together were no doubt arousing when it came to their ecchi escapades (even if they weren’t exactly novel).\\n\\n\r\nI want to like this one more than I do, but the anime makes it hard to do so. The show should just go all the way in one direction with either Rin or Ui. Enough of the back-and-forth, maybe-maybe-not wishy-washiness. Because the anime is cute and funny and arousing – but it just doesn’t know what it ultimately wants to be.\\n\\n\r\nOkusama ga Seitokaichou!+! ends up worse off than its previous season. Further deviation from its marriage motif, less animation, and not enough focus on Ui and Izumi are its biggest mistakes. Its art and music remain consistent, but it’s a show that one will part with long before death.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, constant refusal to let events play out and even more unnecessary “polygamy” entirely defeat the purpose of the narrative\\n\\n\r\nAnimation: Fine, while less movement occurs, the uncensored material and the comedic portrayals keep the visuals both alluring and fun\\n\\n\r\nCharacters: Terrible, Ui and Izumi’s relationship goes nowhere as they and those around them impede their progress without fail\\n\\n\r\nSound: Fine, bad OP, okay ED, okay OST, and okay VA performances\\n\\n\r\nEnjoyment: Fine, Rin and Ui are likable, but having both together only makes things unlikable\\n\\n\r\nFinal Score: 3/10",
            "date": "2018-03-01T18:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 272773,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=272773"
        },
        {
            "content": "So uhhh...Okusama ga Seitokaichou! gotten several more layers of cake from this season and NOT in a good way.\r\nOkusama ga Seitokaichou!+!'s second season by all means did \"try\" to reel in the minor characters and give them a bit of screentime in comparison to the first season, characters such as Karen Fujisaki and Ayane Niikura while teasing the \"relationship\" between Hayato and Rin...in the most blatant fanservicey way possible. Hayato and Ui's relationship for this second season also seemed to have static pretty quickly what with Hayato's pseudo-harem formed and given their screentime, add in a new character in the form of Honoka Saijou voicedby Sora Tokui and we have a mess of a second season to the point LA was debating if the second season improved or not due to it's character development. It didn't. Why?\\n\\n\r\nBecause this may had just been LA but the fanservice aka. \"mild nudity\" this second season was ramped up to an eleven to the point of blatancy. The first season was more focused on Hayato and Ui's growing relationship with it's titillation and harem elements to the side, the second season on the other hand seems to be the reverse of it, flanderizing Hayato's closeted perverse nature and making blatant fanservice moments for the sake of it and again not even doing ANYTHING with Hayato and Ui's relationship besides the typical misunderstandings and sexual acts they get to.\\n\\n\r\nThe animation by Seven does is the same standard it took from it's first season from the chibified expressions and the more oddly detailed ecchi scenes so at least both seasons were consistent in it's animation at least.\\n\\n\r\nThe voice acting is like the first season is what you expect just like it's first season with Ayana Taketatsu doing her thing as per usual with Minami Tsuda's tsundere act so not much of a change from the first season in this department either.\\n\\n\r\nAs much as LA found Okusama ga Seitokaichou!+! rather disappointing and conflicting and because of that it's second season had a double-edged sword underneath it all, LA KNOWS that ecchi fans will like this second season, it's unbashed with it's fanservice with little care for it's *ahem* \"plot\", but on the other side what the first season had for it's foundation of having an interesting yet comedically quirky relationship reduced down to be outright flanderized because it's second seaosn's fanservice were ramped up intensely is also a problem.\\n\\n\r\nYes, LA is taking an ecchi anime short seriously, because at the very least the first season was interesting because of the perverse yet interesting relationship to our two main leads and ecchi fans can have it's cake and eat it too, this second season doesn't have that charm and bombards you with nudity ANY chance it gets making the cake TOO big soo we get sick of it rather quickly...if the cake metaphor is anything to go by.",
            "date": "2017-11-06T22:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 262702,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=262702"
        },
        {
            "content": "Hey folks! Whats up? You like tits? You like characters acting out of character in their second season of their 8 minute per episode show? Do you enjoy casual sexual assault? How about highly confusing relationship dynamics? If you said yes to all of these things please get professional help and stay away from drugs and/or alcohol. But if you did this anime is probably for you. \r\nBut if you are a person with any amount of morals, respect for women, or sense of story structure, it would probably just be better if you just go chill out in chernobyl if you want cancer. Itllbe less painful that way.",
            "date": "2018-01-17T00:42:00+00:00",
            "helpful_count": 0,
            "mal_id": 268801,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Alamojak",
                "username": "Alamojak"
            },
            "url": "https://myanimelist.net/reviews.php?id=268801"
        }
    ]
]