[
    [
        {
            "content": "This anime is a ecchi, action, harem and school genre, all these genres together result in an anime style that usually do not please the audience, that's the big problem here. When you first see this anime you may think \"Yeah, this is the kind of cliche anime that every anime season has\", but in my opinion you are wrong if you thought that, personally I was wrong too, I admit, I thought it was the same cliche of always, but it ended up being an anime way more interesting.\r\nThe story takes place in a fictionary world, where there are ancient weapons, named Drag-Ride thatare ancient mechanical weapons. Five years ago, the protagonist, named Lux Arcadia, was the prince of the Empire, and he also was known as the strongest Drag-Knight, the Empire was destroyed due to a revolt, now Lux is known as the \"Weakest Undefeated\", the Drag-Knight who doesn't attack. Due to some reasons Lux ends up entering a girl's school that raises Drag-Knights.\\n\\n\r\nThis is the story, not bad thought, if it was a little more serious I think it could've been an anime that would please more audience than this, one problem is how ridiculous things end up happening and how all the girls want so bad the protagonist, but if you think about it, it's very common in the harem anime genres, not saying that it explains why, I think if a harem is built in the correct way it can be good, sadly it wasn't the case.\\n\\n\r\nThe art of the anime has many 3D aspects, which may be a little unpleasant for some people, some parts I think the art was very strange and bad, but nothing that displeased me so much, the art was most part of the time OK, the fighting scenes were all OK too.\\n\\n\r\nAbout the sound, I can't really say if it was good or bad, it didn't caught my attention enough to make an opinion, so I will just say it's OK too, I also liked the OP, it gets in your head, the ED was also very good, singed by the group nano.RIPE that I personally like very much.\\n\\n\r\nIf I have to say something about the characters is that, yes they are cliche, there are all of the types of girls that almost every harem anime has, but that is almost a standard of harem animes. So I really think that the characters are not bad at all, I liked even some of the supporting characters, maybe more than some main characters, lol. They all have some interesting story about their pasts, and their personalities and ways of acting didn't displeased me at all.\\n\\n\r\nIf I have to choose if I enjoyed it or not, I would really say I enjoyed, the beggining may not catch your attention, even I thought about dropping it in the beggining, but I don't regret not dropping it, if it gets a second season in the future I will watch, if you dropped and are reading this, I advise you to give it another chance, you may end up liking it, just like me.\\n",
            "date": "2016-03-30T07:05:00+00:00",
            "helpful_count": 83,
            "mal_id": 214789,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4411401.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MiRaD",
                "username": "MiRaD"
            },
            "url": "https://myanimelist.net/reviews.php?id=214789"
        },
        {
            "content": "I started this show back when it first started airing, because I was bored. I've seen most of the big name harem and ecchi series, and figured \"I may as well try this.\". Mecha isn't really my thing, but the fact that this series is a Mecha isn't even what makes it bad. There may be light spoilers in here, but honestly, this show doesn't even have much of a story to begin with, and I can only imagine one thing that could be spoiled, and it really isn't even that major.\r\nStory: 2 \r\n     This series really had no overall story.It just had mini-arcs that comprised the whole thing, and then one antagonist that wasn't really explained well at all. The series starts off with the protagonist conveniently falling into a girl's bath. And whadaya know, it's the most important girl in the kingdom! He then has to fight her for some reason to gain entry into a girl's only school to learn how to use his mech. Lets not forget that he is the biggest badass in the kingdom, and singlehandedly overthrew a regime, literally a legend among people. For reasons unknown he has to go to school.\\n\r\n     Naturally, their fight gets interrupted, queue the \"evil\" in the show: the Abyss. They really aren't explained very well either. In the beginning, they seem to have their own free will, since they have no tactics whatsoever, yet later on in the show they exist solely to be used by people who have certain flutes. And there are multiple flutes, which makes it quite easy for people to control them (somehow). Every time one type of enemy gets stale, they get an upgrade, From normal Abyss, to big scary Abyss, to Giant ass fortress.\\n\\n\r\n     Also of note, for reasons unknown, I can count on one hand the number of males who could use a \"Drag-Ride\". Why is it only females? Why is it a female only school? How do the few guys that do know how to use a Drag-Ride learn in the first place when even Lux was given such a negative reaction upon trying to get into the only school ever talked about in the entire show?\\n\\n\r\nArt: 7\\n\r\n     I'm no art critic, but I liked the way it looked. It wasn't as good as Phantom World by any stretch, but it was fluid, and looked nice. \\n\\n\r\nSound: 7\\n\r\n     The OP is bad. Starts off like it's going to be really intense, then drops into a random electro-pop conglomeration with poorly translated english words thrown in for flavor, like \"fight for the sky!\". ED is decent, but generic. The Sound effects however are where this show really shines. Every time a character pulls their sword out, my ears have a mini orgasm, and explosions are nice and crisp. A female voices Lux, but honestly, that didn't make the slightest difference to me. In fact, I wouldn't have even noticed if I hadn't read it in another review a while back. Other voice actors are alright, nothing stood out as exceptionally good, or exceptionally bad, so I can't complain.\\n\\n\r\nCharacter: 1\\n\r\n     This show has the worst character cast that I have ever seen. Boring main character, generic tropes for every girl in his harem, etc. \\n\r\n        Lux: Main character, has no backbone except to \"Protect his friends\", never goes on the offensive. His nickname because of this is the \"Weakest Undefeated\". Is completely clueless about how girls work, and even when he has opportunities right in front of him, he drops them. He lacks confidence in anything but his goal to protect his friends, which makes him lose so many opportunities. He could have been laid many times throughout the season, by any of the people in his harem, yet instead he gets a total of 3 kisses, which aren't dramatic at all, and very anti-climatic, since he freaks out after each one.\\n\r\n        Airi: Lux's little sister, because what show would be complete if the main character didn't have a sister that rarely does anything except push him forward in his determination? Has barely any screen time, manages to be condescending in spite of this. \\n\r\n        Lisesharte: The princess that he falls into the bathtub with. tsundere, quickly goes full dere in less than a full episode, and then just manages to push herself away from him due to her own stupid decisions, because you can't have a relationship in a harem.\\n\r\n        Philphie: the kuudere childhood friend. Eyecandy is pretty much her sole purpose in the show, barely even an interest in his harem. She's too apathetic to care if Lux goes for her or anyone else.\\n\r\n        Krulcifer: The only good character in the show. She is the only one you can't always predict, and that is the only redeeming factor characterwise. Still not enough to pull the rating upto a 2.\\n\\n\r\n     Those are the only characters I even know the name of. There is a great deal more of them, and none of them are really of any consequence. A brown haired chick that serves no purpose other than pushing the members of his harem closer to him. A black haired girl who is emotionless. I know I'm forgetting characters, but clearly they weren't important enough to remember anyways. Most of them serve a single purpose as a plot device, and the only characters you get a backstory for are Krulcifer and Philpie. \\n\\n\r\nEnjoyment: 5\\n\r\n     This show was one of those where you watch it, in full knowledge of exactly everything that is going to happen before it actually does. It is nothing if not predictable. \\n\\n\r\nOverall: 5\\n\r\n     Unless you're trying to get someone introduced to all of the common harem-genre antics, I would not recommend this show to anyone. I was quite looking forward to just getting it over with at the end. I could recommend many other shows that do harem better than this, and even Infinite:Stratos did harem better than this. It's no good as an ecchi, since the only ecchi is a bath scene at the very beginning, a 5 second scene in the second episode, one back massage with Celes and then Phi's boobs constitute the rest of the ecchi throughout the rest of the show. It's not good as an action, because there is too much drama involved with personal relationships. \\n\\n\r\nTL;DR Avoid this show unless you are out of any other show you could possibly think of, or if you are introducing your friends to the nuances of weak-character harems. \\n",
            "date": "2016-03-29T03:56:00+00:00",
            "helpful_count": 31,
            "mal_id": 214651,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5025521.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/totesnotaweeb",
                "username": "totesnotaweeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=214651"
        },
        {
            "content": "Sorry if I used wrong words or some grammar errors, that's because English isn't my primary language.\r\nOk, here is the review :\r\nWhen I see this for the first time, I was thinking about Asterisk and Failed Knight because they have a similar intro, but I don't really mind it. But after completed this anime, I was very disappointed. Many things came up and make this anime more worse, fot example the last battle was good actually, but some things came and almost make me stopped watching fot a while, but I finally managed to watch it until end. \r\nFor the story, it's bad. It's reallybad. I can't tell how bad it was by word. Our mc, have a divine drag ride and supposed to be a strong character, in the last battle I think he would use all of his power, but no. His power were useless, well not completely useless but it's useless. That's same with other characters, nobody used their power to the max, that's make me it worse. Beside, the story is pretty hard to understand but I don't really paying attention into it.\\n\\n\r\nIntro and ending were good, the songs were nice, it also easy to remember. The voice act is awesome, I like it. The sound effect is great,  No complaint from me, but overall I don't really like it because some background songs weren't fit with the show. But that's okay, I don't mind it.\\n\\n\r\nOverall it's an average show for me, because it have bad side and good side. I recommend this to you if you here only for the harem genre (it's not contain alot of ecchi). But if you looking for a good battle or something other than harem, you wouldn't be like this. The ending is a cliffhanger (this is an announcement, I won't tell you why did I wrote it) and I think it would be good if this has a second season.",
            "date": "2016-03-29T08:33:00+00:00",
            "helpful_count": 24,
            "mal_id": 214670,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4802833.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ZinxSter",
                "username": "ZinxSter"
            },
            "url": "https://myanimelist.net/reviews.php?id=214670"
        },
        {
            "content": "I really don't understand the appeal of this, it's good for people who've never seen a mech/harem/action/romance/ecchi anime in their lifetime, but otherwise I can't see it. It's just a cesspool of horrible tropes mixed into a fuckfest of bad characters and predictable storylines. Anytime you feel like it might be good, it just falls flat on it's face with disappointment. \r\nThe entire show is just a massive cop out. I can't find a single interesting thing in this anime that hasn't been borrowed from something else. The main character's backstory was interesting until you get ever so slightly into it and realize it's boringas shit. The voice acting isn't necessarily bad, but it's nothing to write home about. The character and mech designs are pretty bad as well, they're all bland rip offs of other mediocre characters. Each one has an equally bland back story that you can immediately see in the first 3 seconds of their dialouge. For some reason, they can never have a fight without some dumbass monster interrupting and forcing them to work together, which is yet another cop out. Even the fights with the things that interrupt are cop outs.\\n\\n\r\nThey usually happen in exactly this way: \\n\r\n\"Lets fight this person and/or monster.\" \\n\r\n\"We can't win!\" \\n\r\n\"Oh no! I am being forced to use my super powerful mech robot!\" \\n\r\n\"Reload on fire!\" \\n\r\n Done.\\n\\n\r\nThat's how it works. Nothing new. Nothing interesting. Imagine everything you hated about Infinite Stratos and Sword Art Online forced into existence by some shitty writers and mediocre artists. That's all this is.\\n\\n\r\n(P.S In case your wondering, it's not even so bad it's good, it's in the middle area where you can see even the slightest amount of effort was put in, but just enough so that it's presentable, nothing else.)",
            "date": "2016-03-02T03:09:00+00:00",
            "helpful_count": 10,
            "mal_id": 212086,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5234374.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Seba_Onyx",
                "username": "Seba_Onyx"
            },
            "url": "https://myanimelist.net/reviews.php?id=212086"
        },
        {
            "content": "This is the 1st anime that a friend has shown me to watch so that I can join their conversations and not be that silent kid sitting in the corner of the table at lunch. As this was the first show I watched since Pokemon more than 5 years ago, I did not know what to expect.\r\nNow that I have watched it, I can safely say that this is extremely disappointing and bad. Not only is the story near non-existent and bad, the concept itself is terrible. Having machineries in a medieval setting is certainly unique, the 3d animation and the design of the machinesthemselves do not fit the time period that which the story takes place in. Action scenes feel a little bit awkward given the weird blend of 3d animation on the machines in a 2d environment. It also baffles me that the entire student body in the school are all girls with the exception of the main character. \\n\\n\r\nThe characters annoy me to no end. The main character's only traits is that he is a super kind guy who is also strong at fighting and has a dark past. He has no other personality outside of that and comes across as completely boring. His lack of backbone and naive nature also pisses me off.\\n\\n\r\nThe other characters are terrible as well, to the point that I don't even bother to remember their names. In fact, the only memorable things about them is that they all have ridiculously hard names to pronounce. The yellow-haired girl who I assume is the heroine is a terrible character. I can't even take her seriously given how outright absurd and stupid the first encounter she has with the MC is and the only personality she has is that she obviously likes the MC for no reason other than I think is that he is a super nice guy. The only other character who I find a tad bit interesting is the blue-haired girl given her background and the couple of episodes that focused on her was a bit interesting I guess. The rest of the characters are completely forgettable and has no large impact to the show.\\n\\n\r\nOverall, this show is terrible, and felt like a complete waste of time. This is the opinion of someone who's experience with anime are only in Pokemon and Digimon, so my opinion might not be as important or highly regarded compared to a person who has watched more anime.\\n",
            "date": "2016-04-10T12:06:00+00:00",
            "helpful_count": 9,
            "mal_id": 216042,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5159270.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/CluelessPotato",
                "username": "CluelessPotato"
            },
            "url": "https://myanimelist.net/reviews.php?id=216042"
        },
        {
            "content": "Fans of the typical action-based harem show rejoice, here is yet another entry that follows the script to the letter. See princess naked in first episode? Check. Have princess challenge and lose a duel to the protagonist? Check. Have princess give up on retribution afterwards and pledge fealty to the protagonist? Check? All in the two episodes? Check.\r\nBahamut is a mech-based, semi-fantasy action-based harem that follows closely in the footsteps of shows such as Gakusen Toshi Asterisk and Rakudai Kishi no Cavalry. The twist this time is that our protagonist is the disgraced prince of the former empire that was overthrown after oppressing its peopletoo far. To somehow atone for his family's past, Lux works as a handyman in the new empire, helping in whatever capacity others need. However, after the events in the first episode, he becomes the only male student in an otherwise female-only academy, and becomes one of the knights defending the school and empire. What enemies lurk in the distance beyond the empire, and what dangers lurk within the multitude of bijins in the school?\\n\\n\r\n[b]Animation:[/b]\\n\r\nBahamut is a well drawn show with a bright, relatively saturated color palette and a serene setting with a nice albeit blurry mountainous backdrop. There's a nifty blend in the setting between rustic buildings and scenery and ultra-modern technology such as the sword-mechs and holographic ear-pieces. Unfortunately, there is a ton of CGI usage with the mechs here and though it's relatively good quality, it's still distracting at times. The mechs themselves aren't anything that great, their appearance is probably most similar to those seen in Infinite Stratos. The generic mechs used by non-important characters look like they took their color scheme right off of the training mechs of Aldnoah Zero. Character styling is pretty good with a diverse looking cast and a good variety of clothing. There are occasionally some drawing inconsistencies (random clothing articles changing color within a scene) but overall things check out well here. If I were to find fault in something, the overly-obvious, crazed antagonist look makes things too, well, obvious.\\n\\n\r\nThis show has a fair amount of action with a lot of mech battles and a slight amount of blood. Antagonists take the form of either other mech pilots or occasionally weird dragon-like ancient creatures known as Abyss. Our protagonist wields two swords, which can each transform into a piloted mech. One is a wyvern, an average sacrificial mech. The other is Bahamut, which is essentially a Strike Freedom in Gundam terms. The first time our protagonist uses Bahamut can be likened to the first time Goku goes Super Saiyan, the entire world stops to marvel at what has happened; humorously future summonings have no such effect. Unfortunately, Bahamut is so strong (and fast) that its special ability allows the animator to literally carve out a path of destruction on the screen. If you're looking for outstanding choreography, unfortunately this isn't where you'll find it.\\n\r\nThis is indeed an ecchi based harem, the protagonist pretty much sees all the heroines at least partially undressed (except his sister thank goodness) and has more than his share of accidental exposures. Granted, some of the heroines are very aggressive relationship-wise (such as Krulcifer) so expect them to make moves on our poor (or lucky?) protagonist.\\n\\n\r\n[b]Sound:[/b]\\n\r\nThe show opens with a few nice guitar notes but then dives into a melody that that isn't particularly inspiring; it's electronic but not in the right way. The ED carries a similar guitar-based feel with Nano.Ripe's instantly recognizable voice. It's not a particularly memorable song but a fitting cool down piece. The brass instrumentation of the BGM during the title intro and various other portions of the show definitely give the show a fantasy-like feel. The overall BGM is minimalistic most of the time, and the  instrumentation changes based on the scene. There's a nice memorable, string-based theme whenever our show gets to a battle climax.\\n\\n\r\nWith the exception of Lux obviously being voiced by a girl, I think Bahamut's cast is actually very good. This is the first major role for Lynn that I've seen, and she does a pretty convincing tsundere as Lisesharte. I really liked Ari Ozawa's voice as Kirin in Gakusen Toshi Asterisk and her \"nii-san\" callings are pretty effective here too. Though her character isn't my favorite, Risa Taneda does a great job here as well. And not to be outdone, Shizuka Ishigami has an extremely dangerous/flirtatious character and she totally nails it. Again, if I were to have to pick a negative, it would be the antagonists; the VAs do a perfect job of matching a crazy-sounding voice to the already crazed-antagonist look.\\n\\n\r\n[b]Story:[/b]\\n\r\nLux is a Drag-Knight (short for Dragon-Knight, though I don't think Japan gets the connotation of their shortened form), which means he can make his sword magically turn into an armored mech, which he can pilot. However, he is not just any knight but the infamous pilot of Bahamut, the pitch-black machine dragon responsible for single-handedly bringing down the former empire (his father's empire essentially). It's an interesting twist to the setting that honestly isn't fully explained in the show.\\n\\n\r\nThe show follows Lux as he assists the all girls' school with various tasks, often involving saving various girls in succession who become smitten afterwards. The central plotline is actually rather weak, as the episodes tend to do a round robin through all the heroines. Once all the heroines are \"conquered\", we find that there is yet another tournament! This brings the show to an over-the-top climax followed by an all-too-familiar conclusion.\\n\\n\r\nHonestly, despite following the plotline of virtually every other action-based harem in the past few years, this is a story well executed. The story flows well and successfully weaves just the right amount of character development and interaction into the main plot. There's just the right amount of action mixed with a dose of comedy, ecchi, and romance.\\n\\n\r\n[b]Character:[/b]\\n\r\nThere are quite a few characters in Bahamut, and not all of them are treated equally. Some of the girls are successfully differentiated enough (such as Lisesharte and Krulcifer) but others still end up feeling like cookie-cutter characters (such as Celistia and pretty much all the antagonists). Airi is a nice accompaniment to Lux though one may wonder why she's just treated as an encyclopedia and fact announcer; perhaps they just wanted to be completely sure not to annoy viewers with an incest route. I guess I'm just happy that the show didn't turn into another Aokana as both Krulcifer and Kirihime are quite bold.\\n\\n\r\nThere are quite a few supporting characters, many of whom don't contribute all that much to the story; I will say Noct is a fun character as \"Yes\" and \"No\" are like half her lines. Despite these, there is a fair amount of character interaction and relationship development. Yes, a lot of it is just Lisesharte looking jealous as Lux hangs out with the other gals, but it's in a reasonable quantity. If there's one downer, it's that the characters are pretty static overall, I can't say that the events of the show strongly changed any of the characters (just having feelings for the protagonist doesn't count).\\n\\n\r\n[b]Value:[/b]\\n\r\nBahamut should be the go-to action-based harem of the season. It's an entertaining, easy to watch show with a good mix of themes and a fluid execution. It's obviously not perfect as described above but overall it tells a nice story with reasonable depth and memorable characters. There are plenty of unanswered questions at the end of the show so I'd expect there to be a sequel as well. Compared to other shows of the genre, I think it compares about equally with its predecessors such as Rakudai Kishi no Cavalry but with a much more moderate dosage of ecchi (especially when compared against Testament). Looking for a decent harem with some action? You've found it.\\n",
            "date": "2016-09-25T17:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 230218,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=230218"
        },
        {
            "content": "This season brings us another title to add to our catalogue of generic battle academy harem anime: Undefeated Bahamut Chronicle. These days it's hard for shows to be innovative so when I watch a show featuring common clichés I tend not to get too worked up about it, but this show doesn't at least attempt to try to differentiating itself and it is as generic as they come. By the first episode these things occur within JUST the first episode:\r\n☑ MC is a dense nice harem lead.\r\n☑ Protagonist is actually OP.\r\n☑ MC gets enrolled into an all-girls school.\r\n☑ Started with the MC accidentally groping orseeing a girl nude.\\n\r\n☑ Female student challenges MC to a duel.\\n\r\n☑ Every girl falls for the MC. (I'm not joking with you. Every single female in the school pretty much wants this guy's D.)\\n\\n\r\nStory: 2/10\\n\r\nThe story can be summed up like this: \\n\r\nMeet MC-kun. After some circumstances he ends up enrolled in an all-girls school (because why not?) and through his efforts he accidentally ends up getting an unwanted harem. The end.\\n\r\nMany shows within the \"battle academy harem anime\" genre can for the most part be summed up like this. Obviously this is not a true summary of the story but it does fit Undefeated Bahamut Chronicle and many of its similar shows pretty well.\\n\\n\r\nJoking aside, here's a rough summary:\\n\r\nThe previous ruling empire of Arcadia was overthrown via a rebellion five years ago. Lux Arcadia, a former prince of said empire accidentally ends up in a female dormitory's bathing area and falls on top of the kingdom's new princess Lisesharte while she is bathing and she challenges him to a Drag-Ride duel. The results of the duel somehow ends with Lux being enrolled into this all-girls school which \"coincidentally\" is where his younger sister and childhood friend are enrolled in.\\n\\n\r\nIf you think the story will try to explore its world more by explaining more on what the monster's known as Abyss are or what Drag-Rides are you'll be pretty disappointed. The Abyss are your generic evil monster that our main characters must destroy and the Drag-Rides simply get an explanation of: \"They are ancient weapons excavated from the ruins.\" The anime does have a plot but due to some pacing issues I can't really make much of it and with its one-dimensional villains all over the place I can't say who the actual antagonist really is.\\n\\n\r\nBasically what I'm saying is rather than focusing on better pacing, world building, and actual good character development most episodes are like this:\\n\r\n• Insert generic harem antics here.\\n\r\n• Potential haremette is in trouble!\\n\r\n• Lux defeats the one-dimensional villain and saves her.\\n\r\n• Girl has joined the harem!\\n\r\n• Repeat.\\n\r\nThis is the case for: Lisesharte, Krulcifer and Celistia which is more than half the harem!\\n\\n\r\nArt: 5/10\\n\r\nThere's not really anything noteworthy to mention, it's pretty average. A lot of CGI is being used in the fights and they look pretty good at very least. Character design wise... I don't like Philphie very much. Her hair looks weird along with her massive breasts.\\n\\n\r\nSound: 4/10\\n\r\nWho thought having Lux being voiced by a woman would be a good idea? He sounds much too feminine! The OP and ED are at the very least decent overall although sometimes the beginning of the OP makes me want to bang my head against my monitor.\\n\r\nAs for the soundtrack, it's nothing special. It fits the mood of the show and all but I can't see myself praising anything about it at all although it would be nice for more variety considering every fight in the show seems to use the same exact track every time.\\n\\n\r\nCharacter: 2/10\\n\r\nHere's the characters so far:\\n\r\n• Harem lead former prince: Lux.\\n\r\n• Tsundere princess: Lisesharte.\\n\r\n• Deadpan childhood friend: Philphie.\\n\r\n• Flirty foreign student: Krulcifer.\\n\r\n• The proud man-hater: Celistia.\\n\r\n• The brocon little sister: Airi.\\n\r\n• Yandere assassin: Yoruka.\\n\\n\r\nI honestly don't give a damn about any of these characters.\\n\r\n• Lux is your standard harem lead who is blessed with an OP Drag-Ride.\\n\r\n• Lisesharte, because her tragic backstory arrives and is somewhat resolved too quickly that I couldn't feel bad for her. Then she falls for Lux and spends most of her screentime playing the clingy jealous girl.\\n\r\n• Philphie is your standard childhood friend who ends up being there just for the fanservice.\\n\r\n• The little sister because she spends her screentime doing nearly nothing.\\n\r\n• The rest of the girls for falling in love with Lux after goes all OP on the shows one-dimensional villains.\\n\\n\r\nEnjoyment: 2/10\\n\r\n\"So bad it's good.\" That's pretty much the best way to describe this. That, or I may be a masochist. The characters annoy me, the fanservice turns me off and overall the story bores me for being predictable and horribly cliché. The fights end up as how you'd expect; the MC shows up to save a member of his harem, turns the tables on his opponent and then absolutely wrecks them. Most of the fights are very anti-climatic because once Lux shows you up can expect the fight to end up pretty damn quickly (I'm still salty about the episode 12's final battle).\\n\\n\r\nTo elaborate more on the fanservice there's a particular scene near the end of the second episode where during a fight they elaborate more on Lisesharte's backstory where they show her in a particular position while I guy rips off the lower part of her uniform. Uh? Another fanservice scene that I did not enjoy was when some of the characters invited Lux into a room where they dressed up as maids for him.\\n\\n\r\nOverall: 3/10\\n\r\nUndefeated Bahamut Chronicle is your standard generic battle academy harem anime that uses concepts and ideas from other battle-harem shows without bringing in any fresh new ideas leaving it as an utterly forgettable anime. It's like watching a mix of Infinite Stratos and Asterisk War.\\n\\n\r\nTl;dr: It's a massive cliché storm. Please, just go watch something better.",
            "date": "2016-03-30T11:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 214815,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4791710.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/_Kairu_",
                "username": "_Kairu_"
            },
            "url": "https://myanimelist.net/reviews.php?id=214815"
        },
        {
            "content": "So okay..first, i'm just a sucker for these kinds of anime, i don't know why but i just like these types of cliches, you know.. you already seen bunch of animes that uses these typical settings : school, harem, magic, super power, mecha etc.\r\nMaybe i'm just watching them for cliche's sake. or just damn bored.\r\nStory : 6/10\r\nI don't really care much about the main characters and his girls.. i only cared about the backstory of the villains. (might be more interesting than the main character's)\r\nThe story itself progressed fine, not bad but not good either. Some moments were rushed and it kinda felt awkward. thestory might give you a damn good DEJA VU if you watched Infinite Stratos. Same setting, same harem. (Only guy that could use the device, transferred to a girls-only school)\\n\\n\r\nArt: 7\\n\r\nIt was decent, i admit the art was good, but kinda meh when they used 3D Animations, it  was at such a low fps that i wanna laugh when seeing it.\\n\\n\r\nSound: 5\\n\r\nI couldn't complain about the backsound but... i skipped OP and ED the whole season.\\n\\n\r\nCharacter: 5\\n\r\nDamn...you could meet these type of characters everywhere. EVERYWHERE.\\n\r\nYou name it. Tsundere, Kuudere. Aggresive girl, Anti-boy girl, Sadistic girl\\n\\n\r\nEnjoyment: 7\\n\r\nThis was kinda enjoyable, but still very predictable, i swear i watched these kinds of animes and they are damn similar.\\n\\n\r\nOverall: 7\\n\r\n3D Animation was bad, i only continued watching hoping to find out about the backstory of the villains, sadly i was not. considering this anime was rated roughly 6. I don't think they would make the 2nd season of it.\\n\\n\r\nIf you're just a sucker for these mainstream harem stuffs, just watch it. it's good\\n\r\nIf you have little time to watch, just watch something else.\\n\\n\r\nThis is my first review, and that's all i have to say...\\n",
            "date": "2017-11-22T03:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 263744,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4480125.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GratoNite",
                "username": "GratoNite"
            },
            "url": "https://myanimelist.net/reviews.php?id=263744"
        },
        {
            "content": "Plot twists by nature are meant to shake up a viewer by going in an unexpected direction at a critical moment. They can't do their job if the viewer starts expecting them because they keep appearing at almost Every critical moment.\r\nThe usual plot expectation of any random ecchi harem is fairly low but in this case easily skyrockets early on when it becomes clear there are in fact numerous opposing factions at work and many events take sharp turns you don't see coming. Characters that seem harmless but odd gradually start showing their true colors, the recent history of the world is explained and exposedbit by bit, overall it amounts to a rather high paced and well planned web of tangled intentions and complex connections. Even in the midst of this there are many moments of really good comedy that should make most people burst into laughter, without detracting from the seriousness of the sinister forces lurking in the shadows. If only the english was even a single percent as good instead of painfully embarrassing... this is unfortunately one of those many animes where you'd wish they would never use a single english word but they are constantly thrown in at random because they \"sound cool\" or something.\\n\\n\r\nSadly things eventually start to break down in a really bad way, all those intricate conspiracies and mysterious personalities are steadily unraveled and turn out to be largely pointless theatrics hiding a gruesome flaw in the characters: their core motivations can in almost every single case be summed up with a few words and they are horribly dumb. It's easy to get why Lux is driven by the single thought that he doesn't want people to suffer, but why would someone literally strive to be a hated tyrant just for the sake of being a hated tyrant? The longer this mess goes on the more shallow and idiotic their goals become, made even worse by constantly throwing in new characters just to have enough opponents to keep Lux busy.\\n\\n\r\nI'd rate the first half of the season a strong 8 and the rest a weak 6 entirely because of characters and story. The art and sound are generally wonderful except for how overly feminine Lux's voice happens to be, it's often completely obvious that it's not working well. The opening is one of the worst to ever torment my ears but didn't factor into my review (openings and endings have nothing to do with the real content and quality of any anime, some would disagree but I stand firm and refuse to have them influence the rating) just a heads up to save your ears and sanity.",
            "date": "2017-10-22T21:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 261466,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6311485.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BriefEd",
                "username": "BriefEd"
            },
            "url": "https://myanimelist.net/reviews.php?id=261466"
        },
        {
            "content": "An anime with much more potential, but not enough episodes...\r\nStory: 7 \r\nThe story is actually really strong!!! You can make a really big succesful anime serie with a pretty large amount of episodes (30-40). What did they do? They put it all in 12 episodes, which is a real shame. It could have been way more extensive than it is now. \r\nArt: 10\r\nGood art!! Well done!!! Characters and environment looked really good. \r\nSound: 9 \r\nThe effects of the shooting were pretty cool, never heard them before lol.\r\nCharacter: 7\r\nFor the characters goes the same. They could have been worked out much better! They have such interestingpast and stories I want to know more!!! \\n\\n\r\nEnjoyment: 6 + 1 = 7\\n\r\nI did actually enjoy the series, but on the other hand i didn't because it was going too fast and undetailed for me. That made it around a 6 to me, but it did have a little bit of fanservice, some romance and dunny moments sow i give it a bonuspoint :P.\\n\\n\r\nOverall: 7",
            "date": "2016-11-08T13:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 233448,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5667028.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CADAEMOS",
                "username": "CADAEMOS"
            },
            "url": "https://myanimelist.net/reviews.php?id=233448"
        },
        {
            "content": "Overall this anime was a 7.\r\nIt's an anime, anime is entertainment, and watching it was entertaining and enjoyable, so it's a 7.\r\nSpoilers:\r\nStory: 7\r\nOther then the extremely close resemblance with Infinite Stratos the story is about a prince that helps overthrow his country to save it, since it is corrupt. Up to that part, it's pretty nice, and even seems to deserve an 8, however, once you throw in the lack of explanations for the \"ruins\" and \"drag-rides\" it lowers it to a 7. All in all, it wasn't bad, but it wasn't great.\r\nArt: 7\r\nDecent art, pretty much average / standard for a 2016 anime, nottoo much annoying - mob CGI and the characters all look decent. Background was alright.\\n\\n\r\nSound: 6\\n\r\nFor a 12 episode half-season anime, it had decent sound. The op starts out pretty terribly but it works, but the very, very incorrect english (grammatically not pronouciation) really irritates me since half of what is said, honestly is more of a mix of \"cool\" words rather then anything coherent. The action/battle ost is kind of overused, but since it only has 12 episodes, you can't expect too many ost's.\\n\\n\r\nCharacter: 5\\n\r\nGood main character, lots of depth, too many extra female main characters that are explained half-way. Almost all the characters are girls, and most of them have breasts bigger then their heads. It's not bad enough to be a whore-fest but liking a character other then the mc is difficult.\\n\\n\r\nEnjoyment: 7\\n\r\nWorth watching, especially if you want new content. For people like me that re-watches anime a lot, it all depends on whether you liked it or not. Personally, I will probably re-watch this anime, especially if it gets a second season.\\n\\n\r\nAnime is entertainment, if it entertains a lot of people, it's a good anime. Nobody cares if the story is a 10 or a 0 as long as its entertaining.",
            "date": "2016-09-06T20:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 228474,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5488856.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Inorichi",
                "username": "Inorichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=228474"
        },
        {
            "content": "At first, I had the impression that this anime was shit but i had to finish it. It did start off a bit bad but when the story goes a bit farther it can actually give u a nice impression. The reviews i've seen here are mostly the ones who didn't even try to finish it. This anime actually points out the action more often and has less of the Harem while the anime being ecchi, it was merely just a few scenes.\r\nI find the other characters annoying honestly like there are those girls who try to hard to get attention from a guy whichbasically describes the princess (I'm not good at remembering names) while she also acts too innocent around him. The main character is like not that typical boy in an Ecchi/Harem Anime who easily gets a nosebleed or like blushes.\\n\\n\r\nThis also has some sense of humor to it which i think is great. So overall, i'd give it a 7 since there are those scenes which are irrelevant to the story.",
            "date": "2016-05-01T01:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 217584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5212902.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KawaiixGhoul",
                "username": "KawaiixGhoul"
            },
            "url": "https://myanimelist.net/reviews.php?id=217584"
        },
        {
            "content": "Honestly I only started watching this because it seemed like Infinite Stratos... guy gets stuck at a school with all girls and it turns into a harem anime.  As much as i'd say that's uninjoyable, for me that part was fine.  It was done alright with great voice actor good character animation but the big thing that set me off about the series was that It was hard to understand.  It took major plot points and kind of sanded them down.  And the entire thing kind of just gives me a headache.  I had to pause in certain parts toanalyze what was going on.  Now that might work for some people but i'd rather the show give enough hints that I can figure it out during downtime of the show.  (SPOILER WARNING)\\n\\n\r\nNow you might be thinking,\"what does he mean by hard to understand, i get the plot points i get it\"  I guess you have somewhat of a point.  I might be a little bit slow when it comes down to it but here's a couple questions that kind of break down the story for me.  Why is his sister never in the flashbacks, does the sister remember their older brother.  Why was phi used as an experiment if her family was like nobles.  Also halfway through the season they just decide to bring up another government and an entire thing on spies that seems totally irreverent.  And why is it called the old age if they had what seems like better technology than what the people in the story have now.\\n\\n\r\nNext thing it sanded down major plot points.  Now i did say spoilers before but most people down pay attention to it anyways.  The biggest plot point so far was that his childhood friend phi is actually dead.  She dies in an experiment five years ago where they were testing experimental human weapons.  Now this is a major development that they literally graissed over.  Now the problem is its well done at the same time its horrible.  Its like they had a writer conflict.  What should we do make the person feel bad for phi because she was just a nice cute girl who wanted the best for everyone and have her brutally tortured and killed made worse by the flashbacks of her being loving and caring or should we focus on the fact she is controlled by a Ragnarok seed.  I don't know lets try both.  Honestly the fact that they took a helpless girl like that and made her story sad instantly made my hands lifeless.  It's one of those scenes that just makes you think why did someone write this.  Its just painful to listen and to watch.  Kind of like the rape scene from Mirai Nikki.  Anyways the plot point has impact just not as much as it deserves.  At least they didn't put her in that lingere during the scene where she's in bed that would've killed the entire series and i would stop there.\\n\\n\r\nClosing Statement - I came here to watch harem but I got a good story that was badly delivered and i'm question some of the choices like changing from harem to large plot point back to harem.  It takes me out of the mood completely and its god damn annoying.  Anyways its worth a watch if you have some free time.  If you just take a look at the not harem stuff and only that its a pretty solid watch.\\n\\n\r\nEdit - So many plot points so little time.\\n",
            "date": "2018-03-24T19:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 274906,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7068457.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GiB_69",
                "username": "GiB_69"
            },
            "url": "https://myanimelist.net/reviews.php?id=274906"
        },
        {
            "content": "Story: so basically the story is about this guy was chasing a cat or somthing like that he crashes throught the ceiling and than sees a girl naked she challenges him 2 a duel (wont spoil the rest of how it starts)\r\nArt: pretty good art nothing really else to say\r\nSound: again was pretty good\r\nCharacters: now the characters were damn good too me NO ONE annoyed me or anything just good characters \r\nEnjoyment: i did this anime like a month or 2 months ago but from what i remember the anime was freaking funny also the ecchi is really there and add a harem too itwhich i loved just a very good anime\\n\\n\r\nOverall: this is a anime id so recommend for a lot of reason the characters, the ecchi, and also the great comedy and harem to it aswell",
            "date": "2016-08-09T16:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 226346,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=226346"
        },
        {
            "content": "So basically and shortly, there is no.. GODDAMN... STORY! Offcourse there is but like segments that at the end you will be suprised if you even understand it... \r\nI dont mean it like its not good but this anime has poorly based story.\r\n Its not the worst but... its not... well you have to watch it. But still I have a weird feeling this anime satisfied me. Why? Idk... Mainly because of genre: harem, ecchi, mecha... even tho this is for not so perverted guys (occasionally girls). I feel abou this as if Rakudai Kishi no Cavalry and Trinity Seven had a baby. *Spoiler alert*battles in (so called) Drag-Rides are horrible. And also Phi is best girl, Airi is the cutest... ( ͡° ͜ʖ ͡°)\\n\r\nEven tho its not state of the art in any way, I would like to see 2. season or some OVAs.",
            "date": "2017-01-21T18:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 238795,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5713235.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Ivaaan",
                "username": "Ivaaan"
            },
            "url": "https://myanimelist.net/reviews.php?id=238795"
        },
        {
            "content": "Avoid this one. Nothing about Saijaku Muhai no Bahamut provides the series with any sort of staying power.\r\nUncompelling characters combined with a lackluster plot provide the viewer with nothing but disappointment. \r\nEven the harem portions of the show were incredibly uninteresting. This can probably be attritubed mostly to bad writing. What wasn't ruined by the atrocious writing was ruined by the uninteresting supporting cast. The bevy of female supporting characters in this show were a massive collection of annoyances.  The only slightly redeeming aspect of this show are the average, at best animations. Even this was nothing particularly special however. \r\nIn no way amI a super picky viewer who will drop something if it doesn't blow me away. I do, however, expect a certain baseline to be met. If a show is going to delve into the oft-explored depths of the harem-action-fantasy-school genre, it needs to be able to compete with it's plethora of competitors. This, unfortunately, usually appears in the form of fan service, but occasionally appears in the form of intriguing plot. Saijaku Mutai no Bahamut, unfortunately, largely fails in both regards. \\n\\n\r\nI personally found the \"development\" of the main character to be particularly disappointing. I believe this stemmed from the show's crisis of feeling. It was too busy trying to be a light hearted harem anime, and the potential for the main characters dark past being brought to light, and his ultimate redemtion being achieved, was completely squandered. So much wasted potential from this show's plot completely saddened me.  \\n\\n\r\nUltimately, viewers usually judge the watchability of a show by it's enjoyment. This is usually hard to quantify, and is largely affected by an individuals personal preference as opposed to anything concrete. I suppose you could call this the eye test. This show completely fails in this regard, and is very lackluster.\\n\\n\r\nDo yourselves a favor and skip this show.",
            "date": "2016-06-29T14:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 222366,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5228052.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/watylicious",
                "username": "watylicious"
            },
            "url": "https://myanimelist.net/reviews.php?id=222366"
        },
        {
            "content": "Despite being another generic harem I actually enjoyed it, but not because I just did, I thought for a while and realized some things.\r\nStory\r\nJust like any other Mecha-harem-ecchi anime , It's just another boy who ends up meeting some girls and then he gets a harem,  yeah there's nothing really speacial about the stor, what I do appriciate though is that they didn't focus more on fanservice and I what I mean is the typical things that you see in a Harem anime\r\nInstead they focus on the MC's relationship with each girls however that's it, on top of that there are just things thatI can't understand characters that appear out of nowhere and the final parts of the story is mainly rushed.\\n\\n\r\nCharacters\\n\r\nfor the characaters though there's not really much to say about them, what I do like though Is that every girl has a good chemistry with our MC lux, however what I don't like though that the girls we're introduced strong and they are, if they are with Lux they appear to be weak as they rely heavily on him.\\n\\n\r\nOn the other hand I do like the character of Lux, yeah sure he's like ICHIKA from Infinite stratos, but hey the thing is he didn't get the girl's affection for nothing.\\n\r\npersonally I think he actually earned it, for he actually did something that win the girl's heart, ( i won't tell that much because of spoilers), on top of that I like that he doesn't rely on his power that much, yeah he's got the bahamut a really powerful weapon or armor but still he thinks before he makes his own move, not to mention i like his design and his motive\\n\\n\r\nand lastly the villains are just there as they are pretty dull.\\n\\n\r\nSound and Animation\\n\r\nthe sound is pretty much okay though I enjoyed the opening, the art though I really like it, I like everyone's designs my personal favorite is Lisha and Celes (my waifu in this series) and the battle scenes were nicely done, the despite the less fan service It's enough to make fans excited lol.\\n\\n\r\nEnjoyment and Overall\\n\r\n All I can say Is I enjoyed it except for the end though where It felt rushed , and would I recommend it I guess, It's not really the best mecha harem anime but It's not the worst, at least they really tried to explain everything at least that's what I thought.",
            "date": "2017-09-14T23:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 257550,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949977.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MetalTsundere",
                "username": "MetalTsundere"
            },
            "url": "https://myanimelist.net/reviews.php?id=257550"
        },
        {
            "content": "Continuing I finish those last 11 episodes of the winter season: Saijaku Muhai no Bahamut. \r\nStory: I won't hate it completely because it was a few months between me watching episode 1 and 2. I had no clue what was going on. I had no clue what the bad guy was trying to do. Kill Lux? Destroy the world? Take over the country? I've never read the LNs but apparently a lot of content was skipped. The story was poorly explained.\r\nCharacter: This show is a harem so 95% of the characters will be female. I hate none of them. In fact they are all wonderful.\\n\r\nStereotypical god MC who every girl loves: Lux\\n\r\nTsundere: Liseharte\\n\r\nChildhood friend: Philphie\\n\r\nBest girl: Krulcifer\\n\r\nLarge breasts and second best girl: Celestia \\n\r\nAss and only 3 episodes: Yoruka\\n\r\nSister: Airi\\n\r\nAnd because it's a girls only school: Attractive Girls\\n\r\nThey are generic but so wonderful at the same time. The only problem is the show is 12 episodes long and the main girl, Liseharte, barely gets screentime. \\n\\n\r\nArt and Sound: At first the I didn't enjoy the OP but it did grow on me over time. The ED is so happy. It's really upbeat. Soundtrack not really worth noting other than one song. \\n\r\nVoice acting was good. \\n\r\nThe CGI for the Drag-Rides appeared good. I don't watch much shows with CGI so I can't really judge. It didn't appear out of place. \\n\\n\r\nEnjoyment: Yes. I did enjoy this. You don't need to think super hard to watch it. Not every show needs to be an Evangelion. I enjoy ecchi and I enjoy harems so I will enjoy this show. If you enjoy those watch this. If you don't avoid it. \\n\\n\r\nOverall: Saijaku is not terrible nor is it the best thing to air in the winter. If you don't enjoy harems just avoid it.",
            "date": "2016-05-15T09:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 218603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/IKnowBestu",
                "username": "IKnowBestu"
            },
            "url": "https://myanimelist.net/reviews.php?id=218603"
        },
        {
            "content": "Well I went with an overall of 7/10 or \"Good\" for this anime but the scale could have easily fallen to the 6/10 or \"fair\" side, I 'm the kinda person that depends on first impressions and chooses a book because I love the cover. \r\nThis anime has got some awesome art and that's about all that I found to be great about the anime, I'm Not trying to randomly hate, I am just pretty sure that this anime could have been a lot better than what it is.\r\nI'm gonna try and keep this as short as possible making sure you under stand exactly whyi think this anime deserves being in between \"good\" and just \"fair\".\\n\\n\r\nstory \\n\\n\r\nWell, the plot is their but the story doesn't do a good job in showing you the details, even half way through the anime, understanding what exactly the enemy wants or or why their doing what they do is impossible to figure out.\\n\\n\r\nA few flashbacks here and their, most of the time they are very vague and dont cover much of the real stuff you want to know about the direction of the anime, I think the protagonist is supposed to be a sort of tragic hero but how that am not sure exactly how such responsibility fell onto him and not his brother.\\n\\n\r\nArt\\n\\n\r\nLike i said in the intro, the best part about this anime for me was the art, the smooth anime, well drawn characters and super vivid colors that are gonna melt your eyes.\\n\\n\r\nsome of the female characters have unrealistically gigantic boobs. so it for someone who like that kinda thing, then this is your anime but I can't really call this is fan service.\\n\\n\r\nCharacter\\n\\n\r\nWell, for starters, the main character is not the kinda protagonist everybody is gonna love, He's back story wont exactly make you understand him and that goes for most of the characters in this anime.\\n\\n\r\nTheir are parts where its clear that your supposed to sympathize with the characters but because of how much the anime is gonna give you, getting the viewer emotional is just impossible.\\n\\n\r\nSound\\n\\n\r\nNot gonna say much because its very rare for anime to mess up this part, you wont be disappointed, Oh! wait the soundtrack, this might be just more of a matter of preference but I absolutely did not like the soundtracks.\\n\\n\r\nI like it when the music helps me get the mood of the scene, the soundtracks used in this anime didn't make it for me.\\n\\n\r\nEnjoyment\\n\\n\r\nJust like the overall score, Am giving it a \"bare pass\" 7/10, the anime could have been better but I cant say that it wasn't fun to watch , their are some awesome fight scenes and a few characters in here that might catch your attention and I think that how anime should be.\\n\\n\r\nThe anime is not a must watch, but also its not a not watch, in my point of view its just another anime with a lot of cliche characters and that in it self is not a bad thing, so If you haven't started watching it then I think you better stop reading the reviews and just watch it.\\n\r\n Reply       My Messages",
            "date": "2016-03-30T12:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 214819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4957104.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mcrider",
                "username": "mcrider"
            },
            "url": "https://myanimelist.net/reviews.php?id=214819"
        },
        {
            "content": "HELLO GENERIC SUPERNATURAL MAIN PROTAGONIST WHO'S OP GOING TO AN ALL GIRLS SCHOOL 98#. \r\nSo think Infinite Stratos only better as there are ACTUAL threats in this one! Although there are some typical cliches from this kind of series, there are some difference that makes this anime slightly tolerable. For instance how about the main haremettes are developed enough they get their own episodic arcs with villains and threats that leads into a bigger bad connected to Lux?, good animated battles with mech suits vs. mech suits AS WELL as mutant dragons and finally a decent bigger bad main villain throughout the anime planning behindthe curtains of the anime (though he's terribly \"evil for evil sake\" cliched).\\n\\n\r\nLA won't lie, when LA first saw this anime's first episode, LA saw it as typical genericism with the elements LA mocked at the start of this review however as LA carried on watching it, it did get slightly better with the harem growth (along with the main protagonist at that) and plot wise. \\n\\n\r\nLA's favourite character throughout the anime was Krulcifer Einfolk voiced by ''Yukiyo Fujii'' and once her arc started LA at least got excited and was satisfied with her arc (and not to mention that arc didn't fall under the typical cliches). This anime does follow multiple plotlines from the harem antics aka. haremette arcs, the political dealings between it's two warring countries and the threat of dragons attacking and they do balance it in some modest way, LA won't say they balance all these perfectly but still, it's enough so that those plotlines doesn't intervene and distract with one another and more blend together to make a more cohesive narrative.\\n\\n\r\nYes unfortunately the fanservice is there and it is somewhat annoying especially the haremette and childhood friend of Lux, Philphie Aingram voiced by ''Yuriko Kubo'' but other than that, it's \"modest\" in terms of fanservice levels. \\n\\n\r\nThe animation by Lerche, is decent enough with slick character designs to even the mech suits looking pretty distinct from each of the main cast members, the battle scenes are animated decently enough for LA to get invested in, though this anime's battle scenes has a habit to blatantly change into segmented CGI just on the characters face along with both CGI animation and traditional animation on the mech's thus is blatant enough to get slightly distracting.\\n\\n\r\nIn terms of voice acting, as much as LA's favourite character was Krulcifer Einfolk and ''Yukiyo Fujii'' still did a fantastic job for what material she had, LA's favourite voice actor on the other hand goes to ''Shizuka Ishigami'' as our wild-card harem member who voiced Yoruka Kirihime and her character starts to appear in Episode 11!...yeah Shizuka Ishigami's voice work actually gave LA enough of an impression of Yoruka for TWO EPISODES and was satisfied by even that.\\n\\n\r\n The ending did once again didn't fall under certain tropes of this anime genre, because of that LA will praise it at least that the battle harem members DO get something to do for this final battle and not just have Lux one-hit kill everything, however as much as LA praise this ending, it still falls under some battle harem tropes at the same time but LA won't explain as it goes into spoiler territory but LA just wished the final scenes of this anime didn't end so cliched as it had something good going but then threw that intense, plot-driven and character-invested ending away by the last second. \\n\\n\r\nUndefeated Bahamut Chronicle for LA, it is your typical anime you've seen in coming out recently, the \"GENERIC SUPERNATURAL MAIN PROTAGONIST WHO'S OP GOING TO AN ALL GIRLS SCHOOL\" LA mockingly said at the start of this review, however LA will say that as cliche as it is, it does handle some of it's plot and character elements better than it's anime cliched genre counterparts, such as a haremette-centred focus that simultaneously develops both the haremette in question as well as the main protagonist, good animated battles as well as major villain that actually means and changes something to the plot and characters.\\n\\n\r\nAt best LA will say that Saijaku Muhai no Bahamut is competent and modest but that's the best praise LA will give it, it still has some flaws and cliches hanging here and there to bring back it's typical genericism to it's anime genre from the beginning to later on the very last seconds of the anime. Want a better version of Infinite Stratos with actual risks and stakes instead of the plot or characters just loafing around, then come mech-suit up with Saijaku Muhai no Bahamut!...but even then it's not \"much\" of a step up. But still a step up is better than any steps down right?",
            "date": "2016-03-29T03:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 214650,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=214650"
        }
    ],
    [
        {
            "content": "This anime is a ecchi, action, harem and school genre, all these genres together result in an anime style that usually do not please the audience, that's the big problem here. When you first see this anime you may think \"Yeah, this is the kind of cliche anime that every anime season has\", but in my opinion you are wrong if you thought that, personally I was wrong too, I admit, I thought it was the same cliche of always, but it ended up being an anime way more interesting.\r\nThe story takes place in a fictionary world, where there are ancient weapons, named Drag-Ride thatare ancient mechanical weapons. Five years ago, the protagonist, named Lux Arcadia, was the prince of the Empire, and he also was known as the strongest Drag-Knight, the Empire was destroyed due to a revolt, now Lux is known as the \"Weakest Undefeated\", the Drag-Knight who doesn't attack. Due to some reasons Lux ends up entering a girl's school that raises Drag-Knights.\\n\\n\r\nThis is the story, not bad thought, if it was a little more serious I think it could've been an anime that would please more audience than this, one problem is how ridiculous things end up happening and how all the girls want so bad the protagonist, but if you think about it, it's very common in the harem anime genres, not saying that it explains why, I think if a harem is built in the correct way it can be good, sadly it wasn't the case.\\n\\n\r\nThe art of the anime has many 3D aspects, which may be a little unpleasant for some people, some parts I think the art was very strange and bad, but nothing that displeased me so much, the art was most part of the time OK, the fighting scenes were all OK too.\\n\\n\r\nAbout the sound, I can't really say if it was good or bad, it didn't caught my attention enough to make an opinion, so I will just say it's OK too, I also liked the OP, it gets in your head, the ED was also very good, singed by the group nano.RIPE that I personally like very much.\\n\\n\r\nIf I have to say something about the characters is that, yes they are cliche, there are all of the types of girls that almost every harem anime has, but that is almost a standard of harem animes. So I really think that the characters are not bad at all, I liked even some of the supporting characters, maybe more than some main characters, lol. They all have some interesting story about their pasts, and their personalities and ways of acting didn't displeased me at all.\\n\\n\r\nIf I have to choose if I enjoyed it or not, I would really say I enjoyed, the beggining may not catch your attention, even I thought about dropping it in the beggining, but I don't regret not dropping it, if it gets a second season in the future I will watch, if you dropped and are reading this, I advise you to give it another chance, you may end up liking it, just like me.\\n",
            "date": "2016-03-30T07:05:00+00:00",
            "helpful_count": 83,
            "mal_id": 214789,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4411401.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MiRaD",
                "username": "MiRaD"
            },
            "url": "https://myanimelist.net/reviews.php?id=214789"
        },
        {
            "content": "I started this show back when it first started airing, because I was bored. I've seen most of the big name harem and ecchi series, and figured \"I may as well try this.\". Mecha isn't really my thing, but the fact that this series is a Mecha isn't even what makes it bad. There may be light spoilers in here, but honestly, this show doesn't even have much of a story to begin with, and I can only imagine one thing that could be spoiled, and it really isn't even that major.\r\nStory: 2 \r\n     This series really had no overall story.It just had mini-arcs that comprised the whole thing, and then one antagonist that wasn't really explained well at all. The series starts off with the protagonist conveniently falling into a girl's bath. And whadaya know, it's the most important girl in the kingdom! He then has to fight her for some reason to gain entry into a girl's only school to learn how to use his mech. Lets not forget that he is the biggest badass in the kingdom, and singlehandedly overthrew a regime, literally a legend among people. For reasons unknown he has to go to school.\\n\r\n     Naturally, their fight gets interrupted, queue the \"evil\" in the show: the Abyss. They really aren't explained very well either. In the beginning, they seem to have their own free will, since they have no tactics whatsoever, yet later on in the show they exist solely to be used by people who have certain flutes. And there are multiple flutes, which makes it quite easy for people to control them (somehow). Every time one type of enemy gets stale, they get an upgrade, From normal Abyss, to big scary Abyss, to Giant ass fortress.\\n\\n\r\n     Also of note, for reasons unknown, I can count on one hand the number of males who could use a \"Drag-Ride\". Why is it only females? Why is it a female only school? How do the few guys that do know how to use a Drag-Ride learn in the first place when even Lux was given such a negative reaction upon trying to get into the only school ever talked about in the entire show?\\n\\n\r\nArt: 7\\n\r\n     I'm no art critic, but I liked the way it looked. It wasn't as good as Phantom World by any stretch, but it was fluid, and looked nice. \\n\\n\r\nSound: 7\\n\r\n     The OP is bad. Starts off like it's going to be really intense, then drops into a random electro-pop conglomeration with poorly translated english words thrown in for flavor, like \"fight for the sky!\". ED is decent, but generic. The Sound effects however are where this show really shines. Every time a character pulls their sword out, my ears have a mini orgasm, and explosions are nice and crisp. A female voices Lux, but honestly, that didn't make the slightest difference to me. In fact, I wouldn't have even noticed if I hadn't read it in another review a while back. Other voice actors are alright, nothing stood out as exceptionally good, or exceptionally bad, so I can't complain.\\n\\n\r\nCharacter: 1\\n\r\n     This show has the worst character cast that I have ever seen. Boring main character, generic tropes for every girl in his harem, etc. \\n\r\n        Lux: Main character, has no backbone except to \"Protect his friends\", never goes on the offensive. His nickname because of this is the \"Weakest Undefeated\". Is completely clueless about how girls work, and even when he has opportunities right in front of him, he drops them. He lacks confidence in anything but his goal to protect his friends, which makes him lose so many opportunities. He could have been laid many times throughout the season, by any of the people in his harem, yet instead he gets a total of 3 kisses, which aren't dramatic at all, and very anti-climatic, since he freaks out after each one.\\n\r\n        Airi: Lux's little sister, because what show would be complete if the main character didn't have a sister that rarely does anything except push him forward in his determination? Has barely any screen time, manages to be condescending in spite of this. \\n\r\n        Lisesharte: The princess that he falls into the bathtub with. tsundere, quickly goes full dere in less than a full episode, and then just manages to push herself away from him due to her own stupid decisions, because you can't have a relationship in a harem.\\n\r\n        Philphie: the kuudere childhood friend. Eyecandy is pretty much her sole purpose in the show, barely even an interest in his harem. She's too apathetic to care if Lux goes for her or anyone else.\\n\r\n        Krulcifer: The only good character in the show. She is the only one you can't always predict, and that is the only redeeming factor characterwise. Still not enough to pull the rating upto a 2.\\n\\n\r\n     Those are the only characters I even know the name of. There is a great deal more of them, and none of them are really of any consequence. A brown haired chick that serves no purpose other than pushing the members of his harem closer to him. A black haired girl who is emotionless. I know I'm forgetting characters, but clearly they weren't important enough to remember anyways. Most of them serve a single purpose as a plot device, and the only characters you get a backstory for are Krulcifer and Philpie. \\n\\n\r\nEnjoyment: 5\\n\r\n     This show was one of those where you watch it, in full knowledge of exactly everything that is going to happen before it actually does. It is nothing if not predictable. \\n\\n\r\nOverall: 5\\n\r\n     Unless you're trying to get someone introduced to all of the common harem-genre antics, I would not recommend this show to anyone. I was quite looking forward to just getting it over with at the end. I could recommend many other shows that do harem better than this, and even Infinite:Stratos did harem better than this. It's no good as an ecchi, since the only ecchi is a bath scene at the very beginning, a 5 second scene in the second episode, one back massage with Celes and then Phi's boobs constitute the rest of the ecchi throughout the rest of the show. It's not good as an action, because there is too much drama involved with personal relationships. \\n\\n\r\nTL;DR Avoid this show unless you are out of any other show you could possibly think of, or if you are introducing your friends to the nuances of weak-character harems. \\n",
            "date": "2016-03-29T03:56:00+00:00",
            "helpful_count": 31,
            "mal_id": 214651,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5025521.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/totesnotaweeb",
                "username": "totesnotaweeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=214651"
        },
        {
            "content": "Sorry if I used wrong words or some grammar errors, that's because English isn't my primary language.\r\nOk, here is the review :\r\nWhen I see this for the first time, I was thinking about Asterisk and Failed Knight because they have a similar intro, but I don't really mind it. But after completed this anime, I was very disappointed. Many things came up and make this anime more worse, fot example the last battle was good actually, but some things came and almost make me stopped watching fot a while, but I finally managed to watch it until end. \r\nFor the story, it's bad. It's reallybad. I can't tell how bad it was by word. Our mc, have a divine drag ride and supposed to be a strong character, in the last battle I think he would use all of his power, but no. His power were useless, well not completely useless but it's useless. That's same with other characters, nobody used their power to the max, that's make me it worse. Beside, the story is pretty hard to understand but I don't really paying attention into it.\\n\\n\r\nIntro and ending were good, the songs were nice, it also easy to remember. The voice act is awesome, I like it. The sound effect is great,  No complaint from me, but overall I don't really like it because some background songs weren't fit with the show. But that's okay, I don't mind it.\\n\\n\r\nOverall it's an average show for me, because it have bad side and good side. I recommend this to you if you here only for the harem genre (it's not contain alot of ecchi). But if you looking for a good battle or something other than harem, you wouldn't be like this. The ending is a cliffhanger (this is an announcement, I won't tell you why did I wrote it) and I think it would be good if this has a second season.",
            "date": "2016-03-29T08:33:00+00:00",
            "helpful_count": 24,
            "mal_id": 214670,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4802833.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ZinxSter",
                "username": "ZinxSter"
            },
            "url": "https://myanimelist.net/reviews.php?id=214670"
        },
        {
            "content": "I really don't understand the appeal of this, it's good for people who've never seen a mech/harem/action/romance/ecchi anime in their lifetime, but otherwise I can't see it. It's just a cesspool of horrible tropes mixed into a fuckfest of bad characters and predictable storylines. Anytime you feel like it might be good, it just falls flat on it's face with disappointment. \r\nThe entire show is just a massive cop out. I can't find a single interesting thing in this anime that hasn't been borrowed from something else. The main character's backstory was interesting until you get ever so slightly into it and realize it's boringas shit. The voice acting isn't necessarily bad, but it's nothing to write home about. The character and mech designs are pretty bad as well, they're all bland rip offs of other mediocre characters. Each one has an equally bland back story that you can immediately see in the first 3 seconds of their dialouge. For some reason, they can never have a fight without some dumbass monster interrupting and forcing them to work together, which is yet another cop out. Even the fights with the things that interrupt are cop outs.\\n\\n\r\nThey usually happen in exactly this way: \\n\r\n\"Lets fight this person and/or monster.\" \\n\r\n\"We can't win!\" \\n\r\n\"Oh no! I am being forced to use my super powerful mech robot!\" \\n\r\n\"Reload on fire!\" \\n\r\n Done.\\n\\n\r\nThat's how it works. Nothing new. Nothing interesting. Imagine everything you hated about Infinite Stratos and Sword Art Online forced into existence by some shitty writers and mediocre artists. That's all this is.\\n\\n\r\n(P.S In case your wondering, it's not even so bad it's good, it's in the middle area where you can see even the slightest amount of effort was put in, but just enough so that it's presentable, nothing else.)",
            "date": "2016-03-02T03:09:00+00:00",
            "helpful_count": 10,
            "mal_id": 212086,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5234374.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Seba_Onyx",
                "username": "Seba_Onyx"
            },
            "url": "https://myanimelist.net/reviews.php?id=212086"
        },
        {
            "content": "This is the 1st anime that a friend has shown me to watch so that I can join their conversations and not be that silent kid sitting in the corner of the table at lunch. As this was the first show I watched since Pokemon more than 5 years ago, I did not know what to expect.\r\nNow that I have watched it, I can safely say that this is extremely disappointing and bad. Not only is the story near non-existent and bad, the concept itself is terrible. Having machineries in a medieval setting is certainly unique, the 3d animation and the design of the machinesthemselves do not fit the time period that which the story takes place in. Action scenes feel a little bit awkward given the weird blend of 3d animation on the machines in a 2d environment. It also baffles me that the entire student body in the school are all girls with the exception of the main character. \\n\\n\r\nThe characters annoy me to no end. The main character's only traits is that he is a super kind guy who is also strong at fighting and has a dark past. He has no other personality outside of that and comes across as completely boring. His lack of backbone and naive nature also pisses me off.\\n\\n\r\nThe other characters are terrible as well, to the point that I don't even bother to remember their names. In fact, the only memorable things about them is that they all have ridiculously hard names to pronounce. The yellow-haired girl who I assume is the heroine is a terrible character. I can't even take her seriously given how outright absurd and stupid the first encounter she has with the MC is and the only personality she has is that she obviously likes the MC for no reason other than I think is that he is a super nice guy. The only other character who I find a tad bit interesting is the blue-haired girl given her background and the couple of episodes that focused on her was a bit interesting I guess. The rest of the characters are completely forgettable and has no large impact to the show.\\n\\n\r\nOverall, this show is terrible, and felt like a complete waste of time. This is the opinion of someone who's experience with anime are only in Pokemon and Digimon, so my opinion might not be as important or highly regarded compared to a person who has watched more anime.\\n",
            "date": "2016-04-10T12:06:00+00:00",
            "helpful_count": 9,
            "mal_id": 216042,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5159270.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/CluelessPotato",
                "username": "CluelessPotato"
            },
            "url": "https://myanimelist.net/reviews.php?id=216042"
        },
        {
            "content": "Fans of the typical action-based harem show rejoice, here is yet another entry that follows the script to the letter. See princess naked in first episode? Check. Have princess challenge and lose a duel to the protagonist? Check. Have princess give up on retribution afterwards and pledge fealty to the protagonist? Check? All in the two episodes? Check.\r\nBahamut is a mech-based, semi-fantasy action-based harem that follows closely in the footsteps of shows such as Gakusen Toshi Asterisk and Rakudai Kishi no Cavalry. The twist this time is that our protagonist is the disgraced prince of the former empire that was overthrown after oppressing its peopletoo far. To somehow atone for his family's past, Lux works as a handyman in the new empire, helping in whatever capacity others need. However, after the events in the first episode, he becomes the only male student in an otherwise female-only academy, and becomes one of the knights defending the school and empire. What enemies lurk in the distance beyond the empire, and what dangers lurk within the multitude of bijins in the school?\\n\\n\r\n[b]Animation:[/b]\\n\r\nBahamut is a well drawn show with a bright, relatively saturated color palette and a serene setting with a nice albeit blurry mountainous backdrop. There's a nifty blend in the setting between rustic buildings and scenery and ultra-modern technology such as the sword-mechs and holographic ear-pieces. Unfortunately, there is a ton of CGI usage with the mechs here and though it's relatively good quality, it's still distracting at times. The mechs themselves aren't anything that great, their appearance is probably most similar to those seen in Infinite Stratos. The generic mechs used by non-important characters look like they took their color scheme right off of the training mechs of Aldnoah Zero. Character styling is pretty good with a diverse looking cast and a good variety of clothing. There are occasionally some drawing inconsistencies (random clothing articles changing color within a scene) but overall things check out well here. If I were to find fault in something, the overly-obvious, crazed antagonist look makes things too, well, obvious.\\n\\n\r\nThis show has a fair amount of action with a lot of mech battles and a slight amount of blood. Antagonists take the form of either other mech pilots or occasionally weird dragon-like ancient creatures known as Abyss. Our protagonist wields two swords, which can each transform into a piloted mech. One is a wyvern, an average sacrificial mech. The other is Bahamut, which is essentially a Strike Freedom in Gundam terms. The first time our protagonist uses Bahamut can be likened to the first time Goku goes Super Saiyan, the entire world stops to marvel at what has happened; humorously future summonings have no such effect. Unfortunately, Bahamut is so strong (and fast) that its special ability allows the animator to literally carve out a path of destruction on the screen. If you're looking for outstanding choreography, unfortunately this isn't where you'll find it.\\n\r\nThis is indeed an ecchi based harem, the protagonist pretty much sees all the heroines at least partially undressed (except his sister thank goodness) and has more than his share of accidental exposures. Granted, some of the heroines are very aggressive relationship-wise (such as Krulcifer) so expect them to make moves on our poor (or lucky?) protagonist.\\n\\n\r\n[b]Sound:[/b]\\n\r\nThe show opens with a few nice guitar notes but then dives into a melody that that isn't particularly inspiring; it's electronic but not in the right way. The ED carries a similar guitar-based feel with Nano.Ripe's instantly recognizable voice. It's not a particularly memorable song but a fitting cool down piece. The brass instrumentation of the BGM during the title intro and various other portions of the show definitely give the show a fantasy-like feel. The overall BGM is minimalistic most of the time, and the  instrumentation changes based on the scene. There's a nice memorable, string-based theme whenever our show gets to a battle climax.\\n\\n\r\nWith the exception of Lux obviously being voiced by a girl, I think Bahamut's cast is actually very good. This is the first major role for Lynn that I've seen, and she does a pretty convincing tsundere as Lisesharte. I really liked Ari Ozawa's voice as Kirin in Gakusen Toshi Asterisk and her \"nii-san\" callings are pretty effective here too. Though her character isn't my favorite, Risa Taneda does a great job here as well. And not to be outdone, Shizuka Ishigami has an extremely dangerous/flirtatious character and she totally nails it. Again, if I were to have to pick a negative, it would be the antagonists; the VAs do a perfect job of matching a crazy-sounding voice to the already crazed-antagonist look.\\n\\n\r\n[b]Story:[/b]\\n\r\nLux is a Drag-Knight (short for Dragon-Knight, though I don't think Japan gets the connotation of their shortened form), which means he can make his sword magically turn into an armored mech, which he can pilot. However, he is not just any knight but the infamous pilot of Bahamut, the pitch-black machine dragon responsible for single-handedly bringing down the former empire (his father's empire essentially). It's an interesting twist to the setting that honestly isn't fully explained in the show.\\n\\n\r\nThe show follows Lux as he assists the all girls' school with various tasks, often involving saving various girls in succession who become smitten afterwards. The central plotline is actually rather weak, as the episodes tend to do a round robin through all the heroines. Once all the heroines are \"conquered\", we find that there is yet another tournament! This brings the show to an over-the-top climax followed by an all-too-familiar conclusion.\\n\\n\r\nHonestly, despite following the plotline of virtually every other action-based harem in the past few years, this is a story well executed. The story flows well and successfully weaves just the right amount of character development and interaction into the main plot. There's just the right amount of action mixed with a dose of comedy, ecchi, and romance.\\n\\n\r\n[b]Character:[/b]\\n\r\nThere are quite a few characters in Bahamut, and not all of them are treated equally. Some of the girls are successfully differentiated enough (such as Lisesharte and Krulcifer) but others still end up feeling like cookie-cutter characters (such as Celistia and pretty much all the antagonists). Airi is a nice accompaniment to Lux though one may wonder why she's just treated as an encyclopedia and fact announcer; perhaps they just wanted to be completely sure not to annoy viewers with an incest route. I guess I'm just happy that the show didn't turn into another Aokana as both Krulcifer and Kirihime are quite bold.\\n\\n\r\nThere are quite a few supporting characters, many of whom don't contribute all that much to the story; I will say Noct is a fun character as \"Yes\" and \"No\" are like half her lines. Despite these, there is a fair amount of character interaction and relationship development. Yes, a lot of it is just Lisesharte looking jealous as Lux hangs out with the other gals, but it's in a reasonable quantity. If there's one downer, it's that the characters are pretty static overall, I can't say that the events of the show strongly changed any of the characters (just having feelings for the protagonist doesn't count).\\n\\n\r\n[b]Value:[/b]\\n\r\nBahamut should be the go-to action-based harem of the season. It's an entertaining, easy to watch show with a good mix of themes and a fluid execution. It's obviously not perfect as described above but overall it tells a nice story with reasonable depth and memorable characters. There are plenty of unanswered questions at the end of the show so I'd expect there to be a sequel as well. Compared to other shows of the genre, I think it compares about equally with its predecessors such as Rakudai Kishi no Cavalry but with a much more moderate dosage of ecchi (especially when compared against Testament). Looking for a decent harem with some action? You've found it.\\n",
            "date": "2016-09-25T17:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 230218,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=230218"
        },
        {
            "content": "This season brings us another title to add to our catalogue of generic battle academy harem anime: Undefeated Bahamut Chronicle. These days it's hard for shows to be innovative so when I watch a show featuring common clichés I tend not to get too worked up about it, but this show doesn't at least attempt to try to differentiating itself and it is as generic as they come. By the first episode these things occur within JUST the first episode:\r\n☑ MC is a dense nice harem lead.\r\n☑ Protagonist is actually OP.\r\n☑ MC gets enrolled into an all-girls school.\r\n☑ Started with the MC accidentally groping orseeing a girl nude.\\n\r\n☑ Female student challenges MC to a duel.\\n\r\n☑ Every girl falls for the MC. (I'm not joking with you. Every single female in the school pretty much wants this guy's D.)\\n\\n\r\nStory: 2/10\\n\r\nThe story can be summed up like this: \\n\r\nMeet MC-kun. After some circumstances he ends up enrolled in an all-girls school (because why not?) and through his efforts he accidentally ends up getting an unwanted harem. The end.\\n\r\nMany shows within the \"battle academy harem anime\" genre can for the most part be summed up like this. Obviously this is not a true summary of the story but it does fit Undefeated Bahamut Chronicle and many of its similar shows pretty well.\\n\\n\r\nJoking aside, here's a rough summary:\\n\r\nThe previous ruling empire of Arcadia was overthrown via a rebellion five years ago. Lux Arcadia, a former prince of said empire accidentally ends up in a female dormitory's bathing area and falls on top of the kingdom's new princess Lisesharte while she is bathing and she challenges him to a Drag-Ride duel. The results of the duel somehow ends with Lux being enrolled into this all-girls school which \"coincidentally\" is where his younger sister and childhood friend are enrolled in.\\n\\n\r\nIf you think the story will try to explore its world more by explaining more on what the monster's known as Abyss are or what Drag-Rides are you'll be pretty disappointed. The Abyss are your generic evil monster that our main characters must destroy and the Drag-Rides simply get an explanation of: \"They are ancient weapons excavated from the ruins.\" The anime does have a plot but due to some pacing issues I can't really make much of it and with its one-dimensional villains all over the place I can't say who the actual antagonist really is.\\n\\n\r\nBasically what I'm saying is rather than focusing on better pacing, world building, and actual good character development most episodes are like this:\\n\r\n• Insert generic harem antics here.\\n\r\n• Potential haremette is in trouble!\\n\r\n• Lux defeats the one-dimensional villain and saves her.\\n\r\n• Girl has joined the harem!\\n\r\n• Repeat.\\n\r\nThis is the case for: Lisesharte, Krulcifer and Celistia which is more than half the harem!\\n\\n\r\nArt: 5/10\\n\r\nThere's not really anything noteworthy to mention, it's pretty average. A lot of CGI is being used in the fights and they look pretty good at very least. Character design wise... I don't like Philphie very much. Her hair looks weird along with her massive breasts.\\n\\n\r\nSound: 4/10\\n\r\nWho thought having Lux being voiced by a woman would be a good idea? He sounds much too feminine! The OP and ED are at the very least decent overall although sometimes the beginning of the OP makes me want to bang my head against my monitor.\\n\r\nAs for the soundtrack, it's nothing special. It fits the mood of the show and all but I can't see myself praising anything about it at all although it would be nice for more variety considering every fight in the show seems to use the same exact track every time.\\n\\n\r\nCharacter: 2/10\\n\r\nHere's the characters so far:\\n\r\n• Harem lead former prince: Lux.\\n\r\n• Tsundere princess: Lisesharte.\\n\r\n• Deadpan childhood friend: Philphie.\\n\r\n• Flirty foreign student: Krulcifer.\\n\r\n• The proud man-hater: Celistia.\\n\r\n• The brocon little sister: Airi.\\n\r\n• Yandere assassin: Yoruka.\\n\\n\r\nI honestly don't give a damn about any of these characters.\\n\r\n• Lux is your standard harem lead who is blessed with an OP Drag-Ride.\\n\r\n• Lisesharte, because her tragic backstory arrives and is somewhat resolved too quickly that I couldn't feel bad for her. Then she falls for Lux and spends most of her screentime playing the clingy jealous girl.\\n\r\n• Philphie is your standard childhood friend who ends up being there just for the fanservice.\\n\r\n• The little sister because she spends her screentime doing nearly nothing.\\n\r\n• The rest of the girls for falling in love with Lux after goes all OP on the shows one-dimensional villains.\\n\\n\r\nEnjoyment: 2/10\\n\r\n\"So bad it's good.\" That's pretty much the best way to describe this. That, or I may be a masochist. The characters annoy me, the fanservice turns me off and overall the story bores me for being predictable and horribly cliché. The fights end up as how you'd expect; the MC shows up to save a member of his harem, turns the tables on his opponent and then absolutely wrecks them. Most of the fights are very anti-climatic because once Lux shows you up can expect the fight to end up pretty damn quickly (I'm still salty about the episode 12's final battle).\\n\\n\r\nTo elaborate more on the fanservice there's a particular scene near the end of the second episode where during a fight they elaborate more on Lisesharte's backstory where they show her in a particular position while I guy rips off the lower part of her uniform. Uh? Another fanservice scene that I did not enjoy was when some of the characters invited Lux into a room where they dressed up as maids for him.\\n\\n\r\nOverall: 3/10\\n\r\nUndefeated Bahamut Chronicle is your standard generic battle academy harem anime that uses concepts and ideas from other battle-harem shows without bringing in any fresh new ideas leaving it as an utterly forgettable anime. It's like watching a mix of Infinite Stratos and Asterisk War.\\n\\n\r\nTl;dr: It's a massive cliché storm. Please, just go watch something better.",
            "date": "2016-03-30T11:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 214815,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4791710.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/_Kairu_",
                "username": "_Kairu_"
            },
            "url": "https://myanimelist.net/reviews.php?id=214815"
        },
        {
            "content": "So okay..first, i'm just a sucker for these kinds of anime, i don't know why but i just like these types of cliches, you know.. you already seen bunch of animes that uses these typical settings : school, harem, magic, super power, mecha etc.\r\nMaybe i'm just watching them for cliche's sake. or just damn bored.\r\nStory : 6/10\r\nI don't really care much about the main characters and his girls.. i only cared about the backstory of the villains. (might be more interesting than the main character's)\r\nThe story itself progressed fine, not bad but not good either. Some moments were rushed and it kinda felt awkward. thestory might give you a damn good DEJA VU if you watched Infinite Stratos. Same setting, same harem. (Only guy that could use the device, transferred to a girls-only school)\\n\\n\r\nArt: 7\\n\r\nIt was decent, i admit the art was good, but kinda meh when they used 3D Animations, it  was at such a low fps that i wanna laugh when seeing it.\\n\\n\r\nSound: 5\\n\r\nI couldn't complain about the backsound but... i skipped OP and ED the whole season.\\n\\n\r\nCharacter: 5\\n\r\nDamn...you could meet these type of characters everywhere. EVERYWHERE.\\n\r\nYou name it. Tsundere, Kuudere. Aggresive girl, Anti-boy girl, Sadistic girl\\n\\n\r\nEnjoyment: 7\\n\r\nThis was kinda enjoyable, but still very predictable, i swear i watched these kinds of animes and they are damn similar.\\n\\n\r\nOverall: 7\\n\r\n3D Animation was bad, i only continued watching hoping to find out about the backstory of the villains, sadly i was not. considering this anime was rated roughly 6. I don't think they would make the 2nd season of it.\\n\\n\r\nIf you're just a sucker for these mainstream harem stuffs, just watch it. it's good\\n\r\nIf you have little time to watch, just watch something else.\\n\\n\r\nThis is my first review, and that's all i have to say...\\n",
            "date": "2017-11-22T03:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 263744,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4480125.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GratoNite",
                "username": "GratoNite"
            },
            "url": "https://myanimelist.net/reviews.php?id=263744"
        },
        {
            "content": "Plot twists by nature are meant to shake up a viewer by going in an unexpected direction at a critical moment. They can't do their job if the viewer starts expecting them because they keep appearing at almost Every critical moment.\r\nThe usual plot expectation of any random ecchi harem is fairly low but in this case easily skyrockets early on when it becomes clear there are in fact numerous opposing factions at work and many events take sharp turns you don't see coming. Characters that seem harmless but odd gradually start showing their true colors, the recent history of the world is explained and exposedbit by bit, overall it amounts to a rather high paced and well planned web of tangled intentions and complex connections. Even in the midst of this there are many moments of really good comedy that should make most people burst into laughter, without detracting from the seriousness of the sinister forces lurking in the shadows. If only the english was even a single percent as good instead of painfully embarrassing... this is unfortunately one of those many animes where you'd wish they would never use a single english word but they are constantly thrown in at random because they \"sound cool\" or something.\\n\\n\r\nSadly things eventually start to break down in a really bad way, all those intricate conspiracies and mysterious personalities are steadily unraveled and turn out to be largely pointless theatrics hiding a gruesome flaw in the characters: their core motivations can in almost every single case be summed up with a few words and they are horribly dumb. It's easy to get why Lux is driven by the single thought that he doesn't want people to suffer, but why would someone literally strive to be a hated tyrant just for the sake of being a hated tyrant? The longer this mess goes on the more shallow and idiotic their goals become, made even worse by constantly throwing in new characters just to have enough opponents to keep Lux busy.\\n\\n\r\nI'd rate the first half of the season a strong 8 and the rest a weak 6 entirely because of characters and story. The art and sound are generally wonderful except for how overly feminine Lux's voice happens to be, it's often completely obvious that it's not working well. The opening is one of the worst to ever torment my ears but didn't factor into my review (openings and endings have nothing to do with the real content and quality of any anime, some would disagree but I stand firm and refuse to have them influence the rating) just a heads up to save your ears and sanity.",
            "date": "2017-10-22T21:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 261466,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6311485.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BriefEd",
                "username": "BriefEd"
            },
            "url": "https://myanimelist.net/reviews.php?id=261466"
        },
        {
            "content": "An anime with much more potential, but not enough episodes...\r\nStory: 7 \r\nThe story is actually really strong!!! You can make a really big succesful anime serie with a pretty large amount of episodes (30-40). What did they do? They put it all in 12 episodes, which is a real shame. It could have been way more extensive than it is now. \r\nArt: 10\r\nGood art!! Well done!!! Characters and environment looked really good. \r\nSound: 9 \r\nThe effects of the shooting were pretty cool, never heard them before lol.\r\nCharacter: 7\r\nFor the characters goes the same. They could have been worked out much better! They have such interestingpast and stories I want to know more!!! \\n\\n\r\nEnjoyment: 6 + 1 = 7\\n\r\nI did actually enjoy the series, but on the other hand i didn't because it was going too fast and undetailed for me. That made it around a 6 to me, but it did have a little bit of fanservice, some romance and dunny moments sow i give it a bonuspoint :P.\\n\\n\r\nOverall: 7",
            "date": "2016-11-08T13:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 233448,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5667028.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CADAEMOS",
                "username": "CADAEMOS"
            },
            "url": "https://myanimelist.net/reviews.php?id=233448"
        },
        {
            "content": "Overall this anime was a 7.\r\nIt's an anime, anime is entertainment, and watching it was entertaining and enjoyable, so it's a 7.\r\nSpoilers:\r\nStory: 7\r\nOther then the extremely close resemblance with Infinite Stratos the story is about a prince that helps overthrow his country to save it, since it is corrupt. Up to that part, it's pretty nice, and even seems to deserve an 8, however, once you throw in the lack of explanations for the \"ruins\" and \"drag-rides\" it lowers it to a 7. All in all, it wasn't bad, but it wasn't great.\r\nArt: 7\r\nDecent art, pretty much average / standard for a 2016 anime, nottoo much annoying - mob CGI and the characters all look decent. Background was alright.\\n\\n\r\nSound: 6\\n\r\nFor a 12 episode half-season anime, it had decent sound. The op starts out pretty terribly but it works, but the very, very incorrect english (grammatically not pronouciation) really irritates me since half of what is said, honestly is more of a mix of \"cool\" words rather then anything coherent. The action/battle ost is kind of overused, but since it only has 12 episodes, you can't expect too many ost's.\\n\\n\r\nCharacter: 5\\n\r\nGood main character, lots of depth, too many extra female main characters that are explained half-way. Almost all the characters are girls, and most of them have breasts bigger then their heads. It's not bad enough to be a whore-fest but liking a character other then the mc is difficult.\\n\\n\r\nEnjoyment: 7\\n\r\nWorth watching, especially if you want new content. For people like me that re-watches anime a lot, it all depends on whether you liked it or not. Personally, I will probably re-watch this anime, especially if it gets a second season.\\n\\n\r\nAnime is entertainment, if it entertains a lot of people, it's a good anime. Nobody cares if the story is a 10 or a 0 as long as its entertaining.",
            "date": "2016-09-06T20:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 228474,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5488856.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Inorichi",
                "username": "Inorichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=228474"
        },
        {
            "content": "At first, I had the impression that this anime was shit but i had to finish it. It did start off a bit bad but when the story goes a bit farther it can actually give u a nice impression. The reviews i've seen here are mostly the ones who didn't even try to finish it. This anime actually points out the action more often and has less of the Harem while the anime being ecchi, it was merely just a few scenes.\r\nI find the other characters annoying honestly like there are those girls who try to hard to get attention from a guy whichbasically describes the princess (I'm not good at remembering names) while she also acts too innocent around him. The main character is like not that typical boy in an Ecchi/Harem Anime who easily gets a nosebleed or like blushes.\\n\\n\r\nThis also has some sense of humor to it which i think is great. So overall, i'd give it a 7 since there are those scenes which are irrelevant to the story.",
            "date": "2016-05-01T01:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 217584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5212902.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KawaiixGhoul",
                "username": "KawaiixGhoul"
            },
            "url": "https://myanimelist.net/reviews.php?id=217584"
        },
        {
            "content": "Honestly I only started watching this because it seemed like Infinite Stratos... guy gets stuck at a school with all girls and it turns into a harem anime.  As much as i'd say that's uninjoyable, for me that part was fine.  It was done alright with great voice actor good character animation but the big thing that set me off about the series was that It was hard to understand.  It took major plot points and kind of sanded them down.  And the entire thing kind of just gives me a headache.  I had to pause in certain parts toanalyze what was going on.  Now that might work for some people but i'd rather the show give enough hints that I can figure it out during downtime of the show.  (SPOILER WARNING)\\n\\n\r\nNow you might be thinking,\"what does he mean by hard to understand, i get the plot points i get it\"  I guess you have somewhat of a point.  I might be a little bit slow when it comes down to it but here's a couple questions that kind of break down the story for me.  Why is his sister never in the flashbacks, does the sister remember their older brother.  Why was phi used as an experiment if her family was like nobles.  Also halfway through the season they just decide to bring up another government and an entire thing on spies that seems totally irreverent.  And why is it called the old age if they had what seems like better technology than what the people in the story have now.\\n\\n\r\nNext thing it sanded down major plot points.  Now i did say spoilers before but most people down pay attention to it anyways.  The biggest plot point so far was that his childhood friend phi is actually dead.  She dies in an experiment five years ago where they were testing experimental human weapons.  Now this is a major development that they literally graissed over.  Now the problem is its well done at the same time its horrible.  Its like they had a writer conflict.  What should we do make the person feel bad for phi because she was just a nice cute girl who wanted the best for everyone and have her brutally tortured and killed made worse by the flashbacks of her being loving and caring or should we focus on the fact she is controlled by a Ragnarok seed.  I don't know lets try both.  Honestly the fact that they took a helpless girl like that and made her story sad instantly made my hands lifeless.  It's one of those scenes that just makes you think why did someone write this.  Its just painful to listen and to watch.  Kind of like the rape scene from Mirai Nikki.  Anyways the plot point has impact just not as much as it deserves.  At least they didn't put her in that lingere during the scene where she's in bed that would've killed the entire series and i would stop there.\\n\\n\r\nClosing Statement - I came here to watch harem but I got a good story that was badly delivered and i'm question some of the choices like changing from harem to large plot point back to harem.  It takes me out of the mood completely and its god damn annoying.  Anyways its worth a watch if you have some free time.  If you just take a look at the not harem stuff and only that its a pretty solid watch.\\n\\n\r\nEdit - So many plot points so little time.\\n",
            "date": "2018-03-24T19:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 274906,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7068457.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GiB_69",
                "username": "GiB_69"
            },
            "url": "https://myanimelist.net/reviews.php?id=274906"
        },
        {
            "content": "Story: so basically the story is about this guy was chasing a cat or somthing like that he crashes throught the ceiling and than sees a girl naked she challenges him 2 a duel (wont spoil the rest of how it starts)\r\nArt: pretty good art nothing really else to say\r\nSound: again was pretty good\r\nCharacters: now the characters were damn good too me NO ONE annoyed me or anything just good characters \r\nEnjoyment: i did this anime like a month or 2 months ago but from what i remember the anime was freaking funny also the ecchi is really there and add a harem too itwhich i loved just a very good anime\\n\\n\r\nOverall: this is a anime id so recommend for a lot of reason the characters, the ecchi, and also the great comedy and harem to it aswell",
            "date": "2016-08-09T16:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 226346,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=226346"
        },
        {
            "content": "So basically and shortly, there is no.. GODDAMN... STORY! Offcourse there is but like segments that at the end you will be suprised if you even understand it... \r\nI dont mean it like its not good but this anime has poorly based story.\r\n Its not the worst but... its not... well you have to watch it. But still I have a weird feeling this anime satisfied me. Why? Idk... Mainly because of genre: harem, ecchi, mecha... even tho this is for not so perverted guys (occasionally girls). I feel abou this as if Rakudai Kishi no Cavalry and Trinity Seven had a baby. *Spoiler alert*battles in (so called) Drag-Rides are horrible. And also Phi is best girl, Airi is the cutest... ( ͡° ͜ʖ ͡°)\\n\r\nEven tho its not state of the art in any way, I would like to see 2. season or some OVAs.",
            "date": "2017-01-21T18:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 238795,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5713235.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Ivaaan",
                "username": "Ivaaan"
            },
            "url": "https://myanimelist.net/reviews.php?id=238795"
        },
        {
            "content": "Avoid this one. Nothing about Saijaku Muhai no Bahamut provides the series with any sort of staying power.\r\nUncompelling characters combined with a lackluster plot provide the viewer with nothing but disappointment. \r\nEven the harem portions of the show were incredibly uninteresting. This can probably be attritubed mostly to bad writing. What wasn't ruined by the atrocious writing was ruined by the uninteresting supporting cast. The bevy of female supporting characters in this show were a massive collection of annoyances.  The only slightly redeeming aspect of this show are the average, at best animations. Even this was nothing particularly special however. \r\nIn no way amI a super picky viewer who will drop something if it doesn't blow me away. I do, however, expect a certain baseline to be met. If a show is going to delve into the oft-explored depths of the harem-action-fantasy-school genre, it needs to be able to compete with it's plethora of competitors. This, unfortunately, usually appears in the form of fan service, but occasionally appears in the form of intriguing plot. Saijaku Mutai no Bahamut, unfortunately, largely fails in both regards. \\n\\n\r\nI personally found the \"development\" of the main character to be particularly disappointing. I believe this stemmed from the show's crisis of feeling. It was too busy trying to be a light hearted harem anime, and the potential for the main characters dark past being brought to light, and his ultimate redemtion being achieved, was completely squandered. So much wasted potential from this show's plot completely saddened me.  \\n\\n\r\nUltimately, viewers usually judge the watchability of a show by it's enjoyment. This is usually hard to quantify, and is largely affected by an individuals personal preference as opposed to anything concrete. I suppose you could call this the eye test. This show completely fails in this regard, and is very lackluster.\\n\\n\r\nDo yourselves a favor and skip this show.",
            "date": "2016-06-29T14:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 222366,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5228052.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/watylicious",
                "username": "watylicious"
            },
            "url": "https://myanimelist.net/reviews.php?id=222366"
        },
        {
            "content": "Despite being another generic harem I actually enjoyed it, but not because I just did, I thought for a while and realized some things.\r\nStory\r\nJust like any other Mecha-harem-ecchi anime , It's just another boy who ends up meeting some girls and then he gets a harem,  yeah there's nothing really speacial about the stor, what I do appriciate though is that they didn't focus more on fanservice and I what I mean is the typical things that you see in a Harem anime\r\nInstead they focus on the MC's relationship with each girls however that's it, on top of that there are just things thatI can't understand characters that appear out of nowhere and the final parts of the story is mainly rushed.\\n\\n\r\nCharacters\\n\r\nfor the characaters though there's not really much to say about them, what I do like though Is that every girl has a good chemistry with our MC lux, however what I don't like though that the girls we're introduced strong and they are, if they are with Lux they appear to be weak as they rely heavily on him.\\n\\n\r\nOn the other hand I do like the character of Lux, yeah sure he's like ICHIKA from Infinite stratos, but hey the thing is he didn't get the girl's affection for nothing.\\n\r\npersonally I think he actually earned it, for he actually did something that win the girl's heart, ( i won't tell that much because of spoilers), on top of that I like that he doesn't rely on his power that much, yeah he's got the bahamut a really powerful weapon or armor but still he thinks before he makes his own move, not to mention i like his design and his motive\\n\\n\r\nand lastly the villains are just there as they are pretty dull.\\n\\n\r\nSound and Animation\\n\r\nthe sound is pretty much okay though I enjoyed the opening, the art though I really like it, I like everyone's designs my personal favorite is Lisha and Celes (my waifu in this series) and the battle scenes were nicely done, the despite the less fan service It's enough to make fans excited lol.\\n\\n\r\nEnjoyment and Overall\\n\r\n All I can say Is I enjoyed it except for the end though where It felt rushed , and would I recommend it I guess, It's not really the best mecha harem anime but It's not the worst, at least they really tried to explain everything at least that's what I thought.",
            "date": "2017-09-14T23:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 257550,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949977.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MetalTsundere",
                "username": "MetalTsundere"
            },
            "url": "https://myanimelist.net/reviews.php?id=257550"
        },
        {
            "content": "Continuing I finish those last 11 episodes of the winter season: Saijaku Muhai no Bahamut. \r\nStory: I won't hate it completely because it was a few months between me watching episode 1 and 2. I had no clue what was going on. I had no clue what the bad guy was trying to do. Kill Lux? Destroy the world? Take over the country? I've never read the LNs but apparently a lot of content was skipped. The story was poorly explained.\r\nCharacter: This show is a harem so 95% of the characters will be female. I hate none of them. In fact they are all wonderful.\\n\r\nStereotypical god MC who every girl loves: Lux\\n\r\nTsundere: Liseharte\\n\r\nChildhood friend: Philphie\\n\r\nBest girl: Krulcifer\\n\r\nLarge breasts and second best girl: Celestia \\n\r\nAss and only 3 episodes: Yoruka\\n\r\nSister: Airi\\n\r\nAnd because it's a girls only school: Attractive Girls\\n\r\nThey are generic but so wonderful at the same time. The only problem is the show is 12 episodes long and the main girl, Liseharte, barely gets screentime. \\n\\n\r\nArt and Sound: At first the I didn't enjoy the OP but it did grow on me over time. The ED is so happy. It's really upbeat. Soundtrack not really worth noting other than one song. \\n\r\nVoice acting was good. \\n\r\nThe CGI for the Drag-Rides appeared good. I don't watch much shows with CGI so I can't really judge. It didn't appear out of place. \\n\\n\r\nEnjoyment: Yes. I did enjoy this. You don't need to think super hard to watch it. Not every show needs to be an Evangelion. I enjoy ecchi and I enjoy harems so I will enjoy this show. If you enjoy those watch this. If you don't avoid it. \\n\\n\r\nOverall: Saijaku is not terrible nor is it the best thing to air in the winter. If you don't enjoy harems just avoid it.",
            "date": "2016-05-15T09:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 218603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/IKnowBestu",
                "username": "IKnowBestu"
            },
            "url": "https://myanimelist.net/reviews.php?id=218603"
        },
        {
            "content": "Well I went with an overall of 7/10 or \"Good\" for this anime but the scale could have easily fallen to the 6/10 or \"fair\" side, I 'm the kinda person that depends on first impressions and chooses a book because I love the cover. \r\nThis anime has got some awesome art and that's about all that I found to be great about the anime, I'm Not trying to randomly hate, I am just pretty sure that this anime could have been a lot better than what it is.\r\nI'm gonna try and keep this as short as possible making sure you under stand exactly whyi think this anime deserves being in between \"good\" and just \"fair\".\\n\\n\r\nstory \\n\\n\r\nWell, the plot is their but the story doesn't do a good job in showing you the details, even half way through the anime, understanding what exactly the enemy wants or or why their doing what they do is impossible to figure out.\\n\\n\r\nA few flashbacks here and their, most of the time they are very vague and dont cover much of the real stuff you want to know about the direction of the anime, I think the protagonist is supposed to be a sort of tragic hero but how that am not sure exactly how such responsibility fell onto him and not his brother.\\n\\n\r\nArt\\n\\n\r\nLike i said in the intro, the best part about this anime for me was the art, the smooth anime, well drawn characters and super vivid colors that are gonna melt your eyes.\\n\\n\r\nsome of the female characters have unrealistically gigantic boobs. so it for someone who like that kinda thing, then this is your anime but I can't really call this is fan service.\\n\\n\r\nCharacter\\n\\n\r\nWell, for starters, the main character is not the kinda protagonist everybody is gonna love, He's back story wont exactly make you understand him and that goes for most of the characters in this anime.\\n\\n\r\nTheir are parts where its clear that your supposed to sympathize with the characters but because of how much the anime is gonna give you, getting the viewer emotional is just impossible.\\n\\n\r\nSound\\n\\n\r\nNot gonna say much because its very rare for anime to mess up this part, you wont be disappointed, Oh! wait the soundtrack, this might be just more of a matter of preference but I absolutely did not like the soundtracks.\\n\\n\r\nI like it when the music helps me get the mood of the scene, the soundtracks used in this anime didn't make it for me.\\n\\n\r\nEnjoyment\\n\\n\r\nJust like the overall score, Am giving it a \"bare pass\" 7/10, the anime could have been better but I cant say that it wasn't fun to watch , their are some awesome fight scenes and a few characters in here that might catch your attention and I think that how anime should be.\\n\\n\r\nThe anime is not a must watch, but also its not a not watch, in my point of view its just another anime with a lot of cliche characters and that in it self is not a bad thing, so If you haven't started watching it then I think you better stop reading the reviews and just watch it.\\n\r\n Reply       My Messages",
            "date": "2016-03-30T12:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 214819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4957104.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mcrider",
                "username": "mcrider"
            },
            "url": "https://myanimelist.net/reviews.php?id=214819"
        },
        {
            "content": "HELLO GENERIC SUPERNATURAL MAIN PROTAGONIST WHO'S OP GOING TO AN ALL GIRLS SCHOOL 98#. \r\nSo think Infinite Stratos only better as there are ACTUAL threats in this one! Although there are some typical cliches from this kind of series, there are some difference that makes this anime slightly tolerable. For instance how about the main haremettes are developed enough they get their own episodic arcs with villains and threats that leads into a bigger bad connected to Lux?, good animated battles with mech suits vs. mech suits AS WELL as mutant dragons and finally a decent bigger bad main villain throughout the anime planning behindthe curtains of the anime (though he's terribly \"evil for evil sake\" cliched).\\n\\n\r\nLA won't lie, when LA first saw this anime's first episode, LA saw it as typical genericism with the elements LA mocked at the start of this review however as LA carried on watching it, it did get slightly better with the harem growth (along with the main protagonist at that) and plot wise. \\n\\n\r\nLA's favourite character throughout the anime was Krulcifer Einfolk voiced by ''Yukiyo Fujii'' and once her arc started LA at least got excited and was satisfied with her arc (and not to mention that arc didn't fall under the typical cliches). This anime does follow multiple plotlines from the harem antics aka. haremette arcs, the political dealings between it's two warring countries and the threat of dragons attacking and they do balance it in some modest way, LA won't say they balance all these perfectly but still, it's enough so that those plotlines doesn't intervene and distract with one another and more blend together to make a more cohesive narrative.\\n\\n\r\nYes unfortunately the fanservice is there and it is somewhat annoying especially the haremette and childhood friend of Lux, Philphie Aingram voiced by ''Yuriko Kubo'' but other than that, it's \"modest\" in terms of fanservice levels. \\n\\n\r\nThe animation by Lerche, is decent enough with slick character designs to even the mech suits looking pretty distinct from each of the main cast members, the battle scenes are animated decently enough for LA to get invested in, though this anime's battle scenes has a habit to blatantly change into segmented CGI just on the characters face along with both CGI animation and traditional animation on the mech's thus is blatant enough to get slightly distracting.\\n\\n\r\nIn terms of voice acting, as much as LA's favourite character was Krulcifer Einfolk and ''Yukiyo Fujii'' still did a fantastic job for what material she had, LA's favourite voice actor on the other hand goes to ''Shizuka Ishigami'' as our wild-card harem member who voiced Yoruka Kirihime and her character starts to appear in Episode 11!...yeah Shizuka Ishigami's voice work actually gave LA enough of an impression of Yoruka for TWO EPISODES and was satisfied by even that.\\n\\n\r\n The ending did once again didn't fall under certain tropes of this anime genre, because of that LA will praise it at least that the battle harem members DO get something to do for this final battle and not just have Lux one-hit kill everything, however as much as LA praise this ending, it still falls under some battle harem tropes at the same time but LA won't explain as it goes into spoiler territory but LA just wished the final scenes of this anime didn't end so cliched as it had something good going but then threw that intense, plot-driven and character-invested ending away by the last second. \\n\\n\r\nUndefeated Bahamut Chronicle for LA, it is your typical anime you've seen in coming out recently, the \"GENERIC SUPERNATURAL MAIN PROTAGONIST WHO'S OP GOING TO AN ALL GIRLS SCHOOL\" LA mockingly said at the start of this review, however LA will say that as cliche as it is, it does handle some of it's plot and character elements better than it's anime cliched genre counterparts, such as a haremette-centred focus that simultaneously develops both the haremette in question as well as the main protagonist, good animated battles as well as major villain that actually means and changes something to the plot and characters.\\n\\n\r\nAt best LA will say that Saijaku Muhai no Bahamut is competent and modest but that's the best praise LA will give it, it still has some flaws and cliches hanging here and there to bring back it's typical genericism to it's anime genre from the beginning to later on the very last seconds of the anime. Want a better version of Infinite Stratos with actual risks and stakes instead of the plot or characters just loafing around, then come mech-suit up with Saijaku Muhai no Bahamut!...but even then it's not \"much\" of a step up. But still a step up is better than any steps down right?",
            "date": "2016-03-29T03:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 214650,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=214650"
        }
    ],
    [
        {
            "content": "In a yet another generic fantasy settings in yet another light-novel anime, which starts exactly in same way as those other anime series (Asterisks, Rakudai) you might watched recently, follow destiny of a tragic hero, exactly like in those other anime series you probably watched not so recently (Mahouka, SAO). His mother died, his puppy died too ... I guess ... and what is the worst he must constantly defend himself from all the girls who want him, while protecting them from one-dimensional villains. Ride the Drag-Ride which is basically fancy version of the cargo loader from the aliens. Be amazed as our Drag-Knight herooverpowers his adversaries with the two most powerful weapons known to mankind ... plot armor and asspulls. Then meet his harem as he is accepted into all-girl school, like the guy in other anime (Shomin sample) I watched recently. Starring: the prince on his white mecha, the tsundere, the big beewbs, the \"little sister\", the tragic orphan girl.\\n\\n\\n\r\n1/10\\n\r\nstory\\n\r\n 5/10\\n\r\nanimation\\n\r\n 3/10\\n\r\nsound\\n\r\n 2/10\\n\r\ncharacters\\n\r\n 2/10\\n\r\noverall",
            "date": "2016-07-16T01:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 224145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5537832.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/JasonKKAA",
                "username": "JasonKKAA"
            },
            "url": "https://myanimelist.net/reviews.php?id=224145"
        },
        {
            "content": "[No Spoilers!]\r\nSo, I just finished this anime. Like most I believe I'd say this anime isn't terrible, but it isn't amazing. The art is definitely great and the fights are definitely flashy and well done, but my biggest complaint is the extremely lack of information provided for so many questions left unanswered and when I say so many... I many like there's just a huge pit of \"Who? What? When? Where? and Why?\" In this anime.\r\nAt first it'll give you a taste of what is going on, but by the middle you really just don't get what's going on, and at the end you justwant someone to explain it to you...\\n\\n\r\nI really like mech animes and I really think this anime could have had so much more to it. When I finished the last episode I couldn't decide if it was worth it or not.\\n\\n\r\nBut you might be wondering why I gave it a 6 with all this looming over my head... well it's because I may give the 2nd season a chance, mostly because I want answers to all the unknown in this anime.\\n\\n\r\nShould you give it a try? I'm not sure... I'd say leave this one for a day you REALLY have nothing better to watch.\\n\\n\r\nThanks for reading!",
            "date": "2016-04-01T21:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 215125,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PancakePuncher",
                "username": "PancakePuncher"
            },
            "url": "https://myanimelist.net/reviews.php?id=215125"
        },
        {
            "content": "Enjoyable anime...\r\nthats all, if you want a decent anime to see like all these generic animes... go for it!.\r\nIts almost... worth\r\nAre you searching for the most original anime of the season?\r\nNOPE, Go away, and see my top 150 list if you want an anime reco.\r\nor search \"anime recomended\" on google, you little lazy son of a.... ANYWAY.\r\nThe story was relatively \"Funny\"\r\nI still dont understand why Square Enix take part in this.\r\n(I know ... BECAUSE GAMES AND STUFF)\r\nLerche It doesnt have all the blame ... from Majikoi! until now he has a very good titles despite his short time in operation.\r\nWHY?\r\n   ...\r\nWhat done isdone...\\n\r\nThatas all.\\n\\n\r\n5/10 Regular User\\n\\n\r\n10/10 IGN\\n\\n\r\n8/10 Your mother (LOL)\\n\\n\r\n1-4/10 users who are tired of seeing the same thing over and over again",
            "date": "2016-03-28T18:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 214609,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4651902.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Eichen",
                "username": "Eichen"
            },
            "url": "https://myanimelist.net/reviews.php?id=214609"
        },
        {
            "content": "Saijaku Muhai no Bahamut is just another generic ecchi harem.\r\nNote: this review will be very opinionated and may contain spoilers, you have been warned.\r\nI actully don't hate this show but I do hate the whole premis, or rather not even that. The premis isn't so bad, how do I put this. I just hate the generic ecchi harem parts of it, which there is plently of. It actully took me a long time to get this show done (like 12 days) which is rare for me with such a short show. It never captured my interest really.\r\nSo what happens, well what do you think happens.Mister generic MC finds himself accidently in the girls bathhouse and right on top of a girl, of course she's a tsundare which means she is who he will end up with and she freaks out at him. Basically it turns out that Lux is a transfer student and his also a male when this is a girls only school. Oh the clichés, just recalling this is activity sucking the creative life force within me. Either way there is more going on as it turns out he is the final prince of the old empire which isn't around anymore since it got overtaken by the new empire. This world also just has the most creative names, obviously. either way Lux betrayed the old empire in order to help the new empire take over and while he is still considered a criminal he is mostly givin a lot of freedom as is his sister. His a very talented drag-rider as well, drag-rides being the mecha this shows uses. Anyway these creators called Abyses or something like that sometimes attack and Lux is bascially there as an extra layer of defence, also all the girls in his harem also have there own drag-rides and fight aswell. I'm not gonna get to into the plot becuase it's very inconsistent and works on a two episode basis most of the time.\\n\\n\r\nSo bascially the first epsiode of any givin two episode set starts out with Lux interacting with the next girl the show is going to cover. She has some issue and needs his help in some way and becuase his just the best guy in the world he decides to help. There's only one time his forced to help any of them out and he ends up going above and beyond what she asks so yer. Then by the end of the episode Lux has to fight someone or an enemy makes themselves known as the enemy and then the second episode is fighting this enemy and he wins and the girl loves him and then you get some sence where she goes on about how much she loves him.\\n\\n\r\nThe issue with this is that these girls become pretty useless fast, they have very little attention given to them outside of there two episode arc (minus the main girl Lisha) and even she gets the shaft in the other girls arcs, is just that in the few episodes where it doesn't have an arc going on, she gets the most focus. For instance after Lisha's arc we move on to Krulcifer and Lisha is seen once at the start and once at the end of this arc. At the start she's trying to capture Lux in order to make him follow a request but is never seen after Krulcifer ends up getting the request. Then she's there right at the end to scream \"what are you two doing\" when Lux and Krulcifer kiss two times in a row. I also hate how harem shows do this, these two were kissing and while Lux had the typical harem MC reaction he wasn't resisting, in the real world some girl isn't just going to slam in and yell at him and make it look like his doing something wrong, he is his own person and can do whatever he wants, if his not out right resisting her then he is consenting to it and so for her to react this way to there face is insane. She might be upset about it or angry at him but she doesn't own him, just becuase she's the main girl and tsun doesnt make it okay, it's stupid.\\n\\n\r\nIn fact all the characters are pretty stupid. Phi is the only one who I didn't think was super stupid, Lisha is just a dumb tsun and makes really stupid decisions. Krukcifer forces Lux to pretend to be her boyfriend and then when he does so tells him to stop becuase she is useless and then when he saves her she goes on to say that they are engaged even though the agreement is over. The third girl (can't remember her name) can't even tell that Luno is just Lux dressed as a girl even when he takes off his shirt! It's from the back but that still makes no sense, plus she pretends to be a man hater cause she doesn't know how to deal with them, fine. If she stops being a man hater that's fine but she still shouldn't be able to deal with men yet once her arc is over she outright starts hitting on Lux and even invites him to help her in a mission, not possible! Phi is the only girl I consider not to be stupid and she actully also has the most development and has the most realistic reason to like Lux, there child hood friends and from a young age Lux promised to protect her and they have both helped each other out a lot though there life and thus this makes a lot of sense. She is also the soul reason that Lux has trained so hard and is the way he is today, it's so stupid the the deeper and much more important girl isn't the main girl just becuase the tsun always has to win in these shows. The kinda last girl Yoruka is also dumb, she is hyped up for a while and is the final fight aginst Lux and she is taken down in one strike becuase she mentions her brother which causes her to show emotion and then Lux is able to see through her movements because of that even though she was just beating the crap out of him becuase she only attacked when he was unable to respond. Why would she suddenly attack when he can see even if he did mention her brother, she just spent ages talking about her brother while fighting why does he mentioning it change anything and then she betrays the old empire as well for no reason at all, she just does and then at the end is treated like a harem member. She was in the show for like 3 episodes and was a bad guy for most of it, but hey, we need more girls so that you can have a Waifu no matter what your into. There's even a Loli that's around for like 1 and a half episodes just so that all the Lolicons can have a character to buy merchindise of. \\n\\n\r\nThis show is bad.\\n\\n\r\nI actully enjoyed most of the characters despite them being all a bunch of idiots and phi was absolutely done great which makes the avrage a little better, but just keep in mind that mostly everyone is super generic and dumb.\\n\\n\r\nThe presentation is the only thing besides Phi that is any good. The OP and ED are generic in the sense that there the same as a lot of other OPs and EDs of the same genre, but it's becuase it works and I still enjoyed it even if it wasn't anything new. The background music is also pretty good, it does what it needs to do but the music that sometimes plays during battles is amazing and I love it, really good a building up hype. The battles however are mostly a let down, most of them are slow and nothing much really happens, it's just a few moves used and then the protagonist has won with an ass pull, sweet. That is untill the final few episodes, the last two or so episodes suddenly start having really well done fights. The drag-rides move fast and chain there moves together well, everything flows together and it's acutlly like a real fight and doesn't feel really turn based and rugid. I like the last few episodes becuase of this, however it doesn't change the fact that the drag-rides are CG most of the time. The CG ranges from bareable to horrible and that's an issue. It's a shame that it's bareable sometimes cause that shows that when they put effort in it can look okay but then it goes to looking horrible in the same episode and I'm just wondering why some parts got more effort then others, it is better then if all of it was horrible but the inconsistency is a massive pain, becuase it gives me a taste of bareable CG right before slapping me in the fact with really bad and obvious CG that makes me wanna punch my screen. Aside from e drag-rides everything is pretty avrage, there are a few really good parts but then there are also some really poor parts and so overall I'd say it equals out to be avrage in the long run. It didn't really change how much I enjoyed it.\\n\\n\r\nOverall I didn't hate it, I spent a lot of time ragging on it but that's just becuase it does a lot of things bad and it is a generic ecchi harem that makes poor use its one good chareter and for every good thing it does and has just as many if not more bad things in the same thing. Only one solid character, every good amazing fight has just as many stale fights. Every clever moment has an ass pull counter part and all the really well made moments are ruined by being followed by something really poorly animated or by having something dull happen in the amazing area. That really stupid final fight between Lux and Yoruka happened in a beautifully animated area that looks absolutely stunning. But the fight is one huge ass pull plus it's also stale and just makes Yoruka who was super threatening, just a dumb dull girl who is obsessed with Lux like everyone else. So objectivily it's pretty dull and that did effect my enjoyment a bit but overall I still enjoyed the show most of the time. I never felt like watching it but once I just selected the next episode and started I enjoyed myself for the most part and never wanted to click away or stop watching becuas of the shows fault. It's just hard to be interested when your not watching it, I was never hyped to find out what would happen next and show ends in the worst way. With Lux surroded by all his Harem and they ask which one he loves and then each of the girls say there line and he just screams. Even his sister gets a line in even though she has never been shown to feel that way towards him, even Lux is shocked when she chimes in which just shows how stupid it is to make her a part of his harem in legit the last minute of the show. But I did enjoy it enough, its just bad in a more objective way.\\n\\n\r\n5/10 average.",
            "date": "2016-09-13T20:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 228995,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3351479.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Eira_99",
                "username": "Eira_99"
            },
            "url": "https://myanimelist.net/reviews.php?id=228995"
        },
        {
            "content": "Undefeated Bahamut Chronicle is a show that should have admitted defeat from the get-go.\r\nIf you have seen any fantasy series set in a school that focuses on special abilities and have your main male character surrounded by girls that have feeling for him, than this is no different. Now, as much as I'm not wholly against series with harems in them, this doesn't do much with it. All they do is build up the roster and nothing else. There's also nothing too great with the universe.\r\nThe characters are just another set of artificial tropes that have barely any development. The harem, in particular, is dullwith barely any chemistry with the main character. You know how the first girl is kind of like the \"main\" girl, where she has more interactions? Well, that's not the case here, even though they try make her appear as one. The support characters can't even be considered support and are more like background characters.\\n\\n\r\nThe animation is actually pretty good. Having seen Lerche's other productions, there are some similarities. However, this alone won't help salvage the series by any means.\\n\\n\r\nThere's not much to say about the show except for everything about it was honestly boring. I've also had a history with shows like this where I never enjoyed them, plus when I began to realize how all of them are alike in the same way. If this is the kind of stuff you're into then you may like it, otherwise I wouldn't recommend it.",
            "date": "2016-03-29T21:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 214748,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AllenHavens92",
                "username": "AllenHavens92"
            },
            "url": "https://myanimelist.net/reviews.php?id=214748"
        },
        {
            "content": "Oh harem.  Very commonly there are anime that make it so that you out of every genre that is out there, harem is the most hated.  And of course, with the usual seasonal adaptations of harem series, they don't really help your case now does it?\r\nStory:  Lux Arcadia is a boy who used to be part of the royal family back in the old country.  Now that that country has been taken over and reestablished as a new country, he must now take on odd jobs and such in order to live a half-decent life.  One day, he crashes intoa roof, right into the nearby academy's bathing room where he crash lands onto a girl and fondles her breast.  (Typical harem stuff.)  As punishment, he must now attend the academy attend school as a student, a school where every student wield a drag-ride, a sword that turns into a mech.  Yep.  It's this kind of anime.  \\n\\n\r\nOk, I'm gonna be COMPLETELY blunt about this one.  The story is terrible.  The main focus of this anime is to get girls, that's all it is.  Every few episodes has Lux talking or helping out some new girl he meets, before using his protagonist power and making it so that that specific member of the female species devotes her entire reproductive system to only swearing to bear his children because generic harem.  They have this story about some rebellion against the new kingdom which doesn't get anywhere cause it's horrendously unexplained, we have incomplete explanations about literally every new concept or fact that this show tries to establish (like drag-rides, the Abyss monsters, the ruins, what the main villain's plan was), and just cliches up the wazoo.  \\n\\n\r\nSo, with that in mind, what exactly are the positives here?  Well, to be completely honest, the show is self aware of what it is.  I don't know what it is about this one in particular, but Bahamut is so terribly written that I swear that Lerche was doing it on purpose because they know just how bad it actually is.  It's so chock full of cliches and terrible writing that it's actually really funny to watch cause the show just honestly does not give a single shit whether or not it makes sense or not.  It's for this sole reason that I was able to even finish this series, or get through it without any internal malice towards it.  Don't get me wrong though.  The story here is generic as fuck and is god awful if you actually take a look at it.  \\n\\n\r\nOverview:\\n\r\n-  Absolutely terrible story\\n\r\n-  Cliches.  Cliches everywhere.\\n\r\n+  The show feels like it knows that it sucks.  \\n\\n\r\nCharacters:  You got your standard fantasy harem setup.  No, seriously.  That's...about all we got here.\\n\\n\r\nLux Arcadia is our main protagonist.  Yada Yada Yada nice guy to all, blah blah blah, holds the ultimate powerful Drag-ride Bahamut who is the plot armor in all of this, fears being hit on by girls...what else, what else...  No, no I think we got pretty much everything.  He's your standard harem MC.\\n\\n\r\nThen there's the harem.  Ok, I'm gonna try and explain each member in 5 words.  \\n\\n\r\nLisesharte Atismata =  Tsundere princess who's mostly dere\\n\r\nKrulcifer Einfolk =  Flat justice who's romantically aggressive\\n\r\nPhilufy Aingram = Childhood friend with D^3 cups.  (Yes, that is D cubed)\\n\r\nCelestia Ralgris = Senpai who's bad with men\\n\\n\r\nSo, basically what we have here is a list of cliches strapped onto various girls.  For the most part, they are the main focus of the series, as Lux helps each one of them before adding them to the harem one by one as the series progresses with really not much else interesting happening.  (Also, what is with these names?  They're really hard to even pronounce.)\\n\\n\r\nOh yeah, there's also his brocon imouto, Airi, and a bunch of other girls that just all sort of jump in the bandwagon in the end too...  Side characters are really just there.  Even the main villain is pretty much just there.  Aside from these 5 main characters (if you can even call them characters), everyone else has a pretty minor role in everything and is just sort of along for the ride.  You won't remember them as you're watching and they'll become nothing but fleeting memories.\\n\\n\r\nOverview:\\n\r\n-  Cast of cliches and tropes  (Hooray for originality.)\\n\\n\r\nArt:  Produced by Lerche, Bahamut's art is actually rather decent.  Its color scheme and overall animation quality are pretty nice, as there is quite a good amount of fluidity and vibrant colors amidst the crap that is story and characters, and the designs for the mechs are actually pretty well designed and nice.  \\n\\n\r\nCGI for the mech movement is also not really all that jarring and actually flowed well with the overall animation.  It's not the best animation, but there is honestly not a lot to complain about for the art of the series.\\n\\n\r\nOverview\\n\r\n+  Good art\\n\\n\r\nSound:  Generic.  It's bad, it's rather pointless.  Just skip it.  All of it.\\n\\n\r\nPersonal Enjoyment:  I've had my fair share of harem anime in the past.  Romance and harem are amongst the most common genres of anime that I watch.  Some shows that have these tags are done relatively well and create a nice viewing experience.  Others...not so much.  This was definitely one of them, and will not be one of those that I'm going to go back someday to watch for any particular reason.  \\n\\n\r\nDid I like this anime?\\n\\n\r\nTo be frank, I didn't like this anime.  I tolerated it.  I've gone to the point that watching crappy harem isn't really all that much of a headache for me, and there really isn't anything to like about this show aside from just how self aware the show feels when it goes by episode after episode.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nNothing...really.  It's a show that knows its a crappy harem, so giving it shit for being a crappy harem wouldn't do anything because that's what it is, and it knows that fact.\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nIf you want to watch a crappy harem, there are plenty of other choices out there, but this is definitely one of the less infuriating ones.  Of course, wanting to watch a crappy harem in the first place is quite an interesting demand of a watch, so I don't expect many who are reading this to even consider putting this on their list.",
            "date": "2016-03-29T18:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 214735,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=214735"
        },
        {
            "content": "Hey folks, this will be a review for Saijaku Muhai no Bahamut. This anime is just alright. That being said I want to break it down some more, but first we need to discuss the number 1 word associated with harems, \"Generic\". People throw around the word generic too much. Calling every harem you watch generic is like calling every variation of plain vanilla pudding generic. The pudding is vanilla flavored whether you dislike it, are tired of it, or any other feelings you may have for it. Its up to you to decide whether or not you like that particular brand or not. Thatbeing said, this brand was not the best.\\n\\n\r\nThe story is not bad, at least it seems like it would have been good if they explained it. However as it seems like this is a filler anime, we have our story sorely unexplained, and serves only as a backdrop. The harem and girl developing side to the story is also relatively bland however leaving this anime as another waste of time IMO. \\n\\n\r\nWe start off per usual, with our male mc somehow finding himself seeing one of the prominent female characters naked. This in turn leads to a duel in which showcases our nice mc and his although somewhat lacking ability surpassing the females exceptional ability through his own inner strength. The twist at the beginning is easy to spot, and our female duelist isn't a red haired fire wielder so it gains a few points for that spot of originality. After this the story progresses in chunks as we uncover secrets of this world that honestly makes little sense and is only slightly explained by the mature mother like sister. Most of the girls have at least one episode dedicated to them and for the most part they are alright. The end seemed anti climatic and lame, many times conflicts are overcome by our mc by his own super ability.\\n\\n\r\nThe art was just ok. The voice acting is always great and the music was alright.\\n\\n\r\nThe characters were a wee bit different than usual, not filling the typical harem roll call which some may like. As I like the typical cast of girls this wasn't impressive to me. The girls also even though having some tragic backstory, somehow manage to seem shallow and clingy. Our mc Lux arcadia was your naive super nice, super op character. The girls don't really matter. They do, as previously mentioned, have a backstory but they play no integral part to the story. They simply come on the screen to showcase lux then disappear until they are required to progress something again. I didn't even have a favorite, though I guess if I had to choose, it would be Phi, who btw shows the most character\\n\\n\r\nI enjoyed this anime as a filler. However there are plenty out there that will probably not like it. If you don't like harems don't bother. If you like harems and need a fix, here you go. I would recommend Isekai no Seikishi Monogatari if you want a better version of this. The ecchi and fan service is rather low for those who dislike this, your rather safe.\\n\\n\r\nTLDR: Not very good, different but not engaging characters, story feels like a backdrop to the anime as a whole, lame ending. Don't bother unless you go into it as a time waster.\\n",
            "date": "2016-04-05T19:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 215624,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=215624"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI think it would be cool to investigate some ruins.\r\nSaijaku Muhai no Bahamut has a couple of them. Strange structures filled with pillars, moss, and secrets yet found. The trade-off, of course, is a lot of danger. Creatures may be protecting the place. Latent, unknown devices may be itching to go off after lying dormant for hundreds of years. So long as I could avoid all of the risk and reap all of the rewards, I would try to trek through one.\r\nSadly, for Bahamut, it does not just have ruins. It’s in ruins, too.\r\nSTORY\r\nBahamut findsLux, a prince of the former Old Empire, enrolled at an academy within the New Kingdom, the order that replaced the older.\\n\\n\r\nThen the anime falls apart.\\n\\n\r\nMuch of what goes on within Bahamut feels like a hodgepodge of material. The anime splits itself up into a bunch of mini-arcs that simply don’t make sense. Information is either shoddily introduced or the happenings seem to come out of nowhere.\\n\\n\r\nThe first arc focuses on Lisha, the princess of the New Kingdom. Her events revolve around the history of the land, how the new system came into place, and the premise itself. But it is all done through minimal amounts of flashback and lots of heavy-handed dialogue.\\n\\n\r\nThe second arc focuses on Krulcifer. Her purpose is to bring the concept of Ruins into the fray. But what they are exactly and what they do for others and even why they are important goes largely ignored by the anime.\\n\\n\r\nThe third arc focuses on Celis. Her arc gets slightly more grounded when actual antagonists make an appearance. Yet said antagonists continue with the slipshod presentation. The giant beasts, Cecil’s female friend Saniya, and the villain who Lux mistakenly thought was his brother get thrown at the audience without much tact. The bigger enemies are meant for bigger action sequences, and the human antagonists are meant to be hated, but, since the context (once again) for them is lost, so is their importance.\\n\\n\r\nThe fourth arc focuses on Phi. Phi’s arc takes on a combination of all of these previous issues simultaneously. Overly quick flashbacks that do not provide enough. Out-of-nowhere ideas like getting a virus that turns one into a monster. More antagonists that, while somewhat relevant, exist just to be there.\\n\\n\r\nThe fifth and final arc focuses on Yoruka. Never around until the final three episodes, this arc gets the short end of the stick. Because Bahamut, realizing that it has not done too much with each girl outside of their respective arc, includes a multi-date outing that gets in the way of the events at hand.\\n\\n\r\nThat’s not the end of it. The whole pointless plotline involving Lux’s inability to pilot his vehicle for very long. The bringing back of a lame villain from the first arc. An ending that does not resolve the tale. It all comes together to put the narrative in quite the disheveled state.\\n\\n\r\nMore narrative problems exist, too. A random side council gets in the way from time to time, but who they are and what they really do is not made known. The robot suits have no real importance to the proceedings except for fighting. Dramatic moments lack emotion because the show flits from one arc to the next without letting events sink in.\\n\\n\r\nNot to mention that the ecchi material, while a welcome addition, serves very little purpose. A small amount of it expounds on their characters, but, on a narrative level, the sexual content has no bearing on the direction of the show whatsoever. It can also tread into repetitive territory; one-too-many bath scenes are had.\\n\\n\r\nEven a lot of the action sees trouble when the anime fails to make the fights intriguing. While they can demonstrate special moves and spurts of coolness, the different abilities, such as reading the future or stealthily moving around, are often replaced with too much gunfire or not enough choreography. (Lux’s abilities in particular, despite using Bahamut, are pretty lame.)\\n\\n\r\nIn short, the entire narrative is a mess through and through.\\n\\n\r\nANIMATION\\n\\n\r\nBahamut’s art and animation fares a lot better.\\n\\n\r\nThe CG rendering of the robots they drive manages to be passable most of the time, so no complaints there. The backgrounds, though, lack much in the way of detail. Changing perspectives and lighting see similar fates. To be fair, Bahamut uses black-and-white coloring for dramatic moments and red hues for threatening ones on occasion, but the techniques do not contribute much.\\n\\n\r\nAnd to be even more fair to Bahamut, it does include a paneling technique for conversation purposes. Usually used when they are in their robots, the anime puts each character in their own panel to make the conversations “closer” than they otherwise appear to be on screen.\\n\\n\r\nThe character designs are easily the best part of the art and deserve some praise. They are attractive with their blue-and-white outfits, black stockings, and gold embroidery. The color and glint of their eyes helps, too.\\n\\n\r\nFor example, Phi’s pink twin-tails, large bust, and lazy expression allow her to become the laidback wonder. Celis’s long blonde hair and taller figure turn her into both a beauty and a leader. And Krulcifer’s long blue hair (so much hair) and sharp face make her out to be the icy queen that she is.\\n\\n\r\nColor symbolism likewise plays a part in the designs; a bonus feature. This type of symbolism exists across most of the characters, but using the previous examples helps here. Phi’s pink means kindness, Celis’s yellow means happiness, and Krulcifer’s blue means coolness.\\n\\n\r\nActual animation tends to be somewhere around average. Action sequences can sometimes raise the bar, but downtime is filled with lots of standing around with minimal movements. At the very least, some of the lewder scenes, like pressed breasts or a steamy make-out session, have the anime trying a bit harder.\\n\\n\r\nCHARACTERS\\n\\n\r\nWhile the characters are nowhere near as problematic as the story, that is not saying a whole lot.\\n\\n\r\nAt the minimum, Bahamut gives (due to the formatting of the narrative) each girl her spot in the limelight. Not a large amount of limelight, but they each get some all the same. Regardless, barely any execution is present in most of the characters, including Lux.\\n\\n\r\nStarting with Lux, he is laughably lame. He hails from the same land as the other girls – the one Bahamut takes place in – but he was a prince of the Old Empire. Because of this and his usage of an inferior robot (earning him the convenient nickname of “Weakest Undefeated,” a trait of his that goes largely unexplored), he initially finds himself estranged in the New Kingdom.\\n\\n\r\nNaturally, as he proves his worth, every girl flocks to him. It’s an acceptable development because part of the point is Lux reaching out to each of the girls in turn. Indeed, he has some kind of connection to their own problems: Lisha feeling worthless as a queen as he did as a prince, Krulcifer and he not having much of a family to turn to, and so on.\\n\\n\r\nWhat’s not acceptable is his overly optimistic characterization and lack of a proper backstory. He shoulders everyone’s burdens, but, because his struggles are never looked at in depth, it makes his actions feel more like a requirement rather than a reaction to the situations before him.\\n\\n\r\nLisha follows similar suit, but she has a bit more depth. She is the upcoming queen of the New Kingdom. Her biggest conflict is the brand she received on her abdomen that evil men of the Old Empire seared onto her before her and her family took over. More specifically, she feels unworthy of ruling the land given that she was abandoned (by her father no less) to that unfortunate fate.\\n\\n\r\nSadly, Lisha, for both instances, is not the one to eliminate the person who branded her. Lux takes that honor – and robbing Lisha of some proper closure. Worse still, the anime pushes her into the side character role shortly following the conclusion of her arc, relegating her to flustered scenes thanks to the other girls. The final fight where she, once again, has to be saved by Lux solidifies how little attention she received.\\n\\n\r\nMoving on, Krulcifer is perhaps the best written character of the bunch. She wins the academy-wide mini-game, asking Lux to be her boyfriend for a week. The move seems harmless at first, but her true intentions are made more clear following a side-street attack. She took advantage of Lux’s kindness, using him as a shield to thwart off a would-be suitor for the time being.\\n\\n\r\nLater on, Lux learns of Krulcifer’s true origins: She is a descendent of the people of the Ruins. The exotic, mysterious nature of the Ruins themselves seeps into Krulcifer’s life as well when she talks about her “family.” She was adopted but not truly loved by her parents, brothers, and sisters because of who she was and where she came from. So she trained herself in the arts, from battling to mannerisms, to try and earn their love. But to no avail.\\n\\n\r\nMuch of this information is given through more expository backstory. But Bahamut at least shows some clout when the duel between her, her suitor, and Lux holds parallels in terms of using others as tools. I.e., her suitor saw her as a tool to further his gains, and Krulcifer (originally) thought the same of Lux.\\n\\n\r\nUnfortunately, the anime lets Lux save Krulcifer from her doom rather than herself, but her actions afterward indicate her newfound fondness of the boy. She becomes very forward, letting Lux know that she will without a doubt be his wife in the future. But she takes her forwardness further with a kiss that was more than just a peck on the cheek.\\n\\n\r\nIn the end, Krulcifer manages to have some complexity to her character (even if some small snags are had along the way). The rest of the cast – namely Celis, Phi, and Yoruka – fall far below her level.\\n\\n\r\nCelis enters the season roughly halfway through, letting everyone know of her main trait: hatred of men. As such, she challenges Lux to a duel where, should she win, he must leave the academy forever. Obviously not wanting such an outcome, and needing some way of getting close to Celis, Lux dresses up as a girl to circumvent Celis’s biggest barrier.\\n\\n\r\nAfter “Luno” picks out a swimsuit for Celis, she opens up to the boy in disguise. She is not really a man-hater. She simply wants to protect Lux by keeping him out of danger in order to make amends, to take responsibility, for “causing” his grandfather’s death.\\n\\n\r\nLater on, Celis nearly gets killed by Saniya (who is now randomly one of the main bad guys because she hates nobles; her strength as a villain is nonexistent). This situation prompts Celis to reveal her feelings of loneliness following the loss of her mentor through her indirect hands. Once again, Lux saves the day. He beats back Celis’s loneliness by fighting for her (and defeating the enemy). This instance of saving makes more sense than Lisha’s and Krulcifer’s since her conflict demands resolution through camaraderie.\\n\\n\r\nA single conversation and a single flashback supports Celis’s character, though, making it rather weak. And while she does defeat Saniya on her own near the end of the season – hearkening back to her sense of responsibility – it is too little, too late.\\n\\n\r\nBut somehow, Phi’s character is even weaker. Before the academy went to the “training camp,” Phi was around for mostly two reasons: ecchiness and kindness. Hugging while wearing lingerie is her norm. But once the Ruin near the island surfaces, she changes.\\n\\n\r\nEssentially, Phi starts to physically weaken. Lux chases after her when she runs away at one point – only to almost get choked out by her. Hayes (the other random villain) informs Lux (and the audience) that the virus within Phi is making her into an Abyss, a beast controlled by the villains.\\n\\n\r\nThroughout her ordeal, Lux learns more about her. She liked Lux from a very early age. She was experimented on to the point of death. She consoled him when his mother died.\\n\\n\r\nPer usual, all of this information is either without context or hastily put together. Sometimes both. She later betrays Lux and the others once the virus begins to fully take control, but (as is the case with every character) she gets out of her conflict not through personal change or of her own volition. (Airi is the one to directly save her this time as opposed to Lux, but it’s still so shoddy.)\\n\\n\r\nAnd just for the sake of completeness, Yoruka performs horribly as a character, too. She has a weird affinity for Lux – pledging herself to him due to a contract from the days of the Old Empire. Her conflict also comes in as poorly written backstory. Shortly after, she gets defeated in about thirty seconds thanks to Lux comparing himself to Yoruka’s younger brother, thereby turning her onto his side.\\n\\n\r\nHer entire character comes off as unnecessary since her inclusion does very little for the rest of the cast (which can be said for nearly all of them) and her impact on the story as a whole is practically inconsequential. But the worst part is that she hurts Lux’s character and, hence, one of the main themes of the cast: helping others in times of need.\\n\\n\r\nDuring Yoruka’s battle with Lux, Lux describes why he chose to destroy the Old Empire, his Empire. Yet Yoruka’s description of Lux’s actions contradict what he has done for everyone else thus far: “Master, you were fighting by yourself for the sake of the Arcadia Empire from the beginning…” Despite how much the anime emphasized the notion that people require the support of others, unlike the girls in his harem, Lux took on his biggest burden alone.\\n\\n\r\nThe other villains barely have anything to their name. Airi stands on the outside saying little else besides “Big Brother.” And Relie’s relationship with Phi does not receive adequate attention.\\n\\n\r\nAll in all, the cast is a wash.\\n\\n\r\nSOUND\\n\\n\r\nThe opening track tends to a lot of noise as the beat, instruments, and singer fail to work together. Its English lyrics, like “fight for the sky” and “to be the soldier,” are silly, too. The only redeeming quality is the middle section where the beat shifts and the vocalist reaches loftier heights. But it is not enough to pull the OP up off the ground.\\n\\n\r\nNext to the character designs, the ending track is arguably one of the only positive traits of Bahamut. The instruments support rather than overshadow the singer. The pace is consistent yet quick. And the ending’s tiny bit of repetition caps off the piece nicely. The ED is not that memorable, but it is certainly stronger than most of what Bahamut has to offer.\\n\\n\r\nVoice acting performs are on a similar level. Perhaps slightly higher. Yurika Kubo as Phi goes kind, tired, and unemotional with an all-in-one voice. Risa Taneda as Celis brings both maturity and class with her way of speaking. And Mutsumi Tamura as Lux plays the young boy role well while being female herself.\\n\\n\r\n(A special shout-out goes to Rie Takahashi as Noct for her constant use of “Yes.”)\\n\\n\r\nAs for the original soundtrack (not including the OP and the ED), it is largely forgettable. Piano ensembles for tenser moments. Rising violins for those triumphant times. And lighter tracks for the lighter scenes. The rising violin piece is slightly cool, but the majority of the OST is very much unimpressive to hear.\\n\\n\r\nENJOYMENT\\n\\n\r\nIf I liked anything about the anime, it was the romance between the different girls and Lux.\\n\\n\r\nAs some may know, I am a sucker for romance. So the content related to it throughout this one made me smile and laugh and be happy. Lisha believing that holding hands was a major accomplishment. Krulcifer’s kiss scene. Celis’s stereotypical falling-on-her-boobs event. Phi splashing water at Lux; she was definitely my favorite character in the show. And Yoruka’s yandere tendencies.\\n\\n\r\nEven the outside romantic dealings I found humorous. For instance, Airi scolding her brother for his “perverted” thoughts and Relie cheering Phi on in the game of love. All of the romance was favorable to me in some form.\\n\\n\r\nEverything else, however, either got on my nerves or made me bored. Lux as a character was uninteresting – much too passive. The robots and action were more so flashy than cool. And the ecchi material, while not unwelcome, could have at least tried to make itself more interesting.\\n\\n\r\nFurthermore, the harem members hardly interacted with one another. It would have been fun to see them have more dialogue between each other than what was given since their traits, likes, and personalities would have definitely clashed and coincided. But that never really happened.\\n\\n\r\nSaijaku Muhai no Bahamut falls apart everywhere. The story is riddled with issues, the characters are incompetent, and areas of the art and music have seen better days. In other words, this is one ruin that has almost no rewards to speak of.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, too many problems to reasonably list\\n\\n\r\nAnimation: Fine, boring artistic direction, about average actual animation, and nice character designs\\n\\n\r\nCharacters: Terrible, Krulcifer is passable, but Lux, Yoruka, and the rest of the cast are beyond poorly handled\\n\\n\r\nSound: Fine, bad OP, good ED, bad OST, above average VA performances\\n\\n\r\nEnjoyment: Bad, sporadic romance kept the experience from feeling like a total drag\\n\\n\r\nFinal Score: 2/10",
            "date": "2017-05-28T19:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 248767,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=248767"
        },
        {
            "content": "Now let me start with that this is going to be kind of long and if you're inpatient you probably won't finish this review and also if you're sensitive to criticism of your favourite show STOP READING\r\nStory (What story?): The story is very generic and has trouble explain things without an exposition dump that last for 2-5 minutes and most things in the world aren't explained like the drag rides. The drag rides are never explained on how they work, all you know is that they can be summoned by a sword device (So are the sword devices made or can they be found throughoutthe world and bought at stores, they never explain how someone gets one or how they summon a drag ride). Also why didn't they explain what the world was like, all we know is that there are knights who use machines they fight in tournaments and war. They could've at least showed how this world is different then ours culturally. Other then that the story is fine and I don't have too much of a problem with.\\n\\n\r\nCharacters: Lux is a fine harem protagonist and I think they did a good job explain his motives and why he's so kind to people, but I don't like how overpowered he is because that just takes away all the tension in the show \\n\r\nThe girl characters are all walking cliches with no personality other then their archetype and a little bit of backstory they is mostly pointless because most of the backstory feels like it's there to fill in space that the director had no idea how to fill in with the main story. I also don't understand why they like Lux, just because he's nice and cute. I'm sorry that doesn't it cut it for a relationship, most people i know don't love someone just because that person is cute or nice they love that person because they know that you can trust them and have fun with them because you know he/she have something in common so then they can enjoy spending time together even more. (Don't say that being a drag-knight is something in common for the girls and Lux)\\n\\n\r\nAnimation: The animation is fine usually it's that the action scenes are mostly just flashing lights and fast moving objects to make the action scene really intense but really its a way for the director to trick little kids into thinking something is cool looking and awesome.\\n\\n\r\nFinal thoughts: The Undefeated Bahamut chronicles is just another lack lustre anime that is able to trick it's audience by doing things that appeal to people that like harem/action shows and actually disappoints me because I actually thought people would realize the flaws in something as bad as this, But you can like whatever show you want and I'm just here to explain why I think it's garbage. So I give this show a 3/10\\n\\n\r\nIf I've made a mistake when I wrote this, please point it out so I can fix it and adjust my thoughts on the show",
            "date": "2016-08-26T20:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 227681,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5616935.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 2,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Awesomelawlz",
                "username": "Awesomelawlz"
            },
            "url": "https://myanimelist.net/reviews.php?id=227681"
        },
        {
            "content": "I don't know where to start with this trash heap. Well, I guess we should start with the MC. Lux Arcadia is naturally an extremely dense harem MC, but he's more than that. He's also a massive bitch boy. It's like there's a spectrum as to how much the male MC gets walked all over. If Arata from Trinity Seven is all the way on one side, then Lux is all the way on the other. It was frustrating to watch, seeing him get thrown around like a rag doll every five goddamn minutes. \r\nThe plot is extremely generic as well, but harems in generalhave awful plots. It's not like you're watching for that aspect. \\n\\n\r\nSpeaking of what you're watching for, I have to say that the ecchi is pretty tame in comparison to other harem shows. Most of it is comprised of Lux getting into dumb situations, which happens at least maybe once every other episode. It doesn't just come out of nowhere.\\n\\n\r\nEach of the girls are stereotypical and generic. The main girl, Lisha, drops the tsundere act in a single episode. I'm not really complaining because the trope is dumb, but it still doesn't Mae any sense. Krulucifer is okay, but all of her advances just get ignored by Lux's idiocy. I'd even call Lux one dimensional, being that there's nothing to him other than the 'impossibly nice and stupid' hero routine.",
            "date": "2018-03-14T21:41:00+00:00",
            "helpful_count": 0,
            "mal_id": 273848,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Taifood",
                "username": "Taifood"
            },
            "url": "https://myanimelist.net/reviews.php?id=273848"
        },
        {
            "content": "Putting it bluntly, this series isn't what the anime community would define as \"good\" as it's not very original and overall isn't anything to write home about. In fact I would say its the epitome of the soulless incessant anime industry pumping out another harem clone for the masses, and not even a good one at that. However, if you're honestly looking for a satisfying story in a genre that's based almost entirely on wish fulfillment fantasies then you only have yourself to blame. That being said, anime like this one DO have their place. I call them \"refresh\" anime, akin to what one wouldcall a \"palate cleanser\" in reference to food tasting. This is because while the different aspects of writing (e.g., plot structure, character development, pacing etc) are typically watered down, they often manage to hit on at least a few points that \"get the job done\".\\n\\n\r\nThat being said, Saijaku Muhai no Bahamut managed to do that for me in the form of Lisesharte. I can honestly and proudly say I have no god damn clue what the hell was happening in the first 2-3 episodes of this anime, but I found myself endeared to Lisha somehow. And it was that, and frankly that alone, that kept me going all the way to ep 10. Along the way I managed to find a liking to actual best girl Krulcifer simply because she had some brass balls and wasn't your typical \"weak in the knees woe is me\" heroine. Everyone else, personality wise, was pretty hit or miss for me and I must add more misses than hits. \\n\\n\r\nFor story I can almost guarantee you've heard it before but essential \"Guy has a past he doesn't really wanna talk about cause some bad shit happened when he meets Girl A whom he ends up in a precariously sexual situation with so they fight it out but he wins which means hes now husbando then Girls B, C, and D start falling all over him because, you guessed it, he's amazing at everything which means that he's reliable because characters without personality are immune to plot contrivances like death and character development that might force him to choose someone interesting.\" Throw in some military intrigue, a mech suit straight outta Infinite Stratos, and plenty of fan service and you have the standard harem anime that is Infinite Stratos..... I mean Bahamut.\\n\\n\r\nArt actually isn't all that bad. I don't have any major complaints here, I think the scenery was well done, weapons and armors were well designed, I can even see that effort went into designing the characters decently. It doesn't break any new ground but that's ok like I've said previously it doesn't really NEED to break new ground because it's not trying to be original.\\n\\n\r\nI'm rather picky about my sound but I am terrible at explaining why, so I can't really say this part will be helpful. All I can say is that there was more than 5 occasions where I sat here and thought \"well that doesn't sound right\" which is a big deal for me. It's 5 more than what's necessary and it really pulls you out of what little story the show does have. \\n\\n\r\nIn summary I give the anime 5/10\\n\r\nLike I said in the beginning, it's my opinion that this anime is like a break between the last good anime you watched and the next one you watch and for that purpose, it filled its role quite nicely. It's not like I hate this anime for that, I really did enjoy watching it. Just if you're sitting on your couch on a Friday night thinking you've found the next great anime for you, you might wanna lower that bar a bit. Or don't, I'm just a dude on the internet. \\n\r\nYou do you boo.",
            "date": "2017-06-27T13:53:00+00:00",
            "helpful_count": 0,
            "mal_id": 251239,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6340954.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/xero657",
                "username": "xero657"
            },
            "url": "https://myanimelist.net/reviews.php?id=251239"
        },
        {
            "content": "The way I look at this show is when you make a bowl of cereal and don't put enough milk in it, its crunchy and hard to continue. There really isn't anything original about this show, or anything redeeming besides there's a bunch of cute girls and one guy, so you can get your male fantasy on, but I mean this show is essentially a diet infinite stratos, and honestly I feel like Infinite stratos at was more enjoyable and watchable than this, and there are just better harem anime out there if thats what you're looking for. The story is basic, fight scenes justlook horrid, same with the monsters and enemies, and the villains don't seem to have motivations that, well, ~seem real~.",
            "date": "2018-08-08T11:19:00+00:00",
            "helpful_count": 0,
            "mal_id": 285927,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7308250.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Lemony_Crisket",
                "username": "Lemony_Crisket"
            },
            "url": "https://myanimelist.net/reviews.php?id=285927"
        }
    ]
]