[
    [
        {
            "content": "It's often strange how some anime can divide opinions on how good it actually is, and the reasons for these divided opinions are often logical and plausible. In the case of Kurozuka however, there is a definite misinterpretation of the story as a whole.\r\nKurozuka began life as a novel written by Yumemakura Baku, which was later illustrated by Noguchi Takashi in manga form. The manga was serialized in Super Jump magazine from 2003 to 2006, before being turned into an anime by Madhouse in 2008.\r\nThe story in Kurozuka is where many of the divided opinions stem from. Many people consider the story to be confusing,especially at the very end, however this can confusion can somewhat berectified by watching the first five minutes of the first episode again. \\n\\n\r\nAt heart Kurozuka may seem to be a story about vampires, love, betrayal, and revenge, however I found it to be more than just the sum of it's parts. Kurozuka is very much a &quot;what if&quot; tale, and the ending is actually very appropriate when considered in this light. There is a lot of action in the story, and the viewer will sometimes wonder what the hell is going on (as I did), but if you stick with it then you may find the story strangely captivating. \\n\\n\r\nThe art and animation are top notch in this show. Madhouse pulled out a lot of the stops when designing the characters and animating the show, especially during the numerous action sequences. CG is incorporated very well overall, with only a few minor faults that are barely noticeable. The characters are designed very well on the whole, and I especially liked the incorporation of traditional Kabuki players into the series as it gives the show a far more surreal feel. Each episode begins with a small kabuki play which recounts the events of the previous episode, and I found that the designs, animation and sound for these scenes were excellent.\\n\\n\r\nThe sound is another excellent area, especially the music and sound effects. The BGMs never overpower the sound effects during the action sequences, and the use of non-traditional animation techniques for these sequences made them exceptional. \\n\\n\r\nThe VAs are, again, excellent. Paku Romi is excellent as Kuromitsu, whilst Miyano Mamoru's monotonous tones are strangely suitable for the amnesiac Kurou. The other VAs are just as good as the two leads. Fujiwara Keiji, who plays Karuta, manages to imbue his voice with a certain &quot;roguish&quot; quality that suitably matches Karuta's design and personality.\\n\\n\r\nThe characters are actually one of the bad things about this show, however I say this with a certain amount of trepidation. On the whole the characters are well done, however there is very little development given to them - they're just there for the most part. However, this would only really be a problem if you were watching this as a straightforward story rather than a &quot;what if&quot; tale. That said though, even a &quot;what if&quot; tale would need it's characters developed to a much greater degree than Kurozuka manages to do. \\n\\n\r\nThat doesn't mean I hate the characters though. I thought the characters were. on the whole, fairly decent. My problem is that I would have liked to have known more about them as characters - their motivations and such.\\n\\n\r\nKurozuka is a great action anime, however it can be very confusing at times. There is a definite story there, but many people will find it confusing for the most part, especially as the story doesn't really hint at what's really going on until the end (suffice to say I found it a very &quot;Dallas&quot; moment).\\n\\n\r\nThis is a good show to watch if you're after some good action and aren't overly concerned with the story. It may not be everyone's cup of tea though, especially with the scientific angle it takes on the vampirism issue.  This is a story about love, loss, betrayal and revenge, and these aspects of the show are very much at the fore. However there are some elements of the show which can leave you wondering why a particular event happened in the first place, and this is only compounded by the continued lack of an explanation.",
            "date": "2009-01-10T13:18:00+00:00",
            "helpful_count": 344,
            "mal_id": 11305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=11305"
        },
        {
            "content": "The animation seems to overpower an exaggerated plot. Viewers who crave cyberpunk animations consisting of time lapses and vicious fight scenes will have a pleasant taste out of this series. Yet there is much of the plot that may leave the audience hungry. Once you take a bite out of my review, you'll understand what I mean.\r\n~[ S T O R Y ]~ [6]\r\nKurozuka focuses on the concept of immortality along with the quest for the meaning of mortality. Initially, I had assumed a vampiric aspect came into play [Kuromitsu sucking blood for example]. As the series progressed, the aspect grew more scientific. Here wehave the main character, Kurou, wanting to spend all eternity with Kuromitsu. I once thought it was a romantic struggle between the two protagonists, yet the plot grew more confusing later on. What with the beheading of Kurou to Benkei's murderous motives [due to his desire of having Kuromitsu to himself] to the Resistance against the Red Emperor's Army, just so many subplots made Kurozuka more like a staccato piece than a horror orchestra viewers probably wanted to witness. Even the end itself leaves so much to the imagination that viewers like myself wonder whether the creator intentionally wanted to mess with our minds and trigger heated discussions, or something else we have failed to notice. Other than that, the story could've been portrayed better...\\n\\n\r\n~[A R T]~ [10]\\n\r\nPost-cyberpunk meets the essence of ancient 12th century art. The serenity of the 12th century atmosphere collaborating with the post-cyberpunk appeal of the anime was rewarded my thumbs up. It brought the animation out more, gluing me to my seat as I endured visual ecstasy. Even the swift fight scenes were brilliant, as expected from the gifted Kurou as well as those involved in battle alongside. Any fan of Death Note can understand that the art between the two animes are strikingly similar. Furthermore, the art was not overexaggerated at all. They were on the dot with their specific time periods, making the anime successfully attractive.\\n\\n\r\n~[S O U N D]~ [9]\\n\r\nFrom the miraculous terror of the opening song to the soft tranquility of the ending, Kurozuka had played its music well. The flute and drums matched the ancient liveliness of Japanese culture. The instrumentals had presented the mood well as well as portraying the feel of scenes such as romantic moments, battles, times of agony, despair, hatred, et cetera. I knew what kind of scenes I was expecting from the sound. Nicely done.\\n\\n\r\n~[C H A R A C T E R]~ [7]\\n\r\nI gave the development of characters a 7 due to the fact that I had expected more from their transformations. Moreover, I expecting a better explanation of the immortality concept. The manga explains more of it whilst the anime has left gaping holes for the viewers' minds to fill. Though Kurou was inconspicuous and monotonous in his expressions, we did have a sense of what he felt inside through his short monologues. I did hope to understand a little more of Kuromitsu, seeing as the series focused more on Kurou's thoughts than anyone else's. Romi Paku and Mamoru Miyano portrayed the voices of their characters well enough for me to give this category a high mark. The rest of the seiyuu's deserve credit. I suppose that the shortness of the series is to blame for cutting short every character's expected developments.\\n\\n\r\n~[ E N J O Y M E N T &amp; O V E R A L L]~  [7]\\n\r\nJust to be fair, I'll award this anime a 7. Were it to improve in its character and plot development, it would've been awarded a higher grade. Though I do give immense praise to the development of the actual animation. It is different from any other post-cyberpunk anime to exist within the Japanimation realm. The rough grunge scenes, the splash of eccentric hues in the opening and battle scenes, the ancient softness of the 12th century lifestyle - it was all done quite well. Furthermore, the series will leave you thinking on what to value - life or time. Kurozuka is meant to represent the connection between time and life. The two walk hand-in-hand. Without life, there is no time. Without time, there is no life. One affects the other. They both need each other. What is more valuable? Immortality or living to the last minute? That is up to you to decide.",
            "date": "2008-12-30T21:51:00+00:00",
            "helpful_count": 77,
            "mal_id": 10837,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/125181.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SilentMuse",
                "username": "SilentMuse"
            },
            "url": "https://myanimelist.net/reviews.php?id=10837"
        },
        {
            "content": "Kurozuka is a lot of things but for the most part it’s a Seinen, Historical, Sci-fi, Action anime jam packed full of high-octane Rated-18 action to please action lovers. However like most series, this one starts of grand but eventually wanes as it progresses.\r\nIt begins with the main protagonist, Kurou being pursued for reasons not explained and one intense action sequence later, he and his companion seek shelter in some mysterious woman’s home. Kurou soon develops feelings for this woman named Kuromitsu but soon after he discovers her dirty little secret. Another insanely gruesome action sequence later and the real story begins, as Kurou embarkson an all new journey of immortality. All I can say is that the 1st episode was awesome but soon after that the biggest flaw in the story soon appears, as early as in the 2nd episode. It is the story’s timeline and when dealing with this concept of immortals living through the ages, it doesn’t help when things keep jumping from period to period, making it easy to lose track of what’s going on in the story (until the action sequences wake you up). Heck by episode four, I gave up on trying to figure out the chronological order of events and just followed Kurou on his unexplained journey to find Kuromitsu. The thing is that the story was actually decent but it was executed poorly, with chucks of major plot points left unexplained.\\n\\n\r\nAnother thing wrong with this short series is its characters. Sure the main 2 were fairly interesting but Kuromitsu was as much of a mystery to Kurou as she was to those who watch this. As for Kurou, he would have been more interesting if he actually got some back-story and maybe showed some emotion, instead of those random outbursts. There are actually other characters to mention but they are so bland and uninteresting that I even struggle to remember their names 10mins after watching an episode.\\n\\n\r\nWith all the bad stuff taken care of, discussing the animation is a nice change in direction, because it can be described simply as awesome. This anime seems to go for very aesthetically pleasing environments with a sort of grudge textured look and the heaps of CG that actually goes well with it. Not to forget the reason why I think of the animation as perfect, which are the action sequences that have obviously been influenced by a lot of things. As for the music the soundtrack is certainly fitting for the series; with a mixture of tranquil tunes and high-octane beats for any given situation.\\n\\n\r\nOverall Kurozuka proved to be an enjoyable hack ‘n’ slash fest but there are more than enough action sequences for even an action lover to be bored with and having a poorly executed storyline as an alternative isn’t good at all.  Trying to make sense of the messy story is like trying to solve a sudoku puzzle; make one mistake and you’ll have to backtrack to where things make sense. Having a lacklustre ending doesn’t help either but those who are able to ignore these flaws would still enjoy Kurozuka for its awesome action and interesting concept.\\n",
            "date": "2009-01-11T14:29:00+00:00",
            "helpful_count": 39,
            "mal_id": 11372,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=11372"
        },
        {
            "content": "“Majestic, bizarre, violent and dark. A surreal and poetic journey that turns into something more profound than what it looks like”\r\nREVIEW FREE OF SPOILERS!\r\n-STORY: 8-\r\n\"KUROZUKA\" it’s a well-founded and rich story. Its narrative could divide people, some by saying it’s boring and unadorned –or complicated- and by others –like me- saying that is meaningful, metaphorical and gorgeous.\r\nThe story of this show could be like a stream, whether it calls you, takes you and embraces you leading you swiftly –although, trough some “what the hell is happening here?” moments- across the tale or it rejects you for it isn’t a plain and simple story of vampiresand war, it is complex. \\n\\n\\n\r\n-ART: 8- \\n\r\nThe art depicted in this show is marvelous. The designing of the characters is believable and the action scenes are appealing and not exaggerated like most of the vampire/action shows out there.\\n\\n\\n\r\n-SOUND: 10-\\n\r\nThe voice acting is a jewel. It is passionate, it is deep. It’s calculated for the type of show that “KUROZUKA” is. The voice actors are believable since they’re transferring the feeling of solitude shown in the show through their voices.\\n\\n\r\nMeanwhile, the soundtrack has a dream-like ring to it. It’s a delicate mixture of instruments. It is cold, sad and dark, like a mirror of the situation the surrounds the characters and their own feelings.\\n\\n\\n\r\n-CHARACTER: 7-\\n\r\nThe deepness carried through most of the show –superbly if I may add- in most of its features: Script, voice acting, art and soundtrack is something amazing, yet lacking within the character department. Don’t misunderstand me, the characters are well-defined, distinct and incredibly well depicted –and I liked them, to be honest- but there’s an important aspect that the show didn’t display, the “backbone” of the characters –or in other words, their backstory and development-. To put it bluntly the characters look like they’re just there, like a superfluous, convenient and momentary entertainment without a direction or reason, just a cause. But let us remember that this “cause” this “reason” IS the backbone and the main focus of the story, making the character development/background faintly unnecessary. After all, we as viewers we want to know about the characters we are watching, we want to get “closer” to them, we want to understand the: “why’s, the where’s and the when’s” of each characters, even if the story doesn’t really depend on such things, which is clearly the case of this show.\\n\\n\\n\r\n-ENJOYMENT: 7 & OVERALL: 8-\\n\\n\r\n“KUROZUKA” is a difficult show to watch. As I said before is complex, and for moments it looks like the show doesn’t know where its leading, but the end it’s what makes it a whole. Is it enjoyble? Yes, a lot. But you need an open mind and most importantly understand that this show is meaningful and not just action after action scene.\\n\\n\r\nA really amazing show.\\n\\n\r\nThanks for reading!",
            "date": "2014-11-05T15:01:00+00:00",
            "helpful_count": 33,
            "mal_id": 167531,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4195751.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GonWithARose",
                "username": "GonWithARose"
            },
            "url": "https://myanimelist.net/reviews.php?id=167531"
        },
        {
            "content": "This anime pissed me off enough that I wanted to review it. The story opened with great visuals and fantastic animation. I loved the kabuki openings which summarized previous events. In short, Kurozuka started with great promise. \r\n*If you're worried about spoilers, you should probably stop reading here.* \r\nAlas, that promise was quickly broken. I don't mind a bit of confusion when it serves the purpose of the story, especially when it originates authentically from the character's perspective. There's a limit, however, and Kurozuka drives past it, swerves off the road, careens down a mountainside, and explodes in a fantastically animated and entirely gratuitous fireball.\\n\\n\r\nI watched to the end, and as Kuro promised, all was revealed.  Unfortunately, the ending leaves us with a plot hole so large, Karuta could drive his magic bus through it. (Apologies for packing my driving metaphors so closely together.) So are the two main characters immortals or are they immortals and time travelers? Clearly, there's a time \"reset\" that happens in the last episode. This reset seems to fall into the category of \"wouldn't it be cool...\". In answer, \"No, it wouldn't.\" Absolutely nothing in the previous episodes suggests a time spiral or Ouroboros or that little infinite loop of paper whose name escapes me at the moment. This is laziness or stupidity on the part of the writers. \\n\\n\r\nThe show should be praised for it's interesting take on vampire folklore. And also for bringing a genuine touch of horror to the fate of the main character at the end. In spite of these good things, where's a barge of cliches loaded in this anime. Here's one I'm f-n sick of: generic demonic bad-guy shoots tentacles or spikes from his/her body. This anime does this not once, but three frickin' times with different characters. That's when the show became risible to me (or was it when Karuta turned his bus into a rocket and blasted up a nearly vertical drawbridge...). \\n\\n\r\nSpeaking of characters... What characters? Another barge of cliches: The femme fatale. The dashing rogue. The hooker with a heart of gold. The amnesiac hero. Shall I go on? The \"best friend\" betrayer. The nature-magic wise-woman. The gun-wielding bad guy acting as foil to the katana-wielding good guy. The two main characters never really say much of anything. Why should I give one damn about anyone? When a certain chick gets bulls-eyed near the end, you know what I felt? Nothing. Not a thing FOR HER. I felt massive annoyance at the writers for f-n with me, but that's it. This is bad storytelling, simple. I don't have to like or love the characters, but I do have to be interested in them. Did not happen. \\n\\n\r\nWithout a compelling story and characters whose fates we're interested in, excellent art and animation is purely gratuitous. I'm sorry this anime sucked; I wanted to like it. \\n\\n\r\nYour mileage may vary.",
            "date": "2011-07-05T07:39:00+00:00",
            "helpful_count": 24,
            "mal_id": 38701,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/58978.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ravenlok",
                "username": "ravenlok"
            },
            "url": "https://myanimelist.net/reviews.php?id=38701"
        },
        {
            "content": "Lazyman reviews.\r\nAlright, so this is about an Anime called Kurozuka. Rated R -17+ and up For it contains: Mild nudity, Suggestive Themes, Boring Violence, Repeated Scene Effect, Ear Bleeding Laughter, Vampires of The Non-Twilight Kind, Zombies, Demons, Mutants, The Quest to Tap it and Blood. Lots of blood. Not so much Gore just blood. They seem to censor or magic pixie fuzz any or all of the gore out.\r\nAs we go along it’s good to know that this show aired back in 2008 and was animated by Madhouse studios. Go Madhouse! Another thing to notice is the extreme skinny people and bazaar limb length thatyou will see quite often in this show.\\n\\n\r\nRight off the bat you’re slammed with the power of the Annoying Red Haired Masked Man With Fan while he spurts out what seems to be haiku’s sung with extreme Old Man’ness. It doesn’t get any better… just more reoccurring.\\n\\n\r\nNow I shall touch a bit on the shows Intro. I’m not a fan of screamo or screecho or whatever the hell people wanna call it. It sounds like someone was trying to sing while getting their entire head shoved into a fully functioning blender. The beginning song only fits because of the fantastic animation along with it. Yup, that’s about it.\\n\\n\r\nAs for the outro, if you haven’t already muted or closed the player then you will hear the sounds of a slow paced song set to ease your heart as you escape the sounds of the intro.\\n\r\nBut you will still quickly move onto the next episode as the voice starts to slowly annoy you also. It’s like softer, slower paced screamo. It still doesn’t work. Some people out there might like it. Good for you. But this is mah lazyman review and my opinion is “Me No Like”. Mmmkay?\\n\\n\r\nThis show by far has THE MOST ANNOYING RECAP EVER DESIGNED.\\n\r\nRemember that Annoying Red Haired Masked Man With Fan I mentioned earlier? Of course you do, How could you ever forget him. Well, he reappears every single episode.\\n\r\nThat’s right, out of the 12 episodes of this show, you see his ugly mug a minimum of 12 times. You actually see him more than just 12 times but I’m giving you a heads up on what to expect. But hey, at least you get to watch him throw that fan in the exact same way each and every episode and watch that fan land perfectly in the center of their organization symbol each and every damn time. Oh… wait… That’s pretty damn annoying as well now that I think about it.\\n\\n\r\nMoving right along the action of the show is almost enough for some to continue watching until the end. For others, you will most likely be dropping this by episode 3 if you haven’t already. The beginning was still pretty good at keeping you interested in the things you don’t quite yet understand about the show. But even that has a limitation.\\n\\n\r\nThey try to pick up the pieces of the action by adding in slow motion and more Vampire like fight scenes. Which I must say, they did damn nicely. Although the whole inverted colour or heat detection mode is like you went back into the 60’s for some fun with colours. Ignoring the fact they almost all have the bone structure and appearance of malnourished basket ball players, the animation is freakin’ sweet. You can notice parts where they got a bit lazy and threw in a quick flash of white or black before they would change to the next part. It saddens me to see that potential go down the drain. Whos to say you can’t have good action in a romancy kind of theme? Well, for now, you might be right. At least in the case of Kurozuka.\\n\\n\r\nThe characters start off as interesting works of art and are slowly left in the pools of blood you will most likely see them lying in. Kurou is a love struck fool who just happens to have the ability to kill anything he wants. Kuromitsu is a siren-vampire-terminator who just happens to accept guests. Benkei… is a monk. The Red Emperor is a man of song. Rai is a rebel prostitute. I could go on but the list is long and the jokes only get worse.\\n\\n\r\nAt the end of watching it all… I felt the ending was pretty damn bleh. Sure, I understood the bits the show left everywhere for us to pick up and understand like a trail of candy eggs. It just didn’t solve anything it may have explained it but there was no actual solution. It’s like hitting the reset button instead of wondering why you have to hit that button and working at the problem from there.\\n\\n\r\nThe Story gets 6 Rusted Samurai Swords.\\n\r\nThe Animation gets 8 Gallons of Blood.\\n\r\nThe Sound gets 5 and a half Screams of Terror.\\n\r\nThe Characters gets 6 Close Up Shots.\\n\\n\r\nOverall the show should hold a 7 but it falls short of that mark and is left with the bitter taste of 6 Fans of the Red Emperor.\\n",
            "date": "2011-08-14T20:59:00+00:00",
            "helpful_count": 15,
            "mal_id": 41513,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150727.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MasterOfLazyness",
                "username": "MasterOfLazyness"
            },
            "url": "https://myanimelist.net/reviews.php?id=41513"
        },
        {
            "content": "tl;dr - Kurozuka is a bad anime. I really support and like some points made, but the show itself is of pretty poor quality at most times.\r\nYou don’t know what to expect when you dive into Kurozuka. While this is true for a lot of other anime as well, Kurozuka is a special enigma. Being about vampires (especially the main leads) can turn people off, seeing how vampires are often portrayed nowadays. Sadly, thoughts hop to Rob Pattinson as Edward in the cringe-inducing soft pornography for girls known as Twilight. Sure, Twilight isn’t the only sinner, but due to it’s popularity, it is the moststand-out. Onwards to Kurozuka, then.\\n\\n\r\nOn first on-look, Kurozuka seems to be a love story about vampires, set in Feudal Japan. That preconception is quickly smashed to bits after the first episodes as we skip to a bleak future version of Japan that has been a-bombed. Back in the past, our hero Kuro (known as “Minamoto no Yoshizune”, a very famous and popular Japanese literature hero) was fleeing into the mountains, and came upon the lodging of Lady Kuromitsu. He and his close ally Benkei were allowed to stay under the condition that they do not approach nor enter Kuromitsu’s room. Of course, that promise doesn’t mean all too much and Kuro finds himself outside the mysterious woman’s room, where he sees her biting and drinking the blood of a man. The place is attacked, and Kuro is badly hurt helping his hostess. The two had quickly became attracted to one another, and Kuromitsu offers Kuro eternal life with her. Kuro accepts. Then the focus shifts to the future where Kuro has become separated from Kuromitsu and ventures to find her. He instead meets Karuta and Rai and becomes embroiled in what is basically a civil war between the Red Army and the rebels, both fighting for the very prize Kuro seeks: Kuromitsu.\\n\\n\r\nI was pretty excited to watch this, as it felt like vampires were treated as a big deal and it also seemed like a cool set-up for a powerful romantic saga, but alas, all the potential amounted to jack shit in this absolute train-wreck of a series.\\n\\n\r\nThe series jumps from different time periods, usually at the start of episodes, without giving the viewer much warning or explanation, which is the major flaw of the series in my opinion. It’s very hard to get a grip on the characters as is, so there’s really no need to confuse viewers additionally.\\n\\n\r\nIt’s hard to gauge what exact powers are afforded to the vampires of the series, as Kuro just seems to go all Goku on people at times when he needs to put another gear in. Besides obviously being more powerful than normal humans, there doesn’t seem to be much to vampires, other than whatever odd time dilution Kuro can cause when convenient. It’s never really explained what they can do. The reveal of how they work is also incredibly slow-played, so there’s not much in the way of flavour being given to us, except for some bursts of information at times.\\n\\n\r\nAs is the case with the vampirism angle, characters in the series don’t really develop. They’re very static in personalities and in what they do. Not even the main character ever develops, he just learns more about who he was. Frankly it’s very disappointing, because when things happen to our tragic heroes, it’s hard to care about them as they’ve just been one-dimensional plot-points. That can work if you have strong characters to begin with, but as noted, these characters are dull as hell. You also get some unintentional comedy in the absolutely bonkers scientist with a penchant for torture, who starts quoting Stoker (because you have to fucking shoehorn that into a vampire show like your life depended on it) and Tolstoy, and is generally weird as hell.\\n\\n\r\nThe story is equally odd. Parts of it just comes and goes as it pleases, like there’s a revolving door of relevance. It really is hard to care about what is happening when you don’t grasp the relevance of events to one-another. Characters just do complete one-eighties in order to provide more filler before the end finally arrives. It really is a shame, because it felt like it was to be a show that made vampires rather cool again, but the amount of plot-holes and contrivances really do get in the way of enjoying it. All of the reveals towards the end just made me laugh out loud with their increasing craziness, until we arrive in bizarro-world come the ending.\\n\\n\r\nVisually, it’s very pleasing for most of the time and there is a lot of incredible imagery, but then you get some absolutely retarded character designs that feel like they invaded from another series.\\n\\n\r\nThe sound design is pretty decent, but many characters in the series are woefully miscast and a lot of the performances are really bad. The soundtrack, however, is pretty damn awesome. Both the OP and ED are great.\\n\\n\r\nNow, I’ve been shitting on Kurozuka a lot, but the final episode shows up and delivers the best possible ending the series could have had and I really freaking loved it, so I'm ultimately torn on where to go with the series; good or bad? Ultimately, with all the tomfoolery, I’ll go with bad, but there’s certainly enough good in here that a person that disagrees with what I found negative would find this to be a damn good show. It also increases my frustration with the series’ unfulfilled potential. The run-time of the entire thing is way too long relative to what it’s trying to convey. Honestly, remake this in film-length and condense the story a bit, and I’ll watch the hell out of it. I’m totally behind the point it makes about love and selfishness and I actually came away from it rather liking the vampire concept, but the length and general poor quality makes most of the series unbearable to watch.",
            "date": "2014-03-21T13:37:00+00:00",
            "helpful_count": 14,
            "mal_id": 136351,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20333.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Purjoloek",
                "username": "Purjoloek"
            },
            "url": "https://myanimelist.net/reviews.php?id=136351"
        },
        {
            "content": "I liked this anime, but had difficulty in rating it. In some ways, it is either more or less than the sum of its parts, depending on the point of whoever is watching it.\r\nThe story is presented in a manner which involves a lot of flashbacks, dream sequences which are not clearly distinguished from reality, surreal imagery, explicated metaphor... in short, it is overwhelmingly confusing.\r\nEven after watching the entire series, all I can say about the plot is that it is designed to mess with my head... anything else is questionable, so even if I wasn't wary of spoilers, I can't really give you anydetails (I mean, I could, but, not really).\\n\\n\r\nIf you've watched Serial Experiments Lain, or Memento, then this probably belongs in a similar category in terms of the way the story is presented as a plot. \\n\\n\r\nSound, Art:both Great! (9/10)\\n\\n\r\nThe sound and art have very high production values... but I would put the Art one step below perfect because, although somewhat intentional, they are so many time-jumps that not only the story, but even the action is at times difficult to follow. \\n\\n\r\nThe characters... (8/10)\\n\\n\r\nwell, they are somewhat well developed but I really had to think about that for a bit. For certain, it is an interesting way of presenting common themes by changing various details... so I will just say that the characters are very well thought out, but are overshadowed a bit by the non-linear presentation and even the \"flashiness\" of the art style. \\n\\n\r\nThey are few \"slice of life\" moments in this series, so it is hard to connect to even the main characters... even when background history is being given, it is usually in the midst of a battle or tense situation. \\n\\n\r\nEnjoyment... (7/10)\\n\\n\r\nOuch, my head hurts! \\n\\n\r\nI appreciate that the production values were high, and the plot was well thought out and spans a vary long time... but at the same time, I had to just stop the series and go to watch something else, whilst my brain adjusted to \"normal time flow\", least I start walking backwards or something.\\n\\n\r\nIn that sense, I enjoyed it less than the more linear (in terms of time presentation, but perhaps, more incomplete in terms of story details) Serial Experiments Lain... and there was so much going on, involving several major \"players\", that I actually found Memento easier to follow.\\n\\n\r\nOverall... (8/10)\\n\\n\r\nI would say this series is very good, but its presentation pace will overwhelm even people who like non-linear story presentation (anyone who claims different, just shut off their brain or something and is lying to themselves), and the ambiguous ending sparks more questions... unlike Serial Experiments Lain, which I have re-watched several times, I am deeply hesitant to even glance at Kurozuka again... it does something to stretch the mind, but perhaps in ways that it would be best not to attempt too often.\\n\\n\r\nIf \"Ringu\" and Serial Experiments Lain are mindfucks, then this is a hardcore mind-gang-rape... but by a very beautiful flock of fangirls. \\n\\n\r\nOr something. \\n",
            "date": "2009-03-14T11:19:00+00:00",
            "helpful_count": 12,
            "mal_id": 13175,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/156353.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/D5",
                "username": "D5"
            },
            "url": "https://myanimelist.net/reviews.php?id=13175"
        },
        {
            "content": "The first two episodes of this anime really gripped me, even after the third i was left thinking that the story had such promise, it could turn into one of the best animes this season, sadly i was wrong the story is set wonderfully and deteriorates from there. Throughout the series you'll find a number of overly glorified battle scenes, (since kuro is a vampire) you can expect quite a few unrealistic feats to dash across your screen. Even as i write this review i wish i could go back in time kill the writer and take his job.The sound is solid not the best I've heard I thought the opening was iffy, The characters are not developed properly the story's many strings just dont tie together, i remember the end of episode 12 felt like being jabbed at with the bristles of a dirty broom (each representing a loose end). I suppose if u liked the senseless battles that afro samurai threw at you, you'll like kurozuka. But if youre looking to enjoy an anime storywise .. then steer clear of this catastrophe",
            "date": "2009-01-15T02:14:00+00:00",
            "helpful_count": 9,
            "mal_id": 11506,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/47962.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/apatch3",
                "username": "apatch3"
            },
            "url": "https://myanimelist.net/reviews.php?id=11506"
        },
        {
            "content": "I first watched this anime a few years ago out of boredom when I couldn't find anything else to watch, and I'm so glad I did! Now it's definitely ranked as one of my favorites. \r\nThe balance of action & romance is perfect. The storyline is interesting, and leaves you wanting more. Rarely if ever a dull moment. It's definitely one of the first I would recommend.",
            "date": "2013-05-30T19:36:00+00:00",
            "helpful_count": 8,
            "mal_id": 99045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/504541.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/babykiwi",
                "username": "babykiwi"
            },
            "url": "https://myanimelist.net/reviews.php?id=99045"
        },
        {
            "content": "Kurozuka is extremely different in the way the story is presented. Do not take that statement lightly. \r\nAt the beginning of this anime (for what seems several episodes) it is extremely hard to stay interested because of the perspective the story. It does however, change so that the watcher can follow along and begin making sense of the earlier scenes. \r\nConsidering the actual content of the anime, the story was interesting with intriguing art. The action primarily in the middle of the anime is fairly graphic, which was almost unexpected... But very entertaining.\r\nSaying those few things, I appreciate the different approach in story telling, howeverdaunting it was. It almost makes me think they did it so the watcher would be as dazed and confused as the main character. I stayed long enough to get past it because of the art and the hints of mystery at the beginning. The mysteriousness was redundant, but the redundancy serves a purpose.\\n\\n\r\nOverall I would recommend this more to those who are primarily interested in action, thrillers or just up for something different. I do think it is good though, and worth watching for its other aspects. Even though it contains supernatural mystery the action is what you would probably stay for, because the mystery takes a bit to reveal itself... AS a mystery. \\n\\n\r\nOverall: I give it a modest 8 for its uniqueness, art and story",
            "date": "2014-04-27T23:07:00+00:00",
            "helpful_count": 8,
            "mal_id": 141611,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3727805.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Callow",
                "username": "Callow"
            },
            "url": "https://myanimelist.net/reviews.php?id=141611"
        },
        {
            "content": "What a terrible terrible anime. Sure the first 2 episodes were terrific. Great gore, great action and a bit of romance. However everything goes downhill. The anime is very confusing. There's many flashbacks which appear without warning which is confusing. Powers and abilities of all of these characters are poorly poorly explained. There's times when the anime doesn't make sense. The anime is a trainwreck.\r\nBut to make matters even worst the ending is a catastrophe. You have not a clue what's going on at all. You don't know if time reset and a continuous loop happens, you don't know whether time is continuing or whetherKuro actually gets that actual body. I'm sorry for putting in spoilers but this anime is a bellyache. I wouldn't recommend watching this EVER!",
            "date": "2014-09-11T13:37:00+00:00",
            "helpful_count": 8,
            "mal_id": 159941,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/BobDiesel",
                "username": "BobDiesel"
            },
            "url": "https://myanimelist.net/reviews.php?id=159941"
        },
        {
            "content": "From the first scene I felt like I'd seen the anime before. By the second or third episode I confirmed in my mind that I had indeed already completed Kurozuka & my uncertainty wasn't due to confusion or imagined deja vu- but due to themes of eternity, reality, fate and life and death and life again being wonderfully executed in the story telling. The unclear progression & perception of truth all succeeded in making this Alice in Wonderland- Ergo Proxy journey enthralling (Brownster's 'engrossing' was well chosen). Reaffirming D5's  ' hardcore mind-gang-rape' description as very true.\r\nRating the anime was difficult when it came toEnjoyment as no terms seemed close to relevant other then 'great'. There were many fight scenes leaving me in ecstatic awe (I LOVE sword fight scenes and Kurozuka definitely satisfies!)  but I don't think the true story lends itself to 'enjoyment', unless you're masochistically-orientated as the love and life in kurozuka are dark (few happy bunny moments) but beautiful nonetheless. \\n\r\nOnce I started I knew I had to watch it throughout and am happy I did. \\n\r\nI find it hard to agree with people complaining about the 'confusing' 'messy' plot as it seems perfectly suited. Definitely worth watching and bring tissues for the fight scenes- they are HARD :P",
            "date": "2010-03-06T18:27:00+00:00",
            "helpful_count": 7,
            "mal_id": 23769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Floydogenic",
                "username": "Floydogenic"
            },
            "url": "https://myanimelist.net/reviews.php?id=23769"
        },
        {
            "content": "Kuro means black. Or so I've been told. \r\nAnd I think Kurozuka means black coffin. Maybe.\r\nAnywhoo.\r\nLet's say you're a toppled Japanese Lord running from demonic usurpers in the chilling mountains with your seemingly loyal retainer and stumble upon a large manor presided over by a beautiful woman who is all alone in this dangerous climate. Moreso, this woman is completely willing to let you spend the night on one request: don't go into her personal chambers only to discover her getting her freak on with a bloody corpse...\r\nClearly no good will come of wanting to have sex with her and be her eternal lovemonkey slavebecause she'll cut your head off and you'll be forced to time travel through apocalyptic worlds in endless search of this demon who on one hand lavishes her love upon you and on the other endlessly eludes you.\\n\\n\r\nSo that's the premise. Kuro, the retainer dude, becomes an immortal vampire head thing, and searches for the mysterious Kuromitsu vampire chick across time--falling in love over and over again. There are some Jade Empire guys who eternally seek her because her blood can make you immortal, but there's a catch (isn't there always). And there are some recurring characters that span the ages, but it's all confusing and contrived, and irrelevant to the main story.\\n\\n\r\nThe style of this is clearly retro cyberpunk with new production values. There's a hint of Ninja Scroll and Fist of the North star in the character designs, backdrops, and apocalyptic wasteland. There is over the top bloody violence, and the fight scenes are nicely done. Also, there is the classic theme of a ragtag band of adventurers seeking a princess in a castle taken by a dark lord (which more or less describes the generic cast of extras that follow Kuro along--but most have amusing traits, like the quiet and ruthless Kuon who seems to remember useless details about kids cartoon with great enthusiasm). \\n\\n\r\nThere isn't much to the plot, just the endless pursuit of Kuromitsu and the typical Demon-play we've come to expect, but the character design is creative and the pacing is decent. There are flashbacks, which add to the timeless plight of Kuro and his amesia (the core of the premise), but overall this is just a grindhouse flick so there's little to fault on something that isn't being too pretentious.\\n\\n\r\nOf note there's an amusing episode that totally goes overboard in regard to a bag of shit and a wheelchair (you may not want to see it, now that I think about it). \\n\\n\r\nWith all that said, the ending polarizes you. I hated it the first time, the second I decided to accept that it wasn't that bad to reiterate the central theme of pursuing an unreachable goddess.\\n\\n\r\nMake up your own minds.",
            "date": "2009-04-16T08:25:00+00:00",
            "helpful_count": 6,
            "mal_id": 14220,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/171075.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tentacle_raep",
                "username": "tentacle_raep"
            },
            "url": "https://myanimelist.net/reviews.php?id=14220"
        },
        {
            "content": "Warning to anyone planning to watch this: DO NOT EXPECT THE PLOT TO MAKE SENSE. The plot is a complete and total clusterfuck and does not even begin to make sense no matter which way you look at it. If the ending says what I think it says, being Kuro is the worst hell. The recursive plot reminded me of Highlander: Search for Vengeance. \r\nOkay, now that I've got that out of the way, let's focus on the specifics. \r\nArt: Amazing. The art is really well polished, on par with Hellsing Ultimate. \r\nAnimation: Smooth fight scenes, lots of slow-motion and special effects. High quality animation.\\n\\n\r\nChoreography: Pretty good, the sword fights are quite nice to watch, Kuro utilizes a lot of acrobatic moves which are nice to see. I would say that it's at least on par with Highlander: Search for Vengeance if not better.",
            "date": "2013-04-20T06:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 94367,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1863996.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Abs0",
                "username": "Abs0"
            },
            "url": "https://myanimelist.net/reviews.php?id=94367"
        },
        {
            "content": "It's a 8/10 at the start, drops to a 3 (which nearly made me cry and give up on the series) and then a totally knock-you-off-your-seat resolution which really deserves a 10. so yeah. i have no idea how to rate this show overall. \r\na few hours ago i was trudging through the 8th episode or so, wondering why on earth i'm still watching a crappy show like this and how it this nonsense going to have any satisfactory conclusion - obviously i've never ever seen a show which such horrendous build-up into such a of-of-this-world revelation. \r\nlet's talk about why the middle effy bitswere really horrible first. \\n\\n\r\n1) it's a plot that never seem to go anywhere - ok so you might get what they're doing and all but there seem to be no general direction to the show, simply a 'i must go to kuromitsu' is about the only thing you can wrap your head around. other than that it's just loads of stuff that doesnt make sense - and i mean logical sense. \\n\\n\r\n2) humour is oddly placed. i mean if this were sengoku basara, it's totally fine. but you know plot seemed important (at least at the start) in this story and the comic relief in the middle was therefore really odd. but really, it might do your sanity some good if you just let go of the plot for the bit in the middle and just enjoy the art. \\n\\n\r\n3) ditto the line above, this time about the script. god it's cliche. \\n\\n\r\nafter you've survived all these, congrats! because you're really in for a treat. this is after all one of the best mind-fucking series i've seen. \\n\\n\r\nnow you'll understand why you've been put through the whole deal of nonsense in the middle. really, they actually DO serve a pretty good effect of building up to the eventual outcome, even though watching them has been a torture. \\n\\n\r\nevery little subtle detail is worth noting (and analysing if i'm a bit more coherent and less mind screwed)- and that's what's so awesomely psychological-thriller-ish this is. if you think about it every scene from before becomes significant, even the (crappy) lines they said; each setting takes on a meaning and ties in together with everything. those eerily beautiful lights in the hallway really made my day. \\n\\n\r\nanyway to summarise: \\n\r\nit's one hell of a psychological thriller definitely worth sitting though.",
            "date": "2010-04-15T19:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 25111,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/67771.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/firerez",
                "username": "firerez"
            },
            "url": "https://myanimelist.net/reviews.php?id=25111"
        },
        {
            "content": "This anime turned out to be one of those random ones that I was just looking for under the horror category. The thing is, it constantly throws you back and forth between \"is this guy good or bad.\" It's interesting because the main character is driven constantly in this painful loop that you kind of want to turn away from, but really can't.",
            "date": "2014-05-18T07:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 143663,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1073173.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kaz_Nara",
                "username": "Kaz_Nara"
            },
            "url": "https://myanimelist.net/reviews.php?id=143663"
        },
        {
            "content": "Ok so I found it as an entertaining and very enjoyable series except for the ending. To me the ending was bad, really bad. The show follows the relationship between an immortal woman who tuns her lover into an immortal. Now the main story is what happens when a man fells deeply involved with a very toxic narcissistic woman. I think it serves as a warning to men in general to stay away from crazy women. I think they did a great job with the animation and the sound. I am unsure why but they do not seem to drop clues at proper intervals sofor people that do not have a great intuition everything will be revealed in the last two episodes. So if you want a mind twist this is the show for you. If not  you might not find it too appealing.",
            "date": "2016-05-13T12:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 218485,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481013.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nightcrawlercyp",
                "username": "nightcrawlercyp"
            },
            "url": "https://myanimelist.net/reviews.php?id=218485"
        },
        {
            "content": "I know I'm several years too late to review this, but I just had to say it: This anime is garbage. \r\nThe first few episodes were okay, but then it spiraled into one of the biggest disappointments I've seen in an anime. The ending wasn't even bittersweet like you would expect, either; it was just bitter. Also, how the hell this got classified under \"Romance\", I'll never know. The first two episodes could be considered romance, but anything beyond that is definitely not romance, and it's misleading as hell to classify it as such.\r\nI don't mind how the story was non-linear, or how almost everycharacter was one-dimensional... No, what gets me is that the ending was so nonsensical and deeply unsatisfying. It could have have been much better had they simply re-worked episode 12. I would then at least be able to rate this anime \"mediocre\".\\n\\n\r\nBut no, they didn't. There's so much left unexplained, and what we do know is just awful. I'm still disturbed by how bad the story was, though it is somewhat entertaining at times with the action and mystery. All in all, do yourself a favor and ignore this title. You're better off re-watching something you like - the alternative would be rolling around in a trash filled garbage-can that is this anime.",
            "date": "2018-08-29T10:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 287701,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/CadisAnomandaris",
                "username": "CadisAnomandaris"
            },
            "url": "https://myanimelist.net/reviews.php?id=287701"
        },
        {
            "content": "Kurozuka was a potentially intriguing story that whiffed due to hollow characters, a stuffy atmosphere, and a confusing, labyrinthine story that attempts to provide you with food for thought that's mostly (unfortunately) made of rubber.  I don't believe it's worth your time.\r\nAs is tradition, the art in this anime is pretty good, courtesy of Madhouse.  The inclusion of CG is as close to flawless as possible, with one or two moments that stick out a little bit, but overall was very well done.  The sound was pretty standard and did its job, although the use of the stormtrooper laser rifle sound duringsword fights in a few later episodes was weird and threw me out for a bit.  Together these create a fairly tense, serious atmosphere that may have become excellent if the story had the chops to match, but it doesn't;  In fact, it reminds me quite a bit of Shigurui in that the atmosphere is almost too stuffy to let me comfortably enjoy the story.  It was overdone, and loses points for the attempt.\\n\\n\r\nThe characters...I'm honestly not sure where to begin.  Kurou is as bland as they come, and is supposed to be the generic-ish protagonist that allows us to jump into his shoes and suffer through the same confusion he does - to feel the same feelings of anger and frustration, love and longing, but most of the time he just feels like a disconnected zombie.  Had we felt more of his struggle, love, yearning, desires, or past, it may have been possible to connect with him, but we received none.  Kuromitsu is much the same - hollow - and the beginnings of their relationship in the first episode just lack a certain...connection.  A relationship which lacks substance at its core doesn't allow the viewer to get attached to it, and is one of the main flaws of the series (and turned into a great disappointment for me, as I'm a huge fan of a love story).  Had their flaws lined up to cover each other, or their stories met in the middle with a need or desire that fit perfectly, this could've been amazing...but none of that existed...so it wasn't.  The supporting characters come and go with little impact other than being minor plot devices.  The storyline(s) tend to jump back and forth, which is a bit confusing when you first encounter a new one, and it takes an episode to accept where you are and what's going on.  That was exciting at first, but as it progresses it fails to fulfill on the fascinating premise it puts forth.\\n\\n\r\nI've struggled quite a bit internally as to whether I should attempt to discuss the most interesting parts of the anime, but I really, really don't want to spoil anything for you.  I would like to say, however, that as potentially interesting as they could've been, or should've been, or I would've liked them to have been, they don't meet expectations.  They do not make this worth watching.  The first four episodes or so left me interested, fascinated, yearning for more, and then as I watched more episodes, what I wanted just never showed up.  The end arrived not with fanfare and revelation, or intrigue and shock, but like a scoop of icecream falling from your cone onto hot pavement.  The icecream is your time.  Don't let it melt away with this anime.",
            "date": "2016-06-14T16:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 220772,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4730078.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/benjireturns",
                "username": "benjireturns"
            },
            "url": "https://myanimelist.net/reviews.php?id=220772"
        }
    ],
    [
        {
            "content": "It's often strange how some anime can divide opinions on how good it actually is, and the reasons for these divided opinions are often logical and plausible. In the case of Kurozuka however, there is a definite misinterpretation of the story as a whole.\r\nKurozuka began life as a novel written by Yumemakura Baku, which was later illustrated by Noguchi Takashi in manga form. The manga was serialized in Super Jump magazine from 2003 to 2006, before being turned into an anime by Madhouse in 2008.\r\nThe story in Kurozuka is where many of the divided opinions stem from. Many people consider the story to be confusing,especially at the very end, however this can confusion can somewhat berectified by watching the first five minutes of the first episode again. \\n\\n\r\nAt heart Kurozuka may seem to be a story about vampires, love, betrayal, and revenge, however I found it to be more than just the sum of it's parts. Kurozuka is very much a &quot;what if&quot; tale, and the ending is actually very appropriate when considered in this light. There is a lot of action in the story, and the viewer will sometimes wonder what the hell is going on (as I did), but if you stick with it then you may find the story strangely captivating. \\n\\n\r\nThe art and animation are top notch in this show. Madhouse pulled out a lot of the stops when designing the characters and animating the show, especially during the numerous action sequences. CG is incorporated very well overall, with only a few minor faults that are barely noticeable. The characters are designed very well on the whole, and I especially liked the incorporation of traditional Kabuki players into the series as it gives the show a far more surreal feel. Each episode begins with a small kabuki play which recounts the events of the previous episode, and I found that the designs, animation and sound for these scenes were excellent.\\n\\n\r\nThe sound is another excellent area, especially the music and sound effects. The BGMs never overpower the sound effects during the action sequences, and the use of non-traditional animation techniques for these sequences made them exceptional. \\n\\n\r\nThe VAs are, again, excellent. Paku Romi is excellent as Kuromitsu, whilst Miyano Mamoru's monotonous tones are strangely suitable for the amnesiac Kurou. The other VAs are just as good as the two leads. Fujiwara Keiji, who plays Karuta, manages to imbue his voice with a certain &quot;roguish&quot; quality that suitably matches Karuta's design and personality.\\n\\n\r\nThe characters are actually one of the bad things about this show, however I say this with a certain amount of trepidation. On the whole the characters are well done, however there is very little development given to them - they're just there for the most part. However, this would only really be a problem if you were watching this as a straightforward story rather than a &quot;what if&quot; tale. That said though, even a &quot;what if&quot; tale would need it's characters developed to a much greater degree than Kurozuka manages to do. \\n\\n\r\nThat doesn't mean I hate the characters though. I thought the characters were. on the whole, fairly decent. My problem is that I would have liked to have known more about them as characters - their motivations and such.\\n\\n\r\nKurozuka is a great action anime, however it can be very confusing at times. There is a definite story there, but many people will find it confusing for the most part, especially as the story doesn't really hint at what's really going on until the end (suffice to say I found it a very &quot;Dallas&quot; moment).\\n\\n\r\nThis is a good show to watch if you're after some good action and aren't overly concerned with the story. It may not be everyone's cup of tea though, especially with the scientific angle it takes on the vampirism issue.  This is a story about love, loss, betrayal and revenge, and these aspects of the show are very much at the fore. However there are some elements of the show which can leave you wondering why a particular event happened in the first place, and this is only compounded by the continued lack of an explanation.",
            "date": "2009-01-10T13:18:00+00:00",
            "helpful_count": 344,
            "mal_id": 11305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=11305"
        },
        {
            "content": "The animation seems to overpower an exaggerated plot. Viewers who crave cyberpunk animations consisting of time lapses and vicious fight scenes will have a pleasant taste out of this series. Yet there is much of the plot that may leave the audience hungry. Once you take a bite out of my review, you'll understand what I mean.\r\n~[ S T O R Y ]~ [6]\r\nKurozuka focuses on the concept of immortality along with the quest for the meaning of mortality. Initially, I had assumed a vampiric aspect came into play [Kuromitsu sucking blood for example]. As the series progressed, the aspect grew more scientific. Here wehave the main character, Kurou, wanting to spend all eternity with Kuromitsu. I once thought it was a romantic struggle between the two protagonists, yet the plot grew more confusing later on. What with the beheading of Kurou to Benkei's murderous motives [due to his desire of having Kuromitsu to himself] to the Resistance against the Red Emperor's Army, just so many subplots made Kurozuka more like a staccato piece than a horror orchestra viewers probably wanted to witness. Even the end itself leaves so much to the imagination that viewers like myself wonder whether the creator intentionally wanted to mess with our minds and trigger heated discussions, or something else we have failed to notice. Other than that, the story could've been portrayed better...\\n\\n\r\n~[A R T]~ [10]\\n\r\nPost-cyberpunk meets the essence of ancient 12th century art. The serenity of the 12th century atmosphere collaborating with the post-cyberpunk appeal of the anime was rewarded my thumbs up. It brought the animation out more, gluing me to my seat as I endured visual ecstasy. Even the swift fight scenes were brilliant, as expected from the gifted Kurou as well as those involved in battle alongside. Any fan of Death Note can understand that the art between the two animes are strikingly similar. Furthermore, the art was not overexaggerated at all. They were on the dot with their specific time periods, making the anime successfully attractive.\\n\\n\r\n~[S O U N D]~ [9]\\n\r\nFrom the miraculous terror of the opening song to the soft tranquility of the ending, Kurozuka had played its music well. The flute and drums matched the ancient liveliness of Japanese culture. The instrumentals had presented the mood well as well as portraying the feel of scenes such as romantic moments, battles, times of agony, despair, hatred, et cetera. I knew what kind of scenes I was expecting from the sound. Nicely done.\\n\\n\r\n~[C H A R A C T E R]~ [7]\\n\r\nI gave the development of characters a 7 due to the fact that I had expected more from their transformations. Moreover, I expecting a better explanation of the immortality concept. The manga explains more of it whilst the anime has left gaping holes for the viewers' minds to fill. Though Kurou was inconspicuous and monotonous in his expressions, we did have a sense of what he felt inside through his short monologues. I did hope to understand a little more of Kuromitsu, seeing as the series focused more on Kurou's thoughts than anyone else's. Romi Paku and Mamoru Miyano portrayed the voices of their characters well enough for me to give this category a high mark. The rest of the seiyuu's deserve credit. I suppose that the shortness of the series is to blame for cutting short every character's expected developments.\\n\\n\r\n~[ E N J O Y M E N T &amp; O V E R A L L]~  [7]\\n\r\nJust to be fair, I'll award this anime a 7. Were it to improve in its character and plot development, it would've been awarded a higher grade. Though I do give immense praise to the development of the actual animation. It is different from any other post-cyberpunk anime to exist within the Japanimation realm. The rough grunge scenes, the splash of eccentric hues in the opening and battle scenes, the ancient softness of the 12th century lifestyle - it was all done quite well. Furthermore, the series will leave you thinking on what to value - life or time. Kurozuka is meant to represent the connection between time and life. The two walk hand-in-hand. Without life, there is no time. Without time, there is no life. One affects the other. They both need each other. What is more valuable? Immortality or living to the last minute? That is up to you to decide.",
            "date": "2008-12-30T21:51:00+00:00",
            "helpful_count": 77,
            "mal_id": 10837,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/125181.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SilentMuse",
                "username": "SilentMuse"
            },
            "url": "https://myanimelist.net/reviews.php?id=10837"
        },
        {
            "content": "Kurozuka is a lot of things but for the most part it’s a Seinen, Historical, Sci-fi, Action anime jam packed full of high-octane Rated-18 action to please action lovers. However like most series, this one starts of grand but eventually wanes as it progresses.\r\nIt begins with the main protagonist, Kurou being pursued for reasons not explained and one intense action sequence later, he and his companion seek shelter in some mysterious woman’s home. Kurou soon develops feelings for this woman named Kuromitsu but soon after he discovers her dirty little secret. Another insanely gruesome action sequence later and the real story begins, as Kurou embarkson an all new journey of immortality. All I can say is that the 1st episode was awesome but soon after that the biggest flaw in the story soon appears, as early as in the 2nd episode. It is the story’s timeline and when dealing with this concept of immortals living through the ages, it doesn’t help when things keep jumping from period to period, making it easy to lose track of what’s going on in the story (until the action sequences wake you up). Heck by episode four, I gave up on trying to figure out the chronological order of events and just followed Kurou on his unexplained journey to find Kuromitsu. The thing is that the story was actually decent but it was executed poorly, with chucks of major plot points left unexplained.\\n\\n\r\nAnother thing wrong with this short series is its characters. Sure the main 2 were fairly interesting but Kuromitsu was as much of a mystery to Kurou as she was to those who watch this. As for Kurou, he would have been more interesting if he actually got some back-story and maybe showed some emotion, instead of those random outbursts. There are actually other characters to mention but they are so bland and uninteresting that I even struggle to remember their names 10mins after watching an episode.\\n\\n\r\nWith all the bad stuff taken care of, discussing the animation is a nice change in direction, because it can be described simply as awesome. This anime seems to go for very aesthetically pleasing environments with a sort of grudge textured look and the heaps of CG that actually goes well with it. Not to forget the reason why I think of the animation as perfect, which are the action sequences that have obviously been influenced by a lot of things. As for the music the soundtrack is certainly fitting for the series; with a mixture of tranquil tunes and high-octane beats for any given situation.\\n\\n\r\nOverall Kurozuka proved to be an enjoyable hack ‘n’ slash fest but there are more than enough action sequences for even an action lover to be bored with and having a poorly executed storyline as an alternative isn’t good at all.  Trying to make sense of the messy story is like trying to solve a sudoku puzzle; make one mistake and you’ll have to backtrack to where things make sense. Having a lacklustre ending doesn’t help either but those who are able to ignore these flaws would still enjoy Kurozuka for its awesome action and interesting concept.\\n",
            "date": "2009-01-11T14:29:00+00:00",
            "helpful_count": 39,
            "mal_id": 11372,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=11372"
        },
        {
            "content": "“Majestic, bizarre, violent and dark. A surreal and poetic journey that turns into something more profound than what it looks like”\r\nREVIEW FREE OF SPOILERS!\r\n-STORY: 8-\r\n\"KUROZUKA\" it’s a well-founded and rich story. Its narrative could divide people, some by saying it’s boring and unadorned –or complicated- and by others –like me- saying that is meaningful, metaphorical and gorgeous.\r\nThe story of this show could be like a stream, whether it calls you, takes you and embraces you leading you swiftly –although, trough some “what the hell is happening here?” moments- across the tale or it rejects you for it isn’t a plain and simple story of vampiresand war, it is complex. \\n\\n\\n\r\n-ART: 8- \\n\r\nThe art depicted in this show is marvelous. The designing of the characters is believable and the action scenes are appealing and not exaggerated like most of the vampire/action shows out there.\\n\\n\\n\r\n-SOUND: 10-\\n\r\nThe voice acting is a jewel. It is passionate, it is deep. It’s calculated for the type of show that “KUROZUKA” is. The voice actors are believable since they’re transferring the feeling of solitude shown in the show through their voices.\\n\\n\r\nMeanwhile, the soundtrack has a dream-like ring to it. It’s a delicate mixture of instruments. It is cold, sad and dark, like a mirror of the situation the surrounds the characters and their own feelings.\\n\\n\\n\r\n-CHARACTER: 7-\\n\r\nThe deepness carried through most of the show –superbly if I may add- in most of its features: Script, voice acting, art and soundtrack is something amazing, yet lacking within the character department. Don’t misunderstand me, the characters are well-defined, distinct and incredibly well depicted –and I liked them, to be honest- but there’s an important aspect that the show didn’t display, the “backbone” of the characters –or in other words, their backstory and development-. To put it bluntly the characters look like they’re just there, like a superfluous, convenient and momentary entertainment without a direction or reason, just a cause. But let us remember that this “cause” this “reason” IS the backbone and the main focus of the story, making the character development/background faintly unnecessary. After all, we as viewers we want to know about the characters we are watching, we want to get “closer” to them, we want to understand the: “why’s, the where’s and the when’s” of each characters, even if the story doesn’t really depend on such things, which is clearly the case of this show.\\n\\n\\n\r\n-ENJOYMENT: 7 & OVERALL: 8-\\n\\n\r\n“KUROZUKA” is a difficult show to watch. As I said before is complex, and for moments it looks like the show doesn’t know where its leading, but the end it’s what makes it a whole. Is it enjoyble? Yes, a lot. But you need an open mind and most importantly understand that this show is meaningful and not just action after action scene.\\n\\n\r\nA really amazing show.\\n\\n\r\nThanks for reading!",
            "date": "2014-11-05T15:01:00+00:00",
            "helpful_count": 33,
            "mal_id": 167531,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4195751.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GonWithARose",
                "username": "GonWithARose"
            },
            "url": "https://myanimelist.net/reviews.php?id=167531"
        },
        {
            "content": "This anime pissed me off enough that I wanted to review it. The story opened with great visuals and fantastic animation. I loved the kabuki openings which summarized previous events. In short, Kurozuka started with great promise. \r\n*If you're worried about spoilers, you should probably stop reading here.* \r\nAlas, that promise was quickly broken. I don't mind a bit of confusion when it serves the purpose of the story, especially when it originates authentically from the character's perspective. There's a limit, however, and Kurozuka drives past it, swerves off the road, careens down a mountainside, and explodes in a fantastically animated and entirely gratuitous fireball.\\n\\n\r\nI watched to the end, and as Kuro promised, all was revealed.  Unfortunately, the ending leaves us with a plot hole so large, Karuta could drive his magic bus through it. (Apologies for packing my driving metaphors so closely together.) So are the two main characters immortals or are they immortals and time travelers? Clearly, there's a time \"reset\" that happens in the last episode. This reset seems to fall into the category of \"wouldn't it be cool...\". In answer, \"No, it wouldn't.\" Absolutely nothing in the previous episodes suggests a time spiral or Ouroboros or that little infinite loop of paper whose name escapes me at the moment. This is laziness or stupidity on the part of the writers. \\n\\n\r\nThe show should be praised for it's interesting take on vampire folklore. And also for bringing a genuine touch of horror to the fate of the main character at the end. In spite of these good things, where's a barge of cliches loaded in this anime. Here's one I'm f-n sick of: generic demonic bad-guy shoots tentacles or spikes from his/her body. This anime does this not once, but three frickin' times with different characters. That's when the show became risible to me (or was it when Karuta turned his bus into a rocket and blasted up a nearly vertical drawbridge...). \\n\\n\r\nSpeaking of characters... What characters? Another barge of cliches: The femme fatale. The dashing rogue. The hooker with a heart of gold. The amnesiac hero. Shall I go on? The \"best friend\" betrayer. The nature-magic wise-woman. The gun-wielding bad guy acting as foil to the katana-wielding good guy. The two main characters never really say much of anything. Why should I give one damn about anyone? When a certain chick gets bulls-eyed near the end, you know what I felt? Nothing. Not a thing FOR HER. I felt massive annoyance at the writers for f-n with me, but that's it. This is bad storytelling, simple. I don't have to like or love the characters, but I do have to be interested in them. Did not happen. \\n\\n\r\nWithout a compelling story and characters whose fates we're interested in, excellent art and animation is purely gratuitous. I'm sorry this anime sucked; I wanted to like it. \\n\\n\r\nYour mileage may vary.",
            "date": "2011-07-05T07:39:00+00:00",
            "helpful_count": 24,
            "mal_id": 38701,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/58978.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ravenlok",
                "username": "ravenlok"
            },
            "url": "https://myanimelist.net/reviews.php?id=38701"
        },
        {
            "content": "Lazyman reviews.\r\nAlright, so this is about an Anime called Kurozuka. Rated R -17+ and up For it contains: Mild nudity, Suggestive Themes, Boring Violence, Repeated Scene Effect, Ear Bleeding Laughter, Vampires of The Non-Twilight Kind, Zombies, Demons, Mutants, The Quest to Tap it and Blood. Lots of blood. Not so much Gore just blood. They seem to censor or magic pixie fuzz any or all of the gore out.\r\nAs we go along it’s good to know that this show aired back in 2008 and was animated by Madhouse studios. Go Madhouse! Another thing to notice is the extreme skinny people and bazaar limb length thatyou will see quite often in this show.\\n\\n\r\nRight off the bat you’re slammed with the power of the Annoying Red Haired Masked Man With Fan while he spurts out what seems to be haiku’s sung with extreme Old Man’ness. It doesn’t get any better… just more reoccurring.\\n\\n\r\nNow I shall touch a bit on the shows Intro. I’m not a fan of screamo or screecho or whatever the hell people wanna call it. It sounds like someone was trying to sing while getting their entire head shoved into a fully functioning blender. The beginning song only fits because of the fantastic animation along with it. Yup, that’s about it.\\n\\n\r\nAs for the outro, if you haven’t already muted or closed the player then you will hear the sounds of a slow paced song set to ease your heart as you escape the sounds of the intro.\\n\r\nBut you will still quickly move onto the next episode as the voice starts to slowly annoy you also. It’s like softer, slower paced screamo. It still doesn’t work. Some people out there might like it. Good for you. But this is mah lazyman review and my opinion is “Me No Like”. Mmmkay?\\n\\n\r\nThis show by far has THE MOST ANNOYING RECAP EVER DESIGNED.\\n\r\nRemember that Annoying Red Haired Masked Man With Fan I mentioned earlier? Of course you do, How could you ever forget him. Well, he reappears every single episode.\\n\r\nThat’s right, out of the 12 episodes of this show, you see his ugly mug a minimum of 12 times. You actually see him more than just 12 times but I’m giving you a heads up on what to expect. But hey, at least you get to watch him throw that fan in the exact same way each and every episode and watch that fan land perfectly in the center of their organization symbol each and every damn time. Oh… wait… That’s pretty damn annoying as well now that I think about it.\\n\\n\r\nMoving right along the action of the show is almost enough for some to continue watching until the end. For others, you will most likely be dropping this by episode 3 if you haven’t already. The beginning was still pretty good at keeping you interested in the things you don’t quite yet understand about the show. But even that has a limitation.\\n\\n\r\nThey try to pick up the pieces of the action by adding in slow motion and more Vampire like fight scenes. Which I must say, they did damn nicely. Although the whole inverted colour or heat detection mode is like you went back into the 60’s for some fun with colours. Ignoring the fact they almost all have the bone structure and appearance of malnourished basket ball players, the animation is freakin’ sweet. You can notice parts where they got a bit lazy and threw in a quick flash of white or black before they would change to the next part. It saddens me to see that potential go down the drain. Whos to say you can’t have good action in a romancy kind of theme? Well, for now, you might be right. At least in the case of Kurozuka.\\n\\n\r\nThe characters start off as interesting works of art and are slowly left in the pools of blood you will most likely see them lying in. Kurou is a love struck fool who just happens to have the ability to kill anything he wants. Kuromitsu is a siren-vampire-terminator who just happens to accept guests. Benkei… is a monk. The Red Emperor is a man of song. Rai is a rebel prostitute. I could go on but the list is long and the jokes only get worse.\\n\\n\r\nAt the end of watching it all… I felt the ending was pretty damn bleh. Sure, I understood the bits the show left everywhere for us to pick up and understand like a trail of candy eggs. It just didn’t solve anything it may have explained it but there was no actual solution. It’s like hitting the reset button instead of wondering why you have to hit that button and working at the problem from there.\\n\\n\r\nThe Story gets 6 Rusted Samurai Swords.\\n\r\nThe Animation gets 8 Gallons of Blood.\\n\r\nThe Sound gets 5 and a half Screams of Terror.\\n\r\nThe Characters gets 6 Close Up Shots.\\n\\n\r\nOverall the show should hold a 7 but it falls short of that mark and is left with the bitter taste of 6 Fans of the Red Emperor.\\n",
            "date": "2011-08-14T20:59:00+00:00",
            "helpful_count": 15,
            "mal_id": 41513,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150727.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MasterOfLazyness",
                "username": "MasterOfLazyness"
            },
            "url": "https://myanimelist.net/reviews.php?id=41513"
        },
        {
            "content": "tl;dr - Kurozuka is a bad anime. I really support and like some points made, but the show itself is of pretty poor quality at most times.\r\nYou don’t know what to expect when you dive into Kurozuka. While this is true for a lot of other anime as well, Kurozuka is a special enigma. Being about vampires (especially the main leads) can turn people off, seeing how vampires are often portrayed nowadays. Sadly, thoughts hop to Rob Pattinson as Edward in the cringe-inducing soft pornography for girls known as Twilight. Sure, Twilight isn’t the only sinner, but due to it’s popularity, it is the moststand-out. Onwards to Kurozuka, then.\\n\\n\r\nOn first on-look, Kurozuka seems to be a love story about vampires, set in Feudal Japan. That preconception is quickly smashed to bits after the first episodes as we skip to a bleak future version of Japan that has been a-bombed. Back in the past, our hero Kuro (known as “Minamoto no Yoshizune”, a very famous and popular Japanese literature hero) was fleeing into the mountains, and came upon the lodging of Lady Kuromitsu. He and his close ally Benkei were allowed to stay under the condition that they do not approach nor enter Kuromitsu’s room. Of course, that promise doesn’t mean all too much and Kuro finds himself outside the mysterious woman’s room, where he sees her biting and drinking the blood of a man. The place is attacked, and Kuro is badly hurt helping his hostess. The two had quickly became attracted to one another, and Kuromitsu offers Kuro eternal life with her. Kuro accepts. Then the focus shifts to the future where Kuro has become separated from Kuromitsu and ventures to find her. He instead meets Karuta and Rai and becomes embroiled in what is basically a civil war between the Red Army and the rebels, both fighting for the very prize Kuro seeks: Kuromitsu.\\n\\n\r\nI was pretty excited to watch this, as it felt like vampires were treated as a big deal and it also seemed like a cool set-up for a powerful romantic saga, but alas, all the potential amounted to jack shit in this absolute train-wreck of a series.\\n\\n\r\nThe series jumps from different time periods, usually at the start of episodes, without giving the viewer much warning or explanation, which is the major flaw of the series in my opinion. It’s very hard to get a grip on the characters as is, so there’s really no need to confuse viewers additionally.\\n\\n\r\nIt’s hard to gauge what exact powers are afforded to the vampires of the series, as Kuro just seems to go all Goku on people at times when he needs to put another gear in. Besides obviously being more powerful than normal humans, there doesn’t seem to be much to vampires, other than whatever odd time dilution Kuro can cause when convenient. It’s never really explained what they can do. The reveal of how they work is also incredibly slow-played, so there’s not much in the way of flavour being given to us, except for some bursts of information at times.\\n\\n\r\nAs is the case with the vampirism angle, characters in the series don’t really develop. They’re very static in personalities and in what they do. Not even the main character ever develops, he just learns more about who he was. Frankly it’s very disappointing, because when things happen to our tragic heroes, it’s hard to care about them as they’ve just been one-dimensional plot-points. That can work if you have strong characters to begin with, but as noted, these characters are dull as hell. You also get some unintentional comedy in the absolutely bonkers scientist with a penchant for torture, who starts quoting Stoker (because you have to fucking shoehorn that into a vampire show like your life depended on it) and Tolstoy, and is generally weird as hell.\\n\\n\r\nThe story is equally odd. Parts of it just comes and goes as it pleases, like there’s a revolving door of relevance. It really is hard to care about what is happening when you don’t grasp the relevance of events to one-another. Characters just do complete one-eighties in order to provide more filler before the end finally arrives. It really is a shame, because it felt like it was to be a show that made vampires rather cool again, but the amount of plot-holes and contrivances really do get in the way of enjoying it. All of the reveals towards the end just made me laugh out loud with their increasing craziness, until we arrive in bizarro-world come the ending.\\n\\n\r\nVisually, it’s very pleasing for most of the time and there is a lot of incredible imagery, but then you get some absolutely retarded character designs that feel like they invaded from another series.\\n\\n\r\nThe sound design is pretty decent, but many characters in the series are woefully miscast and a lot of the performances are really bad. The soundtrack, however, is pretty damn awesome. Both the OP and ED are great.\\n\\n\r\nNow, I’ve been shitting on Kurozuka a lot, but the final episode shows up and delivers the best possible ending the series could have had and I really freaking loved it, so I'm ultimately torn on where to go with the series; good or bad? Ultimately, with all the tomfoolery, I’ll go with bad, but there’s certainly enough good in here that a person that disagrees with what I found negative would find this to be a damn good show. It also increases my frustration with the series’ unfulfilled potential. The run-time of the entire thing is way too long relative to what it’s trying to convey. Honestly, remake this in film-length and condense the story a bit, and I’ll watch the hell out of it. I’m totally behind the point it makes about love and selfishness and I actually came away from it rather liking the vampire concept, but the length and general poor quality makes most of the series unbearable to watch.",
            "date": "2014-03-21T13:37:00+00:00",
            "helpful_count": 14,
            "mal_id": 136351,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20333.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Purjoloek",
                "username": "Purjoloek"
            },
            "url": "https://myanimelist.net/reviews.php?id=136351"
        },
        {
            "content": "I liked this anime, but had difficulty in rating it. In some ways, it is either more or less than the sum of its parts, depending on the point of whoever is watching it.\r\nThe story is presented in a manner which involves a lot of flashbacks, dream sequences which are not clearly distinguished from reality, surreal imagery, explicated metaphor... in short, it is overwhelmingly confusing.\r\nEven after watching the entire series, all I can say about the plot is that it is designed to mess with my head... anything else is questionable, so even if I wasn't wary of spoilers, I can't really give you anydetails (I mean, I could, but, not really).\\n\\n\r\nIf you've watched Serial Experiments Lain, or Memento, then this probably belongs in a similar category in terms of the way the story is presented as a plot. \\n\\n\r\nSound, Art:both Great! (9/10)\\n\\n\r\nThe sound and art have very high production values... but I would put the Art one step below perfect because, although somewhat intentional, they are so many time-jumps that not only the story, but even the action is at times difficult to follow. \\n\\n\r\nThe characters... (8/10)\\n\\n\r\nwell, they are somewhat well developed but I really had to think about that for a bit. For certain, it is an interesting way of presenting common themes by changing various details... so I will just say that the characters are very well thought out, but are overshadowed a bit by the non-linear presentation and even the \"flashiness\" of the art style. \\n\\n\r\nThey are few \"slice of life\" moments in this series, so it is hard to connect to even the main characters... even when background history is being given, it is usually in the midst of a battle or tense situation. \\n\\n\r\nEnjoyment... (7/10)\\n\\n\r\nOuch, my head hurts! \\n\\n\r\nI appreciate that the production values were high, and the plot was well thought out and spans a vary long time... but at the same time, I had to just stop the series and go to watch something else, whilst my brain adjusted to \"normal time flow\", least I start walking backwards or something.\\n\\n\r\nIn that sense, I enjoyed it less than the more linear (in terms of time presentation, but perhaps, more incomplete in terms of story details) Serial Experiments Lain... and there was so much going on, involving several major \"players\", that I actually found Memento easier to follow.\\n\\n\r\nOverall... (8/10)\\n\\n\r\nI would say this series is very good, but its presentation pace will overwhelm even people who like non-linear story presentation (anyone who claims different, just shut off their brain or something and is lying to themselves), and the ambiguous ending sparks more questions... unlike Serial Experiments Lain, which I have re-watched several times, I am deeply hesitant to even glance at Kurozuka again... it does something to stretch the mind, but perhaps in ways that it would be best not to attempt too often.\\n\\n\r\nIf \"Ringu\" and Serial Experiments Lain are mindfucks, then this is a hardcore mind-gang-rape... but by a very beautiful flock of fangirls. \\n\\n\r\nOr something. \\n",
            "date": "2009-03-14T11:19:00+00:00",
            "helpful_count": 12,
            "mal_id": 13175,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/156353.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/D5",
                "username": "D5"
            },
            "url": "https://myanimelist.net/reviews.php?id=13175"
        },
        {
            "content": "The first two episodes of this anime really gripped me, even after the third i was left thinking that the story had such promise, it could turn into one of the best animes this season, sadly i was wrong the story is set wonderfully and deteriorates from there. Throughout the series you'll find a number of overly glorified battle scenes, (since kuro is a vampire) you can expect quite a few unrealistic feats to dash across your screen. Even as i write this review i wish i could go back in time kill the writer and take his job.The sound is solid not the best I've heard I thought the opening was iffy, The characters are not developed properly the story's many strings just dont tie together, i remember the end of episode 12 felt like being jabbed at with the bristles of a dirty broom (each representing a loose end). I suppose if u liked the senseless battles that afro samurai threw at you, you'll like kurozuka. But if youre looking to enjoy an anime storywise .. then steer clear of this catastrophe",
            "date": "2009-01-15T02:14:00+00:00",
            "helpful_count": 9,
            "mal_id": 11506,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/47962.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/apatch3",
                "username": "apatch3"
            },
            "url": "https://myanimelist.net/reviews.php?id=11506"
        },
        {
            "content": "I first watched this anime a few years ago out of boredom when I couldn't find anything else to watch, and I'm so glad I did! Now it's definitely ranked as one of my favorites. \r\nThe balance of action & romance is perfect. The storyline is interesting, and leaves you wanting more. Rarely if ever a dull moment. It's definitely one of the first I would recommend.",
            "date": "2013-05-30T19:36:00+00:00",
            "helpful_count": 8,
            "mal_id": 99045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/504541.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/babykiwi",
                "username": "babykiwi"
            },
            "url": "https://myanimelist.net/reviews.php?id=99045"
        },
        {
            "content": "Kurozuka is extremely different in the way the story is presented. Do not take that statement lightly. \r\nAt the beginning of this anime (for what seems several episodes) it is extremely hard to stay interested because of the perspective the story. It does however, change so that the watcher can follow along and begin making sense of the earlier scenes. \r\nConsidering the actual content of the anime, the story was interesting with intriguing art. The action primarily in the middle of the anime is fairly graphic, which was almost unexpected... But very entertaining.\r\nSaying those few things, I appreciate the different approach in story telling, howeverdaunting it was. It almost makes me think they did it so the watcher would be as dazed and confused as the main character. I stayed long enough to get past it because of the art and the hints of mystery at the beginning. The mysteriousness was redundant, but the redundancy serves a purpose.\\n\\n\r\nOverall I would recommend this more to those who are primarily interested in action, thrillers or just up for something different. I do think it is good though, and worth watching for its other aspects. Even though it contains supernatural mystery the action is what you would probably stay for, because the mystery takes a bit to reveal itself... AS a mystery. \\n\\n\r\nOverall: I give it a modest 8 for its uniqueness, art and story",
            "date": "2014-04-27T23:07:00+00:00",
            "helpful_count": 8,
            "mal_id": 141611,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3727805.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Callow",
                "username": "Callow"
            },
            "url": "https://myanimelist.net/reviews.php?id=141611"
        },
        {
            "content": "What a terrible terrible anime. Sure the first 2 episodes were terrific. Great gore, great action and a bit of romance. However everything goes downhill. The anime is very confusing. There's many flashbacks which appear without warning which is confusing. Powers and abilities of all of these characters are poorly poorly explained. There's times when the anime doesn't make sense. The anime is a trainwreck.\r\nBut to make matters even worst the ending is a catastrophe. You have not a clue what's going on at all. You don't know if time reset and a continuous loop happens, you don't know whether time is continuing or whetherKuro actually gets that actual body. I'm sorry for putting in spoilers but this anime is a bellyache. I wouldn't recommend watching this EVER!",
            "date": "2014-09-11T13:37:00+00:00",
            "helpful_count": 8,
            "mal_id": 159941,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/BobDiesel",
                "username": "BobDiesel"
            },
            "url": "https://myanimelist.net/reviews.php?id=159941"
        },
        {
            "content": "From the first scene I felt like I'd seen the anime before. By the second or third episode I confirmed in my mind that I had indeed already completed Kurozuka & my uncertainty wasn't due to confusion or imagined deja vu- but due to themes of eternity, reality, fate and life and death and life again being wonderfully executed in the story telling. The unclear progression & perception of truth all succeeded in making this Alice in Wonderland- Ergo Proxy journey enthralling (Brownster's 'engrossing' was well chosen). Reaffirming D5's  ' hardcore mind-gang-rape' description as very true.\r\nRating the anime was difficult when it came toEnjoyment as no terms seemed close to relevant other then 'great'. There were many fight scenes leaving me in ecstatic awe (I LOVE sword fight scenes and Kurozuka definitely satisfies!)  but I don't think the true story lends itself to 'enjoyment', unless you're masochistically-orientated as the love and life in kurozuka are dark (few happy bunny moments) but beautiful nonetheless. \\n\r\nOnce I started I knew I had to watch it throughout and am happy I did. \\n\r\nI find it hard to agree with people complaining about the 'confusing' 'messy' plot as it seems perfectly suited. Definitely worth watching and bring tissues for the fight scenes- they are HARD :P",
            "date": "2010-03-06T18:27:00+00:00",
            "helpful_count": 7,
            "mal_id": 23769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Floydogenic",
                "username": "Floydogenic"
            },
            "url": "https://myanimelist.net/reviews.php?id=23769"
        },
        {
            "content": "Kuro means black. Or so I've been told. \r\nAnd I think Kurozuka means black coffin. Maybe.\r\nAnywhoo.\r\nLet's say you're a toppled Japanese Lord running from demonic usurpers in the chilling mountains with your seemingly loyal retainer and stumble upon a large manor presided over by a beautiful woman who is all alone in this dangerous climate. Moreso, this woman is completely willing to let you spend the night on one request: don't go into her personal chambers only to discover her getting her freak on with a bloody corpse...\r\nClearly no good will come of wanting to have sex with her and be her eternal lovemonkey slavebecause she'll cut your head off and you'll be forced to time travel through apocalyptic worlds in endless search of this demon who on one hand lavishes her love upon you and on the other endlessly eludes you.\\n\\n\r\nSo that's the premise. Kuro, the retainer dude, becomes an immortal vampire head thing, and searches for the mysterious Kuromitsu vampire chick across time--falling in love over and over again. There are some Jade Empire guys who eternally seek her because her blood can make you immortal, but there's a catch (isn't there always). And there are some recurring characters that span the ages, but it's all confusing and contrived, and irrelevant to the main story.\\n\\n\r\nThe style of this is clearly retro cyberpunk with new production values. There's a hint of Ninja Scroll and Fist of the North star in the character designs, backdrops, and apocalyptic wasteland. There is over the top bloody violence, and the fight scenes are nicely done. Also, there is the classic theme of a ragtag band of adventurers seeking a princess in a castle taken by a dark lord (which more or less describes the generic cast of extras that follow Kuro along--but most have amusing traits, like the quiet and ruthless Kuon who seems to remember useless details about kids cartoon with great enthusiasm). \\n\\n\r\nThere isn't much to the plot, just the endless pursuit of Kuromitsu and the typical Demon-play we've come to expect, but the character design is creative and the pacing is decent. There are flashbacks, which add to the timeless plight of Kuro and his amesia (the core of the premise), but overall this is just a grindhouse flick so there's little to fault on something that isn't being too pretentious.\\n\\n\r\nOf note there's an amusing episode that totally goes overboard in regard to a bag of shit and a wheelchair (you may not want to see it, now that I think about it). \\n\\n\r\nWith all that said, the ending polarizes you. I hated it the first time, the second I decided to accept that it wasn't that bad to reiterate the central theme of pursuing an unreachable goddess.\\n\\n\r\nMake up your own minds.",
            "date": "2009-04-16T08:25:00+00:00",
            "helpful_count": 6,
            "mal_id": 14220,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/171075.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tentacle_raep",
                "username": "tentacle_raep"
            },
            "url": "https://myanimelist.net/reviews.php?id=14220"
        },
        {
            "content": "Warning to anyone planning to watch this: DO NOT EXPECT THE PLOT TO MAKE SENSE. The plot is a complete and total clusterfuck and does not even begin to make sense no matter which way you look at it. If the ending says what I think it says, being Kuro is the worst hell. The recursive plot reminded me of Highlander: Search for Vengeance. \r\nOkay, now that I've got that out of the way, let's focus on the specifics. \r\nArt: Amazing. The art is really well polished, on par with Hellsing Ultimate. \r\nAnimation: Smooth fight scenes, lots of slow-motion and special effects. High quality animation.\\n\\n\r\nChoreography: Pretty good, the sword fights are quite nice to watch, Kuro utilizes a lot of acrobatic moves which are nice to see. I would say that it's at least on par with Highlander: Search for Vengeance if not better.",
            "date": "2013-04-20T06:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 94367,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1863996.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Abs0",
                "username": "Abs0"
            },
            "url": "https://myanimelist.net/reviews.php?id=94367"
        },
        {
            "content": "It's a 8/10 at the start, drops to a 3 (which nearly made me cry and give up on the series) and then a totally knock-you-off-your-seat resolution which really deserves a 10. so yeah. i have no idea how to rate this show overall. \r\na few hours ago i was trudging through the 8th episode or so, wondering why on earth i'm still watching a crappy show like this and how it this nonsense going to have any satisfactory conclusion - obviously i've never ever seen a show which such horrendous build-up into such a of-of-this-world revelation. \r\nlet's talk about why the middle effy bitswere really horrible first. \\n\\n\r\n1) it's a plot that never seem to go anywhere - ok so you might get what they're doing and all but there seem to be no general direction to the show, simply a 'i must go to kuromitsu' is about the only thing you can wrap your head around. other than that it's just loads of stuff that doesnt make sense - and i mean logical sense. \\n\\n\r\n2) humour is oddly placed. i mean if this were sengoku basara, it's totally fine. but you know plot seemed important (at least at the start) in this story and the comic relief in the middle was therefore really odd. but really, it might do your sanity some good if you just let go of the plot for the bit in the middle and just enjoy the art. \\n\\n\r\n3) ditto the line above, this time about the script. god it's cliche. \\n\\n\r\nafter you've survived all these, congrats! because you're really in for a treat. this is after all one of the best mind-fucking series i've seen. \\n\\n\r\nnow you'll understand why you've been put through the whole deal of nonsense in the middle. really, they actually DO serve a pretty good effect of building up to the eventual outcome, even though watching them has been a torture. \\n\\n\r\nevery little subtle detail is worth noting (and analysing if i'm a bit more coherent and less mind screwed)- and that's what's so awesomely psychological-thriller-ish this is. if you think about it every scene from before becomes significant, even the (crappy) lines they said; each setting takes on a meaning and ties in together with everything. those eerily beautiful lights in the hallway really made my day. \\n\\n\r\nanyway to summarise: \\n\r\nit's one hell of a psychological thriller definitely worth sitting though.",
            "date": "2010-04-15T19:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 25111,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/67771.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/firerez",
                "username": "firerez"
            },
            "url": "https://myanimelist.net/reviews.php?id=25111"
        },
        {
            "content": "This anime turned out to be one of those random ones that I was just looking for under the horror category. The thing is, it constantly throws you back and forth between \"is this guy good or bad.\" It's interesting because the main character is driven constantly in this painful loop that you kind of want to turn away from, but really can't.",
            "date": "2014-05-18T07:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 143663,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1073173.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kaz_Nara",
                "username": "Kaz_Nara"
            },
            "url": "https://myanimelist.net/reviews.php?id=143663"
        },
        {
            "content": "Ok so I found it as an entertaining and very enjoyable series except for the ending. To me the ending was bad, really bad. The show follows the relationship between an immortal woman who tuns her lover into an immortal. Now the main story is what happens when a man fells deeply involved with a very toxic narcissistic woman. I think it serves as a warning to men in general to stay away from crazy women. I think they did a great job with the animation and the sound. I am unsure why but they do not seem to drop clues at proper intervals sofor people that do not have a great intuition everything will be revealed in the last two episodes. So if you want a mind twist this is the show for you. If not  you might not find it too appealing.",
            "date": "2016-05-13T12:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 218485,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481013.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nightcrawlercyp",
                "username": "nightcrawlercyp"
            },
            "url": "https://myanimelist.net/reviews.php?id=218485"
        },
        {
            "content": "I know I'm several years too late to review this, but I just had to say it: This anime is garbage. \r\nThe first few episodes were okay, but then it spiraled into one of the biggest disappointments I've seen in an anime. The ending wasn't even bittersweet like you would expect, either; it was just bitter. Also, how the hell this got classified under \"Romance\", I'll never know. The first two episodes could be considered romance, but anything beyond that is definitely not romance, and it's misleading as hell to classify it as such.\r\nI don't mind how the story was non-linear, or how almost everycharacter was one-dimensional... No, what gets me is that the ending was so nonsensical and deeply unsatisfying. It could have have been much better had they simply re-worked episode 12. I would then at least be able to rate this anime \"mediocre\".\\n\\n\r\nBut no, they didn't. There's so much left unexplained, and what we do know is just awful. I'm still disturbed by how bad the story was, though it is somewhat entertaining at times with the action and mystery. All in all, do yourself a favor and ignore this title. You're better off re-watching something you like - the alternative would be rolling around in a trash filled garbage-can that is this anime.",
            "date": "2018-08-29T10:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 287701,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/CadisAnomandaris",
                "username": "CadisAnomandaris"
            },
            "url": "https://myanimelist.net/reviews.php?id=287701"
        },
        {
            "content": "Kurozuka was a potentially intriguing story that whiffed due to hollow characters, a stuffy atmosphere, and a confusing, labyrinthine story that attempts to provide you with food for thought that's mostly (unfortunately) made of rubber.  I don't believe it's worth your time.\r\nAs is tradition, the art in this anime is pretty good, courtesy of Madhouse.  The inclusion of CG is as close to flawless as possible, with one or two moments that stick out a little bit, but overall was very well done.  The sound was pretty standard and did its job, although the use of the stormtrooper laser rifle sound duringsword fights in a few later episodes was weird and threw me out for a bit.  Together these create a fairly tense, serious atmosphere that may have become excellent if the story had the chops to match, but it doesn't;  In fact, it reminds me quite a bit of Shigurui in that the atmosphere is almost too stuffy to let me comfortably enjoy the story.  It was overdone, and loses points for the attempt.\\n\\n\r\nThe characters...I'm honestly not sure where to begin.  Kurou is as bland as they come, and is supposed to be the generic-ish protagonist that allows us to jump into his shoes and suffer through the same confusion he does - to feel the same feelings of anger and frustration, love and longing, but most of the time he just feels like a disconnected zombie.  Had we felt more of his struggle, love, yearning, desires, or past, it may have been possible to connect with him, but we received none.  Kuromitsu is much the same - hollow - and the beginnings of their relationship in the first episode just lack a certain...connection.  A relationship which lacks substance at its core doesn't allow the viewer to get attached to it, and is one of the main flaws of the series (and turned into a great disappointment for me, as I'm a huge fan of a love story).  Had their flaws lined up to cover each other, or their stories met in the middle with a need or desire that fit perfectly, this could've been amazing...but none of that existed...so it wasn't.  The supporting characters come and go with little impact other than being minor plot devices.  The storyline(s) tend to jump back and forth, which is a bit confusing when you first encounter a new one, and it takes an episode to accept where you are and what's going on.  That was exciting at first, but as it progresses it fails to fulfill on the fascinating premise it puts forth.\\n\\n\r\nI've struggled quite a bit internally as to whether I should attempt to discuss the most interesting parts of the anime, but I really, really don't want to spoil anything for you.  I would like to say, however, that as potentially interesting as they could've been, or should've been, or I would've liked them to have been, they don't meet expectations.  They do not make this worth watching.  The first four episodes or so left me interested, fascinated, yearning for more, and then as I watched more episodes, what I wanted just never showed up.  The end arrived not with fanfare and revelation, or intrigue and shock, but like a scoop of icecream falling from your cone onto hot pavement.  The icecream is your time.  Don't let it melt away with this anime.",
            "date": "2016-06-14T16:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 220772,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4730078.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/benjireturns",
                "username": "benjireturns"
            },
            "url": "https://myanimelist.net/reviews.php?id=220772"
        }
    ],
    [
        {
            "content": "This is an anime that has to be watched twice. Its graphic style is unique, when he does his thing and the colours change it is amazing and I would love to see that effect again. The characters don't seem to have any deep motivation, you can pick a thing here or there but this is where the second playthrough comes very handy.\r\nTo really get to understand this anime you need to watch it twice; first for the thrill of the ride, you get thrown around and is very unforgiving it jumps forward and back at seemingly random intervals and at the end your leftwith a feeling of \"what just happened?\". If you have the time to watch it in one go that would probably be better as then you can get a grasp of the concepts. The second playthrough allows you to pick up the breadcrumbs of story left. There may be just one line that is planted in there, it may seem insignificant, but it can help you to understand the bigger picture of it.\\n\\n\r\nI enjoyed this anime on two levels, the rush of the battle and then trying to figure out how the story goes together. It is a very complex anime, maybe too complex and thats why I feel the story could be better. Another thing that is quite odd is that everything happens in the last episode, every characters motivation is pretty much revealed then and there. \\n\\n\r\nTo summarise my jumbled thoughts; the anime is a good watch, the pace is fast and you wont be sat around for too long, the plot is intertwined throughout the whole series and it requires a second playthrough to pick up on all the hints that you wouldn't notice. Even the main characters lack development, however I feel that is due to the time constraints of 12 episodes. The sound is good, not overpowering and not unnecessary. I would recommend this anime to someone who likes fast paced action but a story that rewards you for going back and thinking about all that has been said and done.",
            "date": "2012-05-22T12:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 61701,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MutoKazuki",
                "username": "MutoKazuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=61701"
        },
        {
            "content": "First of all I would say that although ive seen this anime,I dont fully understand it,so whatever I am reviewing here is based on my interpretation of the story.\r\nIm not much of a fan of this genre but Kurozuka is an exception.I coudnt stop watching it until I completed the entire 12 episodes.\r\nThe story is presented in a series of flashbacks and hallucinations of the main protagonist,which honestly is a bit confusing most of the time,and there are lots of parts which I simply cannot understand.Also this anime has a lot of unexplained loopholes which are quite glaring at times.\r\nTo sum up,this anime has avery good plot which couldve been scripted better and the animation is very good.If you plan to watch this,be prepared to break your head over a lot of scenes where you will feel completely lost :)",
            "date": "2014-03-29T11:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 137733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nanda_K",
                "username": "Nanda_K"
            },
            "url": "https://myanimelist.net/reviews.php?id=137733"
        },
        {
            "content": "If you love psychological thrillers than this anime is for you!  I absolutely loved the twists and turns that the plot of this story took.  It had everything that I look for in an anime! It had action, romance, and mystery.  Kurou and Kuromitso proved to be two characters that interacted well.  \r\nThis anime really makes you think and ask yourself, \"What is going to happen next.\"  This anime takes place in the past and in the future.  There is a method to the madness.  Watch and see.",
            "date": "2012-04-26T00:03:00+00:00",
            "helpful_count": 0,
            "mal_id": 59663,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1199201.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lovelydeath",
                "username": "lovelydeath"
            },
            "url": "https://myanimelist.net/reviews.php?id=59663"
        },
        {
            "content": "There are must watch animes and must try animes. Kurozuka falls under the category of must try which couldn't make it up to the must watch level. Encourage yourself to see this anime only to check out what the creators have to say and bare in mind that it may not be what you wanted but there could be no harm in listening too.\r\nThe art, sound and direction is where the best part of the anime lies in and they are the ones that kept me going. The story is very simple and only bare minimum parts of the suspense are reveled occasionally, You'll understandeverything only in the final episodes. The story's style is of darker tones but not dark enough to be psychological. It revolves around the concept of Vampires. There are various settings used from era of kings to distopia as the story progress, different settings are used to describe various points of the plot so its slow, but i was never that curious anyways because Kurozuka stays loyal only to theme of vampires and does a fantastic job at that and you should be watching this to get enchanted in that mood so even is there isn't much from the story and style of story telling, like i said before its a must try. \\n\r\nYou can't really say that the characters lack in here because the characters nature has no business here. There's a beautiful looking Prince and an immortal and equally stunning looking vampire who fall in love with each other and these two vs the world. There are some anime that go deep into the characters when so little characters are of essence but that is not needed in here. However all the characters are coherent and comprehensible.\\n\r\nFor me it wasn't enjoyment as much as checking out the concept that is of importance and Kurozuka satisfied my thirst for curiosity..\\n",
            "date": "2012-01-03T05:13:00+00:00",
            "helpful_count": 0,
            "mal_id": 50813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/261710.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/puvijain",
                "username": "puvijain"
            },
            "url": "https://myanimelist.net/reviews.php?id=50813"
        }
    ]
]