[
    [
        {
            "content": "I feel I have to write this review because a lot of people just aren't getting it. This show is not meant to be taken seriously; it's a joke. This is not some romantic comedy where the characters drastically change and have inspirational quotes. This show is just randomness. It's like a poo poo joke that never ceases to be funny. So if you're thinking about watching this show ask yourself these questions. Do I like random acts of comedy or do I like strong plots? Do I like generic characters or do I like characters that change over time? This is just for thenewcomers who I feel might be discouraged by the previous reviewers who just don't understand real comedy.",
            "date": "2017-03-26T06:21:00+00:00",
            "helpful_count": 121,
            "mal_id": 243580,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4298835.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlphaNinerNiner",
                "username": "AlphaNinerNiner"
            },
            "url": "https://myanimelist.net/reviews.php?id=243580"
        },
        {
            "content": "The funny thing about comedy series is that they either \"click\" with you or they don't. Some series, like Nichijou, may take a few episodes, but Kill Me Baby is a lot more immediate (or shallow, if you will.) In fact, the best way to decide if you want to watch this series is to watch a sketch or two. That's all there is to an episode of Kill me Baby: a rapid succession of 4-koma gags, directly translated to the screen.\r\nYasuno and Sonya don't get much in terms of characterization. They are the traditional vapid air-head and irritable straight man from manzai comedy. Agiriis even more of a prop for additional jokes rather than a character proper. The art is minimalistic, ditto for the soundtrack. The OP is a weird polka that may take a few times to get used to, while the EP is a pretty catchy pop tune accompanied by nifty dance moves.\\n\\n\r\nSpeaking of sound, the voice actresses do a bang-up job. Yasuno's is a relatively newcomer, while Sonya's has more roles playing boys than girls, but they carry the show, making some jokes that could otherwise fall flat side-splitting funny. Agiri's voice is high and annoying, but I guess that's what they were aiming for. And it's a welcome surprise to see a Kugimiya character get the short stick (she's the redhead \"unused character.\")\\n\\n\r\nKill Me Baby uses a fraction of the budget that JC Staff allocates for its flagship projects, but it squeezes as many laughs per yen as humanly possible. The next time you feel you are not in the mood for elaborate battles, complex plots and philosophical exploration, give it a spin.",
            "date": "2012-01-30T09:29:00+00:00",
            "helpful_count": 136,
            "mal_id": 52871,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/436364.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/sciencewarrior",
                "username": "sciencewarrior"
            },
            "url": "https://myanimelist.net/reviews.php?id=52871"
        },
        {
            "content": "I remember watching a couple scenes out of context from Kill me baby on youtube months ago and to be fair, they were random enough to be funny. The characters were quirky and the situations were absurd, which is just what any comedy of this type needs to be succesful or at the very least enjoyable. It was immediately apparent as soon as I watched the very first episodes that I was wrong.\r\nKill me baby is the kind of series that sets a ridiculous premise and then never lives up to it, the kind of comedy that presents itself as completely demented and over-the-top butnever leaves the comfort zone of character-based jokes, the kind of experience that hypes itself to stardom but settles for mediocrity instead - It simply doesn't have enough to push the show forward.\\n\\n\\n\r\nThe ridiculous premise quickly degenerates into a mere gimmick due to sheer repetition of the same trite, formulaic jokes. They all play out the same way: Yasuna does something silly, she gets knocked out by the annoyed Sonya the assassin, while Agiri the ninja does something random, if she is around while that happens… you can generally predict how the joke plays out before it even starts, which is exactly as exciting as it sounds. \\n\\n\r\nBut beyond that, three characters are simply not enough to carry a comedy show for twelve full-length episodes. Any succesful comedy series I can think of – let's say Azumanga Daioh – had a diverse enough set of side characters that prevented the show from reaching the point of stalemate and kept the show relatively fresh despite the length.\\n\\n\r\nAt this point I wonder how Kill me Baby would have fared if it was a 3-minutes short series… as a friend of mine commented on the series: “it was tolerable back when I watched it weekly”, which is something I can honestly believe, as from my experience, the more often I watched an episode of Kill me Baby, the harder it was to pull through it and by applying that rule on a more abstract level, then you're better off not watching it at all. The opening track, \"Kill Me Baby\", arguably the worst opening song for a show of all time pretty much represents the show as a whole - weird at first,  annoying and repetitive after you hear it once. Stay away.",
            "date": "2015-02-18T09:02:00+00:00",
            "helpful_count": 53,
            "mal_id": 180712,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1331431.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Valkqt",
                "username": "Valkqt"
            },
            "url": "https://myanimelist.net/reviews.php?id=180712"
        },
        {
            "content": "Kill Me Baby is one interesting anime to watch and to review, but particularly to evolve with the characters and how you relate to their presence on each episode and the show in general, which makes it sort of slow started, but ends up being an endearing 4-koma. So, here we go:\r\nStory - 6\r\nLook at it however you want, this is, at the end of the day, just another slapstick show about wacky schoolgirls. The story isn't anything special, and, at first it doesn't even seem to have a story per se. However it's not the same as saying it's a bad thing, because onthis sort of shows, the focus isn't the story, and it's more about providing a background where the characters can show what they're worth at making us spend a good 20 mins each week.\\n\\n\r\nArt - 6\\n\r\nNot a masterpiece of detail and fluid overwhelming animation, but again, it's a show that doesn't demand such a thing, it's just, right for what the concept of KMB really is. The designs are very simple, the backgrounds have that borderline children anime watercolor innocence to it, but overall, the characters are very cute and expressive, and look chibi.\\n\\n\r\nSound - 7\\n\r\nAfter an OP that sounds so irritating at the first 2 episodes but ends up getting unavoidable to listen to each week, and after an ED that was awesome since the first day i heard it and even became a popular track for remixes and loops on the internet, what's left to mention is the good job that was done on how the sound carries many of the logic and punch lines behind a huge variety of the hilarious skits along the show. In the end, while the quality of the sound isn't anything of intricate quality, we see a show where the sound plays as much of a role to make things funny as the visuals do.\\n\\n\r\nCharacter - 8\\n\r\nWe have 2 main characters: blonde assassin/student from Russia, Sonya, and short/brown haired airhead Yasuna. Sonya keeps feeling bothered about Yasuna's uncanny will to be friends, and have fun together, and she often comes out as being an impossible to like character due to her cruelty, but which is an interesting approach on a girl which is supposed to be a cold blooded assassin. Yasuna starts the show as the merely annoying dumb girl who always ends up being a victim despite wanting to be friends so badly, however the same insistence of her that feels a bit annoying for how dumb and masochistic it seems early in the show, ends up making Yasuna an endearing character with a simple mind but a huge heart, as she always worried about Sonya and tries to straighten her way out of murderous jobs. These characters are enveloped in an actually touching undertone which never falls off from the humour priority of KMB, but is felt through each time we see Yasuna fall innocently, climaxing in the last episode which, without spoiling, actually made me cry. As the series approach an ending, i couldn't get enough of Yasuna's voice acting and preciousness and even Sonya managed to become somewhat likeable as she's slowly softened up (but not much) by her loyal classmate. Given that \"Character\" was the stat i gave a better rating, it's getting a bit long, but i shall hurry it up with the 3rd main/support character, and perhaps the most popular of the whole show given that many people couldn't see beyond Yasuna's early annoying masochistic antics, Agiri-san simply had, i believe, no defects (perhaps the only problem was not giving her enough air time). Agiri-san is complicated to describe, with a presence and voice that are as feeble as they are powerful, like a drowzee but aware, airheaded but smart or talented but effortless character, she was purely awesome and with a voice as memorable as Yasuna's (except, i believe most people felt captivated by Agiri from her very first appearance) and was one of the driving reasons i waited eagerly for the next episode. Always linked to wacky unexpectedly justifiable ninja techniques with a twist, Agiri often appeared as a random element of surprise, to help out Yasuna and Sonya's troubles or to aid the scenes that otherwise could become too dull.\\n\r\nThere's a 4th character that appears only on about 3 or 4 scenes and the OP, a character that seems pointless, she has no name, and her purpose in appearing is the simple joke (i believe that's the joke) that she's useless and never noticed.\\n\\n\r\nEnjoyment - 7\\n\r\nThis was a show that needed your patience to win your heart because, i understand that, other than Agiri-san, it's not very compelling from the start, until Yasuna's voice and attitude get deep into your head and you get to hope Sonya's ice might be eventually melted somehow. Some early episodes had plenty of dry and dull jokes as well as some drink spilling hilarious ones, whoever with a not very favourable ratio between the two. Overall it does get much better with time because you get to know and antecipate the characters and the type of puns more and more. Personally, early on, i thought i'd end up giving a 6 at best, to this show, but i ended up connecting to the characters more than i imagined, and even got emotional in the last ep. Check it out sometime!",
            "date": "2012-03-31T04:37:00+00:00",
            "helpful_count": 45,
            "mal_id": 57505,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/395186.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/dimanganime",
                "username": "dimanganime"
            },
            "url": "https://myanimelist.net/reviews.php?id=57505"
        },
        {
            "content": "Comedy is probably - no, it IS the most subjective genre in any kind of artistic entertainment. Writing a review for this kind of anime for isn't an easy task, as it can easily contain many personal opinions from the writer. As such, this review will mainly focus in the parts that don't need to be of the likes of the viewer in order to be rated positively or negatively.\r\nWhile the main story ain't something bad, the main problem is that it ain't something new at all. We have our main funny-stupid highschool girl, a serious-antifun girl and a ... ninja. That said, being arandom comedy, it follows the everyday life of the girls and the random things that happens to them while in the school and outside of it. It's very easy to notice that many other anime have done this before, let's take Nichijou and Minami-ke for example. \\n\\n\r\nIn this we can also put the character aspects, since they're almost the same for this kind of anime, having the same development but with differents designs and names. (Design's ain't that different, though)\\n\\n\r\nHowever as I said at the start, this does not make an anime bad, but plots like this being repeated all over again can be kinda annoying and generic.\\n\\n\r\nThe art also differs a bit from other animes, being very simple and moe-like, though not bad at all. It reflects the random, childish and un-serious nature of the series. The animation is consistent, with some unrealistic moves at times, but nothing to be afraid of looking at.\\n\\n\r\nIn the sound department, it is actually good. While most of the scenes are run by only character's voices, short music pieces are put inbetween comedic scenes giving it a child-like ambient. The sound effects are also nice overall, and add to the easy-taking ambient of this anime.\\n\\n\r\nAs I said at the start of this review, being a comedy, the Enjoyment part is something that will vary a lot from one to another. Jokes and entertainment ain't something everybody shares, and as such, giving it a rate is merely subjective. For me, I gave it a 9 as of episode 2, as it made me laugh way more than the first episode.\\n\\n\r\nKill me Baby is far from being a bad anime, but it isn't something new nor something really good to be noteworthy of. Don't expect anything serious, as it is very childish and easy-digesting. If you like random comedies, you can give it a try, but shows like Nichijou have done this already, and in a better way.",
            "date": "2012-01-13T14:20:00+00:00",
            "helpful_count": 37,
            "mal_id": 51711,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/518869.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kokozord",
                "username": "Kokozord"
            },
            "url": "https://myanimelist.net/reviews.php?id=51711"
        },
        {
            "content": "Overview:\r\nRemember Hetalia? The series that used stereotypical characters to represent countries and got WAY more popular in the US than it actually deserved? Imagine you took the characters Italy, Germany, and Japan and put them in a highschool by themselves. Now keep the dynamic and everything about the characters the same only change them from male to female. Lastly get rid of the few fragments of history Hetalia actually had. That is Kill me Baby!\r\nPlot and characters: 2/10\r\nThere really isn't a plot. It is just random shenanigans and the airhead Yasuna (Italy) annoying the short fused \"assassin\" Sonya (Germany). Sometimes the mysterious Agiri(Japan) shows up,but she doesn't really add much. Hetalia wasn't very funny or well written in the first place, but it had highly talented voice actors for the English dub. They could simply yell stupid shit and it would be funny. Unfortunately, this series has voice actors who just don't give a shit! They don't want to work on this series any more than the viewer wants to watch it! It would have at least had a few laughs if it had Patrick Seitz screaming in his terrible German accent.\\n\\n\r\nAnimation: 2/10 \\n\\n\r\nIt is the same moe style animation that Hetalia used with cutesy character designs and very little background art detail or animation budget.\\n\\n\r\nSound: 1/10\\n\\n\r\nThe soundtrack gave me an ulcer.\\n\\n\r\nEnjoyment: 2/10\\n\\n\r\nI think it may have had 1 scene that was sort of funny. This was based on a 4 panel Newspaper manga where there is only time to set up a quick and simple joke each week similar to Garfield or Dilbert. It can be quite challenging to adapt an anime from that kind of format, although Azumanga Daioh pulled it off.\\n\\n\r\nOverall: 2/10\\n\\n\r\nThis is one of those lousy anime that follow in the wake of a popular series and try to rip it off to make a quick dollar. Whenever a blockbuster movie is released, some terrible company like The Assylum or Full Moon will make a cheap ripoff like Snakes on a Train. This is like the Assylum ripoff of Axis Powers Hetalia. Be afraid! Be very afraid!",
            "date": "2014-10-21T02:27:00+00:00",
            "helpful_count": 21,
            "mal_id": 165571,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=165571"
        },
        {
            "content": "I'm the freaking grinch of the new years, mostly because all of my favorite animes and shows are on hold for at least a few weeks because of it. I was happy to see updates on those anime sites so I can get back to watching new animes for a living.\r\n'Kill Me Baby' happened to be the first few drops of water leaking from the crumbling 'New Year's Dam'.\r\nStory - 7\r\nJudging from the fact that this was adapted from a 4koma, I'm pretty sure it's not going to have any continuous plot going for more than two episodes. Setup and premise is clever. No realreason to have a problem about anything.\\n\\n\r\nArt - 7\\n\\n\r\nThis isn't an Evangelion movie of any sort. It has a simple animation style, cartoonish, cute, and just what it needs to be to deliver what it has.\\n\\n\r\nSound - 7\\n\\n\r\nNothing really to say much about this area. Although I can mention the voice for Goshiki Agiri (Blue Ninja) was excellent.\\n\\n\r\nCharacter - 7\\n\\n\r\nThe characters complement and work off each other extremely well.\\n\\n\r\nEnjoyment - 7\\n\\n\r\nThis was a treat I wasn't expecting. I was dreading it to be Produced by DLE, so before I even touched it, I made sure it wasn't going to be a three minute long piece of shit. Laughed a few times, and certainly got what my time was worth.\\n\\n\r\nOverall - 7\\n\\n\r\nThere really isn't a reason not to watch this anime. If you like cute school life comedy, by all means go nuts. Clean 7 anime.",
            "date": "2012-01-06T05:12:00+00:00",
            "helpful_count": 21,
            "mal_id": 51075,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/301688.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Plagus777",
                "username": "Plagus777"
            },
            "url": "https://myanimelist.net/reviews.php?id=51075"
        },
        {
            "content": "Yes, this is good.\r\nKill me Baby is an amazing comedy anime, amazing SoL and amazing meme.\r\nThe origins of this masterpiece root as far back as the legends of Azumanga Daioh, Lucky Star and Hidamari Sketch (believe it or not, both this and Hidamari's mangas are serialized on the same magazine).\r\nStory-wise, this anime is pretty simple.\r\nA teen called Yasuna (who is seemingly retarded)'s friend Sonya (a tsundere) is an assasin that seems to beat the shit out of her at least once a chapter.\r\nDon't feel bad for Oribe, as at least the physical abuse comes when she does something stupid.\r\nThere is also Agiri, a self proclaimedninja who practices her ninja techniques and somehow manages to be cute and savage at the same time.\\n\\n\r\nThe animation, done by J.C Staff is beatuifully done, mixing two artstyles amazingly and animation that can be said as \"KyoAni: Low Budget Version\".\\n\\n\r\nAll the sound on this anime is incredible.\\n\r\n Both the OP and ED will enter your playlist as soon as your hear them for the first time. The OST is morphable. It starts off relaxed and fastens up for more fast-paced moments.\\n\\n\r\nThe voice acting, despite not being a cast full of professionals (except for a certain unused character) does very well.\\n\\n\r\nWith this, i wanted to you to see the authentic masterpiece that is Kill me Baby.\\n\\n\r\nRecommend it to your family, your friends, to everyone.\\n\\n\r\nSpread the word across the world.\\n",
            "date": "2018-04-27T16:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 279163,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6819039.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mireannea",
                "username": "Mireannea"
            },
            "url": "https://myanimelist.net/reviews.php?id=279163"
        },
        {
            "content": "Kill me Baby is a slice of life comedy from 2012. It's based on an ongoing manga by Kaduho that started in 2008 and the anime was adapted by J.C. Staff. They're not exactly strangers to either slice of life or comedic works, having also done such anime as Azumanga Daioh, Hachimitsu to Clover, Potemayo, Love Stage & Nodame Cantabile. So, given that history, the worst we can expect is sub-par and the best is excellent. Then again, they could always hit a new low or high. Let's examine the series and see how it compares. \r\nStory:\r\nYasuna is an ordinary student. Her best friend, Sonya,is an assassin. The two of them go to school and spend a lot of time together. This results in all kinds shenanigans. So, this is essentially a school comedy where the twist is that one of the characters is an assassin. \\n\\n\r\nThe humour is based around a blend of quirky character comedy and physical humour. The biggest flaw with the comedy is definitely that some of the pay offs are really obvious. For example, there's a joke where Yasuna is telling Sonya to treat her like a dog and asks to be given a command. The first command you'd guess is probably the exact one that gets given. There are other jokes like that but, in all fairness to the series, most of them only partly rely on the pay off while partly relying on the character reactions for the humour and the reactions are usually pretty funny. The humour, in general, works quite well. The physical comedy is kind of reminiscent of the physical comedy in Azumanga Daioh. The school comedy is a bit more similar to A-Channel with every episode containing short comedic moments, usually only thinly connected to each other, broken up by transitions. In general, it is entertaining and funny stuff. \\n\\n\r\nWhere the assassin gimmick pays off is that it allows for some different scenarios than you would normally get in this type of anime and some responses that are unique. It gives the series its own sense of identity as opposed to the usual “group of high school girls doing every day things in a quirky fashion.” Of course, different isn't necessarily good and there are certainly times when the humour here doesn't work. In addition to the aforementioned obvious jokes there are times when the physical humour goes a bit too far and crosses the line into being a bit uncomfortable. At least it doesn't take the physical humour anywhere close to the degree that Bokusatsu Tenshi did. \\n\\n\r\nIn terms of non-comedic elements, the transitions are awful. Every episode has multiple transition screens where the lines “kill me baby” & “baby please kill me” will be spoken before moving on. It's not even the length of them that's the issue so much as it is that they're annoying. I do have to give the series some credit as well. The ending does have a fairly sweet moment that really works. \\n\\n\r\nCharacters:\\n\\n\r\nThis series is also different from the usual school comedy in that the cast of characters is pretty small. We have our two major characters, Yasuna and Sonya. We also have Agiri, a ninja and Unusued character, a girl who shows up on rare occasions and never interacts with the other three. The interactions between Yasuna and Sonya are a bit reminiscent of those betwixt Yomi & Tomo from Azumanga. Yasuna is the high energy, crazy one who gets into all kinds of trouble while Sonya is the more subdued one who gets dragged into the mess. Agiri is more a really laid back character who actively trolls the other two while Unused character just really wants to get involved in things but can never manage it. For comedic purposes, it works pretty well but it can be a bit much at times. Here's the thing,  when you've got a really high energy character in a comedic work they can be great, but you start to grow a bit weary of their hijinks when you don't get a break from them. With Azumanga, they gave you that break by having segments that focused on other characters. You don't get that here since Yasuna and Sonya are there constantly. \\n\\n\r\nArt:\\n\\n\r\nKill Me Baby uses even more basic art than a lot of slice of life anime. The background characters are largely indistinct white blobs. The backgrounds themselves frequently look very basic and bland. The character designs of those few characters we actually get are based around having very plain bodies with simple heads that are too large for the bodies. The animation is basically functional but nothing great. The best it gets is the dance in the ending theme tune and that's not exactly at the level of the dances from the PreCure franchise. \\n\\n\r\nSound:\\n\\n\r\nThe big weakness of the acting comes during the transitions. Every time they say the line “Baby, please kill me” they try to do it in a different, quirky way and a good ninety percent of the time it turns out to be really annoying. It's like they were trying to judge how bad they could make them before audiences started turning the program off whenever it reached one. Little did they realise that a mute button exists. That being said, our main cast does a good job. Takabe Ai, Akasaki Chinatsu, Tamura Mutsumi & Kugimiya Rie all deliver their lines very well and it really serves to make the comedy work, when the comedic moments are strong. In terms of music, the background music works nicely. I liked the ending theme tune, didn't like the opening. The problem with the opening is that, like with the transitions, it's overly fond of repeating itself and it uses a lot of spoken words. It's less a song and more people talking while loud music plays. The effect is outright obnoxious. \\n\\n\r\nHo-yay:\\n\\n\r\nThere's quite a bit. Yasuna is very enthusiastic about getting closer to Sonya. She wants them to run along the beach like a couple and there's more than one part where she very blatantly wants Sonya to touch her. I think she might be a masochist looking for Sonya  to “punish” her. I also think Sonya is totally okay with that.\\n\\n\r\nFinal Thoughts:\\n\\n\r\nKill Me Baby is a pretty entertaining series. There are parts that are too obvious or otherwise don't work but, as a whole, it's bloody funny and the twist of having an assassin character does work in its favour. In the end, I give it a solid 7/10. It's a good series, in spite of its flaws. Next week I'll move on to a request I've been working at for a while, Hunter x Hunter 2011.",
            "date": "2017-07-19T14:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 253228,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=253228"
        },
        {
            "content": "At first I when it was one of the latest shows that came out every month, Reading it’s title, I thought it was something like Another, where there are a lot of murders, Suicidal deaths and accidents…\r\nThough it didn’t turn out that way…\r\nEven so Kill me Baby is a very fun anime to watch, though some might judge it based on the animation but the show is fun…\r\njust try to watch it… some famous dubbers such as rie kugimiya is even a part of it…\r\nKill Me Baby : Baby, Please Kill me is a fun-packed show filled with laughter that’ll make you pee is yourseats!\\n\r\n(I’m not saying I did that! XD)",
            "date": "2012-12-23T16:59:00+00:00",
            "helpful_count": 9,
            "mal_id": 81074,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1928708.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/3miL",
                "username": "3miL"
            },
            "url": "https://myanimelist.net/reviews.php?id=81074"
        },
        {
            "content": "A few years ago I had a nostalgia bug and I tried watching the shows of me youth. One of those shows was Ren & Stimpy. Now part of my rewatching these shows was to evaluate if they held up over time, some did and some didn't as you might imagine and unfortunately Ren & Stimpy didn't really hold up in reality like it did in my fond childhood memories. It lacked a lot of the humor, characterization and was more annoying than entertaining in hindsight than I would have thought had I not rewatched it. Now let's imagine for a second this review isabout that show and not about Kill Me Baby and this site is for American cartoons. There are three easy defenses a person can make for Kill- I mean Ren & Stimpy:\\n\\n\r\n1. It's a comedy/ It's not serious it's supposed to be funny!\\n\r\n2. It's a show for Kids! Geez lighten up.\\n\r\n3. It's deeper than you think, you don't understand the show or don't know enough about the genre!\\n\\n\r\nI can see why some people might be inclined to immediately offer some of these arguments especially the second one in terms of a defense for media like this. I just don't really see most of them as a viable defense of either show upon further scrutiny. \\n\\n\r\nThe thing about comedy is and I know this is going to be a ground breaking thought... It has to be funny. The problem is I just don't really find anything in this show funny. The situations they get in aren't well crafted jokes, they aren't jokes based off well established characters or a setting within the show, they aren't parodying a specific genre of anime or something else and they don't really offer anything of substance aside from these extremely obvious ways you can milk comedy. Even the randomness and the absurdity of the show seems anti-humor as it constantly negates the somewhat unique on paper premise of the show and mires it in constant cliches and ordinary situations. At least Ren & Stimpy could sometimes pull a laugh with it's random humor, Log Log Log. About the only joke I found funny in this is the constant uselessness of the \"ninja\" character, because it gave me a small pretense of consistent character and a running gag. Pretty much everything else fell flat in terms of comedy. I think I should further emphasize the fact that the show really does not do anything good with it's initial premise, it seems like it would be rather easy to think up comedic situations that revolve around an assassin doing everyday things, but the show seems almost determined to not do anything funny with this idea. I've seen non-comedy shows have more humor around a serious subject like this, than I did in this \"comedy\" show. Now even with all that going wrong they might have been able to find a joke in the unrelated to the premise situations that they do depict, but the show seems inept at even doing that. I'd like to be able to say \"I can see how someone else can enjoy this but I just personally cant,\" or some kind of fair statement to that effect but I just cant really, nor do I want to imagine the grown-up person who finds any of this funny or enjoyable. \\n\\n\r\nWhich leads me to that second defense, in the case of Ren & Stimpy I do believe the creators of the show originally intended it to be for kids, so fair enough for them on this one I guess, but at least here in the west the only people I have ever seen talk about Kill Me Baby is teens and adults. The premise of the show regardless of whether they take advantage of it or not, seems to exclude children as an audience as I'm not sure how funny kids are supposed to find an assassin being in a school doing ordinary things. Now you can say this isn't the shows fault, I've seen some bad marketing for shows in various regions, for some reason in my area of America, One Punch Man is being marketed to extremely young kids, even though I think the premise of the show and it's main \"gag\" would go right over their little heads as they haven't really seen what it is supposed to be a parody of. Nothing about Kill Me Baby seems especially conducive or appealing to children in a similar manner and as such I just don't really accept this as a defense. I guess you can say it's art style is childish, but I'd just call it bad. As a staple of bad Animation, every three episodes or so you get a few creative shots, but on a whole it just looks bad and unappealing. \\n\\n\r\nOne of the main reasons I wanted to compare this show to Ren and Stimpy was I think the two main characters have a vary similar dynamic. Ren is the straight man who has a violent streak towards his friend, but is usually the grounded one in most situations unless they try to do a \"comedic\" heel turn and have him be wrong about something in favor of Stimpy being right. Stimpy is an annoying grotesque dummy who is constantly annoying and wrong about everything and this is supposed to be balanced out by small moments of charm where Stimpy seems like the nicer one. Sonya is basically Ren and Yasuna is basically Stimpy, but the dynamic is slightly more lopsided in that Sonya seems more grounded in reality than Ren and Yasuna is the worst character ever conceived of by a human. Now some people might think I'm exaggerating a bit but the annoyingness of the Yasuna character honestly almost broke me mentally and physically and I almost quit watching this show several times. Now this is where the defenders of the show might say \"Yeah but she is supposed to be annoying!\" Well this is where I'll say that sometimes you can succeed a little too much in the bad traits of a character. To now reference another thing I'm sure no one on this site cares about, a few years ago I watched the horror movie \"The Babadook.\" On a technical level I thought the movie was pretty good and there was even a lot of good to say about the story and general metaphorical arc of the movie, the problem with this movie though and the reason I'll probably never watch it again despite it's accomplishments in most cinematic areas is the fact that a lot of the movie is filled with a kid being as annoying and needy as possible to his single and already stressed mother. Now similar to Kill Me Baby this kid was supposed to be annoying in fact I'd say it was a key part of the plot and his characterization and the young actor deserves a lot of credit for his acting at his age, but he was too convincing at being annoying to the point that it transcended the movie and just started annoying me in real life. Kill Me Baby has a similar problem, I stopped caring that Sonya was annoyed because I was annoyed by Yasuna near constantly. Annoyance is something that needs balance in something like this, you want to do it enough that it's convincing to the situation the characters are in, but if you do it too much it's just starts actually annoying people. I would say Yasuna is the single worst aspect of the show and taking her out would improve it by about a thousand or so notches. I mean it still wouldn't be funny and enjoyable, but at least I wouldn't have to hear her voice for another second. \\n\\n\r\nLets examine the last defense now, the \"you just don't get it defense.\" Well despite people saying this I didn't see anything particularly deep or meaningful about this show, nor was there any kind of meta-commentary within about anime as a genre or specific anime sub-genres. I think parodying something or doing a meta-commentary might give us too much easy humor to milk and the last thing this show ever seems to want you to do is laugh. It doesn't really touch upon any themes or broad ideas within it's subject matter. It doesn't even aim for the typical cliches a show might aim for like this in Anime like \"Yasuna just wants too cool for school work oriented Japanese people to enjoy life.\" It cant even rise up to the level of tired cliches of that nature. At the end of day, I can give a million other examinations, refutations, observations and intellectual masturbation's about this show and some guy can come along and say \"you still don't le get it.\" I can offer that as a defense of almost anything bad in media that has even the slightest bit of information to make murky peoples attempts to decipher it. I'll go one further though and say I don't even really care if I \"got\" this show and it's supposed depth or not, on a surface level it is bad enough for me to just dismiss any kind of perceived depth that might exist within it's horridly annoying innards.\\n\\n\r\nThis show is the equivalent of having a person poking you in the ear and eyes with a sharp stick and every time you show the mildest amounts of displeasure, a neckbeardian to the side of you constantly tells you to just to enjoy it. Well, I just cant. Happy Happy Joy Joy.",
            "date": "2017-10-21T17:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 261363,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5570690.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Aurochz",
                "username": "Aurochz"
            },
            "url": "https://myanimelist.net/reviews.php?id=261363"
        },
        {
            "content": "I can watch this soo many times over and still giggle at the gags. Such an ingenious creation.\r\nThere's no storyline just stand alone episodes follow what I presume a school year, the comedy side of things are fresh and is both cute and funny.\r\nI would highly recommend this to any audience as it pretty much covers all unless you are without any form of humor.",
            "date": "2015-01-02T08:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 175731,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jetsuey",
                "username": "Jetsuey"
            },
            "url": "https://myanimelist.net/reviews.php?id=175731"
        },
        {
            "content": "This is an amazing anime.i can say its one of my favorite but... it doesnt mean its everyone favorite. i have a few reason why is some people dont think it is as good as i think it is. so this is my thought of this anime\r\nStory (8/10)\r\nThe story is pretty boring. nothing interesting about the story , it basically about a highschool girl that have an assassin as a friend. but i know this anime is not really focused about the story.but in this anime its actually a pretty good thing because, it feel like, if you watch this anime not from thestart or the first episode, you still know what is going on with the story. i'm pretty sure you can start watching in the 5th episode and still know what is going on. so, overall , the story is not that interesting\\n\\n\r\nArt (8/10) \\n\r\nSome people may think that this anime have a pretty good art because its fitting with the theme of \"Comedy\" . but sometimes people don't like that. some people like an anime that is more realistic looking. i can see people like that hate the art of this anime. but some people think its not bad of an artstyle, it looks kinda \"Boring\" i should say. even some say the art is \"Effortless\" . its maybe because it was made in 2012 and theres anime better looking that this anime existed. but of course, some people still think that, this anime artstyle is good as an comedy anime. its simple and cute, it almost look like a chibi imo. so its pretty good\\n\\n\r\nSound (9/10)\\n\r\nThe OP is pretty catchy. but, i can see people doesn't really like it because it feels like the whole lyrics for the OP is just \"Kill me baby\" really. but, the OP is very funny and fitting as the genres of this anime is \"Comedy\". The ED is very catchy and the animation of it, is, cute i should say. The ED of this anime is Very Catchy and fun to listen to. The OST is also very good! nothing much to say about the OST. So, The sound is very good!\\n\\n\r\nCharacters (9/10)\\n\r\nWe Have here Yasuna oribe, which is possibly a highschool student and her friends, Sonya and Goshiki Agiri. Sonya as an Assassin and Agiri as an \\n\r\nNinja. We Have Yasuna as an easy going and foolish person with Sonya as a strong cruel person. and last Agiri as a Mature and Calm person. it made a kinda interesting little story out of these character. i still dont know how to explain it but i love these character because their personality made a great comedy anime. i love them\\n\\n\r\nEnjoyment (7/10)\\n\r\nThe Jokes in this anime is kinda out of places and doesnt makes sense or fitting in some scenarios. it is clever with the characters and the artstyle is very fitting to a \"Comedy\" anime. and the OP and the ED is also pretty funny! but the jokes is sometime. too constant and repetitive, like it need a little break and then give it more jokes. it just throw a bunch of jokes at once and it is kinda overwhelming sometimes. but the most time it is time right and it is fun to watch. some scene is hilarious, overall, this anime is pretty enjoyable. \\n\\n\r\nSo Overall 9/10",
            "date": "2018-08-11T05:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 286177,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7330319.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Acund",
                "username": "Acund"
            },
            "url": "https://myanimelist.net/reviews.php?id=286177"
        },
        {
            "content": "It's not a high budget comedy with a big plot or anything like that.\r\nIt's a show to watch one or two episodes from time to time to relax and laugh a bit, it doesn't have plot at all, the episodes don't correlate with each other, it's just two main characters interacting with silly stuff with help of 3rd one that comes from time to time.\r\nIt looks like a 3 minute show you know but they managed to pull it to 25minutes and for me it was entertaining, i loved the OP and ED yeah the formula it's repetitive it's Yasuna trying to make something funnyand Sonya just ends up getting angry and hitting her, yeah it's simple but they apply it to some original situations and it ends up being funny, at least to me.\\n\\n\r\nThe only thing i encounter a bit disturbing was that in some moments i felt as if Sonya was being too abusive with Yasuna, like she was so kind and genki and Sonya was such a cruel person.",
            "date": "2018-07-15T00:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 284010,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871141.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/S5_0014_81",
                "username": "S5_0014_81"
            },
            "url": "https://myanimelist.net/reviews.php?id=284010"
        },
        {
            "content": "SPOLIERS—- May Include spoilers\r\nIntroduction -Make the kill me,and make me your baby! Its a random anime!\r\nKill me baby is a short 13 episode Anime made by J.C. Staff during spring of 2012.If you want a random anime that doesnt take it self seriously then this is the anime for you.\r\nContent-The anime contains 13 episode along with several short speical episodes that count as one episode itself (OVA).As far as the genre it its a comedic slice of life that can get very random and will not feature a plot whatsoever,instead it uses the basic settings it gives the viewers as the base for the eachepisode.This is also a SFW anime with mild cartoonish violence and little to no swearing. The whole anime itself reminds me of saturday morning cartoons,simple and fun to watch.\\n\\n\r\nPlot- The anime itself doesnt really have a plot,think of it as the simspons or a comedic sitcom,where it uses the basic settings of the show to make every episode possible.With that being said the setting its a typical high school with two main characters who fit the typical 90s cartoon style AKA the cheerful, and dimwitted character(yasuna) along side with the grumpy,and smart character(sonya).This works for this kind of anime,because it doesnt take it self seriously in anyway,if the anime was a plot driven, realstic drama then yes it would fail.\\n\\n\r\nYasuna is the main character here,she is the typical high school girl..well she is unique by being being silly and loud,while sonya the blonde haired girl is a hitman who happens to attend school,obviosuly this anime just pokes fun at the ideas and never gets serious,you will never see a gun being pulled or anyone get killed,so the anime knows its limits.Yasuna often bugs sonya with any little thing she can come up with,such as playing hide and seek or playing a word game.This is where the anime often gets it punchlines from,where it always ends up as sonya being fed up and ends up hurting yasuna,followed by the classic quote of “sonya you’re so mean waaaa” There is also a ninja character who is really just another high school girl being a troll and messing around,often tricking yasuna and sonya with her magic tricks(illusions) many people say she makes the anime what it is,and i agree with that,she is an excellent character all on her own.\\n\\n\r\nThen we have unused character,i have no idea why is she even in the anime,she is useless.The creators barely give her screen time,it would have been nice if she became a main character as well and she redeems her self..but it doesnt happen.\\n\\n\r\nMusic/voice-  The music is pretty simple and goes along well with the cheerful nature of this anime,and includes many japanese elements as well which is a plus. The opening song is pretty cute and well done as it includes the voices from the anime,while the end credits have a catchy dance music which is enjoyable as wel.\\n\\n\r\nNow this may be a surprise but i recommend watching this in english DUB,the voices are very well done.the voice acting is never monotone and the english voices sound very similar to the japanese ones,so if you enjoy watching animes dubbed then go for it.The english voice helped put the nail on the coffin for giving me that old comedic cartoon vibe.\\n\\n\r\nAnimation/Art- this is a comedic anime,so perhaps the best animation isnt needed but it looks cheap and old,and for a short anime they could of done better…again its just a comedic anime so it doesnt nessarily need it. \\n\\n\r\nThe art style is cute and goes well with the cheerful nature of the anime,reminds me of lucky star and yuyushiki. \\n\\n\r\nAppeal- This anime is only around a year old,but the anime has been well recevied by viewers and parodies such as the end credit’s dancing was done in yuru yuri so the appeal is there,and it is a likeable anime without a doubt.\\n\\n\r\nFinal opinion -Kill me baby was a very enjoyable anime,filled with laughs and heart warming moments.However the main problem with the anime is the randomness it contains.At times the anime may have a hilarious episode while the next one may be dull and have too many missed jokes.it feels as if they tried a new idea every episode which isnt so bad,but at the same time i just wanted to skip an entire episode.Also i know this anime isnt serious but it was hard to beleive that sonya would even be yasuna’s friend after all the things she does to her(teases her way too much) other than that this anime was funny and cute so i recomemnd this for slice of life fans and ones who like random funny animes.\\n\\n\r\nHope you enjoy this review \\n\\n\r\nArigatou ^_^",
            "date": "2013-11-23T22:02:00+00:00",
            "helpful_count": 5,
            "mal_id": 121237,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3341903.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ReimuNuggets",
                "username": "ReimuNuggets"
            },
            "url": "https://myanimelist.net/reviews.php?id=121237"
        },
        {
            "content": "Kill Me Baby is a practical piece of work. Since it is merely an animation aimed at bringing 4-koma gags to life on the screens of the audience, its budget is a fraction of major shows that focus on graphical excellence, deep and intriguing plotlines, and of course character development that is well fleshed out.\r\nNevertheless, Kill Me Baby is an anime that competently makes use of the meagre budget as well as handling the transition from 4-koma gags to an anime reasonably well. Considering that it is a comedy show, and as such aimed towards squeezing a laugh out of every person who watches it,I have to admit that KmB does a good job in that respect, but is essentially a rather flat piece of work in all other respects. However, I should clarify that that is through no fault of the anime itself.\\n\\n\r\n4-koma gags do not make for a good story that can carry an anime throughout its airing. Based on its source material, we can safely conclude that KmB is not a series that attempts to develop that. It is basically a succession of animated material that is just slapped together and packaged as an anime. However, its main selling point is of course, hilarity. And I can guarantee you, hilarity definitely ensues. That being said, the anime does not have any semblance of continuity and parts of it do not make sense at all to the casual viewer. This again can be attributed to the nature of the source material. If I were to judge KmB while taking that into account, I would say that KmB is actually a game attempt by the studio to create a good anime. Not \"good\" in the sense of thought-provoking, loaded with heart-aching drama or having bucketfuls of fanservice, but rather that it achieves what it sets out to accomplish, which is to brighten up someone's day.\\n\\n\r\nHmm... art. Now, the art of KmB is flat. Very flat. The show looks like something drawn by the moderately talented preschooler. However, one needs to remember that the show does not have excessive budget on which to blow on those gorgeous, brilliant graphics that cause people to stare, mesmerised at the screen. Thus, the art being of mediocre standard is actually forgivable in this case.\\n\\n\r\nThe sound part is definitely mediocre. The same soundtracks are reused so often that by the time I finished the anime I could almost hum all of 'em. Mention weird songs and KmB's OP comes to mind. Honestly, I could not make heads nor tails of that song, from the animation to the lyrics. However, I feel that the ED is a significant improvement over the OP, not that it would rank in any charts. \\n\\n\r\nI don't believe that there's any need to talk about the characters in detail. Essentially, we have Yasuna = airhead girl, Sonya = paranoid assassin, Agiri = weird ninja and even an Unused Character just for the heck of it. Strange that they called upon Kugimiya Rie for Unused Character though. Overall, the characters are just there doing silly things for the audience's enjoyment. The voice actors were decent and were able to effectively convey the comical moments so that the mood pervades the audience.\\n\\n\r\nFrankly, even though its other aspects were not headed for excellence, KmB really tries very hard in trying to let the audience enjoy it through its funny, hilarious gags. In that, it has succeeded well, in fact exceeding all expectations. The main reason I had for giving KmB my rating was due to me enjoying the series so much and laughing till my sides ached. The hilarious moments will have people literally ROFL.\\n\\n\r\nOverall, KmB is still a decent anime. I'll say this again: its potential was severely hampered by both the funding and the original source material it had to work with. Despite that, KmB makes the most of its situation. Kudos to the people in charge for managing to eke out a thoroughly enjoyable anime from such limited resources. I'm giving it a score of 6, mainly because I enjoyed the comedic interaction between the characters as well as the truly funny gags that successfully made the anime a must-watch for people looking for a comedy anime series.",
            "date": "2012-12-18T03:07:00+00:00",
            "helpful_count": 5,
            "mal_id": 80482,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1909180.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/KiraMikoto",
                "username": "KiraMikoto"
            },
            "url": "https://myanimelist.net/reviews.php?id=80482"
        },
        {
            "content": "Kill me Baby! is something I've seen called fantastic, terrible, or somewhere in between.  After watching it, I have a few things of note to say about it. \r\nI'll start with the cons because I'd like to end on a good note.  \r\nWhile the art style for the characters is very cute, the actual art itself is lacking.  There are quite a few scenes where the background looks like a sketch that was never completed.  Sometimes the background is in black and white even.  \r\nCharacters are not very interesting to me. Oribe is delightfully adorable, and so is Sonya attimes, but overall they aren't really interesting.  \\n\\n\r\nProbably the worst part about the show is that the comedy is really lacking.  Most of the jokes are pretty much the same as others, and it is the reason so many people dislike this anime.  Any laughing is going to come from the deliverance of the jokes (I'll note on this again), not how clever or funny the jokes actually are.  \\n\\n\r\nNow for the pros, which I believe outweigh the cons. \\n\\n\r\nThe art style is god damn adorable.  Oribe and Sonya are so cute together! So is Agiri!  I can't get over how cute this anime is. \\n\\n\r\nSecondly, this anime is just a great time. Even if the jokes aren't great, there isn't anything about watching it that isn't fun.  I really had fun watching this.\\n\\n\r\nTHE MUSIC.  My lord the OST for this anime is really good.  The OP and ED more than anything are so fun(ny).   \\n\\n\r\nThe best thing about this anime is the voice acting.  Holy shit it is really, REALLY good.  You can tell from the OP that the voice actors fit the characters so well.  All of the voice acting here is so well done that sometimes it makes the jokes funny.  Oribe has a particularly adorable voice, and without it I would not have enjoyed the show as much.  In my opinion, the VA carry this anime.  \\n\\n\r\nSo overall the show is a lot of fun, but it isn't fantastic.  A lot is lacking in the comedy department, but I think the voice acting carries this anime enough for me to recommend it.  Just don't be surprised if you don't enjoy it, because many people REALLY dislike this show, and for understandable reasons.",
            "date": "2015-05-20T16:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 188285,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KnifeManofMD",
                "username": "KnifeManofMD"
            },
            "url": "https://myanimelist.net/reviews.php?id=188285"
        },
        {
            "content": "If you want to watch this anime waiting for a splendid story, with many fights or unusual adventures, sorry, but you will not like this series.\r\nBefore starting to see this anime, it is necessary not to take it seriously. Contrary to the opening, each episode is a set of fun sketchs played in a school about two girls, one being very optimistic and other a professional killer. Even appearing, the anime has no story and all episodes have no connection.\r\nThere are mostly just four characters presented throughout the plot, the people around are just \"sketches\", but the ones that are presented are very entertaining andcaptivating. The soundtrack is also good, the opening and ending of the series as well.\\n\\n\r\nI usually say that this anime has accomplished the only goal it offered viewers: a good, light and fun comedy to follow.",
            "date": "2017-10-22T14:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 261446,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4661810.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Otark",
                "username": "Otark"
            },
            "url": "https://myanimelist.net/reviews.php?id=261446"
        },
        {
            "content": "Hilarious!!\r\nwhy this anime got a bad rating? frankly, i watch it without any disappointment. there is a rare anime that can make me laughing frivolously. and this anime is the one that could make it happen. hahaha\\n\r\nI love this anime because the character is cute and with the uncomprehend background like ninja and a killer. all the gag is always funny! every chapter in each episode give me enjoyment and happiness. and the story is rich of convulsing part. \\n\\n\r\nYasuna Oribe always having some idea to make the spoof fresher and give an unexpected responses. how Sonya treat her is funny too!\\n\\n\r\nKILL ME BABY\\n",
            "date": "2017-10-12T03:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 260563,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3629191.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hendrik_COH",
                "username": "Hendrik_COH"
            },
            "url": "https://myanimelist.net/reviews.php?id=260563"
        },
        {
            "content": "This one is not easy to rate. Art is simple, story not even there.\r\nI really liked the intro, because it's so whacky. Everyone is out of sync, video has nothing to do with the anime, i still like it.\r\nOuttro was plain compared to the intro.\r\nYou can't even give spoilers here, because you there is nothing you can spoil, besides three girls just doing antics.\r\nTo be honest, i don't know why i liked this. BUT when you got some drinks or had some weed it really is good for a ride.\r\nWARNING: Don't look more than two episodes at a time, your brain will meld.\r\nAgain, was funeven if i don't know why, just try 1-2 episodes and see if you like it.\\n\\n",
            "date": "2015-02-26T07:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 181250,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4424505.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Rohling",
                "username": "Rohling"
            },
            "url": "https://myanimelist.net/reviews.php?id=181250"
        }
    ],
    [
        {
            "content": "I feel I have to write this review because a lot of people just aren't getting it. This show is not meant to be taken seriously; it's a joke. This is not some romantic comedy where the characters drastically change and have inspirational quotes. This show is just randomness. It's like a poo poo joke that never ceases to be funny. So if you're thinking about watching this show ask yourself these questions. Do I like random acts of comedy or do I like strong plots? Do I like generic characters or do I like characters that change over time? This is just for thenewcomers who I feel might be discouraged by the previous reviewers who just don't understand real comedy.",
            "date": "2017-03-26T06:21:00+00:00",
            "helpful_count": 121,
            "mal_id": 243580,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4298835.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlphaNinerNiner",
                "username": "AlphaNinerNiner"
            },
            "url": "https://myanimelist.net/reviews.php?id=243580"
        },
        {
            "content": "The funny thing about comedy series is that they either \"click\" with you or they don't. Some series, like Nichijou, may take a few episodes, but Kill Me Baby is a lot more immediate (or shallow, if you will.) In fact, the best way to decide if you want to watch this series is to watch a sketch or two. That's all there is to an episode of Kill me Baby: a rapid succession of 4-koma gags, directly translated to the screen.\r\nYasuno and Sonya don't get much in terms of characterization. They are the traditional vapid air-head and irritable straight man from manzai comedy. Agiriis even more of a prop for additional jokes rather than a character proper. The art is minimalistic, ditto for the soundtrack. The OP is a weird polka that may take a few times to get used to, while the EP is a pretty catchy pop tune accompanied by nifty dance moves.\\n\\n\r\nSpeaking of sound, the voice actresses do a bang-up job. Yasuno's is a relatively newcomer, while Sonya's has more roles playing boys than girls, but they carry the show, making some jokes that could otherwise fall flat side-splitting funny. Agiri's voice is high and annoying, but I guess that's what they were aiming for. And it's a welcome surprise to see a Kugimiya character get the short stick (she's the redhead \"unused character.\")\\n\\n\r\nKill Me Baby uses a fraction of the budget that JC Staff allocates for its flagship projects, but it squeezes as many laughs per yen as humanly possible. The next time you feel you are not in the mood for elaborate battles, complex plots and philosophical exploration, give it a spin.",
            "date": "2012-01-30T09:29:00+00:00",
            "helpful_count": 136,
            "mal_id": 52871,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/436364.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/sciencewarrior",
                "username": "sciencewarrior"
            },
            "url": "https://myanimelist.net/reviews.php?id=52871"
        },
        {
            "content": "I remember watching a couple scenes out of context from Kill me baby on youtube months ago and to be fair, they were random enough to be funny. The characters were quirky and the situations were absurd, which is just what any comedy of this type needs to be succesful or at the very least enjoyable. It was immediately apparent as soon as I watched the very first episodes that I was wrong.\r\nKill me baby is the kind of series that sets a ridiculous premise and then never lives up to it, the kind of comedy that presents itself as completely demented and over-the-top butnever leaves the comfort zone of character-based jokes, the kind of experience that hypes itself to stardom but settles for mediocrity instead - It simply doesn't have enough to push the show forward.\\n\\n\\n\r\nThe ridiculous premise quickly degenerates into a mere gimmick due to sheer repetition of the same trite, formulaic jokes. They all play out the same way: Yasuna does something silly, she gets knocked out by the annoyed Sonya the assassin, while Agiri the ninja does something random, if she is around while that happens… you can generally predict how the joke plays out before it even starts, which is exactly as exciting as it sounds. \\n\\n\r\nBut beyond that, three characters are simply not enough to carry a comedy show for twelve full-length episodes. Any succesful comedy series I can think of – let's say Azumanga Daioh – had a diverse enough set of side characters that prevented the show from reaching the point of stalemate and kept the show relatively fresh despite the length.\\n\\n\r\nAt this point I wonder how Kill me Baby would have fared if it was a 3-minutes short series… as a friend of mine commented on the series: “it was tolerable back when I watched it weekly”, which is something I can honestly believe, as from my experience, the more often I watched an episode of Kill me Baby, the harder it was to pull through it and by applying that rule on a more abstract level, then you're better off not watching it at all. The opening track, \"Kill Me Baby\", arguably the worst opening song for a show of all time pretty much represents the show as a whole - weird at first,  annoying and repetitive after you hear it once. Stay away.",
            "date": "2015-02-18T09:02:00+00:00",
            "helpful_count": 53,
            "mal_id": 180712,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1331431.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Valkqt",
                "username": "Valkqt"
            },
            "url": "https://myanimelist.net/reviews.php?id=180712"
        },
        {
            "content": "Kill Me Baby is one interesting anime to watch and to review, but particularly to evolve with the characters and how you relate to their presence on each episode and the show in general, which makes it sort of slow started, but ends up being an endearing 4-koma. So, here we go:\r\nStory - 6\r\nLook at it however you want, this is, at the end of the day, just another slapstick show about wacky schoolgirls. The story isn't anything special, and, at first it doesn't even seem to have a story per se. However it's not the same as saying it's a bad thing, because onthis sort of shows, the focus isn't the story, and it's more about providing a background where the characters can show what they're worth at making us spend a good 20 mins each week.\\n\\n\r\nArt - 6\\n\r\nNot a masterpiece of detail and fluid overwhelming animation, but again, it's a show that doesn't demand such a thing, it's just, right for what the concept of KMB really is. The designs are very simple, the backgrounds have that borderline children anime watercolor innocence to it, but overall, the characters are very cute and expressive, and look chibi.\\n\\n\r\nSound - 7\\n\r\nAfter an OP that sounds so irritating at the first 2 episodes but ends up getting unavoidable to listen to each week, and after an ED that was awesome since the first day i heard it and even became a popular track for remixes and loops on the internet, what's left to mention is the good job that was done on how the sound carries many of the logic and punch lines behind a huge variety of the hilarious skits along the show. In the end, while the quality of the sound isn't anything of intricate quality, we see a show where the sound plays as much of a role to make things funny as the visuals do.\\n\\n\r\nCharacter - 8\\n\r\nWe have 2 main characters: blonde assassin/student from Russia, Sonya, and short/brown haired airhead Yasuna. Sonya keeps feeling bothered about Yasuna's uncanny will to be friends, and have fun together, and she often comes out as being an impossible to like character due to her cruelty, but which is an interesting approach on a girl which is supposed to be a cold blooded assassin. Yasuna starts the show as the merely annoying dumb girl who always ends up being a victim despite wanting to be friends so badly, however the same insistence of her that feels a bit annoying for how dumb and masochistic it seems early in the show, ends up making Yasuna an endearing character with a simple mind but a huge heart, as she always worried about Sonya and tries to straighten her way out of murderous jobs. These characters are enveloped in an actually touching undertone which never falls off from the humour priority of KMB, but is felt through each time we see Yasuna fall innocently, climaxing in the last episode which, without spoiling, actually made me cry. As the series approach an ending, i couldn't get enough of Yasuna's voice acting and preciousness and even Sonya managed to become somewhat likeable as she's slowly softened up (but not much) by her loyal classmate. Given that \"Character\" was the stat i gave a better rating, it's getting a bit long, but i shall hurry it up with the 3rd main/support character, and perhaps the most popular of the whole show given that many people couldn't see beyond Yasuna's early annoying masochistic antics, Agiri-san simply had, i believe, no defects (perhaps the only problem was not giving her enough air time). Agiri-san is complicated to describe, with a presence and voice that are as feeble as they are powerful, like a drowzee but aware, airheaded but smart or talented but effortless character, she was purely awesome and with a voice as memorable as Yasuna's (except, i believe most people felt captivated by Agiri from her very first appearance) and was one of the driving reasons i waited eagerly for the next episode. Always linked to wacky unexpectedly justifiable ninja techniques with a twist, Agiri often appeared as a random element of surprise, to help out Yasuna and Sonya's troubles or to aid the scenes that otherwise could become too dull.\\n\r\nThere's a 4th character that appears only on about 3 or 4 scenes and the OP, a character that seems pointless, she has no name, and her purpose in appearing is the simple joke (i believe that's the joke) that she's useless and never noticed.\\n\\n\r\nEnjoyment - 7\\n\r\nThis was a show that needed your patience to win your heart because, i understand that, other than Agiri-san, it's not very compelling from the start, until Yasuna's voice and attitude get deep into your head and you get to hope Sonya's ice might be eventually melted somehow. Some early episodes had plenty of dry and dull jokes as well as some drink spilling hilarious ones, whoever with a not very favourable ratio between the two. Overall it does get much better with time because you get to know and antecipate the characters and the type of puns more and more. Personally, early on, i thought i'd end up giving a 6 at best, to this show, but i ended up connecting to the characters more than i imagined, and even got emotional in the last ep. Check it out sometime!",
            "date": "2012-03-31T04:37:00+00:00",
            "helpful_count": 45,
            "mal_id": 57505,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/395186.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/dimanganime",
                "username": "dimanganime"
            },
            "url": "https://myanimelist.net/reviews.php?id=57505"
        },
        {
            "content": "Comedy is probably - no, it IS the most subjective genre in any kind of artistic entertainment. Writing a review for this kind of anime for isn't an easy task, as it can easily contain many personal opinions from the writer. As such, this review will mainly focus in the parts that don't need to be of the likes of the viewer in order to be rated positively or negatively.\r\nWhile the main story ain't something bad, the main problem is that it ain't something new at all. We have our main funny-stupid highschool girl, a serious-antifun girl and a ... ninja. That said, being arandom comedy, it follows the everyday life of the girls and the random things that happens to them while in the school and outside of it. It's very easy to notice that many other anime have done this before, let's take Nichijou and Minami-ke for example. \\n\\n\r\nIn this we can also put the character aspects, since they're almost the same for this kind of anime, having the same development but with differents designs and names. (Design's ain't that different, though)\\n\\n\r\nHowever as I said at the start, this does not make an anime bad, but plots like this being repeated all over again can be kinda annoying and generic.\\n\\n\r\nThe art also differs a bit from other animes, being very simple and moe-like, though not bad at all. It reflects the random, childish and un-serious nature of the series. The animation is consistent, with some unrealistic moves at times, but nothing to be afraid of looking at.\\n\\n\r\nIn the sound department, it is actually good. While most of the scenes are run by only character's voices, short music pieces are put inbetween comedic scenes giving it a child-like ambient. The sound effects are also nice overall, and add to the easy-taking ambient of this anime.\\n\\n\r\nAs I said at the start of this review, being a comedy, the Enjoyment part is something that will vary a lot from one to another. Jokes and entertainment ain't something everybody shares, and as such, giving it a rate is merely subjective. For me, I gave it a 9 as of episode 2, as it made me laugh way more than the first episode.\\n\\n\r\nKill me Baby is far from being a bad anime, but it isn't something new nor something really good to be noteworthy of. Don't expect anything serious, as it is very childish and easy-digesting. If you like random comedies, you can give it a try, but shows like Nichijou have done this already, and in a better way.",
            "date": "2012-01-13T14:20:00+00:00",
            "helpful_count": 37,
            "mal_id": 51711,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/518869.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kokozord",
                "username": "Kokozord"
            },
            "url": "https://myanimelist.net/reviews.php?id=51711"
        },
        {
            "content": "Overview:\r\nRemember Hetalia? The series that used stereotypical characters to represent countries and got WAY more popular in the US than it actually deserved? Imagine you took the characters Italy, Germany, and Japan and put them in a highschool by themselves. Now keep the dynamic and everything about the characters the same only change them from male to female. Lastly get rid of the few fragments of history Hetalia actually had. That is Kill me Baby!\r\nPlot and characters: 2/10\r\nThere really isn't a plot. It is just random shenanigans and the airhead Yasuna (Italy) annoying the short fused \"assassin\" Sonya (Germany). Sometimes the mysterious Agiri(Japan) shows up,but she doesn't really add much. Hetalia wasn't very funny or well written in the first place, but it had highly talented voice actors for the English dub. They could simply yell stupid shit and it would be funny. Unfortunately, this series has voice actors who just don't give a shit! They don't want to work on this series any more than the viewer wants to watch it! It would have at least had a few laughs if it had Patrick Seitz screaming in his terrible German accent.\\n\\n\r\nAnimation: 2/10 \\n\\n\r\nIt is the same moe style animation that Hetalia used with cutesy character designs and very little background art detail or animation budget.\\n\\n\r\nSound: 1/10\\n\\n\r\nThe soundtrack gave me an ulcer.\\n\\n\r\nEnjoyment: 2/10\\n\\n\r\nI think it may have had 1 scene that was sort of funny. This was based on a 4 panel Newspaper manga where there is only time to set up a quick and simple joke each week similar to Garfield or Dilbert. It can be quite challenging to adapt an anime from that kind of format, although Azumanga Daioh pulled it off.\\n\\n\r\nOverall: 2/10\\n\\n\r\nThis is one of those lousy anime that follow in the wake of a popular series and try to rip it off to make a quick dollar. Whenever a blockbuster movie is released, some terrible company like The Assylum or Full Moon will make a cheap ripoff like Snakes on a Train. This is like the Assylum ripoff of Axis Powers Hetalia. Be afraid! Be very afraid!",
            "date": "2014-10-21T02:27:00+00:00",
            "helpful_count": 21,
            "mal_id": 165571,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=165571"
        },
        {
            "content": "I'm the freaking grinch of the new years, mostly because all of my favorite animes and shows are on hold for at least a few weeks because of it. I was happy to see updates on those anime sites so I can get back to watching new animes for a living.\r\n'Kill Me Baby' happened to be the first few drops of water leaking from the crumbling 'New Year's Dam'.\r\nStory - 7\r\nJudging from the fact that this was adapted from a 4koma, I'm pretty sure it's not going to have any continuous plot going for more than two episodes. Setup and premise is clever. No realreason to have a problem about anything.\\n\\n\r\nArt - 7\\n\\n\r\nThis isn't an Evangelion movie of any sort. It has a simple animation style, cartoonish, cute, and just what it needs to be to deliver what it has.\\n\\n\r\nSound - 7\\n\\n\r\nNothing really to say much about this area. Although I can mention the voice for Goshiki Agiri (Blue Ninja) was excellent.\\n\\n\r\nCharacter - 7\\n\\n\r\nThe characters complement and work off each other extremely well.\\n\\n\r\nEnjoyment - 7\\n\\n\r\nThis was a treat I wasn't expecting. I was dreading it to be Produced by DLE, so before I even touched it, I made sure it wasn't going to be a three minute long piece of shit. Laughed a few times, and certainly got what my time was worth.\\n\\n\r\nOverall - 7\\n\\n\r\nThere really isn't a reason not to watch this anime. If you like cute school life comedy, by all means go nuts. Clean 7 anime.",
            "date": "2012-01-06T05:12:00+00:00",
            "helpful_count": 21,
            "mal_id": 51075,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/301688.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Plagus777",
                "username": "Plagus777"
            },
            "url": "https://myanimelist.net/reviews.php?id=51075"
        },
        {
            "content": "Yes, this is good.\r\nKill me Baby is an amazing comedy anime, amazing SoL and amazing meme.\r\nThe origins of this masterpiece root as far back as the legends of Azumanga Daioh, Lucky Star and Hidamari Sketch (believe it or not, both this and Hidamari's mangas are serialized on the same magazine).\r\nStory-wise, this anime is pretty simple.\r\nA teen called Yasuna (who is seemingly retarded)'s friend Sonya (a tsundere) is an assasin that seems to beat the shit out of her at least once a chapter.\r\nDon't feel bad for Oribe, as at least the physical abuse comes when she does something stupid.\r\nThere is also Agiri, a self proclaimedninja who practices her ninja techniques and somehow manages to be cute and savage at the same time.\\n\\n\r\nThe animation, done by J.C Staff is beatuifully done, mixing two artstyles amazingly and animation that can be said as \"KyoAni: Low Budget Version\".\\n\\n\r\nAll the sound on this anime is incredible.\\n\r\n Both the OP and ED will enter your playlist as soon as your hear them for the first time. The OST is morphable. It starts off relaxed and fastens up for more fast-paced moments.\\n\\n\r\nThe voice acting, despite not being a cast full of professionals (except for a certain unused character) does very well.\\n\\n\r\nWith this, i wanted to you to see the authentic masterpiece that is Kill me Baby.\\n\\n\r\nRecommend it to your family, your friends, to everyone.\\n\\n\r\nSpread the word across the world.\\n",
            "date": "2018-04-27T16:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 279163,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6819039.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mireannea",
                "username": "Mireannea"
            },
            "url": "https://myanimelist.net/reviews.php?id=279163"
        },
        {
            "content": "Kill me Baby is a slice of life comedy from 2012. It's based on an ongoing manga by Kaduho that started in 2008 and the anime was adapted by J.C. Staff. They're not exactly strangers to either slice of life or comedic works, having also done such anime as Azumanga Daioh, Hachimitsu to Clover, Potemayo, Love Stage & Nodame Cantabile. So, given that history, the worst we can expect is sub-par and the best is excellent. Then again, they could always hit a new low or high. Let's examine the series and see how it compares. \r\nStory:\r\nYasuna is an ordinary student. Her best friend, Sonya,is an assassin. The two of them go to school and spend a lot of time together. This results in all kinds shenanigans. So, this is essentially a school comedy where the twist is that one of the characters is an assassin. \\n\\n\r\nThe humour is based around a blend of quirky character comedy and physical humour. The biggest flaw with the comedy is definitely that some of the pay offs are really obvious. For example, there's a joke where Yasuna is telling Sonya to treat her like a dog and asks to be given a command. The first command you'd guess is probably the exact one that gets given. There are other jokes like that but, in all fairness to the series, most of them only partly rely on the pay off while partly relying on the character reactions for the humour and the reactions are usually pretty funny. The humour, in general, works quite well. The physical comedy is kind of reminiscent of the physical comedy in Azumanga Daioh. The school comedy is a bit more similar to A-Channel with every episode containing short comedic moments, usually only thinly connected to each other, broken up by transitions. In general, it is entertaining and funny stuff. \\n\\n\r\nWhere the assassin gimmick pays off is that it allows for some different scenarios than you would normally get in this type of anime and some responses that are unique. It gives the series its own sense of identity as opposed to the usual “group of high school girls doing every day things in a quirky fashion.” Of course, different isn't necessarily good and there are certainly times when the humour here doesn't work. In addition to the aforementioned obvious jokes there are times when the physical humour goes a bit too far and crosses the line into being a bit uncomfortable. At least it doesn't take the physical humour anywhere close to the degree that Bokusatsu Tenshi did. \\n\\n\r\nIn terms of non-comedic elements, the transitions are awful. Every episode has multiple transition screens where the lines “kill me baby” & “baby please kill me” will be spoken before moving on. It's not even the length of them that's the issue so much as it is that they're annoying. I do have to give the series some credit as well. The ending does have a fairly sweet moment that really works. \\n\\n\r\nCharacters:\\n\\n\r\nThis series is also different from the usual school comedy in that the cast of characters is pretty small. We have our two major characters, Yasuna and Sonya. We also have Agiri, a ninja and Unusued character, a girl who shows up on rare occasions and never interacts with the other three. The interactions between Yasuna and Sonya are a bit reminiscent of those betwixt Yomi & Tomo from Azumanga. Yasuna is the high energy, crazy one who gets into all kinds of trouble while Sonya is the more subdued one who gets dragged into the mess. Agiri is more a really laid back character who actively trolls the other two while Unused character just really wants to get involved in things but can never manage it. For comedic purposes, it works pretty well but it can be a bit much at times. Here's the thing,  when you've got a really high energy character in a comedic work they can be great, but you start to grow a bit weary of their hijinks when you don't get a break from them. With Azumanga, they gave you that break by having segments that focused on other characters. You don't get that here since Yasuna and Sonya are there constantly. \\n\\n\r\nArt:\\n\\n\r\nKill Me Baby uses even more basic art than a lot of slice of life anime. The background characters are largely indistinct white blobs. The backgrounds themselves frequently look very basic and bland. The character designs of those few characters we actually get are based around having very plain bodies with simple heads that are too large for the bodies. The animation is basically functional but nothing great. The best it gets is the dance in the ending theme tune and that's not exactly at the level of the dances from the PreCure franchise. \\n\\n\r\nSound:\\n\\n\r\nThe big weakness of the acting comes during the transitions. Every time they say the line “Baby, please kill me” they try to do it in a different, quirky way and a good ninety percent of the time it turns out to be really annoying. It's like they were trying to judge how bad they could make them before audiences started turning the program off whenever it reached one. Little did they realise that a mute button exists. That being said, our main cast does a good job. Takabe Ai, Akasaki Chinatsu, Tamura Mutsumi & Kugimiya Rie all deliver their lines very well and it really serves to make the comedy work, when the comedic moments are strong. In terms of music, the background music works nicely. I liked the ending theme tune, didn't like the opening. The problem with the opening is that, like with the transitions, it's overly fond of repeating itself and it uses a lot of spoken words. It's less a song and more people talking while loud music plays. The effect is outright obnoxious. \\n\\n\r\nHo-yay:\\n\\n\r\nThere's quite a bit. Yasuna is very enthusiastic about getting closer to Sonya. She wants them to run along the beach like a couple and there's more than one part where she very blatantly wants Sonya to touch her. I think she might be a masochist looking for Sonya  to “punish” her. I also think Sonya is totally okay with that.\\n\\n\r\nFinal Thoughts:\\n\\n\r\nKill Me Baby is a pretty entertaining series. There are parts that are too obvious or otherwise don't work but, as a whole, it's bloody funny and the twist of having an assassin character does work in its favour. In the end, I give it a solid 7/10. It's a good series, in spite of its flaws. Next week I'll move on to a request I've been working at for a while, Hunter x Hunter 2011.",
            "date": "2017-07-19T14:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 253228,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=253228"
        },
        {
            "content": "At first I when it was one of the latest shows that came out every month, Reading it’s title, I thought it was something like Another, where there are a lot of murders, Suicidal deaths and accidents…\r\nThough it didn’t turn out that way…\r\nEven so Kill me Baby is a very fun anime to watch, though some might judge it based on the animation but the show is fun…\r\njust try to watch it… some famous dubbers such as rie kugimiya is even a part of it…\r\nKill Me Baby : Baby, Please Kill me is a fun-packed show filled with laughter that’ll make you pee is yourseats!\\n\r\n(I’m not saying I did that! XD)",
            "date": "2012-12-23T16:59:00+00:00",
            "helpful_count": 9,
            "mal_id": 81074,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1928708.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/3miL",
                "username": "3miL"
            },
            "url": "https://myanimelist.net/reviews.php?id=81074"
        },
        {
            "content": "A few years ago I had a nostalgia bug and I tried watching the shows of me youth. One of those shows was Ren & Stimpy. Now part of my rewatching these shows was to evaluate if they held up over time, some did and some didn't as you might imagine and unfortunately Ren & Stimpy didn't really hold up in reality like it did in my fond childhood memories. It lacked a lot of the humor, characterization and was more annoying than entertaining in hindsight than I would have thought had I not rewatched it. Now let's imagine for a second this review isabout that show and not about Kill Me Baby and this site is for American cartoons. There are three easy defenses a person can make for Kill- I mean Ren & Stimpy:\\n\\n\r\n1. It's a comedy/ It's not serious it's supposed to be funny!\\n\r\n2. It's a show for Kids! Geez lighten up.\\n\r\n3. It's deeper than you think, you don't understand the show or don't know enough about the genre!\\n\\n\r\nI can see why some people might be inclined to immediately offer some of these arguments especially the second one in terms of a defense for media like this. I just don't really see most of them as a viable defense of either show upon further scrutiny. \\n\\n\r\nThe thing about comedy is and I know this is going to be a ground breaking thought... It has to be funny. The problem is I just don't really find anything in this show funny. The situations they get in aren't well crafted jokes, they aren't jokes based off well established characters or a setting within the show, they aren't parodying a specific genre of anime or something else and they don't really offer anything of substance aside from these extremely obvious ways you can milk comedy. Even the randomness and the absurdity of the show seems anti-humor as it constantly negates the somewhat unique on paper premise of the show and mires it in constant cliches and ordinary situations. At least Ren & Stimpy could sometimes pull a laugh with it's random humor, Log Log Log. About the only joke I found funny in this is the constant uselessness of the \"ninja\" character, because it gave me a small pretense of consistent character and a running gag. Pretty much everything else fell flat in terms of comedy. I think I should further emphasize the fact that the show really does not do anything good with it's initial premise, it seems like it would be rather easy to think up comedic situations that revolve around an assassin doing everyday things, but the show seems almost determined to not do anything funny with this idea. I've seen non-comedy shows have more humor around a serious subject like this, than I did in this \"comedy\" show. Now even with all that going wrong they might have been able to find a joke in the unrelated to the premise situations that they do depict, but the show seems inept at even doing that. I'd like to be able to say \"I can see how someone else can enjoy this but I just personally cant,\" or some kind of fair statement to that effect but I just cant really, nor do I want to imagine the grown-up person who finds any of this funny or enjoyable. \\n\\n\r\nWhich leads me to that second defense, in the case of Ren & Stimpy I do believe the creators of the show originally intended it to be for kids, so fair enough for them on this one I guess, but at least here in the west the only people I have ever seen talk about Kill Me Baby is teens and adults. The premise of the show regardless of whether they take advantage of it or not, seems to exclude children as an audience as I'm not sure how funny kids are supposed to find an assassin being in a school doing ordinary things. Now you can say this isn't the shows fault, I've seen some bad marketing for shows in various regions, for some reason in my area of America, One Punch Man is being marketed to extremely young kids, even though I think the premise of the show and it's main \"gag\" would go right over their little heads as they haven't really seen what it is supposed to be a parody of. Nothing about Kill Me Baby seems especially conducive or appealing to children in a similar manner and as such I just don't really accept this as a defense. I guess you can say it's art style is childish, but I'd just call it bad. As a staple of bad Animation, every three episodes or so you get a few creative shots, but on a whole it just looks bad and unappealing. \\n\\n\r\nOne of the main reasons I wanted to compare this show to Ren and Stimpy was I think the two main characters have a vary similar dynamic. Ren is the straight man who has a violent streak towards his friend, but is usually the grounded one in most situations unless they try to do a \"comedic\" heel turn and have him be wrong about something in favor of Stimpy being right. Stimpy is an annoying grotesque dummy who is constantly annoying and wrong about everything and this is supposed to be balanced out by small moments of charm where Stimpy seems like the nicer one. Sonya is basically Ren and Yasuna is basically Stimpy, but the dynamic is slightly more lopsided in that Sonya seems more grounded in reality than Ren and Yasuna is the worst character ever conceived of by a human. Now some people might think I'm exaggerating a bit but the annoyingness of the Yasuna character honestly almost broke me mentally and physically and I almost quit watching this show several times. Now this is where the defenders of the show might say \"Yeah but she is supposed to be annoying!\" Well this is where I'll say that sometimes you can succeed a little too much in the bad traits of a character. To now reference another thing I'm sure no one on this site cares about, a few years ago I watched the horror movie \"The Babadook.\" On a technical level I thought the movie was pretty good and there was even a lot of good to say about the story and general metaphorical arc of the movie, the problem with this movie though and the reason I'll probably never watch it again despite it's accomplishments in most cinematic areas is the fact that a lot of the movie is filled with a kid being as annoying and needy as possible to his single and already stressed mother. Now similar to Kill Me Baby this kid was supposed to be annoying in fact I'd say it was a key part of the plot and his characterization and the young actor deserves a lot of credit for his acting at his age, but he was too convincing at being annoying to the point that it transcended the movie and just started annoying me in real life. Kill Me Baby has a similar problem, I stopped caring that Sonya was annoyed because I was annoyed by Yasuna near constantly. Annoyance is something that needs balance in something like this, you want to do it enough that it's convincing to the situation the characters are in, but if you do it too much it's just starts actually annoying people. I would say Yasuna is the single worst aspect of the show and taking her out would improve it by about a thousand or so notches. I mean it still wouldn't be funny and enjoyable, but at least I wouldn't have to hear her voice for another second. \\n\\n\r\nLets examine the last defense now, the \"you just don't get it defense.\" Well despite people saying this I didn't see anything particularly deep or meaningful about this show, nor was there any kind of meta-commentary within about anime as a genre or specific anime sub-genres. I think parodying something or doing a meta-commentary might give us too much easy humor to milk and the last thing this show ever seems to want you to do is laugh. It doesn't really touch upon any themes or broad ideas within it's subject matter. It doesn't even aim for the typical cliches a show might aim for like this in Anime like \"Yasuna just wants too cool for school work oriented Japanese people to enjoy life.\" It cant even rise up to the level of tired cliches of that nature. At the end of day, I can give a million other examinations, refutations, observations and intellectual masturbation's about this show and some guy can come along and say \"you still don't le get it.\" I can offer that as a defense of almost anything bad in media that has even the slightest bit of information to make murky peoples attempts to decipher it. I'll go one further though and say I don't even really care if I \"got\" this show and it's supposed depth or not, on a surface level it is bad enough for me to just dismiss any kind of perceived depth that might exist within it's horridly annoying innards.\\n\\n\r\nThis show is the equivalent of having a person poking you in the ear and eyes with a sharp stick and every time you show the mildest amounts of displeasure, a neckbeardian to the side of you constantly tells you to just to enjoy it. Well, I just cant. Happy Happy Joy Joy.",
            "date": "2017-10-21T17:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 261363,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5570690.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Aurochz",
                "username": "Aurochz"
            },
            "url": "https://myanimelist.net/reviews.php?id=261363"
        },
        {
            "content": "I can watch this soo many times over and still giggle at the gags. Such an ingenious creation.\r\nThere's no storyline just stand alone episodes follow what I presume a school year, the comedy side of things are fresh and is both cute and funny.\r\nI would highly recommend this to any audience as it pretty much covers all unless you are without any form of humor.",
            "date": "2015-01-02T08:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 175731,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jetsuey",
                "username": "Jetsuey"
            },
            "url": "https://myanimelist.net/reviews.php?id=175731"
        },
        {
            "content": "This is an amazing anime.i can say its one of my favorite but... it doesnt mean its everyone favorite. i have a few reason why is some people dont think it is as good as i think it is. so this is my thought of this anime\r\nStory (8/10)\r\nThe story is pretty boring. nothing interesting about the story , it basically about a highschool girl that have an assassin as a friend. but i know this anime is not really focused about the story.but in this anime its actually a pretty good thing because, it feel like, if you watch this anime not from thestart or the first episode, you still know what is going on with the story. i'm pretty sure you can start watching in the 5th episode and still know what is going on. so, overall , the story is not that interesting\\n\\n\r\nArt (8/10) \\n\r\nSome people may think that this anime have a pretty good art because its fitting with the theme of \"Comedy\" . but sometimes people don't like that. some people like an anime that is more realistic looking. i can see people like that hate the art of this anime. but some people think its not bad of an artstyle, it looks kinda \"Boring\" i should say. even some say the art is \"Effortless\" . its maybe because it was made in 2012 and theres anime better looking that this anime existed. but of course, some people still think that, this anime artstyle is good as an comedy anime. its simple and cute, it almost look like a chibi imo. so its pretty good\\n\\n\r\nSound (9/10)\\n\r\nThe OP is pretty catchy. but, i can see people doesn't really like it because it feels like the whole lyrics for the OP is just \"Kill me baby\" really. but, the OP is very funny and fitting as the genres of this anime is \"Comedy\". The ED is very catchy and the animation of it, is, cute i should say. The ED of this anime is Very Catchy and fun to listen to. The OST is also very good! nothing much to say about the OST. So, The sound is very good!\\n\\n\r\nCharacters (9/10)\\n\r\nWe Have here Yasuna oribe, which is possibly a highschool student and her friends, Sonya and Goshiki Agiri. Sonya as an Assassin and Agiri as an \\n\r\nNinja. We Have Yasuna as an easy going and foolish person with Sonya as a strong cruel person. and last Agiri as a Mature and Calm person. it made a kinda interesting little story out of these character. i still dont know how to explain it but i love these character because their personality made a great comedy anime. i love them\\n\\n\r\nEnjoyment (7/10)\\n\r\nThe Jokes in this anime is kinda out of places and doesnt makes sense or fitting in some scenarios. it is clever with the characters and the artstyle is very fitting to a \"Comedy\" anime. and the OP and the ED is also pretty funny! but the jokes is sometime. too constant and repetitive, like it need a little break and then give it more jokes. it just throw a bunch of jokes at once and it is kinda overwhelming sometimes. but the most time it is time right and it is fun to watch. some scene is hilarious, overall, this anime is pretty enjoyable. \\n\\n\r\nSo Overall 9/10",
            "date": "2018-08-11T05:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 286177,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7330319.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Acund",
                "username": "Acund"
            },
            "url": "https://myanimelist.net/reviews.php?id=286177"
        },
        {
            "content": "It's not a high budget comedy with a big plot or anything like that.\r\nIt's a show to watch one or two episodes from time to time to relax and laugh a bit, it doesn't have plot at all, the episodes don't correlate with each other, it's just two main characters interacting with silly stuff with help of 3rd one that comes from time to time.\r\nIt looks like a 3 minute show you know but they managed to pull it to 25minutes and for me it was entertaining, i loved the OP and ED yeah the formula it's repetitive it's Yasuna trying to make something funnyand Sonya just ends up getting angry and hitting her, yeah it's simple but they apply it to some original situations and it ends up being funny, at least to me.\\n\\n\r\nThe only thing i encounter a bit disturbing was that in some moments i felt as if Sonya was being too abusive with Yasuna, like she was so kind and genki and Sonya was such a cruel person.",
            "date": "2018-07-15T00:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 284010,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871141.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/S5_0014_81",
                "username": "S5_0014_81"
            },
            "url": "https://myanimelist.net/reviews.php?id=284010"
        },
        {
            "content": "SPOLIERS—- May Include spoilers\r\nIntroduction -Make the kill me,and make me your baby! Its a random anime!\r\nKill me baby is a short 13 episode Anime made by J.C. Staff during spring of 2012.If you want a random anime that doesnt take it self seriously then this is the anime for you.\r\nContent-The anime contains 13 episode along with several short speical episodes that count as one episode itself (OVA).As far as the genre it its a comedic slice of life that can get very random and will not feature a plot whatsoever,instead it uses the basic settings it gives the viewers as the base for the eachepisode.This is also a SFW anime with mild cartoonish violence and little to no swearing. The whole anime itself reminds me of saturday morning cartoons,simple and fun to watch.\\n\\n\r\nPlot- The anime itself doesnt really have a plot,think of it as the simspons or a comedic sitcom,where it uses the basic settings of the show to make every episode possible.With that being said the setting its a typical high school with two main characters who fit the typical 90s cartoon style AKA the cheerful, and dimwitted character(yasuna) along side with the grumpy,and smart character(sonya).This works for this kind of anime,because it doesnt take it self seriously in anyway,if the anime was a plot driven, realstic drama then yes it would fail.\\n\\n\r\nYasuna is the main character here,she is the typical high school girl..well she is unique by being being silly and loud,while sonya the blonde haired girl is a hitman who happens to attend school,obviosuly this anime just pokes fun at the ideas and never gets serious,you will never see a gun being pulled or anyone get killed,so the anime knows its limits.Yasuna often bugs sonya with any little thing she can come up with,such as playing hide and seek or playing a word game.This is where the anime often gets it punchlines from,where it always ends up as sonya being fed up and ends up hurting yasuna,followed by the classic quote of “sonya you’re so mean waaaa” There is also a ninja character who is really just another high school girl being a troll and messing around,often tricking yasuna and sonya with her magic tricks(illusions) many people say she makes the anime what it is,and i agree with that,she is an excellent character all on her own.\\n\\n\r\nThen we have unused character,i have no idea why is she even in the anime,she is useless.The creators barely give her screen time,it would have been nice if she became a main character as well and she redeems her self..but it doesnt happen.\\n\\n\r\nMusic/voice-  The music is pretty simple and goes along well with the cheerful nature of this anime,and includes many japanese elements as well which is a plus. The opening song is pretty cute and well done as it includes the voices from the anime,while the end credits have a catchy dance music which is enjoyable as wel.\\n\\n\r\nNow this may be a surprise but i recommend watching this in english DUB,the voices are very well done.the voice acting is never monotone and the english voices sound very similar to the japanese ones,so if you enjoy watching animes dubbed then go for it.The english voice helped put the nail on the coffin for giving me that old comedic cartoon vibe.\\n\\n\r\nAnimation/Art- this is a comedic anime,so perhaps the best animation isnt needed but it looks cheap and old,and for a short anime they could of done better…again its just a comedic anime so it doesnt nessarily need it. \\n\\n\r\nThe art style is cute and goes well with the cheerful nature of the anime,reminds me of lucky star and yuyushiki. \\n\\n\r\nAppeal- This anime is only around a year old,but the anime has been well recevied by viewers and parodies such as the end credit’s dancing was done in yuru yuri so the appeal is there,and it is a likeable anime without a doubt.\\n\\n\r\nFinal opinion -Kill me baby was a very enjoyable anime,filled with laughs and heart warming moments.However the main problem with the anime is the randomness it contains.At times the anime may have a hilarious episode while the next one may be dull and have too many missed jokes.it feels as if they tried a new idea every episode which isnt so bad,but at the same time i just wanted to skip an entire episode.Also i know this anime isnt serious but it was hard to beleive that sonya would even be yasuna’s friend after all the things she does to her(teases her way too much) other than that this anime was funny and cute so i recomemnd this for slice of life fans and ones who like random funny animes.\\n\\n\r\nHope you enjoy this review \\n\\n\r\nArigatou ^_^",
            "date": "2013-11-23T22:02:00+00:00",
            "helpful_count": 5,
            "mal_id": 121237,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3341903.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ReimuNuggets",
                "username": "ReimuNuggets"
            },
            "url": "https://myanimelist.net/reviews.php?id=121237"
        },
        {
            "content": "Kill Me Baby is a practical piece of work. Since it is merely an animation aimed at bringing 4-koma gags to life on the screens of the audience, its budget is a fraction of major shows that focus on graphical excellence, deep and intriguing plotlines, and of course character development that is well fleshed out.\r\nNevertheless, Kill Me Baby is an anime that competently makes use of the meagre budget as well as handling the transition from 4-koma gags to an anime reasonably well. Considering that it is a comedy show, and as such aimed towards squeezing a laugh out of every person who watches it,I have to admit that KmB does a good job in that respect, but is essentially a rather flat piece of work in all other respects. However, I should clarify that that is through no fault of the anime itself.\\n\\n\r\n4-koma gags do not make for a good story that can carry an anime throughout its airing. Based on its source material, we can safely conclude that KmB is not a series that attempts to develop that. It is basically a succession of animated material that is just slapped together and packaged as an anime. However, its main selling point is of course, hilarity. And I can guarantee you, hilarity definitely ensues. That being said, the anime does not have any semblance of continuity and parts of it do not make sense at all to the casual viewer. This again can be attributed to the nature of the source material. If I were to judge KmB while taking that into account, I would say that KmB is actually a game attempt by the studio to create a good anime. Not \"good\" in the sense of thought-provoking, loaded with heart-aching drama or having bucketfuls of fanservice, but rather that it achieves what it sets out to accomplish, which is to brighten up someone's day.\\n\\n\r\nHmm... art. Now, the art of KmB is flat. Very flat. The show looks like something drawn by the moderately talented preschooler. However, one needs to remember that the show does not have excessive budget on which to blow on those gorgeous, brilliant graphics that cause people to stare, mesmerised at the screen. Thus, the art being of mediocre standard is actually forgivable in this case.\\n\\n\r\nThe sound part is definitely mediocre. The same soundtracks are reused so often that by the time I finished the anime I could almost hum all of 'em. Mention weird songs and KmB's OP comes to mind. Honestly, I could not make heads nor tails of that song, from the animation to the lyrics. However, I feel that the ED is a significant improvement over the OP, not that it would rank in any charts. \\n\\n\r\nI don't believe that there's any need to talk about the characters in detail. Essentially, we have Yasuna = airhead girl, Sonya = paranoid assassin, Agiri = weird ninja and even an Unused Character just for the heck of it. Strange that they called upon Kugimiya Rie for Unused Character though. Overall, the characters are just there doing silly things for the audience's enjoyment. The voice actors were decent and were able to effectively convey the comical moments so that the mood pervades the audience.\\n\\n\r\nFrankly, even though its other aspects were not headed for excellence, KmB really tries very hard in trying to let the audience enjoy it through its funny, hilarious gags. In that, it has succeeded well, in fact exceeding all expectations. The main reason I had for giving KmB my rating was due to me enjoying the series so much and laughing till my sides ached. The hilarious moments will have people literally ROFL.\\n\\n\r\nOverall, KmB is still a decent anime. I'll say this again: its potential was severely hampered by both the funding and the original source material it had to work with. Despite that, KmB makes the most of its situation. Kudos to the people in charge for managing to eke out a thoroughly enjoyable anime from such limited resources. I'm giving it a score of 6, mainly because I enjoyed the comedic interaction between the characters as well as the truly funny gags that successfully made the anime a must-watch for people looking for a comedy anime series.",
            "date": "2012-12-18T03:07:00+00:00",
            "helpful_count": 5,
            "mal_id": 80482,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1909180.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/KiraMikoto",
                "username": "KiraMikoto"
            },
            "url": "https://myanimelist.net/reviews.php?id=80482"
        },
        {
            "content": "Kill me Baby! is something I've seen called fantastic, terrible, or somewhere in between.  After watching it, I have a few things of note to say about it. \r\nI'll start with the cons because I'd like to end on a good note.  \r\nWhile the art style for the characters is very cute, the actual art itself is lacking.  There are quite a few scenes where the background looks like a sketch that was never completed.  Sometimes the background is in black and white even.  \r\nCharacters are not very interesting to me. Oribe is delightfully adorable, and so is Sonya attimes, but overall they aren't really interesting.  \\n\\n\r\nProbably the worst part about the show is that the comedy is really lacking.  Most of the jokes are pretty much the same as others, and it is the reason so many people dislike this anime.  Any laughing is going to come from the deliverance of the jokes (I'll note on this again), not how clever or funny the jokes actually are.  \\n\\n\r\nNow for the pros, which I believe outweigh the cons. \\n\\n\r\nThe art style is god damn adorable.  Oribe and Sonya are so cute together! So is Agiri!  I can't get over how cute this anime is. \\n\\n\r\nSecondly, this anime is just a great time. Even if the jokes aren't great, there isn't anything about watching it that isn't fun.  I really had fun watching this.\\n\\n\r\nTHE MUSIC.  My lord the OST for this anime is really good.  The OP and ED more than anything are so fun(ny).   \\n\\n\r\nThe best thing about this anime is the voice acting.  Holy shit it is really, REALLY good.  You can tell from the OP that the voice actors fit the characters so well.  All of the voice acting here is so well done that sometimes it makes the jokes funny.  Oribe has a particularly adorable voice, and without it I would not have enjoyed the show as much.  In my opinion, the VA carry this anime.  \\n\\n\r\nSo overall the show is a lot of fun, but it isn't fantastic.  A lot is lacking in the comedy department, but I think the voice acting carries this anime enough for me to recommend it.  Just don't be surprised if you don't enjoy it, because many people REALLY dislike this show, and for understandable reasons.",
            "date": "2015-05-20T16:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 188285,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KnifeManofMD",
                "username": "KnifeManofMD"
            },
            "url": "https://myanimelist.net/reviews.php?id=188285"
        },
        {
            "content": "If you want to watch this anime waiting for a splendid story, with many fights or unusual adventures, sorry, but you will not like this series.\r\nBefore starting to see this anime, it is necessary not to take it seriously. Contrary to the opening, each episode is a set of fun sketchs played in a school about two girls, one being very optimistic and other a professional killer. Even appearing, the anime has no story and all episodes have no connection.\r\nThere are mostly just four characters presented throughout the plot, the people around are just \"sketches\", but the ones that are presented are very entertaining andcaptivating. The soundtrack is also good, the opening and ending of the series as well.\\n\\n\r\nI usually say that this anime has accomplished the only goal it offered viewers: a good, light and fun comedy to follow.",
            "date": "2017-10-22T14:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 261446,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4661810.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Otark",
                "username": "Otark"
            },
            "url": "https://myanimelist.net/reviews.php?id=261446"
        },
        {
            "content": "Hilarious!!\r\nwhy this anime got a bad rating? frankly, i watch it without any disappointment. there is a rare anime that can make me laughing frivolously. and this anime is the one that could make it happen. hahaha\\n\r\nI love this anime because the character is cute and with the uncomprehend background like ninja and a killer. all the gag is always funny! every chapter in each episode give me enjoyment and happiness. and the story is rich of convulsing part. \\n\\n\r\nYasuna Oribe always having some idea to make the spoof fresher and give an unexpected responses. how Sonya treat her is funny too!\\n\\n\r\nKILL ME BABY\\n",
            "date": "2017-10-12T03:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 260563,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3629191.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hendrik_COH",
                "username": "Hendrik_COH"
            },
            "url": "https://myanimelist.net/reviews.php?id=260563"
        },
        {
            "content": "This one is not easy to rate. Art is simple, story not even there.\r\nI really liked the intro, because it's so whacky. Everyone is out of sync, video has nothing to do with the anime, i still like it.\r\nOuttro was plain compared to the intro.\r\nYou can't even give spoilers here, because you there is nothing you can spoil, besides three girls just doing antics.\r\nTo be honest, i don't know why i liked this. BUT when you got some drinks or had some weed it really is good for a ride.\r\nWARNING: Don't look more than two episodes at a time, your brain will meld.\r\nAgain, was funeven if i don't know why, just try 1-2 episodes and see if you like it.\\n\\n",
            "date": "2015-02-26T07:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 181250,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4424505.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Rohling",
                "username": "Rohling"
            },
            "url": "https://myanimelist.net/reviews.php?id=181250"
        }
    ],
    [
        {
            "content": "i love this anime :3 is funny and can give you a great day because its pretty happy i love it!! :D \r\nin mi opinion its worth it because It is entertaining and you can have great funny moments with Sonya the professional killer D: and Yasuna a dummy secundary student :D \r\nthis is a comedy anime and if you can laugh a lot of time you can try it and in my personal opinion is one of the best comedy animes i have watched :3 \r\nthis anime is so random and funny and have a ninja named Agiri with gadgets and stranges jutsus, ifyou want a comedy anime you can tri it i loved this anime because this have things what i never seen in other animes this anime is pretty funny and extremely random",
            "date": "2016-04-15T11:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 216431,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5243655.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ToshinoYoshii",
                "username": "ToshinoYoshii"
            },
            "url": "https://myanimelist.net/reviews.php?id=216431"
        },
        {
            "content": "This anime have quite a simple plot based on the 4'koma: three schoolgirls doing cute, dummy&funny things. Actually, one of them, Oribe Yasuna, is a stereotypical schoolgirl, second, Sonya-chan, is a killer, and the third, Agiri-san, is a ninja. The whole thirteen episodes we're seeing many jokes, but, as in the everage comedy, most of them we saw somewhere.\r\nOne detail near the end: \"unused characther\" really attracted my sympathy because she is trying to do her best and failed every time, every episode when she appears. Maybe, she was the main reason why this show got from me six, not five.\r\nIn conclusion I want tosay: \"If you want to relax -- I recommend you \"Kill Me Baby\". If you want something serious -- \"Kill Me Baby\" is a wrong decision\".\\n\r\n6/10.",
            "date": "2012-04-01T14:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 57657,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/514342.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/zahodnik_miensk",
                "username": "zahodnik_miensk"
            },
            "url": "https://myanimelist.net/reviews.php?id=57657"
        },
        {
            "content": "Is Kill me Baby a great comedy anime or will you be saying Baby please kill me by the end?\r\nFor starters I'll just say that this is an episodic anime with no overarching plot and no storyline. So now that that is out of way Kill Me Baby is about two 'friends' in a high-school setting so nothing new there, however the characters are a bit odd as one is typical high-school girl while the other is also in the same role but is a assassin as well which leads to funny interactions between the two characters but gets a bit same like if youbinge watch this with it normally starting with first character Yasuna is a normal girl who comes up with a stupid idea and then baits Sonya the assassin into it, and then by the end Sonya has reacted violently beating up Yasuna.\\n\\n\r\nThough aside from this I found the jokes to be well though out and played well into each episodes overall 'story' as they made me laugh at least once an episode, which makes whole anime as a whole fun to watch up until the end as there is no real ending or cliffhanger it just stops which I found to not be, all bad but felt unsatisfying by the end.      \\n\\n\\n\r\nAs mentioned before the characters can get a bit boring, due to repetitive humour and boring character designs that even with an additional to characters that are unoriginal though with that in mind, I found characters to be highly likeable as there personalities on one hand were fun to watch, even though they are a typical stereotypes and fairy uninteresting they grow on you as time passes; this is also due to the art direction even though the designs are average; the style is cute and helps mixing in well with the tone of the show, even if the animation is okay at best but similarly the soundtrack used helps immerse you into the shows and has a similar sounding tone.  \\n\\n\r\nAlso relating to cute style there is the Opening and Ending of the show which are really cute and fun to watch though the songs used get annoying  as the show progresses.\\n\\n\r\nOverall I believe you should watch this if you want a breather from heavy story anime as this is a relaxing show funny jokes, likeable characters and a cute art style that makes you feel released from high energy shows even though the show runs out of ideas after about 4 episodes and reuses the same ideas over and over again unless you take it slow, in which recommend you watch this every now and then instead of binge watching to get the better experience.",
            "date": "2015-12-20T08:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 206117,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=206117"
        },
        {
            "content": "Yasuna is a chipper, energetic high school girl with bravado that’s entirely fueled by her lack of brains. Her everyday high school life might have consisted of endless pep rallies and air-headed trips to the mall with friends, had she the ability to make like-minded friends... Instead, she wound up making friends with the girl seated next to her in the back of the room in their homeroom class, the cold foreigner Sonya. It’s difficult to say what black magic lead these two oddballs to become so tight with each other, but ever since their paths became intertwined, Yasuma’s ideal school life has become nothingbut danger and abuse at the hands of her new BFF, who turned out to be an assassin!\\n\\n\r\nAssigned to their school as part of her career, Sonya has little patience for her bubbly friend, who interferes with her work, constantly ropes her into crazy schemes, and even more constantly sets off her PTSD, to which Sonya always has a wrestling hold and a broken wrist to give her in return. And if these two didn’t sound like enough of a classroom disruption, Yasuna soon meets Agiri, a mysterious acquaintance of Sonya’s who claims to be a ninja, and is always ready to supply her two pals with acme-style ninja gadgets, for a small fee of course. With these three nuts in the same basket, school life is sure to be anything but normal or average for everyone involved.\\n\\n\r\nI’ve talked about JC Staff before, to the point that I should probably replace Gainax Month with it. I won’t, of course. JC’s animation production tends to fall into three different camps; In one camp, you have beautiful animation that obviously had lots of effort and resources poured into it, like the first 7/8’ths of A Certain Scientific Railgun and most of Toradora.. Then you have bafflingly ugly anime that tries to look more expensive than it actually is, like Okami-san and her Seven Companions. Finally, you have the camp right in the middle... Anime with moderate budgets that save money wherever possible and make up for it whenever necessary. The majority of their work falls into this category, like Azumanga Daioh, Excel Saga, and of course Kill Me Baby.\\n\\n\r\nKeeping with the trend, Kill Me Baby isn’t a show that really demands a high budget... The characters are chibis, despite technically being in high school, and they don’t demand a wide range of movement to express their parts in any given situation. The budget is normally saved for the rare special effects and lighting techniques, as well as some surprisingly smooth action scenes. The money they do spend on slapstick and physical humor is well spent, causing little to no visible hiccups in the process.\\n\\n\r\nWhat’s equally impressive, though, is the art style and use of color. This show features a very restrained sense of artistry, using minimal and often recycled illustrations for the backgrounds of any given scene, but they’re still relaxed and detailed enough to blend and come to life in the story. The backgrounds are adequate at the very worst, but what I found myself more attracted to were the colored backgrounds that appeared behind the characters whenever the actual backgrounds disappeared. At first glance, you’d think they just took a bunch of white boards, gave crayons to a few elementary school kids, and pasted the result onto the background in place of actual environments.\\n\\n\r\nOn closer examination, however, it becomes clear that each of these backgrounds is intended to express the feelings of the characters and what’s going on in each cut. Imagery similar to a sunrise will be used when Yasuna has what she perceives to be a great idea, and when you cut to Sonya bluntly explaining why it’s a bad idea, you’ll instead see what appears to be the last few rays of Yasuma’s sunrise being trapped under a blue screen that’s covered by vertical white lines... In other words, Sonya’s raining on Yasuma’s sunrise. Mixed colors, whether blended or overlapped, are used respectively to convey agreement or mixed feelings. Weird purple bubbles will look as though their pushing back a calm blue background to convey that Yasuna is disturbing Sonya’s piece, etc.\\n\\n\r\nIt’s simple and not terribly deep, but it’s still a really nice touch, and once you start noticing it you likely won’t stop. The character designs should be somewhat on the generic side... The genki girl has messy short chestnut hair, the cold-hearted foreigner has blonde pigtails, and the mysterious girl has long dark hair... But the chibi aesthetic makes these choices feel like more of a deconstruction or parody than it actually is. The facial expressions are thoughtful and detailed, and expressive enough to serve their purpose. The music is kind of forgettable... It’s the kind of samey generic music that you’d expect from a slice-of-life gag show... But the opening and closing themes are just awesome enough to make up for it.\\n\\n\r\nThe opening theme is called Kill Me no Baby, and I had a hard describing it until I read someone on ANN calling it sped-up polka music, which sounds about right. It’s catchy, and it’s sung by the main cast members, who repeat the title of the show over-and-over again in in the chorus. The ending theme, The True Secret Behind Our Feelings, is a bit slower, and features the same two actresses singing over a low-key techno beat The songs are cool, but what really sells them both are the videos, which I could watch over all day. The opening’s video features the three girls (and one unnamed character) fighting off an alien invasion! No, I’m not kidding, it shows a UFO attacking the earth, with the ninja, the assassin and the idiot fighting them both inside and outside of the ship. The ending is somehow even funnier, as it features Sonya and Yasuna doing a synchronized dance that looks like it’s going to be morning exercises at first, but turns out to just be a series of hilarious moving poses.\\n\\n\r\nThe English dub is... Well, it’s a bit of a mixed bag, but at least the good and bad points are very clear cut. This is a Sentai dub, and based on the period that it came out, it’s fairly obvious that the scripting and ADR directing was in the hands of one Stephen Foster. This isn’t Foster’s usual kind of dub, though... To start with the good attributes, he didn’t rewrite it. It stays very faithful to the original script, with the only real changes being the odd ad-lib from Luci Christian, and these normally work for the better, making her character’s snarky sarcastic humor more accessible to a western audience.\\n\\n\r\nSpeaking of Luci Christian, one of the usual positive aspects of a Stephen Foster dub is still present here, and I’m surprised people never gave him enough credit for this... The acting in English is really good, maybe even slightly better than the Japanese. Luci growls and grumbles her way through the long-suffering straight man Sonya, and Hilary Haag turns her childish charm up to 11 for her role as the bubbly Yasuna, and the two of them work off of each other brilliantly. Rozie Curtis also does a fantastic job as Agiri, making her character sound aloof and nonchalant, yet with condescension and some distinctly bad intentions lurking below the surface. Brittany Karbowski is enjoyable as usual, playing a nameless character who’s only known by the descriptive term “Unused character,” and wants nothing more than to find some sort of purpose in the main cast.\\n\\n\r\nUnfortunately, such uncharacteristic quality comes at a steep price. This is a somewhat common thing in Foster’s work, and I plan on talking about it more if I ever review Medaka Box or Kids On the slope, but in order to stay faithful to the script of an anime, Foster compensates by completely ignoring lip flaps. Yes, he makes no attempt at directing his actors to match what they’re saying with what’s on screen, it’s ugly but true. What the characters are saying in English will begin before they’ve opened their mouths, and end afterwards, and no pause is acknowledged. I’d say to ignore it, but it’s really distracting, and it’s hard to get over just how well a better director would have been able to make the dub look and sound a lot better without having to sacrifice one for the other.\\n\\n\r\nI’m not the first person to make this observation, but comedy is hard to review. Humor is subjective, and thus there’s no way to predict whether or not other people will find the same things funny that you do. Kill Me Baby is a slice-of-life slapstick comedy, told mainly through extended vignettes, so I can understand many viewers will likely find themselves losing interest during the full length episodes of a show that ideally should have been presented in 12 minute chunks. I like to find other things to discuss when reviewing comedies, but in Kill Me Baby, the only thing I can really discuss IS the comedy, so bare with me through this.\\n\\n\r\nThe style of comedy that Kill Me Baby uses is the classic ‘Straight-man-Goofball’ type of style... Where you have one character acting like a fool and trying to get on their counterpart’s nerves, and that counterpart delivers by either pointing out the goofball’s foolishness or just flat out smacking a bitch. This style is used often in the genre, and I must say I’m quite fond of it myself, but unless both characters take their roles to extreme levels, it’s hard for this dynamic to carry a series. Luckily, both Yasuna and Sonya take their respective roles and make them the central elements of their characters, so that the style can be carried to some very versatile places. Yasuna isn’t just a happy-go-lucky idiot, she’s a prankster, and thrives on the chance to get the better of her BFF, making her a very active goofball. Sonya is extremely edgy, and has a laundry list of trigger warnings, as she’s frightened of most animals, and is quick to become offended, making her a perfectly reactive straight man.\\n\\n\r\nThe rest of the cast is small, consisting mainly of two-bit extras that we’re not supposed to commit to memory, such as “Girl who lost wallet belonged to,” “owner of annoying dog,” and “Old man who keeps getting roped into stuff.” Agiri makes for a great third wheel, as her weirdness and casual antagonizing is one of the only things that Yasuna and Sonya are ever on the same side about, giving us rare glimpses of camaraderie between them. Unused Character is, surprise surprise, kind of useless, and doesn’t do much other than act as meta-commentary on the small size of the main cast. She could have honestly been left out, basically, and she knows it. With her and Agiri acting as occasional crutches, this show survives primarily on the strength of it’s two central characters and the wide array of interactions they can have.\\n\\n\r\nFor the most part, the story really only has three settings... Walking to school, hanging out between classes, and walking home from school, and the amount of material they can squeeze out of these settings is amazing. Yasuna always has something to bother Sonya with, and even when she doesn’t, she still has enough dimension to carry a satisfying vignette. Sonya herself does of course have the violent and sour reactions in good supply, but for whatever reason, she’s still more or less game to TRY and enjoy her time with Yasuna, and she even shows some shockingly real vulnerability in her occasional confusion over Japanese culture, as well as in the ways her PTSD has believably affected her reactions to otherwise non-threatening noises and events.\\n\\n\r\nI could easily file this show away under the long list of plotless slice-of-life shows, but when I really think about it, that wouldn’t actually be fair. Yes, there’s no long term plot, nothing over-all that the girls are trying to accomplish, despite Yasuma’s futile insistence of a motive in the final episodes. The plots, believe it or not, come in the lengthy vignettes that make up each episode. This isn’t like in Azumanga Daioh or Lucky Star, where entire stretches of story can be made up of just interchangeable interactions that seemingly have nothing to do with each other... For the most part, an episode of Kill Me Baby will consist of quarter-to-half-length stories where something happens... Yes, things are constantly happening in this show, to varying levels of importance or impact... And there’s almost always a clear goal, even if that goal is just the two characters getting the best of each other.\\n\\n\r\nWhile this style of storytelling doesn’t wear thin easily, the jokes themselves can become kind of repetitive, and it can sometimes feel like the writers were stretching for ideas. Vignettes that remove themselves from the normal setting, such as Yasuma’s New Year’s dreams, kind of fall flat, and the humor can lose steam if you’re bingeing more than a few episodes per sitting, meaning a portion of one episode per day would probably be ideal. Having said all that, I still say that Sonya and Yasuna are the backbone of this series, and while the execution isn’t perfect, it’s still a great concept that the writers are at the very least having a lot of fun with, never having to resort to cheap fan service(Which is good, because seriously, how do you make small anatomically disproportionate bobblehead characters sexy without failing at it like Lucky Star did?). The writer of the original manga, Kaduho, clearly loved these characters, and you probably will too.\\n\\n\r\nKill Me Baby is available from Sentai Filmworks, and is available on DVD and Blu-ray. It’s also available for free on Crunchyroll, and you can find pretty much the entire series dubbed on youtube. The original manga, by mysterious author Kaduho, is not available stateside. The follow-up OVA series, Kill Me Baby super, can be viewed online in many different places.\\n\\n\r\nKill Me Baby is a really fun series built on the strength of one really strong concept, enthusiastically explored in enough creative ways to excuse the somewhat lackluster backdrops that it’s set against. But like many others of it's ilk, it’s biggest problem is just how simple it is. Sure, there’s some complexity to the characters, but there’s little to no depth to any of it. It’s not really worth a second look unless the humor really worked for you, but in my case, it definitely did, and as fast-paced as the jokes in it are, you’re sure to find at least a few moments per episode that’ll work for you to. It’s a decent comedy that promises some great laughs, and that’s all it really needs to be. I give Kill Me Baby a 7/10.",
            "date": "2015-12-12T10:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 205336,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=205336"
        }
    ]
]