[
    [
        {
            "content": "\"He's sweating alot.\"\r\n\"...THAT'S NOT SWEAT, THAT'S --[SPOILER]--\"\r\nGive this anime about 2minutes, and you'll already be laughing your ass off. I'm usually very picky with my comedy animes. I need them to be surprising, unique, and more than anything --weird. (Seriously...nothing normal is EVER FUNNY.)\r\nStory: 8/10\r\nWhat you get:\r\n- A tougher-than-anyone yankee\r\n- ...paired up with a Demon-Lord Baby (who is adorable)\r\n- ...and is perpetually naked.\r\n- A giant beefy man whose ability to transport people is nothing short of NUTS, not to mention GROSS and disturbing. \r\n- VERY easily distracted Demon-Lord-King who puts Mahjong over destroying the human race\r\n- AND MORE.\r\nArt: 9/10\r\nBeelzebub is so evil AND cute youjust want to squish him.\\n\\n\r\nSound: 8/10\\n\r\nIt's good, what can I say other than that?\\n\\n\r\nCharacter: 10/10\\n\r\nWhen a writer takes a Cliche and twists it into a product of Genius then you know you have a winner. The chemistry between the characters is also wonderful --especially between Beelzebub and Oga.\\n\\n\r\nEnjoyment: 10/10\\n\r\nIt's funny, it's exciting, it's fast-paced, it's GOOOD.\\n\\n\r\nOverall: 9/10\\n\r\nAll right, there are probably funnier animes, but this is still one of the best. =D\\n\\n",
            "date": "2011-02-23T06:59:00+00:00",
            "helpful_count": 361,
            "mal_id": 34680,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheSakurax",
                "username": "TheSakurax"
            },
            "url": "https://myanimelist.net/reviews.php?id=34680"
        },
        {
            "content": "Beelzebub is a genuinely funny anime. And I mean laugh out loud 'til your sides hurt sort of funny. You know you're in for a good time when we are introduced to the basic storyline in the first episode... a huge guy floating down the river spots a “handsome and good looking young man” \"who cared nothing for his follow humans\". He proceeds to then bestow the green haired demon baby (Beelzebub) unto our protagonist, Oga Tatsumi, in one of the strangest fashions imaginable, before taking with an impressive ballerina pirouette. Hijinks ensue when the baby's beautiful demon maid servant, Hildegarde comes looking for thetoddler and finds him attached to Oga. Hildegarde is not impressed but is intent on forcing Oga to fulfil his contract with baby Beel. Oga spends many many episodes trying to pawn the baby off to someone more badass than himself while trying to keep his family, who comically misinterpret his situation, off his back, with varying degrees of success, and lots and lots of comedy. Along for the ride are Furuichi, Oga's best friend and the show's resident pervert, and a host of other delinquents from his infamous Ishiyama High.\\n\\n\r\nAs you can probably tell, Beelzebub is a show that doesn't take itself too seriously, and this approach works very well for the story being told. The main characters, particularly Furuichi, seem aware that they part of a show that routinely sets them up with ludicrous scenarios, as if to test their reactions, and they are not shy about calling out some of the more preposterous elements that arise. Characters also address the viewer directly, which adds a nice touch of humour to the show while making the situations more relatable. I found this approach more satisfying than one where we are asked to accept ridiculous circumstances at face value. \\n\\n\r\nThe show has a lot of heart, and can also be surprisingly creepy at times; these are demons and the underworld we are dealing with after all, but this never lasts for very long, which is a pity because I think the show would have benefited from playing up the darker themes for longer periods to counter the otherwise jovial tone, which becomes a bit tiresome over a 60 episode arc. Still, the show maintains enough originality to entertain and the delivery of punch lines remains top notch for the most part. \\n\\n\r\nOne place where the show does disappoint terribly is in character development. Its remarkable how little the main characters change over the course of the series. This actually turns out to be a main detractor for the comedy as the show goes on because I often found myself wishing for fewer farces and more feeling. Some decent character growth would have solved this issue, but alas there just isn't enough of that to go around. Relationships are especially frustrating. Waiting for something interesting to happen between characters other than fights with comically named \"special attacks\" is like watching paint dry; there just isn't a lot going on there. The supporting characters fare a bit better in this respect, in particular with an entertaining story arc involving a multi-player FPS.\\n\\n\r\nTo add to this, the filler episodes quickly become an annoyance. Simply put, there are too many of them. This wouldn't be so bad if these episodes contributed something towards developing characters, however, they do not. And in the end I kept feeling like these episodes were simply taking away valuable time that could be better used oh say, developing characters.\\n\\n\r\nOverall though Beelzebub is a well written series which keeps track of its story plots, at least until the last episode, so you almost never see characters “forgetting they did something”, or acting out of character, which is very impressive for a farcical comedy like this. Eventually though, lack of character development and some nonsensical villains make it hard for me to call this anime great. Halfway through this series, if you're not being entertained by the humor, chances are you aren't being entertained by anything else. And this is unfortunate, because the show had all the right ingredients to make it absolutely amazing. Still, I would recommend watching the series because you will not regret doing so, if only because it is very different from a lot of what is out there. Moreover, I managed to find a much more satisfying end by basically ignoring the last episode and switching to the manga to get more out this series. The story of Beelzesama and his contractor Oga Tatsumi, does not end at episode 60, and for my money, is definitely worth catching up on.\\n",
            "date": "2012-12-06T08:13:00+00:00",
            "helpful_count": 99,
            "mal_id": 79322,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1266895.jpg",
                "scores": {
                    "animation": 0,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Last_Chevalier",
                "username": "Last_Chevalier"
            },
            "url": "https://myanimelist.net/reviews.php?id=79322"
        },
        {
            "content": "I will not deny, I'll be a little biased towards this anime cuz my favourite genre is comedy and the supernatural, so this was quite the perfect show for me.\r\nStory:\r\nOnce upon a time, in a land faraway, there was a barbaric, ruthless, defiant, demon-like bastard who thought nothing of his fellow man. And under some strange as heck circumstances, he started to raise a baby.\r\nCorrection. Not just any baby. The next great demon lord!\r\nAnd so we follow this man, Oga and Baby Beel with their wacky so called 'adventures'. The story's plot is not deep or anything, however it does feature something out of ourdaily lives and the humor is hilarious. Oga is always dealing with weird situations (which I kind of feel sorry for him) and all of them have to do with Baby Beel. But there are certain moments in the story that will make you go \"aww\" just for abit as well. \\n\\n\r\nArt:\\n\r\nThe art is mediocre. But there are certain times where humorous exaggerated facial expressions are drawn very well which I will give a thumbs up for. They do have a little bit of fights, which are short enough and not too long.\\n\\n\r\nSound:\\n\r\nThe OP and ED suit the anime very much. OP is a kind of rock-ish song which is kind of catchy and the lyrics are all of Baby Beel's words while ED is slightly more toned down and mature. The background music in each and every episode is fufilling and goes very well especially in comical scenes.\\n\\n\r\nI'll be honest-I'm a little biased because of Baby Beel's seiyuu, Sawashiro Miyuki who has done a great job on him and his baby-like noises.\\n\\n\r\nCharacters:\\n\r\nOkay, so I gave this one a high score but of course with reason. The characters inside are not that usual in animes and so is Baby Beel (of course, why would Baby Beel be usual? He's the cutest thing on both hell and earth.)\\n\\n\r\nOga, as said by many as the bastard who never seems to have any sympathy for fellow men, actually shows a slightly (reaaaal slight) tender side towards Baby Beel. You can see him actually developing for a bit in the anime as the story progresses, I would say that it's because he faces the hardships of raising a baby and being a parent etc. \\n\\n\r\nBaby Beel is the great demon baby as you probably know already. He exerts great demon-like qualities, yet for some reason can still manage to maintain that innocent image. \\n\\n\r\nOverall:\\n\r\nI enjoyed this anime quite thoroughly, each episode had me laughing my ass off. If you're looking for something out of this world (or perhaps under instead) and something to laugh at as well, I'd highly recommend this anime.",
            "date": "2011-02-01T18:28:00+00:00",
            "helpful_count": 75,
            "mal_id": 34187,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/330860.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/aKiy0z",
                "username": "aKiy0z"
            },
            "url": "https://myanimelist.net/reviews.php?id=34187"
        },
        {
            "content": "I give this serise a 6, which may come as a suprise to others, yet carefull though has gone into this...\r\nWhen the manga came out, I though it sounded promising and in all honesty, it came off to a good start; it was entertaining and the plot is actually fairly brilliant.\r\nUnfortuantley, it slowed down. I gave up a while back, hoping to start reading when it became eventful.\r\nAround a year ago however, I heared an anime was in production; so I dropped the manga in order to fully enjoy this serise in motion picture and erase predictability; at a faster pace, this wasn't the case.\r\nTheabove is my decliration informing people that I did really want to enjoy this series and have invested time into it over the past few years...\\n\\n\r\nNow, I'll get back on topic...\\n\r\nThe problem with this serise is it's slow pace and characters...\\n\\n\r\nStory...\\n\\n\r\nA delinquant youth must raise the infant demon lord, who thrives on conflict, into becoming a fearsome leader who will dominate the world.\\n\r\nThe comdey comes into place as this teenager has no choice but to furfil his duty, dispite the fact that he wants no part bringing about world distruction and is far from ready to be a dad.\\n\\n\r\nWhat's wrong with the story is there's way to much 'humor' and not enough focus on the enitial plot.\\n\r\nComedy or not, the 'humor', which mainly consists of; comical violence, mediocre villians getting beaten up and the babies tantrums, quickly becomes repetitive when you concider how much potential the series actually has.\\n\\n\r\nAnother major flaw is the fact that the manga is still so young, yet it seems production want this to be one of those serises that runs indefinatley, meaning it's pace won't speed up and chances are, fillers may be incorporated.\\n\\n\r\nCharacters...\\n\\n\r\nMy personal problem with this serise is the cast of characters.\\n\\n\r\nOga is a teenage boy who seems pleasant enough, however, alledgedly, he's scary, an established delinquant feared by all. We are suppose to simply accept that nobody can beat him - every guy fears him, thoses who don't are overconfident thugs, some of whom are also established and unbeaten, still, somehow, they all prove no match for him. \\n\r\nThere seem to be little quirks to his character apart from the fact that he doesn't really want any part in what is going on, minus the scenarios, the writer hasn't really given him a great deal of attention.\\n\\n\r\nThe other characters consist of; a pretty icequeen and a pretty tsundere (cliche of shounen's today - grumpy girls supressing their feelings); these are the two 'love interests'. \\n\r\nThere is a fairly interesting passive friend/sidekick who represents the 'normal person', aswell as a submissive supernatural aid, lagging in the attention department in comparrason.\\n\r\nFinally, the baby, simply a baby.\\n\\n\\n\r\nI check out the manga now and then, hopefull, something will occur to enspire me to get back into the serise and re-consider this review, yet after two years and 12 episodes, this serise is, unfortunately, dropped. :(",
            "date": "2011-04-15T09:07:00+00:00",
            "helpful_count": 57,
            "mal_id": 36089,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207731.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Queen_Stars",
                "username": "Queen_Stars"
            },
            "url": "https://myanimelist.net/reviews.php?id=36089"
        },
        {
            "content": "Beelzebub... I was eager to try it at first, found the first episode cute and from then on I found it to be progressively tedious and under-entertaining.\r\nStory - Skipping the summary, we have a continuous series of who's tougher than who without any kind of emotional investment or deeply convincing romance. Instead we have low grade manufactured comedy that can't even crack my lips into a smile if it were as inflexible as water. It has not and I do not expect it to ever give me a laugh where I cradle my gut in my arms in joyous pain.\r\nThere is nothing here of valuehere. Nothing... The distinct level gap between the story that actually tries and anime like these are unfathomable unless personally experienced over a period of many years of watching different types of anime.\\n\\n\r\nArt - Art... I don't remember any art. You call this art? Character designs don't really do it for me, not once have I ever stopped to wipe my drool to appreciate it's animation.\\n\\n\r\nSound - Nothing in the sound track, the voices are not memorable.\\n\\n\r\nCharacter - They're all just archetypes, characters we've seen done so much better in other animes.  I don't give a crap if any of them died, honestly, my tissues are doomed to collect dust in the corner of my desk.\\n\\n\r\nEnjoyment - balls, tits, penis, that is all.\\n\\n\r\nOverall - Unless you enjoy wasting your time because you can't realize that there are animes that can offer more in less time, by all means watch this...\\n\\n\r\nThis review was not helpful for your ass. Go ahead, screw me like this anime did.\\n\\n\r\n[Review update] (01/09/12)\\n\\n\r\nEpisode 48... fuck this anime, I'm out...\\n\r\n*Dropped*\\n\\n",
            "date": "2011-10-07T08:36:00+00:00",
            "helpful_count": 45,
            "mal_id": 45007,
            "reviewer": {
                "episodes_seen": 36,
                "image_url": "https://cdn.myanimelist.net/images/userimages/301688.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Plagus777",
                "username": "Plagus777"
            },
            "url": "https://myanimelist.net/reviews.php?id=45007"
        },
        {
            "content": "Let's get right to the central point because I writing like short reviews.\r\nYou're probably asking to yourself when picking up this Anime \"Will this make me laugh so hard I can't breathe?\". The simple answer is YES and let me explain why.\r\nThe names of the central characters the story of Beelzebub revolves around is Tatsumi Oga and Baby called Beelzebub. Tatsumi is a delinquent at the worst school in his area and Beelzebub is the son of a demon who was destined to take over the world. From there, wacky stuff happens in EACH EPISODE that will have you on the floor crying for laughter.Honestly, I would say that the story is of less importance than how the characters were executed since it is a comedy.\\n\\n\r\nBefore watching Beelzebub, I didn't think that Anime could be so funny that I would consider it a masterpiece(This was also before I watched Gintama). Most Comedy Anime to me at the time seemed too tryhard/forced and that you would essentially need to be Japanese to laugh at the jokes. That all changed when I watched Beelzebub. I loved EVERY CHARACTER. Each of them had something to offer as a whole for the comedy so that nobody was left out. What would have played out as a normal thing in other Anime, Beelzebub turned on it's head into pure laughter. I don't want to spoil much but just keep what I said in mind because it's true.\\n\\n\r\nThe music is pretty good also and each episode doesn't feel like it's dragging on. I honestly wish I could watch it all over again for the first time because I love it so much. It's up there with Gintama as the funniest Anime of ALL TIME.\\n\\n\r\nSo just give it a try and see if you like it.",
            "date": "2015-12-17T07:59:00+00:00",
            "helpful_count": 40,
            "mal_id": 205770,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1465385.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ruggarell",
                "username": "Ruggarell"
            },
            "url": "https://myanimelist.net/reviews.php?id=205770"
        },
        {
            "content": "This is a purely enjoyment show full of violence and naked baby.\r\n\"This is a story of a delinquent high school student who ended up having to raise a baby due to unexpected occurances, but this isn't just any baby, it's the Demon King.\"\r\nThat is what you'll hear at the beginning of each episode. It is a constant reminder of what the show is about... as if we'd forget. The show is pretty random throughout, but the show does carry an underlying plot, so not everything is random. And by random, I mean each episode has some kind of different aspect that needs to be learnedin order to raise a Demon King. Anyway, when the baby isn't being focused on, the story mainly involves a lot of violence and sometimes... comedy. Mind you, I haven't found myself laughing very much.\\n\\n\r\nThe art is pretty good, however, a constantly naked baby, isn't really my thing. The art style changes from time to time to show suspense and anger, but overall the art was consistent and detailed. The backgrounds were more detailed than most anime shows I've seen, so that was refreshing. However, the artists reused some scenes a few times which really didn't sit well with me. But overall, the art was good.\\n\\n\r\nSame for the sound, the sound wasn't fantastic or genre-defining, but there wasn't anything too annoying, other than the constant yelling and screaming.\\n\\n\r\nThere really hasn't been much character development yet. Everything seems a bit bland and when a character can get depth, the show goes back to attempt some comedy rather than giving a serious moment of character development. This show so far... hasn't been all that interesting to me, but I am still watching it and hoping that a little romance will develop.. but it seems that hell will have to freeze over before anything serious is introduced. (Sorry for the very bad pun, and no I'm not proud of that sentence.).\\n\\n\r\nLike I wrote before, this is mainly a show about mindless enjoyment, which is something that is needed every once in a while.\\n\\n\r\n~~Subs Used~\\n\r\nSGKK-TMD",
            "date": "2011-07-19T20:25:00+00:00",
            "helpful_count": 32,
            "mal_id": 39549,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/266635.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Romie-chan",
                "username": "Romie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=39549"
        },
        {
            "content": "Plot/Story: 10/10 I just want to start off by saying that this anime is SO fucking funny. You'll be laughing in the first five minutes. Unless you know......you don't have a sense of humor. Super original and unique plot. You got this yakuza looking guy looking after a baby. I mostly watched this just for the comedy. \r\n--------------------------------------------------------------------------------------------------\r\nArt: 8/10 Very good art. Not too shabby.\r\n-------------------------------------------------------------------------------------------------\r\nSound: 9/10 Nice voices. The baby's voice is adorable.\r\n-------------------------------------------------------------------------------------------------\r\nCharacters: 9/10 Super likable characters. Most of them are so funny. Decent character development. \r\n--------------------------------------------------------------------------------------------------\r\nOverall: 8/10 If you like to laugh. Watch this anime. If you're one of those people who THINK theyhave a sense of humor, but low-key don't. Don't watch this anime. :D",
            "date": "2015-12-12T22:24:00+00:00",
            "helpful_count": 30,
            "mal_id": 205395,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5041143.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nalexie_",
                "username": "Nalexie_"
            },
            "url": "https://myanimelist.net/reviews.php?id=205395"
        },
        {
            "content": "Raising a baby isn't as easy as some people might make it seem, especially if the child is the son of the Demon King. His urination has the power to flood the entire country of Japan, oh and make sure to stay within 15 meters of the baby otherwise you will suffer an electrical shock that will instantly electrocute the life out of you.\r\nBeelzebub is a 60 episode anime series following the high school delinquent protagonist, Oga Tatsumi, whom one day sees a big guy floating down the river, split in half, and is thus given the responsibility of raising the demon baby, Baby Beel.A pretty crazy way to introduce the anime right? Well that's just the beginning. Accompanied by the demon maid, Hilda, and the dimensional transporter, Alaindelon, Baby Beel has been sent to the human world to destroy humanity. But in order to do so,he  must find a strong human who cares nothing of his fellow man to be his parent and raise him to destroy the human race.\\n\\n\r\nStory:\\n\r\nI loved the story in beelzebub it was something unique and appealing to me right from the start and most importantly, lasted until the end. The anime carries an underlining plot throughout, but most of the episodes are really random and in aspect have really nothing to do with the story whatsoever. But, the comedy and the randomness of each episode was something I loved and made me keep watching. Despite many of these random episodes, the anime does come back to the story and later on the story even becomes a little more complex with new characters and obstacles coming into the picture. The ending did leave me a bit unsatisfied though for I thought we didn't see everything there was to see in which case some of the random episodes did get in the way.\\n\\n\r\nArt:\\n\r\nThe art was something I felt that really made the anime series enjoyable to watch. The character designs were done really nicely and consistently and it followed the vibe of the anime perfectly. For example, in comical parts of the show the expressions of the characters would fit the part perfectly making it much more funnier.  \\n\\n\r\nCharacter:\\n\r\nThe characters in this show is what really makes the anime great. Oga is just this badass first year student who beats the crap out of anyone who messes with him all while doing so with the lovable cute demon baby on his back. We have our typical anime best friend to the main character who is a creepy pervert who has gotten into some of the most hilarious situations making me laugh countless times. Even the supporting characters like other delinquents and Oga's family were great. As you can tell by now this isn't really the anime to be taken seriously so character development isn't really a big concern in the anime. But you do see Oga get along and bond and become like a parent to Baby Beel and as far as character development goes that's pretty much it. But because of all the random episodes there isn't a need for that at all.\\n\\n\r\nEnjoyment:\\n\r\nIf you couldn't already tell, I loved Beelzebub. It made me laugh a ton and I just wanted to continue watching the random adventures of Oga and Baby Beel and the rest of their friends forever. If you're looking for an anime series that'll make you laugh and is really enjoyable to watch then I recommend Beelzebub. Give it a chance, you won't regret it.\\n\\n",
            "date": "2013-08-04T21:00:00+00:00",
            "helpful_count": 28,
            "mal_id": 108259,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/892437.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/shaun2thet",
                "username": "shaun2thet"
            },
            "url": "https://myanimelist.net/reviews.php?id=108259"
        },
        {
            "content": "To put it simply Beelzebub is a show that has overstayed it's welcome. The first several episodes are enjoyable, exciting and funny, which is why I watched this show until now. \r\nSometimes shows should be given some time off to keep us interested at times, I felt that way towards Bleach and now with this one. It's just become way too predictable. The gags aren't funny anymore, the animation hasn't improved one bit, in fact, I think it's worse! What's going on with this show? Just feels so empty now. I've decided to drop this, which is a shame, since it had some potential. \r\nThestory while it keeps progressing, just doesn't seem as exciting as it used to be. Too predictable as I said. The characters have become so damn annoying and boring I find myself skipping scenes. The music is still crap (never liked it in the first place.)...and my enjoyment well...not there anymore! \\n\\n\r\nWould I recommend it...hmm I'd say watch the first few episodes to decide that and then drop it once it gets past the whole battle for the most powerful because after that there isn't much to be excited about.",
            "date": "2011-12-10T21:51:00+00:00",
            "helpful_count": 27,
            "mal_id": 48923,
            "reviewer": {
                "episodes_seen": 46,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=48923"
        },
        {
            "content": "I'd like to start off by clearing one thing up.\r\nI like Beelzebub.\r\nI like Oga, the unbeatable 16 year old delinquent with his ass-pull power ups, and I absolutely adore Baby Be'el, who - for a baby whose only forms of communications seem to be the phrase 'Dabuh' and the victory sign - is one hellishly insightful character. I like watching Oga destroy everyone that happens to march in his way in sadisticly inventive ways. I really like the visceral beauty that is Beelzebub, and giving it a 4 out of 10 must seem extremely outlandish after such statements.\r\nThe thing is, what makes Beelzebub work forme is how bad-ass Oga is. While being perfectly capable of goofing around from time to time, when shit hits the fan, you can expect him to throw all that aside and fluidly assume the role of the ungodly avenger. Fists connect with tangible cracks of impact and bruised enemies, as well as allies, slam into walls with shattering force. Demonic energies are tapped into and buildings crumble down. I've read the manga as far as it has been published, and in it, Oga is just that: a demonic harbringer of violence. \\n\\n\r\nHowever. This has not been the case in the anime.\\n\\n\r\nLet us throw all that out the window. Out with the dark, primitive vibe of the fight. Enter pretty, vibrant colors and horribly retarded faces. Let's get rid off the violent energies ripping the air and replace them with vividly violet sparks. Let's cut down on the emphasis on short, brutal hand-to-hand combat and slap in some slap-stick humor. The gruntings will get across the physical struggle well enough, surely.\\n\\n\r\nIn my opinion, Beelzebub lost its focus when the animators decided to center the show around some of the incredibly hilarious faces Oga pulls off in the lulls between battles. I've watched the anime until the end of the first arc, and that was only because I was hoping that the transition towards the harder fights would breathe some new tension into the stupidly over-exaggerated comedy. I was to be denied even this, and proceeded to drop the show without a backwards glance. Beelzebub needs its comic relief, for sure, and it is brilliantly funny, just as surely, but not in these mental quantities that ultimately shrug the novelty out of the jokes and make them annoying at best. Who knows, maybe the show picks up in seriousness later on, but I have no motivation to see if this is the case. I doubt it, anyway. \\n\\n\r\nI would be interested to see, though, if I would have enjoyed this anime if I hadn't read the manga first. I enjoy a brains-on-vacation comedy as much as the next guy, if not more so, and this anime does deliver that. From the stupid faces to some of the awkwardly weird scenes, manga-Beelzebub's crooked twin brother throws a bunch of humoristic punches straight at the viewers ribs that will surely have them hurting from laughter. Although I have to say I grew weary of the jokes by the time the credits of episode 4 were rolling. The following episodes were gratingly painful to bear as a result, but I do have some pretty heavy bias influencing my view on the characters and how they should act.\\n\\n\r\nSpeaking of characters, there's not that much to say. Oga and Be'el easily steal the gig for me, with Hildagarde the demon nurse-maid providing some entertaining backdrop, and the rest of the characters fit along snugly with their various, though pretty one-dimensional, gimmicks. Kanzaki is probably the only other character that has actually grown on me, but the predictability of all the characters in the various scenarios of the plot does somehow add to the skewed humor of the series. Plot-wise, Beelzebub is a typical shounen publication, running on the general theme of: bad guy! Smash! For me, the lay-out of the fights makes up for this well enough, and hey, we all know what we're getting into with these kinds of series. The villains are interesting, with suitably varying powers and bra-sizes (I kid, I kid - though some fan service is present) to keep the battles different.\\n\\n\r\nTo conclude in as brief a manner as possible, as this went on a little longer than I had originally intended, I highly recommend Beelzebub as a series. If you're looking for some serious bad-ass feels and bodies slamming into walls admist diabolic grins, turn over to the manga. Then again, if a care-free dicking around is more to your liking, I guess you should give the anime a go. Personally, though, if I see that bloody old-Batman-movie-transition-esque fist one more time, I'm slapping someone over the head, hard.",
            "date": "2013-04-19T19:39:00+00:00",
            "helpful_count": 21,
            "mal_id": 94313,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2297867.jpg",
                "scores": {
                    "animation": 3,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kuribohhhh",
                "username": "Kuribohhhh"
            },
            "url": "https://myanimelist.net/reviews.php?id=94313"
        },
        {
            "content": "Beelzebub is a great Anime in every category. Each and every episode will make you laugh your ass off. Actually, I randomly watched an episode from this anime and straight up fall in love with it.\r\nStory:       10/10\r\n-Story is not completely original but overall it seems as though (a naked baby hanging on the back of a teenage delinquent).\r\n- The baby is absolutely NAKED. (You can see his private parts).\r\n-Transportation is quite amazing done by Batim do Emuna Alaindelon. He is a dimensional transfer demon who split him-self up and can transfer anyone who enters within him to the demonworld and the human world back and forth. (Usually he has a weird relationship with Takayauki Furuichi). (Forbidden Love).\\n\r\n-There are many kids of the \"Demon Lord\" (who has a mind of a teenager) and has more than just one kid that Oga carries. And he has his own battalion called the 34th Pillar Squad (they are quite strong). \\n\r\n-Demon servants and alien like creatures in the demon world. \\n\r\n-Women with big boobs and so on. \\n\r\n-Some funny phrases.\\n\\n\r\nArt:    9/10\\n\r\n-Some aspects of the art I just don’t like but overall it is great. \\n\\n\r\nSound:   10/10\\n\r\n-I didn’t find any glitches in the sound and overall everything I have heard is good. Well a more serious/demonic type of music will be well suited for the scenes which contain violent fights. But that is just my opinion. \\n\\n\r\nCharacter:   10/10\\n\r\n-Each one of the character contributes a lot to the Anime and keep it interesting. (NO OBJECTIONS \"said by Kanzaki\")\\n\\n\r\nEnjoyment:     10/10\\n\r\n-Well, as I have said before each and every episode will make you laugh like a monkey who just found his precious banana. The reaction of the other character upon other characters is the thing that will make you laugh and enjoy this anime.\\n\\n\r\nOverall:        10/10\\n\r\n-I recommend this anime to anyone who is looking for an Anime that is funny unlike other animes with a little twist to it. \\n\\n\\n\r\nP.S. Beelzebub means “Lord of the Flies.”  Plus you might not understand some of my phrases that are in parentheses until you watch the Anime. Right now I have seen at least 45 episodes. \\n",
            "date": "2011-12-21T18:07:00+00:00",
            "helpful_count": 16,
            "mal_id": 49735,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/811709.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/chickclick",
                "username": "chickclick"
            },
            "url": "https://myanimelist.net/reviews.php?id=49735"
        },
        {
            "content": "This anime to me is a classic of its time. Airing during what I am going to call the golden age of shounen. I believe this show put up with the best of them, gintama, Naruto, even bleach by the end. The story starts off with our delinquent (oga)  getting into some trouble, like he will do for much of the series. When all of a sudden he stumbles upon 'beel'. Oga our Being the son of the demon lord he has many powers (which they likely took from Pokemon the original series) with him being able to shock our main man.Through the serieswe meet many interesting and deep characters who help lead oga to become the best demon babysitter. Through the show we see relationships altered friendships tested, it really has an amazing cast supporting this show. \\n\\n\r\nStudio perrot is one of the leading produces so without a doubt they had the right crew to handle to editing, soundtrack, and voice acting cast. Its just a classic show that you can watch for fun without a real commitment to a linear story,  however I do know people who are completely story based and may not like the independent episode style.\\n\\n\r\nI would definitely recommend this to anyone who appreciates a quality shounen/comedy",
            "date": "2018-10-11T22:14:00+00:00",
            "helpful_count": 4,
            "mal_id": 291548,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2949723.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/bridgetheman",
                "username": "bridgetheman"
            },
            "url": "https://myanimelist.net/reviews.php?id=291548"
        },
        {
            "content": "Don't waste your time watching Beelzebub. It is 60 episodes of boring stories and nothing interesting nor funny. I gave Beelzebub a 3/10 overall.\r\nThe story, which I wouldn't even call it, was terrible. The concept is interesting, but the story goes no where. When I first started watching the anime I enjoyed it quite a bit. However, I was expecting them to go into Hell and go on some crazy adventure. None of that happened. It was just the main character, Tatsumi Oga, taking care of a demon baby and going to his delinquent school.\r\nThe art was standard anime art and there isn't much tosay about it.\\n\\n\r\nThe openings and endings were alright but nothing to special. The background music in the anime was dreadful and I despised it. It was the same music over and over again. I sometimes hear Beelzebub's background music in my nightmares.\\n\\n\r\nThe characters were poor. Oga was kinda funny but a stereotypical oblivious delinquent. Hildegard was probably my favorite character out of the whole series, but she still wasn't great.\\n\\n\r\nI didn't enjoy this anime except for about 5 episodes. Other than that I hated every other episode.\\n\\n\r\nOverall, this anime was poor and I did not like it at all. I don't recommend this anime to anyone unless you want to waste your time.",
            "date": "2017-10-08T09:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 260157,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5829673.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/logyloo",
                "username": "logyloo"
            },
            "url": "https://myanimelist.net/reviews.php?id=260157"
        },
        {
            "content": "Beelzebub, a story about a ruthless defiant who doesn´t care about his fellow man at all, paired with the baby of the demon king. \r\nAt first i was skeptical about it, but still gave it a try due to the ratings that the manga had. And if i may say so, i wasn't let down the least. \r\nThe mixture of action, comedy, supernatural and maybe a little drop of romance makes up a delicious meal. \r\nThe story begins with Oga being chosen as the parent of the demon king's son, Beelzebub IV. Oga who sees Beel-bo as nothing more than a nuisance tries to getrid of him and in the process beats up some of the strongest delinquents in the school that he is attending, Ishiyama. Although it might not look like it at sometimes, the bond between Oga and Beel-bo is growing and getting stronger. As seen when Oga refuses to give Beel-bo to a group of robbers when they say that they are just going to use him.\\n\\n\r\nThe Art and Sound go well together and the seiyuu's were perfectly chosen.\\n\r\nAs for the art itself, it is what i'd call your average style. something that we have all seen once or more. \\n\\n\r\nAnd then we arrive at the characters, alot of typical characters but some with a little twist to them. The real surprise is the main character Oga, he doesn't look like your average shounen \"i need to protect\" character. Oga looks evil in any situation even if he tries to be nice. but that is just physically, Oga is portrayed as ruthless but as said many times he is not the ruthless defiant who doesn't care about his fellow man. In times it is shown that he helps others even if it might mean trouble for him. As seen when he kicked a police officer in his nuts and threw him into the garbage can to prevent Kunieda Aoi from slapping him. \\n\\n\r\nA 10, yes i gave a 10 for enjoyment. Why? Since it never ceases to make me laugh and look epic at the same time. Whenever it is out on Sunday morning (for me) i usually watch it even before One Piece.\\n\\n\r\nOverall: 8, because the story is not really that deep yet, so the first 7 episodes are given an 8. I cannot know what happens yet since i don't read the manga but i'm pretty sure it'll only get better. \\n\\n\r\nI hope you guys and girls will give Beelzebub a try now, and when you do i can assure you that you will like it. \\n",
            "date": "2011-02-20T04:10:00+00:00",
            "helpful_count": 10,
            "mal_id": 34595,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/297804.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/grakara",
                "username": "grakara"
            },
            "url": "https://myanimelist.net/reviews.php?id=34595"
        },
        {
            "content": "Now, LET'S BEGIN! Beelzebub huh? Ever since I saw it in the upcoming spring anime, It never really caught my eye. That is until it came out.\r\nThe first episode will leave you in tears. I'm serious! You'll be laughing so hard that you will begin to cry! The whole concept is hilarious! Definitely watch this anime if your looking for a good laugh!\r\nStory:\r\nWell as funny as the show is, the story is kind of weird. Really not something that I would have expect when I saw the anime at first. It's basically about this normal teenage kid who under certain circumstances is raising a, tobe, demon lord. Of course, this is anime so the sense of reality is already gone. But that doesn't prevent this story from being funny!\\n\\n\r\nArt:\\n\r\nGreat art composition. But almost all new animes have great art composition. Fluent movement, and at times really detailed. There are parts when the animation goes really dark, but that's mostly for the atmosphere they are trying to create.\\n\\n\r\nSound:\\n\r\nAwesome! All their voice acting is great, even Baby Beel. I didn't know how they were going to dub a babies voice, but they found a way! The intro is...not bad, I personally like that it's not a pop or hiphop kind of opening but a rock theme. It also fits very well with the show, fun and upbeat!\\n\\n\r\nCharacters:\\n\r\nAll the characters are awesome! Unique, funny and a riot to watch.\\n\\n\r\nIn conclusion, I enjoyed this show and will continue to enjoy watching it as new episodes come out.\\n\\n\r\nI hoped you enjoyed reading my review! :)",
            "date": "2011-02-25T14:17:00+00:00",
            "helpful_count": 8,
            "mal_id": 34750,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/452105.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/reidesu",
                "username": "reidesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=34750"
        },
        {
            "content": "\"Let me tell you something good—Beel won’t destroy the human world, do you know why? It’s because I’m his parent, I won’t ever let him do something this stupid.\" - Tatsumi Oga\r\nI shall go straight into this, hopefully it's an alright review.\r\nStory: There are many stories about devils/Satan and such, but this one is a bit different. Satan sends his baby to Earth to pick a strong person who then will raise him to be able to destroy Humans. He then picks Oga Tatsumi, a delinquent, and faces many tough challenges of raising Beel. \r\nArt: The art of Beelzebub was nice. Good colors, backgrounds, details,and the faces the characters will sometimes make are priceless. I don't really have any negatives on the art.\\n\\n\r\nSound:The first opening was very catchy, and I really enjoyed it. The voice actors for each character, especially Beelzebub, were very enjoyable and were perfect for them. The voices sounded right for each character.\\n\\n\r\nCharacter: Each of the characters of this show are different, unique, and very funny. Not much to say.\\n\\n\r\nEnjoyment: To be honest, when I started it I wasn't expecting it to be so hilarious or a favorite of mine. I was took by surprise by how funny it was, you will be crying from laughter every episode. The only problem I had with the series really, was how rushed the ending was. The main focus of the last episode should have been Beel going back to Hell, but Satan sends him back. That happened, but in literally the last 5 minutes. It felt very rushed. \\n\\n\r\nOverall: It was a really enjoyable series, with many laughs. I would re-watch many times in the future, and would recommend to many people.\\n\\n\\n\r\nIf you find any flaws you want to point out in this, please message/comment it to me. It would be greatly appreciated. \\n",
            "date": "2015-02-13T21:26:00+00:00",
            "helpful_count": 8,
            "mal_id": 180290,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4466048.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Giannini",
                "username": "Giannini"
            },
            "url": "https://myanimelist.net/reviews.php?id=180290"
        },
        {
            "content": "This anime started out great. It has a lot of comedy that works well. In fact it was the comedy that really drove it for me. There is a story of sort, but the storyline is the weakest element in this series. The idea is great, but all in all it's a fair delivery at best.\r\nThe main character is an incredibly strong delinquent. The connection he forms with Beel is pretty solid, and their relationship is key to the story. The supporting characters are all delinquents as well, and though they have a lot of humor they are all lacking. The fight scenes build upto be a little disappointing, and a lot of great ideas just fall short. By no means is this a bad series, it's just missing something. Though I loved the comedy at first, it all became a little monotonous. \\n\\n\r\nI wouldn't recommend skipping this series because it does have it's high moments. I just wouldn't set your expectations too high. Some will love the comedy all the way through and others will feel as I did. I loved the premise but was disappointed in the execution. Keep this on the back burner, but no rush to watch.",
            "date": "2013-01-24T14:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 84727,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/568293.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/explicit707",
                "username": "explicit707"
            },
            "url": "https://myanimelist.net/reviews.php?id=84727"
        },
        {
            "content": "Overall a very good anime, so funny to watch easy to grind the whole series from what i can watch, the only problem it is for me is that the baby is naked pretty much all the time except where the episode is made it a problem that he needs to be covered up specifically\r\nCharacters are so fun to learn about and everyone tries there hardest to be badass but cant be more hardcore than the main character with the baby.\r\nArt and Sound are both key for me to keep watching and when watching it looks fresh and clean",
            "date": "2017-05-18T08:46:00+00:00",
            "helpful_count": 4,
            "mal_id": 247982,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4021915.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Honbloc",
                "username": "Honbloc"
            },
            "url": "https://myanimelist.net/reviews.php?id=247982"
        },
        {
            "content": "Hello everyone, welcome to my beelzebub anime review...*seethe*... if any of you remember my manga review then you'd think I'd br praising this too right? WRONG!! I CAN'T STAND THIS ANIME ADAPTATION, I SWEAR BEELZEBUB'S GOT THE WORST LUCK IN THE WORLD TO GET THIS PILE OF GARBAGE AS A ANIME ADAPTION!! well, I'm going to beging being a bit more mature reviewer here and explain to you why I despise this  piec of sh- anime, so much, while I have nothing but love for the manga.\r\nStory: Its pretty much the same, which really should make me hate it less, but its exactly thisreason why I hate it. It comes off the same, but they twist and turn so many things that made it awesome in the orignal. for example, Oga was supposed to blow ishyama into rubble after his fight with you know who, but instead it gets disoriented with a retarded punch mark. how... is that possible? I know beelzebub is batshit insane but thats just dumb! not to mention how they pretend like every deleinquent knows DBZ style ki attacks, when its really just the wind force from their blows. you don't even want to get me started on the fillers, the magical girl one was the most ridiculous. I really lost my shit during  the rooftop battle arc, where stuff begins to happen that dosn't even exist in the manga, and they dare go back to the original plot. I just dropped it right then and there. basicly its the \"same\" but with many retarded twists and turns, its stupid for even beelzebub.\\n\\n\r\nArt: it sucks. Just flat out sucks. I always thought fairy tail's anime had crappy animation, but beelzebub's anime made fairy tail look like BONES did the animation in my eyes! The designs into the anime range from semi ok to really annoying(why does hilda have elevator shoes?) the movements acctually seem to dull out the jokes rather than improve on them and the fight scenes... my god the fight scenes. the only one I liked was the last one against the THKH, and even that was just barely, the fights before hand were just pathetic only aoi's managing to entertain. The fights afterwards try to give everyone DBZ like ki attacks when its supposed to be OGA who can only do that, and he scarely does it! the rooftop fight with the three generals, which was my favorite supernatural fight in the manga, got completely butchered due to the pisspoor movements and hits not even seeming to connect. I've seen students in a animation class do better than these clowns!\\n\\n\r\nsound: I barely acknowledged the sound track. nothing really struck me as memerable and only did its job to keep me awake while watching some of these episodes. I only liked the first OP and ED pair, the 3 end had pretty animation better than the damn show and was a nice song in general while op 3 was meh is, all the other themes were either mediocre, or can burn in hell for all I care.\\n\\n\r\nCharacters: all the characters I've come to love so much in the manga, the anime just pulled out the darkest, most cliche' parts about them and milked them for all its worth. I know oga's a dumbass but in the anime he completely looses whatever coolness he had in the manga. There he was dense but also had a decent understanding about how delinqents roll and knew what action was right, here he seems just as cliche as any other shonen hero, Furichi's pervness gets to the point of disturbance, Hilda's barely there, increasing my lack of intrest in her character, Alendelon is much more gayer than the manga, Lamia's voice makes my ears bleed, Beelzebub's shocks become more annoying than funny, Kanzaki and Himekawa...well I didn't care that much for them in the manga anyway... but worst of all, AOI. my favorite female character there, her \"cute\" onesided love for oga gets WAAAAAY overplayed, to the point where I understood WHY her haters disliked her, plus she isn't nearly as badass as in the manga, need I bring up the fact that she never flipped Mikki in the rooftop fight? Tojo is the only one they didn't ruin fortunatly (seeing how he's allready dumber than oga its kinda hard to make him dumber) and shizuka's crush is more played out a bit, seeing how it never got that way in the manga but oh well.\\n\\n\r\nEnjoyment: Do I seriously need to fill this out? \\n\\n\r\nOverall: The manga was, and still is, shittons better. Maybe if sunrise did this and they didn't start when it was only on chapter 90!! it could have played out alot better,  but for now, I curse this anime to burn in the deeptest pits of hell, and I gleefully await when this trash ends in april and stops ruining my beloved manga.",
            "date": "2012-03-17T13:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 56183,
            "reviewer": {
                "episodes_seen": 48,
                "image_url": "https://cdn.myanimelist.net/images/userimages/562369.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Thatguy31",
                "username": "Thatguy31"
            },
            "url": "https://myanimelist.net/reviews.php?id=56183"
        }
    ],
    [
        {
            "content": "\"He's sweating alot.\"\r\n\"...THAT'S NOT SWEAT, THAT'S --[SPOILER]--\"\r\nGive this anime about 2minutes, and you'll already be laughing your ass off. I'm usually very picky with my comedy animes. I need them to be surprising, unique, and more than anything --weird. (Seriously...nothing normal is EVER FUNNY.)\r\nStory: 8/10\r\nWhat you get:\r\n- A tougher-than-anyone yankee\r\n- ...paired up with a Demon-Lord Baby (who is adorable)\r\n- ...and is perpetually naked.\r\n- A giant beefy man whose ability to transport people is nothing short of NUTS, not to mention GROSS and disturbing. \r\n- VERY easily distracted Demon-Lord-King who puts Mahjong over destroying the human race\r\n- AND MORE.\r\nArt: 9/10\r\nBeelzebub is so evil AND cute youjust want to squish him.\\n\\n\r\nSound: 8/10\\n\r\nIt's good, what can I say other than that?\\n\\n\r\nCharacter: 10/10\\n\r\nWhen a writer takes a Cliche and twists it into a product of Genius then you know you have a winner. The chemistry between the characters is also wonderful --especially between Beelzebub and Oga.\\n\\n\r\nEnjoyment: 10/10\\n\r\nIt's funny, it's exciting, it's fast-paced, it's GOOOD.\\n\\n\r\nOverall: 9/10\\n\r\nAll right, there are probably funnier animes, but this is still one of the best. =D\\n\\n",
            "date": "2011-02-23T06:59:00+00:00",
            "helpful_count": 361,
            "mal_id": 34680,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheSakurax",
                "username": "TheSakurax"
            },
            "url": "https://myanimelist.net/reviews.php?id=34680"
        },
        {
            "content": "Beelzebub is a genuinely funny anime. And I mean laugh out loud 'til your sides hurt sort of funny. You know you're in for a good time when we are introduced to the basic storyline in the first episode... a huge guy floating down the river spots a “handsome and good looking young man” \"who cared nothing for his follow humans\". He proceeds to then bestow the green haired demon baby (Beelzebub) unto our protagonist, Oga Tatsumi, in one of the strangest fashions imaginable, before taking with an impressive ballerina pirouette. Hijinks ensue when the baby's beautiful demon maid servant, Hildegarde comes looking for thetoddler and finds him attached to Oga. Hildegarde is not impressed but is intent on forcing Oga to fulfil his contract with baby Beel. Oga spends many many episodes trying to pawn the baby off to someone more badass than himself while trying to keep his family, who comically misinterpret his situation, off his back, with varying degrees of success, and lots and lots of comedy. Along for the ride are Furuichi, Oga's best friend and the show's resident pervert, and a host of other delinquents from his infamous Ishiyama High.\\n\\n\r\nAs you can probably tell, Beelzebub is a show that doesn't take itself too seriously, and this approach works very well for the story being told. The main characters, particularly Furuichi, seem aware that they part of a show that routinely sets them up with ludicrous scenarios, as if to test their reactions, and they are not shy about calling out some of the more preposterous elements that arise. Characters also address the viewer directly, which adds a nice touch of humour to the show while making the situations more relatable. I found this approach more satisfying than one where we are asked to accept ridiculous circumstances at face value. \\n\\n\r\nThe show has a lot of heart, and can also be surprisingly creepy at times; these are demons and the underworld we are dealing with after all, but this never lasts for very long, which is a pity because I think the show would have benefited from playing up the darker themes for longer periods to counter the otherwise jovial tone, which becomes a bit tiresome over a 60 episode arc. Still, the show maintains enough originality to entertain and the delivery of punch lines remains top notch for the most part. \\n\\n\r\nOne place where the show does disappoint terribly is in character development. Its remarkable how little the main characters change over the course of the series. This actually turns out to be a main detractor for the comedy as the show goes on because I often found myself wishing for fewer farces and more feeling. Some decent character growth would have solved this issue, but alas there just isn't enough of that to go around. Relationships are especially frustrating. Waiting for something interesting to happen between characters other than fights with comically named \"special attacks\" is like watching paint dry; there just isn't a lot going on there. The supporting characters fare a bit better in this respect, in particular with an entertaining story arc involving a multi-player FPS.\\n\\n\r\nTo add to this, the filler episodes quickly become an annoyance. Simply put, there are too many of them. This wouldn't be so bad if these episodes contributed something towards developing characters, however, they do not. And in the end I kept feeling like these episodes were simply taking away valuable time that could be better used oh say, developing characters.\\n\\n\r\nOverall though Beelzebub is a well written series which keeps track of its story plots, at least until the last episode, so you almost never see characters “forgetting they did something”, or acting out of character, which is very impressive for a farcical comedy like this. Eventually though, lack of character development and some nonsensical villains make it hard for me to call this anime great. Halfway through this series, if you're not being entertained by the humor, chances are you aren't being entertained by anything else. And this is unfortunate, because the show had all the right ingredients to make it absolutely amazing. Still, I would recommend watching the series because you will not regret doing so, if only because it is very different from a lot of what is out there. Moreover, I managed to find a much more satisfying end by basically ignoring the last episode and switching to the manga to get more out this series. The story of Beelzesama and his contractor Oga Tatsumi, does not end at episode 60, and for my money, is definitely worth catching up on.\\n",
            "date": "2012-12-06T08:13:00+00:00",
            "helpful_count": 99,
            "mal_id": 79322,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1266895.jpg",
                "scores": {
                    "animation": 0,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Last_Chevalier",
                "username": "Last_Chevalier"
            },
            "url": "https://myanimelist.net/reviews.php?id=79322"
        },
        {
            "content": "I will not deny, I'll be a little biased towards this anime cuz my favourite genre is comedy and the supernatural, so this was quite the perfect show for me.\r\nStory:\r\nOnce upon a time, in a land faraway, there was a barbaric, ruthless, defiant, demon-like bastard who thought nothing of his fellow man. And under some strange as heck circumstances, he started to raise a baby.\r\nCorrection. Not just any baby. The next great demon lord!\r\nAnd so we follow this man, Oga and Baby Beel with their wacky so called 'adventures'. The story's plot is not deep or anything, however it does feature something out of ourdaily lives and the humor is hilarious. Oga is always dealing with weird situations (which I kind of feel sorry for him) and all of them have to do with Baby Beel. But there are certain moments in the story that will make you go \"aww\" just for abit as well. \\n\\n\r\nArt:\\n\r\nThe art is mediocre. But there are certain times where humorous exaggerated facial expressions are drawn very well which I will give a thumbs up for. They do have a little bit of fights, which are short enough and not too long.\\n\\n\r\nSound:\\n\r\nThe OP and ED suit the anime very much. OP is a kind of rock-ish song which is kind of catchy and the lyrics are all of Baby Beel's words while ED is slightly more toned down and mature. The background music in each and every episode is fufilling and goes very well especially in comical scenes.\\n\\n\r\nI'll be honest-I'm a little biased because of Baby Beel's seiyuu, Sawashiro Miyuki who has done a great job on him and his baby-like noises.\\n\\n\r\nCharacters:\\n\r\nOkay, so I gave this one a high score but of course with reason. The characters inside are not that usual in animes and so is Baby Beel (of course, why would Baby Beel be usual? He's the cutest thing on both hell and earth.)\\n\\n\r\nOga, as said by many as the bastard who never seems to have any sympathy for fellow men, actually shows a slightly (reaaaal slight) tender side towards Baby Beel. You can see him actually developing for a bit in the anime as the story progresses, I would say that it's because he faces the hardships of raising a baby and being a parent etc. \\n\\n\r\nBaby Beel is the great demon baby as you probably know already. He exerts great demon-like qualities, yet for some reason can still manage to maintain that innocent image. \\n\\n\r\nOverall:\\n\r\nI enjoyed this anime quite thoroughly, each episode had me laughing my ass off. If you're looking for something out of this world (or perhaps under instead) and something to laugh at as well, I'd highly recommend this anime.",
            "date": "2011-02-01T18:28:00+00:00",
            "helpful_count": 75,
            "mal_id": 34187,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/330860.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/aKiy0z",
                "username": "aKiy0z"
            },
            "url": "https://myanimelist.net/reviews.php?id=34187"
        },
        {
            "content": "I give this serise a 6, which may come as a suprise to others, yet carefull though has gone into this...\r\nWhen the manga came out, I though it sounded promising and in all honesty, it came off to a good start; it was entertaining and the plot is actually fairly brilliant.\r\nUnfortuantley, it slowed down. I gave up a while back, hoping to start reading when it became eventful.\r\nAround a year ago however, I heared an anime was in production; so I dropped the manga in order to fully enjoy this serise in motion picture and erase predictability; at a faster pace, this wasn't the case.\r\nTheabove is my decliration informing people that I did really want to enjoy this series and have invested time into it over the past few years...\\n\\n\r\nNow, I'll get back on topic...\\n\r\nThe problem with this serise is it's slow pace and characters...\\n\\n\r\nStory...\\n\\n\r\nA delinquant youth must raise the infant demon lord, who thrives on conflict, into becoming a fearsome leader who will dominate the world.\\n\r\nThe comdey comes into place as this teenager has no choice but to furfil his duty, dispite the fact that he wants no part bringing about world distruction and is far from ready to be a dad.\\n\\n\r\nWhat's wrong with the story is there's way to much 'humor' and not enough focus on the enitial plot.\\n\r\nComedy or not, the 'humor', which mainly consists of; comical violence, mediocre villians getting beaten up and the babies tantrums, quickly becomes repetitive when you concider how much potential the series actually has.\\n\\n\r\nAnother major flaw is the fact that the manga is still so young, yet it seems production want this to be one of those serises that runs indefinatley, meaning it's pace won't speed up and chances are, fillers may be incorporated.\\n\\n\r\nCharacters...\\n\\n\r\nMy personal problem with this serise is the cast of characters.\\n\\n\r\nOga is a teenage boy who seems pleasant enough, however, alledgedly, he's scary, an established delinquant feared by all. We are suppose to simply accept that nobody can beat him - every guy fears him, thoses who don't are overconfident thugs, some of whom are also established and unbeaten, still, somehow, they all prove no match for him. \\n\r\nThere seem to be little quirks to his character apart from the fact that he doesn't really want any part in what is going on, minus the scenarios, the writer hasn't really given him a great deal of attention.\\n\\n\r\nThe other characters consist of; a pretty icequeen and a pretty tsundere (cliche of shounen's today - grumpy girls supressing their feelings); these are the two 'love interests'. \\n\r\nThere is a fairly interesting passive friend/sidekick who represents the 'normal person', aswell as a submissive supernatural aid, lagging in the attention department in comparrason.\\n\r\nFinally, the baby, simply a baby.\\n\\n\\n\r\nI check out the manga now and then, hopefull, something will occur to enspire me to get back into the serise and re-consider this review, yet after two years and 12 episodes, this serise is, unfortunately, dropped. :(",
            "date": "2011-04-15T09:07:00+00:00",
            "helpful_count": 57,
            "mal_id": 36089,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207731.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Queen_Stars",
                "username": "Queen_Stars"
            },
            "url": "https://myanimelist.net/reviews.php?id=36089"
        },
        {
            "content": "Beelzebub... I was eager to try it at first, found the first episode cute and from then on I found it to be progressively tedious and under-entertaining.\r\nStory - Skipping the summary, we have a continuous series of who's tougher than who without any kind of emotional investment or deeply convincing romance. Instead we have low grade manufactured comedy that can't even crack my lips into a smile if it were as inflexible as water. It has not and I do not expect it to ever give me a laugh where I cradle my gut in my arms in joyous pain.\r\nThere is nothing here of valuehere. Nothing... The distinct level gap between the story that actually tries and anime like these are unfathomable unless personally experienced over a period of many years of watching different types of anime.\\n\\n\r\nArt - Art... I don't remember any art. You call this art? Character designs don't really do it for me, not once have I ever stopped to wipe my drool to appreciate it's animation.\\n\\n\r\nSound - Nothing in the sound track, the voices are not memorable.\\n\\n\r\nCharacter - They're all just archetypes, characters we've seen done so much better in other animes.  I don't give a crap if any of them died, honestly, my tissues are doomed to collect dust in the corner of my desk.\\n\\n\r\nEnjoyment - balls, tits, penis, that is all.\\n\\n\r\nOverall - Unless you enjoy wasting your time because you can't realize that there are animes that can offer more in less time, by all means watch this...\\n\\n\r\nThis review was not helpful for your ass. Go ahead, screw me like this anime did.\\n\\n\r\n[Review update] (01/09/12)\\n\\n\r\nEpisode 48... fuck this anime, I'm out...\\n\r\n*Dropped*\\n\\n",
            "date": "2011-10-07T08:36:00+00:00",
            "helpful_count": 45,
            "mal_id": 45007,
            "reviewer": {
                "episodes_seen": 36,
                "image_url": "https://cdn.myanimelist.net/images/userimages/301688.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Plagus777",
                "username": "Plagus777"
            },
            "url": "https://myanimelist.net/reviews.php?id=45007"
        },
        {
            "content": "Let's get right to the central point because I writing like short reviews.\r\nYou're probably asking to yourself when picking up this Anime \"Will this make me laugh so hard I can't breathe?\". The simple answer is YES and let me explain why.\r\nThe names of the central characters the story of Beelzebub revolves around is Tatsumi Oga and Baby called Beelzebub. Tatsumi is a delinquent at the worst school in his area and Beelzebub is the son of a demon who was destined to take over the world. From there, wacky stuff happens in EACH EPISODE that will have you on the floor crying for laughter.Honestly, I would say that the story is of less importance than how the characters were executed since it is a comedy.\\n\\n\r\nBefore watching Beelzebub, I didn't think that Anime could be so funny that I would consider it a masterpiece(This was also before I watched Gintama). Most Comedy Anime to me at the time seemed too tryhard/forced and that you would essentially need to be Japanese to laugh at the jokes. That all changed when I watched Beelzebub. I loved EVERY CHARACTER. Each of them had something to offer as a whole for the comedy so that nobody was left out. What would have played out as a normal thing in other Anime, Beelzebub turned on it's head into pure laughter. I don't want to spoil much but just keep what I said in mind because it's true.\\n\\n\r\nThe music is pretty good also and each episode doesn't feel like it's dragging on. I honestly wish I could watch it all over again for the first time because I love it so much. It's up there with Gintama as the funniest Anime of ALL TIME.\\n\\n\r\nSo just give it a try and see if you like it.",
            "date": "2015-12-17T07:59:00+00:00",
            "helpful_count": 40,
            "mal_id": 205770,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1465385.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ruggarell",
                "username": "Ruggarell"
            },
            "url": "https://myanimelist.net/reviews.php?id=205770"
        },
        {
            "content": "This is a purely enjoyment show full of violence and naked baby.\r\n\"This is a story of a delinquent high school student who ended up having to raise a baby due to unexpected occurances, but this isn't just any baby, it's the Demon King.\"\r\nThat is what you'll hear at the beginning of each episode. It is a constant reminder of what the show is about... as if we'd forget. The show is pretty random throughout, but the show does carry an underlying plot, so not everything is random. And by random, I mean each episode has some kind of different aspect that needs to be learnedin order to raise a Demon King. Anyway, when the baby isn't being focused on, the story mainly involves a lot of violence and sometimes... comedy. Mind you, I haven't found myself laughing very much.\\n\\n\r\nThe art is pretty good, however, a constantly naked baby, isn't really my thing. The art style changes from time to time to show suspense and anger, but overall the art was consistent and detailed. The backgrounds were more detailed than most anime shows I've seen, so that was refreshing. However, the artists reused some scenes a few times which really didn't sit well with me. But overall, the art was good.\\n\\n\r\nSame for the sound, the sound wasn't fantastic or genre-defining, but there wasn't anything too annoying, other than the constant yelling and screaming.\\n\\n\r\nThere really hasn't been much character development yet. Everything seems a bit bland and when a character can get depth, the show goes back to attempt some comedy rather than giving a serious moment of character development. This show so far... hasn't been all that interesting to me, but I am still watching it and hoping that a little romance will develop.. but it seems that hell will have to freeze over before anything serious is introduced. (Sorry for the very bad pun, and no I'm not proud of that sentence.).\\n\\n\r\nLike I wrote before, this is mainly a show about mindless enjoyment, which is something that is needed every once in a while.\\n\\n\r\n~~Subs Used~\\n\r\nSGKK-TMD",
            "date": "2011-07-19T20:25:00+00:00",
            "helpful_count": 32,
            "mal_id": 39549,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/266635.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Romie-chan",
                "username": "Romie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=39549"
        },
        {
            "content": "Plot/Story: 10/10 I just want to start off by saying that this anime is SO fucking funny. You'll be laughing in the first five minutes. Unless you know......you don't have a sense of humor. Super original and unique plot. You got this yakuza looking guy looking after a baby. I mostly watched this just for the comedy. \r\n--------------------------------------------------------------------------------------------------\r\nArt: 8/10 Very good art. Not too shabby.\r\n-------------------------------------------------------------------------------------------------\r\nSound: 9/10 Nice voices. The baby's voice is adorable.\r\n-------------------------------------------------------------------------------------------------\r\nCharacters: 9/10 Super likable characters. Most of them are so funny. Decent character development. \r\n--------------------------------------------------------------------------------------------------\r\nOverall: 8/10 If you like to laugh. Watch this anime. If you're one of those people who THINK theyhave a sense of humor, but low-key don't. Don't watch this anime. :D",
            "date": "2015-12-12T22:24:00+00:00",
            "helpful_count": 30,
            "mal_id": 205395,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5041143.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nalexie_",
                "username": "Nalexie_"
            },
            "url": "https://myanimelist.net/reviews.php?id=205395"
        },
        {
            "content": "Raising a baby isn't as easy as some people might make it seem, especially if the child is the son of the Demon King. His urination has the power to flood the entire country of Japan, oh and make sure to stay within 15 meters of the baby otherwise you will suffer an electrical shock that will instantly electrocute the life out of you.\r\nBeelzebub is a 60 episode anime series following the high school delinquent protagonist, Oga Tatsumi, whom one day sees a big guy floating down the river, split in half, and is thus given the responsibility of raising the demon baby, Baby Beel.A pretty crazy way to introduce the anime right? Well that's just the beginning. Accompanied by the demon maid, Hilda, and the dimensional transporter, Alaindelon, Baby Beel has been sent to the human world to destroy humanity. But in order to do so,he  must find a strong human who cares nothing of his fellow man to be his parent and raise him to destroy the human race.\\n\\n\r\nStory:\\n\r\nI loved the story in beelzebub it was something unique and appealing to me right from the start and most importantly, lasted until the end. The anime carries an underlining plot throughout, but most of the episodes are really random and in aspect have really nothing to do with the story whatsoever. But, the comedy and the randomness of each episode was something I loved and made me keep watching. Despite many of these random episodes, the anime does come back to the story and later on the story even becomes a little more complex with new characters and obstacles coming into the picture. The ending did leave me a bit unsatisfied though for I thought we didn't see everything there was to see in which case some of the random episodes did get in the way.\\n\\n\r\nArt:\\n\r\nThe art was something I felt that really made the anime series enjoyable to watch. The character designs were done really nicely and consistently and it followed the vibe of the anime perfectly. For example, in comical parts of the show the expressions of the characters would fit the part perfectly making it much more funnier.  \\n\\n\r\nCharacter:\\n\r\nThe characters in this show is what really makes the anime great. Oga is just this badass first year student who beats the crap out of anyone who messes with him all while doing so with the lovable cute demon baby on his back. We have our typical anime best friend to the main character who is a creepy pervert who has gotten into some of the most hilarious situations making me laugh countless times. Even the supporting characters like other delinquents and Oga's family were great. As you can tell by now this isn't really the anime to be taken seriously so character development isn't really a big concern in the anime. But you do see Oga get along and bond and become like a parent to Baby Beel and as far as character development goes that's pretty much it. But because of all the random episodes there isn't a need for that at all.\\n\\n\r\nEnjoyment:\\n\r\nIf you couldn't already tell, I loved Beelzebub. It made me laugh a ton and I just wanted to continue watching the random adventures of Oga and Baby Beel and the rest of their friends forever. If you're looking for an anime series that'll make you laugh and is really enjoyable to watch then I recommend Beelzebub. Give it a chance, you won't regret it.\\n\\n",
            "date": "2013-08-04T21:00:00+00:00",
            "helpful_count": 28,
            "mal_id": 108259,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/892437.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/shaun2thet",
                "username": "shaun2thet"
            },
            "url": "https://myanimelist.net/reviews.php?id=108259"
        },
        {
            "content": "To put it simply Beelzebub is a show that has overstayed it's welcome. The first several episodes are enjoyable, exciting and funny, which is why I watched this show until now. \r\nSometimes shows should be given some time off to keep us interested at times, I felt that way towards Bleach and now with this one. It's just become way too predictable. The gags aren't funny anymore, the animation hasn't improved one bit, in fact, I think it's worse! What's going on with this show? Just feels so empty now. I've decided to drop this, which is a shame, since it had some potential. \r\nThestory while it keeps progressing, just doesn't seem as exciting as it used to be. Too predictable as I said. The characters have become so damn annoying and boring I find myself skipping scenes. The music is still crap (never liked it in the first place.)...and my enjoyment well...not there anymore! \\n\\n\r\nWould I recommend it...hmm I'd say watch the first few episodes to decide that and then drop it once it gets past the whole battle for the most powerful because after that there isn't much to be excited about.",
            "date": "2011-12-10T21:51:00+00:00",
            "helpful_count": 27,
            "mal_id": 48923,
            "reviewer": {
                "episodes_seen": 46,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=48923"
        },
        {
            "content": "I'd like to start off by clearing one thing up.\r\nI like Beelzebub.\r\nI like Oga, the unbeatable 16 year old delinquent with his ass-pull power ups, and I absolutely adore Baby Be'el, who - for a baby whose only forms of communications seem to be the phrase 'Dabuh' and the victory sign - is one hellishly insightful character. I like watching Oga destroy everyone that happens to march in his way in sadisticly inventive ways. I really like the visceral beauty that is Beelzebub, and giving it a 4 out of 10 must seem extremely outlandish after such statements.\r\nThe thing is, what makes Beelzebub work forme is how bad-ass Oga is. While being perfectly capable of goofing around from time to time, when shit hits the fan, you can expect him to throw all that aside and fluidly assume the role of the ungodly avenger. Fists connect with tangible cracks of impact and bruised enemies, as well as allies, slam into walls with shattering force. Demonic energies are tapped into and buildings crumble down. I've read the manga as far as it has been published, and in it, Oga is just that: a demonic harbringer of violence. \\n\\n\r\nHowever. This has not been the case in the anime.\\n\\n\r\nLet us throw all that out the window. Out with the dark, primitive vibe of the fight. Enter pretty, vibrant colors and horribly retarded faces. Let's get rid off the violent energies ripping the air and replace them with vividly violet sparks. Let's cut down on the emphasis on short, brutal hand-to-hand combat and slap in some slap-stick humor. The gruntings will get across the physical struggle well enough, surely.\\n\\n\r\nIn my opinion, Beelzebub lost its focus when the animators decided to center the show around some of the incredibly hilarious faces Oga pulls off in the lulls between battles. I've watched the anime until the end of the first arc, and that was only because I was hoping that the transition towards the harder fights would breathe some new tension into the stupidly over-exaggerated comedy. I was to be denied even this, and proceeded to drop the show without a backwards glance. Beelzebub needs its comic relief, for sure, and it is brilliantly funny, just as surely, but not in these mental quantities that ultimately shrug the novelty out of the jokes and make them annoying at best. Who knows, maybe the show picks up in seriousness later on, but I have no motivation to see if this is the case. I doubt it, anyway. \\n\\n\r\nI would be interested to see, though, if I would have enjoyed this anime if I hadn't read the manga first. I enjoy a brains-on-vacation comedy as much as the next guy, if not more so, and this anime does deliver that. From the stupid faces to some of the awkwardly weird scenes, manga-Beelzebub's crooked twin brother throws a bunch of humoristic punches straight at the viewers ribs that will surely have them hurting from laughter. Although I have to say I grew weary of the jokes by the time the credits of episode 4 were rolling. The following episodes were gratingly painful to bear as a result, but I do have some pretty heavy bias influencing my view on the characters and how they should act.\\n\\n\r\nSpeaking of characters, there's not that much to say. Oga and Be'el easily steal the gig for me, with Hildagarde the demon nurse-maid providing some entertaining backdrop, and the rest of the characters fit along snugly with their various, though pretty one-dimensional, gimmicks. Kanzaki is probably the only other character that has actually grown on me, but the predictability of all the characters in the various scenarios of the plot does somehow add to the skewed humor of the series. Plot-wise, Beelzebub is a typical shounen publication, running on the general theme of: bad guy! Smash! For me, the lay-out of the fights makes up for this well enough, and hey, we all know what we're getting into with these kinds of series. The villains are interesting, with suitably varying powers and bra-sizes (I kid, I kid - though some fan service is present) to keep the battles different.\\n\\n\r\nTo conclude in as brief a manner as possible, as this went on a little longer than I had originally intended, I highly recommend Beelzebub as a series. If you're looking for some serious bad-ass feels and bodies slamming into walls admist diabolic grins, turn over to the manga. Then again, if a care-free dicking around is more to your liking, I guess you should give the anime a go. Personally, though, if I see that bloody old-Batman-movie-transition-esque fist one more time, I'm slapping someone over the head, hard.",
            "date": "2013-04-19T19:39:00+00:00",
            "helpful_count": 21,
            "mal_id": 94313,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2297867.jpg",
                "scores": {
                    "animation": 3,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kuribohhhh",
                "username": "Kuribohhhh"
            },
            "url": "https://myanimelist.net/reviews.php?id=94313"
        },
        {
            "content": "Beelzebub is a great Anime in every category. Each and every episode will make you laugh your ass off. Actually, I randomly watched an episode from this anime and straight up fall in love with it.\r\nStory:       10/10\r\n-Story is not completely original but overall it seems as though (a naked baby hanging on the back of a teenage delinquent).\r\n- The baby is absolutely NAKED. (You can see his private parts).\r\n-Transportation is quite amazing done by Batim do Emuna Alaindelon. He is a dimensional transfer demon who split him-self up and can transfer anyone who enters within him to the demonworld and the human world back and forth. (Usually he has a weird relationship with Takayauki Furuichi). (Forbidden Love).\\n\r\n-There are many kids of the \"Demon Lord\" (who has a mind of a teenager) and has more than just one kid that Oga carries. And he has his own battalion called the 34th Pillar Squad (they are quite strong). \\n\r\n-Demon servants and alien like creatures in the demon world. \\n\r\n-Women with big boobs and so on. \\n\r\n-Some funny phrases.\\n\\n\r\nArt:    9/10\\n\r\n-Some aspects of the art I just don’t like but overall it is great. \\n\\n\r\nSound:   10/10\\n\r\n-I didn’t find any glitches in the sound and overall everything I have heard is good. Well a more serious/demonic type of music will be well suited for the scenes which contain violent fights. But that is just my opinion. \\n\\n\r\nCharacter:   10/10\\n\r\n-Each one of the character contributes a lot to the Anime and keep it interesting. (NO OBJECTIONS \"said by Kanzaki\")\\n\\n\r\nEnjoyment:     10/10\\n\r\n-Well, as I have said before each and every episode will make you laugh like a monkey who just found his precious banana. The reaction of the other character upon other characters is the thing that will make you laugh and enjoy this anime.\\n\\n\r\nOverall:        10/10\\n\r\n-I recommend this anime to anyone who is looking for an Anime that is funny unlike other animes with a little twist to it. \\n\\n\\n\r\nP.S. Beelzebub means “Lord of the Flies.”  Plus you might not understand some of my phrases that are in parentheses until you watch the Anime. Right now I have seen at least 45 episodes. \\n",
            "date": "2011-12-21T18:07:00+00:00",
            "helpful_count": 16,
            "mal_id": 49735,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/811709.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/chickclick",
                "username": "chickclick"
            },
            "url": "https://myanimelist.net/reviews.php?id=49735"
        },
        {
            "content": "This anime to me is a classic of its time. Airing during what I am going to call the golden age of shounen. I believe this show put up with the best of them, gintama, Naruto, even bleach by the end. The story starts off with our delinquent (oga)  getting into some trouble, like he will do for much of the series. When all of a sudden he stumbles upon 'beel'. Oga our Being the son of the demon lord he has many powers (which they likely took from Pokemon the original series) with him being able to shock our main man.Through the serieswe meet many interesting and deep characters who help lead oga to become the best demon babysitter. Through the show we see relationships altered friendships tested, it really has an amazing cast supporting this show. \\n\\n\r\nStudio perrot is one of the leading produces so without a doubt they had the right crew to handle to editing, soundtrack, and voice acting cast. Its just a classic show that you can watch for fun without a real commitment to a linear story,  however I do know people who are completely story based and may not like the independent episode style.\\n\\n\r\nI would definitely recommend this to anyone who appreciates a quality shounen/comedy",
            "date": "2018-10-11T22:14:00+00:00",
            "helpful_count": 4,
            "mal_id": 291548,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2949723.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/bridgetheman",
                "username": "bridgetheman"
            },
            "url": "https://myanimelist.net/reviews.php?id=291548"
        },
        {
            "content": "Don't waste your time watching Beelzebub. It is 60 episodes of boring stories and nothing interesting nor funny. I gave Beelzebub a 3/10 overall.\r\nThe story, which I wouldn't even call it, was terrible. The concept is interesting, but the story goes no where. When I first started watching the anime I enjoyed it quite a bit. However, I was expecting them to go into Hell and go on some crazy adventure. None of that happened. It was just the main character, Tatsumi Oga, taking care of a demon baby and going to his delinquent school.\r\nThe art was standard anime art and there isn't much tosay about it.\\n\\n\r\nThe openings and endings were alright but nothing to special. The background music in the anime was dreadful and I despised it. It was the same music over and over again. I sometimes hear Beelzebub's background music in my nightmares.\\n\\n\r\nThe characters were poor. Oga was kinda funny but a stereotypical oblivious delinquent. Hildegard was probably my favorite character out of the whole series, but she still wasn't great.\\n\\n\r\nI didn't enjoy this anime except for about 5 episodes. Other than that I hated every other episode.\\n\\n\r\nOverall, this anime was poor and I did not like it at all. I don't recommend this anime to anyone unless you want to waste your time.",
            "date": "2017-10-08T09:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 260157,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5829673.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/logyloo",
                "username": "logyloo"
            },
            "url": "https://myanimelist.net/reviews.php?id=260157"
        },
        {
            "content": "Beelzebub, a story about a ruthless defiant who doesn´t care about his fellow man at all, paired with the baby of the demon king. \r\nAt first i was skeptical about it, but still gave it a try due to the ratings that the manga had. And if i may say so, i wasn't let down the least. \r\nThe mixture of action, comedy, supernatural and maybe a little drop of romance makes up a delicious meal. \r\nThe story begins with Oga being chosen as the parent of the demon king's son, Beelzebub IV. Oga who sees Beel-bo as nothing more than a nuisance tries to getrid of him and in the process beats up some of the strongest delinquents in the school that he is attending, Ishiyama. Although it might not look like it at sometimes, the bond between Oga and Beel-bo is growing and getting stronger. As seen when Oga refuses to give Beel-bo to a group of robbers when they say that they are just going to use him.\\n\\n\r\nThe Art and Sound go well together and the seiyuu's were perfectly chosen.\\n\r\nAs for the art itself, it is what i'd call your average style. something that we have all seen once or more. \\n\\n\r\nAnd then we arrive at the characters, alot of typical characters but some with a little twist to them. The real surprise is the main character Oga, he doesn't look like your average shounen \"i need to protect\" character. Oga looks evil in any situation even if he tries to be nice. but that is just physically, Oga is portrayed as ruthless but as said many times he is not the ruthless defiant who doesn't care about his fellow man. In times it is shown that he helps others even if it might mean trouble for him. As seen when he kicked a police officer in his nuts and threw him into the garbage can to prevent Kunieda Aoi from slapping him. \\n\\n\r\nA 10, yes i gave a 10 for enjoyment. Why? Since it never ceases to make me laugh and look epic at the same time. Whenever it is out on Sunday morning (for me) i usually watch it even before One Piece.\\n\\n\r\nOverall: 8, because the story is not really that deep yet, so the first 7 episodes are given an 8. I cannot know what happens yet since i don't read the manga but i'm pretty sure it'll only get better. \\n\\n\r\nI hope you guys and girls will give Beelzebub a try now, and when you do i can assure you that you will like it. \\n",
            "date": "2011-02-20T04:10:00+00:00",
            "helpful_count": 10,
            "mal_id": 34595,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/297804.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/grakara",
                "username": "grakara"
            },
            "url": "https://myanimelist.net/reviews.php?id=34595"
        },
        {
            "content": "Now, LET'S BEGIN! Beelzebub huh? Ever since I saw it in the upcoming spring anime, It never really caught my eye. That is until it came out.\r\nThe first episode will leave you in tears. I'm serious! You'll be laughing so hard that you will begin to cry! The whole concept is hilarious! Definitely watch this anime if your looking for a good laugh!\r\nStory:\r\nWell as funny as the show is, the story is kind of weird. Really not something that I would have expect when I saw the anime at first. It's basically about this normal teenage kid who under certain circumstances is raising a, tobe, demon lord. Of course, this is anime so the sense of reality is already gone. But that doesn't prevent this story from being funny!\\n\\n\r\nArt:\\n\r\nGreat art composition. But almost all new animes have great art composition. Fluent movement, and at times really detailed. There are parts when the animation goes really dark, but that's mostly for the atmosphere they are trying to create.\\n\\n\r\nSound:\\n\r\nAwesome! All their voice acting is great, even Baby Beel. I didn't know how they were going to dub a babies voice, but they found a way! The intro is...not bad, I personally like that it's not a pop or hiphop kind of opening but a rock theme. It also fits very well with the show, fun and upbeat!\\n\\n\r\nCharacters:\\n\r\nAll the characters are awesome! Unique, funny and a riot to watch.\\n\\n\r\nIn conclusion, I enjoyed this show and will continue to enjoy watching it as new episodes come out.\\n\\n\r\nI hoped you enjoyed reading my review! :)",
            "date": "2011-02-25T14:17:00+00:00",
            "helpful_count": 8,
            "mal_id": 34750,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/452105.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/reidesu",
                "username": "reidesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=34750"
        },
        {
            "content": "\"Let me tell you something good—Beel won’t destroy the human world, do you know why? It’s because I’m his parent, I won’t ever let him do something this stupid.\" - Tatsumi Oga\r\nI shall go straight into this, hopefully it's an alright review.\r\nStory: There are many stories about devils/Satan and such, but this one is a bit different. Satan sends his baby to Earth to pick a strong person who then will raise him to be able to destroy Humans. He then picks Oga Tatsumi, a delinquent, and faces many tough challenges of raising Beel. \r\nArt: The art of Beelzebub was nice. Good colors, backgrounds, details,and the faces the characters will sometimes make are priceless. I don't really have any negatives on the art.\\n\\n\r\nSound:The first opening was very catchy, and I really enjoyed it. The voice actors for each character, especially Beelzebub, were very enjoyable and were perfect for them. The voices sounded right for each character.\\n\\n\r\nCharacter: Each of the characters of this show are different, unique, and very funny. Not much to say.\\n\\n\r\nEnjoyment: To be honest, when I started it I wasn't expecting it to be so hilarious or a favorite of mine. I was took by surprise by how funny it was, you will be crying from laughter every episode. The only problem I had with the series really, was how rushed the ending was. The main focus of the last episode should have been Beel going back to Hell, but Satan sends him back. That happened, but in literally the last 5 minutes. It felt very rushed. \\n\\n\r\nOverall: It was a really enjoyable series, with many laughs. I would re-watch many times in the future, and would recommend to many people.\\n\\n\\n\r\nIf you find any flaws you want to point out in this, please message/comment it to me. It would be greatly appreciated. \\n",
            "date": "2015-02-13T21:26:00+00:00",
            "helpful_count": 8,
            "mal_id": 180290,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4466048.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Giannini",
                "username": "Giannini"
            },
            "url": "https://myanimelist.net/reviews.php?id=180290"
        },
        {
            "content": "This anime started out great. It has a lot of comedy that works well. In fact it was the comedy that really drove it for me. There is a story of sort, but the storyline is the weakest element in this series. The idea is great, but all in all it's a fair delivery at best.\r\nThe main character is an incredibly strong delinquent. The connection he forms with Beel is pretty solid, and their relationship is key to the story. The supporting characters are all delinquents as well, and though they have a lot of humor they are all lacking. The fight scenes build upto be a little disappointing, and a lot of great ideas just fall short. By no means is this a bad series, it's just missing something. Though I loved the comedy at first, it all became a little monotonous. \\n\\n\r\nI wouldn't recommend skipping this series because it does have it's high moments. I just wouldn't set your expectations too high. Some will love the comedy all the way through and others will feel as I did. I loved the premise but was disappointed in the execution. Keep this on the back burner, but no rush to watch.",
            "date": "2013-01-24T14:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 84727,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/568293.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/explicit707",
                "username": "explicit707"
            },
            "url": "https://myanimelist.net/reviews.php?id=84727"
        },
        {
            "content": "Overall a very good anime, so funny to watch easy to grind the whole series from what i can watch, the only problem it is for me is that the baby is naked pretty much all the time except where the episode is made it a problem that he needs to be covered up specifically\r\nCharacters are so fun to learn about and everyone tries there hardest to be badass but cant be more hardcore than the main character with the baby.\r\nArt and Sound are both key for me to keep watching and when watching it looks fresh and clean",
            "date": "2017-05-18T08:46:00+00:00",
            "helpful_count": 4,
            "mal_id": 247982,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4021915.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Honbloc",
                "username": "Honbloc"
            },
            "url": "https://myanimelist.net/reviews.php?id=247982"
        },
        {
            "content": "Hello everyone, welcome to my beelzebub anime review...*seethe*... if any of you remember my manga review then you'd think I'd br praising this too right? WRONG!! I CAN'T STAND THIS ANIME ADAPTATION, I SWEAR BEELZEBUB'S GOT THE WORST LUCK IN THE WORLD TO GET THIS PILE OF GARBAGE AS A ANIME ADAPTION!! well, I'm going to beging being a bit more mature reviewer here and explain to you why I despise this  piec of sh- anime, so much, while I have nothing but love for the manga.\r\nStory: Its pretty much the same, which really should make me hate it less, but its exactly thisreason why I hate it. It comes off the same, but they twist and turn so many things that made it awesome in the orignal. for example, Oga was supposed to blow ishyama into rubble after his fight with you know who, but instead it gets disoriented with a retarded punch mark. how... is that possible? I know beelzebub is batshit insane but thats just dumb! not to mention how they pretend like every deleinquent knows DBZ style ki attacks, when its really just the wind force from their blows. you don't even want to get me started on the fillers, the magical girl one was the most ridiculous. I really lost my shit during  the rooftop battle arc, where stuff begins to happen that dosn't even exist in the manga, and they dare go back to the original plot. I just dropped it right then and there. basicly its the \"same\" but with many retarded twists and turns, its stupid for even beelzebub.\\n\\n\r\nArt: it sucks. Just flat out sucks. I always thought fairy tail's anime had crappy animation, but beelzebub's anime made fairy tail look like BONES did the animation in my eyes! The designs into the anime range from semi ok to really annoying(why does hilda have elevator shoes?) the movements acctually seem to dull out the jokes rather than improve on them and the fight scenes... my god the fight scenes. the only one I liked was the last one against the THKH, and even that was just barely, the fights before hand were just pathetic only aoi's managing to entertain. The fights afterwards try to give everyone DBZ like ki attacks when its supposed to be OGA who can only do that, and he scarely does it! the rooftop fight with the three generals, which was my favorite supernatural fight in the manga, got completely butchered due to the pisspoor movements and hits not even seeming to connect. I've seen students in a animation class do better than these clowns!\\n\\n\r\nsound: I barely acknowledged the sound track. nothing really struck me as memerable and only did its job to keep me awake while watching some of these episodes. I only liked the first OP and ED pair, the 3 end had pretty animation better than the damn show and was a nice song in general while op 3 was meh is, all the other themes were either mediocre, or can burn in hell for all I care.\\n\\n\r\nCharacters: all the characters I've come to love so much in the manga, the anime just pulled out the darkest, most cliche' parts about them and milked them for all its worth. I know oga's a dumbass but in the anime he completely looses whatever coolness he had in the manga. There he was dense but also had a decent understanding about how delinqents roll and knew what action was right, here he seems just as cliche as any other shonen hero, Furichi's pervness gets to the point of disturbance, Hilda's barely there, increasing my lack of intrest in her character, Alendelon is much more gayer than the manga, Lamia's voice makes my ears bleed, Beelzebub's shocks become more annoying than funny, Kanzaki and Himekawa...well I didn't care that much for them in the manga anyway... but worst of all, AOI. my favorite female character there, her \"cute\" onesided love for oga gets WAAAAAY overplayed, to the point where I understood WHY her haters disliked her, plus she isn't nearly as badass as in the manga, need I bring up the fact that she never flipped Mikki in the rooftop fight? Tojo is the only one they didn't ruin fortunatly (seeing how he's allready dumber than oga its kinda hard to make him dumber) and shizuka's crush is more played out a bit, seeing how it never got that way in the manga but oh well.\\n\\n\r\nEnjoyment: Do I seriously need to fill this out? \\n\\n\r\nOverall: The manga was, and still is, shittons better. Maybe if sunrise did this and they didn't start when it was only on chapter 90!! it could have played out alot better,  but for now, I curse this anime to burn in the deeptest pits of hell, and I gleefully await when this trash ends in april and stops ruining my beloved manga.",
            "date": "2012-03-17T13:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 56183,
            "reviewer": {
                "episodes_seen": 48,
                "image_url": "https://cdn.myanimelist.net/images/userimages/562369.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Thatguy31",
                "username": "Thatguy31"
            },
            "url": "https://myanimelist.net/reviews.php?id=56183"
        }
    ],
    [
        {
            "content": "Now before I get some angry person on here about the plot of this show, pls dun, just go away. This show is not meant to seriously take on the task of giving it's audience this super in depth plot line. There's no serious back stories, other than Baby Ba'el's (the main character) and even that isn't too in depth or serious. It's simply an adventure/ action themed comedic anime who's point is to be comedic while fulfilling a basic plot line. \r\nI started watching Beelzebub a while back as a filler show to watch while I was waiting for the new episodes to updatefor my seasonal anime. Since then, it has slowly but surely taken my heart as one of my favorites.\\n\\n\r\nWhen I first really got into anime, this show was recommended to me a lot. At the time, I was hell bent on watching \"classics\" and anything that was airing on American t.v. channels. This show did not fit the bill for either of those categories, so here I am 5+ years after the shows completion listening to the distant cackles of \"I told you so.\"\\n\\n\r\nSome background on the show: Beelzebub started as a manga written by Ryūhei Tamura and run from 2009-2015, it was adapted into an anime that was directed by Nobuhiro Takamoto and aired by Pierrot+ on January 11, 2011. This show was popular during its 60 episode/ 1 year run time and has accompanying specials, but has lost its fan base spark since then. \\n\\n\r\nMy favorite part of the show is how blatant it is about not being serious. There are moments where the student's will make comments like \"where are all the teachers anyway?\" or \"oh this school has academic tests?\" and you can't help but giggle because of the break in that fourth wall especially when those questions get answered later. My other favorite part is the diversity in the type of comedy used. Poor Furuichi-kun and his never ending distress at having the burly transport demon, Alaindelon as an admirer when he (Furuichi) is just trying to live his youth in peace. Unlikely displayed love for Oga (the other main character) and his complete cluelessness to most things, including that. The mild fan-service that doesn't creep me out because this show is pretty wholesome and gentle on the explicit displays BECAUSE THE SHOW DOESN'T NEED FAN SERVICE TO BE GOOD. \\n\\n\r\n*clears throat*\\n\r\nAll of it... absolutely fantastic <3\\n\\n\r\nWhile I just touched on some of the character interactions, I'd like to note that I find the character design and it's compatibility to the story to be hilariously spot on. These characters, with a minor exception, are all delinquents who go to a delinquent school, and do delinquent things, with their delinquent friends, who can and will start a fight with them, friend or not. It's an entertaining collection of character designs for entertainment's sake. This character design element continues throughout the plot-line introducing a more and more diverse cast as you move forward.\\n\\n\r\nAnother side-note on character design: TALK ABOUT SOME SUBTLE CHARACTER DEVELOPMENT. While some may argue about the subtlety of all of the relevant characters' developments, I think that watching and following this show is like marinating a food. If you try to change the flavor, but don't let it sit long enough, then your dish has no flavor. This show really ... marinates... its characters and creates this very satisfying development of flavor for each one. In the end, we aren't left with an overkill or an underkill, so I'm super appreciative of the character development pacing on top of the plot pacing.\\n\\n\r\nThe art style has a special place in my heart, really and truly. It's simple and doesn't distract from the story, which unfortunately does tend to happen when an artist or animator has awful attention to detail. I have heard from some people in talking about this show, that they feel everything was very lazily done, but I feel (and hear me out) that it's done intentionally? I'm sorry, but everything about this show is intentionally comedic simply for comedy's sake. Honestly, I think the art is pretty consistent with the flow of the show, and depiction of the characters, go ahead and @ me.\\n\\n\r\nI seriously love the show, it's a fantastic watch really and truly. I enjoy everything from the music, to the wack ass story line and plot pacing. It really and truly is worth a watch as a casual comedy for comedy's sake. I can definitely give this show as a recommendation to anyone looking for just a feel good, funny, and purely wholesome anime. It does what it sets out to do, and to me, that makes for a damn good show!\\n\\n\r\nStay tuned! and let me know what you think about this review and show!\\n\r\nI'd love to hear your thoughts!\\n\\n\r\nCiao =^-^=",
            "date": "2017-12-06T09:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 264637,
            "reviewer": {
                "episodes_seen": 30,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6619021.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ama_",
                "username": "ama_"
            },
            "url": "https://myanimelist.net/reviews.php?id=264637"
        },
        {
            "content": "it's a \"meh\" for me, i'd rather re-watch Hinamatsuri, it takes the progression of the story more seriously while maintaining the humor it has rather than this one with 60 episodes of inconsistent BS, hitting you with random jokes that most of the time doesn't even make sense. You can even hear the sound effects that they use in children shows :/\r\nStory - Mediocre\r\nArt - Decent\r\nSound - Poor\r\nCharacter - Decent\r\nEnjoyment - Mediocre\r\nOverall - \"Meh\"\r\nI only got through to episode 28 or 29, I got so bored that it's a chore to watch\r\nFeel free to watch this if you have an intense sense of humor, ifyou don't get bored with the same jokes over and over and over and over and over.. then go for it.",
            "date": "2019-04-19T03:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 306654,
            "reviewer": {
                "episodes_seen": 29,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6994600.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Endorcer",
                "username": "Endorcer"
            },
            "url": "https://myanimelist.net/reviews.php?id=306654"
        },
        {
            "content": "Beelzebub. Weirdest Yankee Anime\r\nBeelzebub is a delinquent filled anime that makes your blood boils as you watch the fighting scenes and makes you laugh. \r\nStory 6: Nice take off, but the end leaves you unsatisfied.\r\nArt 6: Wonderful Graphics, but seems typical\r\nSound 7: Good voice acting and music match the anime.\r\nCharacter 8: Unique yankee. They have you laughing your pants off.\r\nThe story started out great. You had Oga a studentwho is so badass and is only a first year at the infamous Ishiyama High, a place for yankees to relax. He stumbles upon a man floating down a river and he splits open revealing a baby that is the son of the demon king and it's mission is to get stronger and destroy the human race. Oga is then chosen to raise the baby and help him get stronger. The anime follows the duo along with the baby's maid as they face strong opponents. The concept appealed to me as I fan of this type of thing so I watched it and fall in love. Then towards the end my faith dwindled as the story was becoming short. The manga is still on going so I thought the anime would at least be longer, but as I watched the last episodes I could tell it was rushed. It ended so sloppy and that pissed me off.\\n\\n\r\nThe art is not bad, but it doesn't really catch me eye. Sure there is a lot of weird things that happen in this anime including a flood of tears, but I felt like the graphics was typical. The only characters that really stood out was the baby with his nudity and green hair and Alaindelon who is masculine, but with a girl taste. Also while there is fanservice in this anime, it is not used to the extreme like a lot of shounen.\\n\\n\r\nI loved the op and ed in this anime and I felt it matched the anime, especially the first op dadada. The background music didn't stand out in a bad way, but blended in with the anime. The voice acting did a nice job portraying the characters, but it wasn't outstanding. For dub fans this anime is only in sub, but if you wait a dub might come out. \\n\\n\r\nThe characters is what steals the show as they were so different from what you thought. Oga starts off as the tyipcal bad guy with his funny moments so you think all the characters are going to be typical like him, but shocks you when they have their unique personalities. Beelzebub is the baby that likes fighting and scary stuff while Hilda is the maid from hell who has her nice moments. One thing people have a problem with is Alaindelon because he is different in the manga, but I haven't read the manga so I can't say anything.\\n\\n\r\nOverall liked the anime and would recommend it to people looking for a new delinquent show.",
            "date": "2012-07-04T15:32:00+00:00",
            "helpful_count": 6,
            "mal_id": 65343,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/497675.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/animefreak0007",
                "username": "animefreak0007"
            },
            "url": "https://myanimelist.net/reviews.php?id=65343"
        },
        {
            "content": "The story follows Tatsumi Oga, a first year student at a school for juvenile delinquents called Ishiyama High. The story starts with Oga telling his best friend, Takayuki Furuichi, the strange story of how he found a baby. One day while doing 'laundry' by the river, Oga saw a man floating downstream. Oga pulled him to shore but the man split in half, revealing a baby boy inside. This baby turned out to be the son of the great demon king, and Oga has been chosen as the one to raise him, along with the baby's maid, Hilda. The manga follows Oga's life as hetries to raise the child while enrolled at Ishiyama High.\\n\\n\r\nIn the early chapters, he attempts to 'pass on' Beel to other students at Ishiyama, thinking that if he can find someone stronger and more evil than himself, the baby will attach himself to that person instead. He decides to try to pass the baby on to the Touhoushinki, Ishiyama High's strongest four students. Oga meets and fights Hajime Kanzaki, the first member of the Touhoushinki and the one who is closest to dominating the school; however, Oga defeats Kanzaki, which causes Beel to find him even more appealing.\\n\\n\r\nLater, Oga discovers a peculiar symbol etched on the back of his right hand. Hilda explains that it is the fly king's seal, more commonly known as the Zebub spell, and serves as the family crest of the royal family. The appearance of the seal means that he has officially made a contract with Beel. She also explains that the more evil the bearer of the seal is, the more complex the design of the seal will become. Oga attempts to prevent the seal from growing by avoiding fights with other students, but gives up when Himekawa, the second member of the Touhoushinki, captures Hilda and Furuichi. Oga infiltrates Himekawa's base to rescue them and defeats him by using the Zebub blast for the first time. The consequences of using the seal's power cause the crest to stretch across his arm. Hilda comments after looking at the crest that the amount of energy it used would have driven a normal human mad.\\n\\n\r\nWhile visiting the park, Oga meets a girl named Aoi and her brother, Kouta. Oga asks her immediately to go out with him, which causes a misunderstanding that stays within Aoi's heart. Oga tells Beel to fight Kouta, possibly as a joke, but Kouta accepts the challenge and easily pushes Beel off a bench. This event sparks a rivalry between the two babies. It is later revealed that Aoi, who was in disguise the whole time, is in fact Aoi Kunieda, the leader of the Red Tails and another member of the Touhoushinki.\\n\\n\r\nAoi, who was away from school during the earlier events of the manga, has returned to Ishiyama High to defeat Oga in order to prevent him from causing any more trouble within the school. When they encounter each other in battle, she realizes that she has already met Oga in the park, but he doesn't recognize her. After he dodges her attacks twice, he notices Beel's interest in Aoi and asks her to become Beel's mother. Although he means for her to replace him as a parent, his request causes another misunderstanding similar to the one in the park. The fight is postponed, and Hilda soon arrives to give Beel his milk. The MK5 make their debut in the story, only to be defeated in a five panel pattern which appears again later in the story. After the fight, Beel senses something which turns out to be the last of the Toushinki, Toujou. Oga, however, does not notice.\\n\\n\r\nAoi sees Oga and Hilda's fight with the MK5, and believes the rumors that they are husband and wife. She is challenged by Hilda to a fight so she can test her ability, but the fight ends quickly with Hilda deciding that Aoi isn't on the same level as Oga. At the same time, Oga is confronted by Chiaki and Nene. Two female students tell Aoi that Oga injured the two of them, which later turns out to be MK5.\\n\\n\r\nAoi fights Oga to avenge her two classmates, while Oga assumes that she wants to accept the role of becoming Beel's parent. At the same time, Nene wakes up in the infirmary and goes to warn Aoi of MK5's trap, which turns out to be Miwa's scheme. MK5, however, prevents anyone from interrupting Aoi and Oga's fight. Nene is about to get shot, but Natsume appears and fights with MK5 to allow Nene to tell Aoi. She was unfortunately too late, as Aoi seems to have defeated Oga, and she comes just in time for Miwa and Ikari to take over.\\n\\n\r\nOga suddenly gets back up and defeats Ikari and Miwa with ease. It is then shown that Furuichi and Hilda have been watching the whole time. Oga, Furuichi, Hilda and baby Beel go to the beach in search of Toujou to hand baby Beel over to him, not knowing that this is a plot set up by Kanzaki and Himekawa, who want Toujou and Oga to crush each other. Aoi goes to the beach as well to warn Oga of Toujou's strength. Oga and the gang have troubles searching for Toujou and are sent on a wild goose chase. Oga decides to write a letter of challenge to Toujou and have Aoi pass it to him. Aoi attempts to tear it up, but one of Toujou's henchmen finds it. They are supposed to meet between the two rocks at 5 PM. Oga is confronted by the MK5 once again, but quickly defeats them and arrives late. Toujou has left after crushing several motorcycle gangs, which inspires Oga to find Toujou. Later, baby Beel starts feeling sick and it appears that he's come down with a cold. However, Oga's tattoo mysteriously vanishes, and later that night Beel disappears. Hilda kicks Oga out of the house and leaves to find help in the demon world. Oga goes off to find Beel, but runs into Tojou, who, as it turns out, has Beel on his back. After a scuffle, Toujou comes out as the victor, and asks Oga to challenge him again sometime. Once Oga gets home, he is in a surprise to find Hilda there waiting for him, with a strange demon doctor known as Dr. Furucas, and his assistant, Lamia. Furucas reveals that the cold is actually Beel's way of coping with a rise of his power, by keeping the energy within himself, and that he cut off the link between him and Oga to protect him. Lamia then injects Oga with a drug that allows him to reestablish the connection with Beel. Oga then goes to confront Tojou with the aid of the three other Tohoshinki. Once he makes it to Toujou, Beel returns to normal and goes back to Oga. Toujou and Oga then have one final duel in which Oga is victorious, but baby Beel's influx of power causes him to destroy Ishiyama.\\n\\n\r\nDue to their school being destroyed, the students of Ishiyama can only go to their sister school, Saint Ishiyama. Initially, they are constantly looked down on, but after a volleyball match against the Six Knights, the negative views towards them stop. During the volleyball match, Oga's demonic power is displayed due to a fight with someone who had a grudge on him, though it is covered up by the Saint Ishiyama president who claimed that it is just a trick. The president turned up to be a demon himself.\\n\\n\r\nA new teacher soon arrives to replace the one teaching the Ishiyama group, knocking out both Oga and Toujou on the same day before carrying them to the classroom. The teacher, Zenjiro Saotome, later appears when Oga, Hilda and Aoi are attacked by Hecadoth, and puts up a fight against the demon. Later, Naga and Graphel, the other two demons who came to the world in search of Oga, appear before Saotome, but Saotome uses his Spellmaster spell to attack them. After realizing that he is a Spellmaster who is too powerful for them to win against, Naga uses a teleporting jewel to take the three demons back to Demon World. After that Saotome, the spellmaster althogh having Oga refuse he ends up training him.",
            "date": "2014-07-07T09:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 150871,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3834471.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/RickL",
                "username": "RickL"
            },
            "url": "https://myanimelist.net/reviews.php?id=150871"
        },
        {
            "content": "My first review.\r\nStory:\r\nThe story itself is quite appealing. I personally think it has lots of potential. As an action anime the humour works at times but i think the amount of humour included is overkill, completely affecting plot development. The anime is very slow moving as well. I'm unsure if they are fillers (i have not read the manga) but there are way too many episodes that seem to have no relevant to character development or plot development. \r\nArt:\r\nPretty ordinary action style art. Fighting scenes are cool and all, but no real stand out with cool effects. The design on the main characters arm (notrevealing what it is, watch to find out) is pretty cool as well.\\n\\n\r\nSound:\\n\\n\r\nVoices match the characters pretty well. The OP and ED's aren't a stand out. Personally i don't really like them because of how it's done (animation). May become catchy.\\n\\n\r\nCharacters:\\n\\n\r\nCool main characters. Not much development noticed in the episodes i've seen. I found some of the ideas (as in the abilities) they gave some of the characters to be pretty cool.\\n\\n\r\nEnjoyment:\\n\\n\r\nFunny at times. Not very suspenseful. Unless you're a big fan of humourous anime I don't think you will enjoy it that well. Action lovers, there isn't much action actually. There's fights, but nothing big, nothing cool. No real enemy yet discovered.\\n\\n\r\nOverall:\\n\\n\r\nOverall, pretty average. Has potential, just needs to be a little faster in terms of plot and character development. Also needs to reduce the number of jokes per episode. Sometimes it's not funny and instead has a negative impact on viewers (turns them off because the jokes are just lame and makes them feel like it's a big waste of time). \\n\\n\r\nI wouldn't really recommend this to anyone until there's more development in the story.",
            "date": "2011-07-18T23:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 39485,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/388019.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Cheagle",
                "username": "Cheagle"
            },
            "url": "https://myanimelist.net/reviews.php?id=39485"
        },
        {
            "content": "Okay, there comes a time when you might begin to take animes too seriously. You see yourself overthinking events that occur or you take characters words seriously and begin to reflect on them. This eventually becomes REALLY tiring later on.I took Beelzebub as a breadth of fresh air from all this seriousness and I found meself VERY entertaining and relaxing anime.\r\nYou must have read the synopsis, so you can guess what its about. The execution however is amazing!!! Surprisingly, this anime develops a really nice plot as the show progresses and there are tons of funny moments to keep you smiling throughout half the show.\r\nIreally enjoyed this anime because its really funny, has interesting characters and a pretty decent story to boot. Watch this if you feel like relaxing :-)",
            "date": "2016-01-21T12:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 209062,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4568231.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/-Taicho-",
                "username": "-Taicho-"
            },
            "url": "https://myanimelist.net/reviews.php?id=209062"
        },
        {
            "content": "After reading this summary, I wanted to watch Beelzebub right away. Few seconds into the show, I was hooked on it. The comedy is great from the start and the plot is very interesting. At first, I thought some things were repetitive, but I think that they were able to make up for it. I really enjoyed the artwork, just the visual alone made it very comedic. Overall, I think the humor was the best part, and if you also like action, you won't be disappointed either. I think the voice actors were also great. It was surprising to learn that Beelzebub wasvoiced by a girl, but it's always surprising when it comes to anime anyways. The voice actor for Tatsumi Oga was probably the best, in my opinion.",
            "date": "2015-12-03T19:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 204734,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4674119.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NatchiXIchigo316",
                "username": "NatchiXIchigo316"
            },
            "url": "https://myanimelist.net/reviews.php?id=204734"
        },
        {
            "content": "60 Episodes is always nice, But the problem series had more quantity rather than quality episodes. As for series stricly aim for humor and story quality, and story for all it felt it was strenched out the problem was that humor not always \"funny\" sometimes even cringy\r\nStory:\r\nStory is quite hit or miss since it it has like 6-8 arc in it. So basically story always change, 1. Was Like introduction it contrantly was annoying trying to bring out humor by making beezle shoot electricity goddamn that was annoying and tiresome to the point you know whats going to happen...\r\n2 3 and so on was quiteinteresting probable from ~28 till 40 when show showed its peak and was really good to the point of really enjoying show like in the score of 8.5\\n\r\nLast arc was like already feeling like strenched out series and wanted to drop at 50 episodes\\n\\n\r\nArt: Budged asf nothing to show here rather than animations which is rather are nice sadly art style is like late 2000 nothing inovative.\\n\\n\r\nSound: well OP is great exception is the last one wich was really shitty but sound is really forgettable in this one, Character voice acting is quite good some of it atleast\\n\\n\r\nCharacters: Well as bland as it sounds we all seen it we all know it, more than half of characters are stereotypes\\n\\n\r\nIn the end it kinda sounds like a bland show like its kinda is but it has it moments my suggestion start from 1,2 skip few episodes and from 8 watch till you feel bored or smtg i guess 45-48.\\n\r\nFor a show that wanted to commercialise itself it did a poor job and its good you can watch full anime and not even care about manga (there things go littlebit complicated and end same way anime does)\\n\r\nThe show is nothing more than above average and good at times.",
            "date": "2018-11-11T07:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 293841,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4948385.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vol4ok",
                "username": "vol4ok"
            },
            "url": "https://myanimelist.net/reviews.php?id=293841"
        },
        {
            "content": "Beelzebub is the best anime comedy I've seen so far, I apologize in advance if my English is very bad, because my mother tongue is Spanish, and this is my first review. \r\nIt begins in a peculiar and unexpected way for anyone who has ever seen an anime comedy mixed with the supernatural genre, and it is for that fact that, for me, it was the beginning of an anime that generated a lot of laughter, even in horrible days. As the strongest protagonist of Ishiyama, Tatsumi Oga deals with an adorable child named Beelzebub, son of the demon king. Who would say that thisdemon baby will appear inside an old man floating in a river! Do you see how pathetic it sounds? But that makes it an uncommon comedy and to enter a world of demons as the chapters pass.  Although this anime presents some chapters that have no relation to history, somehow it is integrated within it. New antagonists appear, antagonists that physically seem to surpass our beloved protagonist, but nevertheless, Oga always shines with his group of Ishiyama to show who is the boss in the world of humans. Beelzebub presents openings and funny endings, and in my opinion, they really contrast with the genre of comedy. \\n\r\nThe ending disappointed me a bit, I really expected something more, like a final epic battle between Oga and the subordinates of the Great Demon King, but apparently it will not come true, or until now.\\n\\n\r\nIs Beelzebub an anime that is worth seeing? I say yes, but will you dare to try not to laugh?\\n\\n\\n",
            "date": "2018-08-27T15:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 287568,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7377630.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Josse-",
                "username": "Josse-"
            },
            "url": "https://myanimelist.net/reviews.php?id=287568"
        },
        {
            "content": "I really love how this manga and anime is turning out. \r\nYou think it might be boring because it is just your average high school delinquent who goes around beating people up to be the best, but can you imagine that kind of generic storyline is definitely awesome ! \r\nIt is that kind of humorous trait in this manga that makes it special. \r\nI would also be very much surprised if you did not even find one joke or gag humorous or funny. Usually making light humour in a serious life or death situation is done badly, like bleach. But Beelzebub does it really great,so much so it is natural like One Piece. In the end read it for the awesome fights!\\n\\n\r\nI hope can Get another season or continuing  ! :')",
            "date": "2015-07-07T21:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 192674,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4016593.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/The_Samurai",
                "username": "The_Samurai"
            },
            "url": "https://myanimelist.net/reviews.php?id=192674"
        },
        {
            "content": "Beelzebub: A Teenaged Baby Daddy\r\nThis review might contain a few spoilers so caution when reading. \r\nI encountered Beelzebub when a friend told me that I will laugh my pants off if I watched it. So I gave it a try and this is what I can say.\r\nSTORY (8): Its about Oga Tatsumi, a delinquent in Ishiyama High School who is chosen to be the \"parent\" of a Demon Lord baby who will eventually wipe out the human race. And he's doing everything he could to remove that pact. I think the plot of the show is okay with very common elements like the demons, babiesand delinquents but in this age, a very original plot is very hard to craft. I thought the anime started really strong. Character meetings are very hilarious and unforgettable. The problem came when the series is nearing its conclusion. The development of the final arc was very slow due to fillers at first but then suddenly rushed on the final episodes which was kind of a big letdown. There are also a few plot holes that I think should have been answered as well.\\n\\n\r\nART (9): The animation style is  very common but its the way I like it. Crisp and variant colors, smooth lines and good details. It even employs some pictures from taken from the real world which can be refreshing at times. The fight scenes are also impressive.\\n\\n\r\nSOUND (8): The background music in the anime is mediocre, no major standouts or those beat that will make you bop your head or tap your feet but they were appropriate for each scene. But some of the OP and ED themes are very pleasant to the ears. The 3rd ED (Nanairo Namida)and 5th ED theme (Shoujo Traveller) are personal favorites of mine.\\n\\n\r\nCHARACTERS (9):I'm actually glad that there is a diversity when it comes to character design even though most of them are very typical designs. The lead character (Oga) as well some of the supporting cast, are not drawn handsomely unlike most anime where all the guys are smoking hot but still they are found attractive in some ways just like Aoi Kunieda, another character which I adore so much. The supporting characters are also very likeable and have good and appropriate designs in my opinion but some of them weren't really needed in the anime. There are certain clashes and inconsistencies when it comes to personalities particularly in Oga. I don't know if its deliberate or just forgotten to be edited properly...\\n\\n\r\nENJOYMENT AND OVERALL (10 & 9): Its a good thing that I listened to this friend of mine because it made me laughed many times.. It relieved some of the tension I'm having due to my final exams.  It's a good one for the books. Personally I gave it a rocking 10/10 on my list . But if giving an unbiased judgment, I give it a solid 9/10 due to some technicalities I think that should be dealt with. \\n\\n\r\nTry giving Beelzebub a chance. It may be 60 episodes long but still, it can brighten up your day by looking at baby Beel.",
            "date": "2013-07-04T23:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 103863,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2421467.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hiryu12",
                "username": "Hiryu12"
            },
            "url": "https://myanimelist.net/reviews.php?id=103863"
        },
        {
            "content": "There’s a long review coming…………..\r\nAbout the STORY\r\nAnother story about gangs and delinquents. The only difference and uniqueness of it from the others is the very cute and extremely strange demon lord baby which makes this series interesting. The story is basically about the everyday adventure of the main characters. Sometimes, it’s not really clear if there is even a serious plot but the storyline is still interesting and exciting. There’s action and comedy in the series and both are made quite well. The action part is not that explosive compared to some mainstay shounen series of today but it still intensifying enough. And in allfairness, the comedy part is well-made because it can be genuinely hilarious most of the time. They are even able to incorporate humor during serious moments. And the only series I know that does that well is Gintama.  Though, I honestly think there’s more comedy compared to the action part.\\n\\n\r\nAbout the CHARACTERS\\n\r\nThere are quite a number of characters; some are interesting and some are really likeable. Everyone has their own version of uniqueness and weirdness. The great thing about delinquent characters is the very fact that they are simple or rather “baka” characters. They are not hard to understand because they are not complicated characters. All they want to do is to fight and fight. It’s all about getting stronger and who’s the strongest. There’s nothing like an all brawls and no brains type of characters. I just love Furuichi’s character. He’s the real deal. One hilarious guy. He’s the main source of comedy in the series. He’s punch lines are just so “genius”. Whenever they are in a serious situation or scene, he’s the one that brings light into it. The relationship of Oga and Beel is unique yet cute in many ways. But it is no doubt more of a father and son bond. Their relationship is the main key of the series. And as the series progresses, they are looking more and more like father and son as Beel-chan always copies everything that Oga does. One of the funniest characters is the extremely weird Great Demon Lord. It’s quite obvious that he’s the father of the equally weird and funny Beel-chan and Lord En. And because of him, I am sometimes wondering if there’s really an actual serious plot in the story.\\n\\n\r\nAbout Beelzebub\\n\r\nBaby Beel is just so DAMN cute! As if his appearance isn’t enough, his very cute “Dabun” and unique baby talk are making him even cuter. And he gets cuter and funnier as the series progresses. Before I know it, I am already snapping away lots and lots of pictures. And the fact that his naked and juts loves to dance are making him even more adorable and funny, too. He’s really a baby but most of the times he does acts like a grownup which is making him even more irresistible.\\n\\n\r\nAbout Oga Tatsumi\\n\r\nAs most of the characters are not that of a serious character, the simplest or the “ichiban baka” of all is of course, the protagonist, Oga. The old school type of action character who deals things all bare-handed. All punches and doesn’t even need a weapon. The cliché “baka” character who just strikes without even thinking for one second. Oga is the very typical protagonist who’s all brute strength, laid-back, delinquent but deep down is very kind-hearted. Their type always act like they don’t care but the truth is they care so much that they just don’t know how to really express it because they are in the first place tough characters.\\n\\n\r\nAbout the ANIMATION\\n\r\nThe animation is not particularly that amazing compared to those of famous animes but it is still nicely done. The character designs are really good and cute particularly with Beelzebub.\\n\\n\r\nCombine extremely “baka” delinquents, weird demons, and a very strange yet so cute baby; you will have one interesting and fun series. Though, I’ll admit that the ending is not something I expected. I didn’t see that kind of punch line of an ending coming. But all in all, it’s still very much enjoyable.\\n",
            "date": "2012-12-10T22:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 79874,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79874"
        },
        {
            "content": "Although comedy is not my favorite genre, this is a rare exception. Even with a large part of the show being action related, the comedy of it shines through. \r\nIf you have seen the show, you know that the story is about a man who is suddenly gifted a strange baby. What follows is a story involving his close friends, a \"maid\", and the students at various high schools. \r\nThe interesting part of this show is how some characters bounce off of each other, and the fact that the characters are very self aware. \r\nThis show is not meant to be taken seriously, but itdoes have some lighthearted and charming moments. Overall it is a very good watch, but it does have some detractions. \\n\\n\r\nThe show becomes unfocused and more action oriented as it progresses, and shifts the focus from demons, which is the funniest part of the show. The \"antagonist\", or demon lord, is quite a show stealer. \\n\\n\r\nThe premise and its execution are quite different, but it is well worth a watch.",
            "date": "2015-08-14T07:57:00+00:00",
            "helpful_count": 5,
            "mal_id": 196138,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4693924.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/isthismahjong",
                "username": "isthismahjong"
            },
            "url": "https://myanimelist.net/reviews.php?id=196138"
        },
        {
            "content": "This anime is just simply amazing. Its hard to find an anime such as this one, I watched a lot of anime that involve the main character getting into fights, and this anime just made it so refreshing.Almost every anime does it the same way where the main character is softer than a sponge, he fights, he trains but loses a fight, then he remembers about his friends, family and bla bla he won the fight. This anime starts with a badass and it makes it so amazing that the expressions on his face are awesome, you can just connect with the feeling he has.It has so much variety that it fits well for everyone, action, comedy, romance, it has it all. When people say that they have seen funnier anime they are wrong, dont listen to the chubby 50 year old lolly lovers.\\n\r\nDont judge it until you have seen all episodes. The bond between characters and ending is a masterpiece",
            "date": "2016-08-02T19:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 225797,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KoroSensei_1",
                "username": "KoroSensei_1"
            },
            "url": "https://myanimelist.net/reviews.php?id=225797"
        },
        {
            "content": "This anime for my opinion is one of the best comedy and fighting anime.\r\nStory:10/10\r\nArt:9/10\r\nSound:10/10\r\nCharacter:10/10\r\nEnjoyment:10/10\r\nOverall:10/10\r\nStory:\r\nThe story is beautiful because I love the fact that the most dangerous man in school has found the son of the demon king. I also love their hidden power and the ship Aoi X Oga\r\nArt:: \"Spoiler alert\"\r\nThe art is normal i like the details and i dont have much more too say. But in this anime i have see a error in art (when Beelzebub take control of Oga body the Hilda gets a strange face when the wind is coming)\r\nSound:\r\nI love the endings especially because every ending is diferent andthe one i love is the 4 ending \"JUMP JUMP JUMP SHAKE SHAKE SHAKE\" and the 5 ending \"I Can’t Stop I Can’t Stop I Can’t Stop\"\\n\\n\\n\r\nCharacter:\\n\\n\r\nBeelzebub IV, Kaiser de Emperana: For my opinion he is cute and the fact he is always naked remind me a little of shin chan (my brother see shin chan)\\n\\n\r\nFuruichi, Takayuki is the guy that is always in the middle of the problems and i like the relation he have with Alaindelon (jk i prefer he with female sanji\"Hildegard\")\\n\\n\r\nHildegard: She is the sister of sanji of One Piece\"Hildegard Vinsmoke\" that lost her round eyebrown and switch anime :D (jk) Hildegard is the girl that i had ship in the beginner with Oga but when Aoi came i have switch my ship. She is cute and powerful.\\n\\n\r\nOga, Tatsumi: \"SPOILER ALERT IN THE END\" He reminds me Bakugo of Boku no Hero because he almost kill everyone ( he even throw a guy from the window of the 3 floor or more  and that guy is still alive). Oga is overpower from the begginer but with Beelzebub he become more Overpower and Badass as ever. I ship him with Aoi and i love when he have say \"SPOILER ALERT\" Aoi can you be the mother of this baby? \"SPOILER ALERT\"\\n\\n\r\nAoi \"Queen, Sheltered Queen, Aoi Kunie\" Kunieda: \"SPOILERS ALERTS\" Best character of the Anime (for my opinion). Her Love with Oga is soooo kawai/Cutee. I like her very much and my favorite part of her was when beelzebub possess Oga and he almost take the pants down and when everyone was closing eyes her was peeking a little\\n\\n\r\nEnjoyment: \\n\\n\r\nAs i say in the beginner this is the perfect anime of fighting and comedy and is good for people who want fighting and to laugh\\n\\n\\n",
            "date": "2017-11-03T03:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 262403,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5711794.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JackDarkSama",
                "username": "JackDarkSama"
            },
            "url": "https://myanimelist.net/reviews.php?id=262403"
        },
        {
            "content": "simply the best anime ever hands down i rank this no.3 the anime before this is Clannad and after story of Clannad I'm about to watch Gintamina i think thats how you spell it anyway hope this anime is worth it theres like over 100's of em so yeah if anyone has any recommendation please let me know please I'm the coolest loving nerd / jock person ever thank you just try me haha sounds wrong but yeah",
            "date": "2012-04-22T21:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 59455,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1098633.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DFA-DarkLion",
                "username": "DFA-DarkLion"
            },
            "url": "https://myanimelist.net/reviews.php?id=59455"
        },
        {
            "content": "Well the anime has come to an end (I heard), so it's time to write a review.\r\nStory:\r\nThe story got me hooked right away. You don't see these kind of stories often, atleast not with this particular setting. However, as much as I loved the story, when I finished the anime I had the feeling they could have done so much more with it. I haven't read the manga so I can't judge the original story and whether it is the same as this Anime story, but I felt like this story was really potentional but focused to much on the wrong things. The story ispredictable at some points, at other points it isn't. \\n\\n\r\nMy main points of critique are about the ending of the story. Just when you feel an EPIC new Arc is about to begin, suddenly the anime ends with a lame plot twist which basically makes the whole story useless. I don't want to give spoilers, but I feel obligated to warn you that the promising, cool and awesome story you follow for pretty much the whole series, gets destroyed in the last episode. That's all I have left to say about the story. I was very dissapointed with the ending of the story. Perhaps it's better and different in the manga because the anime got cancelled. I don't know if the manga continues. \\n\\n\r\nArt:\\n\\n\r\nThe art is good. Detailed and is satisfying. \\n\\n\r\nSound:\\n\\n\r\nI must admit the sound wasn't outstanding. I can't remember a specific song or sound. But that also means it never disturbed me so I suppose the sound is fine as it is.\\n\\n\r\nCharacter:\\n\\n\r\nThe characters are great. You can clearly see progress in their personalities. It's just to bad it never gets to the point you're waiting for, because the Anime got cancelled. Perhaps the manga continues, like said before.\\n\\n\r\nEnjoyment:\\n\\n\r\nAll in all I enjoyed this anime very much. Until the last episode. The last episode was just bullshit, honestly. It makes me feel like I shouldn't have started this Anime to begin with because of it. It's probably the worst ending ever. Even though, I can't deny I enjoyed the anime for the other 59 episodes so it would be unfair to say I didn't enjoy the Anime. But I still can't ignore the ending. My enjoyment could have been a 10, but because of the ending it will be a 8. \\n\\n\r\nIn overall I enjoyed the anime.\\n\\n\\n",
            "date": "2012-03-25T13:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 56889,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/WowAnimeTaiga",
                "username": "WowAnimeTaiga"
            },
            "url": "https://myanimelist.net/reviews.php?id=56889"
        },
        {
            "content": "Beelzebub, is a great anime indeed. I have a hard time laughing at a lot of things that aren't funny, and some episodes I don't laugh at but there has been a couple of things that I found myself laughing out loud for a good while.\r\nBut mean-while if it's not funny too me, it's very entertaining I haven't seen a boring episode yet in my opinion, and it usually is pretty comical. I'd really really reccomend you too catch up with this seris. I'm hoping it's going too be an ongoing 100+ anime like One Piece, or Bleach.\r\nIt's worth a try though. I've read 9/10people actually like it, and it's rating one of the highest ongoing animes for spring! Most people like it the beginning they watch the first episode, while people like my had too watch a couple more too make sure.\\n\\n\r\nBut sure enough after 4 or 5 I was ready too watch everything that came out, and can't wait for the next episodes :D",
            "date": "2011-04-20T12:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 36253,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/402329.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Aquaisking",
                "username": "Aquaisking"
            },
            "url": "https://myanimelist.net/reviews.php?id=36253"
        },
        {
            "content": "Im going to keep this short and simple. \r\n How do I describe beelzebub?  Hmm\" CRAZY AWESOME FUNNY\".\r\nTHIS IS FUNNIEST ANIME I EVER WATCH.\r\nStory- At first look,  it seems like a serious battle anime. The Story is aabout a delinquent called oga tatsumi. One day he accidentally found on a demon lord baby on the river side. He is kinda forced to raise the baby for some circumstances. As it is a gag anime, the story tend to be abit random. So for those want to watch this anime , keep in mind that beelzebub does not have real storyline. Although it seemsabit bit off, the comedy makes up for it. This anime will surely make u laugh a ton. Even in battles, there will be humour.  Just so funny. When it get serious, the comedic atmosphere does not ruin it. In fact the stort get more interesting. Its like the author know whrn to get serious and when to make it funny. The humour are also random and can appear any time.\\n\r\nArt- The characters are well-drawn. The art totally suits the comedic atmosphere. The animation exceed my expectations.  IT WAS SO SMOOTH AND AWESOME. DEFINITELY A GOODJOB TO STUDIO PIERROT.\\n\\n\r\nCHARACTERS- THIS IS the main thing that draws u into the anime. The characters are unique and original. First of all the main protagonist is a a delinquent named oga tatsumi. He always get into fight and is so called the rampaging ogre in ishiyama academy. he encounters a demon lord baby anf a demin maidservant.  Baby beel a demon lord that has come to the human world to destroy humanity. He is a demon lord baby but he looks innocent. Pretty much the funniest characters I ever seen.  \" if he is 15 meters away from you, you will die\" says the demon maid servant.  AHAHA  every timed baby beels crys,  oga tatsumi will get electric shock.  In every 2 minutes, u will basically laugh at the how funny the characters are. Modt interesting characters u ever seen.\\n\r\nSound- pretty average in my opinion. All of the ops were awesome. The voice actors did a really good job. They definitely was excellent in voicing the characters. This was one Of the reason that makes the anime more funny. Awesome to them\\n\r\nEnjoyment-  if u watch this anime and did not laugh,  u must be lying. This anime doesn't just use old humours, from one look at the atmosphere,  u will laugh out. I found myself LOL IN ALMOST EVERY EPISODE. IT WAS SO ENJOYABLE AND FUNNY. DEFINITELY A MUST IF U WANT TO LOL.\\n\r\nOVERALL- 9/10 this score may be abit bias.  In my opinion, this is the best gag anime I ever watch. So funny and original. \\n\r\nU will not be disappointed . Even when the story is serious, there will be humour in it. It is like a spice that is used in a dish. The humour is what make the anime AWESOME.  \\n\r\nDefinitely worth a watch. Give it a try\\n",
            "date": "2013-11-25T07:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 121371,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3136617.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yuki-mashiro",
                "username": "Yuki-mashiro"
            },
            "url": "https://myanimelist.net/reviews.php?id=121371"
        },
        {
            "content": "I'm not even sure where to begin with this Anime, It has been an EXTREMELY long time since I have sat down and watched an anime this funny and enjoyable.  I recommend watching Beelzebub if you like:\r\nAction\r\nBadass MC\r\nStrong/badass female MC's\r\nDownright funny and silly sequences of events\r\nGreat soundtrack\r\nGreat voice acting\r\ngreat characterization\r\nThe list goes on....\r\nStory: 9\r\nSo I gave this anime almost perfect marks on everything and the story is the only part in the show that I could nitpick on.  Let me be upfront, Beelzebub is very much an anime that doesn't take itself seriously and is meant to elicit out loud laughter and enjoymentvia its hilarious series of events and character interactions.  By that very nature its story shouldn't be reviewed as harshly in this particular category.  That being said as the anime is more or less based off the manga, it is not without filler.  The filler in this case is actually pretty damn funny so I give it a pass.  The reason I don't give the story a 10/10 is because of the ending and because of the time between major plot events due to the filler.  Without giving spoilers,  after watching the show for its 60 episodes at various points one would expect plot development and furthering, it was often the case that filler would ruin the stream of events and almost as abruptly return to the main story.  Again this filler was enjoyable so I won't call it \"bad\" just poorly placed.  As for the ending, well its the kind of ending that left me wanting more out of it rather than what we were given.  Perhaps this is just me being annoyed at not having any more episodes to watch but I was hoping for a more concrete ending if that makes any sense.  \\n\\n\r\nArt: 10\\n\r\nI'm not the biggest art critic, I don't need the highest end character models/drawings and the most vibrant of backgrounds, all i ask for is artwork that is appropriate to the show's nature and for that I give Beelzebub a 10.  A non-serious anime that generally utilizes bright colors is just what I wanted to see and even in the darker, demonic sequences the color choice was always appropriate.  All the backgrounds for most any setting in the anime were also well drawn as were the characters and any of their discerning visual characteristics.  \\n\\n\r\nSound: 10\\n\r\nThe show had a lot of intros and endings and for the most part they go 50/50 in my book, some were really good, some were really bad.  For that reason I won't consider them in this particular review on the show's sound.  What I will consider is anything that happened inside the show and sounds used.  So first things first, I thought the demonic soundtrack that played whenever Oga got serious was badass.  Idk when i'll get tired of it but it's just so good and so appropriate.  All the funny sequences had great fitting music, all the action scense had great fitting music, basically all the music choice and sound fx here were on point.  The highlight of course being any of the fight scenes or Oga's demonic soundtrack.\\n\\n\r\nCharacter: 10\\n\r\nThere's just so many silly characters in this show its amazing.  Whether its battle hungry Tojo, Himekawa's split personality, Oga's demonic personality, Baby Beel's adorable yet troublesome one, all the characters had something to set them apart from each other.  Yes a large chunk of the characters were thugs ---- they come from a school of JD's.  But in the way Kanzaki was a JD, Himekawa was differently.  Each one had his own style and execution, you'd think having a group of characters with the same backgrounds would be a bad thing but here it wasn't.  Each and every major to moderate character had something to set him/her apart and for the most part went through significant character development of some kind.  \\n\\n\r\nEnjoyment:  10\\n\r\nThis anime is freaking hilarious no question about it.  If I had to drop two names to watch out for in this anime it would be Alaindelon and Furuichi.  Just look for these two and you'll see why I rate this anime 10/10 for enjoyment.\\n\\n\r\nOverall: 10\\n\r\nMinor story annoyances aside, and filler distractions withstanding, this anime is the first funny anime I've ever given a 10 and its for good reason.  Though a lengthy anime, each episode watches very well and leaves you refreshed in some way due to the sheer volume of comedy in this show.  If you have the time, do yourself a favor, watch this anime!",
            "date": "2016-01-21T23:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 209103,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DisarmingStar0",
                "username": "DisarmingStar0"
            },
            "url": "https://myanimelist.net/reviews.php?id=209103"
        }
    ],
    [
        {
            "content": "what a drag have to do this again because of technical *cough moderator difficulties* anyway.....\r\nBeelzebub a story about the son of the demon king having a contract with a delinquent...... what happens when you mix a baby who is soooo adorable and a delinquent who is so fiercely competitive and always striving to be known as the strongest, one word, you get awesomeness.\r\n Oga (the protagonist) he is so funny in a scary type of way, he enjoys seeing the torment of others and gets pleasure out of it, he is a bit clueless for example when the main female lead falls for him, hehas no idea, yes this would be the case in a typical romantci comedy but something different about this is that the main female lead dresses up as a complete stranger, which is so obiously obvious and yet Oga still has no idea who she is, i was laughing my ass of at this\\n\\n\r\n Oga's \"interesting\"  gets even more intersting with the addition of Kaiser De Emperena Beelzebub the fourth, the son of the demon king. Baby Beel as Oga calls him, he is just so adorble, but he can be a little annoying since he cries every few seconds for about 2 minutes; despite this you just have to fall in love with him. Oga has been chosen to protect Kaiser and to raise him so that one day he can grow up and destroy earth.\\n\\n\r\nbut being himself he doesnt want to do it, he doesn't like being nice to people let alone babies. From this it is clearly obvious that character development is going to come into play, with Oga getting attached to Kaiser and Kaiser's attachment to Oga, the bond they have is just soo cute. definitely one of the best animes I have seen since death note. \\n\\n\r\nAnd in the manga his hero is my hero GOKU :D",
            "date": "2015-07-10T15:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 192912,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4692128.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/gokuiscool144",
                "username": "gokuiscool144"
            },
            "url": "https://myanimelist.net/reviews.php?id=192912"
        },
        {
            "content": "A freakin' hilarious series, that i only wish lasted longer. Damn, the creators seriously must be on something, or else how do you explain so much creativity in between character relations, that were just PRICELESS.\r\nThe story starts about Oga, a badass in school who finds a child, that turns out to be a devil. From there he must become as powerful as he can with the help of his adopted son Beelzebub to destroy all human specie. Without too much spoiling, the story is  ok for the most part and its really great that all the characters are connected through episodes. Apart from that,this is not the reason to watch it, but can be interesting to those shounen fans.\\n\\n\r\nThe art for the most parts is good and is amazing at showing characters funny situations and i was never turned off by its overall design.\\n\\n\r\nThe sound is great, especially the very first opening theme, DaDaDa, sets the vibe for the shit that'll be going. \\n\\n\r\nThe characters. Ah, where do i even begin with?\\n\r\nThe best character easily goes to Furuichi, if it wasn't for this character i swear half of the comedy wouldn't be there. He is pretty much 50% of the comedy. He is insanely perverted, like dreaming of getting laid with every cute girl he sees on the road. And its even more funny, when he, for example in the last episodes meets a ghost girl and dates her everyday without eating and washing himself only to find out he was possessed by another ghost, a male, which was the one the girl was speaking with the whole time Furuichi was dating her. In the actual anime its so well portraited, you just can't stop laughing.\\n\r\nThe next best character is Alaindelon. His dividing power is cracking me up everytime he gets to Furuichi. Id say that their duo, Furuichi and Alaindelon is the best one in the whole series.\\n\r\nHimekawa and Kanzaki are the second best duo. Its hard to tell why without spoiling, but they fight constantly over nothing and this creates some epicly funny moments in the series, just watch it for yourself. \\n\r\nThe last best character is without a doubt the badass Toujou and king of Touhoushinki. This character is especially hilarious in that everytime he gets on the screen, he somehow manages to have a new job. In an episode he is a construction worker, than a food vendor, then playing a knight in a circus. And is as powerful as a brick thrown in your face, even Oga didn't defeat him the first time.\\n\\n\r\nThese were the best in my opinion. From there you still have Oga, Kunieda, Hilda, Izuma and so on.\\n\\n\r\nOverall, this is a big surprise, i was getting into this anime with the sense of it being a 6 out of 10 anime, i was wrong, this gets a 9 out of 10. The story did a little kill the overall impression, since it develops till 48 episode. Starting with 49 episode till 56 its just fillers, although great and funny. And the ending is rushed, only 3 episodes to develop a battle that last 15 minutes. Yep, thats a shame, since we were watching the characters to grow only for this?! Nonetheless, the comedy is there and i highly recommend checking it out if you're a comedy fan, trust me its worth a watch.",
            "date": "2014-08-08T10:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 155805,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2947783.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/UsualGuy",
                "username": "UsualGuy"
            },
            "url": "https://myanimelist.net/reviews.php?id=155805"
        },
        {
            "content": "Overall View (For Those With Busy Lives): Beelzebub is a great comedy anime with tons of gags which will have you laughing for hours. All the characters get their time to shine and crack a line while the animation is used to great effect for the OTT facial expressions and crazy loud effects that a show like this needs. The biggest drawback of the series is the increasing weight given to the initially unimportant shounen/action elements which are then completely ignored and gotten rid of by the end even though significant time given to these elements suggest that serious developments will occur. \r\nStory: This iswhere the show really falls apart particular in episodes 57-60 which have some of the worst pacing and toning issues I have seen in an anime of far. The basic synopsis provides plenty of opportunity for great comedy and this is the show's clear strength. The best episodes can be found in prior to episode 40 where while shounen/action elements are included they have little consequence to the overall story and are mainly just used as a means of entertainment. Where things start to get bad is when these shounen elements are given more weight to overall narrative and an arc is developed which will seemingly have major consequences for all the characters ( ep 38 and after). The build up was not at all bad and engaging enough for the audience. Just when a climax and a major personal revelation for the MC has been reached however we get 10 EPISODES OF FILLER which damps the pacing completely and by the time we do get back to the main plot it is easy to forgot what the hell was going on in the first place. The final episodes have one of the worst conclusions I have ever seen, so many sub plot points are left completely unresolved, the 'final battle' is very unsatisfying and the final episode basically makes sure the audience knowns that there are no ramifications whatsoever in relation to the arc which has been developed for ONE THIRD of the entire show. The changes in tone and pacing are so bad in episodes 57-60 going wildly from comedic to serious at a moment's notice making the whole finale very jarring and annoying. If you are going to increase the importance of the shounen/actions elements of a show and introduce a number of significant sub plots and then chuck them out the window at the last minute they should never be included in the first place. While some could fairly state that this is a comedy series (which delivers) the construction of this final arc really suggested that major shit was going to go down and when it didn't i was left feeling very confused. If this new more serious tone was never planned to go anyway why include it in the first place and just stick to the pure comedic route of earlier episodes?\\n\\n\r\nArt: Its not a great looking show but in the context of what this series is trying achieve that does not really matter. The animation style fits in very well with the various gags and jokes which are made by the characters while effort has been made to ensure that everyone looks distinctive enough from one and other for you to care about them. One of the best things about having a show take place in a delinquent school is that animators cannot be lazy and make everyone who is not in cast a bloody CGI black/brown haired smiley face with a body. Everyone looks cool and has their own style which I really liked. The MC does have a more traditional spiky hair/commonly attractive look that you would have ALOT but the fact that he can only make evil facial expressions and does not give a shit means this turns into a funny take on a very overused character design.\\n\\n\r\nSound: I really liked the opening and endings for this series, apart from the op's and ed's use of music other than dramatic tension sounds to let you know that things were getting serious use of music was pretty minimal so there is not much to say here. My two particular favourites was the op that sounded like it was being sung by a B-list J-pop boy band (WTF I thought this does not fit in with the show at all but damm its catchy) and the ED with the baby dancing to moves which you can follow along to (have yet to attempt this but will most likely try soon)!\\n\\n\r\nCharacter: Due to the confusion in the final third of the series as to where the narrative actually wants to go character development is something which no one in this cast gets enough of considering the series 60 episode airing. The extent to which this is an issue differs, for the MC there is some character development and personal growth when transferring to another school however the final arc and climax undermines this completely due to the desire to 'make things funny again' as quickly as possible. All of them however are funny and highly entertaining and I did love all the quirks which each of them had by the end. Not as much as other anime such as Gintama or Angel Beats to be sure but I did have a fondness for this group by the end which is not going to disappear anytime soon.\\n\\n\r\nOverall Enjoyment: This series has great comedy and a cast which you will want to keep seeing more of because they are just really funny. The decision to include more serious shown elements however and then completely abandon them in the climax of the show when things should be at their most serious and emotional is a plot decision that will leave me scratching my head for many years to come. It would have been far better to either retain the pure comedy tone for the whole series or make the show into a parody of shouen tropes, something which I think this anime would have been very good at. Instead the viewer is given reason to believe that a shift in dynamics will occur only to have these expectations completely dashed at the last minute. While some may get over this quickly for me it did have me questioning what the point of watching the show had been after a certain point and left a bad taste in my mouth. Overall however this is a very enjoyable watch and if you like comedy a must see.",
            "date": "2016-05-19T19:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 218916,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jasmine555544",
                "username": "jasmine555544"
            },
            "url": "https://myanimelist.net/reviews.php?id=218916"
        },
        {
            "content": "To begin with, my intention is not to offend anyone, in the case that someone is offended there is no problem, I just gave my objective of this anime, this criticism is made to think and analyze in a healthy and respectful way as civilized people\r\nBeelzebub is horrible the characters are one-dimensional archetypes, someone like tatsumi with a good house and family has no reason to be a delinquent, hilda no definite personality sometimes is irritating and in other friendly\r\n, the other characters are flat in writing and design. the series does not know if being a serious shonen or a comedy (which does notgive grace) is anticlimactic, the action is static, the humor is boring, the designs do not combine, the backgrounds are simple and the characters are hateful , in summary beelzebub is a very bad anime",
            "date": "2018-12-03T14:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 295211,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7483503.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GenjuroKibigami",
                "username": "GenjuroKibigami"
            },
            "url": "https://myanimelist.net/reviews.php?id=295211"
        },
        {
            "content": "Beelzebub is quite enjoyable on the comedic side of things. If you're in for a good laugh, I would suggest trying out the Beelzebub Anime. I would suggest using about 5 minutes of your time to try out Beelzebub, and if it's something that you're interested you may stay for a while :)\r\nStory - Their really isn't much of a story in Beelzebub apart from the 16 year old bad ass from a delinquent school picking up the son of the Demon King and having to take care for him and kicking ass. Beelzebub is clearly not focused on the story and more on comedy,if you're here for the story then I wouldn't expect you to stay for long.\\n\\n\r\nRating : 6\\n\\n\r\nArt - Beelzebub has average art, at times they may get a little lazy and may be a little bit of an eyesore. Apart from those few rare moments of discomfort, the regular art isn't too bad and you won't mind it. \\n\\n\r\nRating : 8\\n\\n\r\nSound - The voice acting in Beelzebub is great and there aren't many voices that are going to bother you. The soundtrack used in Beelzebub is actually very epic for an anime that isn't focused on action. The sound is actually a bit over average.\\n\\n\r\nRating : 9\\n\\n\r\nCharacter - The only interesting characters in the anime is Oga, and Tojou. Apart from that the fights don't last long as Oga would just throw them around like they're nothing. Furuichi, provides lots of the humor and not much of the action! Kunieda & Hilda are bad ass chicks and you should enjoy their few minutes of spotlight.  Sadly, these are the only characters that receive much attention and last a while.\\n\\n\r\nRating : 6\\n\\n\r\nEnjoyment -  Beelzebub was enjoyable as in it would be able to make me laugh whenever I really needed it. The comedy is quite nice and it makes the whole anime. \\n\\n\r\nRating : 8\\n\\n\r\nOverall - Beelzebub is great for a good laugh. Sadly, Beelzebub has a tendency to quickly kill off threats and  the characters aren't quite well developed. Sadly, since the anime was cancelled they ended up rushing the ending and ruining the last fight. Oga vs Jabberwock.  If you have a good sense of humor, I would gladly refer this anime to you. \\n\\n\r\nNote : The manga is quite different from the anime and is starting to have more of a plot and the action is quite awesome. If you're looking for some more action or a bit more of a story, I would recommend reading the manga.\\n\\n\\n\\n",
            "date": "2014-01-02T21:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 126915,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3139643.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SatanicAlpha",
                "username": "SatanicAlpha"
            },
            "url": "https://myanimelist.net/reviews.php?id=126915"
        },
        {
            "content": "Beelzebub is a show that had the potential to be great but suffered from a lack of focus and a deteriorating storyline. When I first watched the show I was hooked. It has the \"it\" factor; the element that makes the viewer realize that this is a show worth watching. This factor steadily disappears over time and once its lost it feels like a chore to finish the last half of the show. \r\nI feel like the writers of the series failed to capitalize on the serie's potential, and sadly we are left with a show that gets progressively duller (though it is still good,but nowhere near what it could have been).\\n\\n\r\nStory:\\n\\n\r\nThe story is an interesting if not outlandish premise. High school tough guy finds a demon baby by the river and is forced to take care of it, thus taking the viewer on a comedic trip where the tough guy has to balance kicking ass with parenting a helpless baby. The helpless baby happens to a prince of the demon world and will grow up to destroy humanity.\\n\\n\r\nSadly, there is very little that is developed from what is a great idea for a series. Without mentioning spoilers, the show seems to go all over the place and there are too many filler episodes. The plot is basically \"hero gets beaten, must get stronger, stronger villain arrives.\" I wish they either decided to make this a full-blown comedy, or shonen, but not both.\\n\\n\r\nArt:\\n\\n\r\nThe art is okay. Its not terrible.\\n\\n\r\nSound: \\n\\n\r\nBattle themes and opening themes are interesting and if you like anime music you'll like this. I tend to just pass over them except for in rare cases.\\n\\n\r\nCharacter:\\n\\n\r\nI do like the character designs. Some of the Ishiyama students are just awesomely conceptualized and play on typical Japanese delinquent stereotypes (in a good way). I do wish there was more character development though as most of the characters seem one-dimensional t throughout.\\n\\n\r\nOga and Kuneida are probably the few somewhat introspective characters.\\n\\n\r\nEnjoyment:\\n\\n\r\nThis series gets less enjoyable but thats just me. The viewer may or may not get tired of the same jokes. \\n\\n\r\nOverall:\\n\\n\r\nIts still a good anime. I think it starts off strong but suffers from the writers obviously not having a solid gameplan on where they wanted this anime to go.",
            "date": "2018-08-16T22:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 286655,
            "reviewer": {
                "episodes_seen": 51,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7338371.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mageryan",
                "username": "mageryan"
            },
            "url": "https://myanimelist.net/reviews.php?id=286655"
        },
        {
            "content": "Beelzebub is a really creative addition to the delinquent genre with more colorful characters and an interesting demon baby while still keeping the hierarchy progression in delinquent anime where the MC goes through the gamut of bosses of the school, the big 4, rival schools and all that. It’s really refreshing and the pure absurdity of how our MC got the baby got me instantly hooked. The only problem I had was that the show for me outlasted its welcome, I’d say maybe after episode 35 or so, when there were more arcs surrounding Beelzebub and the demon world. It felt like Death Note orPhantom: Requiem for Phantom in the sense that after a certain point or arc, it felt like a different show and not necessarily in a good way. Other than that, Beelzebub was really solid and definitely deserves a watch.\\n\\n",
            "date": "2018-02-07T11:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 270929,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3555085.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LightIsKirai",
                "username": "LightIsKirai"
            },
            "url": "https://myanimelist.net/reviews.php?id=270929"
        },
        {
            "content": "This is my first review so don't hurt me\r\nStory: The story is unique in it's own way. There are a few fillers thrown in but still very enjoyable.\r\nCharacters are funny and are well developed. \r\n-A baby Which is the next demon lord!\r\n-A man who cares less for his fellow man\r\n-An old man with a moustache who is like a girl\r\n-A perverted guy that is...... odd\r\n-A maid servant\r\n-A bunch of characters who will make you laugh\r\nArt: The characters could have been drawn better, but it still matched the overall theme.\r\nSound: They picked odd music for the openings and ending, but it went great with the anime.\r\nEnjoyment:It's amazingly funny, and adds action thrown in. Which is amazing.\\n\\n\r\nOverall: The time i spent watching it was well worth it, and if you give it a shot i'm sure you will you like it as well. \\n\r\nNow then, as from a funny ending in this.... \"BiBiBiBiBiBi Don't touch me\"",
            "date": "2012-07-04T20:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 65357,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1215095.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/-Snowman-",
                "username": "-Snowman-"
            },
            "url": "https://myanimelist.net/reviews.php?id=65357"
        },
        {
            "content": "Is raising a Demon Lord going to be a fun challenge for Oga Tatsumi or will it be a boring chore?\r\nWell it turned out to be a bit of both thanks good old filler and a nice story, yes there is filler though it only appears close to the shows conclusion with the first two arcs of the series being highly enjoyable and fun to watch up until the three quarter mark (around the 40th -45th episodes) due to a great setting that is both original and a great idea, as having a delinquent raise a demon lord in a delinquent high school (Ishiyama) isjust a recipe for comedy and great action set pieces which series delivers on splendidly with credit due to a great first arc that introduces characters, in well thought out encounters and a great second arc that makes new characters known while still giving enough screen time too the previous ones, during which the overall story of the two parts is enjoyable and fun it can get very predictable with how the scenarios will play out and once again another setting in high school.\\n\r\nOthers issues I had with the story as mentioned before are the fillers which is very poor quality that only gets worse as the show progresses and more frequent with the last few episodes with seven of of ten of the last ten episodes being filler, though in respect to that the last arc of the story is nothing special being both boring and rushed with a terrible ending to the show that just felt like a betrayal.\\n\\n\r\nAs said previously characters in Beelzebub are a great watch, and have good character design as you really get the feel that these are delinquents for the most part with some have very typical looks too others that just look bizarre. But while all this is nice and good, they don't get much development,  with only a handful getting any at all, with only a few subtle moments of supposed development that don't increase much attachment to characters even if there all given a reasonable amount of scene time.\\n\\n\\n\r\nThe characters personalities on the other hand are currently at a fifty - fifty spilt with some being really predictable and other being unique, with the more boring ones being mainly the main character like main character Oga loving to fight and generally plays the role of straight man, normally in response to Hilda the sadistic demon (also for the sake of length I'll just stick to the main characters of the series as there is a LOT of characters) and carer of Baby Be'el the demon lord who out of the main cast was surprisingly, has the more unique although annoying at the start he grows on you as one of the few characters who develops while in comparison with no development there's Furuichi also known as comic relief and the creepy pervert. There is also the top 'dogs' of Ishiyama who play a big role in the plot as it progresses  and get a very good amount of screen time, also get almost no development aside from a small romance sub-plot that goes nowhere but on the other hand get good character design and interesting personalities, well for the most part as one of them is a little boring having quite a boring personalities.\\n\\n\r\nThe art of another note is quite stylish and looks nice though the quality drops as the show reaches its conclusion, which could also be said of the animation that also starts of great and then slowly degrades as the series continues.  Though in contrast the sound track is well done and never gets old, while openings for the show I found annoying grew on me to the point where I downloaded them, though the same could not be said for the Endings which while some where enjoyable the rest were forgettable.\\n\\n\r\nIn conclusion Beelzebub started out great with interesting story and characters, while having a nice style and great animation but slowly it bogged down by fillers, no character development and degrading animation. Save this one for a rainy day and if you've got nothing else to watch. Or if you ever up for a good laugh and aren't afraid of some negatives that could lower you sprites.",
            "date": "2015-12-11T18:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 205274,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=205274"
        },
        {
            "content": "Beelzebub.\r\nIt took a while for me to get into the Anime, the first 10 episodes bored me to hell. Althought, I gave it a shot and I started to like it More and More.\r\nBaby Beel and Oga are just too cool. :P\r\nAnyways.\r\nThe Story, I didn't find it really worked on, It seemed to be random on most of the part, It does not affect the Anime thought, I still enjoyed watching it.\r\nI gave the story a 7, But it would be more around 6.5.\r\nThe Art was good, No complain on that. Althought not the best I've seen. I gave it a 8.\r\nSound, Someof the OSTwas good some wasn't, pretty normal on the sound side, I gave it a 7.\\n\\n\r\nCharacters, We have to like them all, they're all unique and different, They're all fun. Characters gets a 9. I personally Like Oga's badassness, And Beel's for all the funny stuff he did, And they're getting so much along together, it's fun to watch.\\n\\n\r\nEnjoyment, I gave it a 8. The begining, I personnaly didn't like it. But it kept getting more and more better. So yeah, a 8.\\n\\n\\n\r\nMy Overall note is an 8. A great anime, If you like Comedies with some Shonen sides to it, with some more ''adult'' stuff in it. It made me laught countless of times, really fun anime, I would recommend it to anyone who wants a good laught and wants to watch a badass character beat the poop out of the other guys :).\\n\\n\r\nThank you.",
            "date": "2013-03-19T12:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 90175,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1932138.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kruh",
                "username": "Kruh"
            },
            "url": "https://myanimelist.net/reviews.php?id=90175"
        },
        {
            "content": "One of my favorite lines:\r\nKanzaki: I'll crack your friggin' skull open, baldy.\r\nHimekawa: I'm not bald. Look at my lovely do, buddy.\r\nKanzaki: Yeah, I am. And a duck's ass ain't somethin' you wear in a hospital, idiot.\r\nXDDDD\r\nStory: 7\r\nThe story is about a delinquent that now takes care of a baby. I'm not going into detail about the circumstances. If you want to know, read the synopsis. It does have a plot to a certain extent, but otherwise it's entirely random. It mainly follows the random day to day life of a delinquent that kicks a**.\r\nArt: 10\r\nThe scenes are hilarious and their faces just make you laugh.I mean I would laugh when you wake up floating in a pool of your kid's pee and the only face he makes is -_- .\\n\\n\r\nCharacter: 9\\n\r\nI love the contrast between each character and how they deal with each situation. All the delinquents having this murderous look but Oga's just like \"Which toy do you like better?\" and the incomprehensible \"dah\".\\n\\n\r\nEnjoyment:10\\n\r\nIf you watch it you would understand. Nothing left to say.",
            "date": "2012-06-25T08:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 64397,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1225973.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/manthatwashard",
                "username": "manthatwashard"
            },
            "url": "https://myanimelist.net/reviews.php?id=64397"
        },
        {
            "content": "I just finished this anime about 5 minutes ago and i'm completely disappointed with the ending. However, overall - i think it was okay. It started out pretty good, funny and unique and it kept my interest going so much so that i stuck with it until the end and then -- it completely flopped. \r\nThe characters for me started out good. Baby Beel is super funny and cute - and you can kinda see him mature over the course of the series. Oga was charming and interesting, but i feel that they could have done a better job at developing his powers more andevolving him into a better main character. The same could be said with Hilda and Aoi. Not much progression in their characters as well.\\n\\n\r\nThe story was good -- up until the last 5 or so episodes i would say. Looks like they sped up to end the anime and just let go of the story and didn't care how it ended. Sad. Very sad. \\n\\n\r\nEnjoyment overall to be fair is a 7 for me. Slowly declining on the last few episodes. I wouldn't say that it was a waste of time - its just that the ending completely ruins it for me.\\n\\n\r\nOh well - they say the manga is loads better so i better start reading.",
            "date": "2012-06-08T19:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 62965,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1336231.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/littlekth93",
                "username": "littlekth93"
            },
            "url": "https://myanimelist.net/reviews.php?id=62965"
        },
        {
            "content": "Beelzebub got everything!!\r\nDemon lords, maid servants, deliquents, love, fights, humor, school life, competitions, super natural, nude, social life and i could go on, its just an exciting plot!\r\nWhile watching this anime you will find your self laughing out loud by that brilliant humor, and you will quickly enjoy the oh so laughable parts.\r\nHowever do you know that feeling when you are watching an anime which is really great, but waiting for the exciting to happen? I was waiting for around 10 filler like episodes (still funny filler like episodes) for that special part and climax of this anime, when it finally came to that part,it was a huge disappointment. \\n\\n\r\nwhen that is said, i will recommend this anime to everyone who seek school life with humor and supernatural powers and just this so cute adorable must love baby!",
            "date": "2012-12-17T08:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 80390,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1880736.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Alossi",
                "username": "Alossi"
            },
            "url": "https://myanimelist.net/reviews.php?id=80390"
        },
        {
            "content": "I found this anime to be certainly different from the ones I typically watch.  Certainly reminded me of shows like One Piece, DBZ, and Hunter X Hunter in the fact that you have a MC that is OP and has some growth throughout the series.\r\nI did find this series to have a few laughs throughout.  Some of the jokes were repetitive after 60 episodes.  I also found that the story and progression started strong and steady then it started to plateau and eventually was filled with quite a few filler episodes that you can skip entirely without missing anything.\r\nThe last \"big\" battlewas pathetic and the final episode didn't even feel like a final one nor rewarding.  Though it did tie a bit back into the whole theme and intent of Oga.  Reflecting back on the last 10+ episodes of the series I feel like I skipped through 90% of each episode hunting for something interesting and not repetitive.\\n\\n\r\nOverall, still worth the watch just be prepared to hunt for some interesting parts come the later episodes.",
            "date": "2017-06-26T08:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 251097,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5363714.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MD1Champion",
                "username": "MD1Champion"
            },
            "url": "https://myanimelist.net/reviews.php?id=251097"
        },
        {
            "content": "This is a very good series with a start and a middle part but the ending will be quite disappointing. Over all the characters are well developed and each gets more than enough screen time and of course all of them have their own little quirks. But don't take the story seriously and you will definitely have a fun time with it. This one is more of the journey than the end in and of itself and its quite a great journey at that.",
            "date": "2014-02-17T09:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 132907,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484209.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/devilzcharm",
                "username": "devilzcharm"
            },
            "url": "https://myanimelist.net/reviews.php?id=132907"
        },
        {
            "content": "I have watched a few animes in my life but l've never come across one that has made me laugh so much. It kept me entertain the whole way and l was actually addicted to it that l couldn't stop watching it.The protagonist is an independent delinguent who is good at what he does, fighting.Oga and Furuichi are hilarious is basically has everything in here couldn't help but laugh this show is awesome the only thing i dislike about this is the face that baby beel is always naked sure maybe more interesting that way but i mean it's weird and that is onestly theonly thing i can say about this show is tht l totally love it. its hilariouis.",
            "date": "2012-12-19T03:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 80566,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1684791.jpg",
                "scores": {
                    "animation": 8,
                    "character": 0,
                    "enjoyment": 7,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/InoueMisaki",
                "username": "InoueMisaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=80566"
        },
        {
            "content": "I was really not sure if I should watch this series, but I ended up deciding to watch it and man, am I glad to have watched this. I gave this series a 10/10. Why? Because this had such a great plot and I enjoyed watching every episode. Besides who could deny the cuteness of the baby? The plot was something different from what I usually watch so this just peaked my interest a lot more. I do recommened this anime to beginners.",
            "date": "2012-06-04T09:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 62641,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1176647.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Z-I-CO",
                "username": "Z-I-CO"
            },
            "url": "https://myanimelist.net/reviews.php?id=62641"
        },
        {
            "content": "Story 10/8\r\nThe strongest deliquent gets a baby who is a next generation Demon Lord,who would rather play poker than destroy humanity.So that is it,just from the plot you can see a lot of hilarious moments\r\nArt and Sound 10/9\r\nIts great what else to say.\r\nCharacter 10/9\r\nThe main character is first traying to get rid of the baby,but as time pases they start to bond.\r\nEnjoyment 10/9\r\nIts funny,somethimes serious,a lot of action and badass moments\r\nOverall 10/8\r\nIts a good series and you have to watch i.",
            "date": "2013-04-08T06:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 93019,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2306015.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JovanJacov",
                "username": "JovanJacov"
            },
            "url": "https://myanimelist.net/reviews.php?id=93019"
        },
        {
            "content": "HAHAHAHAHAHAHAHAHAHAHAHAHAHAHA I have never seen a funnier anime EVER. The combat and story are all good to but man it is funny. I would watch Yu-Ghi-Oh if it were half this funny. I mean god damn. You watch the first episode and all ready you know that Oga will be hilarious. The thing about this anime is the main characters total lack of altruism. He is sadistic, cruel, and totally apathetic about anything that doesn't directly affect him and yet always seems to be saving something. Its just a great anime.",
            "date": "2013-06-17T14:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 101389,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2630079.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rainierhood",
                "username": "rainierhood"
            },
            "url": "https://myanimelist.net/reviews.php?id=101389"
        },
        {
            "content": "Beelzebub is hilarious. Don't come for the intricate story and complex characters, because you aren't going to find them. If you like straight up Shounen protags, and ridiculous power-ups, then stay and watch. Somewhere near the end the plot gets a little convoluted, but it's worth it just for the laughter. I love this anime. It was a memorable watch.",
            "date": "2014-04-26T13:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 141391,
            "reviewer": {
                "episodes_seen": 60,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3728407.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hinatasashybamf",
                "username": "hinatasashybamf"
            },
            "url": "https://myanimelist.net/reviews.php?id=141391"
        }
    ]
]