[
    [
        {
            "content": "This is a bishounen anime.  It's a showcase of gorgeous guys.  It has very pretty animation--lots of the outdoor scenes have a rich, glowing atmosphere, characters live in ornamented rooms, and everyone has detailed hair and eyes that glow like gems.  But the eye-candy factor is really the only positive thing about this anime.  It's the only reason I didn't give it a lower rating, which it honestly deserves.  \r\nI don't mean to offend, but probably the only viewers that would actually enjoy this show are angsty teen girls who need some affirmation.  Because the side characters spend mostof their time worrying about, discussing, or affirming our main character (who comes across as a sensitive weakling who doesn't actually do anything).\\n\\n\r\nI gave this series a low rating because there is practically no story.  It's almost as if the script began as 4-episode OVA, but then someone decided to stretch it into a full-season series.  For an incredible 24 episodes, practically nothing happens, and by the end of the series, we've barely learned anything about the characters.  Even about Yuki, who's supposedly our hero.\\n\\n\r\nThe setup seemed promising.  We meet our main character, Yuki.  He apparently has some supernatural skill, including healing.  More interesting is his ability to look into people's minds by touching them.\\n\\n\r\nYuki was raised at an orphanage.  A guy claiming to be his long-lost brother takes him out, tells Yuki that he is a re-incarnated fighter, and now must live with other re-incarnated fighters.  For centuries, the souls of these warriors have been fighting demons in each generation.  Each character has a unique fighting skill.  And most of these warriors are high school kids (and, of course, totally hot-looking).\\n\\n\r\nThe first few episodes were interesting, but after that, it seemed the series devolved into....Yuki-worship. \\n\\n\r\nYuki is the only one of the team who has no memories of his past.  For some inexplicable reason, all the other warriors adore him.  It's like their whole world revolves around him.  When Yuki is sad, everyone sits around in the living room, doing nothing.  When he is away from the house, they stand around in the dining room, doing nothing.  And the whole time, they randomly call out his name: \"Yuki,\" or ask, \"I wonder how Yuki is doing now?\"  \"I wonder how he's feeling?\"  \"I feel so sorry for Yuki.\"  It made me want to say,  \"SHUT UP AND DO SOMETHING PRODUCTIVE!!!  DON'T YOU GUYS HAVE BETTER THINGS TO DO?\"  For warriors, they spend a lot of time worrying about their comrade's...angst.  I almost forgot this story was supposed to be about a big battle of good vs. evil.\\n\\n\r\nIt's stuff like that which eats up most of the time in each show.  Again, and again, characters stand around, randomly saying each other's names.  It's like the creators were scraping around trying to stuff in every possible bit of filler they could.  I wonder if the actors felt ashamed, having to say such inane lines over and over again.\\n\\n\r\nThe things which I actually wanted to know more about was never discussed.  For instance, Yuki and Luka's backstory is barely discussed, even though it's supposedly important.  Yuki is said to be important to the team, but he barely uses any of his skills.  (After the first 2 or 3 episodes, he barely use his super abilities any more.)  There are a few meaningful conversations, and an occasional battle (which are decently done).\\n\\n\r\nBut for the most part, any chance to put in real or meaningful content was scrapped in favor of filler that communicated...nothing.  \\n\\n\r\nI think I've beat this series enough, so I won't say much more (except that a lot of the costumes and weapons were downright cheesy).  Unless you're a major bishounen fan, you probably won't enjoy this series much.  The last episode wasn't much of an ending.  Nothing was really resolved.  It was like, \"Was that it?  Did I miss something?\"\\n\\n\\n\r\n(P.S. Despite the tag, it's not truly a shounen-ai)",
            "date": "2010-09-19T18:09:00+00:00",
            "helpful_count": 285,
            "mal_id": 30638,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/323383.jpg",
                "scores": {
                    "animation": 9,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/IceAndCream",
                "username": "IceAndCream"
            },
            "url": "https://myanimelist.net/reviews.php?id=30638"
        },
        {
            "content": "The Zweilt Guardians are a bunch of hot males, plus one female, who have supernatural powers. Their purpose is to defeat these powerful, sexy demons called Duras who wish to destroy mankind. The innocent and oblivious main protagonist, Yuki, is approached by the Zweilts because he is their light and hope in this never-ending battle. Granted, this is just your basic good vs. evil story with pretty boys on the screen, but this by all means ISN'T a bad anime.\r\nSTORY & CHARACTERS\r\nUraboku gets off to a serious start, delving into heavy subject matter such as: orphans, troubled pasts, parental abuse, death threats, and world destruction.What an impressive way to begin things. It makes you wonder why everything is so dark and sinister around the most innocent person in the world, Yuki.\\n\\n\r\nYuki is a soft-spoken and mature boy who helps to take care of children in an orphanage that he had grown up in, and he often hangs out with his childhood friend. The peaceful days don’t last forever though as the Duras begin to stir activities nearby while his friend engages in more odd, secretive behavior. Furthermore, Yuki has these powers that suddenly awaken and cause problems. After a series of odd events, he meets a mysterious, sexy beast named Luka who claims to be his protector, followed by members of the Zweilt, and the head of the Giou Clan who tells Yuki that he is his half-brother and would like to take him away. So they end up taking him to the Twilight Mansion, and he comes to learn all about the Zweilt Guardians and their shared destiny.\\n\\n\r\nLuka is a powerful duras fighting on the protagonist’s side, and it’s obvious that he is very attracted to Yuki and vice versa. Most of the time, he is standing around quietly with a deadpan expression and wearing ridiculous outfits. While he doesn’t seem to be that great initially, he gradually gets more involved with the other characters. In addition to that, he has an ancient love story that he is hiding from Yuki, and it eventually becomes a concern and interest to him.\\n\\n\r\nThe Zweilt Guardians are strong, courageous fighters who have a detailed history behind their group. Most of them look to be Yuki’s age, and they each have a close partner that they fight with. In fact, they’re almost always seen in pairs and act like a big family. Their characterizations are very well done, for they have distinct personalities, fully developed backgrounds, and a strong fighting morale. Seriously, they rarely ever hesitate in battle and emphasize on working as a team. Their close relationships give off a certain charm as they grow into very likeable characters. However, their main drawback is that they can be too sentimental and melodramatic at times, and they constantly worry about Yuki every darn minute. Let the poor feminine boy breathe!\\n\\n\r\nThe Duras are the big weakness of the show. None of them can be taken that seriously except for one that appears in a very late episode. The main bad guy turns out to be a horrible cliché (I’m sure you can guess who it is), and his henchmen consist of a pair of evil twins, a giggly girl who collects hot guys, a sexy woman who wants Luka, etc. Some of them easily get obliterated, but the higher-grade demons do receive a bit more characterization.\\n\\n\r\nThere are a few side characters who also reside in the Twilight Mansion, such as the doctor, the maid, etc. They are annoying, clichéd, and their comedy doesn't even beat Luka's bizarre outfits. But don’t worry; they don’t actually get a lot of screen time. I nearly dropped this series when they were introduced too.\\n\\n\r\nSHOUNEN-AI\\n\\n\r\nThis anime is classified as shounen-ai, meaning boy-love. But if you’re coming into this expecting something along the lines of Gravitation or Junjou Romantica, you will be disappointed. You will never see any obvious indication of shounen-ai, like 'kissing' for example. Some of the male characters are rather close, but they could also just pass off as best friends. They're left up to your interpretation. Personally, I am not a big shounen-ai fan, so I appreciate how the gay tones are handled in this.\\n\\n\r\nSOUNDTRACK\\n\\n\r\nEpic, just epic! This is undoubtedly the best OST that I have heard all year. The music is done by Shōgo Kaida whom I have not quite heard of before. During major battles, the tunes are orchestral, enchanting, and dark, such as “Zweilt Imashime no Te” and “Me wa Yaiba Kami wa Yoru.” Another great track that has a soothing, ghostly choir in the background is called “Bloody†Cross”. During slow scenes, the music is usually airy, melodic, and sweet such as “Kaeranu Hibi Shiroki Ashita.” You can easily find these on YT for streaming.\\n\\n\r\nThere are two OP songs, “Till the World without Betrayals” and “Inishie” by Rayflower. They’re decent Jrock at best, but they’re not my favorite, and I probably won’t listen to them again after the series ends.\\n\\n\r\nOVERALL\\n\\n\r\nUraboku has a lot of things going for itself, such as a likeable, well-developed cast of visually-appealing characters, colorful action, dark undertones, and an epic OST. Plus, the shounen-ai tones are very subtle much to my pleasure. However, the plot really does lack originality, and the villains are clichéd and can’t be taken seriously.",
            "date": "2010-08-23T01:08:00+00:00",
            "helpful_count": 124,
            "mal_id": 29894,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/43271.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Mimi_Taylor",
                "username": "Mimi_Taylor"
            },
            "url": "https://myanimelist.net/reviews.php?id=29894"
        },
        {
            "content": "X/1999 meets Angel Sanctuary meets Night Head Genesis. \r\nThree episodes of this anime managed to remind me of three series I have previously watched. And I'm not talking about a vague reminder. I'm talking blatantly obvious similarities. Yes, UraBoku demonstrates a serious lack of originality from the start, and it sure is not afraid to admit it. Neither the story nor the characters offer something new and inspiring. The art is good, but it also offer very little innovation and originality, especially concerning the characters.\r\nThe reason why I've decided to write this review after watching only three episodes is because it would be silly tosay that there is still room for surprise or some turn of events that will inject a concentrated amount of originality into UraBoku. \\n\r\nHowever (yes, there is a however), I absolutely enjoyed every episode I have seen. Sure, I gave it a rational 5, because, so far, it deserves no more (if that), but rationality has nothing to do with the level of enjoyment. The male characters are absolutely beautiful, and I believe there's no fangirl out there incapable enjoying an anime with a life time supply of bishies in it. \\n\r\nAs I have mentioned before, originality is not something this anime thrives in. If you're looking for a never-before-seen story - stay away, if you're looking for a character that's complex and different - run like hell. However (yet another one), if you're looking for something familiar and safe, something that will help you turn off your busy brain; if you're looking for your standard shounen ai bishies, you better start watching UraBoku. \\n\r\nSo lower your expectations, turn off your brain and just enjoy it. I know I will.",
            "date": "2010-04-27T18:49:00+00:00",
            "helpful_count": 62,
            "mal_id": 25526,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302537.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 10,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/aindah",
                "username": "aindah"
            },
            "url": "https://myanimelist.net/reviews.php?id=25526"
        },
        {
            "content": "It seems Uragiri creators got their hands on some list of ingredients absolutely necessary to make an anime:\r\nbishounen – yes;\r\nshounen-ai – yes;\r\nteen fighters – yes;\r\nmagic – yes;\r\nreincarnation – yes;\r\nnot so Ordinary High School Student with superpowers – yes;\r\nsexy demon aka loyal servant – yes;\r\nkawaii animal with a forehead gem – yes;\r\nflowing cloaks, crosses, chains and other clanking metal things – in abundance;\r\nsophisticated spells and names in pseudo-German – yes.\r\nWait, seems there is something missing... Oh, yeah, plot. Well, its optional. As well as logic.\r\n90% of time the screen is occupied by main character Yuki (a boy who happens to be a girl in his previouslife), crying and moaning: “Kanata-san! Kanata-san!” – in reference to his best friend who turned out to be the main Bad Guy of this story. Sometimes other characters take the stage, crying and moaning: “Yuki! Yuki!” – in reference to his cruel destiny which makes Yuki to accept people's pain and suffering as his own. \\n\r\nThen, there are meaningless battles with bad guys, in which Yuki, though utterly useless, tries to help his comrades. The problem is his comrades have a mission to protect Yuki while he sees his mission in protecting others, so they all go in circles. And there is no proper ending, as it always happens with anime based on an ongoing manga. \\n\r\nIn theory, the story should be made more intriguing by the fact that Yuki-girl and the above mentioned sexy demon by the name of Luka were lovers in their previous life, and Luka still loves Yuki-boy dearly. Unfortunately, Yuki himself doesn't remember anything (though has some vague idea). But every time he tries to talk to Luka about this, they are interrupted by others, who seem to be unable to survive without Yuki even for a minute. So the shounen-ai is somehow incomplete.\\n\r\nThe only consolation is that bishounen are in abundance, music is fine and voice actors are good (though always spurting some embarrassing nonsense). All in all, not the worst way to kill time – but not the best either.\\n",
            "date": "2011-11-19T08:37:00+00:00",
            "helpful_count": 59,
            "mal_id": 47701,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/156209.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/happyoyster",
                "username": "happyoyster"
            },
            "url": "https://myanimelist.net/reviews.php?id=47701"
        },
        {
            "content": "'Betrayal Knows My Name' seemed like a promising anime with my interest lying in the central plot (or what I originally thought was the central plot prior to completing the anime) of Yuki and Luka.  In Yuki's past life he and Luka fell deeply, and madly, in love.  Luka finds Yuki again in his next life (reincarnated as a male) and stays by his side for the entire 24 episode run.\r\nUp front that seems like a promising romance story.  You have Luka who is madly in love with Yuki and will protect him as well as do anything for him.  Butthen you have Yuki, the main character, who has no memories of his previous life with Luka or the love that they shared.  Through more than obvious hints and comments from the side characters of the story, Yuki does in fact have a good idea that he and Luka were past lovers.  But through the 24 episodes all he seems to do is have a complete and utter lack of interest in it.  I can't say that he was 'avoiding' the subject because the subject never came up!\\n\\n\r\nIn fact, BKMN seems to focus ten thousand times more on the relationship between Yuki and his childhood best friend, Kanata.  There are more flashbacks, memories, and emotions tied between the two of them.  And Yuki is shown having much more feelings for Kanata than Luka, in my opinion, throughout the 24 episodes of the series.\\n\\n\r\nBy the end of the anime Yuki and Luka's relationship has not progressed one single step forward.  Yuki uses him as a means of protection and comfort and takes him for granted more or less.  For example in Episode 4 Yuki first tends to Tsukumo who is wounded by a slash on his shoulder, then he goes to speak with his school acquaintance who is emotionally scarred and depressed, then he goes to the orphan children to untie and comfort them only to be upset himself as they react very negatively to his presence and tell him not to touch them.  Yuki then has his own moment of feeling sorry for himself and cries to Luka about how pitififul he feels.  Luka who has been standing by his side watching him tend to everyone and everything with a deadpan expression on his face and a gaping hole in his abdomen.  Luka, out of everyone there, was the one most severly injured and the ONLY ONE who Yuki ignored.  In fact it isn't until the next day, in the afternoon, in Episode 5, that Yuki turns to Luka and asks him if he would like him to heal his wound as well.\\n\\n\r\nWhoops, guess Yuki forgot that he had been stabbed.  Everyone else was on his mind, apparently, and everyone else remains on his mind for the rest of the series.  Luka is probably dead last on Yuki's 'my most important people' list.\\n\\n\r\nI love Luka's dedication and loyalty as well as his deep, emotional, feelings of undying love... but those traits just turn negative and annoying when they are spent on a character who doesn't deserve them.  Luka became a mindless drone in many of the scenes where he literally has no reaction to anything.  He literally means that he will do anything for Yuki, let Yuki do anything, and never 'betray' him even if Yuki puts him last on his list and treats him like the dog he's acting to be.\\n\\n\r\nAside from his obvious mistreatment of Luka, there are an onslought of additional things I despise about Yuki.  For starters I cannot stand how utterly useless and worthless he is.  For the entirety of the 24 episodes he literally stands around and does NOTHING.  He mopes in his own self-misery and only has fleeting moments of happiness --- which only surface when the entire side character cast is surrounding him and gushing words of love, admiration, and need.  He is constantly putting his 'team' in danger as he recklessly rushes off to be a part of the battle.  And by being a 'part of the battle' to Yuki that literally means just standing in the background, wide eyed, and watching everyone get beaten up while he continues his internal monologue of how useless and powerless he is.\\n\\n\r\nThe cast of other characters in the story could have had potential and could have been likable if they all didn't dive into 'Yuki Worship'.  And when I say 'ALL' I mean 'ALL'.  Hell, even the main bad guy dives into 'Yuki Worship'.  The entire anime is glorifying the main character over and over shoving it down the viewers mouth just how wonderful, brilliant, loving, innocent, sparkly and selfless Yuki is.\\n\\n\r\nWell, I don't know where that Yuki is or where he went because the main character I've been watching for the past 24 episodes is nothing but useless, worthless, SELFISH, insensitive, and again SELFISH.  Yuki is the most selfish character in the entire anime when it comes to the good guy team.\\n\\n\r\nWith how pathetic, selfish, and useless he is it's no wonder he and his teammates have been reincarnated over and over for the past thousand years to fight a never ending battle that they keep losing.  News flash, guys, it's time to kick God's Light to the curb.  He's the one putting you all in danger in the first place because he's constantly inserting himself into danger intentionally and can't seem to comprehend that that, in turn, puts his entire team in danger because now they have to run out and try to save his sorry but AGAIN.",
            "date": "2014-05-02T16:34:00+00:00",
            "helpful_count": 26,
            "mal_id": 142125,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1516021.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/usagituskino321",
                "username": "usagituskino321"
            },
            "url": "https://myanimelist.net/reviews.php?id=142125"
        },
        {
            "content": "This is my very anime-waiting-list coz I read its manga first and hear its CD-dorama. And just like i expected ...it's awesome! Sugoooi! It also use some of legendary seiyuus *just like in the CD-dorama* YATTAA\r\nThe story's plot is a little bit too fast than the manga, but it's design with some wonderul scene, great effects, chibi-verision, and even there're some unexpected-scene I've never seen. So no problem at all\r\nIn the short words, some of the good guys reincarnated again same as before in previous life,except only for the princess of kami-no-hikari cos SHE's now HE! Without any memory of previous life. Her lover fromthe duras (akuma) still loves her,eventhough she's now born as a bishounen. That's why, some of people think URABOKU is yaoi. Will the boy regain his memory again and face the truth later? It's so exciting to wait the final result! \\n\\n\r\nEDIT: \\n\r\nThe plot finally reach the past-life of Takashiro & Reiga.So cool & very drastic!",
            "date": "2010-05-25T00:53:00+00:00",
            "helpful_count": 17,
            "mal_id": 26383,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/331217.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ryuichi_crosszer",
                "username": "ryuichi_crosszer"
            },
            "url": "https://myanimelist.net/reviews.php?id=26383"
        },
        {
            "content": "Let me tell you this first: If you're looking for a nice random anime, I would try this one. ^^ Maybe, it's looks a bit cliché or simple at the beginning, but I am certain you will like it. This is because this is one of the so called \"divers\" anime's who contain some points everyone likes.\r\nStory: I think it's a touching story. In the first episode (btw, I am not gonna spoil anything, but only some moments in the first episode) you meet the protaganist, named Sakurai Yuki. He's a real goodie, and is independent, because he doesn't have any relatives anymore. But whenone dark-looking guy approaches the boy, the whole story begins. This man, Luka (Zess = codename) is claiming to be his servant en wants to protect Yuki, because he's important to him. Yuki discovers he's from a Giouh Clan, which means he has some magic power inside him. Which one, I am not gonna tell you, you have to watch if you want to know. Because of this power, he has a destiny to fight some dangerous creatures, named Duras. And of course, Luka is helping him. (There are more Giouh Clan members introduced in the series) Their relationship is growing during the episodes. It's a pain I can't say anymore about this series, because I don't want to spoil, but you know the main line of the story. They fight as a pair together with other pairs, to destroy those Duras. (mankinds enemy) The reason I gave the story an 8, is because it's interesting and not as cliché as I thought before. It's like a big puzzle. Every episode is important for the next. No fillers!\\n\\n\r\nThe art is very beautiful. It looks similar to Vampire Knight's art, but I think it's different though. I gave this subject a 9. Fighting scenes, or emotional moments between characters are very well drawned. That's attractive.\\n\\n\r\nThe sound is good too. Hmm, not very divers, but the opening song is great. I like the ending song too, and some of the OST's. The sound is a good match with the events. That's the reason I didn't gave it a 7, but an 8 too.\\n\\n\r\nCharacters are interesting:) Maybe, that was my reason to watch more episodes. You're pulled in when you like Luka or some of the others characters. It's not the case that the main characters are the only important ones. They give small characters an important roll is as well. You get much information about them. My favorite fightpair is: Hotsuma and Shusei^^ Oh, another good point is that the characters are not similar to each other. So they won't get boring. Characters: 8 too.\\n\\n\r\nEnjoyment: 8. You don't have to be patient when you start with this anime, but you have to be neutral. Don't get an opinion too quick, because it's really good. The manga is popular as well, and now they made an anime and are still airing. When you think like this, you won't consider this anime as a waste of time. I like it very much and I am glad for trying this one. Just try one episode, or two, and you'll see why. I can't wait for the next episode to come out! \\n\\n\r\nOverall: An average score: 8. They could make the sound more interesting (OST's) and I think they have to tell a bit more about the small characters. (although they did, but I think it can be more) But it's overall a great anime to start with or to watch ones per week. It will never get boring and it's worth it! Just try!",
            "date": "2010-06-02T11:09:00+00:00",
            "helpful_count": 16,
            "mal_id": 26704,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229094.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Horinde",
                "username": "Horinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=26704"
        },
        {
            "content": "I really cannot think of enough good things to say about this anime! The story is wonderful (if a little cliched at times), the characters are believable and hilarious, and the art is absolutely breathtaking!\r\nThe best part of this anime, however, has got to be the main character, Yuki. Despite the fact that he has no defensive or offensive powers of his own, he refuses to sit on the sidelines and let others defend him.  And, unlike most heroes/heroines in his position, he is not completely helpless.  He is very skilled in the martial arts, and utilizes that skill to the fullest!\r\nOverall, thisanime is completely spectacular, and I reccomend it to anyone who wants fantasy, adventure, romance (with more than a little shounen ai), and humor, all rolled into one!",
            "date": "2010-06-27T17:51:00+00:00",
            "helpful_count": 16,
            "mal_id": 27676,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/347249.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RiverRayne",
                "username": "RiverRayne"
            },
            "url": "https://myanimelist.net/reviews.php?id=27676"
        },
        {
            "content": "I don't usually review an anime before it's over but this one's a bit different. Scores will change as the series go on, I guess.\r\nAs many have said, the storyline is really cliché, boy with a troubled past, mysterious power, joining a larger  group of people with powers in order to save the world. Currently, there doesn't seem to be much behind this story, I haven't read the manga yet but many can pretty much see where this is heading, so here's my somewhat detailed opinion on the first 9 episodes of Uraboku.\r\nStory - 7/10\r\nAs previously mentioned, there isn't much substance to the actualstory at the moment, it's your typical  mysterious boy with unique powers that is in danger from another evil group of people that also seem to want or are afraid of his powers. However, there's something quite alluring about this series based on the first 9  episodes, I found every episode enjoyable to watch despite its predictability, whether it be the characters are  the amazing art. The story itself isn't great but the pace is neither too slow nor too fast, it doesn't drag on or skip ahead too much, this and the amount of action I've seen so far is enough for me to want to keep watching.\\n\\n\r\nArt - 10/10\\n\r\nThe art is absolutely amazing, beautiful and detailed. Characters are outstandingly drawn to be unique  individuals, scenery is pretty even the evil guys are pretty. Special effects/spells are done amazingly also. The  art in Uraboku is one that bears a stark resemblance to Vampire Knight, so if you loved that then I guess you'll  love this even more.\\n\\n\r\nSound - 9/10\\n\r\nThe soundtrack is fitting, nothing special but it is used perfectly to create the right atmosphere and feeling  intended based on what is happening. The OP and ED are also well chosen. I'm glad to see some familiar voice  actors like Sakurai Takahiro, Fukuyama Jun and Ono Daisuke, however, something about Yuki's voice seems to annoy me greatly. Other than that, the voice actors fit their roles amazingly. \\n\\n\r\nCharacters - 8.5/10\\n\r\nAgain, the characters are rather cliché like the storyline. I find Luka pretty 1-dimensional at the moment, playing the servant role to Yuki because he sees the previous Yuki's soul in the current one, however, he's just cool enough for a girl like me not to care. The others are not entirely 1-dimensional characters however they're pretty much your average characters in a cliché story where they have troubled pasts which the anime goes on to address eventually. I quite like the relationships the Zwelit Guardians share with each other as pairs, it really brings out the shounen ai in this anime, it's not explicit nor is it too vague, for people who shounen ai isn't something they particularly enjoy, you could just interpret it as deep friendship between two guys. Overall, each character is unique in terms of power and personality, moreover, each one is one heck of a bishy.\\n\\n\r\nOverall - 8/10\\n\r\nI'm still expecting more from this anime so this score will undoubtedly change depending on whether future  episodes meet my expectations or not. Currently, I feel that the first 9 episodes have brought the anime to a positive start, I've enjoyed every episode so far and it's been a while since I've seen an anime that isn't unbearably slow to begin with. Although the story is cliché for many, if you're looking for an anime with a simple plot, eye candy characters, supernatural powers then you might want to consider adding Uraboku to your list.",
            "date": "2010-06-10T14:35:00+00:00",
            "helpful_count": 14,
            "mal_id": 27016,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/181400.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lillyness",
                "username": "Lillyness"
            },
            "url": "https://myanimelist.net/reviews.php?id=27016"
        },
        {
            "content": "This is what basically happens to Uraboku: nothing.\r\nI didn't get why Yuki was their (supposed) hero. In fact, everyone was trying to protect him. Okay, so he can heal wounds and all and he's the God's Light, but they should have shown that instead of the other way around. Sure, there were scenes wherein he protected his friends, but they were very, very few.\r\nDon't get me wrong here when I said nothing happened to the story, because really, there were none. One thing that also disappointed me was that they didn't elaborate much on Yuki and Luka's past. It would've been wonderful if Yuki somehowremembered that they were lovers from before. They didn't even get to end that fight with Reiga and the two other general-class Duras. All there is to the ending were a bunch of confessions (as what I'd like to call it) with their partners. Which was actually fine for me since that's the closest to shounen-ai that this story could offer.\\n\\n\r\nI wouldn't say that I didn't have fun watching this though, because this was an okay watch. I appreciated that they actually made small stories for some of the Zweilt Guardians' pasts, including Takahiro and Reiga's. It's just that they could have done better with its 24 episodes.",
            "date": "2011-02-19T21:48:00+00:00",
            "helpful_count": 10,
            "mal_id": 34590,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/402375.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/strldrp",
                "username": "strldrp"
            },
            "url": "https://myanimelist.net/reviews.php?id=34590"
        },
        {
            "content": "To be honest, the only thing good or at least satisfying about this anime are the hot guys. Oh, and the graphics, the characters look really really good, with lots of details and nevertheless, the outside sceneries look truly fantastic.\r\nStory: The story is completely boooring. It's true, in the beginning you are somehow captivated but after a few episodes it gets very uninteresting. This whole anime is about Yuki, the most ANNOYING chacarcter. Why? Well, I really hate it when the main hero always needs to be babysitted by the other characters. In every single episode you will hear at least 4 times someone askingYuki if he is alright and if we put together this scenes we could make 5 episodes of other characters worrying about Yuki. Another fact is that this anime should have had maximum 12-13 episodes because in most of the episodes the action is missing and you get really bored.\\n\\n\r\nSound: Sound is ok. I rated 9/10. I like both the openings and endings.\\n\\n\r\nCharacters: Like i said, Yuki is the most annoying character of the series. The ones that I liked were Reiga and Luka. Although in this anime they are talking about thier previous lives and how they are always reborn, we find NOTHING at all about Luka and that is really sad, because he seemed an interesting character. Nevertheless, we learn nothing about Yuki, who what the hell is the main character but still, his past remains blurred.\\n\\n\r\nEnjoyment: The fights are enjoyable enough, that's fair, but this is all I enjoyed.\\n\\n\r\nOverall: This anime is bad. Bad. I do not recommend it. It's truly a waste of time.\\n",
            "date": "2014-03-05T10:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 134799,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3512445.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 9,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Rawrzz03",
                "username": "Rawrzz03"
            },
            "url": "https://myanimelist.net/reviews.php?id=134799"
        },
        {
            "content": "Heh, I dropped this after 7th episode. It looks like to me as if heros from Vampire Knight (I don't like VK) are traped in prophery from X/1999 (I love X and all works from CLAMP) plus the genre change reminds to me Angel Sanctuary (I didn't find anything interesting on AS) and the paranormal ability are as from Night Head Genesis (I like NHG). So in the end this strange and not original mix isn't my cup of tea.",
            "date": "2010-06-09T09:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 26961,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/126228.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ladymanson",
                "username": "ladymanson"
            },
            "url": "https://myanimelist.net/reviews.php?id=26961"
        },
        {
            "content": "This anime is bishounen central. That may have been (part) of the reason I became motivated to watch it, because I stopped watching after the first four episodes, took a long break, then started again a day or two ago. I thought it would be really good, as I have a couple of friends who are a fan of it.\r\nWell. I guess I got a kick out of watching this.\r\nStory: 6\r\nIt's not the story itself that's bad. The premise is good, maybe a bit average; MC with special abilities he has no clue about. He suddenly gets involved in this mess with creatures called Duras,whereupon he meets a man named Luka who swears to protect him. The main character, Yuki, has actually been reborn several times (and this is no spoiler; they give it away within the first four episodes), with other members of his family he had no idea about until the attack, and with Luka.\\n\\n\r\nIt's the development that's bad.\\n\\n\r\nFor an anime with such an interesting premise, the development is bad, I could even say horrible. Why? I had about a billion burning questions, and pretty much none of them were answered? Sure, the characters were asking the questions themselves, but there was never. An answer.\\n\\n\r\nExamples:\\n\r\n1) Why was Yuki a girl in his past three lives but is now a boy?\\n\r\n2) Why does everyone seem to revolve around Yuki?\\n\r\n3) How did previous!Yuki get together with Luka?\\n\\n\r\nThere are also a huge number of cliche'ed lines in this anime. There were so many that I felt kind of embarrassed when I heard them.\\n\\n\r\nArt: 8\\n\\n\r\nThe art was pretty good. I felt like it was a bit inconsistent, but I didn't really care. Although the animation was smooth and beautiful, I have to say. The hair.  It's so distracting. There were a lot of those 'wind-blowing' scenes, and all I'd do was stare at the hair going 'Lol what so much hair'.\\n\\n\r\nSound: 8\\n\\n\r\nAnother better area in this anime. All the seiyuus did a great job. Although Yuki's voice annoyed me a hundred percent of the time. I'm not sure, but something about his voice just really annoyed me. I can't hate his seiyuu, because he's played quite a bit of characters I can respect. I guess the quality was a bit less in this anime.\\n\\n\r\nCharacter: 5\\n\\n\r\nAhahaha oh god. This is where most of the shit hits the fan. And it's mostly because of our main character, Yuki.\\n\\n\r\nYuki is literally such a useless character. They try to portray him as such a kind, caring character, I get it. He always seems to want to 'do something about the current situation', but he can't because he's absolutely powerless. He goes 'I'm going to save ______!' but he can't, because he doesn't have any power.\\n\\n\r\nOr rather he does, but he doesn't use it.\\n\\n\r\nSee, he uses his power in situations that come rarely. Like the last couple of episodes. He somehow magically has the ability to use his offensive power, although he's been useless for the past 20 episodes.\\n\\n\r\nAnother thing that had me going \"lol wuh' doing the anime was how Yuki-centric it is. Everyone loves Yuki. Yuki is amazing. Yuki is so kind. Our world revolves around Yuki. Yuki is our sun. Yuki is our GOD. When Yuki is sad, we'll just mope around at home. When Yuki is gone, they'll be like \"Where is he? I wonder if he's okay? Can you here his voice? Yuki. Yuki. Yuki, YUKI.\"\\n\\n\r\nI should make a tally, someday, of how many times I laughed when this happened versus how many times I wanted to break my iPod's screen.\\n\\n\r\nLuka is our apathetic guy who's so madly in love with Yuki that he'd never betray him. In fact, that's his motto. He says it in every episode, right before the OP \"Only I can know your pain, and only I can know your uncertainity. I will say it a million times, if you need it... I will never betray you!\" He's portrayed as a pretty epic badass. Although his clothes are kind of hilarious and over the top, his character is not that bad. It happens off screen, but apparently before Luka arrived at the Twilight Mansion, he was very anti-social (whoa, whoa, surprise there). But ever since Yuki came, he began to open the doors to his heart. This is the only development we see, in his character, at least.\\n\\n\r\nThe side characters had a LOT of potential. I liked them much more than the main characters (particularly Hotsuma and Shusei), but unfortunately, they were not given too much time to develop their characters, and they were Yuki-ists as well.\\n\\n\r\nThe villains were generic. I don't even think I need to describe them, I was pretty much facepalming every time I saw them.\\n\\n\r\nEnjoyment: 6.5\\n\\n\r\nHonestly, I got so annoyed with Yuki I barely had any room to actually enjoy the show. One of the only parts  of the anime I liked was the Hotsuma/Shusei arc, and that's probably it. The rest of the time I was laughing or trying not to break my iPod screen. Still, that being said, I don't hate it. I did enjoy some parts, if not all. It was fair, not the most enjoyable anime I have ever come across of.\\n\\n\r\nOverall: 6\\n\\n\r\nHonestly, I hoped it'd be better. Not bad, it was okay. I could list at least a hundred other animes better than this, but it was okay. That's all I can say about it; okay. The outfits were ridiculous at times, and the animation was really pretty. The OST was good. This isn't actually a shounen-ai, but it implies a lot. You can interpret the pairings in whatever way makes you comfortable. Some of the characters are very close, such as Hotsuma and Shusei. \\n",
            "date": "2013-01-02T03:56:00+00:00",
            "helpful_count": 7,
            "mal_id": 82366,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557987.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Laciie",
                "username": "Laciie"
            },
            "url": "https://myanimelist.net/reviews.php?id=82366"
        },
        {
            "content": "This is going to be a very blunt, very short review.\r\nUraBoku = Blue Seed. The only difference is that UraBoku has a hint of BL to its proceedings, and its animation is better. \r\nUraBoku isn't bad exactly - its just not even slightly original. The first five episodes or so are boring as hell, though. I've read most of the manga, so it should improve, but don't go into this expecting something fresh and amazing. This is purely disposable entertainment, the kind of thing you watch to kill time. Not awful, but certainly nothing to write home about. \r\nIt does have a good soundtrack, though.",
            "date": "2010-06-12T20:12:00+00:00",
            "helpful_count": 7,
            "mal_id": 27092,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/63610.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ADayWithoutMe",
                "username": "ADayWithoutMe"
            },
            "url": "https://myanimelist.net/reviews.php?id=27092"
        },
        {
            "content": "this anime has gone down in history as my least favorite anime i've watched. i've complained about it to many people, and here are the reasons why.\r\n(bear in mind its been quite a while since i've seen this so excuse any missed details)\r\nso, my very biggest issue with this was the plot (specifically the ending). there were so many ways this show could turn out and so many hints at the character's pasts. the majority of the show is based off of the character's backstories and the time loop they seem to be stuck in, but it's never explained. i watched 24 episodes and theydid not go into any depth about the backstories, or any past lives or adventures when they clearly are crucial to where the characters have gotten to. i was hoping for some sort of explanation at the end, but i was left with nothing learned and just confusion and anger instead. it was so irritating to spend so much time on a series only to be left with nothing in return. i have so many questions i was never given answers to, and that's the main reason i really do not like this anime at all.\\n\\n\r\na few other things as well:\\n\\n\r\n-i did genuinely like most of the characters. some were fairly predictable but they all managed to hold my interest-- i'd say the characters were a strong point in this anime.\\n\r\n-the music and art were fine to me, but didn't particularly stand out\\n\r\n-not very much was explained about the past (which is pretty important to the show)\\n\r\n-there's a fine line when leaving out critical information, and this anime quickly passed from 'i want to know more!' to 'okay so i know nothing at this point.'\\n\r\n-the best thing about this anime was hotsuma and shusei, and their relationship. their bond with each other was quite complex and i enjoyed seeing how they act around each other.\\n\r\n-the plot seems interesting, but i just felt it was a useless build up to a confusing ending and too many unanswered questions\\n\\n\r\nso, to summarize, i really wouldn't recommend this anime unless you want to be disappointed.",
            "date": "2017-02-25T21:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 241398,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6014624.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ohkeiji",
                "username": "ohkeiji"
            },
            "url": "https://myanimelist.net/reviews.php?id=241398"
        },
        {
            "content": "Ok, I just finished watching this anime, first let me go over what I liked about it.\r\nThe guys are all hot! Oh yeah, if you want some great eye candy then this one is a good one to try. Its also a Shounen-ai which makes it even better and an action one at that. So if you love bishie boy action type of animes then it is worth checking out.\r\nHowever, although an anime has these elements does not mean I can give it a high score. Heck I have watched plenty of bishie type animes that I couldn't get past the fifth episode of andhad no choice but to drop *looking at you Mien Liebe* so I have no other choice but to go over everything that ticked me off about this anime. \\n\\n\r\nThe story is about a boy named Yuki who was reincarnated from a woman, he gets saved by a man named Zess from a Duras (evil creature thingy) and he gets caught up in a war between the Giou Clan and the Duras. At least this is the best way i can explain the story because when it first comes on you will honestly not understand anything about anything concerning this story. You feel as if you were dropped in the very center of the story and you have to struggle to catch up. When i really think about it, the show doesn't do a good job of explaining what the heck these Duras even are or where they came from or why one character can control them even though he is only half Duras. Anyway, Yuki and Zess become close and we discover that they were once lovers when yuki was a woman. Zess is still very devoted to Yuki but sadly it doesn't seem to progress from there. The relationship between them is never fully touched upon. Yuki and Zess stare at one another, profess that they long to see each other when the other isn't around, they touch each other faces but that is all you get out of them. No kisses, no passion, not even an acknowledgment from yuki that he even remembers the relationship even after he remembers everything else.\\n\\n\r\nThe story has its moments of drawing you in, such as the potential subplots with the other Zweilts(sp). You have two guys who seem like they could be lovers and one is struggling with his feelings of guilt because he hurt his partner.\\n\\n\r\nThe Zweilt(sp) partners who both seek revenge on the Duras general who killed their trainer\\n\\n\r\nThe story of the Giou Clan leader and his butler and past with Reiga, the villian of the show.\\n\\n\r\nHowever, these are all swing and misses as the writers don't bother to truly flesh out any of these characters and they sort of make it hard to root for them. Instead, the characters seems to have no life of their own besides worrying about Yuki, caring for Yuki, protecting Yuki, loving Yuki, and needing Yuki. They call Him their master yet you NEVER find out why. Yuki is by far the most useless character on the show. He does nothing but stand around while everyone fights and risks their lives for him, they all gather around him to protect and save him yet you never find out why the bad guy even needs him. So far all you get is that he \"changes people's hearts\" The other characters have so much potential but when they are around yuki it is all about Yuki and when they are not around Yuki they talk about nothing but Yuki.\\n\\n\r\nIt really ticked me off when the first pairing I mentioned were talking about their relationship, it was touching, sad, tender, and almost romantic until one says \"You love Yuki\" (or something similar) then the other replies \"You love him too\" WTF?!? Yuki was barely around them and had almost no contact with them but suddenly they both love him?\\n\\n\r\nI swear this anime should have been called \"Yuki, the c**k teaser\" Everyone on the show falls in love with him men and women but all he does is stand around like a woman gasping and telling everyone to stop fighting. Then the bad guy finally captures him but instead of killing him he just wants him to watch his friends get killed. Mind you, i can understand that the bad guy was his friend and there was some conflict with killing him, i can understand this, but it was never explained why Yuki was so important he needed to be captured and taken. And it was done so stupidly. Yuki just stands there juicing up his powers and suddenly his in classic damsel bridal style pose near the bad guy who is taking him away. Of course, this means that the other Zweilts get to talk about Yuki for the one billionth time and go save him for the one billionth time. \\n\\n\r\nAnyway, as much as I complain I have seen worst and it did keep me hanging around for all 24 episodes and I would probably watch a season 2 if one comes out. It did have a decent main plot once you get over the first two or three episodes, I liked the IDEA behind Zess and Yuki, loving someone no matter if they are a man or a woman. But I wish the writers would have at least let the character TALK about that.",
            "date": "2012-05-02T15:34:00+00:00",
            "helpful_count": 6,
            "mal_id": 60215,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/846605.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 10,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Hazegurl",
                "username": "Hazegurl"
            },
            "url": "https://myanimelist.net/reviews.php?id=60215"
        },
        {
            "content": "裏切りは僕の名前を知っている - Uragiri wa Boku no Namae o Shitteriru is a pleasant and atypical shoujo anime that not only offers the expected larger cast of handsome male characters, but is also very entertaining due to its action, magic and fantasy elements.\r\nStory: Battle, reincarnation, bond between souls, everything a little wrapped up in black - clichéd but nice (7/10)\r\nThe story tells of the battle that has been raging for more than a millennium between the darkness, the demonic beings of the shadows, the Duras and humans with special abilities, the so-called Zweilt-Guardians. With the help of reincarnation, the battle could be continued into the 21st century,the fighting arena is now the capital of Japan, Tokyo. Regardless of the first impression, which is aroused by a larger male cast and the strong focus on feelings, emotions and the willingness to make sacrifices, it is nevertheless not a classic Shōnen-ai story. It is never near to yaoi, so don`t worry.\\n\\n\r\nCharacter: Interesting questions about reincarnation and how it affects love as well as a good, plausible and comprehensible character interaction leads away from stereotypical patterns (8/10)\\n\r\nAt first glance, the characters seem to be stereotypical, but each of them is unique, and by describing their relationships with each other, the character profiles gain additional psychological depth, which in turn makes their development worth seeing.\\n\\n\r\n*The description of the characters may include spoilers, so better watch the anime first.*\\n\\n\r\nSakurai Yuki (Giou):\\n\r\nYuki suffers from the ability to read the vile feelings of those he touches and share their nightmarish memories. His strong desire to help almost killed him. A mysterious stranger suddenly stepped out of the darkness and saved him. A man with silver eyes, with whom Yuki feels strangely familiar. To interpret this as a sign of a homoerotic undertone in the relationship between the two main characters would not take into account that Yuki had previously been reborn as a woman. The more Yuki tries to find the answers to the sudden circumstances in which he finds himself, the more he must realize that he is destined to be a part of the fight.\\n\r\nZess (Crosszeria Luca):\\n\r\nActually the most interesting character, strong-willed and convincing, yet subject to his emotional world. As a senior Duras (Opast) basically an opponent, but due to a deep bond a companion of the Zweilts. It is amusing that Zess, as probably the most masculine representative of the cast, correctly explains the character of his affection for Yuki, as well as the anime in general by answering Giou Takashiro's question: \".... it is the same soul and his feelings have not changed\". In short, he doesn't care in which body the love of his life was reborn. Is there a greater compliment for true love? His character and conflict are well portrayed.\\n\r\nZweilt-Guardians (Giou Clan):\\n\r\nGiou Takashiro:\\n\r\nA powerful necromancer, calm and wise, leader of the Giou Clan. On the other hand, he is cunning, which is reflected in his ability to manipulate. His mildness and friendliness make him sympathetic and also awaken a mysterious aura.\\n\r\nMurasame Touko:\\n\r\nShe is a strong guardian, characterized by sincerity, justice and exuberant cheerfulness. Her loyalty to the Giou Clan is based on a strong sense of familiarity, especially with her brother. In battle she uses a mighty broadsword.\\n\r\nMurasame Tsukumo:\\n\r\nThe guards always fight in pairs, here Tsukumo with his friendly and considerate nature is the perfect companion for Touko. Both complement each other in character as well as in combat. Tsukumo receives a large-caliber pistol for combat through his summoning ring.\\n\r\nRenjou Hotsuma:\\n\r\nHis dismissive and condescending way is just a facade but suitable for the rough and impulsive hothead who rules over the flames. The overcoming of his inner conflict, caused by rejection and loneliness which his gift brings him, is presented  well and credibly. To fight, he conjures the masterstroke, a sword that`s more curvy than a Khanjar - pretty cool design.\\n\r\nUsui Shusei:\\n\r\nHe is Hotsuma's guardian-partner, since his childhood a good friend and a perfect counterpart. His friendship is crucial for the development of Hotsuma.\\n\r\nHourai Kuroto and Furuori Senshirou appear later than in Manga. They also have to deal with internal conflicts. What is interesting about Senshirou is that he was not reborn but became a Zweilt due to hard training. With him, there are two in the Giou clan who have not been reborn.\\n\\n\r\nDuras, the clan around Reiga:\\n\r\nReiga:\\n\r\nHis person is mentioned again and again, but remains hidden for the time being. He is a strong opponent and commander of the beings of darkness. The Duras are demons that lure people into darkness. Their lowest representatives are called \"Nidatorehi\". The next higher demon class, the midfield so to speak in the ranks of the Duras, are the \"Midvillain\". The highest class is called \"Opast\", to which Zess belongs.\\n\r\nBayuu:\\n\r\nHe belongs to the Midvillains and is characterized by arrogance, yet a strong opponent and a serious threat to a single guardian.\\n\r\nAshley:\\n\r\nShe is the first opast to appear in action. The little lady in the sweet Moe appearance is smart and also quite well characterized in terms of malice.\\n\r\nJekyll & Hyde:\\n\r\nThe Opast twins appear almost simultaneously with Ashley, for the first time. They fight as a couple, similar to the Zweilt. Unfortunately they seemed a little colourless next to Ashely.\\n\r\nElegy:\\n\r\nA real scoundrel, but her performance didn't convince me.\\n\r\nCadenza:\\n\r\nA top-class villain! Powerful, not foolish, brutal and is not afraid of anything!\\n\\n\r\n*Spoiler alert end*\\n\\n\r\nVisuals: nice, good blending (2D/CG), beautiful background art, skillful adaptation (8/10)\\n\r\nThe visualization of the original by Odagiri Hotarus by the studio J.C.Staff is a success, because the delicate drawing style and the graceful stamping have been preserved. The animation is fluid and the level of detail is good, e.g. the police headquarters in Tokyo (Ep. 5 / 11:47 min.) is true to the original. Another positive aspect is that the Chibi content for a Shounen is low. On the other hand, I liked the fact that the facial expressions were very well emphasized and accentuated, which is mainly due to the focus on the eye area itself. Special effects / spells are nice and detailed. The fights looked really awesome animated, for the year 2010. Surprisingly, although some of the computer generated components, like the demons are not my cup of tea, the overall picture of the anime was convincing. This is due to the fact that the background art is beautiful and that the blending of CG effects with 2D animations were done very skillfully, so that the overall picture and the atmosphere are very appealing.\\n\\n\r\nSounds: BGM top, pretty cool OP, VA very good, dialogues sometimes a bit chlichéd (8/10)\\n\r\nBGM is very well chosen, emphasizes beautifully, but is not omnipresent or intrusive.\\n\r\nThe OPs and EDs are all from the Japanese band Rayflower. The first OP is \"Uragiri no Nai Sekai Made\". A great start, calmly with a prologue - btw pretty cool monologue - light choral / orchestra background music, which then turns into a rock-oriented arrangement with a really suitable animation (ep.1-14).\\n\r\nThe ED \"Aoi Ito\" by Ep.1-14 is musically quite soft and fits, thanks to the successful imagery well to the end of the anime.\\n\r\nThe second OP \"Inishie\" rocks too. The same monologue, but a new, great animation now adorns the beginning. The rock music is again a pretty good OP.\\n\r\nOn the other hand, the last ED \"Kizuna\", I do not like so much. The animation is optically good, but I didn't find the melody suitable for the end of the episodes.\\n\r\nThe voice actors complete the good overall picture of the sounds. Maybe because of the well-known speakers like Ono Daisuke and Hino Satoshi, but I especially liked the voices of Luca Crosszeria (Sakurai Takahiro) and Touko Murasame (Inoue Marina). Unfortunately, the dialogues are at times somewhat clichéd, which is especially noticeable at the beginning of the second half.\\n\\n\r\nThe exciting shoujo anime leaves some questions unanswered, but since the manga is finished, I do not consider that to be negative. The good visualization and a corresponding musical background merge into a very nice overall picture and create a good entertainment value. Unfortunately, the anime is often overlooked or neglected because of its focus on the female audience.\\n\\n\r\nThanks for reading and have fun watching.",
            "date": "2018-08-31T14:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 287854,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5632852.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Sesshomaru",
                "username": "Sesshomaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=287854"
        },
        {
            "content": "Betrayal Knows My Name focuses on a teenage orphan named Yuki who gets caught up in a conflict between the human Zweilt Guardians and the demonic beings known as Duras. The Duras seek to kill Yuki due to his powerful ability called God's Light being a potential threat to their efforts to take over humanity. Outside of the Zweilt Guardians, Yuki also has protection via Zess, a Duras who is a traitor of his kind due to his mysterious contract to protect Yuki from enemy threats.\r\nBefore I get into reviewing this series, I should address something that is fairly infamous with this anime and thatcomes in the form of the implication of it being a boys-love anime thanks to the close relationships that involve Yuki and Zess and a couple pairs of the Zweilt Guardians being young men. Having watched through the series in its entirety, I did not really see much that would elude to the possibility of the male characters showing any interest in one another, beyond possibly some romantic implications played up about a major revelation concerning Yuki's character and how it affects his bond with Zess. Even with these developments, this element to the series does not do anything to get in the way of the title's storytelling and I don't really get why there have been those making a fuss over it.\\n\\n\r\nSetting aside the matter, Betrayal Knows My Name offers a solid amount of buildup in developing its story and exploring a number of its major characters. The series takes its time with exploring more of its supernatural elements with the mysteries surrounding Yuki's powers, the Zweilt Guardians, and the Duras' seeking to kill him off. Also going along by its title name, betrayal is a major element with a few of the major characters within the series that include Zess and some surprising characters who are acquainted with Yuki. In addition, the series devotes episodes to feature focus on the backstories and origins of a number of the characters that include Yuki, a number of the Zweilt Guardians, and even what led up to their official formation.\\n\\n\r\nSetting aside praises, the series also comes with its fair share of shortcomings. There are a fair number of things unclear about elements to Yuki and Zess' relationship, including what led Zess to betray the Duras and what connections he has to Yuki as a result of it. I also felt that the drama coming from Zweilt Guardians efforts to protect Yuki due to concerns for his well-being came off as overdone considering his abilities and how huge a threat he can to the Duras' while willingly wielding it. The final episodes of the series also rush through its final conflict with a group of Duras that our heroes go up against, which ends inconclusively due to the show's manga source material still being ongoing.\\n\\n\r\nPresentation wise, the show's a bit of a mixed bag. The visuals suffer from awkward character designs where the characters seemingly have the same facial designs and the animation is a bit stiff in regards to movements and milking animation shortcuts. On the plus side, the show's soundtrack does a good job at effectively conveying the proper mood during dramatic moments and battle scenes.\\n\\n\r\nOverall, Betrayal Knows My Name is a solid supernatural action-drama that offers a solid amount of plot and character developments to keep you hooked on the show for its full run. While having its issues with plotting and visual presentation, it's still worth at least a rental to get a sense of the supernatural world it offers up.",
            "date": "2017-05-20T15:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 248157,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=248157"
        },
        {
            "content": "the anime was recommended by a friend, and since i was doing nothing at the time, i checked it out. and like the others say, it is not particularly new, but it certainly has soimething on its own that makes the story stand out for itself.\r\nartwork reminds me much of vampire knight, (and tsukumo is the very image of zero kiryuu) tyhe seiyuus did a great job (i mean, did they ever fail?). the coloring is a bit hard to pick up, but nicely done nonetheless.\r\nsuggestive words now and then are certain to make the fangirls happy once they watch this anime, but they certainlywon't forget the essence of the plot.\\n\\n\r\nyeah, i think overall, this anime is a good way to pass time, unless you're looking for some gory action and adventure without real plot, UraBoku is sure to capture your taste!",
            "date": "2010-06-04T00:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 26776,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/285729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/reishicolleen",
                "username": "reishicolleen"
            },
            "url": "https://myanimelist.net/reviews.php?id=26776"
        },
        {
            "content": "The next time an Anime character says: 'I...I...I..' I'm gonna punch someone, I swear to God. Damn even if I wanted to I wouldn't be able to count the times a person says that and doesn't finish their sentence. But alright, the review.\r\nStory:\r\nThe story isn't actually bad. The story has quite some depth, including the background stories of the characters (in fact this is probably the most important thing in the story). Especially because it features shounen ai, it is a more unique story than a standard romance story. Because let's face it; this is a romance anime. Sure there is some fighting, but notvery much. The few (compared to other anime with similar stories) fighting scenes are also generally short.\\n\\n\r\nThe problem with the story however, are the characters. Most are cool and good, except the main character. Will talk about that later.\\n\\n\r\nArt:\\n\\n\r\nI think it is comparable to anime such as Zombie Loan. I'm glad they chose for normal eyes and stuff like that. Unlike other things, the art and animation didn't throw me off. It was actually quite good.\\n\\n\r\nSound:\\n\\n\r\nI just said the Art didn't throw me off. The sound did. Not in overall, but the most important sound did. And that is the main character's voice. Honestly damn how annoying can a voice be, seriously. I wouldn't really care if a side character had this voice, but the main guy just talks so much with that annoying voice. It actually makes the conversations involving the main guy and someone else annoying. I honestly thought of stop watching this anime the first episodes just because of his voice. \\n\\n\r\nCharacter:\\n\\n\r\nThis is probably the thing that the anime does best, and does worst.\\n\r\nLet me start with the not-so-imporant side characters. These are actually done quite well. They all have a very specific personality, are not boring and for boy-lovers here: The guys in this anime are hot. I absoluty have no problems with these characters.\\n\\n\r\nBut now to the main character: this guy is so fucking annoying. No, it's not because that is how he's supposed to be. It's because he's crying all the fucking time, always complaining, always trying to be the good guy and always talks with this annoying voice. I have never seen such a boring main character. I couldn't' care less about him. Even though he is the core of the story, this anime would have been so much better without him. The anime should have focused on the other characters. \\n\\n\r\nEnjoyment:\\n\\n\r\nThis is probably the first anime I have watched completely while really struggling to finish it. The only thing that kept me watching was the story and the other characters, but it was a hard time and I wouldn't recommend this anime to anyone. There are plenty of better anime out there with this setting and a good story.",
            "date": "2012-05-20T11:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 61591,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/WowAnimeTaiga",
                "username": "WowAnimeTaiga"
            },
            "url": "https://myanimelist.net/reviews.php?id=61591"
        }
    ],
    [
        {
            "content": "This is a bishounen anime.  It's a showcase of gorgeous guys.  It has very pretty animation--lots of the outdoor scenes have a rich, glowing atmosphere, characters live in ornamented rooms, and everyone has detailed hair and eyes that glow like gems.  But the eye-candy factor is really the only positive thing about this anime.  It's the only reason I didn't give it a lower rating, which it honestly deserves.  \r\nI don't mean to offend, but probably the only viewers that would actually enjoy this show are angsty teen girls who need some affirmation.  Because the side characters spend mostof their time worrying about, discussing, or affirming our main character (who comes across as a sensitive weakling who doesn't actually do anything).\\n\\n\r\nI gave this series a low rating because there is practically no story.  It's almost as if the script began as 4-episode OVA, but then someone decided to stretch it into a full-season series.  For an incredible 24 episodes, practically nothing happens, and by the end of the series, we've barely learned anything about the characters.  Even about Yuki, who's supposedly our hero.\\n\\n\r\nThe setup seemed promising.  We meet our main character, Yuki.  He apparently has some supernatural skill, including healing.  More interesting is his ability to look into people's minds by touching them.\\n\\n\r\nYuki was raised at an orphanage.  A guy claiming to be his long-lost brother takes him out, tells Yuki that he is a re-incarnated fighter, and now must live with other re-incarnated fighters.  For centuries, the souls of these warriors have been fighting demons in each generation.  Each character has a unique fighting skill.  And most of these warriors are high school kids (and, of course, totally hot-looking).\\n\\n\r\nThe first few episodes were interesting, but after that, it seemed the series devolved into....Yuki-worship. \\n\\n\r\nYuki is the only one of the team who has no memories of his past.  For some inexplicable reason, all the other warriors adore him.  It's like their whole world revolves around him.  When Yuki is sad, everyone sits around in the living room, doing nothing.  When he is away from the house, they stand around in the dining room, doing nothing.  And the whole time, they randomly call out his name: \"Yuki,\" or ask, \"I wonder how Yuki is doing now?\"  \"I wonder how he's feeling?\"  \"I feel so sorry for Yuki.\"  It made me want to say,  \"SHUT UP AND DO SOMETHING PRODUCTIVE!!!  DON'T YOU GUYS HAVE BETTER THINGS TO DO?\"  For warriors, they spend a lot of time worrying about their comrade's...angst.  I almost forgot this story was supposed to be about a big battle of good vs. evil.\\n\\n\r\nIt's stuff like that which eats up most of the time in each show.  Again, and again, characters stand around, randomly saying each other's names.  It's like the creators were scraping around trying to stuff in every possible bit of filler they could.  I wonder if the actors felt ashamed, having to say such inane lines over and over again.\\n\\n\r\nThe things which I actually wanted to know more about was never discussed.  For instance, Yuki and Luka's backstory is barely discussed, even though it's supposedly important.  Yuki is said to be important to the team, but he barely uses any of his skills.  (After the first 2 or 3 episodes, he barely use his super abilities any more.)  There are a few meaningful conversations, and an occasional battle (which are decently done).\\n\\n\r\nBut for the most part, any chance to put in real or meaningful content was scrapped in favor of filler that communicated...nothing.  \\n\\n\r\nI think I've beat this series enough, so I won't say much more (except that a lot of the costumes and weapons were downright cheesy).  Unless you're a major bishounen fan, you probably won't enjoy this series much.  The last episode wasn't much of an ending.  Nothing was really resolved.  It was like, \"Was that it?  Did I miss something?\"\\n\\n\\n\r\n(P.S. Despite the tag, it's not truly a shounen-ai)",
            "date": "2010-09-19T18:09:00+00:00",
            "helpful_count": 285,
            "mal_id": 30638,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/323383.jpg",
                "scores": {
                    "animation": 9,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/IceAndCream",
                "username": "IceAndCream"
            },
            "url": "https://myanimelist.net/reviews.php?id=30638"
        },
        {
            "content": "The Zweilt Guardians are a bunch of hot males, plus one female, who have supernatural powers. Their purpose is to defeat these powerful, sexy demons called Duras who wish to destroy mankind. The innocent and oblivious main protagonist, Yuki, is approached by the Zweilts because he is their light and hope in this never-ending battle. Granted, this is just your basic good vs. evil story with pretty boys on the screen, but this by all means ISN'T a bad anime.\r\nSTORY & CHARACTERS\r\nUraboku gets off to a serious start, delving into heavy subject matter such as: orphans, troubled pasts, parental abuse, death threats, and world destruction.What an impressive way to begin things. It makes you wonder why everything is so dark and sinister around the most innocent person in the world, Yuki.\\n\\n\r\nYuki is a soft-spoken and mature boy who helps to take care of children in an orphanage that he had grown up in, and he often hangs out with his childhood friend. The peaceful days don’t last forever though as the Duras begin to stir activities nearby while his friend engages in more odd, secretive behavior. Furthermore, Yuki has these powers that suddenly awaken and cause problems. After a series of odd events, he meets a mysterious, sexy beast named Luka who claims to be his protector, followed by members of the Zweilt, and the head of the Giou Clan who tells Yuki that he is his half-brother and would like to take him away. So they end up taking him to the Twilight Mansion, and he comes to learn all about the Zweilt Guardians and their shared destiny.\\n\\n\r\nLuka is a powerful duras fighting on the protagonist’s side, and it’s obvious that he is very attracted to Yuki and vice versa. Most of the time, he is standing around quietly with a deadpan expression and wearing ridiculous outfits. While he doesn’t seem to be that great initially, he gradually gets more involved with the other characters. In addition to that, he has an ancient love story that he is hiding from Yuki, and it eventually becomes a concern and interest to him.\\n\\n\r\nThe Zweilt Guardians are strong, courageous fighters who have a detailed history behind their group. Most of them look to be Yuki’s age, and they each have a close partner that they fight with. In fact, they’re almost always seen in pairs and act like a big family. Their characterizations are very well done, for they have distinct personalities, fully developed backgrounds, and a strong fighting morale. Seriously, they rarely ever hesitate in battle and emphasize on working as a team. Their close relationships give off a certain charm as they grow into very likeable characters. However, their main drawback is that they can be too sentimental and melodramatic at times, and they constantly worry about Yuki every darn minute. Let the poor feminine boy breathe!\\n\\n\r\nThe Duras are the big weakness of the show. None of them can be taken that seriously except for one that appears in a very late episode. The main bad guy turns out to be a horrible cliché (I’m sure you can guess who it is), and his henchmen consist of a pair of evil twins, a giggly girl who collects hot guys, a sexy woman who wants Luka, etc. Some of them easily get obliterated, but the higher-grade demons do receive a bit more characterization.\\n\\n\r\nThere are a few side characters who also reside in the Twilight Mansion, such as the doctor, the maid, etc. They are annoying, clichéd, and their comedy doesn't even beat Luka's bizarre outfits. But don’t worry; they don’t actually get a lot of screen time. I nearly dropped this series when they were introduced too.\\n\\n\r\nSHOUNEN-AI\\n\\n\r\nThis anime is classified as shounen-ai, meaning boy-love. But if you’re coming into this expecting something along the lines of Gravitation or Junjou Romantica, you will be disappointed. You will never see any obvious indication of shounen-ai, like 'kissing' for example. Some of the male characters are rather close, but they could also just pass off as best friends. They're left up to your interpretation. Personally, I am not a big shounen-ai fan, so I appreciate how the gay tones are handled in this.\\n\\n\r\nSOUNDTRACK\\n\\n\r\nEpic, just epic! This is undoubtedly the best OST that I have heard all year. The music is done by Shōgo Kaida whom I have not quite heard of before. During major battles, the tunes are orchestral, enchanting, and dark, such as “Zweilt Imashime no Te” and “Me wa Yaiba Kami wa Yoru.” Another great track that has a soothing, ghostly choir in the background is called “Bloody†Cross”. During slow scenes, the music is usually airy, melodic, and sweet such as “Kaeranu Hibi Shiroki Ashita.” You can easily find these on YT for streaming.\\n\\n\r\nThere are two OP songs, “Till the World without Betrayals” and “Inishie” by Rayflower. They’re decent Jrock at best, but they’re not my favorite, and I probably won’t listen to them again after the series ends.\\n\\n\r\nOVERALL\\n\\n\r\nUraboku has a lot of things going for itself, such as a likeable, well-developed cast of visually-appealing characters, colorful action, dark undertones, and an epic OST. Plus, the shounen-ai tones are very subtle much to my pleasure. However, the plot really does lack originality, and the villains are clichéd and can’t be taken seriously.",
            "date": "2010-08-23T01:08:00+00:00",
            "helpful_count": 124,
            "mal_id": 29894,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/43271.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Mimi_Taylor",
                "username": "Mimi_Taylor"
            },
            "url": "https://myanimelist.net/reviews.php?id=29894"
        },
        {
            "content": "X/1999 meets Angel Sanctuary meets Night Head Genesis. \r\nThree episodes of this anime managed to remind me of three series I have previously watched. And I'm not talking about a vague reminder. I'm talking blatantly obvious similarities. Yes, UraBoku demonstrates a serious lack of originality from the start, and it sure is not afraid to admit it. Neither the story nor the characters offer something new and inspiring. The art is good, but it also offer very little innovation and originality, especially concerning the characters.\r\nThe reason why I've decided to write this review after watching only three episodes is because it would be silly tosay that there is still room for surprise or some turn of events that will inject a concentrated amount of originality into UraBoku. \\n\r\nHowever (yes, there is a however), I absolutely enjoyed every episode I have seen. Sure, I gave it a rational 5, because, so far, it deserves no more (if that), but rationality has nothing to do with the level of enjoyment. The male characters are absolutely beautiful, and I believe there's no fangirl out there incapable enjoying an anime with a life time supply of bishies in it. \\n\r\nAs I have mentioned before, originality is not something this anime thrives in. If you're looking for a never-before-seen story - stay away, if you're looking for a character that's complex and different - run like hell. However (yet another one), if you're looking for something familiar and safe, something that will help you turn off your busy brain; if you're looking for your standard shounen ai bishies, you better start watching UraBoku. \\n\r\nSo lower your expectations, turn off your brain and just enjoy it. I know I will.",
            "date": "2010-04-27T18:49:00+00:00",
            "helpful_count": 62,
            "mal_id": 25526,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302537.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 10,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/aindah",
                "username": "aindah"
            },
            "url": "https://myanimelist.net/reviews.php?id=25526"
        },
        {
            "content": "It seems Uragiri creators got their hands on some list of ingredients absolutely necessary to make an anime:\r\nbishounen – yes;\r\nshounen-ai – yes;\r\nteen fighters – yes;\r\nmagic – yes;\r\nreincarnation – yes;\r\nnot so Ordinary High School Student with superpowers – yes;\r\nsexy demon aka loyal servant – yes;\r\nkawaii animal with a forehead gem – yes;\r\nflowing cloaks, crosses, chains and other clanking metal things – in abundance;\r\nsophisticated spells and names in pseudo-German – yes.\r\nWait, seems there is something missing... Oh, yeah, plot. Well, its optional. As well as logic.\r\n90% of time the screen is occupied by main character Yuki (a boy who happens to be a girl in his previouslife), crying and moaning: “Kanata-san! Kanata-san!” – in reference to his best friend who turned out to be the main Bad Guy of this story. Sometimes other characters take the stage, crying and moaning: “Yuki! Yuki!” – in reference to his cruel destiny which makes Yuki to accept people's pain and suffering as his own. \\n\r\nThen, there are meaningless battles with bad guys, in which Yuki, though utterly useless, tries to help his comrades. The problem is his comrades have a mission to protect Yuki while he sees his mission in protecting others, so they all go in circles. And there is no proper ending, as it always happens with anime based on an ongoing manga. \\n\r\nIn theory, the story should be made more intriguing by the fact that Yuki-girl and the above mentioned sexy demon by the name of Luka were lovers in their previous life, and Luka still loves Yuki-boy dearly. Unfortunately, Yuki himself doesn't remember anything (though has some vague idea). But every time he tries to talk to Luka about this, they are interrupted by others, who seem to be unable to survive without Yuki even for a minute. So the shounen-ai is somehow incomplete.\\n\r\nThe only consolation is that bishounen are in abundance, music is fine and voice actors are good (though always spurting some embarrassing nonsense). All in all, not the worst way to kill time – but not the best either.\\n",
            "date": "2011-11-19T08:37:00+00:00",
            "helpful_count": 59,
            "mal_id": 47701,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/156209.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/happyoyster",
                "username": "happyoyster"
            },
            "url": "https://myanimelist.net/reviews.php?id=47701"
        },
        {
            "content": "'Betrayal Knows My Name' seemed like a promising anime with my interest lying in the central plot (or what I originally thought was the central plot prior to completing the anime) of Yuki and Luka.  In Yuki's past life he and Luka fell deeply, and madly, in love.  Luka finds Yuki again in his next life (reincarnated as a male) and stays by his side for the entire 24 episode run.\r\nUp front that seems like a promising romance story.  You have Luka who is madly in love with Yuki and will protect him as well as do anything for him.  Butthen you have Yuki, the main character, who has no memories of his previous life with Luka or the love that they shared.  Through more than obvious hints and comments from the side characters of the story, Yuki does in fact have a good idea that he and Luka were past lovers.  But through the 24 episodes all he seems to do is have a complete and utter lack of interest in it.  I can't say that he was 'avoiding' the subject because the subject never came up!\\n\\n\r\nIn fact, BKMN seems to focus ten thousand times more on the relationship between Yuki and his childhood best friend, Kanata.  There are more flashbacks, memories, and emotions tied between the two of them.  And Yuki is shown having much more feelings for Kanata than Luka, in my opinion, throughout the 24 episodes of the series.\\n\\n\r\nBy the end of the anime Yuki and Luka's relationship has not progressed one single step forward.  Yuki uses him as a means of protection and comfort and takes him for granted more or less.  For example in Episode 4 Yuki first tends to Tsukumo who is wounded by a slash on his shoulder, then he goes to speak with his school acquaintance who is emotionally scarred and depressed, then he goes to the orphan children to untie and comfort them only to be upset himself as they react very negatively to his presence and tell him not to touch them.  Yuki then has his own moment of feeling sorry for himself and cries to Luka about how pitififul he feels.  Luka who has been standing by his side watching him tend to everyone and everything with a deadpan expression on his face and a gaping hole in his abdomen.  Luka, out of everyone there, was the one most severly injured and the ONLY ONE who Yuki ignored.  In fact it isn't until the next day, in the afternoon, in Episode 5, that Yuki turns to Luka and asks him if he would like him to heal his wound as well.\\n\\n\r\nWhoops, guess Yuki forgot that he had been stabbed.  Everyone else was on his mind, apparently, and everyone else remains on his mind for the rest of the series.  Luka is probably dead last on Yuki's 'my most important people' list.\\n\\n\r\nI love Luka's dedication and loyalty as well as his deep, emotional, feelings of undying love... but those traits just turn negative and annoying when they are spent on a character who doesn't deserve them.  Luka became a mindless drone in many of the scenes where he literally has no reaction to anything.  He literally means that he will do anything for Yuki, let Yuki do anything, and never 'betray' him even if Yuki puts him last on his list and treats him like the dog he's acting to be.\\n\\n\r\nAside from his obvious mistreatment of Luka, there are an onslought of additional things I despise about Yuki.  For starters I cannot stand how utterly useless and worthless he is.  For the entirety of the 24 episodes he literally stands around and does NOTHING.  He mopes in his own self-misery and only has fleeting moments of happiness --- which only surface when the entire side character cast is surrounding him and gushing words of love, admiration, and need.  He is constantly putting his 'team' in danger as he recklessly rushes off to be a part of the battle.  And by being a 'part of the battle' to Yuki that literally means just standing in the background, wide eyed, and watching everyone get beaten up while he continues his internal monologue of how useless and powerless he is.\\n\\n\r\nThe cast of other characters in the story could have had potential and could have been likable if they all didn't dive into 'Yuki Worship'.  And when I say 'ALL' I mean 'ALL'.  Hell, even the main bad guy dives into 'Yuki Worship'.  The entire anime is glorifying the main character over and over shoving it down the viewers mouth just how wonderful, brilliant, loving, innocent, sparkly and selfless Yuki is.\\n\\n\r\nWell, I don't know where that Yuki is or where he went because the main character I've been watching for the past 24 episodes is nothing but useless, worthless, SELFISH, insensitive, and again SELFISH.  Yuki is the most selfish character in the entire anime when it comes to the good guy team.\\n\\n\r\nWith how pathetic, selfish, and useless he is it's no wonder he and his teammates have been reincarnated over and over for the past thousand years to fight a never ending battle that they keep losing.  News flash, guys, it's time to kick God's Light to the curb.  He's the one putting you all in danger in the first place because he's constantly inserting himself into danger intentionally and can't seem to comprehend that that, in turn, puts his entire team in danger because now they have to run out and try to save his sorry but AGAIN.",
            "date": "2014-05-02T16:34:00+00:00",
            "helpful_count": 26,
            "mal_id": 142125,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1516021.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/usagituskino321",
                "username": "usagituskino321"
            },
            "url": "https://myanimelist.net/reviews.php?id=142125"
        },
        {
            "content": "This is my very anime-waiting-list coz I read its manga first and hear its CD-dorama. And just like i expected ...it's awesome! Sugoooi! It also use some of legendary seiyuus *just like in the CD-dorama* YATTAA\r\nThe story's plot is a little bit too fast than the manga, but it's design with some wonderul scene, great effects, chibi-verision, and even there're some unexpected-scene I've never seen. So no problem at all\r\nIn the short words, some of the good guys reincarnated again same as before in previous life,except only for the princess of kami-no-hikari cos SHE's now HE! Without any memory of previous life. Her lover fromthe duras (akuma) still loves her,eventhough she's now born as a bishounen. That's why, some of people think URABOKU is yaoi. Will the boy regain his memory again and face the truth later? It's so exciting to wait the final result! \\n\\n\r\nEDIT: \\n\r\nThe plot finally reach the past-life of Takashiro & Reiga.So cool & very drastic!",
            "date": "2010-05-25T00:53:00+00:00",
            "helpful_count": 17,
            "mal_id": 26383,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/331217.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ryuichi_crosszer",
                "username": "ryuichi_crosszer"
            },
            "url": "https://myanimelist.net/reviews.php?id=26383"
        },
        {
            "content": "Let me tell you this first: If you're looking for a nice random anime, I would try this one. ^^ Maybe, it's looks a bit cliché or simple at the beginning, but I am certain you will like it. This is because this is one of the so called \"divers\" anime's who contain some points everyone likes.\r\nStory: I think it's a touching story. In the first episode (btw, I am not gonna spoil anything, but only some moments in the first episode) you meet the protaganist, named Sakurai Yuki. He's a real goodie, and is independent, because he doesn't have any relatives anymore. But whenone dark-looking guy approaches the boy, the whole story begins. This man, Luka (Zess = codename) is claiming to be his servant en wants to protect Yuki, because he's important to him. Yuki discovers he's from a Giouh Clan, which means he has some magic power inside him. Which one, I am not gonna tell you, you have to watch if you want to know. Because of this power, he has a destiny to fight some dangerous creatures, named Duras. And of course, Luka is helping him. (There are more Giouh Clan members introduced in the series) Their relationship is growing during the episodes. It's a pain I can't say anymore about this series, because I don't want to spoil, but you know the main line of the story. They fight as a pair together with other pairs, to destroy those Duras. (mankinds enemy) The reason I gave the story an 8, is because it's interesting and not as cliché as I thought before. It's like a big puzzle. Every episode is important for the next. No fillers!\\n\\n\r\nThe art is very beautiful. It looks similar to Vampire Knight's art, but I think it's different though. I gave this subject a 9. Fighting scenes, or emotional moments between characters are very well drawned. That's attractive.\\n\\n\r\nThe sound is good too. Hmm, not very divers, but the opening song is great. I like the ending song too, and some of the OST's. The sound is a good match with the events. That's the reason I didn't gave it a 7, but an 8 too.\\n\\n\r\nCharacters are interesting:) Maybe, that was my reason to watch more episodes. You're pulled in when you like Luka or some of the others characters. It's not the case that the main characters are the only important ones. They give small characters an important roll is as well. You get much information about them. My favorite fightpair is: Hotsuma and Shusei^^ Oh, another good point is that the characters are not similar to each other. So they won't get boring. Characters: 8 too.\\n\\n\r\nEnjoyment: 8. You don't have to be patient when you start with this anime, but you have to be neutral. Don't get an opinion too quick, because it's really good. The manga is popular as well, and now they made an anime and are still airing. When you think like this, you won't consider this anime as a waste of time. I like it very much and I am glad for trying this one. Just try one episode, or two, and you'll see why. I can't wait for the next episode to come out! \\n\\n\r\nOverall: An average score: 8. They could make the sound more interesting (OST's) and I think they have to tell a bit more about the small characters. (although they did, but I think it can be more) But it's overall a great anime to start with or to watch ones per week. It will never get boring and it's worth it! Just try!",
            "date": "2010-06-02T11:09:00+00:00",
            "helpful_count": 16,
            "mal_id": 26704,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229094.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Horinde",
                "username": "Horinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=26704"
        },
        {
            "content": "I really cannot think of enough good things to say about this anime! The story is wonderful (if a little cliched at times), the characters are believable and hilarious, and the art is absolutely breathtaking!\r\nThe best part of this anime, however, has got to be the main character, Yuki. Despite the fact that he has no defensive or offensive powers of his own, he refuses to sit on the sidelines and let others defend him.  And, unlike most heroes/heroines in his position, he is not completely helpless.  He is very skilled in the martial arts, and utilizes that skill to the fullest!\r\nOverall, thisanime is completely spectacular, and I reccomend it to anyone who wants fantasy, adventure, romance (with more than a little shounen ai), and humor, all rolled into one!",
            "date": "2010-06-27T17:51:00+00:00",
            "helpful_count": 16,
            "mal_id": 27676,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/347249.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RiverRayne",
                "username": "RiverRayne"
            },
            "url": "https://myanimelist.net/reviews.php?id=27676"
        },
        {
            "content": "I don't usually review an anime before it's over but this one's a bit different. Scores will change as the series go on, I guess.\r\nAs many have said, the storyline is really cliché, boy with a troubled past, mysterious power, joining a larger  group of people with powers in order to save the world. Currently, there doesn't seem to be much behind this story, I haven't read the manga yet but many can pretty much see where this is heading, so here's my somewhat detailed opinion on the first 9 episodes of Uraboku.\r\nStory - 7/10\r\nAs previously mentioned, there isn't much substance to the actualstory at the moment, it's your typical  mysterious boy with unique powers that is in danger from another evil group of people that also seem to want or are afraid of his powers. However, there's something quite alluring about this series based on the first 9  episodes, I found every episode enjoyable to watch despite its predictability, whether it be the characters are  the amazing art. The story itself isn't great but the pace is neither too slow nor too fast, it doesn't drag on or skip ahead too much, this and the amount of action I've seen so far is enough for me to want to keep watching.\\n\\n\r\nArt - 10/10\\n\r\nThe art is absolutely amazing, beautiful and detailed. Characters are outstandingly drawn to be unique  individuals, scenery is pretty even the evil guys are pretty. Special effects/spells are done amazingly also. The  art in Uraboku is one that bears a stark resemblance to Vampire Knight, so if you loved that then I guess you'll  love this even more.\\n\\n\r\nSound - 9/10\\n\r\nThe soundtrack is fitting, nothing special but it is used perfectly to create the right atmosphere and feeling  intended based on what is happening. The OP and ED are also well chosen. I'm glad to see some familiar voice  actors like Sakurai Takahiro, Fukuyama Jun and Ono Daisuke, however, something about Yuki's voice seems to annoy me greatly. Other than that, the voice actors fit their roles amazingly. \\n\\n\r\nCharacters - 8.5/10\\n\r\nAgain, the characters are rather cliché like the storyline. I find Luka pretty 1-dimensional at the moment, playing the servant role to Yuki because he sees the previous Yuki's soul in the current one, however, he's just cool enough for a girl like me not to care. The others are not entirely 1-dimensional characters however they're pretty much your average characters in a cliché story where they have troubled pasts which the anime goes on to address eventually. I quite like the relationships the Zwelit Guardians share with each other as pairs, it really brings out the shounen ai in this anime, it's not explicit nor is it too vague, for people who shounen ai isn't something they particularly enjoy, you could just interpret it as deep friendship between two guys. Overall, each character is unique in terms of power and personality, moreover, each one is one heck of a bishy.\\n\\n\r\nOverall - 8/10\\n\r\nI'm still expecting more from this anime so this score will undoubtedly change depending on whether future  episodes meet my expectations or not. Currently, I feel that the first 9 episodes have brought the anime to a positive start, I've enjoyed every episode so far and it's been a while since I've seen an anime that isn't unbearably slow to begin with. Although the story is cliché for many, if you're looking for an anime with a simple plot, eye candy characters, supernatural powers then you might want to consider adding Uraboku to your list.",
            "date": "2010-06-10T14:35:00+00:00",
            "helpful_count": 14,
            "mal_id": 27016,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/181400.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lillyness",
                "username": "Lillyness"
            },
            "url": "https://myanimelist.net/reviews.php?id=27016"
        },
        {
            "content": "This is what basically happens to Uraboku: nothing.\r\nI didn't get why Yuki was their (supposed) hero. In fact, everyone was trying to protect him. Okay, so he can heal wounds and all and he's the God's Light, but they should have shown that instead of the other way around. Sure, there were scenes wherein he protected his friends, but they were very, very few.\r\nDon't get me wrong here when I said nothing happened to the story, because really, there were none. One thing that also disappointed me was that they didn't elaborate much on Yuki and Luka's past. It would've been wonderful if Yuki somehowremembered that they were lovers from before. They didn't even get to end that fight with Reiga and the two other general-class Duras. All there is to the ending were a bunch of confessions (as what I'd like to call it) with their partners. Which was actually fine for me since that's the closest to shounen-ai that this story could offer.\\n\\n\r\nI wouldn't say that I didn't have fun watching this though, because this was an okay watch. I appreciated that they actually made small stories for some of the Zweilt Guardians' pasts, including Takahiro and Reiga's. It's just that they could have done better with its 24 episodes.",
            "date": "2011-02-19T21:48:00+00:00",
            "helpful_count": 10,
            "mal_id": 34590,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/402375.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/strldrp",
                "username": "strldrp"
            },
            "url": "https://myanimelist.net/reviews.php?id=34590"
        },
        {
            "content": "To be honest, the only thing good or at least satisfying about this anime are the hot guys. Oh, and the graphics, the characters look really really good, with lots of details and nevertheless, the outside sceneries look truly fantastic.\r\nStory: The story is completely boooring. It's true, in the beginning you are somehow captivated but after a few episodes it gets very uninteresting. This whole anime is about Yuki, the most ANNOYING chacarcter. Why? Well, I really hate it when the main hero always needs to be babysitted by the other characters. In every single episode you will hear at least 4 times someone askingYuki if he is alright and if we put together this scenes we could make 5 episodes of other characters worrying about Yuki. Another fact is that this anime should have had maximum 12-13 episodes because in most of the episodes the action is missing and you get really bored.\\n\\n\r\nSound: Sound is ok. I rated 9/10. I like both the openings and endings.\\n\\n\r\nCharacters: Like i said, Yuki is the most annoying character of the series. The ones that I liked were Reiga and Luka. Although in this anime they are talking about thier previous lives and how they are always reborn, we find NOTHING at all about Luka and that is really sad, because he seemed an interesting character. Nevertheless, we learn nothing about Yuki, who what the hell is the main character but still, his past remains blurred.\\n\\n\r\nEnjoyment: The fights are enjoyable enough, that's fair, but this is all I enjoyed.\\n\\n\r\nOverall: This anime is bad. Bad. I do not recommend it. It's truly a waste of time.\\n",
            "date": "2014-03-05T10:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 134799,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3512445.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 9,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Rawrzz03",
                "username": "Rawrzz03"
            },
            "url": "https://myanimelist.net/reviews.php?id=134799"
        },
        {
            "content": "Heh, I dropped this after 7th episode. It looks like to me as if heros from Vampire Knight (I don't like VK) are traped in prophery from X/1999 (I love X and all works from CLAMP) plus the genre change reminds to me Angel Sanctuary (I didn't find anything interesting on AS) and the paranormal ability are as from Night Head Genesis (I like NHG). So in the end this strange and not original mix isn't my cup of tea.",
            "date": "2010-06-09T09:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 26961,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/126228.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ladymanson",
                "username": "ladymanson"
            },
            "url": "https://myanimelist.net/reviews.php?id=26961"
        },
        {
            "content": "This anime is bishounen central. That may have been (part) of the reason I became motivated to watch it, because I stopped watching after the first four episodes, took a long break, then started again a day or two ago. I thought it would be really good, as I have a couple of friends who are a fan of it.\r\nWell. I guess I got a kick out of watching this.\r\nStory: 6\r\nIt's not the story itself that's bad. The premise is good, maybe a bit average; MC with special abilities he has no clue about. He suddenly gets involved in this mess with creatures called Duras,whereupon he meets a man named Luka who swears to protect him. The main character, Yuki, has actually been reborn several times (and this is no spoiler; they give it away within the first four episodes), with other members of his family he had no idea about until the attack, and with Luka.\\n\\n\r\nIt's the development that's bad.\\n\\n\r\nFor an anime with such an interesting premise, the development is bad, I could even say horrible. Why? I had about a billion burning questions, and pretty much none of them were answered? Sure, the characters were asking the questions themselves, but there was never. An answer.\\n\\n\r\nExamples:\\n\r\n1) Why was Yuki a girl in his past three lives but is now a boy?\\n\r\n2) Why does everyone seem to revolve around Yuki?\\n\r\n3) How did previous!Yuki get together with Luka?\\n\\n\r\nThere are also a huge number of cliche'ed lines in this anime. There were so many that I felt kind of embarrassed when I heard them.\\n\\n\r\nArt: 8\\n\\n\r\nThe art was pretty good. I felt like it was a bit inconsistent, but I didn't really care. Although the animation was smooth and beautiful, I have to say. The hair.  It's so distracting. There were a lot of those 'wind-blowing' scenes, and all I'd do was stare at the hair going 'Lol what so much hair'.\\n\\n\r\nSound: 8\\n\\n\r\nAnother better area in this anime. All the seiyuus did a great job. Although Yuki's voice annoyed me a hundred percent of the time. I'm not sure, but something about his voice just really annoyed me. I can't hate his seiyuu, because he's played quite a bit of characters I can respect. I guess the quality was a bit less in this anime.\\n\\n\r\nCharacter: 5\\n\\n\r\nAhahaha oh god. This is where most of the shit hits the fan. And it's mostly because of our main character, Yuki.\\n\\n\r\nYuki is literally such a useless character. They try to portray him as such a kind, caring character, I get it. He always seems to want to 'do something about the current situation', but he can't because he's absolutely powerless. He goes 'I'm going to save ______!' but he can't, because he doesn't have any power.\\n\\n\r\nOr rather he does, but he doesn't use it.\\n\\n\r\nSee, he uses his power in situations that come rarely. Like the last couple of episodes. He somehow magically has the ability to use his offensive power, although he's been useless for the past 20 episodes.\\n\\n\r\nAnother thing that had me going \"lol wuh' doing the anime was how Yuki-centric it is. Everyone loves Yuki. Yuki is amazing. Yuki is so kind. Our world revolves around Yuki. Yuki is our sun. Yuki is our GOD. When Yuki is sad, we'll just mope around at home. When Yuki is gone, they'll be like \"Where is he? I wonder if he's okay? Can you here his voice? Yuki. Yuki. Yuki, YUKI.\"\\n\\n\r\nI should make a tally, someday, of how many times I laughed when this happened versus how many times I wanted to break my iPod's screen.\\n\\n\r\nLuka is our apathetic guy who's so madly in love with Yuki that he'd never betray him. In fact, that's his motto. He says it in every episode, right before the OP \"Only I can know your pain, and only I can know your uncertainity. I will say it a million times, if you need it... I will never betray you!\" He's portrayed as a pretty epic badass. Although his clothes are kind of hilarious and over the top, his character is not that bad. It happens off screen, but apparently before Luka arrived at the Twilight Mansion, he was very anti-social (whoa, whoa, surprise there). But ever since Yuki came, he began to open the doors to his heart. This is the only development we see, in his character, at least.\\n\\n\r\nThe side characters had a LOT of potential. I liked them much more than the main characters (particularly Hotsuma and Shusei), but unfortunately, they were not given too much time to develop their characters, and they were Yuki-ists as well.\\n\\n\r\nThe villains were generic. I don't even think I need to describe them, I was pretty much facepalming every time I saw them.\\n\\n\r\nEnjoyment: 6.5\\n\\n\r\nHonestly, I got so annoyed with Yuki I barely had any room to actually enjoy the show. One of the only parts  of the anime I liked was the Hotsuma/Shusei arc, and that's probably it. The rest of the time I was laughing or trying not to break my iPod screen. Still, that being said, I don't hate it. I did enjoy some parts, if not all. It was fair, not the most enjoyable anime I have ever come across of.\\n\\n\r\nOverall: 6\\n\\n\r\nHonestly, I hoped it'd be better. Not bad, it was okay. I could list at least a hundred other animes better than this, but it was okay. That's all I can say about it; okay. The outfits were ridiculous at times, and the animation was really pretty. The OST was good. This isn't actually a shounen-ai, but it implies a lot. You can interpret the pairings in whatever way makes you comfortable. Some of the characters are very close, such as Hotsuma and Shusei. \\n",
            "date": "2013-01-02T03:56:00+00:00",
            "helpful_count": 7,
            "mal_id": 82366,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557987.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Laciie",
                "username": "Laciie"
            },
            "url": "https://myanimelist.net/reviews.php?id=82366"
        },
        {
            "content": "This is going to be a very blunt, very short review.\r\nUraBoku = Blue Seed. The only difference is that UraBoku has a hint of BL to its proceedings, and its animation is better. \r\nUraBoku isn't bad exactly - its just not even slightly original. The first five episodes or so are boring as hell, though. I've read most of the manga, so it should improve, but don't go into this expecting something fresh and amazing. This is purely disposable entertainment, the kind of thing you watch to kill time. Not awful, but certainly nothing to write home about. \r\nIt does have a good soundtrack, though.",
            "date": "2010-06-12T20:12:00+00:00",
            "helpful_count": 7,
            "mal_id": 27092,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/63610.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ADayWithoutMe",
                "username": "ADayWithoutMe"
            },
            "url": "https://myanimelist.net/reviews.php?id=27092"
        },
        {
            "content": "this anime has gone down in history as my least favorite anime i've watched. i've complained about it to many people, and here are the reasons why.\r\n(bear in mind its been quite a while since i've seen this so excuse any missed details)\r\nso, my very biggest issue with this was the plot (specifically the ending). there were so many ways this show could turn out and so many hints at the character's pasts. the majority of the show is based off of the character's backstories and the time loop they seem to be stuck in, but it's never explained. i watched 24 episodes and theydid not go into any depth about the backstories, or any past lives or adventures when they clearly are crucial to where the characters have gotten to. i was hoping for some sort of explanation at the end, but i was left with nothing learned and just confusion and anger instead. it was so irritating to spend so much time on a series only to be left with nothing in return. i have so many questions i was never given answers to, and that's the main reason i really do not like this anime at all.\\n\\n\r\na few other things as well:\\n\\n\r\n-i did genuinely like most of the characters. some were fairly predictable but they all managed to hold my interest-- i'd say the characters were a strong point in this anime.\\n\r\n-the music and art were fine to me, but didn't particularly stand out\\n\r\n-not very much was explained about the past (which is pretty important to the show)\\n\r\n-there's a fine line when leaving out critical information, and this anime quickly passed from 'i want to know more!' to 'okay so i know nothing at this point.'\\n\r\n-the best thing about this anime was hotsuma and shusei, and their relationship. their bond with each other was quite complex and i enjoyed seeing how they act around each other.\\n\r\n-the plot seems interesting, but i just felt it was a useless build up to a confusing ending and too many unanswered questions\\n\\n\r\nso, to summarize, i really wouldn't recommend this anime unless you want to be disappointed.",
            "date": "2017-02-25T21:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 241398,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6014624.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ohkeiji",
                "username": "ohkeiji"
            },
            "url": "https://myanimelist.net/reviews.php?id=241398"
        },
        {
            "content": "Ok, I just finished watching this anime, first let me go over what I liked about it.\r\nThe guys are all hot! Oh yeah, if you want some great eye candy then this one is a good one to try. Its also a Shounen-ai which makes it even better and an action one at that. So if you love bishie boy action type of animes then it is worth checking out.\r\nHowever, although an anime has these elements does not mean I can give it a high score. Heck I have watched plenty of bishie type animes that I couldn't get past the fifth episode of andhad no choice but to drop *looking at you Mien Liebe* so I have no other choice but to go over everything that ticked me off about this anime. \\n\\n\r\nThe story is about a boy named Yuki who was reincarnated from a woman, he gets saved by a man named Zess from a Duras (evil creature thingy) and he gets caught up in a war between the Giou Clan and the Duras. At least this is the best way i can explain the story because when it first comes on you will honestly not understand anything about anything concerning this story. You feel as if you were dropped in the very center of the story and you have to struggle to catch up. When i really think about it, the show doesn't do a good job of explaining what the heck these Duras even are or where they came from or why one character can control them even though he is only half Duras. Anyway, Yuki and Zess become close and we discover that they were once lovers when yuki was a woman. Zess is still very devoted to Yuki but sadly it doesn't seem to progress from there. The relationship between them is never fully touched upon. Yuki and Zess stare at one another, profess that they long to see each other when the other isn't around, they touch each other faces but that is all you get out of them. No kisses, no passion, not even an acknowledgment from yuki that he even remembers the relationship even after he remembers everything else.\\n\\n\r\nThe story has its moments of drawing you in, such as the potential subplots with the other Zweilts(sp). You have two guys who seem like they could be lovers and one is struggling with his feelings of guilt because he hurt his partner.\\n\\n\r\nThe Zweilt(sp) partners who both seek revenge on the Duras general who killed their trainer\\n\\n\r\nThe story of the Giou Clan leader and his butler and past with Reiga, the villian of the show.\\n\\n\r\nHowever, these are all swing and misses as the writers don't bother to truly flesh out any of these characters and they sort of make it hard to root for them. Instead, the characters seems to have no life of their own besides worrying about Yuki, caring for Yuki, protecting Yuki, loving Yuki, and needing Yuki. They call Him their master yet you NEVER find out why. Yuki is by far the most useless character on the show. He does nothing but stand around while everyone fights and risks their lives for him, they all gather around him to protect and save him yet you never find out why the bad guy even needs him. So far all you get is that he \"changes people's hearts\" The other characters have so much potential but when they are around yuki it is all about Yuki and when they are not around Yuki they talk about nothing but Yuki.\\n\\n\r\nIt really ticked me off when the first pairing I mentioned were talking about their relationship, it was touching, sad, tender, and almost romantic until one says \"You love Yuki\" (or something similar) then the other replies \"You love him too\" WTF?!? Yuki was barely around them and had almost no contact with them but suddenly they both love him?\\n\\n\r\nI swear this anime should have been called \"Yuki, the c**k teaser\" Everyone on the show falls in love with him men and women but all he does is stand around like a woman gasping and telling everyone to stop fighting. Then the bad guy finally captures him but instead of killing him he just wants him to watch his friends get killed. Mind you, i can understand that the bad guy was his friend and there was some conflict with killing him, i can understand this, but it was never explained why Yuki was so important he needed to be captured and taken. And it was done so stupidly. Yuki just stands there juicing up his powers and suddenly his in classic damsel bridal style pose near the bad guy who is taking him away. Of course, this means that the other Zweilts get to talk about Yuki for the one billionth time and go save him for the one billionth time. \\n\\n\r\nAnyway, as much as I complain I have seen worst and it did keep me hanging around for all 24 episodes and I would probably watch a season 2 if one comes out. It did have a decent main plot once you get over the first two or three episodes, I liked the IDEA behind Zess and Yuki, loving someone no matter if they are a man or a woman. But I wish the writers would have at least let the character TALK about that.",
            "date": "2012-05-02T15:34:00+00:00",
            "helpful_count": 6,
            "mal_id": 60215,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/846605.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 10,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Hazegurl",
                "username": "Hazegurl"
            },
            "url": "https://myanimelist.net/reviews.php?id=60215"
        },
        {
            "content": "裏切りは僕の名前を知っている - Uragiri wa Boku no Namae o Shitteriru is a pleasant and atypical shoujo anime that not only offers the expected larger cast of handsome male characters, but is also very entertaining due to its action, magic and fantasy elements.\r\nStory: Battle, reincarnation, bond between souls, everything a little wrapped up in black - clichéd but nice (7/10)\r\nThe story tells of the battle that has been raging for more than a millennium between the darkness, the demonic beings of the shadows, the Duras and humans with special abilities, the so-called Zweilt-Guardians. With the help of reincarnation, the battle could be continued into the 21st century,the fighting arena is now the capital of Japan, Tokyo. Regardless of the first impression, which is aroused by a larger male cast and the strong focus on feelings, emotions and the willingness to make sacrifices, it is nevertheless not a classic Shōnen-ai story. It is never near to yaoi, so don`t worry.\\n\\n\r\nCharacter: Interesting questions about reincarnation and how it affects love as well as a good, plausible and comprehensible character interaction leads away from stereotypical patterns (8/10)\\n\r\nAt first glance, the characters seem to be stereotypical, but each of them is unique, and by describing their relationships with each other, the character profiles gain additional psychological depth, which in turn makes their development worth seeing.\\n\\n\r\n*The description of the characters may include spoilers, so better watch the anime first.*\\n\\n\r\nSakurai Yuki (Giou):\\n\r\nYuki suffers from the ability to read the vile feelings of those he touches and share their nightmarish memories. His strong desire to help almost killed him. A mysterious stranger suddenly stepped out of the darkness and saved him. A man with silver eyes, with whom Yuki feels strangely familiar. To interpret this as a sign of a homoerotic undertone in the relationship between the two main characters would not take into account that Yuki had previously been reborn as a woman. The more Yuki tries to find the answers to the sudden circumstances in which he finds himself, the more he must realize that he is destined to be a part of the fight.\\n\r\nZess (Crosszeria Luca):\\n\r\nActually the most interesting character, strong-willed and convincing, yet subject to his emotional world. As a senior Duras (Opast) basically an opponent, but due to a deep bond a companion of the Zweilts. It is amusing that Zess, as probably the most masculine representative of the cast, correctly explains the character of his affection for Yuki, as well as the anime in general by answering Giou Takashiro's question: \".... it is the same soul and his feelings have not changed\". In short, he doesn't care in which body the love of his life was reborn. Is there a greater compliment for true love? His character and conflict are well portrayed.\\n\r\nZweilt-Guardians (Giou Clan):\\n\r\nGiou Takashiro:\\n\r\nA powerful necromancer, calm and wise, leader of the Giou Clan. On the other hand, he is cunning, which is reflected in his ability to manipulate. His mildness and friendliness make him sympathetic and also awaken a mysterious aura.\\n\r\nMurasame Touko:\\n\r\nShe is a strong guardian, characterized by sincerity, justice and exuberant cheerfulness. Her loyalty to the Giou Clan is based on a strong sense of familiarity, especially with her brother. In battle she uses a mighty broadsword.\\n\r\nMurasame Tsukumo:\\n\r\nThe guards always fight in pairs, here Tsukumo with his friendly and considerate nature is the perfect companion for Touko. Both complement each other in character as well as in combat. Tsukumo receives a large-caliber pistol for combat through his summoning ring.\\n\r\nRenjou Hotsuma:\\n\r\nHis dismissive and condescending way is just a facade but suitable for the rough and impulsive hothead who rules over the flames. The overcoming of his inner conflict, caused by rejection and loneliness which his gift brings him, is presented  well and credibly. To fight, he conjures the masterstroke, a sword that`s more curvy than a Khanjar - pretty cool design.\\n\r\nUsui Shusei:\\n\r\nHe is Hotsuma's guardian-partner, since his childhood a good friend and a perfect counterpart. His friendship is crucial for the development of Hotsuma.\\n\r\nHourai Kuroto and Furuori Senshirou appear later than in Manga. They also have to deal with internal conflicts. What is interesting about Senshirou is that he was not reborn but became a Zweilt due to hard training. With him, there are two in the Giou clan who have not been reborn.\\n\\n\r\nDuras, the clan around Reiga:\\n\r\nReiga:\\n\r\nHis person is mentioned again and again, but remains hidden for the time being. He is a strong opponent and commander of the beings of darkness. The Duras are demons that lure people into darkness. Their lowest representatives are called \"Nidatorehi\". The next higher demon class, the midfield so to speak in the ranks of the Duras, are the \"Midvillain\". The highest class is called \"Opast\", to which Zess belongs.\\n\r\nBayuu:\\n\r\nHe belongs to the Midvillains and is characterized by arrogance, yet a strong opponent and a serious threat to a single guardian.\\n\r\nAshley:\\n\r\nShe is the first opast to appear in action. The little lady in the sweet Moe appearance is smart and also quite well characterized in terms of malice.\\n\r\nJekyll & Hyde:\\n\r\nThe Opast twins appear almost simultaneously with Ashley, for the first time. They fight as a couple, similar to the Zweilt. Unfortunately they seemed a little colourless next to Ashely.\\n\r\nElegy:\\n\r\nA real scoundrel, but her performance didn't convince me.\\n\r\nCadenza:\\n\r\nA top-class villain! Powerful, not foolish, brutal and is not afraid of anything!\\n\\n\r\n*Spoiler alert end*\\n\\n\r\nVisuals: nice, good blending (2D/CG), beautiful background art, skillful adaptation (8/10)\\n\r\nThe visualization of the original by Odagiri Hotarus by the studio J.C.Staff is a success, because the delicate drawing style and the graceful stamping have been preserved. The animation is fluid and the level of detail is good, e.g. the police headquarters in Tokyo (Ep. 5 / 11:47 min.) is true to the original. Another positive aspect is that the Chibi content for a Shounen is low. On the other hand, I liked the fact that the facial expressions were very well emphasized and accentuated, which is mainly due to the focus on the eye area itself. Special effects / spells are nice and detailed. The fights looked really awesome animated, for the year 2010. Surprisingly, although some of the computer generated components, like the demons are not my cup of tea, the overall picture of the anime was convincing. This is due to the fact that the background art is beautiful and that the blending of CG effects with 2D animations were done very skillfully, so that the overall picture and the atmosphere are very appealing.\\n\\n\r\nSounds: BGM top, pretty cool OP, VA very good, dialogues sometimes a bit chlichéd (8/10)\\n\r\nBGM is very well chosen, emphasizes beautifully, but is not omnipresent or intrusive.\\n\r\nThe OPs and EDs are all from the Japanese band Rayflower. The first OP is \"Uragiri no Nai Sekai Made\". A great start, calmly with a prologue - btw pretty cool monologue - light choral / orchestra background music, which then turns into a rock-oriented arrangement with a really suitable animation (ep.1-14).\\n\r\nThe ED \"Aoi Ito\" by Ep.1-14 is musically quite soft and fits, thanks to the successful imagery well to the end of the anime.\\n\r\nThe second OP \"Inishie\" rocks too. The same monologue, but a new, great animation now adorns the beginning. The rock music is again a pretty good OP.\\n\r\nOn the other hand, the last ED \"Kizuna\", I do not like so much. The animation is optically good, but I didn't find the melody suitable for the end of the episodes.\\n\r\nThe voice actors complete the good overall picture of the sounds. Maybe because of the well-known speakers like Ono Daisuke and Hino Satoshi, but I especially liked the voices of Luca Crosszeria (Sakurai Takahiro) and Touko Murasame (Inoue Marina). Unfortunately, the dialogues are at times somewhat clichéd, which is especially noticeable at the beginning of the second half.\\n\\n\r\nThe exciting shoujo anime leaves some questions unanswered, but since the manga is finished, I do not consider that to be negative. The good visualization and a corresponding musical background merge into a very nice overall picture and create a good entertainment value. Unfortunately, the anime is often overlooked or neglected because of its focus on the female audience.\\n\\n\r\nThanks for reading and have fun watching.",
            "date": "2018-08-31T14:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 287854,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5632852.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Sesshomaru",
                "username": "Sesshomaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=287854"
        },
        {
            "content": "Betrayal Knows My Name focuses on a teenage orphan named Yuki who gets caught up in a conflict between the human Zweilt Guardians and the demonic beings known as Duras. The Duras seek to kill Yuki due to his powerful ability called God's Light being a potential threat to their efforts to take over humanity. Outside of the Zweilt Guardians, Yuki also has protection via Zess, a Duras who is a traitor of his kind due to his mysterious contract to protect Yuki from enemy threats.\r\nBefore I get into reviewing this series, I should address something that is fairly infamous with this anime and thatcomes in the form of the implication of it being a boys-love anime thanks to the close relationships that involve Yuki and Zess and a couple pairs of the Zweilt Guardians being young men. Having watched through the series in its entirety, I did not really see much that would elude to the possibility of the male characters showing any interest in one another, beyond possibly some romantic implications played up about a major revelation concerning Yuki's character and how it affects his bond with Zess. Even with these developments, this element to the series does not do anything to get in the way of the title's storytelling and I don't really get why there have been those making a fuss over it.\\n\\n\r\nSetting aside the matter, Betrayal Knows My Name offers a solid amount of buildup in developing its story and exploring a number of its major characters. The series takes its time with exploring more of its supernatural elements with the mysteries surrounding Yuki's powers, the Zweilt Guardians, and the Duras' seeking to kill him off. Also going along by its title name, betrayal is a major element with a few of the major characters within the series that include Zess and some surprising characters who are acquainted with Yuki. In addition, the series devotes episodes to feature focus on the backstories and origins of a number of the characters that include Yuki, a number of the Zweilt Guardians, and even what led up to their official formation.\\n\\n\r\nSetting aside praises, the series also comes with its fair share of shortcomings. There are a fair number of things unclear about elements to Yuki and Zess' relationship, including what led Zess to betray the Duras and what connections he has to Yuki as a result of it. I also felt that the drama coming from Zweilt Guardians efforts to protect Yuki due to concerns for his well-being came off as overdone considering his abilities and how huge a threat he can to the Duras' while willingly wielding it. The final episodes of the series also rush through its final conflict with a group of Duras that our heroes go up against, which ends inconclusively due to the show's manga source material still being ongoing.\\n\\n\r\nPresentation wise, the show's a bit of a mixed bag. The visuals suffer from awkward character designs where the characters seemingly have the same facial designs and the animation is a bit stiff in regards to movements and milking animation shortcuts. On the plus side, the show's soundtrack does a good job at effectively conveying the proper mood during dramatic moments and battle scenes.\\n\\n\r\nOverall, Betrayal Knows My Name is a solid supernatural action-drama that offers a solid amount of plot and character developments to keep you hooked on the show for its full run. While having its issues with plotting and visual presentation, it's still worth at least a rental to get a sense of the supernatural world it offers up.",
            "date": "2017-05-20T15:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 248157,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=248157"
        },
        {
            "content": "the anime was recommended by a friend, and since i was doing nothing at the time, i checked it out. and like the others say, it is not particularly new, but it certainly has soimething on its own that makes the story stand out for itself.\r\nartwork reminds me much of vampire knight, (and tsukumo is the very image of zero kiryuu) tyhe seiyuus did a great job (i mean, did they ever fail?). the coloring is a bit hard to pick up, but nicely done nonetheless.\r\nsuggestive words now and then are certain to make the fangirls happy once they watch this anime, but they certainlywon't forget the essence of the plot.\\n\\n\r\nyeah, i think overall, this anime is a good way to pass time, unless you're looking for some gory action and adventure without real plot, UraBoku is sure to capture your taste!",
            "date": "2010-06-04T00:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 26776,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/285729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/reishicolleen",
                "username": "reishicolleen"
            },
            "url": "https://myanimelist.net/reviews.php?id=26776"
        },
        {
            "content": "The next time an Anime character says: 'I...I...I..' I'm gonna punch someone, I swear to God. Damn even if I wanted to I wouldn't be able to count the times a person says that and doesn't finish their sentence. But alright, the review.\r\nStory:\r\nThe story isn't actually bad. The story has quite some depth, including the background stories of the characters (in fact this is probably the most important thing in the story). Especially because it features shounen ai, it is a more unique story than a standard romance story. Because let's face it; this is a romance anime. Sure there is some fighting, but notvery much. The few (compared to other anime with similar stories) fighting scenes are also generally short.\\n\\n\r\nThe problem with the story however, are the characters. Most are cool and good, except the main character. Will talk about that later.\\n\\n\r\nArt:\\n\\n\r\nI think it is comparable to anime such as Zombie Loan. I'm glad they chose for normal eyes and stuff like that. Unlike other things, the art and animation didn't throw me off. It was actually quite good.\\n\\n\r\nSound:\\n\\n\r\nI just said the Art didn't throw me off. The sound did. Not in overall, but the most important sound did. And that is the main character's voice. Honestly damn how annoying can a voice be, seriously. I wouldn't really care if a side character had this voice, but the main guy just talks so much with that annoying voice. It actually makes the conversations involving the main guy and someone else annoying. I honestly thought of stop watching this anime the first episodes just because of his voice. \\n\\n\r\nCharacter:\\n\\n\r\nThis is probably the thing that the anime does best, and does worst.\\n\r\nLet me start with the not-so-imporant side characters. These are actually done quite well. They all have a very specific personality, are not boring and for boy-lovers here: The guys in this anime are hot. I absoluty have no problems with these characters.\\n\\n\r\nBut now to the main character: this guy is so fucking annoying. No, it's not because that is how he's supposed to be. It's because he's crying all the fucking time, always complaining, always trying to be the good guy and always talks with this annoying voice. I have never seen such a boring main character. I couldn't' care less about him. Even though he is the core of the story, this anime would have been so much better without him. The anime should have focused on the other characters. \\n\\n\r\nEnjoyment:\\n\\n\r\nThis is probably the first anime I have watched completely while really struggling to finish it. The only thing that kept me watching was the story and the other characters, but it was a hard time and I wouldn't recommend this anime to anyone. There are plenty of better anime out there with this setting and a good story.",
            "date": "2012-05-20T11:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 61591,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/WowAnimeTaiga",
                "username": "WowAnimeTaiga"
            },
            "url": "https://myanimelist.net/reviews.php?id=61591"
        }
    ],
    [
        {
            "content": "I have not read the manga and this review is based only on the anime....\r\nNothing..... just nothing happens in the anime. From the first episode to the last nothing happens...the story moves at a snails pace.....it bored me to hell.....I hate the character Yuki....\r\nanime has a bunch of beautiful people who all obsess over Yuki, who has done nothing, will do nothing and can do nothing....I dont know why they all obsess over him..in every damn episode all the characters just sit together and obsess about Yuki...and Luka just chants the word Yuki and nothing else........in all of 24 episodes I have seen Yuki donothing except be a wimp...\\n\\n\r\nGOD its just a waste of time....",
            "date": "2013-01-15T17:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 83773,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/914743.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/rajanikanth",
                "username": "rajanikanth"
            },
            "url": "https://myanimelist.net/reviews.php?id=83773"
        },
        {
            "content": "There is so much I want to say about this, I can hardly figure out where to start from. I should perhaps start by noting that if you're in solely for the shounen-ai part, like I was, you might as well want to reconsider as there is literally nothing to satisfy your expectations...\r\nUragiri wa boku no namae wo shitteiru(Betrayal knows my name) - a flashy name and even flashier cover picture, with gorgeous young men, a real feast for the eyes, it makes you want to believe the contents will justify or perhaps correspond to the cover, alas it doesn't. Why is that?\r\nIf you everthought you know the meaning of the word \"cheesy\", you're in for a surprise and you will most probably want to laugh, cry, howl and roar at the same time about every 5-10 mins from each episode. \\n\\n\r\nPLOT - I believe if you watch this at x2 or x3 speed, you will not make a mistake and you won't miss out on the dialogue as well as it is over simplistic and most often repetitive. The story is virtually non-existent, it starts from nowhere and that's exactly where it finished.\\n\\n\r\nCHARACTERS - ethereal, beautiful young men -  a whole bunch of them - almost like a confectionery box, you'd want to eat them straight off the screen. And...end of topic. No proper introduction, background, development whatsoever, not even one sensible character. What you get in the end is the utterly annoying ,always whining and crying useless Yuki, sexy demon servant, a bunch of Yuki's congregation who sit in a room and discuss Yuki whenever he's not around to be worshipped and pampered by them and a few unreasonable adults. \\n\\n\r\nVAs, BGM - as someone who pays too much attention to the selected VAs I can't help but think this is but a huge wastage of talents. Big names like Sakurai Takahiro, Miki Shinichiro, Kamiya Hiroshi, Fukuyama Jun, Miyano Mamoru, Ishida Akira, just to name a few, spurting utter bullsh*t and ridiculous spells confused me, should I feel good for hearing their voices or feel bad for them having to say something so gross. Overall the sound, VAs and BGM were satisfying, aside for being a waste on this show.\\n\\n\r\nThere is a lot more to be said about this show but I think I've already given it a fair share of beating so I will conclude this with a piece of advice that I learned the hard way... \\n\r\nIf you've dropped an anime for being too *insert what you feel* (I'd go with *cheesy* ) once before, do not make the mistake to give it a chance later on, it will only make you suffer. I had dropped Uragiri after 2 episodes but after realising years later it was a shounen-ai I thought I can sacrifice 24 episodes of my lifetime if I can at least see some pretty boys kissing. I knew it will be bad but the damage I caused to myself will last for a while...",
            "date": "2016-11-25T15:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 234381,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/26235.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Enjyu",
                "username": "Enjyu"
            },
            "url": "https://myanimelist.net/reviews.php?id=234381"
        },
        {
            "content": "Uragiri wa Boku no Namae wo Shitteriu (what a mouthful ^_^) translating to Betrayal Knows My Name is one of those hit or miss anime. Some people absolutely love it while others could seriously care less. To be honest, I lean more to the latter group but there were still a few good points about the series that are still worth the mention. \r\nNow for a spoiler free review\r\nPlot(7/10)- The plot is one of those honorable mentions. It follows the story of Sakurai Yuki who grew up in an orphanage with no memory of his past. While that part is a bit clichéd, we soonlearn that Yuki posses the power to feel others emotions and meets others who posses unique abilities. Yuki is thrown into a supernatural world where he fights to protect those he cares for while also discovering the secrets of his past. Now, if you enjoy action, Uraboku definitely has its fill of great fight scenes. It has some sword fights but is also a great balance of magic so one doesn't overshadow the other. Another great aspect of the plot is the back story they give the characters, which gives a better understanding of where the characters are coming from. While there are still some plot holes and details that don't make total sense, the plot keeps you on your toes and has moments that really build up that suspense. \\n\\n\r\nSound(8/10)- Another great part of the series, the OST's are the kind you'll add and put on repeat on your playlist. Music can be a key role in turning a scene into something cheesy and something epic and the music in Uraboku definitely did the latter. \\n\\n\r\nCharacters(5/10)- This is where we see some of Uraboku's weak points, starting with the characters of the show. While the plot was cool and the music was great, Yuki was SO annoying. It's hard to enjoy a show when you want to slap the protagonist right in the face for being too weak, too stupid, or just plain irritating. Yuki was the type of character that hates seeing other people get hurt but is so darn weak himself that he can't do ANYTHING but run off and get himself into danger, making everybody else came and save his sorry but.  Most of the other characters are pretty typical; another tsundere, another yandere,  more bishounen. The only character that stuck out was Luka Crosszeria who was easily the coolest guy in the show. He's got looks, he's got power and he's a demon. Yeah, I know, he's pretty awesome. And those plot holes I mentioned before? Luka's story is one of them. From watching the show, you can figure certain things out about his past but they never really bother explaining it which is a real let down since he's the guy you look forward to seeing the most on screen.\\n\\n\r\nArt(6 or 7/10)- The art was fine, there wasn't anything too special about it. The only kind of strange thing is that everyone has REALLY pointy chins, sometimes to the point where it turns a supposedly attractive shot of a character into something laughable. \\n\\n\r\nOverall- Like said, Uraboku is a hit or miss. The plot and music were cool but there's a lot of information they give you that doesn't add up. Not to mention, the ending was SO terrible. Honestly one of the weakest endings I've seen in a series. They build this plot up and they basically leave it hanging, its not even one of those \"open ended\" endings where you can determine what happens next yourself. It's just.... eh. One more thing, that maybe only I found annoying, was the number of times where everything happened \"in the nick of time.\" There's no accidents or cool twists; Yuki is always going to be saved because people come right when something disastrously cool is about to happen. You honestly begin to expect Luka to show up to deflect that sword being swung at Yuki or for him to grab Yuki before he falls. It's.... really irritating. So...\\n\\n\r\nPros- Music, interesting plot with great battles, Luka!\\n\r\nCons- Typical characters with unlikeable protagonist, confusing details and plot holes, and that dumb ending  \\n",
            "date": "2014-01-10T09:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 128171,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3394979.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/globaldictator9",
                "username": "globaldictator9"
            },
            "url": "https://myanimelist.net/reviews.php?id=128171"
        },
        {
            "content": "A really good animé,\r\nwish it was more then 24 eps\r\nmaby a season 2 maby?\r\nhaha\r\nWell Zess/Luka cought my eye right away.\r\nand the characters looks really real and trust worthy.\r\ni wish for a season 2",
            "date": "2010-09-13T07:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 30458,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/376829.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Jeshica",
                "username": "Jeshica"
            },
            "url": "https://myanimelist.net/reviews.php?id=30458"
        },
        {
            "content": "I started watching this because I am on a binge watching anime with Sakurai Takahiro in a leading role.  I know the Odagiri Hotaru, mangaka (though have not read the manga on which this anime is based), so I was expecting bishounen central, and lots of bromance, and that's what I got.  There's even a story, but alas, for 24 episodes, not enough of it, and especially not enough progress.\r\nI've got another 6 episodes to go, and I won't store this review until I am done, but at the moment I am just SO FED UP with the central character Yuki, who isthe ultimate Mary Sue because everybody just loooooves him, even people who start out disliking him.  He has this tragic back story, which unfortunately he doesn't remember a bit of, he's part of a star-crossed pair of lovers (he was female in his past life), which unfortunately he doesn't remember, his former lover Luka (tall, dark, handsome, laconic, and mysterious) protects him at any cost, with frequent declarations of \"I will always be by your side\", and \"I will never betray you\", and Yuki shows about as much interest in that as he shows in the temperature of his tea.  Instead he goes on and on about Kanata, his childhood friend, and that sort of turns into a fiasco.  This isn't even a proper love triangle, because Yuki is densely oblivious of Luka's feelings, and one can't rightly say that he is in love with Kanata either; he's got all the passion of a desiccated kumquat.  Speaking of fiasco, Yuki is a walking one.  He knows he is in danger and everyone is doing their best to protect him, and he's always very polite and apologetic about it -- and then he goes off on his own without a care that this will put others in greater danger.  He is supposed to be their \"god of light\", but he is really spectacularly selfish underneath his supposed altruism.\\n\\n\r\nI hate him.  It's not gonna happen, but I hope he dies.  Too bad that if he dies he'll probably just get reincarnated anyway, so what's the use. ...Episode 22 -- I am ready to do the killing myself, I swear.  Yuki is such a twit. ...Episode 24 -- ok, they managed to make me stop wanting to kill him after all.  ;)\\n\\n\r\nStory (5/10): Some epic war for good and evil which has been raging for millennia. There's not really any rhyme or reason for it, and at this point we don't really know why this happens.  The last battle was the one in which Yuki tragically died in Luka's arms, or something like that, and we're about to have another one.  The good guys are Zweilt Guardians who fight in pairs, the bad guys are demons who come in 3 different strength flavours, mid-villains, opasts, and general class opasts (oh, yeah, the usual proclivity of mangaka to just throw random, ill-fitting Western names around; their version of weeabooism, is always good for a laugh).  The top bad guy is the demon king.  Clan Giou are the caretakers of the Zweilts, and the clan leader reincarnates them.  Most of the time during the anime there are random skirmishes between Zweilts and demons, the rest of the time is spent on introducing us to the various good guys and their back stories.  Odagiri is a BL (Boys Love) mangaka, but don't expect anything here but plausible deniability in the form of bromance, so people who don't like The Gay can watch it without being grossed out -- there is a lot of bromance though; pretty much every male/male Zweilt partnership and just about any other guy who can partner up.  I think there is one het couple here, and they're brother and sister -- very close brother and sister, uh huh.\\n\\n\r\nMy main dissatisfaction is that this is all disjointed piecemeal, never a truly cohesive work.  We don't find out enough about why Luka and Yuki are such a great love, and so I really don't care other than feel sorry for Luka that Yuki is such a drip in this reincarnation.\\n\\n\r\nArt (7/10):  Odagiri's manga art is very arabesquey and delicate, and much of it is lost in the transfer to anime, but the boys are all pretty, and the backgrounds are lush. There's some badly integrated 3D, and some really nice special FX in the battle scenes.\\n\\n\r\nSound (7/10): This anime has an astonishing star cast, so many awesome seiyuu, but somehow, while the work is competent, there are places where the dialogue kinda drags.  The BGM is quite good, lots of orchestral passages; I also like the OP, but the EDs leave me cold.\\n\\n\r\nCharacter (6/10):  There are a lot of characters here, and they all have at least some story, which is  better than most anime. Not a lot of growth, but some.  Overall it might have benefitted from fewer, but deeper characters.  I wish I had liked Yuki better, since so much centres on him, but I simply do not share the Japanese adoration for \"pure\" and \"innocent\" characters; I liked Yuki best when he actually did something to support the team instead of putting them in danger.\\n\\n\r\nI definitely feel short-changed about the most interesting characters, the ones that had aspects of good and evil within themselves, most notably Reiga. I guess I'll have to read the manga, even though that seems on long-term hiatus, so there is not much hope.\\n\\n\r\nEnjoyment (6/10):  I wasn't bored for the most part because all the different character introductions kept me interested even when nothing much was happening.  This won't even make it close to my top anime, but my time wasn't entirely wasted.\\n",
            "date": "2016-10-03T13:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 231024,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/127437.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/pleochroic",
                "username": "pleochroic"
            },
            "url": "https://myanimelist.net/reviews.php?id=231024"
        },
        {
            "content": "The story starts with an indirect promise for an exciting plot; but by the end of the 24th episode there's still left many unanswered questions for an expecting viewer. In overall the plot lacks solidity, therefore generating more and more questions along the way on Who, Why and How. Wish the character's grid were a bit more diverse on the Zweilt's part by adding more female roles to the fighting crew; anyhow the included array of characters can be regarded as a plus for the show. I honestly found the sound and specially the music of 'The betrayal knows my name' to be of greatchoice in both opening and closing credits.",
            "date": "2019-03-01T22:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 302715,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Thipin_02",
                "username": "Thipin_02"
            },
            "url": "https://myanimelist.net/reviews.php?id=302715"
        },
        {
            "content": "I will begin by saying I 100% do not understand some of the ratings this has been given. The 3s, 4s and 5s are quite absurd the ratings to give after seeing this for myself. They could easily push away potential watchers (which was almost the case for me) who would miss out on quite an amazing story.\r\nAs a synopsis has already been given, I won't go into that. I will say though that it is a classic tale of good verses evil. Only in this case the line between those two is a bit blurred and so we follow the characters of the storyas they try to figure things out while fighting to protect the ones they love and what they treasure. The story would have been a 10 for me had Yuki and Luka been fleshed out as much as the supporting characters were. But I suppose that happens better in the manga as it is an ongoing series. The supporting characters were well fleshed out which made me intensely invested in the story. Especially with the two arch enemies. Very well done.\\n\\n\r\nThe bromance and deep bonds between the various teams was quite lovely to watch. \"Otoko no yuujou\" (a deep friendship between men) is what the Japanese would call it, though to some viewers it could come across as shounen-ai.hehe I myself admittedly had some fujoshi feels here and there and I'm not even a fujoshi myself.haha But its enjoyable to watch without being over-bearing.\\n\\n\r\nMusic was on point. Really set the mood. Both OPs and EDs were also spot on. The first ED really stuck with me. It was just the right amount of goth meets tragedy meets rock. A perfect ode from Luka to Yuki. Simply hauntingly beautiful. I applaud Rayflower for their work on this anime's OST.\\n\\n\r\nCharacter designs are so beautiful I can't. Its an ikkemen fest where there was great attention to detail. And do not even get me started on Luka's eyes. So beautiful, ensnaring and intense. I lived for a close-up of those eyes!! I applaud them for their work on that. Just amazing.\\n\\n\r\nThe line-up of respected critically acclaimed award winning seiyuu on this one was enough to give a bow of respect. Almost all the greats were cast in this. And it was quite evident in the quality of voice acting that came through. They lived up to their names in every way!\\n\\n\r\nOverall it is a good anime adaptation to its manga counterpart. The story may not flesh out entirely in the anime but that is a good place to start to eventually lead you to the manga. It is engrossing, action packed, emotionally engaging and all round entertaining. It has been a while since I marathoned an anime in one fell swoop. I watched this, a 24 episode anime, in one weekend which normally I would watch slowly over the course of a month. I even forewent sleep on Friday night because I couldn't be kept away from the unfolding of all the drama. That's how gripping it was. Definitely highly recommended.",
            "date": "2015-07-26T09:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 194360,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1942700.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kazykoki",
                "username": "kazykoki"
            },
            "url": "https://myanimelist.net/reviews.php?id=194360"
        },
        {
            "content": "Uragiri wa Boku no Namae wo Shitteiru, aka \"Uraboku\" is an anime of demons and super power.\r\nAt first sight, you think it's about good vs evil. However, it's not.\r\nI'll start with good points.\r\nThe first episode is pretty promising. It makes you wonder about the story behind the characters and how the events will turn out.\r\nThe characters are drawn beautifully. The animation and the effects that appear when characters cast spells or use super powers are good as well.\r\nBut other than those, this anime has nothing to show.\r\nSo here are the bad points:\r\nHowever good the first episode seems, the rest is actually boring. Nothing changes ordevelops. If you just wanna know how it ends, you can just watch first and last two episodes.\\n\r\nYou don't really understand anything. No answers are given to the \"Why / How / What / etc\" questions. You also don't get to see the past much so many things make no sense.\\n\r\nEvery character worries about Yuki way too much. They literally do nothing, but just worry.\\n\r\nYuki doesn't do anything either. He always wants to protect others but he has no idea how to do so. \\n\\n\r\nIts basically a bunch of bishounen running around their \"center\", Yuki. No logical talks, no epic fights, or anything else. Nothing actually happens. You just get to watch beautiful faces.",
            "date": "2015-02-16T05:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 180522,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4469714.jpg",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Koibotaru",
                "username": "Koibotaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=180522"
        },
        {
            "content": "I actually enjoyed this anime. Besides the uber gorgeous boys, the story hinted on a lot of different subjects. Honestly, if you're one of those hard core boy loving girls/guys, this is the anime for you. The art is very well done, and you won't be disappointed!\r\nA downpoint of the anime is that not every one looks into the deeper meanings of the story line. I guess it's hard to see that if you're blinded by the art and overall characterization of the characters. Unless you take a close looks at the subjects being touched, it's hard to like this anime without thinking it's justanother normal 'good looking guys' blah blah blah.\\n\\n\r\nA few key things that this story touches on: racism, unconditional love, tradition, etc\\n\\n\r\nI'm not going to explain when and where, because I'll be spoiling it for you guys...but if you pay really close attention, you'll see the above subjects covered in the story.\\n\\n\\n\r\nOther than the main character literally being a 'god' to everybody in the story, I really liked this!",
            "date": "2011-11-09T02:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 47135,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/inspirations",
                "username": "inspirations"
            },
            "url": "https://myanimelist.net/reviews.php?id=47135"
        },
        {
            "content": "Story: 10 \r\nI mostly admire that the characters are easy to relate to. And I know it's basically just a romance in the middle of a large battle. But the story does have a lot of potential, so I hope that they make a second season to tie everything together. It's also interesting that the beginning was sort of like Twitches. Yuki is finding out about his powers while secretly being watched, not knowing that someone else (Kanata, my spelling could be wrong) is doing the same thing. \r\nArt: 10 \r\nThe art is the best that I've ever seen done, besides Rokka no Yuusha. Thegraphics are realistic, except for the wind blowing their hair around. I've never seen hair in the wind swaying in a perfect line. \\n\r\nThe sound is good too, I can't really go into detail about it though. \\n\\n\r\nCharacter: 10\\n\r\nAll of the characters have believable pasts and are relatable. I noticed that a lot of people get mad at Yuki because he mainly stands there during battles but technically, his powers weren't fully released or easy for him to control. \\n\\n\r\nOverall, I think this is a great anime so I'll probably watch it again and possibly the second season, but I'll probably just end up reading the manga.",
            "date": "2016-01-25T06:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 209345,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4803863.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KittensRule98",
                "username": "KittensRule98"
            },
            "url": "https://myanimelist.net/reviews.php?id=209345"
        },
        {
            "content": "Yuki, a young boy who suddenly finds himself in a world full of danger, love and hate. He is the reason for the zweilts. The zweilts are guardians who are supposed to help Yuki in his quest to prevent the end of humankind. \r\nHe lived in an orphanage sincehe was just a baby, so he has no idea who his parents are. Always he has felt unwanted. Then something changed. One day he felt he started to change. It was like he couldn't touch people without snooping into their past, and he started to notice that there was something else that was really strange. Therewas somekiind of power he never could have dreamt of. \\n\r\nThen Takashiro came along and claimed to be Yuki's brother on his father's side, and that he had been looking for him for a long time. Now, Yuki's life was changed forewer. But it was already after a meeting with a handsome man who had saved his life. Zess(also known as Luka crozzeria).\\n\r\nThis was the start of a new and different life for Yuki. Everywhere he turned there were people he could len on. People who needed him. And he was going to fight by ther side in the fight against Yuki's childhood friend whos turned out to be the reincarnation of Reiga, who once was a very good friend of Takashiro, but he had lost faith in humankind until he met Yuki.\\n\r\nThe events in this animé is fantastic and so full of spirit. It's labled Shounen Ai, but clearly, all it does is giving you hints. There are no actually scenes of boys kissing, so even though you're not a fan of Shounen Ai, you can watch this and still be safe\\n",
            "date": "2010-11-10T15:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 31974,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/398284.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Yukia92",
                "username": "Yukia92"
            },
            "url": "https://myanimelist.net/reviews.php?id=31974"
        },
        {
            "content": "The only problems with this anime is the story is not brilliant - i think it could of been a really good anime, but some parts got a little bit annoying as they main character, Yuki keeps fainting and his whole character appearence and his approach on things could of been better. There are also few funny parts in this anime. \r\nBut the art is amazing, the anime is full of gorgeous guys and a couple of girls as well, and i still watched it from start to finish even though the story was not as good as it could of been. The characters themselves(not including the main character Yuki) i really love, they all have there individual personallities and they have little flashbacks on how each of them met their \"partner\"\\n\\n\r\nIn conclusion - I think it is a good anime to watch, but i don't think i will be watching it again.",
            "date": "2011-07-03T12:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 38627,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/464586.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/sophofcourse",
                "username": "sophofcourse"
            },
            "url": "https://myanimelist.net/reviews.php?id=38627"
        },
        {
            "content": "As stated by everyone else, yes this is very cliche but a cliche anime does not make it a bad anime in some cases.  \r\nThe story is not very original at all, but it is still enjoyable for the most part. Very innocent and sweet uke type character,caught in the the middle of what appears to be a triangle.\r\nThe art is outstanding, very colorful and pretty detailed at most parts. And as a fujoshi it would be out of character for me not to say that all the men are hot. even the ones who have nothing to little to do with the storywere hot :3 Yeah this is my type of anime (yeah, shallow I know). Ok the one thing I DID NOT like was sometimes....their chins are SUPER pointy, and it looks dangerous.\\n\\n\r\nThe sound was ok, I like the ending theme but don't care much for the opening. And the BGM is decent.\\n\\n\r\nOK the characters are VERY cliche, you got your innocent uke type, your stoic and bad boy seme type, who is really nice to only the uke. You have your loudmouth hotheaded blonde guy and his lifelong friend who is the only one who can handle him, and of course your \"flamboyant\" guy that always has a gimmick, in this case he wears hats all the time. Oh and don't forget the cute \"pikachu\" type animal companion with a very suggestive sounding name.....sodom. Doesn't bother me though, their all hot so its ok.\\n\\n\r\nI do find myself looking forward to sundays when this anime is usually released dubbed so I suppose you can say that overall I do enjoy it.  If you are like me, and pretty much find the good in (almost) any anime and enjoy looking at hot men then this is the anime for you. Cliche yes, but very good anime so far!",
            "date": "2010-06-20T20:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 27397,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/117510.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ProudFujoshi",
                "username": "ProudFujoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=27397"
        },
        {
            "content": "To be honest the only reason I watched this was because I saw it and I was bored and maybe because of the art style lmao.\r\nThis really has barely any plot, though I do like shipping Yuki with all the guys tho, I mean i am a fujoshi, but it really had nothing else, I would only squeal at the 'yaoi-ish' parts and that would be it, this series had really no point I just really liked Luka and the other guys, I did hope for a yaoi scene and it kinda disappointed me when I found out that Yuki used to be a girllmao. I'd recommend it if you like good art style along with fangirling about something that would never happen.",
            "date": "2016-03-01T23:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 212077,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5111292.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/InnocentFujoshi",
                "username": "InnocentFujoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=212077"
        },
        {
            "content": "This anime is very a shoujo combination of Kuroshitsuji and Angel Sanctuary.\r\nGotta say, IF you are a shoujo genre fangirl, then this would probably get a 9. I don't mean it in a bad way, I am quite happy with it too. That's why i gave it an overall 7 (good): i do enjoy cheap dramas at times and i definitely love guys BUT my no. 10 shoujo anime is much better. so keep in mind that I gave it this 7 as within the shoujo genre.\r\nI'll start with why I needed to see this and why I absolutely loved it. This series right hereis a combination of all anime male awesomeness: both characters and seiys.I can't help but guess they intentionally picked this cast to catch on all the fangirls everywhere. So let me introduce you:\\n\\n\r\nLuka - main character with yumm Sebastian Michaelis look alike. And a demon too. Voiced by none other than Takahura Sakurai. While you may not be familiar with names, I'm sure you watched D.Gray-Man and you know who Kanda is. And you definitely remember his voice. If you don't know Kanda though, you must know Suzaku from Code Geass. YES!!! that one helluva voice.\\n\\n\r\nOkay. So we have a Sebastian Michaelis (Korushitsuji) guy without the voice of actual Sebastian. But no worries, his seiyu is here too: Daisuke Ono voicing Hotsuma. Haaaa. Really. I feel like I can just die happy now for I have heard everything i needed to in this life. \\n\\n\r\nAs I was saying, everything about the cast is carefully put together so that the girls would love it. I've never watched another show with so many gorgeous guys. \\n\\n\r\nAnd shounen-ai. Damn... I was so close! And from now on I'm gonna start whining. Someone misled me into thinking this actualli didn't have shounen-ai. I like shounen ai. But with Daisuke Ono and Akahura Sakurai?! Those merciless creators... Still, I have to say this anime exceeded my expectations from a shoujo shounen-ai one.\\n\\n\r\nThe story. I think it's beautiful. Not original, but still touching for my fangirl little heart. Yuki, the main character, in love with Luka, a demon, dies and reborns into the body of the least appealing bishounen in the anime.  Yuki the guy ruins the show for me. His voice is horrible and his way to be is useless. He's  that kind of \"I have no power except healing and understanding of others feelings but IM A MAN\" who ends up shouting \"nooo don;t kill our worst enemy because he was my friend\" and everybody listens to him because he was a great woman in his past life. Luka is still around, protecting him. And as I was saying this show is worth watching for Luka and Hotsuma alone. \\n\\n\r\nThe anime starts slow with a boring but dramatic introduction to the present. Every episode starts in an epic flashback or more like a vision featuring Luka and Yuki as woman naked. Hooray for the fanservice that even it was so damn repetitive I watched it every time. Eventually further in some decent fighting arcs start, which are quite okay paced for a shoujo anime. I mean I have seen a lot of worse fighting scenes in animes that overall were better than this one. It never hurt any girl's heart to see some blood and suffering. I just wish Yuki would disappear. \\n\\n\\n",
            "date": "2011-12-13T19:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 49121,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/931957.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Morridine",
                "username": "Morridine"
            },
            "url": "https://myanimelist.net/reviews.php?id=49121"
        },
        {
            "content": "People may be complaining about \"lack of originality\" of this story but Uraboku delivers something that other stories don't: strong passion. It's a very passionate story and makes stories like \"Angel Sanctuary\" or \"X\" shrinks ashamed. Uraboku is recommended for those who enjoy a well made shounen-ai, for sure. It won't disappoint you.\r\nThe art is also really beautiful.",
            "date": "2010-06-10T14:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 27015,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/222921.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/daniyagami",
                "username": "daniyagami"
            },
            "url": "https://myanimelist.net/reviews.php?id=27015"
        },
        {
            "content": "This review is completely based on the anime.\r\nSo what can i say about Uraboku, quite a lot in fact. The anime reeks potential which is sadly wasted for tons of what we can probably qualify as \"Yuki Worship\". what was literally hours of wasted screen time, was spent with the characters sitting in a room wondering if Yuki was alright or how he was doing. Story-wise well.... the story isnt bad but it isnt developed enough, literally the anime has you waiting until you reach more that half the episodes in before you get a hint of what's going on and even after the animehas ended all i can really tell bout the story is that everyone of the Zealots has been reincarnated several times to fight a seemingly endless war. That's it. The art is great so i guess that's 1 redeeming factor but the opening and ending themes aren't even memorable. The characters themselves are poorly developed and little info is given about them, a few backstories, tops. Personally the biggest issue with the anime is definitely the action scenes. They weren't bad, actually they were the opposite but they too few and too late therefore personally i think most of the wasted potential comes from those. By the time you actually get to the good action scenes, your so loaded up on hours of \"Yuki Worship\" and potential yaoi scenes that the action loses a lot of the effect and there isnt enough to make you say,\" well maybe this show isnt as bad as it first seemed\", because you know why? It is because by the time you start looking forward to the next episode hoping you get to see more action or more story development at least, your done and your asking yourself, \" so wtf with all the new characters at the end, and wtf does it all add up to.\" Questions like that to give a couple. Maybe i went off on a tangent somewhere but basically, the anime wasted its potential and by the you actually start to enjoy it, your done and more than half the questions asked in the anime are unanswered. so overall i can only give it 4 outta 10 mostly cause of the great art and for the few well done action scenes",
            "date": "2012-09-17T08:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 72555,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/540025.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zack21111994",
                "username": "Zack21111994"
            },
            "url": "https://myanimelist.net/reviews.php?id=72555"
        },
        {
            "content": "This might be my favorite anime series ever.  If you're a fan of bishounen and light shonen ai, you will probably love this series!  It has some of the most beautiful animation I've ever seen - Amazing!  I like the main core of heroes - They are especially good people - One volunteers at an orphanage at which he was raised for example.  It draws you into caring about them imo.  I can understand some of the criticisms I've read by others, but I think although the story and characters are simple, and the themes and ideas are ones you'veprobably seen elsewhere previously, it's so well done that I loved it anyway!  I am sure I'll watch this one again and again!\\n\\n\r\nIf you like this one, you MIGHT also like Descendants of Darkness (more shonen ai with magic dragon battles) and Devils and Realist (another show filled with sparkly bishounen lol)",
            "date": "2015-02-02T19:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 179541,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4453546.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ancientUnicorn",
                "username": "ancientUnicorn"
            },
            "url": "https://myanimelist.net/reviews.php?id=179541"
        },
        {
            "content": "This anime have a good art in characters and surrounding. Beautifull and cool characters. And then, touching background story\r\n(I like the seiyuu in this anime too) \r\nBut, I dissapointed with the main character, Yuki. He is reincarnated as a male now but he is still act like a princess. Unmanly way of crying, and his skill in martial art in first episode is useless. \r\nThe background story is quite touching and complicated but then it turn become too much 'drama' and too much serious.\r\nI feel that this story is similiar with reverse harem anime. When one person become a center to be loved and protectedlike a princess. And I'm not excited enough with harem or reverse harem story.\\n\\n\r\nThis anime can pleased my eyes and ears but the story cannot pleased my heart\\n\r\nSo i give 9 in art and 4 for the story. enjoyment 5, overall i give 6",
            "date": "2013-03-16T09:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 89923,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/283270.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Reizsha",
                "username": "Reizsha"
            },
            "url": "https://myanimelist.net/reviews.php?id=89923"
        },
        {
            "content": "The plot may get kind of redundant, but I still enjoyed this.\r\nART AND SOUND (10/10)\r\nThe strongest point of Uraboku is definitively the art. Sceneries, clothing, and characters are flawlessly drawn and animated. The soundtrack is also very good and sets the emotional mood perfectly. \r\nCHARACTERS (9/10)\r\nI also generally liked the characters. They had interesting back stories, but they really slowed down the pace of the story.\r\nSTORY (6/10)\r\nAnd that brings us to why I'm not giving it a higher rating. The story started out really great, but after so many character introductions, it lost its track and became less about the fight with the Duras andmore about their past, feelings and 'suffering'. Yuki, who I'd initially liked for his gentle and kind personality, then became every character's obsession. Despite everyone getting their arses kicked (am I even allowed to say this in reviews? hah) whilst trying to protect this boy who didn't seem half as important to their cause as they deemed him to be, all they worried about was Yuki and how much he was suffering - to the point that they were willing to sacrifice themselves and their lifelong companions in order to keep him alive. That got old after 5 episodes or so. \\n\\n\r\nI felt like it all built up to nothing in the end, which didn't feel like an actual ending at all. I'm not sure if they plan on making this into a second season or not, but since this is based on an ongoing manga, I'm guessing the unanswered questions are explained in that. \\n\\n\r\nSomething I'd like to point out: don't be fooled - just because most of the characters are male and the genre says shounen-ai, this definitively isn't yaoi. Hell, I'm even hesitant to call it shounen-ai. The displays of affection are limited to 2 or so short cheek strokings and the only evident romance is between Luka and Yuki in his former life - when he was a girl.\\n\\n\r\nENJOYMENT/OVERALL (8/10)\\n\r\nDespite its flaws, I believe you'll enjoy this anime if you like the supernatural and action and don't mind a bit of angst. And if you're into bishies, you're in for a treat.",
            "date": "2011-12-14T06:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 49167,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/798627.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mandi92",
                "username": "mandi92"
            },
            "url": "https://myanimelist.net/reviews.php?id=49167"
        }
    ],
    [
        {
            "content": "Be warned, this review may contain /spoilers/.\r\nUragiri wa Boku no Namae wo Shitteiru, more commonly known as UraBoku for short, is a shounen-ai anime recently animated by J.C. Staff. For some reason, writing a review for this anime was hard – I actually meant to write this about a month ago. Maybe it was because of the ending, but we’ll get to that later.\r\nWe are first introduced to Sakurai Yuki, a teenage boy who lives in Asashi Orphanage, who has been having very strange dreams, but cannot remember them when he wakes up. We learn that he has several supernatural powers, including healing and beingable to read peoples’ minds and empathize with them by touching them. Yuki likes taking care of the children at the orphanage and telling them stories; one night he tells them a story about a prince and a princess who, although having never met before, somehow inherently know each other. As Yuki is leaving the children to go to bed himself, he gets a text from a boy at school, asking him to help him. Yuki, naturally, runs toward where his school is; he sees the boy, Uzuki, in the middle of the street just as the lights turn “red” (meaning there shouldn’t be anyone on the street). Afraid that Uzuki will get hurt, Yuki rushes to push him onto the sidewalk, only for Uzuki to disappear and for Yuki himself to be stuck in the middle of the street, unable to move. Just as a truck is about to run over him, a (very very very pretty) mysterious man rushes over to save him (whose name, we learn later, is Luka), which sets off the chain of events that lead into the plot. Although Yuki has never met the man before, he feels as if he does know him and has met him before, similar to the princess and the prince in his story. (Like my awfully convoluted summary of the first episode?)\\n\\n\r\nUraBoku is one of those anime that are predictable. It’s not necessarily a bad thing; but for people who know a lot about literature (or watch a lot of anime), this anime is very predictable. But, oddly enough, it’s good, although that might be my bias since I like the subject the anime covers. One of the recurring themes of the anime is reincarnation – that a person is reincarnated a number of times until their duty or goal is reached, and then some. In this case, we have the Zweilt guardians (guardians meant to protect Yuki) who are resurrected every lifetime in order to fight against the so-called “evil” Reiga and his Duras minions (Duras are basically demons). The reason the Zweilts protect Yuki is that he is their “God’s Light”; he can remove pain from them, although by doing so he transfers their pain to themselves. To that end the guardians try to become as least injured as possible to avoid harming Yuki, their Light. An interesting thing to note, while we’re still on the reincarnation subject, is that Yuki is actually supposed to be a girl. In every lifetime, Yuki was born a girl, except for this one, the “current” one – and in all the previous lifetimes, Luka and Yuki were lovers. Actually, they’re still in love – it’s very obvious. No, I’m not being hypocritical. I’m stating the truth. Every single gesture, facial expression, and scene between the two are meant to emphasize the affection and love between them, even if they don’t actually kiss or outright say, “I love you”. In the anime, there are also a couple more shounen-ai pairings (Shuusei and Hotsuma, Kuroto and Senshiro). Oh, wait, I can’t forget the Luka-Yuki-Reiga triangle.\\n\\n\r\nWith that out of the way – it’s predictable, but it’s still a good anime. The themes are covered nicely, and everything fits into place very well. Most characters’ pasts are delved deep into enough to make you interested – especially interesting is the fact that Reiga, the “evil antagonist”, was reincarnated in Yuki’s best friend, Kanata-san. (Why am I using an honorific? Because Yuki yells, “Kanata-sannn!” all the time, so it stuck. Seriously. I can’t just call him, “Kanata”.) Another interesting thing to note is that the anime has a Jewish reference – the Book of Raziel, the book that Kanata-san/Reiga carries with him near-constantly. That’s really the only thing I caught. The seiyuu and the animation were good – well, of course the animation was good; this is J.C. Staff we’re talking about. The art is wispy and pretty, very similar to Vampire Knight, although I’d definitely say UraBoku’s is better (again, possibly some bias since I was never all that interested in VK.) The only thing that I found weird was the CGI – but that doesn’t really detract from the viewing experience. The soundtrack was good too.\\n\\n\r\nI can easily say this is a good anime – except for the ending. THE ENDING. I hate the ending for this anime. Ugh, I might pick up the manga after all, because the ending was horrible. Don’t watch the ending. The last episode is great except for the ending – so don’t watch the ending unless you want to wonder what, exactly, the anime was even about. The ending manages to singlehandedly destroy and nullify any sort of reincarnation and true love aspects the series was trying to depict. Therefore, the ending does not exist. Hah! The last few minutes of the final episode have successfully been pulverized and expelled from my brain. What? The Uragiri wa Boku no Namae o Shitteiru anime ended? When?",
            "date": "2012-03-26T18:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 57063,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1178325.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 0,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/catalysst",
                "username": "catalysst"
            },
            "url": "https://myanimelist.net/reviews.php?id=57063"
        },
        {
            "content": "The main trait of Uraboku is generally considered to be its bishonen characters, but thats not all. The plot of the anime is also very awesome and the soundtracks are quite capable of moving your soul.\r\nOne of the finest master piece that sure did require a sequel but unfortunately only 24 episodes are available. Still its worth watching.\r\nA wonderful anime of supernatural action story filled with love of friends. A slice of life, that is more delicious than the tastiest cake!\r\n Hope u enjoy it as much as I did!",
            "date": "2014-04-20T06:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 140623,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3710999.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ryuichiash",
                "username": "ryuichiash"
            },
            "url": "https://myanimelist.net/reviews.php?id=140623"
        },
        {
            "content": "This is probably one of the few anime that I have rewatched a third time. Yeah, that is how much I enjoyed this.\r\nIt had great character developement and funny moments to cover the serious ones. It had a great protecting-relationships between partners that worked together. \r\nThe drawing was also great and action scenes were drawn beautifully.\r\nSO if you are wondering if this anime is for you, check the below list that includes what I think of this anime:\r\n1. Action\r\n2. Great Drawing\r\n3. Male Main Character\r\n4. Mostly Male Cast\r\n5. Female are not squeaky or weak/pathetic\r\n6. Great twists\r\n7. No Harem/Ecchi/Reverse Harem/ etc\r\nGive it a try then. It isreally enjoyable and entertaining. I mean, it has beautifully drawn bishounens ! Grins",
            "date": "2016-07-31T20:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 225570,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5337921.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kadrian",
                "username": "Kadrian"
            },
            "url": "https://myanimelist.net/reviews.php?id=225570"
        },
        {
            "content": "Uraboku is simply one of those manga to anime adaptations that started with a lot of potential, every episode revealed more of the main story until the end of the series was near and instead of resolving the plot, new characters start to appear (only two of them were somewhat important), and more questions are left unanswered. Furthermore, what appears to be the \"final battle\" that could either end as a reset (let's all reincarnate again and continue the endless 1000-year fight) or a resolution, actually ended as \"let's leave things in suspense, continue our ordinary lives and wait to resume the battle\". This couldall be understandable, seeing as the manga is still being published and the anime was slated for two cours (24 episodes), and has been done before with nicer story flow, unlike what happened in the last episodes of this series. It could also be that Natsuko Takahashi (series scriptwriter) repeated her Spiral strategy.\\n\\n\r\nAnimation wise, J.C. Staff's A-Team was superb as usual, huge amount of details in backgrounds and characters, nicely animated fight scenes (although the CG was somewhat weird and sometimes out of place) and a very good quality overall.\\n\\n\r\nIn regards to the Music department, soundtrack wise was so-so, OP1 and ED1 themes were good and enjoyable, but OP2 an ED2 were decent at best.\\n\\n\r\nOverall I think if the series had been produced after finishing the manga, with 52 episodes, and with an intention of explaining more accurately what happened in previous battles/lifes, and resolving the ultimate battle, it could have been a lot better; hence, I'll give it a 7/10 instead of a 6 or 5 because the animation was great and so were the first 16 episodes.",
            "date": "2012-08-14T19:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 69783,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/21318.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Shido_Tatsuhiko",
                "username": "Shido_Tatsuhiko"
            },
            "url": "https://myanimelist.net/reviews.php?id=69783"
        },
        {
            "content": "heh its really great. but the anime ended before the manga, and doesnt really do it justice. honestly, read the manga before you watch. way more happens :)",
            "date": "2014-01-17T22:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 129159,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3320657.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/throwitallawayx2",
                "username": "throwitallawayx2"
            },
            "url": "https://myanimelist.net/reviews.php?id=129159"
        },
        {
            "content": "Story:\r\nBasically the story is about and orphan named Yuki who has live there for pretty much his entire life. He is loved by the children of the orphanage. Suddenly strange things start happening to Yuki. He is later on saved by a man name Luka also ( named Zess ). \r\nArt:\r\nMost of the art is good but sometimes is feel like they had rushed the art. And did\r\nnot make a good effort on the anime.\r\nSound: \r\nThere are times during the anime that i could not comprehend the characters voices mabey it's just my earphone but that happened often.\r\nCharacter:\r\nIn my opinion the characters were okay attimes they didn't look like the actual character but i was just happy to be watching.\\n\\n\r\nEnjoyment:\\n\r\nThis anime is a super duper soft Shounen-ai which means both characters ( Both are guys ) show that they have affection for one another. But just when    it looks like the are about to kiss someone interrupts ! Which is incredibly annoying... \\n\\n\r\nOverall:\\n\r\nI give this anime an 8 because this anime keeps you wondering what's going to happen next? Or are they finally going to kiss? Also it has plenty of action and epic moments for all those action anime fans but it also have a romantic side which I got to say its my favorite parts out of the entire anime. And i admit that there were times that i almost felt like crying. Enjoy!^^",
            "date": "2012-08-15T00:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 69801,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1081527.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kurena",
                "username": "Kurena"
            },
            "url": "https://myanimelist.net/reviews.php?id=69801"
        },
        {
            "content": "Uraboku is a great anime about friendship, love, betrayal, trust and teamwork.\r\nThe story features a deep, emotional plot and well-conceived characters with their own past and problems. You can absolutely feel their pain and empathize with all of them. The voice actors did a nice job on the show, too.\r\nIn my opinion the ending seems a bit loveless and abrupt, though. If you want to know how the story continues you should really read the manga.\r\nOverall it's still great fun to watch for everyone who likes themes like adventure, dark fantasy, friendship and a touch of shounen ai :)",
            "date": "2012-10-28T08:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 76103,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1692829.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KamiNoHikari",
                "username": "KamiNoHikari"
            },
            "url": "https://myanimelist.net/reviews.php?id=76103"
        },
        {
            "content": "Well I really liked some characters, and one of my favorite character is from this anime - Luka, BUT anime overall wasn't as good as I would want. There are no action in story at all, each series till the final battle just introduce you with characters and than tadaam the final battle.Storyline progress very slow and if not sentimental and romantic beauty, I would fall asleep. Well main character Yuki really pisses me off how good and positive he is and all the dialogs remind of some religious brainwashing. Still overall it wasn't bad. Also I enjoyed gothic atmosphere in soundtrack and Luka isjust hot, thats it :D",
            "date": "2010-09-25T15:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 30797,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/385796.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/jeeny-chan",
                "username": "jeeny-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=30797"
        },
        {
            "content": "Uragiri wa boku etc? More like Watering the Homolust: Reincarnation Boogaloo. Obvious flaws aside (What was that weird hair animation flaw that happened almost once an episode?), this show did what it was suppose to do for its target audience very well. It rocked an all star (male...) voice cast, good sound track, and as far as guilty pleasure shows go, this was at least two helpings of cheesecake (see what I did there?). The ending was really predictable, if a show doesn't have a real resolution by minute 8 of episode 24 you know it's just going to roll off with a happy charactermontage and a plea that enough DVDs sell to finance a second season, regardless of whether there is enough source material.\\n\\n\r\nSpeaking of, I wonder if I had read the manga I wouldn't have found all the non japanese names to be REALLY stupid.",
            "date": "2011-04-02T14:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 35589,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/106923.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/noetma",
                "username": "noetma"
            },
            "url": "https://myanimelist.net/reviews.php?id=35589"
        },
        {
            "content": "Sakurai Yuki is a teenager with a mysterious power. He was abandoned at birth near the Asahi orphanage. Because of that event, Yuki strives for independence. He hates being a burden to anyone near him, but at the same time, he is afraid of being left alone. Moreover, ever since he can remember, he has had a strange ability that when he touches others, he can feel their emotion. Unable to control it, he's often made insensitive blunders in the past. He later meets a mysterious yet beautiful stranger who saves his life, but for some reason he feels like he's met before. While deathlooms and his ability gets stronger and stronger, a man who claims to be his older brother suddenly appears. What will Yuki do when he learns the truth?\\n\\n\r\nMy thoughts:\\n\r\nThis anime was really good. I love the character Zess (Luka), handsome, mysterious and badass! The story revolves around Yuki, a young man with a power he has no idea he has. But when it begins manifesting, others are drawn to him and want to kill him. Enter Zess, Yuki's protector along with a host of other guardians that will help him control his power. Although subbed, I could follow the story, which is good, and the animation is of good quality. I to recommend this one.",
            "date": "2017-11-16T20:51:00+00:00",
            "helpful_count": 0,
            "mal_id": 263368,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39430.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DarkRavie",
                "username": "DarkRavie"
            },
            "url": "https://myanimelist.net/reviews.php?id=263368"
        },
        {
            "content": "I absolutly loved it a lot of people say bad things over it like there a a lot of the familiar things in it yes they are\r\nBut when you listen to music and and you listen to 1 genre then you got the same so it's not like a copied anime \r\nit's realy nice and you can learn things from the characters.\r\nIt's a realy nice anime however you have to like the genre otherwise you won't enjoy it",
            "date": "2013-02-07T08:43:00+00:00",
            "helpful_count": 0,
            "mal_id": 86141,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vanamo",
                "username": "Vanamo"
            },
            "url": "https://myanimelist.net/reviews.php?id=86141"
        },
        {
            "content": "Es el anime más malo que he visto en AÑOS.\r\nTanto que me ha hecho escribir esta review: patética en cuanto a argumento, animación cutre, sonido levemente aceptable y patética en general.\r\n¿Es que ni el final va a valer la pena?",
            "date": "2010-09-14T14:15:00+00:00",
            "helpful_count": 0,
            "mal_id": 30487,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/141803.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/YingSu",
                "username": "YingSu"
            },
            "url": "https://myanimelist.net/reviews.php?id=30487"
        },
        {
            "content": "At first it's not so interesting because their just starting to introduce the characters. Also, it is quite confusing in the beginning. However, as the story continues you start to understand it and it becomes quite addicting to watch. If you only want to watch this for boy love... don't. It's not filled with romance but at times there are cute parts.",
            "date": "2013-05-23T15:33:00+00:00",
            "helpful_count": 0,
            "mal_id": 98155,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1475167.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/swimingswiming2",
                "username": "swimingswiming2"
            },
            "url": "https://myanimelist.net/reviews.php?id=98155"
        }
    ]
]