[
    [
        {
            "content": "If you're here you've probably watched first season. And you're interested if it's worth watching another. \r\nRegardless of this review I think you WILL watch this, because nobody watches 1st season of Fate/Kaleid to the end and doesn't watch 2nd. Just, nobody.\r\nStill, you want to know how good it will be before watching. Let me tell you straight, it's much better than season 1. 2 Wei is literally twice as good as first. \r\nWhile half-a-joke (you'll get joke after 1 episode) it's really much better. It was like - \"I just came to see some more cute girls doing cute stuff and HOLY S**T THATBATTLE FUCKING AWESOME.... wait is she... OH MY GOD THAT SCENE WAS AWESOMe!!! and than more cute stuff and than HOLY F**K WHAT IS SHE DOING HERE!! MY GOD DON'T TELL... OH MY GOD WHAT A FUCKING AWESOME BATTLE!!!!!!! THIS IS THE BEST ANIME EVER!!!\"\\n\\n\r\nWell, of course it's not THAT great really but admit it... you were here just to see some cute lolies and you actually got more than a \"decent\" anime. The quality was priceless!! The art was so gorgeous that I was going to give this 10/10 even if it didn't have a good story/characters. (It still delivered quite a story btw)\\n\r\nTt's like, my 2nd favorite anime in fate/series (1st being zero). This was much better than what I expected. I got what I wanted and even more.\\n\\n\r\nSo yea.. pretty much that. I doubt that you're reading this and you're not a fate/fan. And I assure you that watching Fate/Kaleid is time spent best.",
            "date": "2014-09-10T13:59:00+00:00",
            "helpful_count": 103,
            "mal_id": 159827,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/68654.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Aklama",
                "username": "Aklama"
            },
            "url": "https://myanimelist.net/reviews.php?id=159827"
        },
        {
            "content": "Is it fate that Illya became a magical girl? Maybe. Was it destiny that set forth events that led her to meet Miyu? Maybe. And did Illya always wonder if there was another side of her that existed? Probably not. Oh wait, you’re probably wondering who or what that ‘other side of her’ is. No worries though because in this spinoff of the Fate universe, anything is possible.\r\nServing as a spinoff of the popular Fate/Stay Night franchise, Fate/Kaleid returns for a sequel once again to adapt the manga of the same name. Like season 1, it consists of 10 episodes of magical girl fun. The‘fun’ here is probably not emphasized for Illya’s case though. Rather, it’s mostly for the fans. This is because Illya’s life turns out to be anything but fun after one day when she discovers that she has an alter ego, known as Kuroe von Einzbern; or Kuro for short. \\n\\n\r\nFirst things out of the way: you must familiarize with the first season and at least parts of the Fate universe. The pilot episode of the sequel only briefly recaps the events of the first season and assumes that viewers already have an established knowledge of the series. And indeed, the sequel blasts off with some yuri-undertones. Similar to season 1, the sequel also has a lighthearted mood taking place in an alternate universe of the Fate franchise. The story and premise is fairly straightforward however. In fact, we already know that Illya has captured the class cards that serves as template for servants from Fate/stay night. So what’s next? The answer to that is a young girl named Kuro. Emerging in the aftermath of the card captures, she becomes a pivotal plot focus in the second season as she is both a hindrance and threat to Illya’s life. But to say the least, she is also a bit mysterious. Taking at first glance, she looks almost identical to Illya except for her more tanned skin. This becomes a reoccurring joke throughout the season as Illya’s classmates, family, and even Shiro confuses between the two. It also becomes a problem as Kuro seemingly dislikes the prevalence of two Illyas. As standard and cliché as it sounds, there is the instance where one tries to get rid of the other for good so they could become the dominant entity. This plays on and off through the course of the first half as Kuro serves as the “evil twin” factor. Although she does have some malevolent intentions, it’s also suggested that she isn’t truly evil but rather wants to establish her presence in their world.\\n\\n\r\nBy “presence”, Kuro really does take the cake when it comes to commanding attention. The season has her running around like an ‘evil twin’ causing embarrassment for her classmates. The problem is that others initially believes it is Illya doing the deed. And to do that, the preposterously hyperactive girl mischievously plays the role of a trickster with her mana-draining. Perhaps the more suitable term for this would be ‘kissing’. If you thought season 1 had yuri-undertones, then season 2 will really accelerate that engine. This season’s yuri-tones skyrockets through the roof as Kuro kisses countless characters. Some are left in a state of shock while others are embarrassed, perhaps scarred for life. Okay, maybe that’s an exaggeration but point aside, the show makes its point. This is all for a reason as revealed later. However, the show establishes the fact that it takes itself both seriously and not the same time. In this alternate universe, we get magical girls. In the original Fate/Stay Night, there are the servants and the masters. When you think about the two, there’s a big gap when it comes to the mood. Yet, this season somehow is able to communicate the message that Kuro has her significant role. This is justified later on in the season as Kuro is able to put her differences aside as they face an even bigger threat. \\n\\n\r\nThe best way to watch, understand, or appreciate Fate/Kaleid isn’t perhaps the story. It’s written in a way that ties in characters together like fate through events. As a sequel, the capturing of the class cards led to the emergence of Kuro. And from that triggered trouble with embarrassing moments at school, magical fights, and a reinforcement of character relationships. This goes back to the point of the show focusing on character relationships similar to season 1. We already know that Miyu and Illya are great friends after coming to understand each other. For Kuro though, it’s hard to understand her nature considering that she isn’t human or does she have any true friends. That’s all in the beginning anyways since she feels she isn’t being accepted in their world. She seeks acceptance in her own ways while causing collateral damage. Taking for granted, Kuro does seem to want to be normal in a way. Her experiences at school and at home are precious to her as Kuro wants to remember them like a treasure. So in a way, Kuro and Illya are also similar despite their opposite personalities. Rather than being an evil twin, one could interpret Kuro as someone Ilya could familiarize through her role as magical girl. \\n\\n\r\nThe battle scenes are attractive for most parts but fall short of the epic category. This is perhaps undermined by the silliness of the show’s gimmicks and yuri shenanigans. Taken that aside, the show’s battle can be fluid and meaningful with an appealing OST. Kuro, wearing a modified version of Archer’s battle outfit, stands out as a warrior. In this realm of magic and normality, you get a balance of the two: the typical school life of Illya and her role as a magical girl. Color me surprised but the show can be unexpectingly charming with its goofiness. However, this also falls apart when it overrides itself with fan service. While the first season has parts of this, the sequel heavily adapts more of its ecchi fan service such as with the bath scenes and yuri kisses. The diehard comedy over exaggerates itself in untimely manners that can be repetitive and frustrating to watch. To sum it up, Fate/Kaleid’s brainless comedy is like a hammer that hits the nail to a viewer’s patience. The will to enjoy it may feel like a holy shell of the original Fate series. Thankfully though, at least it matches consistency by standards of adaptation. In retrospect though, expectations coming into the show should be more summed as with fun and entertainment. Otherwise, the whole season may feel like a mishmash of inconvenience.\\n\\n\r\nSilver Link adapts the visual qualities. Similarly, there’s not much change when it comes with animation style. Illya’s character design hasn’t matured more than a day while the other characters remain generally the same. Perhaps Kuro is the main attraction with her outfit and similar appearance to Illya; a modified version of Archer with some mischievous eyes and tanned skin. Otherwise, the season is saturated with fan service like pouring ketchup on top of hotdogs. In the end, it ends up being soggy and stale when the flavor overtakes it what tries to set up. Expect controversial camera angles and skin being blown out of the water literally as it tries to “appeal” to the audience. On the other hand, there are some creativeness such as Miya’s battle outfit and other fighting gear/spells.\\n\\n\r\nSoundtrack is decent and comes to serve as a supplement for this adaptation. It’s neither glorifying nor terrible. However, what the soundtrack does is enhance the experience for Fate fans. The modified OST for Kuro’s theme and lighthearted background soundtrack gives its meaning for this spinoff. However, most of the character voices sound childish and a sting to the ears. I have to give praise once again to Kuro as the breakout star in this season for her mischievous voice mannerisms. Her personality and voice matches perfectly with her role. Some credibility of praise can also be given to the OP and ED songs with their appeals. It’s nothing special in the end though since most of it is still covered with generic attributes. Fate/Kaleid may be a show about magical girls but there’s nothing magically speculating when it comes to its soundtrack.\\n\\n\r\nThere aren’t a whole lot of surprises in Fate/Kaleid. The predictable storyline and generic style may leave viewers wonder why they will follow this sequel. But do know this: the show itself isn’t met to be taken too seriously at heart except when the story really gets going. After all, it’s a more lighthearted spinoff for fans of the Fate universe. Even if you’re not a fan, there are characters that can be enjoyable to watch for their roles. However, do be aware of the repetitive comedy, bland dialogues, and a premise that is messy with inappropriate mash-up. The show is more dedicated to what fans may want to expect to see how Illya’s life expands from where it developed as her being a magic world. I wouldn’t say it’s just fate though because the show still integrates life and fiction into the mix. \\n",
            "date": "2014-09-10T10:06:00+00:00",
            "helpful_count": 49,
            "mal_id": 159811,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=159811"
        },
        {
            "content": "Considering you're reading this you've propably already watched the first season  or at least read its plot so lets make things clear: Everything that was good about the first season is here upgraded!\r\nIf you haven't watched the first season go watch it. To get some basics down it's a magical girls spinoff of the fate series, which ended up surprisingly good (in my opinion it actually surpasses stay night by far and perhaps zero too... I mean they didn't have a Saber Termiantor Vorhees who shoots Getsuga Tenshous while wearing 50kg plate armor in them.)\r\nContinuing where the first story left off (warning: spoilers), all7 hero spirits have been sealed and the disturbances seem to have ended. Illya's alter personality however (the form she had taken when using archer's powers against saber) suddenly becomes seperated from her (imagine someone like Illya only with black skin, white hair and a kinda sluttier personality... And yes I do remember that Illya is 9, thanks for reminding me...). Most of the second season focuses strictly on the team's intent to make Kuro (the dark Illya) friendly with them and accepted by everyone without her trying to kill people.\\n\\n\r\nAs mentioned above everything present in the first season is here too. The show has some pretty depressing moments when it needs to and is all fun-and-games when it wants to.The balance is done pretty well,  the characters are developed perfectly (especially in Kuro's case, you start off hating her and you end up loving her), the humor is good and the fanservice holds stronger than ever. How can something top-off the first season's 9 year old jailbaits? Just add a s£$tload of yuri to the mix. Just as an example, Kuro needs mana to survive (I've already established that this is spoilers haven't I?),which she obtains by kishing people. And considering she goes to an all-girls school... Yeah, you get the idea.\\n\\n\r\nAs far as battles go, while it is difficult to surpass the first season's saber's super testosterone terminator-jason vorhees scene (while wearing plate armor), the show still does amazingly well. Good soundtrack (could have been a bit better in my opinion but that's propably the Bleach fan talking) accompanying very good visuals for long-lasting fights that always keep viewers on the edge (I didn't pause once in any of them). Especially the last one was as brilliant a boss fight as it goes. If you liked the first season definitely don't miss this.\\n\\n\r\nreasons to watch:\\n\\n\r\n1)Dark moments.\\n\\n\r\n2)If you have watched the first season then it's a must to watch the second.\\n\\n\r\n3)Very good animation.\\n\\n\r\n4)Long, hard fights (especially the last one).\\n\\n\r\n5)Oooh the fanservice... \\n\\n\r\n6)Excellant character developement.",
            "date": "2014-10-23T18:49:00+00:00",
            "helpful_count": 33,
            "mal_id": 165957,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=165957"
        },
        {
            "content": "Now then, the sequel to the Fate Magical girl show is over I tell you my thoughts on the show and it's new elements.\r\nStory: 7\r\nThe story is very similar to first series in terms of plot as in the first it focuses on being friends with Miyu this focuses on understanding Kuro the new character which is a fun ride through and is worth watching as this new development triggers various things in the show from funny comedy, yuri undertones and doing various acts to embarrass Illya which helps fix her into the evil twin role and is good comedy/drama for the viewer.\r\nCharacter: 8\r\nAll thecharacters you know and love from the first season are back and new and improved with further character development for main cast Illya and Miyu as well as new character Kuro getting a great role as well as great development in character. This supported by wonderful supporting cast who fill the void in areas but some are just used for comedy.\\n\\n\r\nSound: 8\\n\r\nThe sound is amazing in terms of fight music during action scenes making each scene feel new and refreshing as well as making fights fun for the viewer to watch. The opening of the anime is great and fits the show very well with happy lyrics and great music that fits both the fate series as well as the magical girl theme, which is similar to ending as that also feels happy and carefree suiting the tone of the show and makes a nice song for the end of each episode.\\n\\n\r\nArt: 9\\n\r\nThe art overall is amazing with well detailed characters and backgrounds that are worthy of the fate franchise but the animation really shines during transformations with visuals being outstanding as well as the fight scenes being the cherry on top with great flow and visuals that make it worthy of being in the fate franchise.\\n\\n\r\nOverall:\\n\r\nThe series is a must watch for fans of previous ones as well as magical girl fans.",
            "date": "2014-09-11T11:43:00+00:00",
            "helpful_count": 29,
            "mal_id": 159929,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=159929"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nExistence is a strange topic. It's rare for people of any age to ponder what it means to \"be\" or at the minimum how one knows that who he or she is, is actually real. But what happens when you throw in a few magical girls and a bit of lewdness? Fate/kaleid liner Prisma☆Illya 2wei! (it got longer!) explores this idea to an extent while still maintaining the same quality that the previous season held.\r\nSTORY\r\nF/k2 (shortened again at this point!) begins where F/k left off; Illya and Miyu are recruited by Rin and Luvia once more to helpthem with magical happenings. However, on their first excursion, something definitely strange occurs.\\n\\n\r\nWhere F/k focused mostly on the character dynamic between Illya and Miyu, this time the focus shifts from relationships and towards the idea of existence. The phrase \"I think therefore I am\" comes to mind instantly. But for Kuro, the newly introduced character, this simple idea is not enough. With an unknown origin, unfavorable goals, and her odd behavior, it makes the question of her existence a more difficult one to answer. For the most part, the show does a nice job of pacing its revelations and characterization well enough to make the conclusion of these ideas at least understandable. This isn't anything \"next level,\" but for what the show is, I thought it did a fine job.\\n\\n\r\nWhen the show isn't venturing into philosophical territory, it is more or less a slice of life show. It features the cast doing normal everyday activities such as playing dodge-ball or baking bread. These segments highlight the comedy and character interactions nicely and seemed to be an overall improvement from the previous season.\\n\\n\r\nOne of the strongest parts of the show is in its final episodes. F/k featured many varying and interesting fights, and F/k2 returns to these roots during the end. Alongside the battle, the show sets itself up nicely for what will be occurring in the coming season. And after watching these last few fight scenes, it became clear how nicely the show balanced exposition, slice-of-life, and fighting. One part never heavily outweighs another, giving the show an overall nice sense of purpose.\\n\\n\r\nANIMATION\\n\\n\r\nMuch like F/k, F/k2 maintains a high degree of quality.\\n\\n\r\nThe art style is relatively the same. The characters are shiny, the backdrops are pretty, and the lighting sees even more detail than ever before. The show continues its use of sparkles, flashes, and shines to great effect to give the fights and character actions that extra \"oomph.\"\\n\\n\r\nThe actual animation is once again pretty darn good. The battles feature the majority of the detail, with their nice choreography and nice use of \"camera\" angles. The character movements, both in and out of the fights, are very fluid. The show employs less detailed animation moments for comedic effect, but even then it always maintains high standards.\\n\\n\r\nOnce again, F/k2's character designs are nice due to both their detail and homage. Kuro features very stunning eyes (much like the rest of the cast) so her design felt completely in-line with everyone else.\\n\\n\r\nCHARACTERS\\n\\n\r\nF/k2's characters actually see an improvement from the previous season.\\n\\n\r\nIllya's character doesn't see much growth this time around, but this is due to the character perspective shifting from her to Kuro. Instead, what she does is demonstrate that what she has gained from her earlier experiences can easily be applied to the situations she is in now. Namely, this is learning to fight for and protect the people around you, without running away.\\n\\n\r\nMiyu actually becomes even more mysterious, if that can even be believed. The show alludes to particular actions and past events in her life without fully explaining them, giving her the potential to see improved characterization down the road. For the most part, she takes more of a backseat during this season's events, but she is by no means completely out of the fights.\\n\\n\r\nThe most important character this time around, and understandably so, is Kuro. Outgoing but defensive, carefree but troubled, she begins as a complicated mix of emotions and ideas. Over the course of the show, she is refined from this kill-driven fiend to an accepted person. Her inclusion within the story makes sense, is explained nicely, and most important of all, her character interactions with the rest of the cast work wonderfully.\\n\\n\r\nProbably one of my favorite villains of all time, Bazett isn't fully introduced until later down the road, but when she is, you will definitely feel her presence. Her utter dominance on the battlefield, with her amazing agility, unparalleled strength, and keen battle-sense makes her completely unfair and a worthy \"final boss.\" The only problem was that we didn't get to see more of her in action. But when we did, you just couldn't look away.\\n\\n\r\nSomething that the show improves greatly on from last season is in its side character department. This time around, F/k2's side cast felt relevant. They were used for jokes, they provided better insight, and seemed to have more of an impact on the girls' daily lives. This is especially true for Illya's school friends who saw almost zero screen time before. Between them all, my favorites are probably Liz and Auguste the butler for how fun their characters are, both in dialogue and in action.\\n\\n\r\nSOUND\\n\\n\r\nF/k2's quality in sound sadly persists here as well. The OP is rather boring even if it does fit the magical girl feeling that the show gives off. The ED as well is rather generic. It's upbeat nature goes with the generally happy tone of the show. Neither the OP or ED are memorable enough or good enough to warrant listening to outside of the show.\\n\\n\r\nThe soundtrack is again filled with both good and bad pieces. That is to say, it knocks it out of the park and fails miserably in all the right (and wrong) places.\\n\\n\r\nThe voice acting for F/k2 is pretty good. Illya, Miyu, Kuro, and the rest do a nice job in their respective roles. Shout-out to Luvia and that rich girl laugh of hers!\\n\\n\r\nENJOYMENT\\n\\n\r\nI found the comedy to be a step up in this sequel. A lot of the jokes were even more self-aware than before, and Kuro's inclusion into the cast made Illya so disgruntled that I couldn't help but laugh at how easy she was to get a rise out of. Beyond the comedy, these are a bunch of cute characters, so everything they say and do is too adorable to handle. From them pouting to their constant blushing, the show easily makes you smile.\\n\\n\r\nIt also can't be stressed how nice the battle sequences are. Seeing Bazett decimate everything with her fists, Kuro materializing and flinging her swords, and Illya or Miyu utilizing their magic abilities to their fullest is a nice sight to behold. This time around, Fate/kaleid liner Prisma☆Illya 2wei! isn't just a Fate-universe spin-off, but a properly fleshed out show that is at least worthy of a shot.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, nice balance of exposition, slice-of-life, and action\\n\\n\r\nAnimation: Great, beautiful art and animation tied with a magic ribbon\\n\\n\r\nCharacters: Good, fun new character, cool villain, nice use of side characters\\n\\n\r\nSound: Bad, OP and ED don't cut it, soundtrack is a mixed bag, VAs done nicely\\n\\n\r\nEnjoyment: Good, cuteness, comedy, and awesome fights\\n\\n\r\nFinal Score: 6/10",
            "date": "2014-10-05T11:44:00+00:00",
            "helpful_count": 10,
            "mal_id": 163711,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=163711"
        },
        {
            "content": "Minor spoilers. \r\nThis review is written with the assumption that you have seen the prequel, Fate/kaleid liner Prisma☆Illya.\r\nSense of place. The term can be used in many different ways. For some it may be unique places like ones bedroom, for others it may be about an attachment to a group of people where one feels safe and free to express oneself. We all seek a place to belong, somewhere where warmth emits. Some are lucky to find attachment early during their childhood while others struggle to. When you do not find a place, you feel left outside, alone, scared, cold and that is when oneis the weakest and perhaps most aggressive; acting with hostility towards those who have taken your comfortable place out of frustration and fear. \\n\\n\r\n2wei! is a story about finding a place to belong.\\n\\n\r\nThe sequel to Fate/kaleid liner Prisma☆Illya, Fate/kaleid liner Prisma☆Illya 2wei! continues the journey of the two girls, Illyasviel and Miyu. After completing the task of collecting the class cards, Illya and Miyu adjusts to live their life normally after the events. But that does not last long since there is trouble brewing in the complex space. Illya and Miyu are once again needed by Rin and Luvia to deal with the side effects left by the cards. Following the restoration we are introduced to Kuro, the new addition of the story.\\n\\n\r\nBeing reminded that others have a normal life does take a toll on one's self confidence and balance, and this is what happens to Kuro. With Illya being surrounded by friends and family, Kuro is constantly reminded of what she lacks. When Illya expresses that she wants her life to return to normal it triggers Kuro making her loathe Illya all the more. Even though surrounded with demoralizing scenes she tries to find a place by taking advantage of Illya’s desires (which Illya is not able to act on because of fear) and attempts to push her out and replace her. This is shown when she advances towards Shirou (who Illya holds a dear crush for) and being sexually suggestive while flirting with him. Her attempts on phasing Illya out eventually ends with a fight and it being interrupted with perfect timing (a bit too appropriately) by a third party, the source of Kuro’s problem itself. As the show progresses the influence of Illya’s continuous friendly advances leads to Kuro being able to find a place in her former enemy’s warmth. Although minor, Miyu plays a role in the story when Kuro challenges the validity of her friendship with Illya which Miyu responds with a strong resolve, and it shows that Miyu has developed during the course of the series.\\n\\n\r\nEven though they had the first season to reflect and improve their show, 2wei! is sadly not an improvement over the first season and the series is faltering.\\n\\n\r\nThe themes of friendship and trust that was dealt with in the previous season are now shifted away to give way to the new theme, a place of belonging. Early on the show loses focus on the themes it attempts to deal with. Episodes leading up to the climax favors comedic events spawned from Kuro’s interactions and these events take too much time of the shows constricting episode count. Episode 4 being the biggest offender with it being about a game of dodgeball which is dragged out to the point that would make a taffy confectioner jealous. The dodgeball game serves little purpose in the narrative with its intentions being about eliciting chuckles and to mystify Miyu and the school nurse, perhaps hinting the upcoming events of the series.\\n\\n\r\nThe theme is vaguely hinted throughout the story from Kuro’s hostile and apathetic actions towards others, and her reaction from Illya’s questioning about her reason to remove Illya out of the way. It is later clarified why Kuro acted the way she did, but it does not leave a satisfying conclusion. There is a sharp contrast with how light and playful the the story was compared to the event leading up to the climax, and the bridge leading up to it gives little time to empathize with Kuro. With these reasons the climax did not reach its full potential and in the end falls flat.\\n\\n\r\nAlthough humor is a part of the series, anything but the interactions between the main characters are so weak that they detract time only to attempt a flat and dull gag. It also feels artificial and forced. The shows side characters are significantly degrading ones experience, to the extent that you cannot enjoy the show whenever they pop-up. Tatsuko being the energetic and feisty troublemaker, Suzuhana the mature one, Nanaki the one who just goes along with anything and Mimi the one with lacking presence. They are all simplified, fitting common tropes and serve to share the burden of the main cast to supply amusement. This shows a lack of trust given to the main characters ability to elicit laughter. The memorable and great moments of fun are risen naturally from the main characters interactions.\\n\\n\r\nOne side character to note is Shirou, that lacks any purpose in the story other than to make the main characters, as well as Rin and Luvia, lose control and behave out of character. Two notable scenes are when Miyu clings to Shirou like a vulnerable puppy and scuttles away, and Rin and Luvia trying their best to look impress and get his attention. It feels out of place and is one of the downsides with the show. The influence he has on the girls and their feelings for him feels out of place whenever they are in the same scene. We are never explained why the girls feel the way they do towards him, and it does not have any impact at all. It just gives rise to an awkward and confusing scene. It also gives a sense of a subplot being that the girls are a part of a harem romcom with Shirou being the typical dull and oblivious main character.\\n\\n\r\nAlthough flawed, the series is enjoyable to a certain degree. The interactions between the characters does spawn great moments of comedy; in particular, the way Illya reacted and her face when she was seen by her classmates in her magical girl outfit is one the funniest parts of the show. The scene in episode 2 where Kuro explores the mysteries of Miyu’s mouth might be weird to watch, but it sure offers a kind of fan service that is tasteful without detracting the characters to simple sexual objects. How the camera angles during that scene showing Illya in the background with the two girls kissing in the forefront and the fact that the camera lingers shortly close to them and quickly backs away to give them space gives the idea of the camera respecting their moment. The way Illya observed them during that scene reflects perfectly how I reacted to it, and it shows that the producer knows its audience and what reaction they expect. Interestingly enough there is a reason behind Kuro’s kissing, however it is not convincing enough to pass it off since there are other ways she can recharge her mana which does not require her to force herself onto other girls.\\n\\n\r\nIt is also a pleasure to see how Kuro slowly warms up to the rest of the cast as the show goes on. The antagonist that is introduced later in the second half ramps up the girls relationship. The battle that follows shows how well the CGI complements the action that is displayed. The animation of the characters are well done and smooth, and it does not detract the exhilarating action. In contrast to the light and bright scenes in the first half of the show, the dark arc in the end fits well since it serves to strengthen the girls bond by inserting a common enemy which they will have to work as a team in order to defeat it. This allows the girls develop their characters even further, and gives Miyu, Rin and Luvia some needed screen time.\\n\\n\r\nIllya’s character design has never looked this good before, making other works design of her look poor in comparison. Miyu and Kuro are no exception to the lovely design as well. Silver Link’s strength regarding animation are character design and CGi, and they sure do know how to draw characters with a great consistency. The shows CGI looks amazing with its natural presence unlike other shows which feature CGi that looks out of place. The lighting applied to the scene are nicely represented, and the shadows covers and wraps around the objects and characters they are on decently giving a decent overall look. Other than the CGI, the overall animation quality is decent The soundtrack and background music does not impress. It does its job, but being simple regarding synths and tunes, as well as the background music during the fight scenes feeling more like a dance than action pumping sound it leaves one unfulfilled. There are not any notable or memorable soundtracks. At least the ending song is nice, fitting well into the shows light and magical feel with its instruments sounding very light and giving a cheery and girly overall sense.\\n\\n\r\nSometimes there are shows that pop up which are incredibly popular with the help of it being a part of a popular franchise or something else. Prisma☆Illya is one of those shows, risen to heights with the help of the Fate-franchise immense popularity. Even though mediocre, it offers fans of the Fate-franchise a mahou shoujo spin-off with the ever so popular girl, Illyasviel.\\n\\n\r\nCute girls in cute outfits is what Prisma☆Illya is all about. With a heavy sprinkle of magic, friendship and acceptance it paints itself like any other generic Mahou Shoujo but within the Fate universe. Although the show handles itself decently at some aspects its dynamic between philosophy and humor falters, and it offers nothing new and should be treated as nothing more but sugar. For the fans of Illya, I suggest hopping onto this series since Illya has never before been more beautiful and cute. She looks lovely but the shows she stars in are anything but.",
            "date": "2015-01-31T14:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 179366,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4137613.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Revaq",
                "username": "Revaq"
            },
            "url": "https://myanimelist.net/reviews.php?id=179366"
        },
        {
            "content": "STORY\r\n   In my opinion, the first season was a very comfortable and enjoyable show. So, when I heard there was more, I thought \"why not?\". I mean it couldn't hurt to get more. I only expected for Fate/kaleid liner Prisma☆Illya 2wei! to be entertaining. Although it wasn't too much of a step up as a story, it was certainly more entertaining than the first season. The main contributors to why this show was more entertaining to watch, were the Fate/ throw backs. I mean, the first season had a few of these, but they were mostly weren't used to move the plot. Thisseason, however used them in a serious sense. Like the connection between the Illya of the Prisma universe and to Fate/Stay Night. They actually used this plot point to an extent. Which made the show more enjoyable. \\n\r\n   As for the main story, it has improved. It threw away the magical girl tropes, and adopted a more Fate style. For the most part anyway. It had one trope that was a used for jokes but that was it. This season upgraded the yuri scenes, to kissing. So, if you don't like yuri, then this season isn't for you. Anyway, as for the conflict, the conflict felt a lot more genuine. Meaning that I actually felt invested in what was happening. Now, why this is such a difference to the first season. Well, while the conflict in the first season was okay, it was typical. What only really pulled me in was the scene direction. This season, however, made me care without the director. Which is an improvement in my book. \\n\r\n   With that said, the story is still nothing too special. It didn't really spoke to me in any emotional level, it was just another anime. Which is fine, because not all anime needs to do that. \\n\r\n   Overall, an improvement, but still nothing too special. (I would give this section a 7.5, only if MAL had a decimal grading system.)\\n\\n\r\nCHARACTERS\\n\r\n   If you read my review of the first season, I found the characters to be passable. This section is also another improvement. The season's new character is Kuro. Kuro's character in a way is a throw back to the Fate/ series, which makes her automatically more likable. (For me at least) Her character arc is rather interesting and the way she develops is really nice to see. Her development isn't too typical. It doesn't revolve around acceptance, like Illya or Miyu, it revolves around the desire to live. Which is why she is the best character in the show. As for Illya and Miyu. They already developed, but Illya gets some extra spotlight. Since Illya has accepted that she had a duty to the class cards, she now needs to accepts the changes that come with it. It was nice to see Illya come to terms with her life situation, and confirm that she has changed. Miyu on the other hand, doesn't really have a development in this season. Her character strength here is showing that she have changed because of what has happened. Which leads to one of my favorite moments in the show. In fact I enjoyed Miyu here than the first season, just because she is a lot more likable. \\n\r\n   As for the other characters, they're all throw backs to the Fate/ series, and they mostly serve comedy purposes. Besides Rin and Luvia, there's only two side characters that I'd call important. Even then they don't really have character arcs.. which is fine for side characters I guess. \\n\r\n   Overall, despite a lack luster supporting cast, this show really shines with its main characters.\\n\\n\r\nANIMATION\\n\r\n   The animation is about the same as the first season, really good. The lighting and tone are good and give away the same light feeling as the first season. The fights are even better, because of the amazing fight direction. Especially a certain fight between Kuro and Miyu. I mean the fights use camera angles that show the tension from each move the characters make, which make for some really cool looking fights. Overall the quality is about the same. I noticed that the character designs are a bit more consistent, but that was about it for animation improvements. \\n\\n\r\nMUSIC\\n\r\n   Again, nothing has changed much. Although in this case it's a problem. I don't think I heard any new tracks. Which meant they were reusing the tacks from last season. And with the old tracks being over used already, it made the music feel stale. \\n\\n\r\nOVERALL\\n\r\n   Fate/kaleid liner Prisma☆Illya 2wei! is a fun entry into the series, and is a worthy continuation. It retains the fun stuff of the first season and improves its story as if it never ended. Although the ending was a tiny bit cliff hanger-ish, another season has been announced. Which is suppose to be the second half to the second series. Anyway, I'm looking forward to it.",
            "date": "2014-11-16T22:59:00+00:00",
            "helpful_count": 7,
            "mal_id": 168925,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4149187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MeowPower",
                "username": "MeowPower"
            },
            "url": "https://myanimelist.net/reviews.php?id=168925"
        },
        {
            "content": "Before I start if you haven't read or seen the first season of Fate/kaleid liner Prisma Illya then either read my review or watch the first season and then come back here. \r\nSo if your still here welcome back to Fuyuki City where Illya's normal life still gets disrupted but only this time by a full blown clone of herself.\r\nIn other words the sequel is even more interesting then the first season as it moves away from the magical girl tropes and into the Fate tropes that everyone knows and loves. keep in mind the Magical Girl tropes are still there but not as muchas the first season.\\n\\n\r\nThe art and sound are beautiful to look at and to listen to as well as this series uses water and bubbles as part of the art style in certain scenes as for the sound well just listen to the ending theme and you would understand why that song was chosen and is part of the story. \\n\\n\r\nCharacter development was key again in the sequel as we see more of Illya's friends and their weird little quirks and other new characters like the servant and someone form the church association but the major character development was Kuro a new character added to the series as she went from I want to kill the person who looks like me to I want to live a normal everyday life like everyone else including Illya.\\n\\n\r\nIn other words I enjoyed the sequel as it had everything the first season had and multiply it by 1000 or a lesser number so if you are looking for a magical girl style anime or if you like the Fate series in general or the first season then you will like this one",
            "date": "2015-04-20T18:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 186057,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4016289.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MRN3",
                "username": "MRN3"
            },
            "url": "https://myanimelist.net/reviews.php?id=186057"
        },
        {
            "content": "It seems contradictory and abominable to follow up a review of an excellent Fate series with a review of a dreadful one, but what better way to kill the anticipation for Unlimited Blade Works’ second season than watching something that turns the entire franchise into a joke? After all, who can’t help but laugh at the giant freaking title? What is it with anime having ridiculously long, pointless titles comprised of gibberish?\r\nIt’s a month after Illya got her magic wand, Ruby, and things are going swimmingly. They’ve captured all seven Clow…er…regular cards (these contain the Heroic Spirits), Rin and Luvia appear to be on friendlyterms (though still hate each other and are only doing it as per orders), and Illya and Miyu are still on their way to being total lesbians. It’s all well and good until they go with Rin to a magical ley line and accidentally split Illya into two personalities. There’s her regular personality, then there’s her grail/Archer self. This isn’t well explained, but it doesn’t matter because Chloe, as she calls herself, is best girl and gets a free pass.\\n\\n\r\nChloe’s character is a mix between Rin and Miyu. Her character starts as the antagonist who wants to kill Illya and take her place, becomes her main rival in love and school, tries to turn Illya’s friends against her,she learns what she really is and her purpose, reconciles with the protagonist, and the two have a friendly rivalry.\\n\\n\r\nThe vast majority of this ten episode series is about Chloe and Illya’s rocky relationship. Toward the end a badass fighter for the church, Bazett, appears for absolutely no reason other than to pad the show out, and then it’s over with pretty much nothing resolved.\\n\\n\r\nI wasn’t as offended by this season as I was the first because it focuses more on the “plot”(what little there is) and most of the annoyances of the first season are gone, notably the shrill fighting between Rin and Luvia.\\n\\n\r\nThere’s great action here and occasionally funny comedy–enough of it to keep the average viewer watching. But it’s still a show appealing to loli-cons so expect scenes taking place in pointlessly half-naked to full-naked places. A lot of gym class bloomers and a lot of nude ten year olds in the bath. Deep lesbian kisses too. There’s the tease of a beach episode at the very beginning that never comes to fruition but I’m certain it’ll kick off the third season.\\n\\n\r\nAnd then there’s Shiro, whom Illya and Chloe are fighting over. Oh, and Rin and Luvia are in love with him too though this little bit of romantic uselessness doesn’t ever go anywhere.\\n\\n\r\nI can’t think of much to say about this show. It’s too short and doesn’t have enough going on to really start a discussion. It’s slightly better than the first season in execution, has good animation, a decent addition in Chloe, and a few good action scenes. But otherwise, it’s a very basic, underwhelming piece of loli exploitation. It exists in a state of perpetual mediocrity, though has a few merits that make it worth a watch if you’re a fan of Kaleid or were mildly amused by the first season.",
            "date": "2015-05-22T10:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 188431,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188431"
        },
        {
            "content": "I've always had a soft spot for Illya von Einzbern. The adorable and dangerously unbalanced young Master of Berserker, with her strange brother complex for Shiro, is probably my favorite loli character of all time. Nevermind that she's 16 in the anime and only looks like she's 11. \r\nIn Prisma Illya, our Einzbern princess actually looks her age, and adventures through a strange mirror of the Fate universe with her magical girl powers. In the first series she teamed up with fellow magical girl Miyu for fanservice, yuri subtext and fighting berserk Spirits trapped within seven cards. This time, while investigating an imbalance in theley lines, Illya accidentally creates a clone of herself, Kuro Illya, who possesses the formidable abilities of Archer. The initial conflict between the two, and their subsequent friendship, are a major part of Prisma Illya 2wei's story focus. \\n\\n\r\nThe early episodes are somewhat low on the action, resembling a Slice of Life comedic anime in their overall style. The fights that we do see are fantastic, with excellent use of CGI and top-class animation that you expect from a ufotable Fate project. There's plenty of yuri fanservice in this part of the series, which may make some uncomfortable and others unduly excited. The second half contains an amazing fight that reminds us what the Fate series is all about, amazing fights between beings of truly mythological power.",
            "date": "2014-09-13T02:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 160117,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/480430.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Blind_Guardian",
                "username": "Blind_Guardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=160117"
        },
        {
            "content": "The fan service was lacking overall and there was a lot of CG for no reason, but I considered it a step up from the previous series.\r\nI typically say to people that if they enjoy mahou shoujo and loli fan service they'll probably like Prisma Illya, but 2wei is where the world building starts picking up steam and the Fate/ references stop being benign cameos and start being important background info and foreshadowing. \r\nBasically this is where stuff starts to get interesting for Prisma Illya, but emphasis on \"starts to,\" because 2wei overall feels like an interlude to the real climax in 3rei. It doeshave a lot of great twists (mostly in the latter half) that are pretty rewarding though. So to that effect this first cour will probably give you some dramatic blue balls, since most of the major plot lines don't even really start 'til Bazette shows up late in the season. \\n\\n\r\nIf you don't like Type-Moon and are watching this for the little girls, then hold on to your butt or prepare to bail in this cour.\\n\\n\r\nThat's it, I'm out.",
            "date": "2014-09-18T18:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 160879,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3093077.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/100gates",
                "username": "100gates"
            },
            "url": "https://myanimelist.net/reviews.php?id=160879"
        }
    ],
    [
        {
            "content": "If you're here you've probably watched first season. And you're interested if it's worth watching another. \r\nRegardless of this review I think you WILL watch this, because nobody watches 1st season of Fate/Kaleid to the end and doesn't watch 2nd. Just, nobody.\r\nStill, you want to know how good it will be before watching. Let me tell you straight, it's much better than season 1. 2 Wei is literally twice as good as first. \r\nWhile half-a-joke (you'll get joke after 1 episode) it's really much better. It was like - \"I just came to see some more cute girls doing cute stuff and HOLY S**T THATBATTLE FUCKING AWESOME.... wait is she... OH MY GOD THAT SCENE WAS AWESOMe!!! and than more cute stuff and than HOLY F**K WHAT IS SHE DOING HERE!! MY GOD DON'T TELL... OH MY GOD WHAT A FUCKING AWESOME BATTLE!!!!!!! THIS IS THE BEST ANIME EVER!!!\"\\n\\n\r\nWell, of course it's not THAT great really but admit it... you were here just to see some cute lolies and you actually got more than a \"decent\" anime. The quality was priceless!! The art was so gorgeous that I was going to give this 10/10 even if it didn't have a good story/characters. (It still delivered quite a story btw)\\n\r\nTt's like, my 2nd favorite anime in fate/series (1st being zero). This was much better than what I expected. I got what I wanted and even more.\\n\\n\r\nSo yea.. pretty much that. I doubt that you're reading this and you're not a fate/fan. And I assure you that watching Fate/Kaleid is time spent best.",
            "date": "2014-09-10T13:59:00+00:00",
            "helpful_count": 103,
            "mal_id": 159827,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/68654.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Aklama",
                "username": "Aklama"
            },
            "url": "https://myanimelist.net/reviews.php?id=159827"
        },
        {
            "content": "Is it fate that Illya became a magical girl? Maybe. Was it destiny that set forth events that led her to meet Miyu? Maybe. And did Illya always wonder if there was another side of her that existed? Probably not. Oh wait, you’re probably wondering who or what that ‘other side of her’ is. No worries though because in this spinoff of the Fate universe, anything is possible.\r\nServing as a spinoff of the popular Fate/Stay Night franchise, Fate/Kaleid returns for a sequel once again to adapt the manga of the same name. Like season 1, it consists of 10 episodes of magical girl fun. The‘fun’ here is probably not emphasized for Illya’s case though. Rather, it’s mostly for the fans. This is because Illya’s life turns out to be anything but fun after one day when she discovers that she has an alter ego, known as Kuroe von Einzbern; or Kuro for short. \\n\\n\r\nFirst things out of the way: you must familiarize with the first season and at least parts of the Fate universe. The pilot episode of the sequel only briefly recaps the events of the first season and assumes that viewers already have an established knowledge of the series. And indeed, the sequel blasts off with some yuri-undertones. Similar to season 1, the sequel also has a lighthearted mood taking place in an alternate universe of the Fate franchise. The story and premise is fairly straightforward however. In fact, we already know that Illya has captured the class cards that serves as template for servants from Fate/stay night. So what’s next? The answer to that is a young girl named Kuro. Emerging in the aftermath of the card captures, she becomes a pivotal plot focus in the second season as she is both a hindrance and threat to Illya’s life. But to say the least, she is also a bit mysterious. Taking at first glance, she looks almost identical to Illya except for her more tanned skin. This becomes a reoccurring joke throughout the season as Illya’s classmates, family, and even Shiro confuses between the two. It also becomes a problem as Kuro seemingly dislikes the prevalence of two Illyas. As standard and cliché as it sounds, there is the instance where one tries to get rid of the other for good so they could become the dominant entity. This plays on and off through the course of the first half as Kuro serves as the “evil twin” factor. Although she does have some malevolent intentions, it’s also suggested that she isn’t truly evil but rather wants to establish her presence in their world.\\n\\n\r\nBy “presence”, Kuro really does take the cake when it comes to commanding attention. The season has her running around like an ‘evil twin’ causing embarrassment for her classmates. The problem is that others initially believes it is Illya doing the deed. And to do that, the preposterously hyperactive girl mischievously plays the role of a trickster with her mana-draining. Perhaps the more suitable term for this would be ‘kissing’. If you thought season 1 had yuri-undertones, then season 2 will really accelerate that engine. This season’s yuri-tones skyrockets through the roof as Kuro kisses countless characters. Some are left in a state of shock while others are embarrassed, perhaps scarred for life. Okay, maybe that’s an exaggeration but point aside, the show makes its point. This is all for a reason as revealed later. However, the show establishes the fact that it takes itself both seriously and not the same time. In this alternate universe, we get magical girls. In the original Fate/Stay Night, there are the servants and the masters. When you think about the two, there’s a big gap when it comes to the mood. Yet, this season somehow is able to communicate the message that Kuro has her significant role. This is justified later on in the season as Kuro is able to put her differences aside as they face an even bigger threat. \\n\\n\r\nThe best way to watch, understand, or appreciate Fate/Kaleid isn’t perhaps the story. It’s written in a way that ties in characters together like fate through events. As a sequel, the capturing of the class cards led to the emergence of Kuro. And from that triggered trouble with embarrassing moments at school, magical fights, and a reinforcement of character relationships. This goes back to the point of the show focusing on character relationships similar to season 1. We already know that Miyu and Illya are great friends after coming to understand each other. For Kuro though, it’s hard to understand her nature considering that she isn’t human or does she have any true friends. That’s all in the beginning anyways since she feels she isn’t being accepted in their world. She seeks acceptance in her own ways while causing collateral damage. Taking for granted, Kuro does seem to want to be normal in a way. Her experiences at school and at home are precious to her as Kuro wants to remember them like a treasure. So in a way, Kuro and Illya are also similar despite their opposite personalities. Rather than being an evil twin, one could interpret Kuro as someone Ilya could familiarize through her role as magical girl. \\n\\n\r\nThe battle scenes are attractive for most parts but fall short of the epic category. This is perhaps undermined by the silliness of the show’s gimmicks and yuri shenanigans. Taken that aside, the show’s battle can be fluid and meaningful with an appealing OST. Kuro, wearing a modified version of Archer’s battle outfit, stands out as a warrior. In this realm of magic and normality, you get a balance of the two: the typical school life of Illya and her role as a magical girl. Color me surprised but the show can be unexpectingly charming with its goofiness. However, this also falls apart when it overrides itself with fan service. While the first season has parts of this, the sequel heavily adapts more of its ecchi fan service such as with the bath scenes and yuri kisses. The diehard comedy over exaggerates itself in untimely manners that can be repetitive and frustrating to watch. To sum it up, Fate/Kaleid’s brainless comedy is like a hammer that hits the nail to a viewer’s patience. The will to enjoy it may feel like a holy shell of the original Fate series. Thankfully though, at least it matches consistency by standards of adaptation. In retrospect though, expectations coming into the show should be more summed as with fun and entertainment. Otherwise, the whole season may feel like a mishmash of inconvenience.\\n\\n\r\nSilver Link adapts the visual qualities. Similarly, there’s not much change when it comes with animation style. Illya’s character design hasn’t matured more than a day while the other characters remain generally the same. Perhaps Kuro is the main attraction with her outfit and similar appearance to Illya; a modified version of Archer with some mischievous eyes and tanned skin. Otherwise, the season is saturated with fan service like pouring ketchup on top of hotdogs. In the end, it ends up being soggy and stale when the flavor overtakes it what tries to set up. Expect controversial camera angles and skin being blown out of the water literally as it tries to “appeal” to the audience. On the other hand, there are some creativeness such as Miya’s battle outfit and other fighting gear/spells.\\n\\n\r\nSoundtrack is decent and comes to serve as a supplement for this adaptation. It’s neither glorifying nor terrible. However, what the soundtrack does is enhance the experience for Fate fans. The modified OST for Kuro’s theme and lighthearted background soundtrack gives its meaning for this spinoff. However, most of the character voices sound childish and a sting to the ears. I have to give praise once again to Kuro as the breakout star in this season for her mischievous voice mannerisms. Her personality and voice matches perfectly with her role. Some credibility of praise can also be given to the OP and ED songs with their appeals. It’s nothing special in the end though since most of it is still covered with generic attributes. Fate/Kaleid may be a show about magical girls but there’s nothing magically speculating when it comes to its soundtrack.\\n\\n\r\nThere aren’t a whole lot of surprises in Fate/Kaleid. The predictable storyline and generic style may leave viewers wonder why they will follow this sequel. But do know this: the show itself isn’t met to be taken too seriously at heart except when the story really gets going. After all, it’s a more lighthearted spinoff for fans of the Fate universe. Even if you’re not a fan, there are characters that can be enjoyable to watch for their roles. However, do be aware of the repetitive comedy, bland dialogues, and a premise that is messy with inappropriate mash-up. The show is more dedicated to what fans may want to expect to see how Illya’s life expands from where it developed as her being a magic world. I wouldn’t say it’s just fate though because the show still integrates life and fiction into the mix. \\n",
            "date": "2014-09-10T10:06:00+00:00",
            "helpful_count": 49,
            "mal_id": 159811,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=159811"
        },
        {
            "content": "Considering you're reading this you've propably already watched the first season  or at least read its plot so lets make things clear: Everything that was good about the first season is here upgraded!\r\nIf you haven't watched the first season go watch it. To get some basics down it's a magical girls spinoff of the fate series, which ended up surprisingly good (in my opinion it actually surpasses stay night by far and perhaps zero too... I mean they didn't have a Saber Termiantor Vorhees who shoots Getsuga Tenshous while wearing 50kg plate armor in them.)\r\nContinuing where the first story left off (warning: spoilers), all7 hero spirits have been sealed and the disturbances seem to have ended. Illya's alter personality however (the form she had taken when using archer's powers against saber) suddenly becomes seperated from her (imagine someone like Illya only with black skin, white hair and a kinda sluttier personality... And yes I do remember that Illya is 9, thanks for reminding me...). Most of the second season focuses strictly on the team's intent to make Kuro (the dark Illya) friendly with them and accepted by everyone without her trying to kill people.\\n\\n\r\nAs mentioned above everything present in the first season is here too. The show has some pretty depressing moments when it needs to and is all fun-and-games when it wants to.The balance is done pretty well,  the characters are developed perfectly (especially in Kuro's case, you start off hating her and you end up loving her), the humor is good and the fanservice holds stronger than ever. How can something top-off the first season's 9 year old jailbaits? Just add a s£$tload of yuri to the mix. Just as an example, Kuro needs mana to survive (I've already established that this is spoilers haven't I?),which she obtains by kishing people. And considering she goes to an all-girls school... Yeah, you get the idea.\\n\\n\r\nAs far as battles go, while it is difficult to surpass the first season's saber's super testosterone terminator-jason vorhees scene (while wearing plate armor), the show still does amazingly well. Good soundtrack (could have been a bit better in my opinion but that's propably the Bleach fan talking) accompanying very good visuals for long-lasting fights that always keep viewers on the edge (I didn't pause once in any of them). Especially the last one was as brilliant a boss fight as it goes. If you liked the first season definitely don't miss this.\\n\\n\r\nreasons to watch:\\n\\n\r\n1)Dark moments.\\n\\n\r\n2)If you have watched the first season then it's a must to watch the second.\\n\\n\r\n3)Very good animation.\\n\\n\r\n4)Long, hard fights (especially the last one).\\n\\n\r\n5)Oooh the fanservice... \\n\\n\r\n6)Excellant character developement.",
            "date": "2014-10-23T18:49:00+00:00",
            "helpful_count": 33,
            "mal_id": 165957,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=165957"
        },
        {
            "content": "Now then, the sequel to the Fate Magical girl show is over I tell you my thoughts on the show and it's new elements.\r\nStory: 7\r\nThe story is very similar to first series in terms of plot as in the first it focuses on being friends with Miyu this focuses on understanding Kuro the new character which is a fun ride through and is worth watching as this new development triggers various things in the show from funny comedy, yuri undertones and doing various acts to embarrass Illya which helps fix her into the evil twin role and is good comedy/drama for the viewer.\r\nCharacter: 8\r\nAll thecharacters you know and love from the first season are back and new and improved with further character development for main cast Illya and Miyu as well as new character Kuro getting a great role as well as great development in character. This supported by wonderful supporting cast who fill the void in areas but some are just used for comedy.\\n\\n\r\nSound: 8\\n\r\nThe sound is amazing in terms of fight music during action scenes making each scene feel new and refreshing as well as making fights fun for the viewer to watch. The opening of the anime is great and fits the show very well with happy lyrics and great music that fits both the fate series as well as the magical girl theme, which is similar to ending as that also feels happy and carefree suiting the tone of the show and makes a nice song for the end of each episode.\\n\\n\r\nArt: 9\\n\r\nThe art overall is amazing with well detailed characters and backgrounds that are worthy of the fate franchise but the animation really shines during transformations with visuals being outstanding as well as the fight scenes being the cherry on top with great flow and visuals that make it worthy of being in the fate franchise.\\n\\n\r\nOverall:\\n\r\nThe series is a must watch for fans of previous ones as well as magical girl fans.",
            "date": "2014-09-11T11:43:00+00:00",
            "helpful_count": 29,
            "mal_id": 159929,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=159929"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nExistence is a strange topic. It's rare for people of any age to ponder what it means to \"be\" or at the minimum how one knows that who he or she is, is actually real. But what happens when you throw in a few magical girls and a bit of lewdness? Fate/kaleid liner Prisma☆Illya 2wei! (it got longer!) explores this idea to an extent while still maintaining the same quality that the previous season held.\r\nSTORY\r\nF/k2 (shortened again at this point!) begins where F/k left off; Illya and Miyu are recruited by Rin and Luvia once more to helpthem with magical happenings. However, on their first excursion, something definitely strange occurs.\\n\\n\r\nWhere F/k focused mostly on the character dynamic between Illya and Miyu, this time the focus shifts from relationships and towards the idea of existence. The phrase \"I think therefore I am\" comes to mind instantly. But for Kuro, the newly introduced character, this simple idea is not enough. With an unknown origin, unfavorable goals, and her odd behavior, it makes the question of her existence a more difficult one to answer. For the most part, the show does a nice job of pacing its revelations and characterization well enough to make the conclusion of these ideas at least understandable. This isn't anything \"next level,\" but for what the show is, I thought it did a fine job.\\n\\n\r\nWhen the show isn't venturing into philosophical territory, it is more or less a slice of life show. It features the cast doing normal everyday activities such as playing dodge-ball or baking bread. These segments highlight the comedy and character interactions nicely and seemed to be an overall improvement from the previous season.\\n\\n\r\nOne of the strongest parts of the show is in its final episodes. F/k featured many varying and interesting fights, and F/k2 returns to these roots during the end. Alongside the battle, the show sets itself up nicely for what will be occurring in the coming season. And after watching these last few fight scenes, it became clear how nicely the show balanced exposition, slice-of-life, and fighting. One part never heavily outweighs another, giving the show an overall nice sense of purpose.\\n\\n\r\nANIMATION\\n\\n\r\nMuch like F/k, F/k2 maintains a high degree of quality.\\n\\n\r\nThe art style is relatively the same. The characters are shiny, the backdrops are pretty, and the lighting sees even more detail than ever before. The show continues its use of sparkles, flashes, and shines to great effect to give the fights and character actions that extra \"oomph.\"\\n\\n\r\nThe actual animation is once again pretty darn good. The battles feature the majority of the detail, with their nice choreography and nice use of \"camera\" angles. The character movements, both in and out of the fights, are very fluid. The show employs less detailed animation moments for comedic effect, but even then it always maintains high standards.\\n\\n\r\nOnce again, F/k2's character designs are nice due to both their detail and homage. Kuro features very stunning eyes (much like the rest of the cast) so her design felt completely in-line with everyone else.\\n\\n\r\nCHARACTERS\\n\\n\r\nF/k2's characters actually see an improvement from the previous season.\\n\\n\r\nIllya's character doesn't see much growth this time around, but this is due to the character perspective shifting from her to Kuro. Instead, what she does is demonstrate that what she has gained from her earlier experiences can easily be applied to the situations she is in now. Namely, this is learning to fight for and protect the people around you, without running away.\\n\\n\r\nMiyu actually becomes even more mysterious, if that can even be believed. The show alludes to particular actions and past events in her life without fully explaining them, giving her the potential to see improved characterization down the road. For the most part, she takes more of a backseat during this season's events, but she is by no means completely out of the fights.\\n\\n\r\nThe most important character this time around, and understandably so, is Kuro. Outgoing but defensive, carefree but troubled, she begins as a complicated mix of emotions and ideas. Over the course of the show, she is refined from this kill-driven fiend to an accepted person. Her inclusion within the story makes sense, is explained nicely, and most important of all, her character interactions with the rest of the cast work wonderfully.\\n\\n\r\nProbably one of my favorite villains of all time, Bazett isn't fully introduced until later down the road, but when she is, you will definitely feel her presence. Her utter dominance on the battlefield, with her amazing agility, unparalleled strength, and keen battle-sense makes her completely unfair and a worthy \"final boss.\" The only problem was that we didn't get to see more of her in action. But when we did, you just couldn't look away.\\n\\n\r\nSomething that the show improves greatly on from last season is in its side character department. This time around, F/k2's side cast felt relevant. They were used for jokes, they provided better insight, and seemed to have more of an impact on the girls' daily lives. This is especially true for Illya's school friends who saw almost zero screen time before. Between them all, my favorites are probably Liz and Auguste the butler for how fun their characters are, both in dialogue and in action.\\n\\n\r\nSOUND\\n\\n\r\nF/k2's quality in sound sadly persists here as well. The OP is rather boring even if it does fit the magical girl feeling that the show gives off. The ED as well is rather generic. It's upbeat nature goes with the generally happy tone of the show. Neither the OP or ED are memorable enough or good enough to warrant listening to outside of the show.\\n\\n\r\nThe soundtrack is again filled with both good and bad pieces. That is to say, it knocks it out of the park and fails miserably in all the right (and wrong) places.\\n\\n\r\nThe voice acting for F/k2 is pretty good. Illya, Miyu, Kuro, and the rest do a nice job in their respective roles. Shout-out to Luvia and that rich girl laugh of hers!\\n\\n\r\nENJOYMENT\\n\\n\r\nI found the comedy to be a step up in this sequel. A lot of the jokes were even more self-aware than before, and Kuro's inclusion into the cast made Illya so disgruntled that I couldn't help but laugh at how easy she was to get a rise out of. Beyond the comedy, these are a bunch of cute characters, so everything they say and do is too adorable to handle. From them pouting to their constant blushing, the show easily makes you smile.\\n\\n\r\nIt also can't be stressed how nice the battle sequences are. Seeing Bazett decimate everything with her fists, Kuro materializing and flinging her swords, and Illya or Miyu utilizing their magic abilities to their fullest is a nice sight to behold. This time around, Fate/kaleid liner Prisma☆Illya 2wei! isn't just a Fate-universe spin-off, but a properly fleshed out show that is at least worthy of a shot.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, nice balance of exposition, slice-of-life, and action\\n\\n\r\nAnimation: Great, beautiful art and animation tied with a magic ribbon\\n\\n\r\nCharacters: Good, fun new character, cool villain, nice use of side characters\\n\\n\r\nSound: Bad, OP and ED don't cut it, soundtrack is a mixed bag, VAs done nicely\\n\\n\r\nEnjoyment: Good, cuteness, comedy, and awesome fights\\n\\n\r\nFinal Score: 6/10",
            "date": "2014-10-05T11:44:00+00:00",
            "helpful_count": 10,
            "mal_id": 163711,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=163711"
        },
        {
            "content": "Minor spoilers. \r\nThis review is written with the assumption that you have seen the prequel, Fate/kaleid liner Prisma☆Illya.\r\nSense of place. The term can be used in many different ways. For some it may be unique places like ones bedroom, for others it may be about an attachment to a group of people where one feels safe and free to express oneself. We all seek a place to belong, somewhere where warmth emits. Some are lucky to find attachment early during their childhood while others struggle to. When you do not find a place, you feel left outside, alone, scared, cold and that is when oneis the weakest and perhaps most aggressive; acting with hostility towards those who have taken your comfortable place out of frustration and fear. \\n\\n\r\n2wei! is a story about finding a place to belong.\\n\\n\r\nThe sequel to Fate/kaleid liner Prisma☆Illya, Fate/kaleid liner Prisma☆Illya 2wei! continues the journey of the two girls, Illyasviel and Miyu. After completing the task of collecting the class cards, Illya and Miyu adjusts to live their life normally after the events. But that does not last long since there is trouble brewing in the complex space. Illya and Miyu are once again needed by Rin and Luvia to deal with the side effects left by the cards. Following the restoration we are introduced to Kuro, the new addition of the story.\\n\\n\r\nBeing reminded that others have a normal life does take a toll on one's self confidence and balance, and this is what happens to Kuro. With Illya being surrounded by friends and family, Kuro is constantly reminded of what she lacks. When Illya expresses that she wants her life to return to normal it triggers Kuro making her loathe Illya all the more. Even though surrounded with demoralizing scenes she tries to find a place by taking advantage of Illya’s desires (which Illya is not able to act on because of fear) and attempts to push her out and replace her. This is shown when she advances towards Shirou (who Illya holds a dear crush for) and being sexually suggestive while flirting with him. Her attempts on phasing Illya out eventually ends with a fight and it being interrupted with perfect timing (a bit too appropriately) by a third party, the source of Kuro’s problem itself. As the show progresses the influence of Illya’s continuous friendly advances leads to Kuro being able to find a place in her former enemy’s warmth. Although minor, Miyu plays a role in the story when Kuro challenges the validity of her friendship with Illya which Miyu responds with a strong resolve, and it shows that Miyu has developed during the course of the series.\\n\\n\r\nEven though they had the first season to reflect and improve their show, 2wei! is sadly not an improvement over the first season and the series is faltering.\\n\\n\r\nThe themes of friendship and trust that was dealt with in the previous season are now shifted away to give way to the new theme, a place of belonging. Early on the show loses focus on the themes it attempts to deal with. Episodes leading up to the climax favors comedic events spawned from Kuro’s interactions and these events take too much time of the shows constricting episode count. Episode 4 being the biggest offender with it being about a game of dodgeball which is dragged out to the point that would make a taffy confectioner jealous. The dodgeball game serves little purpose in the narrative with its intentions being about eliciting chuckles and to mystify Miyu and the school nurse, perhaps hinting the upcoming events of the series.\\n\\n\r\nThe theme is vaguely hinted throughout the story from Kuro’s hostile and apathetic actions towards others, and her reaction from Illya’s questioning about her reason to remove Illya out of the way. It is later clarified why Kuro acted the way she did, but it does not leave a satisfying conclusion. There is a sharp contrast with how light and playful the the story was compared to the event leading up to the climax, and the bridge leading up to it gives little time to empathize with Kuro. With these reasons the climax did not reach its full potential and in the end falls flat.\\n\\n\r\nAlthough humor is a part of the series, anything but the interactions between the main characters are so weak that they detract time only to attempt a flat and dull gag. It also feels artificial and forced. The shows side characters are significantly degrading ones experience, to the extent that you cannot enjoy the show whenever they pop-up. Tatsuko being the energetic and feisty troublemaker, Suzuhana the mature one, Nanaki the one who just goes along with anything and Mimi the one with lacking presence. They are all simplified, fitting common tropes and serve to share the burden of the main cast to supply amusement. This shows a lack of trust given to the main characters ability to elicit laughter. The memorable and great moments of fun are risen naturally from the main characters interactions.\\n\\n\r\nOne side character to note is Shirou, that lacks any purpose in the story other than to make the main characters, as well as Rin and Luvia, lose control and behave out of character. Two notable scenes are when Miyu clings to Shirou like a vulnerable puppy and scuttles away, and Rin and Luvia trying their best to look impress and get his attention. It feels out of place and is one of the downsides with the show. The influence he has on the girls and their feelings for him feels out of place whenever they are in the same scene. We are never explained why the girls feel the way they do towards him, and it does not have any impact at all. It just gives rise to an awkward and confusing scene. It also gives a sense of a subplot being that the girls are a part of a harem romcom with Shirou being the typical dull and oblivious main character.\\n\\n\r\nAlthough flawed, the series is enjoyable to a certain degree. The interactions between the characters does spawn great moments of comedy; in particular, the way Illya reacted and her face when she was seen by her classmates in her magical girl outfit is one the funniest parts of the show. The scene in episode 2 where Kuro explores the mysteries of Miyu’s mouth might be weird to watch, but it sure offers a kind of fan service that is tasteful without detracting the characters to simple sexual objects. How the camera angles during that scene showing Illya in the background with the two girls kissing in the forefront and the fact that the camera lingers shortly close to them and quickly backs away to give them space gives the idea of the camera respecting their moment. The way Illya observed them during that scene reflects perfectly how I reacted to it, and it shows that the producer knows its audience and what reaction they expect. Interestingly enough there is a reason behind Kuro’s kissing, however it is not convincing enough to pass it off since there are other ways she can recharge her mana which does not require her to force herself onto other girls.\\n\\n\r\nIt is also a pleasure to see how Kuro slowly warms up to the rest of the cast as the show goes on. The antagonist that is introduced later in the second half ramps up the girls relationship. The battle that follows shows how well the CGI complements the action that is displayed. The animation of the characters are well done and smooth, and it does not detract the exhilarating action. In contrast to the light and bright scenes in the first half of the show, the dark arc in the end fits well since it serves to strengthen the girls bond by inserting a common enemy which they will have to work as a team in order to defeat it. This allows the girls develop their characters even further, and gives Miyu, Rin and Luvia some needed screen time.\\n\\n\r\nIllya’s character design has never looked this good before, making other works design of her look poor in comparison. Miyu and Kuro are no exception to the lovely design as well. Silver Link’s strength regarding animation are character design and CGi, and they sure do know how to draw characters with a great consistency. The shows CGI looks amazing with its natural presence unlike other shows which feature CGi that looks out of place. The lighting applied to the scene are nicely represented, and the shadows covers and wraps around the objects and characters they are on decently giving a decent overall look. Other than the CGI, the overall animation quality is decent The soundtrack and background music does not impress. It does its job, but being simple regarding synths and tunes, as well as the background music during the fight scenes feeling more like a dance than action pumping sound it leaves one unfulfilled. There are not any notable or memorable soundtracks. At least the ending song is nice, fitting well into the shows light and magical feel with its instruments sounding very light and giving a cheery and girly overall sense.\\n\\n\r\nSometimes there are shows that pop up which are incredibly popular with the help of it being a part of a popular franchise or something else. Prisma☆Illya is one of those shows, risen to heights with the help of the Fate-franchise immense popularity. Even though mediocre, it offers fans of the Fate-franchise a mahou shoujo spin-off with the ever so popular girl, Illyasviel.\\n\\n\r\nCute girls in cute outfits is what Prisma☆Illya is all about. With a heavy sprinkle of magic, friendship and acceptance it paints itself like any other generic Mahou Shoujo but within the Fate universe. Although the show handles itself decently at some aspects its dynamic between philosophy and humor falters, and it offers nothing new and should be treated as nothing more but sugar. For the fans of Illya, I suggest hopping onto this series since Illya has never before been more beautiful and cute. She looks lovely but the shows she stars in are anything but.",
            "date": "2015-01-31T14:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 179366,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4137613.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Revaq",
                "username": "Revaq"
            },
            "url": "https://myanimelist.net/reviews.php?id=179366"
        },
        {
            "content": "STORY\r\n   In my opinion, the first season was a very comfortable and enjoyable show. So, when I heard there was more, I thought \"why not?\". I mean it couldn't hurt to get more. I only expected for Fate/kaleid liner Prisma☆Illya 2wei! to be entertaining. Although it wasn't too much of a step up as a story, it was certainly more entertaining than the first season. The main contributors to why this show was more entertaining to watch, were the Fate/ throw backs. I mean, the first season had a few of these, but they were mostly weren't used to move the plot. Thisseason, however used them in a serious sense. Like the connection between the Illya of the Prisma universe and to Fate/Stay Night. They actually used this plot point to an extent. Which made the show more enjoyable. \\n\r\n   As for the main story, it has improved. It threw away the magical girl tropes, and adopted a more Fate style. For the most part anyway. It had one trope that was a used for jokes but that was it. This season upgraded the yuri scenes, to kissing. So, if you don't like yuri, then this season isn't for you. Anyway, as for the conflict, the conflict felt a lot more genuine. Meaning that I actually felt invested in what was happening. Now, why this is such a difference to the first season. Well, while the conflict in the first season was okay, it was typical. What only really pulled me in was the scene direction. This season, however, made me care without the director. Which is an improvement in my book. \\n\r\n   With that said, the story is still nothing too special. It didn't really spoke to me in any emotional level, it was just another anime. Which is fine, because not all anime needs to do that. \\n\r\n   Overall, an improvement, but still nothing too special. (I would give this section a 7.5, only if MAL had a decimal grading system.)\\n\\n\r\nCHARACTERS\\n\r\n   If you read my review of the first season, I found the characters to be passable. This section is also another improvement. The season's new character is Kuro. Kuro's character in a way is a throw back to the Fate/ series, which makes her automatically more likable. (For me at least) Her character arc is rather interesting and the way she develops is really nice to see. Her development isn't too typical. It doesn't revolve around acceptance, like Illya or Miyu, it revolves around the desire to live. Which is why she is the best character in the show. As for Illya and Miyu. They already developed, but Illya gets some extra spotlight. Since Illya has accepted that she had a duty to the class cards, she now needs to accepts the changes that come with it. It was nice to see Illya come to terms with her life situation, and confirm that she has changed. Miyu on the other hand, doesn't really have a development in this season. Her character strength here is showing that she have changed because of what has happened. Which leads to one of my favorite moments in the show. In fact I enjoyed Miyu here than the first season, just because she is a lot more likable. \\n\r\n   As for the other characters, they're all throw backs to the Fate/ series, and they mostly serve comedy purposes. Besides Rin and Luvia, there's only two side characters that I'd call important. Even then they don't really have character arcs.. which is fine for side characters I guess. \\n\r\n   Overall, despite a lack luster supporting cast, this show really shines with its main characters.\\n\\n\r\nANIMATION\\n\r\n   The animation is about the same as the first season, really good. The lighting and tone are good and give away the same light feeling as the first season. The fights are even better, because of the amazing fight direction. Especially a certain fight between Kuro and Miyu. I mean the fights use camera angles that show the tension from each move the characters make, which make for some really cool looking fights. Overall the quality is about the same. I noticed that the character designs are a bit more consistent, but that was about it for animation improvements. \\n\\n\r\nMUSIC\\n\r\n   Again, nothing has changed much. Although in this case it's a problem. I don't think I heard any new tracks. Which meant they were reusing the tacks from last season. And with the old tracks being over used already, it made the music feel stale. \\n\\n\r\nOVERALL\\n\r\n   Fate/kaleid liner Prisma☆Illya 2wei! is a fun entry into the series, and is a worthy continuation. It retains the fun stuff of the first season and improves its story as if it never ended. Although the ending was a tiny bit cliff hanger-ish, another season has been announced. Which is suppose to be the second half to the second series. Anyway, I'm looking forward to it.",
            "date": "2014-11-16T22:59:00+00:00",
            "helpful_count": 7,
            "mal_id": 168925,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4149187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MeowPower",
                "username": "MeowPower"
            },
            "url": "https://myanimelist.net/reviews.php?id=168925"
        },
        {
            "content": "Before I start if you haven't read or seen the first season of Fate/kaleid liner Prisma Illya then either read my review or watch the first season and then come back here. \r\nSo if your still here welcome back to Fuyuki City where Illya's normal life still gets disrupted but only this time by a full blown clone of herself.\r\nIn other words the sequel is even more interesting then the first season as it moves away from the magical girl tropes and into the Fate tropes that everyone knows and loves. keep in mind the Magical Girl tropes are still there but not as muchas the first season.\\n\\n\r\nThe art and sound are beautiful to look at and to listen to as well as this series uses water and bubbles as part of the art style in certain scenes as for the sound well just listen to the ending theme and you would understand why that song was chosen and is part of the story. \\n\\n\r\nCharacter development was key again in the sequel as we see more of Illya's friends and their weird little quirks and other new characters like the servant and someone form the church association but the major character development was Kuro a new character added to the series as she went from I want to kill the person who looks like me to I want to live a normal everyday life like everyone else including Illya.\\n\\n\r\nIn other words I enjoyed the sequel as it had everything the first season had and multiply it by 1000 or a lesser number so if you are looking for a magical girl style anime or if you like the Fate series in general or the first season then you will like this one",
            "date": "2015-04-20T18:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 186057,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4016289.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MRN3",
                "username": "MRN3"
            },
            "url": "https://myanimelist.net/reviews.php?id=186057"
        },
        {
            "content": "It seems contradictory and abominable to follow up a review of an excellent Fate series with a review of a dreadful one, but what better way to kill the anticipation for Unlimited Blade Works’ second season than watching something that turns the entire franchise into a joke? After all, who can’t help but laugh at the giant freaking title? What is it with anime having ridiculously long, pointless titles comprised of gibberish?\r\nIt’s a month after Illya got her magic wand, Ruby, and things are going swimmingly. They’ve captured all seven Clow…er…regular cards (these contain the Heroic Spirits), Rin and Luvia appear to be on friendlyterms (though still hate each other and are only doing it as per orders), and Illya and Miyu are still on their way to being total lesbians. It’s all well and good until they go with Rin to a magical ley line and accidentally split Illya into two personalities. There’s her regular personality, then there’s her grail/Archer self. This isn’t well explained, but it doesn’t matter because Chloe, as she calls herself, is best girl and gets a free pass.\\n\\n\r\nChloe’s character is a mix between Rin and Miyu. Her character starts as the antagonist who wants to kill Illya and take her place, becomes her main rival in love and school, tries to turn Illya’s friends against her,she learns what she really is and her purpose, reconciles with the protagonist, and the two have a friendly rivalry.\\n\\n\r\nThe vast majority of this ten episode series is about Chloe and Illya’s rocky relationship. Toward the end a badass fighter for the church, Bazett, appears for absolutely no reason other than to pad the show out, and then it’s over with pretty much nothing resolved.\\n\\n\r\nI wasn’t as offended by this season as I was the first because it focuses more on the “plot”(what little there is) and most of the annoyances of the first season are gone, notably the shrill fighting between Rin and Luvia.\\n\\n\r\nThere’s great action here and occasionally funny comedy–enough of it to keep the average viewer watching. But it’s still a show appealing to loli-cons so expect scenes taking place in pointlessly half-naked to full-naked places. A lot of gym class bloomers and a lot of nude ten year olds in the bath. Deep lesbian kisses too. There’s the tease of a beach episode at the very beginning that never comes to fruition but I’m certain it’ll kick off the third season.\\n\\n\r\nAnd then there’s Shiro, whom Illya and Chloe are fighting over. Oh, and Rin and Luvia are in love with him too though this little bit of romantic uselessness doesn’t ever go anywhere.\\n\\n\r\nI can’t think of much to say about this show. It’s too short and doesn’t have enough going on to really start a discussion. It’s slightly better than the first season in execution, has good animation, a decent addition in Chloe, and a few good action scenes. But otherwise, it’s a very basic, underwhelming piece of loli exploitation. It exists in a state of perpetual mediocrity, though has a few merits that make it worth a watch if you’re a fan of Kaleid or were mildly amused by the first season.",
            "date": "2015-05-22T10:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 188431,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188431"
        },
        {
            "content": "I've always had a soft spot for Illya von Einzbern. The adorable and dangerously unbalanced young Master of Berserker, with her strange brother complex for Shiro, is probably my favorite loli character of all time. Nevermind that she's 16 in the anime and only looks like she's 11. \r\nIn Prisma Illya, our Einzbern princess actually looks her age, and adventures through a strange mirror of the Fate universe with her magical girl powers. In the first series she teamed up with fellow magical girl Miyu for fanservice, yuri subtext and fighting berserk Spirits trapped within seven cards. This time, while investigating an imbalance in theley lines, Illya accidentally creates a clone of herself, Kuro Illya, who possesses the formidable abilities of Archer. The initial conflict between the two, and their subsequent friendship, are a major part of Prisma Illya 2wei's story focus. \\n\\n\r\nThe early episodes are somewhat low on the action, resembling a Slice of Life comedic anime in their overall style. The fights that we do see are fantastic, with excellent use of CGI and top-class animation that you expect from a ufotable Fate project. There's plenty of yuri fanservice in this part of the series, which may make some uncomfortable and others unduly excited. The second half contains an amazing fight that reminds us what the Fate series is all about, amazing fights between beings of truly mythological power.",
            "date": "2014-09-13T02:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 160117,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/480430.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Blind_Guardian",
                "username": "Blind_Guardian"
            },
            "url": "https://myanimelist.net/reviews.php?id=160117"
        },
        {
            "content": "The fan service was lacking overall and there was a lot of CG for no reason, but I considered it a step up from the previous series.\r\nI typically say to people that if they enjoy mahou shoujo and loli fan service they'll probably like Prisma Illya, but 2wei is where the world building starts picking up steam and the Fate/ references stop being benign cameos and start being important background info and foreshadowing. \r\nBasically this is where stuff starts to get interesting for Prisma Illya, but emphasis on \"starts to,\" because 2wei overall feels like an interlude to the real climax in 3rei. It doeshave a lot of great twists (mostly in the latter half) that are pretty rewarding though. So to that effect this first cour will probably give you some dramatic blue balls, since most of the major plot lines don't even really start 'til Bazette shows up late in the season. \\n\\n\r\nIf you don't like Type-Moon and are watching this for the little girls, then hold on to your butt or prepare to bail in this cour.\\n\\n\r\nThat's it, I'm out.",
            "date": "2014-09-18T18:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 160879,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3093077.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/100gates",
                "username": "100gates"
            },
            "url": "https://myanimelist.net/reviews.php?id=160879"
        }
    ]
]