[
    [
        {
            "content": "Hamatora was a show I was quite interested in prior to its airing. Looking at the key visuals, the characters looked interesting; and the preview video showed some cool superpowers with flashy and colorful animation. But you may think the synopsis doesn't really sound interesting - cool guys fighting with superpowers are an overused trope in anime, to the point where it gets cliché. But wait, Hamatora throws some detective elements into the mix! So, does that make Hamatora an interesting, outstanding watch that puts the superpower guy cliché into good use? Well, as you can see on my final score, I don't share thatopinion. Frankly, Hamatora - The Animation turns out to be a really underwhelming show that ends up forgettable quickly after completing it.\\n\\n\r\nSet in a city where a small group of people with superpowers - called Minimum Holders - exist, the story follows a detective agency called Hamatora, a detective group made of Minimum Holders. Each episode we follow Hamatora solving various mysteries, always caused by another human who posesses Minimum Holder powers. Art, a superintendent of the police, usually cooperates with them to solve the cases, while it turns out that there is a mastermind behind all these mysterious happenings.\\n\r\nThe story of Hamatora really isn't bad - each episode we get faced with a new detective case for our little detective group, and we follow them solve the cases and doing some fighting with their cool Minimum Holder powers. Here and there, we see some hints of an actual plot, which then gets fulfilled during the final few episodes. It could have been developed so much better though.\\n\r\nThe first half of Hamatora (with the episodic short cases) was okay in the aspect that it also presented the antagonist and gave a small development up to the final conflict. The problem here is though that the time was not used effectively. Character development was close to zero, and instead we were presented with some filler-like episodes. Like the beach episode, which was used after a quite dramatic development, which was just completely out of place. And don't even get me started on episode 5, honestly. \\n\r\nThe last few episodes focus on the actual \"plot\" of the series, as already mentioned. It definitely is better than the first half, as the plot thickens and the episodes focus on the main conflict. Sadly we get fed up with an extremely disappointing conclusion, which leaves questions open and brings the story down. Additionally, at some point you aren't really interested in following the story anymore and lose interest more and more as the story progresses. This is mostly due to the extremely weak characters.\\n\\n\r\nAnd this leads me to my next point - the characters, which make up the weakest part in this series. As I've said, with the exception of some backstory hints, there is no real development and we don't get to know much about them. Hell, if they weren't called names like \"Birthday\" and \"Nice\" I don't think I would be able to remember much of them. Nice has some backstory, and characters like Murasaki, Art and Three also have some hints on their past here and there. But the rest gets left in the dark.\\n\r\nEspecially characters like Koneko, Hajime and Master could have easily been left out in their entity and the story could still progress the same, as they don't play any role in the main plot. At all. Maybe they play a bigger role in the manga or the upcoming video game - at least in the anime, they are completely useless.\\n\r\nFinally there is also our \"bad guy\" Moral, who makes quite an underwhelming enemy character. I felt his reasoning for being the bad guy was quite a disappointment - you would expect so much more.\\n\r\nOverall, since we barely get to know anything about the characters - thanks to the aforementioned use of filler-like episodes - so we are presented with characters that we can't relate to or connect with at all. I think this also plays a part why the enjoyment is so little - at some point you do not really care how the story progresses anymore since you can't really feel anything for the characters.\\n\\n\r\nThe art is one of the more positive aspects, the character design is good and as I've already mentioned, the fighting scenes in their full colorful glory were quite a please to look at. The animation was okay too most of the time, though there were some episodes with lots of quality issues present. The music was decent too, with nice opening and ending songs.\\n\\n\r\nBut of course, some art and music don't make an anime, which now leads me to my overall opinion - Hamatora could have been a good and fun show, as the flashy visuals and the superpowers surely pique one's interest, but was brought down by an average plot and unrelateable characters. All this together results in my final score 4/10.\\n",
            "date": "2014-03-25T12:14:00+00:00",
            "helpful_count": 111,
            "mal_id": 136939,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1773935.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/silverwalls",
                "username": "silverwalls"
            },
            "url": "https://myanimelist.net/reviews.php?id=136939"
        },
        {
            "content": "Hamatora is an anime that showed plenty of promise at first. It could have been excellent if not for one major setback: most of the anime is filler. The story is actually great when it gets down to it, but having one of the most thrilling scenes of any show this season followed up by a beach episode before returning to the actual plot just destroys the mood and momentum this show could have built up much more. That's not the only problem, but it certainly is the biggest and most noticeable one.\r\nHamatora is an anime with a similar style to things like Persona 4or Danganronpa which are based on video games (though Hamatora's game has yet to actually be made...). It centers around a group of crime fighting, mystery solving \"superhumans\" called \"Hamatora\" and the other similar groups of people that they know. Most of the main characters have abilities called \"Minimums\" which allow them to use some power when they fulfill a certain requirement (ex. gain super-strength when they take off their glasses). The main characters and members of Hamatora are Nice and Murasaki who are both Minimum Holders (people who have minimums). The story begins with them just doing their usual crime solving and being dirt poor because they don't get enough jobs and a girl named Hajime spends a lot of Nice's money on food. They soon start getting job requests that interconnect and begin to reveal a much larger scale crime.\\n\\n\r\nBut before that all happens, the show has filler. Lots of filler. Most episodes have some small connection to the plot, but that will only be just about a minute out of an otherwise filler-filled episode. Whether it's a beach episode, spa episode with sit-ups (and I mean LOTS of sit-ups), or just some random event involving the minor characters, this show just has too much filler. However, the actual story is brilliant. The show overall resembles something like Psycho-Pass and Darker Than Black in the way the world and the minimum powers work and eventually crumble into chaos. The end of the show is excellent and leaves a possibility for a second season, which I would love to happen.\\n\\n\r\nAs for the characters, they are all interesting but none develop very much or at least get enough screen time to develop. As much as I like Nice and Murasaki, they really don't develop as much as characters in similar shows, and the show only gave small glimpses into their pasts which needed much more elaboration as they seemed very interesting. A detective named Art is also interesting and his relationship with Nice is one of the higher points in the character aspect. Hajime, a girl who hangs out with Hamatora, appears to have the potential to be the main female protagonist at first with her intense hunger driving Nice into poverty, but she ends up only having a minor role with just two big appearances (one being the intense sit-up filler episode; you'll know which one I mean when you see it). The rest of the important supporting characters (who all have random English words for names) are just as interesting as the main cast. They were also given some short backstories, but not enough screen-time either. Hopefully a second season will bring about more of the characters' pasts.\\n\\n\r\nHowever, the best character in this show is actually the villain, Moral. He's just psychotic and and the show does an excellent job of building him up. His scenes with Art and Nice are never bad and are the best scenes in the entire anime. He just wants everyone in the world in to be equal, but that means eliminating those who think differently than him. He's an understandable villain whose goals are similar to those of real life people, but he actually puts his plans into action.\\n\\n\r\nThe animation is generally very good despite the show's obviously low budget. The psychedelic look of when minimum holders use their powers make the action scenes very stimulating to the viewer, and all of the characters designs are great (Honey is especially cute). Moral, Nice, and everyone else look cool and their designs fit their parts well. The emotions the characters show really work well especially for showing how insane Moral is (at least compared to what society considers sanity). The urban scenery and everything else looks good as well. Really all that holds the animation back is just the low budget which is especially apparent in some of the filler episodes in the middle of the show, but the creators at least did a good job of saving the budget for more important scenes.\\n\\n\r\nThe soundtrack is also one of the better parts. It uses a lot of piano tracks with unique rhythms that speed up and down a lot depending on the mood. During the action scenes, rock songs are used. Nice's signature song that plays whenever he puts his headphones on stands out in particular. The OP is also one of my favorites of this winter season.\\n\\n\r\nHamatora may have issues with fillers that throw off the pace of the story and a noticeably low animation budget, but it's still very enjoyable. Even with a poor budget, they make it count when it needs to. The characters just needed a little more development to be really good, but the soundtrack is consistently great and sets a great mood to help fix all of the other problems. Some scenes are amazing and some are just frustrating, but Hamatora is still a fun and emotional anime that better get a second season.",
            "date": "2014-03-26T10:32:00+00:00",
            "helpful_count": 74,
            "mal_id": 137073,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=137073"
        },
        {
            "content": "“You have no business telling me that I’m strong or alone or whatever. In fact, it’s no one’s business to decide who’s weak or strong.” – Nice\r\nHamatora The Animation is one that will leave you excited, shocked, angry, and confused at some point. Set in the year that this anime aired, people in this world will have a power called a “Minimum”, therefore being called “Minimum Holders.”  “It is an extraordinary power beyond the understanding of man that manifests whenever a specific condition is met in the form of an action.” Unfortunately, others won’t have this kind of power because they weren’t born orgifted with it; and that’s when the main conflict starts to head in. They would be seeking power because they are the “weak.”\\n\\n\r\nHamatora itself is made out of a group of people who accept job offers in order to make money. These jobs are usually ones they need to solve or investigate and are offered to them because Hamatora is known to have pairs with special abilities, or said in the last paragraph, a power called a “Minimum.” These special abilities help solve or conclude those investigations. The main investigation is to stop a serial killer targeting Minimum Holders.\\n\\n\r\nThe art in Hamatora is very colorful. One look at this anime and you know there will be flying colors everywhere. Especially when the characters construct their powers, colors are just in there. The characters themselves are also colorful; with what they wear and what item/element they use. There are also very flashy scenes. Other scenes include a bit of gore. The backgrounds are really just casual settings, nothing to fancy and nothing to dull - considering it is set in 2014.\\n\\n\r\nI thought the OP of this anime had that futuristic feel to it. Being set in our current timeline, but with people having superhuman abilities, I think the OP played a pretty good role. The ED, I thought, had that sad feeling to it. It wasn’t gloomy or anything, I just felt like it was playing a sad tune or something. The background music/sounds played pretty well in terms of setting the mood/scene in each episode. But there really wasn't an OST that caught my attention.\\n\\n\r\nWith some there to make all the action, some there just to be funny, and some there to explain situations that viewers need explaining to, the characters in Hamatora are pretty cool, in my opinion. Though their names could have been better, the characters' names are pretty easy to remember - especially the ones in Hamatora itself. The top duo in Hamatora are Nice and Murasaki. Nice being the top Minimum Holder and Murasaki following behind. Other characters included, showed some pretty amazing powers. They made me laugh, tear up, angry, confused, and just simply shocked. Character developments weren't as good as how most anime would develop characters. But they're pretty fun to watch.\\n\\n\r\nOverall, I enjoyed this anime from beginning to end. There were quite a few of cliffhangers - especially the last episode - which kept me kind of clinging on to the series. Though, if this series had a better character development and more episodes that went into the main plot, then maybe this show would have a little more fans. But even so, I think it's pretty entertaining.",
            "date": "2014-03-25T13:15:00+00:00",
            "helpful_count": 62,
            "mal_id": 136945,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3580033.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ScarletCrystal",
                "username": "ScarletCrystal"
            },
            "url": "https://myanimelist.net/reviews.php?id=136945"
        },
        {
            "content": "Certain humans born with special powers. How many series have you watched involved some sort of a similar theme? What Hamatora delivers includes a package of characters known as “Minimum Holders”. Yet everything else it comes with is hardly anything but special. In essence, Hamatora is a sour bag of trite cliches formulated by its premise. For what it’s worth, this show’s is dense with minimal value. \r\nTo trace back a bit, we learn that there are special humans with abilities that are known as “Minimum Holders” in a setting known as Yokohama City. The titular title “Hamatora” is a collectively group of Minimum Holdersfounded by a young man named Nice. Having graduated at the top of his class at Facultas Academy, he forms this group as a detective agency to solve supernatural cases. Whether it puts them in danger or not doesn’t really seem to matter. Because in the end, the goal is to get the job done.\\n\\n\r\nEssentially, the show does its job by presenting various cases on a weekly basis scenario. Later on it shifts to an ongoing arc involving a criminal who is known to go after the heads of other Minimum Holders; or rather precisely what’s inside of their heads. As a supernatural mystery, this should bring together a collection of insight to be explored. Yet, the show often neglects this because of its lazy elements. Even Hamatora itself is known to loft around waiting for clients rather than seeking them out. The whole concept becomes an ennui with the way the story constructs itself. To make matters worse, the characters are generic and lacks connection. What it tries to bring together with a main antagonist often gets sidetracked by non-standardized episodes. It fails to communicate to viewers its point or purpose involving its cases. And the ending? That invites questions from all angles. \\n\\n\r\nBy centralizing a small cast of characters as a collective force, one would expect the show to develop them on a deeper level. Unfortunately, Hamatora doesn’t follow that pattern and relies on its more generic concepts. The crass concept of ‘teenagers with superpowers’ comes to mind easily. After all, most of the main characters doesn’t look old enough to be out of higher tier school. At the same time, none of the characters stands out intelligently by themselves. How can we take a character seriously when our main character is named “Nice”? It doesn’t just cast off itself as him being a non-sensational character. Others such as Hajime, Birthday, and Ratio hardly are distinguishing by their personalities. The aloof writing gives them a lack of connection with Nice and with the audience with their lack of backgrounds. One of the only more dynamic connection that may be noticeable is the “Minimum Holder PI duo”, made up of Nice and Murasaki. But to call them dynamic would be an overstatement considering their lack of compatibility. Rather, it would be more simplistic to say they are partners on a professional level. But going any deeper than that would be laughable with the duo’s connection given their conflicting ideologies, Murasaki’s envy for his partner’s skills, and their ways of dealing with cases. In retrospect, their relationship can be described as oafish. It’s not silly in the way since one half of the duo (Murasaki) sheds off the humor with his serious nature. Thus, it just comes off as dull saturated with toppings of boredom.\\n\\n\r\nThroughout the series, there’s a scenario of cat-and-mouse. It won’t feel like it but the concept is there. This is caused by its odd combination of implied humor with its general premise that comes together as frivolous. But what’s to be taken seriously is a criminal named Moral roaming through the streets. He has made it a goal to kill Minimal Users with his ideological mind. In essence, he comes off as a bigot with the stereotypical attributes of an antagonist. Embracing ideas of humanism, we learn of Moral’s goals for the future and his nature. There’s no mistake to describe Moral as a villain as he cares about no one but his ambitions – to make equality. In one specific episode, he even tries to murder a character for rejecting his offer. While this all may spark interest for viewers to see how far his goal comes across, it ultimately demonstrates a cliched and predictable outcome. There’s little insight going about his morality given the lack of characterization in Moral’s character. At the same time, it demoralizes the series’ story with an abject way of structuring its episodes. In other words, the series quickly shifts itself between its main story to its nonsensical episodes aimed for eye candy.\\n\\n\r\nWith a concept of super powers, you’d expect a deeper exposition right? Well, on most standards, the series only explains itself with weak effect. Minimum powers are only explored on the surface by showing, rather than telling such as the case of Hajime. Only a few characters such as Honey gets a bit of characterization with their back-stories. But what comes together as a unity ultimately is blend thanks to everything going on at once. It’s not just cliche but just badly formulated together as a whole.\\n\\n\r\nIt’s also difficult to fathom this show’s comedy on a variety of levels. This is illustrated by the dialogues delivered with cheesy execution, weak interactions, and jokes that sometimes makes almost no sense on occasions. The more concrete moments involve a deeper conversation between Art and Moral in the latter half of the show. At its climax, it delivers our villain’s message. Yet, this only comes as ephemeral as his lecture may be forgotten easily with the absurd story structure. Also taking on a mystery genre, the cases themselves started out with interest and even demonstrates some mature scenes with its debut. While this works out at first, it dies out quickly as viewers will find themselves questioning why they should care. Most of the cases lacks strength with morality. In general, it doesn’t let viewers draw in what they are interested from these cases. It’s also throws in random gags, background characters that somehow gets caught up with the mystery, and in general weak delivery.\\n\\n\r\nHamatora isn’t entirely filled with intolerable holes. There are some parts that are worth of praise such as the action. There’s strong evidence given the serious nature of Minimum Holders and why the public holds different opinion of them. By action, Minimum Holders deliver supernatural feats that are astonishing. Fights are intense on most scales and although doesn’t last long can leave an impression. While the characters (mainly Minimum Holders) lacks characterization, they don’t frustrate viewers to give them pity as most of them are capable of fighting themselves. In other words, they don’t come off as weaklings to despise on. There’s also a bit of anticipation coming together in the latter half of the story involving identity issues and what’s to expect from certain truth being potentially discovered. While it lacks a laudable mystery delivery, it does keep viewers from watching this show to anticipate to see what happens next.\\n\\n\r\nDescribing Hamatora’s art is easy to see with the eyes. The colorful exposition is there with fantastic action made up of explosions, knuckle sandwiches, and violence. Minimum Users’ abilities is intense as fans may expect and the artwork captures the majority of that. On the other hand, background artwork lacks any distinguishing features and the way characters are designed are generic. It isn’t even original considering that Yuki Kodama, whom previously worked on Blood Lad traces its designs. They don’t look just similar but hardly has anything to write home about. \\n\\n\r\nSoundtrack stands out as one of its strengths. It is noticeable with alternative ways and well-coordinated delivery of its OST. At same time, it can keep up with the momentum and matches it consistently. Similarly, both the OP and ED songs delivers well with appropriate instrumentality. The mixture of its rock and techno notions also captures its moments. In general, it will leave an impressions for the audience. But on the topic of voice acting, some of the characters lacks strength in delivery in particular Nice and Murasaki with their chemistry. Moral’s lectures can also feel monotonous and seemingly forgettable despite his persistence.\\n\\n\r\nThis review didn’t take too much thought to write thanks to Hamatora’s lack of thoughtfulness behind its concept. Expectations coming into this show should be minimal with a potential case of being put to the ‘on-hold’ list. The story clustered with cliche characters doesn’t bring out anything special. Neither are the cases with their ridiculous jokes, hopeless messages, and whatever purpose it tries to deliver. Yet, the technical aspects of the show can keep it together at some instances. And as a supernatural mystery how, you’d need patience to get through Hamatora to experience what it has to offer. Still in the end, it’s just another formulaic throwback that doesn’t add anything more for its generic thought. \\n",
            "date": "2014-03-27T00:47:00+00:00",
            "helpful_count": 61,
            "mal_id": 137181,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=137181"
        },
        {
            "content": "The progression of my reaction to Hamatora can be summed up as the following:\r\n\"Oh this is interesting..ok..ok?...wait, WHATTT?!?!  \r\nHamatora is a mystery/supernatural based anime with some comedy mixed in.  Sounds somewhat generic but what sets it apart are the unexpected twists, the small gaps within the story in this series, and the last episode.  \r\nThe artwork and music are both not outstanding in particular.  Enjoyable but nothing that screams \"NOTICE ME, I WANT YOUR LOVE.\"  There isn't much character development, however, that's not to say that there aren't interesting characters...I can think of at least 4 characters whose character andback story intrigue me.  \\n\\n\r\nYes, the beginning is somewhat slow, there is a random filler here and there. The entire series snowballs quickly after the last filler and turns into an avalanche that is only stymied by a wall known as \"Second Season.\"  I normally don't go too crazy over second seasons but this is one of those animes that makes me wish I knew how to speak Japanese so that I could somehow bribe the creators to release the second season soon (perhaps, next week soon?) and to please not screw the second season.  If it goes the way most of us would want it to go, there will be more explanation of certain characters and of course, what happened in the last episode.  \\n\\n\r\nIf I had to give only one reason as to why someone should watch Hamatora, (as if I haven't repeated it enough times) I'd say do it for the ending. In the words of Nike,\" just do it\".",
            "date": "2014-04-02T18:54:00+00:00",
            "helpful_count": 39,
            "mal_id": 138389,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/730333.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/neropepero",
                "username": "neropepero"
            },
            "url": "https://myanimelist.net/reviews.php?id=138389"
        },
        {
            "content": "“All human beings can only perceive the world through the filter of their values. Mediocre values may be harmless, but they are also utterly worthless.” - Moral\r\nStory (7/10)\r\nHamatora is the collective name of a group of detectives, who solve various cases in order to earn a living. Sounds rather standard, doesn’t it? Well, not exactly. All the members of Hamatora poses some superhuman power, be it incredible speed, or inhuman strength. These are known as ‘minimums’, rare innate abilities which only a small percentage of humans can use. Of course, regular citizens have no idea of existence of such individuals, in order to protect theminimum holders from discrimination due to envy. A safe balance, allowing for a normal life for all humans. What happens when a certain someone who desires to tip the balance and send the established world into chaos appears? That you will have to see for yourself.\\n\\n\r\nMostly, when people speak of Hamatora, they mention the genres ‘superpowers’, ‘comedy’ and ‘mystery’. While this is true, I believe Hamatora deserves another tag, namely ‘psychological’. Once you watch a few of the first episodes and get down to the plot and the main villain, strong reasons for such a category emerge.\\n\\n\r\nThough many accuse the series to be avoiding its own plot with episodes known as so-called ‘fillers’, this isn’t entirely true. Yes, there are quite a few episode which don’t exactly pertain to the plot, but there is a method in this madness. This is the producers’ sneaky measure of slowly revealing the plot to us. We are introduced to the characters and have some time to become familiar with them and the relationships between them. Meanwhile, as our brave detectives continue solving supposedly unconnected cases, all of them start to connect and suddenly the plot is right in front of our eyes. True, it may not be the most effective and interesting way of presenting the story, but in this case it works. Even during later episodes where some of them seem to have not much in common with the development of events, there is usually at least one connector to the main plot, which reveals more of the truth to us. Certainly, there were animes which have done it better than Hamatora, but this was a pretty good attempt at this strategy. Or at least, not a painfully bad one.\\n\\n\r\nArt (7/10)\\n\\n\r\nThe art in this series is absolute eye-candy. The colorful character designs and the no less vivid backgrounds are simply pretty and enjoyable to look at, as well as serving the purpose of creating a certain atmosphere. The slight issue which I had with the graphics was the odd-looking gradient on certain objects and characters, but this is more of a personal preference. As for a low-budget series, the graphics are kept at a surprisingly high standard.\\n\\n\r\nSound (7/10)\\n\\n\r\nThe soundtrack may not be a particularly memorable part of the series, but it left me with a good impression. Sometimes cheery and invigorating, other times grim and eerie, the soundtrack reflects the atmosphere of the series in all aspects. This also goes for the opening and ending. They simply fit the style of the anime. I particularly enjoyed the ending “Hikari” performed by Wataru Hatano. It had a certain sense of power and intensity to it.\\n\\n\r\nCharacters (8/10)\\n\\n\r\nThese days it has become increasingly difficult to create a series with relatively original characters, but Hamatora seems to have done a pretty decent job in this field. Most of the main characters don’t fit into the standard archetypes we have become so familiar with. Moreover, the writers managed to keep all the characters varied. Whether it was personality, appearance, clothing or even attitude, they  were all different in each of the main characters. \\n\\n\r\nMany reviewers write about the lack of character development in the series. While this is true, it is also worth mention that with the amount of characters we were presented with and only 12 episodes to fit this part of the story in, this should be understandable, at least in a small extent.\\n\\n\r\nAs you’ve probably figured out, the members of Hamatora are our protagonists. I shall not go \\n\r\ninto detail about most of the MCs, since it would take quite some space. However, there is one character I would like to present closer, as he may just be the trump card, which makes this series worthwhile – the antagonist.\\n\\n\r\nMoral’s ideology is simple and straightforward, yet his means of achieving his ultimate goal are wicked, but logical in a way. But psychotic as he may be, he is relatable. He is by far, one of the best antagonists I have seen in an anime so far. Why? Any guy can do bad things for the sole reason of being evil, but Moral? Oh, no, he believes he is doing the right thing. He is trying to save humanity, after all. He is the best type of villain a series could get – a villain, who considers himself the hero.\\n\\n\r\nEnjoyment and Overall (7,5/10)\\n\\n\r\nI will admit, Hamatora is neither a masterpiece, nor a breakthrough in the anime world. Even so, it was an enjoyable series, which kept me curious through all 12 episodes. There were moments which got me excited, left me hanging or even made me shed a tear or two. It was a solid position, but also nothing that you would regret missing. I wouldn’t recommend this series for people expecting a fast pace and quick development of events . I’d say it’s more of a… reserved, relaxed series for watching during a longer weekend.\\n\\n\r\nIf you have the time and the patience, give the series a try. Who knows, perhaps you might turn out to love it?",
            "date": "2014-07-27T10:06:00+00:00",
            "helpful_count": 24,
            "mal_id": 153949,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2968879.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BlueOla",
                "username": "BlueOla"
            },
            "url": "https://myanimelist.net/reviews.php?id=153949"
        },
        {
            "content": "The concept of Hamatora sounded interesting, but its execution was horrid.\r\n*Tiny bit of spoilers\r\nStory 3\r\nMore then four of the episodes felt like filler episodes.  Honestly can't remember the plot because they were so boring.  The main story is very lackluster on top of that as it is little deeper then the description provided for an explanation of what the series is about.\r\nArt 8\r\nThis is where this show excelled and made me watch the rest.  The fights were so evenly distributed to all the characters you didn't begin to get bored of their lack of deviation of abilities or how they used theydoing fights till the last episode.  It almost felt like the numerous boring characters were just there to be pretty to look at and watch fight.\\n\\n\r\nSound 6\\n\\n\r\nWas decent suffered from the same problems as the art as it got stale after awhile and wasn't memorable.  Still enjoyable rock and normally used at appropriate times.  It got a 6 simply because the OP was pretty bad.\\n\\n\r\nCharacter 1\\n\\n\r\nIts been along time since I have been so uninterested in an entire cast of characters.  To start their motivations are either overly petty or so completely looked over one can never tell why they are doing things.  The only person who thats clear with is Moral who they developed little to no back story for.  The characters they gave back story for was either hastily told (Birthday and Ratio) or so blatantly obvious of a cliche (Three) there was no need.  Also the amount of time they dedicated to three was unnecessary.  Also those two kids who they saved early in the show keep reoccurring for NO APPARENT REASON.  They were boring had no powers didnt help progress the story character development or anything else in the show.  With an already overly large cast for a 12 episode season why in the hell would you add focus on more characters?  Honestly if you want to see what not to do when making characters for a story just watch this.\\n\\n\r\nEnjoyment 4\\n\\n\r\nIt didnt capture me in anyway shape or form except for the art style.  If I hadn't begun watching this the week before it ended I would have never finished it.  It has its moments however but they are never the scripted ones (if a \"dramatic\" scene is coming up be prepared to be disappointed) however the fight heavy episodes were fun to watch.  Also I found the first 3 episodes enjoyable and if it had solely stuck with the Private investigator thing it could have been a better series. \\n\\n\r\nOverall 4\\n\\n\r\nFeels rushed in every sense.  Wouldnt suggest watching it",
            "date": "2014-03-26T20:18:00+00:00",
            "helpful_count": 17,
            "mal_id": 137147,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Swagstorm",
                "username": "Swagstorm"
            },
            "url": "https://myanimelist.net/reviews.php?id=137147"
        },
        {
            "content": "Hamatora is a series that was indeed interesting at first. We got detectives with minimum powers solving cases and mysteries. Unforunately, the plot of the story is not focused.\r\nOverall, this show didn't put me to sleep, which is a good thing. It is indeed interesting at parts, but that doesn't mean the show is good. The show entirely squishes in pointless filler. The plot suffers tremendously from this. In the last episode, Hibiki, the screamer dude was mentioned, but he only showed up in the manga.\r\nLet's get into the characters. Nice, our gary stu character was indeed interesting in some aspects. His belief on \"itdoesn't matter if you have a minimum or not, you powerful if you believe in yourself\" or something like that was good, but no emphasis nor character development was put into him. Other casts like Murasaki, Hajime, etc. are not important. No importance, it's just focus on solving case of characters that have no purpose, and the cell phone texting to Nice is an excuse to make them important, which they are not.\\n\\n\r\nArt is an interesting characters. Character development, interesting, but his resurrection did worry me a bit. I guess we have to wait for second season for the show to explain this plot device, whether it will be good or crap.\\n\\n\r\nEnding was absolute crap. \"Plot twist! The End! Come back next time!\" Are you serious!? This is shitty writing!\\n\\n\r\nThe sound was good. The opening and ending are enjoyable to listen along with some OST.\\n\\n\r\nOverall (3/10) This means 'Bad'.",
            "date": "2014-03-29T15:19:00+00:00",
            "helpful_count": 14,
            "mal_id": 137765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3501491.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/PenX",
                "username": "PenX"
            },
            "url": "https://myanimelist.net/reviews.php?id=137765"
        },
        {
            "content": "Alright, first review. Anyways I felt the need to write this because this Anime is a hidden gem and it's also one of my favorites.\r\nStory 7/10 - The plot had an interesting premise. People are born with super powers and they keep it hidden because they might get oppressed due to it. Hmm...sounds like X-Men. Anyways I don't know enough about X-Men to compare them further. The story starts out episodic with the Main Characters running a detective agency, doing whatever jobs they can to support themselves. All the while in the background the main plot slowly blooms until it matures and comes out. Youget the main villain etc. It's not really deep either, and the episodic start and jumping around might turn people off. It's not bad by any means though. \\n\\n\r\nArt 8/10 - Personally, I think the Art is great, 10/10. But it's extremely colorful and some things may seem off, which can turn people off. Not much else to say, it doesn't diverge too far from the norm really.\\n\\n\r\nSound 8/10 - Just like with the Art, the sound is good. It's a nice mix of Techno and J-Rock. Which aren't for everyone,  but the Techno really fits with this Anime. So it really depends on individual preference.\\n\\n\r\nCharacters 8/10 - I think this is where the Anime really shines. The main duo is done well enough. The MC, Nice, is a genius, he's quirky, but can get serious very fast. He is also the strongest out of the Protagonists. Then we have his friend Murasaki, he is the calculative more mature type. Although he secretly envies Nice. There are a few more, Ratio, Birthday, Hajime and more all with varying personalities and agendas. Honey and Three are probably the second best duo and they're done well. Especially Three's back story.  So yeah, main draw point is the cast and their interactions. \\n\\n\r\nOverall 8/10 - If you're into something kind of hidden, but enjoyable definitely give this a shot. Season 1 is only 12 Episodes after all. You can blast through it, or if you don't like it drop it early. But it doesn't hurt to try it. Especially if you're looking for some nice Action with a great cast and OST.\\n\\n",
            "date": "2014-10-24T18:19:00+00:00",
            "helpful_count": 13,
            "mal_id": 166033,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3980035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xDarkrai",
                "username": "xDarkrai"
            },
            "url": "https://myanimelist.net/reviews.php?id=166033"
        },
        {
            "content": "Tried to keep spoilers to a minimum.\r\nI am personally not a fan of animes with the tag \"The Animation\". My first was Persona4, which was a huge disappointment, followed by Devil Survivor 2 which was ok, and Danganronpa which had potential to become better but was needlessly butchered. But Hamatora The Animation is on a different league, and it probably wouldn't be good to club it with others with the same tag.\r\nThe art (not the character Art, no pun intended) was good, decent at its best, and nowadays most animes have great visuals and since it is not disturbing or anything imo Hamatora shouldn't reallybe judged too much on this factor. The sound though was cool and definitely flows with the atmosphere, in fact moral's ost is one of the best I have heard in horror genre. \\n\\n\r\nAccording to the story, there are some people with minimum's ability, which is a special ability and allows them to carry out superhuman jobs and they need to do something in order to activate their ability. This isn't new as the idea has already been explored in animes like Darker than Black, or Law of Ueki. But the different setting played, apparently gave the vibe of an episodic anime with interesting cases, and with each case the story moves forward in a slow but steady manner. It gradually picked up correct pace after the initial plot was set, and then on there wasn't any reason to look behind. It clearly established itself to be different from all its rivals, of its genre and success is attributed to strong main storyline. In short it takes some time to develop the story. The actual plot is quite interesting, it is a clash of ideologies, clash of instincts, clash of power, clash of emotions, between the mc and antagonist. Hamatora as we are introduced in the initial eps is a detective agency, and as we might expect they work on different cases. And is just as one may predict that this being a 12 ep anime would primarily focus on the mastermind of all the crimes. This added with few action packed scenes makes it watchable for the first few eps. Each episode comes with the character development of one or the other side characters and has an adhesive effect which keeps us glued to the anime. Even then tbh, I had grown an incentive to drop the series, but thank god, I didn't do such a regretful thing, because it became really interesting in the latter half.\\n\r\n \\n\r\nThe characters is what really made the story incredible, and prompted me to give a 9/10 overall. Everything is very distinct about the characters, starting off with the names (seriously names like Nice, Art, Ratio felt a bit peculiar), to their roles. Nice is one of the best and op mc and to know the reason one has to watch the anime. His partner Murasaki and other side characters mostly serve to connect different strings of  cases, and exists as a tool for us to know what is in mc's mind. Apart from connecting different cases they, mostly add to the narration, comedy, and are just an added spice to the anime. Moreover some characters also receive a backstory, and their characters are amply developed mostly through their adventures in cases. And finally, the antagonist (to avoid spoiling I will name him X). Just like one can't clap with one hand, awesomeness of the MC can't be exhibited without a strong antagonist. In fact whatever X did can't be called as wrong, nor what the mc does can be certified right. Following Doflamingo's(one piece ref) words \"justice shall always prevail, because the winner claims justice\", I wouldnt be surprised if a new anime came and reversed the role of mc, x. At few instances I had no counter to x's views, everything he said seemed piercingly right, but all this shall be cleared once one has watched the whole anime. All in one, both the MC and X are responsible for the good storyline.\\n\\n\r\nSome other factors which contributed to the enjoyment were the realistic deaths, and somewhat psychological acts of people, and characters perception of strong vs weak. The only con I can spot is that it kinda wasted the first few eps, and escalated in the later half, but this has been a law rather than exception. As a side note I wrote this review before watching the last ep! and something very very unusual thing happened. If it was gonna be 24 ep long I might have even given this an unbiased 10.\\n\\n\r\nFinally, a note for all those who dropped the anime after first five eps, plz reconsider as shit gets real after that.",
            "date": "2014-03-26T03:31:00+00:00",
            "helpful_count": 12,
            "mal_id": 137043,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3561477.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Overhaul93",
                "username": "Overhaul93"
            },
            "url": "https://myanimelist.net/reviews.php?id=137043"
        },
        {
            "content": "All the colours of the rainbow!!!\r\nThe best thing to say about the show is it's really colourful in a fresh way. This supplements the opening and endings really well.\r\nNext to that there's not much to this show.\r\nThere's some really cool character designs, though it's just a shame they weren't given real character. Any character development is outshined by it's plot development. Which is funny 'cause... it's pretty awful.\r\nJust as it seems like knows what direction it wants to go, it takes a very confusing turn everytime. Don't mistake this for plot twists 'cause it's nothing more than bad writing.\r\nThere's potential here, with the cool characterdesigns and a chance to make a good  story, asking questions on what is morally correct in this world.\\n\r\nThe show gives you this sensation. It's like you can feel everyone viewing this, cheering it on. Saying something like \"Come on you can do it\". But it gets shut down in a manner in which the show makes a joke on that very trope in anime. (Gotta give it props for that. That was kinda funny.)\\n\\n\r\nThere's not really any build-up to anything and the ending is just god awful.\\n\\n\r\nMy personal greatest problem with this show is the character Hajime.\\n\r\nOne of my first reactions was \"Hajime seems like a really cool character\". Seemed like she'd become something great, not disappointing on the badass factor either. All the way through though, she's just someone in the background. When she finally gets a moment in the spotlight it's so incredibly weak, it's unbelievable. Such a cool character design, not put to its full potential is a damn shame.\\n\r\nI guess you could say that for just about any of the characters, really.\\n\r\nI namely liked the character called Birthday... Until everything that made the character seem interesting got brushed aside.\\n\\n\r\nThere was potential here. There really was. But oh well...\\n\r\nFrom what I can understand, there's a video game coming out too. I feel like this show was just to promote that, really. And for that, the art style delivers. This show could make for a great game. Though that's no excuse. It won't save this anime from getting harsh critique.\\n\\n\r\nHamatora: The Animation is visually appealing, but completely forgettable and avoidable.",
            "date": "2014-07-21T16:58:00+00:00",
            "helpful_count": 9,
            "mal_id": 153141,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2666883.jpg",
                "scores": {
                    "animation": 9,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Republic",
                "username": "Republic"
            },
            "url": "https://myanimelist.net/reviews.php?id=153141"
        },
        {
            "content": "Wasn't gonna write a review for this one. Did it anyways. ¯_(ツ)_/¯ \r\nStory: 9\r\nHamatora gets a 9 in my book. Maybe I'm a sucker for episodic animes with a hidden plot backbone (Akuma no Riddle was a personal favorite of mine in this category) but I really feel like Hamatora took its plot in the right direction. Some episodes seem fillerish or too forced, but then by the end you realize that the events of the episode connected back to the plot all along! The last episode left me needing more, and when I found Re:_Hamatora, I was incredibly disappointed in the quality of thesecond season (I could go more into that, but let's just say I didn't enjoy it nearly as much as season 1). The only real problem I have with it is the direction season 2 took, but maybe I should leave that out of my review for Hamatora? Eh, who knows.\\n\r\nArt: 8\\n\r\nHonestly this would get a 9 if the distance models weren't... interesting. The closeups and backgrounds were stunning, and the take on flashy colors and glitches gave a stylistic feel to it, but when it all got down to it, the distance renders were SOOOO BAD. Otherwise, good job with the art.\\n\r\nSound: 9\\n\r\nOkay the first opening was mediocre at best. The visuals were great but the song was basic and didn't leave an impression, nor did it really catch my eye. Re:_Hamatora certainly had an incredible opening, but that's its only salvation. Despite the OP, I gave sound a 9 because the OST was always pretty fitting and the voice actors were always really convincing.\\n\r\nCharacter: 6\\n\r\nEEEEHHHHH.... Hamatora's characters in the first season had little depth. They really seemed like they never developed by the end of it, ESPECIALLY Hajime. She had a lot of potential as a character, but she hardly spoke in the first season and then became a ditzy love interest in the second season. Birthday and Ratio got one episode of development and backstory and then their characters weren't touched on again. Murasaki, a MAIN CHARACTER, PART OF TEAM HAMATORA, got less screen time than Art, a character who lost his relevance half way through the series, and not even half the amount of development! If you want an anime for its characters, Hamatora isn't a good choice for you.\\n\r\nEnjoyment: 9\\n\r\nMy own personal experience with Hamatora was a good one, honestly. I really loved the story and its uniqueness, and the art was really alluring. I could go on for days about Hamatora and Re:_Hamatora's flaws, but honestly they didn't affect my enjoyment THAT much. It was a fun anime to watch in my free time and I really did like it. I'd recommend it to anyone looking for an episodic anime with a plot in the back. It's kind of a low-maintenance anime which I really liked, since I watched it in the hospital on my tiny phone screen with IVs in my arms. If you're looking to pass time, go for Hamatora, but be prepared for a god-awful second season and a LOT of plotholes.",
            "date": "2015-05-03T10:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 187039,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4444492.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gaysocks",
                "username": "gaysocks"
            },
            "url": "https://myanimelist.net/reviews.php?id=187039"
        },
        {
            "content": "Hamatora the Animation takes place in the world where some humans are born with superpowers. Pretty typical setting. Let's try again.\r\nHamatora the Animation takes place in the world where people are born inequal. Sounds vaguely familiar. I think I've seen this before. /looks around/\r\nHamatora the Animation takes place in the world where some of the powerful have The Idea how the world should be made right. Now /this/, depending on what they have in mind and how far they are ready to go, just might become interesting.\r\nDid it? Well, it depends. On a surface it's somewhat entertaining story, with a few plot twists and afew seemingly random episodes (beach!), presented in bright acid-colored animation. Not bad overall, not particularly good either. On the other hand though underlying themes felt unusually relevant.\\n\\n\r\nTo give a brief overview: Outlook on the world and personal relations of those strong and weak. Power and responsibility (or lack of thereof). Different perspectives of those on top, those striving to move up and those who just want anything not fitting in their little world to disappear. Xenophobia. Dismantling security as a necessary condition to bring changes to society... Some of it was pretty far-fetched, some almost scary in its realism.\\n\\n\r\nI can't say the themes were developed very well. At the end preaching of main villain became simply annoying, so forceful and repetitive it was, but I have to commend authors for a decent attempt regardless. \\n\\n\r\nTo sum it up, for me it was one of those titles which don't look like much on the outside, but at the same time have enough hooks and sharp edges to wake up your mind and a bucketload of messy social issues to chew on if you are so inclined.",
            "date": "2014-03-30T15:43:00+00:00",
            "helpful_count": 8,
            "mal_id": 137953,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1337109.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Elfster",
                "username": "Elfster"
            },
            "url": "https://myanimelist.net/reviews.php?id=137953"
        },
        {
            "content": "Hamatora is one of those anime which i watched with no prior knowledge of what kind of show this is or should i say with not much expectations .Rather i just happened to find it randomly and decided to watch. Surprisingly enough I really enjoyed it .The character development throughout the series is really good if you ask me. Each character has taken its own time to develop and also the protagonist Nice has a pretty interesting ability and background story.\r\nMany seemed to have disliked the anime , maybe because they had a lot of expectations build up,can't say for sure why, but if youlike action anime with supernatural powers, a good plot and certain twist and turns this is a treasure box buried in the ground for you guys.",
            "date": "2018-05-20T04:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 280991,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7122015.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/blank28_",
                "username": "blank28_"
            },
            "url": "https://myanimelist.net/reviews.php?id=280991"
        },
        {
            "content": "STORY (7)\r\nHamatora the Animation takes place in a world and time similar to ours except that there are people with supernatural abilities or \"minimums\". The story focuses on an odd jobs / detective group composed of minimum holders called Hamatora.\r\nThe series is mostly episodic following the adventures of the main protagonist, Nice, and his partner Murasaki. Majority of the episodes follow a format where each pair of Hamatora minimum holders take separate cases and as the episode concludes, it is revealed that all the cases are related. This would've been okay for the first few of the 12 episodes just to introduce what Hamatora doesbut it drags almost until the end. In my opinion, there were episodes which could've been better spent focusing on the main plot. If the series was longer, it would've been more acceptable.\\n\\n\r\nThere's a major plot in the story as we are introduced to the main antagonist, Moral, and it unravels bit by bit per episode. That was probably the only thing that kept me watching this show every week. Without spoiling, the main plot is nothing out of the ordinary but how each portion is revealed was satisfyingly done. \\n\\n\r\nThe show loves to drastically switch between absurd humor to shockingly tragic with occasional gore and violence. Prepare for your emotions to get toyed around.\\n\\n\r\nI won't comment on the ending since there's a possibility of a second season or OVA.\\n\\n\r\nART (7)\\n\\n\r\nThe art of Hamatora the Animation is on par with most series nowadays. I love anime with very bright colors and this show is one of them.\\n\\n\r\nThere are scenes which felt under budget or poorly made. I can dismiss badly drawn parts but there are scenes in the show that they even skipped a few frames in the animation. Most of the backgrounds had enough detail which is probably the only saving grace in this area.\\n\\n\r\nThey also play around with textures overlayed on the screen. I thought my TV had some smudge because of this. They also used rainbow-like filters whenever a minimum gets activated. Whether you like or hate these is your personal preference. CG is decent in the show overall.\\n\\n\r\nCharacters are very unique compared to most animes, making each easily distinguishable and memorable. Aside from this, most of the Hamatora minimum holder have some kind of distinct element in their character design that's related to their powers (e.g. Nice and his headphones, Three and his lion-like appearance). \\n\\n\r\nSOUND (8)\\n\\n\r\nThe show has a good sound track. Nothing that would make you wow but good enough to build up the scenes. The OP and ED tracks are likable as well.\\n\\n\r\nThe VA's did an okay job throughout the show. However, there's barely any scene in the series that drew out intense emotion from a character. And for those few scenes, it wasn't the VA that pulled me in but rather the shock of the sudden change in the plot.\\n\\n\r\nCHARACTER (6)\\n\\n\r\nThere are so many characters in this show. The Hamatora group alone has 10 characters. You also have major characters like Art and Moral. And on top of that, you have supporting characters and not-so-significant characters that are shown even in the ending. I liked the wide range of characters. It reminded me of Durarara!! and Bacano! But this does not go without a toll for the limited 12 episodes.\\n\\n\r\nThere's no major development for any character. There's also a lot of imbalance as to who gets screen time. For example, Honey and Three gets a decent character background and revelation of \\n\r\ntheir powers whereas Hajime (whom you'd think at the beginning of the is the 3rd most important protagonist) is almost always shown eating and she's barely involved any of the Hamatora cases.\\n\\n\r\nNice, the main protagonist, feels too easy-going. And when coupled with him being a prodigy minimum holder, he's almost never shaken throughout the series.\\n\\n\r\nThe spotlight goes to the main antagonist, Moral. He's your typical psychotic bad guy who's obsessed with the main protagonist, Nice. But because the storytelling of Hamatora's major plot was executed well, you're most of the time caught off guard by Moral's schemes.\\n\\n\r\nCharacters are very uniquely named. Nice, Art, Honey, Three, Moral... This was very peculiar for me but it made remembering names easier.\\n\\n\r\nENJOYMENT (8)\\n\\n\r\nI have mixed feelings for this show overall. For the story, I hated when the plot seems to escalate and then next episode, we're back to the slow-paced detective cases. Again, the only thing that kept me was my curiosity of the major plot that was unraveling. It's a show that's okay to watch but not too excellent that I'd re-watch one more time. \\n\\n\r\nDespite everything, I continued to watch this show until the end and I'm looking forward for the next season or OVA as hinted by the last episode.",
            "date": "2014-03-25T15:52:00+00:00",
            "helpful_count": 7,
            "mal_id": 136971,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160941.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pyrogate",
                "username": "pyrogate"
            },
            "url": "https://myanimelist.net/reviews.php?id=136971"
        },
        {
            "content": "I never drop a series (anime or tv), movie, book or manga, even if it sucks. I try to watch or read it till the end. Perhaps it's the hope that maybe, just maybe, it'll get better. Sometimes, it does get better. Sometimes it doesn't. I held the same hope for Hamatora. \r\nStory: 3/10\r\nThe story revolves around \"Minimum\" or \"minor miracle\"—special hereditary powers discovered only in an extremely limited number of humans. Those who possess such powers are known as \"Minimum Holders.\"\r\nCould've been a lot more, but sadly failed. One of the worst villains too.\r\nArt: 7/10\r\nAt first, it was really good. I love the colourfuleffect when Minimum Holders use their ability and the combination of colours is also good-it seems fresh.\\n\r\nIn some episodes, especially in ending ones, the art quality dropped a bit. There wasn't a lot of detail, it looked rushed, faces looked kinda contorted, as if not enough effort was put into it and that's one of the things that really stings me.\\n\r\nThat happened in only a few episodes, so a 7 it is.\\n\\n\r\nSound: 6/10\\n\r\nThe sound was okay, in some scenes it really fit in, sometimes I didn't even notice it. I can remember a few times the soundtrack was completely off too, but luckily, that was rare. The overall soundtrack isn't extraordinary. The OP and ED were fine too. The OP is very good, Yuuki Ozaki's voice is perfect for the song. He also sang the OP for Zankyou no Terror, and as I saw he also did the one for Hamatora, I was excited. The song is energetic and kinda reminds of Nice-kun. ED wasn't bad either, but I prefer ending songs to be paced slower. \\n\\n\r\nCharacter: 5/10\\n\r\nThe characters. Pfffff. Could've been so much more, but it's like the ones in charge of this anime didn't bother. In a few eps, we are told a bit about some of the characters stories and background, but mainly, it's just shady details. The only ones I do remember had a proper story are Honey and Three, and we found out a bit about Ratio and Birthday too (not very in-depth though). The character we don't know anything about, except she likes food, is Hajime. That's it. She also used her minimum for maybe 2, 3 times in the whole season? A waste.\\n\r\nA point has to be made about the villain, Moral too. He is revealed as a villain in the first or second (I don't really remember) episode. At the beginning, basically. I don't like him. He is just too dramatic. His voice is so annoying and the stuff that comes out of his mouth.. The dialogue was just terrible. At some point, I wouldn't be surprised at all if I learnt a third grader wrote it.\\n\\n\r\nEnjoyment: 3/10\\n\r\nAs said, the first few eps are good, then the quality drops. Sometimes, just as the story starts moving, something completely irrelevant comes in. Not even a plot twist, it's just an irrelevant occurrence. \\n\r\nSometimes in anime, the beginning episodes do have these random things to set up the atmosphere, but it should not happen in the middle of the anime as it only disturbs the pace.\\n\\n\r\nOverall: 5/10\\n\r\nAnd perhaps even a five is to generous? The beginning was promising, but the anime definitely disappointed me and when I saw a friend was watching it, I told him he should read some of the reviews here and leave it be. There are plenty better series that don't disappoint, go watch those instead and leave this one be.",
            "date": "2014-12-31T02:32:00+00:00",
            "helpful_count": 7,
            "mal_id": 175347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3575681.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Axernea",
                "username": "Axernea"
            },
            "url": "https://myanimelist.net/reviews.php?id=175347"
        },
        {
            "content": "In the world which we live in chosen have been granted abilities of superhuman nature by birth, with the blessing of having power to claim salvation or devastation comes the ideology and battle between the weak and the strong. Should the episodes grasp your opinion or should it extinguish the flames of equality? Could it open your heart out for the people deemed without the fortune of having such, that is the question of and for private detective agency Hamatora.\r\n____________________________________________________________________________\r\nStory - [ 5 / 10 ] [ Has/Had potential only to be ruined by poor writing of two different minds ]\r\nMain protagonist is a youngboy seemly named [Nice] During the story we will not know much of the history of him nor the very close partner that he works along with [Murasaki] During the twelve episodes we'll join them and rest of the two on two teams of café nowhere to a short journey only unfold foolish and unclear missions for almost faceless people of horrifying \"filler\" episodes. Story is clearly written by two different persons and both wanted something else.\\n\r\nEvery second episode has fun and humor on the side dish, as the very next one would be without humor to assess the real problem and grim situation of the very world?\\n\\n\r\nI know what i wrote, and people who love the sort of \" battles \" of minds and ideologies are on the same page with me on this one. What is truly right and what is not? The story unfolds upon a very quick and yet odd pilot episode. There is a lot to take on terms of What is this so called power? Where did come from? What are the limitations? tons of questions for our hunger of knowledge. Yet no echo brings answers during the twelve episodes.\\n\r\n_____________________________________________________________________________\\n\\n\r\nArt - [ 7 / 10 ] [ Colors and quality are very visible in a good way ]\\n\\n\r\nThe pure colors of the world are vivid and full of live true, but is it honestly the very color of grim and undeemed world that the situation at hands? No it's not, but for every second episode it somehow is? Fighting scenes are on par with the top-notch ones, but only once or twice. You can clearly see when they were lazy to animate \"that\" tiny bit more, or give that kick an extra detail.\\n\r\n_____________________________________________________________________________\\n\\n\r\nSound - [ 5 / 10 ] [ Can i truly review sound and music if barely heard any? ]\\n\\n\r\nThe opening theme does offer a sense of mystery for a brief ten seconds only to be stolen by odd yet mainstream tune and beat. Sounds and music of the real animation were nothing of boring and undead to be honest. Very very mediocre compared to \"GiTS\" or \"Monster\" where you will get goosebumps just by listening to the composition. Hamatora does not deliver this one.\\n\r\n_____________________________________________________________________________\\n\\n\r\nCharacters - [ 6 / 10 ] [ Seen worse, Seen better but dialog of two men gave it 6 out of 10 ]\\n\\n\r\nAll and all the characters are lively and own very streamlined personalities, with the personalities you somehow decipher their powers too before even seeing them in action? Have we seen too many characters like these lately? I'd agree however during your marathon you'll encounter two different souls and with them come ideologies which clash like titans against one another. For me that was solely the reason to see this till the end. Too little is known of everyone from the Cafe and with the teams you can barely feel their coöperation in terms of reality.\\n\r\n_____________________________________________________________________________\\n\\n\r\nEnjoyment - [ 5 / 10 ] [ Forcing one to watch only to wait next episode is unfair ]\\n\\n\r\nIt's hard to rate enjoyment which is split by two different stories for me. Do you find it unfair to watch an episode of same show, knowing that it will not contain anything new nor continue related to the very grim and horrible incidents happening during last episode?\\n\r\nI know i'm harsh with this one, but it shouldn't be a burden to watch one to gain one?\\n\r\nNo pain no gain as they say?\\n\r\n_____________________________________________________________________________\\n\\n\r\nOverall - [ 6 / 10 ] [ Mixed opinions in a bowl of intellectual moshpit. ]\\n\\n\r\nHamatora is a show where young teams toss their fists together to carry out very little in terms of money, however in terms of teaching what is right and what is wrong. Sure!\\n\r\nThe show has its moments in fights and dialogs, but in terms of what this could have been with better writing....? We'll never know unless the upcoming 2nd season promises something short of amazement.\\n\r\nOh the irony of right and wrong... You will find yourself on either the right ro the wrong side of this show. I must have been on the wrong one.\\n\\n\r\nNow it's time to choose yours? Who's side are you on? :)",
            "date": "2014-04-02T17:17:00+00:00",
            "helpful_count": 7,
            "mal_id": 138379,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/295763.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Caenn",
                "username": "Caenn"
            },
            "url": "https://myanimelist.net/reviews.php?id=138379"
        },
        {
            "content": "When it comes to cliff hanger endings this should win a award.\r\n---Story--- (7/10)\r\nThe story follows Nice and his adventures with the group of Hamatora a group of people who take up tasks for money and complete them with there Mininum powers. \r\n---Art--- (9/10)\r\nWhen it comes to the art of Hamatora it is above average and different. It is flashy and uses practially ever color in the rainbow. The fight seens are different and can get a bit gorie.\r\n---Sound--- (6/10)\r\nMusic is nothing special the opening and ending are nothing really special or catchy. \r\n---Characters--- (8/10)\r\nThere is nothing better then having interesting and different characters. When youhave characters that are all different in fashion, powers, ways of thinking, personality. Its better then having your generic school enviroment with standard clothing.\\n\\n\r\n---Enjoyment & Overall--- (7/10)\\n\r\nThe anime is different but now amazing our something you need to go out of your way to watch. When i watch anime i watch to enjoy and if i do i stay till the ending and if im writing a review it clearly kept me there till the end. \\n\\n\r\n---Warning---\\n\r\nIf you cant handle having a huge cliff hanger with some left unanswed questions. I will suggest waiting till the 2nd season comes out which is announced at the end of the series with a \"To Be Continued\".",
            "date": "2014-03-31T02:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 138023,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2843773.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Oixo",
                "username": "Oixo"
            },
            "url": "https://myanimelist.net/reviews.php?id=138023"
        },
        {
            "content": "Synopsis:\r\nThe story revolves around \"Minimum\" —special hereditary powers discovered only in an extremely limited number of humans. Those who possess such powers are known as \"Minimum Holders.\" The Hamatora is a group of freelancers that'll do anything in exchange for money and they do their jobs in pairs (Nice&Murasaki, Ratio&Birthday). The police, led by Art, usually asks help to the Hamatora.\r\nStory:10\r\nThe story is very interesting. It leaves me hanging on every episode so I was like \"I need to watch the next one!\" \"What will happen next?!\". Everything is very awesome, It was very mind-shaking.. It'll leave you thinking. Also, added the intentions of everycharacters, it'll give you questions that'll make you curious of what's behind it.\\n\r\n\"Hamatora the Animation\", an anime that'll make you think \"What's next?\".\\n\\n\r\nArt: 9\\n\r\nThe art was very great-- full of colors and details. The art isn't dull and shabby. In fact, I find the characters charming and well-drawn. Their powers ( when the characters are powering up), the blood, the clothing, everything.. thumbs up for the art!\\n\\n\r\nSound: 10\\n\r\nThe sounds help you cope up with the situation. So when there are fighting scenes, the background music has fast rhythms and  beats, which makes you excited too. As for me, it makes me tensed and I get really pumped up lol. The music suits every scenes, very well chosen indeed. So yeah.. I liked it.\\n\\n\r\nCharacter: 8\\n\r\nI find the characters' pasts very shady. Though there are some scenes that explained who they were before, still, there are some point that it wasn't enough. The anime didn't even put much of a highlight to their pasts. In fact there were some that wasn't explained and given much of attention (and that leaves me puzzled). Well, I bet the author will reveal it in the next season (I hope he does). Overall, about the characters, I like their attitude and characteristics. Especially, Nice's. Their badass personalities were pretty awesome. For me, all of them are cool and very powerful-- and that makes me pumped up when they're battling. \\n\\n\r\nEnjoyment: 9\\n\r\nThe anime was very entertaining, very thrilling. Even the humor is great! Not even a bit that I was bored.\\n\\n\r\nOverall: 9\\n\r\nThe overall anime, it was very awesome-- what a masterpiece. It didn't disappoint me-- not a bit! Watch out for the twist. This is a must watch! Until the very end of the episode, it'll leave you hanging and wanting to watch for more!!",
            "date": "2014-06-05T01:50:00+00:00",
            "helpful_count": 6,
            "mal_id": 145935,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3778743.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KatrinLouiseo24",
                "username": "KatrinLouiseo24"
            },
            "url": "https://myanimelist.net/reviews.php?id=145935"
        },
        {
            "content": "I started watching Hamatora at random, I was just bored one day and decided to go on Crunchyroll to see what was available and I saw Hamatora. I've seen a lot about it before so I decided to give it a shot.\r\nI agree with some comments here saying that the anime is a lot of filler, but it certainly isn't useless filler. It really gives you a feel on what Minimum Holders can do, and it shows you what Hamatora's average everyday life would be.  \r\nI really enjoyed the storyline, and I cannot wait for Re:_Hamatora to release more episodes so I could findout more about it. I was lucky that  I finished the series while the second season was airing, because the ending is a huge cliffhanger.\\n\r\nA lot of the parts in the anime shocked and disturbed me, but in a good way. Some parts left me crying like a baby, and some made my jaw drop. It's a very shocking anime, dealing with crime for a lot of the episodes, which may be triggering to some.\\n\r\nThe characters were all loveable and hateable in their own ways. A lot of these character's actions were among the things that shocked me, and I liked that a lot.  \\n\r\nI finished this anime about a half an hour before writing this review, and I am still in shock and suspence. This anime, although it may not be for everyone, will definitely leave you at the edge of your seat.  I highly recommend this series to anyone who likes mystery and a plot that revolves around  superhuman qualities. In short, this anime  in my own opinion was great to say the least.",
            "date": "2014-07-23T11:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 153387,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3717541.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/freemums",
                "username": "freemums"
            },
            "url": "https://myanimelist.net/reviews.php?id=153387"
        }
    ],
    [
        {
            "content": "Hamatora was a show I was quite interested in prior to its airing. Looking at the key visuals, the characters looked interesting; and the preview video showed some cool superpowers with flashy and colorful animation. But you may think the synopsis doesn't really sound interesting - cool guys fighting with superpowers are an overused trope in anime, to the point where it gets cliché. But wait, Hamatora throws some detective elements into the mix! So, does that make Hamatora an interesting, outstanding watch that puts the superpower guy cliché into good use? Well, as you can see on my final score, I don't share thatopinion. Frankly, Hamatora - The Animation turns out to be a really underwhelming show that ends up forgettable quickly after completing it.\\n\\n\r\nSet in a city where a small group of people with superpowers - called Minimum Holders - exist, the story follows a detective agency called Hamatora, a detective group made of Minimum Holders. Each episode we follow Hamatora solving various mysteries, always caused by another human who posesses Minimum Holder powers. Art, a superintendent of the police, usually cooperates with them to solve the cases, while it turns out that there is a mastermind behind all these mysterious happenings.\\n\r\nThe story of Hamatora really isn't bad - each episode we get faced with a new detective case for our little detective group, and we follow them solve the cases and doing some fighting with their cool Minimum Holder powers. Here and there, we see some hints of an actual plot, which then gets fulfilled during the final few episodes. It could have been developed so much better though.\\n\r\nThe first half of Hamatora (with the episodic short cases) was okay in the aspect that it also presented the antagonist and gave a small development up to the final conflict. The problem here is though that the time was not used effectively. Character development was close to zero, and instead we were presented with some filler-like episodes. Like the beach episode, which was used after a quite dramatic development, which was just completely out of place. And don't even get me started on episode 5, honestly. \\n\r\nThe last few episodes focus on the actual \"plot\" of the series, as already mentioned. It definitely is better than the first half, as the plot thickens and the episodes focus on the main conflict. Sadly we get fed up with an extremely disappointing conclusion, which leaves questions open and brings the story down. Additionally, at some point you aren't really interested in following the story anymore and lose interest more and more as the story progresses. This is mostly due to the extremely weak characters.\\n\\n\r\nAnd this leads me to my next point - the characters, which make up the weakest part in this series. As I've said, with the exception of some backstory hints, there is no real development and we don't get to know much about them. Hell, if they weren't called names like \"Birthday\" and \"Nice\" I don't think I would be able to remember much of them. Nice has some backstory, and characters like Murasaki, Art and Three also have some hints on their past here and there. But the rest gets left in the dark.\\n\r\nEspecially characters like Koneko, Hajime and Master could have easily been left out in their entity and the story could still progress the same, as they don't play any role in the main plot. At all. Maybe they play a bigger role in the manga or the upcoming video game - at least in the anime, they are completely useless.\\n\r\nFinally there is also our \"bad guy\" Moral, who makes quite an underwhelming enemy character. I felt his reasoning for being the bad guy was quite a disappointment - you would expect so much more.\\n\r\nOverall, since we barely get to know anything about the characters - thanks to the aforementioned use of filler-like episodes - so we are presented with characters that we can't relate to or connect with at all. I think this also plays a part why the enjoyment is so little - at some point you do not really care how the story progresses anymore since you can't really feel anything for the characters.\\n\\n\r\nThe art is one of the more positive aspects, the character design is good and as I've already mentioned, the fighting scenes in their full colorful glory were quite a please to look at. The animation was okay too most of the time, though there were some episodes with lots of quality issues present. The music was decent too, with nice opening and ending songs.\\n\\n\r\nBut of course, some art and music don't make an anime, which now leads me to my overall opinion - Hamatora could have been a good and fun show, as the flashy visuals and the superpowers surely pique one's interest, but was brought down by an average plot and unrelateable characters. All this together results in my final score 4/10.\\n",
            "date": "2014-03-25T12:14:00+00:00",
            "helpful_count": 111,
            "mal_id": 136939,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1773935.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/silverwalls",
                "username": "silverwalls"
            },
            "url": "https://myanimelist.net/reviews.php?id=136939"
        },
        {
            "content": "Hamatora is an anime that showed plenty of promise at first. It could have been excellent if not for one major setback: most of the anime is filler. The story is actually great when it gets down to it, but having one of the most thrilling scenes of any show this season followed up by a beach episode before returning to the actual plot just destroys the mood and momentum this show could have built up much more. That's not the only problem, but it certainly is the biggest and most noticeable one.\r\nHamatora is an anime with a similar style to things like Persona 4or Danganronpa which are based on video games (though Hamatora's game has yet to actually be made...). It centers around a group of crime fighting, mystery solving \"superhumans\" called \"Hamatora\" and the other similar groups of people that they know. Most of the main characters have abilities called \"Minimums\" which allow them to use some power when they fulfill a certain requirement (ex. gain super-strength when they take off their glasses). The main characters and members of Hamatora are Nice and Murasaki who are both Minimum Holders (people who have minimums). The story begins with them just doing their usual crime solving and being dirt poor because they don't get enough jobs and a girl named Hajime spends a lot of Nice's money on food. They soon start getting job requests that interconnect and begin to reveal a much larger scale crime.\\n\\n\r\nBut before that all happens, the show has filler. Lots of filler. Most episodes have some small connection to the plot, but that will only be just about a minute out of an otherwise filler-filled episode. Whether it's a beach episode, spa episode with sit-ups (and I mean LOTS of sit-ups), or just some random event involving the minor characters, this show just has too much filler. However, the actual story is brilliant. The show overall resembles something like Psycho-Pass and Darker Than Black in the way the world and the minimum powers work and eventually crumble into chaos. The end of the show is excellent and leaves a possibility for a second season, which I would love to happen.\\n\\n\r\nAs for the characters, they are all interesting but none develop very much or at least get enough screen time to develop. As much as I like Nice and Murasaki, they really don't develop as much as characters in similar shows, and the show only gave small glimpses into their pasts which needed much more elaboration as they seemed very interesting. A detective named Art is also interesting and his relationship with Nice is one of the higher points in the character aspect. Hajime, a girl who hangs out with Hamatora, appears to have the potential to be the main female protagonist at first with her intense hunger driving Nice into poverty, but she ends up only having a minor role with just two big appearances (one being the intense sit-up filler episode; you'll know which one I mean when you see it). The rest of the important supporting characters (who all have random English words for names) are just as interesting as the main cast. They were also given some short backstories, but not enough screen-time either. Hopefully a second season will bring about more of the characters' pasts.\\n\\n\r\nHowever, the best character in this show is actually the villain, Moral. He's just psychotic and and the show does an excellent job of building him up. His scenes with Art and Nice are never bad and are the best scenes in the entire anime. He just wants everyone in the world in to be equal, but that means eliminating those who think differently than him. He's an understandable villain whose goals are similar to those of real life people, but he actually puts his plans into action.\\n\\n\r\nThe animation is generally very good despite the show's obviously low budget. The psychedelic look of when minimum holders use their powers make the action scenes very stimulating to the viewer, and all of the characters designs are great (Honey is especially cute). Moral, Nice, and everyone else look cool and their designs fit their parts well. The emotions the characters show really work well especially for showing how insane Moral is (at least compared to what society considers sanity). The urban scenery and everything else looks good as well. Really all that holds the animation back is just the low budget which is especially apparent in some of the filler episodes in the middle of the show, but the creators at least did a good job of saving the budget for more important scenes.\\n\\n\r\nThe soundtrack is also one of the better parts. It uses a lot of piano tracks with unique rhythms that speed up and down a lot depending on the mood. During the action scenes, rock songs are used. Nice's signature song that plays whenever he puts his headphones on stands out in particular. The OP is also one of my favorites of this winter season.\\n\\n\r\nHamatora may have issues with fillers that throw off the pace of the story and a noticeably low animation budget, but it's still very enjoyable. Even with a poor budget, they make it count when it needs to. The characters just needed a little more development to be really good, but the soundtrack is consistently great and sets a great mood to help fix all of the other problems. Some scenes are amazing and some are just frustrating, but Hamatora is still a fun and emotional anime that better get a second season.",
            "date": "2014-03-26T10:32:00+00:00",
            "helpful_count": 74,
            "mal_id": 137073,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=137073"
        },
        {
            "content": "“You have no business telling me that I’m strong or alone or whatever. In fact, it’s no one’s business to decide who’s weak or strong.” – Nice\r\nHamatora The Animation is one that will leave you excited, shocked, angry, and confused at some point. Set in the year that this anime aired, people in this world will have a power called a “Minimum”, therefore being called “Minimum Holders.”  “It is an extraordinary power beyond the understanding of man that manifests whenever a specific condition is met in the form of an action.” Unfortunately, others won’t have this kind of power because they weren’t born orgifted with it; and that’s when the main conflict starts to head in. They would be seeking power because they are the “weak.”\\n\\n\r\nHamatora itself is made out of a group of people who accept job offers in order to make money. These jobs are usually ones they need to solve or investigate and are offered to them because Hamatora is known to have pairs with special abilities, or said in the last paragraph, a power called a “Minimum.” These special abilities help solve or conclude those investigations. The main investigation is to stop a serial killer targeting Minimum Holders.\\n\\n\r\nThe art in Hamatora is very colorful. One look at this anime and you know there will be flying colors everywhere. Especially when the characters construct their powers, colors are just in there. The characters themselves are also colorful; with what they wear and what item/element they use. There are also very flashy scenes. Other scenes include a bit of gore. The backgrounds are really just casual settings, nothing to fancy and nothing to dull - considering it is set in 2014.\\n\\n\r\nI thought the OP of this anime had that futuristic feel to it. Being set in our current timeline, but with people having superhuman abilities, I think the OP played a pretty good role. The ED, I thought, had that sad feeling to it. It wasn’t gloomy or anything, I just felt like it was playing a sad tune or something. The background music/sounds played pretty well in terms of setting the mood/scene in each episode. But there really wasn't an OST that caught my attention.\\n\\n\r\nWith some there to make all the action, some there just to be funny, and some there to explain situations that viewers need explaining to, the characters in Hamatora are pretty cool, in my opinion. Though their names could have been better, the characters' names are pretty easy to remember - especially the ones in Hamatora itself. The top duo in Hamatora are Nice and Murasaki. Nice being the top Minimum Holder and Murasaki following behind. Other characters included, showed some pretty amazing powers. They made me laugh, tear up, angry, confused, and just simply shocked. Character developments weren't as good as how most anime would develop characters. But they're pretty fun to watch.\\n\\n\r\nOverall, I enjoyed this anime from beginning to end. There were quite a few of cliffhangers - especially the last episode - which kept me kind of clinging on to the series. Though, if this series had a better character development and more episodes that went into the main plot, then maybe this show would have a little more fans. But even so, I think it's pretty entertaining.",
            "date": "2014-03-25T13:15:00+00:00",
            "helpful_count": 62,
            "mal_id": 136945,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3580033.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ScarletCrystal",
                "username": "ScarletCrystal"
            },
            "url": "https://myanimelist.net/reviews.php?id=136945"
        },
        {
            "content": "Certain humans born with special powers. How many series have you watched involved some sort of a similar theme? What Hamatora delivers includes a package of characters known as “Minimum Holders”. Yet everything else it comes with is hardly anything but special. In essence, Hamatora is a sour bag of trite cliches formulated by its premise. For what it’s worth, this show’s is dense with minimal value. \r\nTo trace back a bit, we learn that there are special humans with abilities that are known as “Minimum Holders” in a setting known as Yokohama City. The titular title “Hamatora” is a collectively group of Minimum Holdersfounded by a young man named Nice. Having graduated at the top of his class at Facultas Academy, he forms this group as a detective agency to solve supernatural cases. Whether it puts them in danger or not doesn’t really seem to matter. Because in the end, the goal is to get the job done.\\n\\n\r\nEssentially, the show does its job by presenting various cases on a weekly basis scenario. Later on it shifts to an ongoing arc involving a criminal who is known to go after the heads of other Minimum Holders; or rather precisely what’s inside of their heads. As a supernatural mystery, this should bring together a collection of insight to be explored. Yet, the show often neglects this because of its lazy elements. Even Hamatora itself is known to loft around waiting for clients rather than seeking them out. The whole concept becomes an ennui with the way the story constructs itself. To make matters worse, the characters are generic and lacks connection. What it tries to bring together with a main antagonist often gets sidetracked by non-standardized episodes. It fails to communicate to viewers its point or purpose involving its cases. And the ending? That invites questions from all angles. \\n\\n\r\nBy centralizing a small cast of characters as a collective force, one would expect the show to develop them on a deeper level. Unfortunately, Hamatora doesn’t follow that pattern and relies on its more generic concepts. The crass concept of ‘teenagers with superpowers’ comes to mind easily. After all, most of the main characters doesn’t look old enough to be out of higher tier school. At the same time, none of the characters stands out intelligently by themselves. How can we take a character seriously when our main character is named “Nice”? It doesn’t just cast off itself as him being a non-sensational character. Others such as Hajime, Birthday, and Ratio hardly are distinguishing by their personalities. The aloof writing gives them a lack of connection with Nice and with the audience with their lack of backgrounds. One of the only more dynamic connection that may be noticeable is the “Minimum Holder PI duo”, made up of Nice and Murasaki. But to call them dynamic would be an overstatement considering their lack of compatibility. Rather, it would be more simplistic to say they are partners on a professional level. But going any deeper than that would be laughable with the duo’s connection given their conflicting ideologies, Murasaki’s envy for his partner’s skills, and their ways of dealing with cases. In retrospect, their relationship can be described as oafish. It’s not silly in the way since one half of the duo (Murasaki) sheds off the humor with his serious nature. Thus, it just comes off as dull saturated with toppings of boredom.\\n\\n\r\nThroughout the series, there’s a scenario of cat-and-mouse. It won’t feel like it but the concept is there. This is caused by its odd combination of implied humor with its general premise that comes together as frivolous. But what’s to be taken seriously is a criminal named Moral roaming through the streets. He has made it a goal to kill Minimal Users with his ideological mind. In essence, he comes off as a bigot with the stereotypical attributes of an antagonist. Embracing ideas of humanism, we learn of Moral’s goals for the future and his nature. There’s no mistake to describe Moral as a villain as he cares about no one but his ambitions – to make equality. In one specific episode, he even tries to murder a character for rejecting his offer. While this all may spark interest for viewers to see how far his goal comes across, it ultimately demonstrates a cliched and predictable outcome. There’s little insight going about his morality given the lack of characterization in Moral’s character. At the same time, it demoralizes the series’ story with an abject way of structuring its episodes. In other words, the series quickly shifts itself between its main story to its nonsensical episodes aimed for eye candy.\\n\\n\r\nWith a concept of super powers, you’d expect a deeper exposition right? Well, on most standards, the series only explains itself with weak effect. Minimum powers are only explored on the surface by showing, rather than telling such as the case of Hajime. Only a few characters such as Honey gets a bit of characterization with their back-stories. But what comes together as a unity ultimately is blend thanks to everything going on at once. It’s not just cliche but just badly formulated together as a whole.\\n\\n\r\nIt’s also difficult to fathom this show’s comedy on a variety of levels. This is illustrated by the dialogues delivered with cheesy execution, weak interactions, and jokes that sometimes makes almost no sense on occasions. The more concrete moments involve a deeper conversation between Art and Moral in the latter half of the show. At its climax, it delivers our villain’s message. Yet, this only comes as ephemeral as his lecture may be forgotten easily with the absurd story structure. Also taking on a mystery genre, the cases themselves started out with interest and even demonstrates some mature scenes with its debut. While this works out at first, it dies out quickly as viewers will find themselves questioning why they should care. Most of the cases lacks strength with morality. In general, it doesn’t let viewers draw in what they are interested from these cases. It’s also throws in random gags, background characters that somehow gets caught up with the mystery, and in general weak delivery.\\n\\n\r\nHamatora isn’t entirely filled with intolerable holes. There are some parts that are worth of praise such as the action. There’s strong evidence given the serious nature of Minimum Holders and why the public holds different opinion of them. By action, Minimum Holders deliver supernatural feats that are astonishing. Fights are intense on most scales and although doesn’t last long can leave an impression. While the characters (mainly Minimum Holders) lacks characterization, they don’t frustrate viewers to give them pity as most of them are capable of fighting themselves. In other words, they don’t come off as weaklings to despise on. There’s also a bit of anticipation coming together in the latter half of the story involving identity issues and what’s to expect from certain truth being potentially discovered. While it lacks a laudable mystery delivery, it does keep viewers from watching this show to anticipate to see what happens next.\\n\\n\r\nDescribing Hamatora’s art is easy to see with the eyes. The colorful exposition is there with fantastic action made up of explosions, knuckle sandwiches, and violence. Minimum Users’ abilities is intense as fans may expect and the artwork captures the majority of that. On the other hand, background artwork lacks any distinguishing features and the way characters are designed are generic. It isn’t even original considering that Yuki Kodama, whom previously worked on Blood Lad traces its designs. They don’t look just similar but hardly has anything to write home about. \\n\\n\r\nSoundtrack stands out as one of its strengths. It is noticeable with alternative ways and well-coordinated delivery of its OST. At same time, it can keep up with the momentum and matches it consistently. Similarly, both the OP and ED songs delivers well with appropriate instrumentality. The mixture of its rock and techno notions also captures its moments. In general, it will leave an impressions for the audience. But on the topic of voice acting, some of the characters lacks strength in delivery in particular Nice and Murasaki with their chemistry. Moral’s lectures can also feel monotonous and seemingly forgettable despite his persistence.\\n\\n\r\nThis review didn’t take too much thought to write thanks to Hamatora’s lack of thoughtfulness behind its concept. Expectations coming into this show should be minimal with a potential case of being put to the ‘on-hold’ list. The story clustered with cliche characters doesn’t bring out anything special. Neither are the cases with their ridiculous jokes, hopeless messages, and whatever purpose it tries to deliver. Yet, the technical aspects of the show can keep it together at some instances. And as a supernatural mystery how, you’d need patience to get through Hamatora to experience what it has to offer. Still in the end, it’s just another formulaic throwback that doesn’t add anything more for its generic thought. \\n",
            "date": "2014-03-27T00:47:00+00:00",
            "helpful_count": 61,
            "mal_id": 137181,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=137181"
        },
        {
            "content": "The progression of my reaction to Hamatora can be summed up as the following:\r\n\"Oh this is interesting..ok..ok?...wait, WHATTT?!?!  \r\nHamatora is a mystery/supernatural based anime with some comedy mixed in.  Sounds somewhat generic but what sets it apart are the unexpected twists, the small gaps within the story in this series, and the last episode.  \r\nThe artwork and music are both not outstanding in particular.  Enjoyable but nothing that screams \"NOTICE ME, I WANT YOUR LOVE.\"  There isn't much character development, however, that's not to say that there aren't interesting characters...I can think of at least 4 characters whose character andback story intrigue me.  \\n\\n\r\nYes, the beginning is somewhat slow, there is a random filler here and there. The entire series snowballs quickly after the last filler and turns into an avalanche that is only stymied by a wall known as \"Second Season.\"  I normally don't go too crazy over second seasons but this is one of those animes that makes me wish I knew how to speak Japanese so that I could somehow bribe the creators to release the second season soon (perhaps, next week soon?) and to please not screw the second season.  If it goes the way most of us would want it to go, there will be more explanation of certain characters and of course, what happened in the last episode.  \\n\\n\r\nIf I had to give only one reason as to why someone should watch Hamatora, (as if I haven't repeated it enough times) I'd say do it for the ending. In the words of Nike,\" just do it\".",
            "date": "2014-04-02T18:54:00+00:00",
            "helpful_count": 39,
            "mal_id": 138389,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/730333.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/neropepero",
                "username": "neropepero"
            },
            "url": "https://myanimelist.net/reviews.php?id=138389"
        },
        {
            "content": "“All human beings can only perceive the world through the filter of their values. Mediocre values may be harmless, but they are also utterly worthless.” - Moral\r\nStory (7/10)\r\nHamatora is the collective name of a group of detectives, who solve various cases in order to earn a living. Sounds rather standard, doesn’t it? Well, not exactly. All the members of Hamatora poses some superhuman power, be it incredible speed, or inhuman strength. These are known as ‘minimums’, rare innate abilities which only a small percentage of humans can use. Of course, regular citizens have no idea of existence of such individuals, in order to protect theminimum holders from discrimination due to envy. A safe balance, allowing for a normal life for all humans. What happens when a certain someone who desires to tip the balance and send the established world into chaos appears? That you will have to see for yourself.\\n\\n\r\nMostly, when people speak of Hamatora, they mention the genres ‘superpowers’, ‘comedy’ and ‘mystery’. While this is true, I believe Hamatora deserves another tag, namely ‘psychological’. Once you watch a few of the first episodes and get down to the plot and the main villain, strong reasons for such a category emerge.\\n\\n\r\nThough many accuse the series to be avoiding its own plot with episodes known as so-called ‘fillers’, this isn’t entirely true. Yes, there are quite a few episode which don’t exactly pertain to the plot, but there is a method in this madness. This is the producers’ sneaky measure of slowly revealing the plot to us. We are introduced to the characters and have some time to become familiar with them and the relationships between them. Meanwhile, as our brave detectives continue solving supposedly unconnected cases, all of them start to connect and suddenly the plot is right in front of our eyes. True, it may not be the most effective and interesting way of presenting the story, but in this case it works. Even during later episodes where some of them seem to have not much in common with the development of events, there is usually at least one connector to the main plot, which reveals more of the truth to us. Certainly, there were animes which have done it better than Hamatora, but this was a pretty good attempt at this strategy. Or at least, not a painfully bad one.\\n\\n\r\nArt (7/10)\\n\\n\r\nThe art in this series is absolute eye-candy. The colorful character designs and the no less vivid backgrounds are simply pretty and enjoyable to look at, as well as serving the purpose of creating a certain atmosphere. The slight issue which I had with the graphics was the odd-looking gradient on certain objects and characters, but this is more of a personal preference. As for a low-budget series, the graphics are kept at a surprisingly high standard.\\n\\n\r\nSound (7/10)\\n\\n\r\nThe soundtrack may not be a particularly memorable part of the series, but it left me with a good impression. Sometimes cheery and invigorating, other times grim and eerie, the soundtrack reflects the atmosphere of the series in all aspects. This also goes for the opening and ending. They simply fit the style of the anime. I particularly enjoyed the ending “Hikari” performed by Wataru Hatano. It had a certain sense of power and intensity to it.\\n\\n\r\nCharacters (8/10)\\n\\n\r\nThese days it has become increasingly difficult to create a series with relatively original characters, but Hamatora seems to have done a pretty decent job in this field. Most of the main characters don’t fit into the standard archetypes we have become so familiar with. Moreover, the writers managed to keep all the characters varied. Whether it was personality, appearance, clothing or even attitude, they  were all different in each of the main characters. \\n\\n\r\nMany reviewers write about the lack of character development in the series. While this is true, it is also worth mention that with the amount of characters we were presented with and only 12 episodes to fit this part of the story in, this should be understandable, at least in a small extent.\\n\\n\r\nAs you’ve probably figured out, the members of Hamatora are our protagonists. I shall not go \\n\r\ninto detail about most of the MCs, since it would take quite some space. However, there is one character I would like to present closer, as he may just be the trump card, which makes this series worthwhile – the antagonist.\\n\\n\r\nMoral’s ideology is simple and straightforward, yet his means of achieving his ultimate goal are wicked, but logical in a way. But psychotic as he may be, he is relatable. He is by far, one of the best antagonists I have seen in an anime so far. Why? Any guy can do bad things for the sole reason of being evil, but Moral? Oh, no, he believes he is doing the right thing. He is trying to save humanity, after all. He is the best type of villain a series could get – a villain, who considers himself the hero.\\n\\n\r\nEnjoyment and Overall (7,5/10)\\n\\n\r\nI will admit, Hamatora is neither a masterpiece, nor a breakthrough in the anime world. Even so, it was an enjoyable series, which kept me curious through all 12 episodes. There were moments which got me excited, left me hanging or even made me shed a tear or two. It was a solid position, but also nothing that you would regret missing. I wouldn’t recommend this series for people expecting a fast pace and quick development of events . I’d say it’s more of a… reserved, relaxed series for watching during a longer weekend.\\n\\n\r\nIf you have the time and the patience, give the series a try. Who knows, perhaps you might turn out to love it?",
            "date": "2014-07-27T10:06:00+00:00",
            "helpful_count": 24,
            "mal_id": 153949,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2968879.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BlueOla",
                "username": "BlueOla"
            },
            "url": "https://myanimelist.net/reviews.php?id=153949"
        },
        {
            "content": "The concept of Hamatora sounded interesting, but its execution was horrid.\r\n*Tiny bit of spoilers\r\nStory 3\r\nMore then four of the episodes felt like filler episodes.  Honestly can't remember the plot because they were so boring.  The main story is very lackluster on top of that as it is little deeper then the description provided for an explanation of what the series is about.\r\nArt 8\r\nThis is where this show excelled and made me watch the rest.  The fights were so evenly distributed to all the characters you didn't begin to get bored of their lack of deviation of abilities or how they used theydoing fights till the last episode.  It almost felt like the numerous boring characters were just there to be pretty to look at and watch fight.\\n\\n\r\nSound 6\\n\\n\r\nWas decent suffered from the same problems as the art as it got stale after awhile and wasn't memorable.  Still enjoyable rock and normally used at appropriate times.  It got a 6 simply because the OP was pretty bad.\\n\\n\r\nCharacter 1\\n\\n\r\nIts been along time since I have been so uninterested in an entire cast of characters.  To start their motivations are either overly petty or so completely looked over one can never tell why they are doing things.  The only person who thats clear with is Moral who they developed little to no back story for.  The characters they gave back story for was either hastily told (Birthday and Ratio) or so blatantly obvious of a cliche (Three) there was no need.  Also the amount of time they dedicated to three was unnecessary.  Also those two kids who they saved early in the show keep reoccurring for NO APPARENT REASON.  They were boring had no powers didnt help progress the story character development or anything else in the show.  With an already overly large cast for a 12 episode season why in the hell would you add focus on more characters?  Honestly if you want to see what not to do when making characters for a story just watch this.\\n\\n\r\nEnjoyment 4\\n\\n\r\nIt didnt capture me in anyway shape or form except for the art style.  If I hadn't begun watching this the week before it ended I would have never finished it.  It has its moments however but they are never the scripted ones (if a \"dramatic\" scene is coming up be prepared to be disappointed) however the fight heavy episodes were fun to watch.  Also I found the first 3 episodes enjoyable and if it had solely stuck with the Private investigator thing it could have been a better series. \\n\\n\r\nOverall 4\\n\\n\r\nFeels rushed in every sense.  Wouldnt suggest watching it",
            "date": "2014-03-26T20:18:00+00:00",
            "helpful_count": 17,
            "mal_id": 137147,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Swagstorm",
                "username": "Swagstorm"
            },
            "url": "https://myanimelist.net/reviews.php?id=137147"
        },
        {
            "content": "Hamatora is a series that was indeed interesting at first. We got detectives with minimum powers solving cases and mysteries. Unforunately, the plot of the story is not focused.\r\nOverall, this show didn't put me to sleep, which is a good thing. It is indeed interesting at parts, but that doesn't mean the show is good. The show entirely squishes in pointless filler. The plot suffers tremendously from this. In the last episode, Hibiki, the screamer dude was mentioned, but he only showed up in the manga.\r\nLet's get into the characters. Nice, our gary stu character was indeed interesting in some aspects. His belief on \"itdoesn't matter if you have a minimum or not, you powerful if you believe in yourself\" or something like that was good, but no emphasis nor character development was put into him. Other casts like Murasaki, Hajime, etc. are not important. No importance, it's just focus on solving case of characters that have no purpose, and the cell phone texting to Nice is an excuse to make them important, which they are not.\\n\\n\r\nArt is an interesting characters. Character development, interesting, but his resurrection did worry me a bit. I guess we have to wait for second season for the show to explain this plot device, whether it will be good or crap.\\n\\n\r\nEnding was absolute crap. \"Plot twist! The End! Come back next time!\" Are you serious!? This is shitty writing!\\n\\n\r\nThe sound was good. The opening and ending are enjoyable to listen along with some OST.\\n\\n\r\nOverall (3/10) This means 'Bad'.",
            "date": "2014-03-29T15:19:00+00:00",
            "helpful_count": 14,
            "mal_id": 137765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3501491.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/PenX",
                "username": "PenX"
            },
            "url": "https://myanimelist.net/reviews.php?id=137765"
        },
        {
            "content": "Alright, first review. Anyways I felt the need to write this because this Anime is a hidden gem and it's also one of my favorites.\r\nStory 7/10 - The plot had an interesting premise. People are born with super powers and they keep it hidden because they might get oppressed due to it. Hmm...sounds like X-Men. Anyways I don't know enough about X-Men to compare them further. The story starts out episodic with the Main Characters running a detective agency, doing whatever jobs they can to support themselves. All the while in the background the main plot slowly blooms until it matures and comes out. Youget the main villain etc. It's not really deep either, and the episodic start and jumping around might turn people off. It's not bad by any means though. \\n\\n\r\nArt 8/10 - Personally, I think the Art is great, 10/10. But it's extremely colorful and some things may seem off, which can turn people off. Not much else to say, it doesn't diverge too far from the norm really.\\n\\n\r\nSound 8/10 - Just like with the Art, the sound is good. It's a nice mix of Techno and J-Rock. Which aren't for everyone,  but the Techno really fits with this Anime. So it really depends on individual preference.\\n\\n\r\nCharacters 8/10 - I think this is where the Anime really shines. The main duo is done well enough. The MC, Nice, is a genius, he's quirky, but can get serious very fast. He is also the strongest out of the Protagonists. Then we have his friend Murasaki, he is the calculative more mature type. Although he secretly envies Nice. There are a few more, Ratio, Birthday, Hajime and more all with varying personalities and agendas. Honey and Three are probably the second best duo and they're done well. Especially Three's back story.  So yeah, main draw point is the cast and their interactions. \\n\\n\r\nOverall 8/10 - If you're into something kind of hidden, but enjoyable definitely give this a shot. Season 1 is only 12 Episodes after all. You can blast through it, or if you don't like it drop it early. But it doesn't hurt to try it. Especially if you're looking for some nice Action with a great cast and OST.\\n\\n",
            "date": "2014-10-24T18:19:00+00:00",
            "helpful_count": 13,
            "mal_id": 166033,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3980035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xDarkrai",
                "username": "xDarkrai"
            },
            "url": "https://myanimelist.net/reviews.php?id=166033"
        },
        {
            "content": "Tried to keep spoilers to a minimum.\r\nI am personally not a fan of animes with the tag \"The Animation\". My first was Persona4, which was a huge disappointment, followed by Devil Survivor 2 which was ok, and Danganronpa which had potential to become better but was needlessly butchered. But Hamatora The Animation is on a different league, and it probably wouldn't be good to club it with others with the same tag.\r\nThe art (not the character Art, no pun intended) was good, decent at its best, and nowadays most animes have great visuals and since it is not disturbing or anything imo Hamatora shouldn't reallybe judged too much on this factor. The sound though was cool and definitely flows with the atmosphere, in fact moral's ost is one of the best I have heard in horror genre. \\n\\n\r\nAccording to the story, there are some people with minimum's ability, which is a special ability and allows them to carry out superhuman jobs and they need to do something in order to activate their ability. This isn't new as the idea has already been explored in animes like Darker than Black, or Law of Ueki. But the different setting played, apparently gave the vibe of an episodic anime with interesting cases, and with each case the story moves forward in a slow but steady manner. It gradually picked up correct pace after the initial plot was set, and then on there wasn't any reason to look behind. It clearly established itself to be different from all its rivals, of its genre and success is attributed to strong main storyline. In short it takes some time to develop the story. The actual plot is quite interesting, it is a clash of ideologies, clash of instincts, clash of power, clash of emotions, between the mc and antagonist. Hamatora as we are introduced in the initial eps is a detective agency, and as we might expect they work on different cases. And is just as one may predict that this being a 12 ep anime would primarily focus on the mastermind of all the crimes. This added with few action packed scenes makes it watchable for the first few eps. Each episode comes with the character development of one or the other side characters and has an adhesive effect which keeps us glued to the anime. Even then tbh, I had grown an incentive to drop the series, but thank god, I didn't do such a regretful thing, because it became really interesting in the latter half.\\n\r\n \\n\r\nThe characters is what really made the story incredible, and prompted me to give a 9/10 overall. Everything is very distinct about the characters, starting off with the names (seriously names like Nice, Art, Ratio felt a bit peculiar), to their roles. Nice is one of the best and op mc and to know the reason one has to watch the anime. His partner Murasaki and other side characters mostly serve to connect different strings of  cases, and exists as a tool for us to know what is in mc's mind. Apart from connecting different cases they, mostly add to the narration, comedy, and are just an added spice to the anime. Moreover some characters also receive a backstory, and their characters are amply developed mostly through their adventures in cases. And finally, the antagonist (to avoid spoiling I will name him X). Just like one can't clap with one hand, awesomeness of the MC can't be exhibited without a strong antagonist. In fact whatever X did can't be called as wrong, nor what the mc does can be certified right. Following Doflamingo's(one piece ref) words \"justice shall always prevail, because the winner claims justice\", I wouldnt be surprised if a new anime came and reversed the role of mc, x. At few instances I had no counter to x's views, everything he said seemed piercingly right, but all this shall be cleared once one has watched the whole anime. All in one, both the MC and X are responsible for the good storyline.\\n\\n\r\nSome other factors which contributed to the enjoyment were the realistic deaths, and somewhat psychological acts of people, and characters perception of strong vs weak. The only con I can spot is that it kinda wasted the first few eps, and escalated in the later half, but this has been a law rather than exception. As a side note I wrote this review before watching the last ep! and something very very unusual thing happened. If it was gonna be 24 ep long I might have even given this an unbiased 10.\\n\\n\r\nFinally, a note for all those who dropped the anime after first five eps, plz reconsider as shit gets real after that.",
            "date": "2014-03-26T03:31:00+00:00",
            "helpful_count": 12,
            "mal_id": 137043,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3561477.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Overhaul93",
                "username": "Overhaul93"
            },
            "url": "https://myanimelist.net/reviews.php?id=137043"
        },
        {
            "content": "All the colours of the rainbow!!!\r\nThe best thing to say about the show is it's really colourful in a fresh way. This supplements the opening and endings really well.\r\nNext to that there's not much to this show.\r\nThere's some really cool character designs, though it's just a shame they weren't given real character. Any character development is outshined by it's plot development. Which is funny 'cause... it's pretty awful.\r\nJust as it seems like knows what direction it wants to go, it takes a very confusing turn everytime. Don't mistake this for plot twists 'cause it's nothing more than bad writing.\r\nThere's potential here, with the cool characterdesigns and a chance to make a good  story, asking questions on what is morally correct in this world.\\n\r\nThe show gives you this sensation. It's like you can feel everyone viewing this, cheering it on. Saying something like \"Come on you can do it\". But it gets shut down in a manner in which the show makes a joke on that very trope in anime. (Gotta give it props for that. That was kinda funny.)\\n\\n\r\nThere's not really any build-up to anything and the ending is just god awful.\\n\\n\r\nMy personal greatest problem with this show is the character Hajime.\\n\r\nOne of my first reactions was \"Hajime seems like a really cool character\". Seemed like she'd become something great, not disappointing on the badass factor either. All the way through though, she's just someone in the background. When she finally gets a moment in the spotlight it's so incredibly weak, it's unbelievable. Such a cool character design, not put to its full potential is a damn shame.\\n\r\nI guess you could say that for just about any of the characters, really.\\n\r\nI namely liked the character called Birthday... Until everything that made the character seem interesting got brushed aside.\\n\\n\r\nThere was potential here. There really was. But oh well...\\n\r\nFrom what I can understand, there's a video game coming out too. I feel like this show was just to promote that, really. And for that, the art style delivers. This show could make for a great game. Though that's no excuse. It won't save this anime from getting harsh critique.\\n\\n\r\nHamatora: The Animation is visually appealing, but completely forgettable and avoidable.",
            "date": "2014-07-21T16:58:00+00:00",
            "helpful_count": 9,
            "mal_id": 153141,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2666883.jpg",
                "scores": {
                    "animation": 9,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Republic",
                "username": "Republic"
            },
            "url": "https://myanimelist.net/reviews.php?id=153141"
        },
        {
            "content": "Wasn't gonna write a review for this one. Did it anyways. ¯_(ツ)_/¯ \r\nStory: 9\r\nHamatora gets a 9 in my book. Maybe I'm a sucker for episodic animes with a hidden plot backbone (Akuma no Riddle was a personal favorite of mine in this category) but I really feel like Hamatora took its plot in the right direction. Some episodes seem fillerish or too forced, but then by the end you realize that the events of the episode connected back to the plot all along! The last episode left me needing more, and when I found Re:_Hamatora, I was incredibly disappointed in the quality of thesecond season (I could go more into that, but let's just say I didn't enjoy it nearly as much as season 1). The only real problem I have with it is the direction season 2 took, but maybe I should leave that out of my review for Hamatora? Eh, who knows.\\n\r\nArt: 8\\n\r\nHonestly this would get a 9 if the distance models weren't... interesting. The closeups and backgrounds were stunning, and the take on flashy colors and glitches gave a stylistic feel to it, but when it all got down to it, the distance renders were SOOOO BAD. Otherwise, good job with the art.\\n\r\nSound: 9\\n\r\nOkay the first opening was mediocre at best. The visuals were great but the song was basic and didn't leave an impression, nor did it really catch my eye. Re:_Hamatora certainly had an incredible opening, but that's its only salvation. Despite the OP, I gave sound a 9 because the OST was always pretty fitting and the voice actors were always really convincing.\\n\r\nCharacter: 6\\n\r\nEEEEHHHHH.... Hamatora's characters in the first season had little depth. They really seemed like they never developed by the end of it, ESPECIALLY Hajime. She had a lot of potential as a character, but she hardly spoke in the first season and then became a ditzy love interest in the second season. Birthday and Ratio got one episode of development and backstory and then their characters weren't touched on again. Murasaki, a MAIN CHARACTER, PART OF TEAM HAMATORA, got less screen time than Art, a character who lost his relevance half way through the series, and not even half the amount of development! If you want an anime for its characters, Hamatora isn't a good choice for you.\\n\r\nEnjoyment: 9\\n\r\nMy own personal experience with Hamatora was a good one, honestly. I really loved the story and its uniqueness, and the art was really alluring. I could go on for days about Hamatora and Re:_Hamatora's flaws, but honestly they didn't affect my enjoyment THAT much. It was a fun anime to watch in my free time and I really did like it. I'd recommend it to anyone looking for an episodic anime with a plot in the back. It's kind of a low-maintenance anime which I really liked, since I watched it in the hospital on my tiny phone screen with IVs in my arms. If you're looking to pass time, go for Hamatora, but be prepared for a god-awful second season and a LOT of plotholes.",
            "date": "2015-05-03T10:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 187039,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4444492.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gaysocks",
                "username": "gaysocks"
            },
            "url": "https://myanimelist.net/reviews.php?id=187039"
        },
        {
            "content": "Hamatora the Animation takes place in the world where some humans are born with superpowers. Pretty typical setting. Let's try again.\r\nHamatora the Animation takes place in the world where people are born inequal. Sounds vaguely familiar. I think I've seen this before. /looks around/\r\nHamatora the Animation takes place in the world where some of the powerful have The Idea how the world should be made right. Now /this/, depending on what they have in mind and how far they are ready to go, just might become interesting.\r\nDid it? Well, it depends. On a surface it's somewhat entertaining story, with a few plot twists and afew seemingly random episodes (beach!), presented in bright acid-colored animation. Not bad overall, not particularly good either. On the other hand though underlying themes felt unusually relevant.\\n\\n\r\nTo give a brief overview: Outlook on the world and personal relations of those strong and weak. Power and responsibility (or lack of thereof). Different perspectives of those on top, those striving to move up and those who just want anything not fitting in their little world to disappear. Xenophobia. Dismantling security as a necessary condition to bring changes to society... Some of it was pretty far-fetched, some almost scary in its realism.\\n\\n\r\nI can't say the themes were developed very well. At the end preaching of main villain became simply annoying, so forceful and repetitive it was, but I have to commend authors for a decent attempt regardless. \\n\\n\r\nTo sum it up, for me it was one of those titles which don't look like much on the outside, but at the same time have enough hooks and sharp edges to wake up your mind and a bucketload of messy social issues to chew on if you are so inclined.",
            "date": "2014-03-30T15:43:00+00:00",
            "helpful_count": 8,
            "mal_id": 137953,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1337109.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Elfster",
                "username": "Elfster"
            },
            "url": "https://myanimelist.net/reviews.php?id=137953"
        },
        {
            "content": "Hamatora is one of those anime which i watched with no prior knowledge of what kind of show this is or should i say with not much expectations .Rather i just happened to find it randomly and decided to watch. Surprisingly enough I really enjoyed it .The character development throughout the series is really good if you ask me. Each character has taken its own time to develop and also the protagonist Nice has a pretty interesting ability and background story.\r\nMany seemed to have disliked the anime , maybe because they had a lot of expectations build up,can't say for sure why, but if youlike action anime with supernatural powers, a good plot and certain twist and turns this is a treasure box buried in the ground for you guys.",
            "date": "2018-05-20T04:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 280991,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7122015.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/blank28_",
                "username": "blank28_"
            },
            "url": "https://myanimelist.net/reviews.php?id=280991"
        },
        {
            "content": "STORY (7)\r\nHamatora the Animation takes place in a world and time similar to ours except that there are people with supernatural abilities or \"minimums\". The story focuses on an odd jobs / detective group composed of minimum holders called Hamatora.\r\nThe series is mostly episodic following the adventures of the main protagonist, Nice, and his partner Murasaki. Majority of the episodes follow a format where each pair of Hamatora minimum holders take separate cases and as the episode concludes, it is revealed that all the cases are related. This would've been okay for the first few of the 12 episodes just to introduce what Hamatora doesbut it drags almost until the end. In my opinion, there were episodes which could've been better spent focusing on the main plot. If the series was longer, it would've been more acceptable.\\n\\n\r\nThere's a major plot in the story as we are introduced to the main antagonist, Moral, and it unravels bit by bit per episode. That was probably the only thing that kept me watching this show every week. Without spoiling, the main plot is nothing out of the ordinary but how each portion is revealed was satisfyingly done. \\n\\n\r\nThe show loves to drastically switch between absurd humor to shockingly tragic with occasional gore and violence. Prepare for your emotions to get toyed around.\\n\\n\r\nI won't comment on the ending since there's a possibility of a second season or OVA.\\n\\n\r\nART (7)\\n\\n\r\nThe art of Hamatora the Animation is on par with most series nowadays. I love anime with very bright colors and this show is one of them.\\n\\n\r\nThere are scenes which felt under budget or poorly made. I can dismiss badly drawn parts but there are scenes in the show that they even skipped a few frames in the animation. Most of the backgrounds had enough detail which is probably the only saving grace in this area.\\n\\n\r\nThey also play around with textures overlayed on the screen. I thought my TV had some smudge because of this. They also used rainbow-like filters whenever a minimum gets activated. Whether you like or hate these is your personal preference. CG is decent in the show overall.\\n\\n\r\nCharacters are very unique compared to most animes, making each easily distinguishable and memorable. Aside from this, most of the Hamatora minimum holder have some kind of distinct element in their character design that's related to their powers (e.g. Nice and his headphones, Three and his lion-like appearance). \\n\\n\r\nSOUND (8)\\n\\n\r\nThe show has a good sound track. Nothing that would make you wow but good enough to build up the scenes. The OP and ED tracks are likable as well.\\n\\n\r\nThe VA's did an okay job throughout the show. However, there's barely any scene in the series that drew out intense emotion from a character. And for those few scenes, it wasn't the VA that pulled me in but rather the shock of the sudden change in the plot.\\n\\n\r\nCHARACTER (6)\\n\\n\r\nThere are so many characters in this show. The Hamatora group alone has 10 characters. You also have major characters like Art and Moral. And on top of that, you have supporting characters and not-so-significant characters that are shown even in the ending. I liked the wide range of characters. It reminded me of Durarara!! and Bacano! But this does not go without a toll for the limited 12 episodes.\\n\\n\r\nThere's no major development for any character. There's also a lot of imbalance as to who gets screen time. For example, Honey and Three gets a decent character background and revelation of \\n\r\ntheir powers whereas Hajime (whom you'd think at the beginning of the is the 3rd most important protagonist) is almost always shown eating and she's barely involved any of the Hamatora cases.\\n\\n\r\nNice, the main protagonist, feels too easy-going. And when coupled with him being a prodigy minimum holder, he's almost never shaken throughout the series.\\n\\n\r\nThe spotlight goes to the main antagonist, Moral. He's your typical psychotic bad guy who's obsessed with the main protagonist, Nice. But because the storytelling of Hamatora's major plot was executed well, you're most of the time caught off guard by Moral's schemes.\\n\\n\r\nCharacters are very uniquely named. Nice, Art, Honey, Three, Moral... This was very peculiar for me but it made remembering names easier.\\n\\n\r\nENJOYMENT (8)\\n\\n\r\nI have mixed feelings for this show overall. For the story, I hated when the plot seems to escalate and then next episode, we're back to the slow-paced detective cases. Again, the only thing that kept me was my curiosity of the major plot that was unraveling. It's a show that's okay to watch but not too excellent that I'd re-watch one more time. \\n\\n\r\nDespite everything, I continued to watch this show until the end and I'm looking forward for the next season or OVA as hinted by the last episode.",
            "date": "2014-03-25T15:52:00+00:00",
            "helpful_count": 7,
            "mal_id": 136971,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160941.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pyrogate",
                "username": "pyrogate"
            },
            "url": "https://myanimelist.net/reviews.php?id=136971"
        },
        {
            "content": "I never drop a series (anime or tv), movie, book or manga, even if it sucks. I try to watch or read it till the end. Perhaps it's the hope that maybe, just maybe, it'll get better. Sometimes, it does get better. Sometimes it doesn't. I held the same hope for Hamatora. \r\nStory: 3/10\r\nThe story revolves around \"Minimum\" or \"minor miracle\"—special hereditary powers discovered only in an extremely limited number of humans. Those who possess such powers are known as \"Minimum Holders.\"\r\nCould've been a lot more, but sadly failed. One of the worst villains too.\r\nArt: 7/10\r\nAt first, it was really good. I love the colourfuleffect when Minimum Holders use their ability and the combination of colours is also good-it seems fresh.\\n\r\nIn some episodes, especially in ending ones, the art quality dropped a bit. There wasn't a lot of detail, it looked rushed, faces looked kinda contorted, as if not enough effort was put into it and that's one of the things that really stings me.\\n\r\nThat happened in only a few episodes, so a 7 it is.\\n\\n\r\nSound: 6/10\\n\r\nThe sound was okay, in some scenes it really fit in, sometimes I didn't even notice it. I can remember a few times the soundtrack was completely off too, but luckily, that was rare. The overall soundtrack isn't extraordinary. The OP and ED were fine too. The OP is very good, Yuuki Ozaki's voice is perfect for the song. He also sang the OP for Zankyou no Terror, and as I saw he also did the one for Hamatora, I was excited. The song is energetic and kinda reminds of Nice-kun. ED wasn't bad either, but I prefer ending songs to be paced slower. \\n\\n\r\nCharacter: 5/10\\n\r\nThe characters. Pfffff. Could've been so much more, but it's like the ones in charge of this anime didn't bother. In a few eps, we are told a bit about some of the characters stories and background, but mainly, it's just shady details. The only ones I do remember had a proper story are Honey and Three, and we found out a bit about Ratio and Birthday too (not very in-depth though). The character we don't know anything about, except she likes food, is Hajime. That's it. She also used her minimum for maybe 2, 3 times in the whole season? A waste.\\n\r\nA point has to be made about the villain, Moral too. He is revealed as a villain in the first or second (I don't really remember) episode. At the beginning, basically. I don't like him. He is just too dramatic. His voice is so annoying and the stuff that comes out of his mouth.. The dialogue was just terrible. At some point, I wouldn't be surprised at all if I learnt a third grader wrote it.\\n\\n\r\nEnjoyment: 3/10\\n\r\nAs said, the first few eps are good, then the quality drops. Sometimes, just as the story starts moving, something completely irrelevant comes in. Not even a plot twist, it's just an irrelevant occurrence. \\n\r\nSometimes in anime, the beginning episodes do have these random things to set up the atmosphere, but it should not happen in the middle of the anime as it only disturbs the pace.\\n\\n\r\nOverall: 5/10\\n\r\nAnd perhaps even a five is to generous? The beginning was promising, but the anime definitely disappointed me and when I saw a friend was watching it, I told him he should read some of the reviews here and leave it be. There are plenty better series that don't disappoint, go watch those instead and leave this one be.",
            "date": "2014-12-31T02:32:00+00:00",
            "helpful_count": 7,
            "mal_id": 175347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3575681.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Axernea",
                "username": "Axernea"
            },
            "url": "https://myanimelist.net/reviews.php?id=175347"
        },
        {
            "content": "In the world which we live in chosen have been granted abilities of superhuman nature by birth, with the blessing of having power to claim salvation or devastation comes the ideology and battle between the weak and the strong. Should the episodes grasp your opinion or should it extinguish the flames of equality? Could it open your heart out for the people deemed without the fortune of having such, that is the question of and for private detective agency Hamatora.\r\n____________________________________________________________________________\r\nStory - [ 5 / 10 ] [ Has/Had potential only to be ruined by poor writing of two different minds ]\r\nMain protagonist is a youngboy seemly named [Nice] During the story we will not know much of the history of him nor the very close partner that he works along with [Murasaki] During the twelve episodes we'll join them and rest of the two on two teams of café nowhere to a short journey only unfold foolish and unclear missions for almost faceless people of horrifying \"filler\" episodes. Story is clearly written by two different persons and both wanted something else.\\n\r\nEvery second episode has fun and humor on the side dish, as the very next one would be without humor to assess the real problem and grim situation of the very world?\\n\\n\r\nI know what i wrote, and people who love the sort of \" battles \" of minds and ideologies are on the same page with me on this one. What is truly right and what is not? The story unfolds upon a very quick and yet odd pilot episode. There is a lot to take on terms of What is this so called power? Where did come from? What are the limitations? tons of questions for our hunger of knowledge. Yet no echo brings answers during the twelve episodes.\\n\r\n_____________________________________________________________________________\\n\\n\r\nArt - [ 7 / 10 ] [ Colors and quality are very visible in a good way ]\\n\\n\r\nThe pure colors of the world are vivid and full of live true, but is it honestly the very color of grim and undeemed world that the situation at hands? No it's not, but for every second episode it somehow is? Fighting scenes are on par with the top-notch ones, but only once or twice. You can clearly see when they were lazy to animate \"that\" tiny bit more, or give that kick an extra detail.\\n\r\n_____________________________________________________________________________\\n\\n\r\nSound - [ 5 / 10 ] [ Can i truly review sound and music if barely heard any? ]\\n\\n\r\nThe opening theme does offer a sense of mystery for a brief ten seconds only to be stolen by odd yet mainstream tune and beat. Sounds and music of the real animation were nothing of boring and undead to be honest. Very very mediocre compared to \"GiTS\" or \"Monster\" where you will get goosebumps just by listening to the composition. Hamatora does not deliver this one.\\n\r\n_____________________________________________________________________________\\n\\n\r\nCharacters - [ 6 / 10 ] [ Seen worse, Seen better but dialog of two men gave it 6 out of 10 ]\\n\\n\r\nAll and all the characters are lively and own very streamlined personalities, with the personalities you somehow decipher their powers too before even seeing them in action? Have we seen too many characters like these lately? I'd agree however during your marathon you'll encounter two different souls and with them come ideologies which clash like titans against one another. For me that was solely the reason to see this till the end. Too little is known of everyone from the Cafe and with the teams you can barely feel their coöperation in terms of reality.\\n\r\n_____________________________________________________________________________\\n\\n\r\nEnjoyment - [ 5 / 10 ] [ Forcing one to watch only to wait next episode is unfair ]\\n\\n\r\nIt's hard to rate enjoyment which is split by two different stories for me. Do you find it unfair to watch an episode of same show, knowing that it will not contain anything new nor continue related to the very grim and horrible incidents happening during last episode?\\n\r\nI know i'm harsh with this one, but it shouldn't be a burden to watch one to gain one?\\n\r\nNo pain no gain as they say?\\n\r\n_____________________________________________________________________________\\n\\n\r\nOverall - [ 6 / 10 ] [ Mixed opinions in a bowl of intellectual moshpit. ]\\n\\n\r\nHamatora is a show where young teams toss their fists together to carry out very little in terms of money, however in terms of teaching what is right and what is wrong. Sure!\\n\r\nThe show has its moments in fights and dialogs, but in terms of what this could have been with better writing....? We'll never know unless the upcoming 2nd season promises something short of amazement.\\n\r\nOh the irony of right and wrong... You will find yourself on either the right ro the wrong side of this show. I must have been on the wrong one.\\n\\n\r\nNow it's time to choose yours? Who's side are you on? :)",
            "date": "2014-04-02T17:17:00+00:00",
            "helpful_count": 7,
            "mal_id": 138379,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/295763.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Caenn",
                "username": "Caenn"
            },
            "url": "https://myanimelist.net/reviews.php?id=138379"
        },
        {
            "content": "When it comes to cliff hanger endings this should win a award.\r\n---Story--- (7/10)\r\nThe story follows Nice and his adventures with the group of Hamatora a group of people who take up tasks for money and complete them with there Mininum powers. \r\n---Art--- (9/10)\r\nWhen it comes to the art of Hamatora it is above average and different. It is flashy and uses practially ever color in the rainbow. The fight seens are different and can get a bit gorie.\r\n---Sound--- (6/10)\r\nMusic is nothing special the opening and ending are nothing really special or catchy. \r\n---Characters--- (8/10)\r\nThere is nothing better then having interesting and different characters. When youhave characters that are all different in fashion, powers, ways of thinking, personality. Its better then having your generic school enviroment with standard clothing.\\n\\n\r\n---Enjoyment & Overall--- (7/10)\\n\r\nThe anime is different but now amazing our something you need to go out of your way to watch. When i watch anime i watch to enjoy and if i do i stay till the ending and if im writing a review it clearly kept me there till the end. \\n\\n\r\n---Warning---\\n\r\nIf you cant handle having a huge cliff hanger with some left unanswed questions. I will suggest waiting till the 2nd season comes out which is announced at the end of the series with a \"To Be Continued\".",
            "date": "2014-03-31T02:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 138023,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2843773.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Oixo",
                "username": "Oixo"
            },
            "url": "https://myanimelist.net/reviews.php?id=138023"
        },
        {
            "content": "Synopsis:\r\nThe story revolves around \"Minimum\" —special hereditary powers discovered only in an extremely limited number of humans. Those who possess such powers are known as \"Minimum Holders.\" The Hamatora is a group of freelancers that'll do anything in exchange for money and they do their jobs in pairs (Nice&Murasaki, Ratio&Birthday). The police, led by Art, usually asks help to the Hamatora.\r\nStory:10\r\nThe story is very interesting. It leaves me hanging on every episode so I was like \"I need to watch the next one!\" \"What will happen next?!\". Everything is very awesome, It was very mind-shaking.. It'll leave you thinking. Also, added the intentions of everycharacters, it'll give you questions that'll make you curious of what's behind it.\\n\r\n\"Hamatora the Animation\", an anime that'll make you think \"What's next?\".\\n\\n\r\nArt: 9\\n\r\nThe art was very great-- full of colors and details. The art isn't dull and shabby. In fact, I find the characters charming and well-drawn. Their powers ( when the characters are powering up), the blood, the clothing, everything.. thumbs up for the art!\\n\\n\r\nSound: 10\\n\r\nThe sounds help you cope up with the situation. So when there are fighting scenes, the background music has fast rhythms and  beats, which makes you excited too. As for me, it makes me tensed and I get really pumped up lol. The music suits every scenes, very well chosen indeed. So yeah.. I liked it.\\n\\n\r\nCharacter: 8\\n\r\nI find the characters' pasts very shady. Though there are some scenes that explained who they were before, still, there are some point that it wasn't enough. The anime didn't even put much of a highlight to their pasts. In fact there were some that wasn't explained and given much of attention (and that leaves me puzzled). Well, I bet the author will reveal it in the next season (I hope he does). Overall, about the characters, I like their attitude and characteristics. Especially, Nice's. Their badass personalities were pretty awesome. For me, all of them are cool and very powerful-- and that makes me pumped up when they're battling. \\n\\n\r\nEnjoyment: 9\\n\r\nThe anime was very entertaining, very thrilling. Even the humor is great! Not even a bit that I was bored.\\n\\n\r\nOverall: 9\\n\r\nThe overall anime, it was very awesome-- what a masterpiece. It didn't disappoint me-- not a bit! Watch out for the twist. This is a must watch! Until the very end of the episode, it'll leave you hanging and wanting to watch for more!!",
            "date": "2014-06-05T01:50:00+00:00",
            "helpful_count": 6,
            "mal_id": 145935,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3778743.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KatrinLouiseo24",
                "username": "KatrinLouiseo24"
            },
            "url": "https://myanimelist.net/reviews.php?id=145935"
        },
        {
            "content": "I started watching Hamatora at random, I was just bored one day and decided to go on Crunchyroll to see what was available and I saw Hamatora. I've seen a lot about it before so I decided to give it a shot.\r\nI agree with some comments here saying that the anime is a lot of filler, but it certainly isn't useless filler. It really gives you a feel on what Minimum Holders can do, and it shows you what Hamatora's average everyday life would be.  \r\nI really enjoyed the storyline, and I cannot wait for Re:_Hamatora to release more episodes so I could findout more about it. I was lucky that  I finished the series while the second season was airing, because the ending is a huge cliffhanger.\\n\r\nA lot of the parts in the anime shocked and disturbed me, but in a good way. Some parts left me crying like a baby, and some made my jaw drop. It's a very shocking anime, dealing with crime for a lot of the episodes, which may be triggering to some.\\n\r\nThe characters were all loveable and hateable in their own ways. A lot of these character's actions were among the things that shocked me, and I liked that a lot.  \\n\r\nI finished this anime about a half an hour before writing this review, and I am still in shock and suspence. This anime, although it may not be for everyone, will definitely leave you at the edge of your seat.  I highly recommend this series to anyone who likes mystery and a plot that revolves around  superhuman qualities. In short, this anime  in my own opinion was great to say the least.",
            "date": "2014-07-23T11:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 153387,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3717541.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/freemums",
                "username": "freemums"
            },
            "url": "https://myanimelist.net/reviews.php?id=153387"
        }
    ],
    [
        {
            "content": "Hamatora The Animation is exciting at one point and confusing at another point. Nevertheless, there are actually a number of good reasons why you can enjoy this anime. :)\r\nStory: 7/10\r\nThis anime is centralized in a detective-mystery-investigation theme that involves super-human powers and intertwined narratives that tell us an interesting and rather complicated story. As the series goes deep, the story actually becomes crazy and confusing at a certain point, and confusing it actually ends. Nevertheless, I really liked how it was portrayed as a surreal environment and yet it actually touches realistic concepts of discrimination and social systems. I find the individual cases itself interesting,since despite its shallow slash dark nature, it actually presents to be case closed but later be revealed to be a part of something even more complicated and confusing. The relationship of each individual cases is actually a strong point of the story of the series. It is unique in its own way. There is a strong point of comedy shown, it is usually hidden and uninterpreted, which makes me appreciate it. Its arguments rather presents a solid value and the weight it brings actually depends on the  watcher's perspective in watching the series. However, I dislike how the story progresses, although I can bear its craziness and confusing side, I can't bear how everything was just presented in a shallow manner. The story unfolds not that neatly, everything feels connected but that's just it. Metaphorically, I only get to see the tip of the iceberg and not much the thicker surface that binds it. The super-human power is actually interesting and unique, but again, I can only see the tip of the iceberg.\\n\\n\r\nArt: 10/10\\n\\n\r\nThis is a strong point of the series. Animation was very colorful and flashy. It is clear-cut, the characters are drawn in a way that they match the surreal environment. I like how the series artfully present a certain thematic-action aura. The next thing I knew, everything becomes colorful and me close to schizophrenic. I find it actually cool that the art drove me to much craziness. I liked how the characters are drawn, it gives you a cool and exciting feeling. I have come to love the characters not much of how they  develop and progress in the series but much of how they were presented artfully. the art of the series would actually contribute to the \"unique\" feeling I felt when watching this show and the instant \"drive\" to finish watching it. \\n\\n\r\nSound: 9/10\\n\\n\r\nSound is more than average for me. Aside from the opening song, I like the sound effects and sound backgrounds used in the series. Some of these sounds ranges from eerie-scary-cute. Sound timings are very clear cut and it synchronize well with still-blank atmospheres. I like the quality of sound and music presented. \\n\\n\r\nCharacter: 8/10\\n\\n\r\nCharacter development is less likely seen in this anime series. I liked the characters' individual personalities and specialty, but some of the characters' progression actually confuses me at midpoint. Nevertheless, The protagonists of the series have very likable personalities that I have come to love, despite having some crazy and confusing elements. The different personalities presented  in a way that I have come to love some, dread a few, and hate exceptionally.\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nI honestly enjoyed the series despite being crazy and confused with the story. For one, it is because of the artfully designed characters. I like that it was presented colorful and flashy. Another is because of the combination of sound effects and still-blank settings. It is uniquely presented and actually contributed to the confusion theme. Another one is that because of the web relationship of cases and scenes and characters. This is a challenging part, but as much as it confuses you, it actually gives you some certain answers and lessons. Although, I find it shallow and unfinished, it is quite a show. \\n\\n\r\nIn the end, It is not one of the best that I have watched, but it is definitely entertaining. I laughed and get shocked simultaneously at some point. I have over a number of wrinkles in my forehead while watching the show, but at some times I also remember smiling while watching the show. I don't know how my face looked at the ending, but I'm certain that it is not a nice sight. I think the show spells uniqueness in many aspects, names and settings are quite the example. Its a crazy entertaining flashy show that gives you an :O in the end. \\n\r\nI recommend this to mystery-detective-investigation fanatic like me or borderline bishie-fetish also like me or super-power and action maniac also like me. \\n\\n",
            "date": "2014-04-17T10:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 140313,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2564949.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Saber_Princess",
                "username": "Saber_Princess"
            },
            "url": "https://myanimelist.net/reviews.php?id=140313"
        },
        {
            "content": "Unoriginal, predictable, repetitive and for the most part boring and “wanting”\r\nWhen I start doing something -whether reading a book, watching a movie or in this case an anime- my attempt and “promise” –to call it somehow- is to watch it completely, it doesn’t matter how good or bad it is. Eventually you’ll –might- be able to find something that “catches” your eyes –whether a characters aptitude, or the art or even the soundtrack- so I’ll start this review, keep in mind that this is MY PERSONAL review, in no way I’m telling or trying to mess with your own opinion:\r\n-STORY: 3-\r\nFrom the start it wasyour generic “I have superpowers, so I must defend the world –country- but I must remain hidden because that’s how we roll” anime, pretty much the same premise showed in other (in my opinion, better) TV shows/ movies. In the first 8 episodes (more or less) there’s the typical repetitive pattern in this kind of anime: The detectives are called in, they face a problem and as predicted they solve the problem.\\n\r\nDuring some episodes there’re the small hints that there’s a real problem/ adversary underneath it all. Nothing surprising, and even less surprising in this kind of story –which I’m not going to unveil for respect of those who want to see it-.\\n\r\nWe can compare most of these characters with those on “X-Men” and “Tokyo ESP” (Shows that have better story, or better said, they’re better in every sense. Period).\\n\\n\r\nTo be honest the last 4 episodes are the “best” and that’s saying waaaay to much.\\n\r\nThe climax if we can call it  a real “climax” doesn’t reach the desired level, but still it gets you a little more excited than the start of the anime.\\n\\n\\n\r\n-ART: 8-\\n\r\nThe art is one of the “highpoints” of the whole show, it’s so colorful but that colorfulness sometimes is weird –when they use their powers the colors seems odd. Nevertheless, the art was really enjoyable.\\n\\n\r\nSo I’ll call the art of this TV Show the jewel of the “wannabe”-crown.\\n\\n\\n\r\n-SOUND: 8-\\n\r\nThe second and final “Highpoint” of the whole show.\\n\r\nA soundtrack that doesn’t reach the level of “memorable” but that it’s still surprisingly well done for a show so… lame. A “collection” of sad, “dark”, “blue” and “grey” compositions and ambient sounds that will make the experience of watching this show a lot more acceptable.\\n\\n\\n\r\n-CHARACTERS: 4- \\n\r\nAs a writer –in my own language (of course)- I know it’s difficult to create a character that’ll be remembered or that’ll break the “generic” mold. \\n\r\nBut these characters are boring, predictable, they don’t “grow-up”, they don’t change. I know it’s a 12 episode format, but I’ve seen better character development in other anime’s with the same amount of episodes. And most importantly the character didn’t make me feel “in” the show.\\n\\n\r\nProbably the best character in the whole show was: Art. The only character –in my opinion- worth watching\\n\\n\\n\r\n-ENJOYMENT:3 & OVERALL:5-\\n\r\nIf you’re interesting in watching a typical and predictable show and if you –really- have time to waste this is your show.",
            "date": "2014-10-29T00:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 166621,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4195751.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GonWithARose",
                "username": "GonWithARose"
            },
            "url": "https://myanimelist.net/reviews.php?id=166621"
        },
        {
            "content": "I dont normally write reviews but I thought it'd be good to review this since i saw many people rating it less than 6 which is quite surprising for me since i enjoyed this very much.\r\nStory - 8\r\nThe story was outstanding but the idea of people having powers and so is used quite a lot. however the use of this idea was amazing. It keeps you always at the edge of your seat and i haven't been into an anime for a long time. normally when a sad scene happens i wouldnt react as much as this anime made me. This might be not onlybecause of the story but also because of the characters.\\n\\n\r\nCharacter - 9\\n\r\nI got pretty attached to the characters really fast and they were all quite lovable. however it explained why some characters were there late which made me always ask questions to myself about the characters and didn't give them much care, which annoyed me, but not a lot.\\n\\n\r\nArt - 10\\n\r\nThe art was really awesome. It was very colorful unlike any other anime, which you'd see in the comments while watching it. I liked their use of colors and the i didn't really find any flaw in the art. everything was drawn really well.\\n\\n\r\nEnjoyment - 10\\n\r\nThis anime, as i said before, was very exciting. It was never boring to watch and it was really funny.\\n\\n\r\nSound - 9\\n\r\nI think the soundtrack for this anime was one of my favourite things about it. The OP and ED were catchy n i lovedd them. however sometimes but only rarely theres music added to a scene which kind of doesnt match the scene. this only happened in episodes which didnt have action scenes and stuff so yeah it was not a big problem at all.\\n\\n\r\nOverall - 9\\n\r\nThere are many better anime than this but this was awesome to watch. finished both seasons in less than two days. this made me laugh a lot and i kind of finished both seasons this fast only because of that. or else if it was all dark n sad i wouldnt have completed it that fast because i needed a break from dark anime n stuff cuz i watched this after the 26th episode of death note. anyways this is an anime id recommend for times like i mentioned even though its not one of the best anime out there.\\n\r\nI hope this was helpful :)\\n",
            "date": "2016-04-01T02:02:00+00:00",
            "helpful_count": 5,
            "mal_id": 215013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4515895.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shiroiwayagi",
                "username": "Shiroiwayagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=215013"
        },
        {
            "content": "I loved this anime. The story is catching and interesting but some points could have been improved. Like the reason of the big bad boy to do big bad things. But I really liked it and wasn't bothered at all by it. Things are different when it comes to the second season though. You can't say the art is not amazing, I mean, look at all these colors this is really the point that I like the most about this anime! The characters could have been more developped and more, I wish there was an evolution between the beginning and the end of the animeand the thing is there is none. But some characters are still interesting. Even though it has bad point I really really enjoyed watching this anime and I like how the plot develops, until some point. Overall I give an 8 because I still think this is a good anime, the story isn't bad at all, the art is great and well, there is a good coherence between the story, the art and the sound.",
            "date": "2016-02-17T10:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 211103,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4547726.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ewinaaa",
                "username": "Ewinaaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=211103"
        },
        {
            "content": "A minimum holder is someone who was born with a special power, making them different from everyone else. Having the power can be a good thing, but jealousy caused by it can make the entire city go into chaos. At first I didn't understand what was going on in the anime because the whole explanation of \"minimum holders\" was a little confusing, but I caught on real fast - as you can see - and came to love this anime. \r\nI started this anime late one night when my eyes were barley able to stay open. So I didn't have to strain my tired brain trying toread subtitles, I decided to watch the dub. The English voice actors were amazing compared to other dubbed anime and I really appreciated that about this show. I feel like the voices that were chosen for each character were well thought out because they reflected very nicely on the characters' personalities. \\n\\n\r\nA couple things bothered me throughout the show however. Usually I come to love the villain(s) of an anime because their character is well developed (and attractive), but the villain in this show - named Moral - was obnoxious and annoying. I hated hearing him rambling on about \"saving Nice\" and all that crap, but I mean I guess that was the point. He's a villain, and his villain rants were supposed to be evil. \\n\\n\r\nThis is where I say that I am SO happy there is a second season because I loved this show all the way to the end, but the way this show ended was COMPLETELY unacceptable and made me VERY angry. If you watch this show, plan to watch the second season because the way this season ended was utterly unsatisfying. \\n",
            "date": "2017-02-16T14:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 240720,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545700.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NalarueAni",
                "username": "NalarueAni"
            },
            "url": "https://myanimelist.net/reviews.php?id=240720"
        },
        {
            "content": "I've read the reviews for this anime and while I mostly agree with them, there's something I think I can add, so I'll add it. Firstly though, Hamatora is that it's about super powered people in a non super powered modern world.\r\nA lot of people have compared this to Psycho Pass and Darker Than Black, and while I can sort of see where they're coming from, at the same time, it's not right at all. Hamatora is inherently a light hearted anime with some icky stuff going on in the background. Even when it becomes darker, it has a weird light hearted, or rather, disconnectedfeel to its violence. Both Psycho Pass and Darker Than Black had a lot of heart warming moments but they were serious animes existing within a distopian society. While it's true that Moral looks like Makishima (and on surface level seem alike, but their methods, motivations, and goals are completely different), and that Minimums being similar to Contracts, I think Hamatora actually has more in common with slice-of-life animes.\\n\\n\r\nSTORY 7/10 - Although the way the story was told causes some head scratches, the concept itself is not bad. Moral unfolds an acceptable plan of villainy that the heroes must wade through, and the stakes are not too small scale or too large. I don't suggest watching this for a deep and complicated plot, but it's thought provoking enough for something 12 episodes long. And despite everything, I was satisfied with the last episode.\\n\\n\r\nCHARACTERS 7/10 - The artwork of the characters is nice and everyone has something unique to set them apart, and they're all very easy to look at. The characters themselves, however, are something of stereotypes, and they never quite get any character development. Nevertheless, they all do have their little quirks, such as the psychotic Birthday's attempts with ladies and Hajime + food. They're very enjoyable to watch, and for a fluffy 12 episode anime, they work.\\n\\n\r\nANIMATION 9/10 - The animation is sharp and the fight scenes are smooth. The only thing is that sometimes the drawing's too sharp and has a game-animation feel to it. Added to that, the nightmare of colour that happens whenever a Minimum is activated can be off putting for some people. I've come to enjoy it myself, but it was hard to get used to and I see people getting headaches from it.\\n\\n\r\nMUSIC 6/10 - Some of the score is nice, but some of the music is really oddly placed. It causes a disjointed feel to the scenes which would be kind of cool if it were done on purpose, but nonetheless does not really add to the anime. It reminds the viewer that they're watching something rather than simply immersing them in the moment, which is never a good thing.\\n\\n\r\nOVERALL 7/10 - While this was not the greatest anime ever to come into existence, it certainly is enjoyable enough to warrant a watch. The hot springs episode for instance was hilarious for me and I've never seen anything like it, but I know an equal amount of people who hate it so I suppose this anime's a hit or miss. It doesn't really get better, it doesn't really get worse, and you can probably tell if you'll like thae series or not by episode 3. Although, it does get a lot bloodier in episodes 11 & 12.  If you're looking for light hearted shonen overall, definitely give this a try.",
            "date": "2014-05-13T18:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 143255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3105343.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Miserable_Crow",
                "username": "Miserable_Crow"
            },
            "url": "https://myanimelist.net/reviews.php?id=143255"
        },
        {
            "content": "*Warning, spoilers in the second half of this review.\r\nI went into this anime with no real idea of what it was about; I had not even read the synopsis. Upon completing the anime, I decided to read through the reviews.\r\nI will mention that I did thoroughly enjoy this anime. However as should be with reviews, I will be completely objective in my analysis. I generally do not write reviews often, and not necessarily for anime that I like, but I am compelled to write reviews for anime that are objectively misunderstood. In this case, I saw the terms/phrases “lots of filler,”  and “undeveloped characters”floating around among other reviews, which I think do not do this anime justice. Of course I will explain why.\\n\\n\r\nIf you are not prepared to read a long review with relatively deep analysis, or simply disagree with me without attempting to understand why I think this anime deserves the points, both positive and negative, that I give it, then go ahead and mark this review as “Not Helpful” and move on. There’s no sense in wasting either of our time.\\n\\n\r\nThe animation style wasn’t anything special. At some points it was a bit lower in quality, but the key thing was that the animation was smooth, not choppy. The soundtrack didn’t really stand out, but at the same time it wasn’t horrible.\\n\\n\r\nThe three things I think stand out about this anime are the concept, execution, and some key character development.\\n\\n\r\n*MINOR SPOILERS AHEAD*\\n\r\nLet me first begin with the concept. If you are even a moderate anime watcher, then you’ll immediately draw parallels to the iconic Darker Than Black, Durarara!, Psycho Pass, Mekakucity Actors, K project, maybe even Kamisama no Memochou. I do not know if the writing was inspired by any of these pieces, or if the story just happened to land in the crossroads of big names as mentioned, but the concept does not end up feeling overly jam-packed or forced. From the perspective of someone who has not seen any of the above anime, the concept is still interesting. Inevitably there would be a parallel drawn to the superpowers in Darker Than Black. In Darker Than Black, the condition for using powers drives a pretty key point home, that the power holders, or Contracters, are bound to their power and cannot escape, almost like the power controls them. However, this is not elaborated on in Hamatora. The group Hamatora is set up with a pair of freelance Minimum Holders who may be hired for odd jobs by, up to and including the police force. Despite this being their only apparent income, they give off the impression of being low key; they do not seem to advertise openly. This is a rather practical paradigm. As we see later in the anime, society becomes afraid knowing many Minimum Holders existed in the city, which results in rioting and chaos. A normal transaction would begin with a person who would require special help might seek out the power of a Minimum Holder. In this arrangement, the person relies on the holder to complete the job, and the holder relies on the person for payment. With this established relationship, the person has no reason to feel intimidated by Hamatora, who intends to solve their problem, because they have made a transaction just like they would with anyone else. It is a rather humble yet satisfying way to live. This is backed by the fact that Nice and Murasaki were some of the most genius Minimum Holders in history, yet both dropped out of the academy and settled in to this way of life.\\n\\n\r\nWhile the concept of Hamatora the Animation is quite clever, I was also pleased at how smoothly Hamatora was executed. Similar to how there are many anime fans who care much about an anime’s soundtrack or animation, execution is a very subjective topic in anime. Some people say execution is everything, some people say everything else matters but execution doesn’t. Most people will probably disagree with this point over the other two, so I’ll keep it short. The best way to describe execution is attention to detail, smoothness, pacing, and in general how the anime comes together. Execution is what can make a relatively normal anime with normal characters and a normal plot stand out with an iron fist, and conversely how an anime with good concept and characters may fail. An obvious recent example of good execution is the first story arc of Sword Art Online. Considering everything except the characters and concept in Hamatora the Animation was nothing special, the anime flowed rather well from episode to episode, with well paced build up and detailed character development in some areas. \\n\\n\r\nAnd of course I had to save the best for last. The reason Hamatora stood tall in front of me at the end of the day was because of its key characters. I say key characters because I do not believe every character was well developed, so please keep this in mind before reading. I will explain the ones that had good character development.\\n\\n\r\n*MAJOR SPOILERS AHEAD* \\n\r\nSince he was one of the first to be developed, I will begin with Inspector Art. Unlike the Hamatora team, Art is much more resolved and driven in his actions. We get the impression that he stands above Nice as an official defender of justice. We later learn that Art was the only graduate of the academy for Minimum Holders who’s power never manifested, and that he had worked very hard to achieve that. As the anime progresses, it is clear that Nice is not only a genius in terms of his superpower, but in his reasoning skills too. The reasoning behind Art’s jealousy is clear as day then. Art is a person who worked hard and obtained a prestigious position in the police force, yet is still overshadowed in every way by Nice, who dropped out of the academy and lives an apparently whimsical life, yet helps solve Art’s cases as if they were child’s play. Furthermore, Art begins to regard Nice with suspicion when they take down the purple giant Takahiro, and Nice comments, “He looks so carefree.” Art beings to draw parallels between Nice and Moral when he realizes Nice understands Moral far better than he does himself. Overcome with jealousy and suspicion, Art eventually cut Nice off from the Moral investigation. Ultimately, Art’s jealousy leads to his own tragic death, a mistake he knew he had made the whole time. His regret is clear as the last thing he does with all his might is attempt to answer a call from Nice, but never reaches it.\\n\\n\r\nWe see some similar parallels drawn between Art and Murasaki, the Hamatora duo. The anime introduces Art and Murasaki as partners. We see them work together on missions, and have their share of disagreements along the way. Later in the anime we discover that Murasaki was a genius among Minimum Holders, and was ranked number 2 among all holders in history. While Nice is impulsive and reckless, Murasaki is far more clear headed and logical, yet occasionally becomes angry when Nice disagrees with him. Later in the anime, we find out that Murasaki has always been overshadowed by Nice. Nice is so strong and smart that it does not matter what job he takes on, or how, because he gets the job done no matter what. It is almost as if Nice leads a rather mundane life. As Nice’s partner, however, Murasaki keeps up his end of the hard work, working efficiently and logically to complete jobs and obtain the most amount of money possible. Despite this, Nice never seems to appreciate the work Murasaki puts in, and the pent up frustration shows. Murasaki is both frustrated and angry at how Nice surpasses him in every way, and does not have to try hard to do it. For that same reason, he is the best fit as a partner for Nice, because whenever Nice slips up or loses his head, Murasaki is there to punch him back into shape, driven by his frustration, jealousy, and friendship.\\n\\n\r\nOne of the best points of this anime was how subtle yet substantial the build up was for Nice’s character. Although Nice seems to be a central character in the anime, he remains rather passive for much of it. When it is revealed that he is the legendary number 1 Minimum Holder, we realize that Nice is not simply a uniquely talented deadbeat impulsive protagonist out of a shounen anime, but the whole time he was the most powerful Minimum Holder in existence. This changes the perspective on his character. The reason he looks so bored and laid back is because there is nothing for him to be serious about. This also reveals why both Murasaki and Art are jealous of Nice, because Nice can afford to breeze through problems that are larger obstacles for them. More hints to Nice’s character begin showing when Nice encounters the transformed Takahiro, and comments how Takahiro looks like he’s having fun. Later when Takahiro comes back to ask Hamatora to help him regain his body, Nice makes a seemingly uncharacteristic decision and refuses to help Takahiro. Because Nice doesn’t care about the money and takes jobs on a whim, this seems to be a strange outburst of emotion on his part. However its at this point that Nice’s true feelings are revealed. While others struggled to hold a candle to him, he has always despised his own power and talent. His reason for half-assing everything is not because he is trying to express his superior ability, but because he hates his own power. He knows its unfair and that it distances him from his friends. But whether he uses or hides it will not change their feelings of jealousy. When Art heard Nice comment on how he thought Takahiro was having fun, he misinterpreted Nice’s meaning. Art probably thought Nice wanted freedom to use his power as he pleased, a dangerous wish. Nice’s true feelings were different. Takahiro desired his power, and obtained power. In other words, Takahiro got what he wished for, albeit in a twisted manner. Nice was jealous of Takahiro because Nice himself is very dissatisfied with the power he was born with, a feeling that Art or Murasaki could never understand. As a result, he was angry at Takahiro for wanting to throw away what he had wished for and obtained so easily. However one person did understand, and that was Moral.\\n\\n\r\nThis brings us to the crown jewel of the series, Moral. If you look past his creepy demeanor, Moral is one of the best written antagonist villains I have come across for awhile. In fact, the only problem I did have with him was that the writer felt the need to make him come off as creepy and weird, presumably to off-put the viewer. Part of the reason it is difficult to write a good antagonist is because unlike the protagonist(s), whom the audience is meant to relate to and side with for a supposedly good cause, a well written antagonist must do things that impede the protagonist’s progress, or clash with his ideals, and by extension the viewer’s, causing the viewer dislike him. At the same time, a good antagonist’s actions must be logical, or also relatable to an extent. Otherwise it is simply a bad person doing bad things for no reason. Moral understands the insecurities and wishes of each of the above characters, which he uses to manipulate them. He sees the potential of unrest that the people would express if he simply gave the Minimum Holders a little push over the edge. When Moral justifies his creation of non-innate Minimum Holders, he says there is nothing wrong with giving someone the means to achieve their goal. As the viewer, we somehow know what he is doing is wrong, yet upon taking a step back and thinking it over, in itself there is nothing inherently wrong with helping people towards a goal. The sole purpose of Hamatora is to help people with jobs they may not complete on their own. In a way, Moral does the exact same thing, using a different method with slightly unstable people. Both ways, Minimum Holders are interacting with society. Moral knows this is a similarity in their methods, and uses it to mock Hamatora, showing that good intentions can drive people and society to chaos. Moral then proceeds to reveal the dormant fears of people by manipulating media, causing riots across the city. While on the surface it appears to be coordinated anarchy, Moral wants to send a message, that these people had always had the potential for fear, chaos, and violence. They simply lived a life of ignorant bliss by burying their fears. Moral decides to reveal this true face, causing people to realize they are unequal, thus triggering a desire to become Minimum Holders. Conveniently, Moral has developed a method to do this. In the end, Moral was able to provide society with what it truly desired. Near the end of the series, Moral talks about “saving” Nice by gaining a Minimum that will match Nice’s. Of course in the last episode, Nice tells Moral that he’s insane, that he does not need saving. Moral ended up achieved that objective as well. Throughout the anime, Nice is not only laid back, but is also lacking in emotion. Because he is so powerful and smart, he is far removed from society, which causes him to lose touch with people around him, including his closest friends. When Moral kills Takahiro, however, Nice becomes enraged and goes to fight him. This is the first time that Nice shows a strong emotion in the anime. Shortly following when they fight, Nice is at a clear disadvantage for the first half, and he gets kicked around. Moral was able to do what even Murasaki or Art could not do, make Nice feel pain and anger. In essence, confirming that Nice is human. Although Nice would never thank Moral for it, Moral knew he had completed everything he had hoped to, and embraced his defeat. We also see at the end that Art shoots and kills Moral, then shoots Nice. But Moral is fine with dying by Art’s hand, because Moral was able to drag Art into the darkness with him.\\n\\n\r\nThus concludes my review. Of course I have not covered every aspect of this anime, but I feel that I did not have to. I covered what I needed to. I do not often review anime, but when I come across an anime that I not only enjoyed, but believe is objectively different than the other reviews that I read, I definitely feel compelled to put in my own word.",
            "date": "2014-09-24T23:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 162039,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3827243.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/luciferthesecond",
                "username": "luciferthesecond"
            },
            "url": "https://myanimelist.net/reviews.php?id=162039"
        },
        {
            "content": "This anime pissed me off so much. Because the plot was good and the characters awesome. But... but.. then they killed it. WITH THE AMOUNT OF FILLERS THEY PUT IN AND WOULD SOMEONE LIKE TO EXPLAIN WTF HAPPENED AT THE END! I MEAN SERIOUSLY WTF! Now that my rant is over onto what I liked.I enjoyed how the main protagonists were not technically good. Yes they saved people and were technically heroes but they had a bit of a dark side to them which I enjoyed*. I liked the characters but there wasn't very much development with them.\r\nNow onto what I was saying about fillers.I'm sure other users have already said this but the anime was mainly made up of fillers. They was about two minutes of actual plot at maybe the end of one episode. If you had to work the plot into taking up a full episode there would probably be about 2 episodes. However I will say I'm watching the Re:Hamatora because there is a twist ending that will leave you thinking. What the fuck just happened. That is if you don't drop it.I\\n\\n\r\nI would not recommend this anime because it is amazing or awesome. But I do think people should at least try it out. Because its not completely bad just mediocre.\\n\\n\r\n*I'm mainly talking about Nice.",
            "date": "2014-06-17T20:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 147389,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3770033.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Think-Furst",
                "username": "Think-Furst"
            },
            "url": "https://myanimelist.net/reviews.php?id=147389"
        },
        {
            "content": "Well, I'm sure I can't say anything new, more than these reviews already did, however, I'd like to give my personal opinion about this.\r\nI happened to watch Hamatora because I love Pyscho-Pass, and this anime was in the recommendations. At first, I had faith, but then I lost it in the second episode I lost it. This is nothing like Psycho-Pass.\r\nThe characters are so poorly built is obnoxious to look at them, there's no background, the story is not interesting, rarely appealing. And if anyone can compare these two (Nice and Moral with Kogami and Makishima) please refrain yourself from committing such a crime. Moralis just another white-haired villain, as every other villain of every other anime. Nice is your average anti-hero who knows he's powerful but who's not willing to help. Seriously, it's just a copy of Psycho-Pass for kids. Basically.",
            "date": "2016-05-01T06:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 217601,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4562569.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Naoki__",
                "username": "Naoki__"
            },
            "url": "https://myanimelist.net/reviews.php?id=217601"
        },
        {
            "content": "This is probably the only anime that I have ever wanted a second season so badly (Yes, I have watched it already). The characters are simply lovable, likable and have just the right amount of coolness in them. \r\nAnd for once, the girl character in the anime can fight as well as the male. None of them are weak but none of them are OP. They all have the moment of defeat and triumph in their life and that is what I liked about this anime. It is not illogical.  Unlike Fairytail, they don't always win a battle, they have loses. \r\nThe action scenesare simply awesome and enjoyable. The character developement are really great too! The ending can make one wanting more of it.",
            "date": "2016-07-31T19:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 225561,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5337921.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kadrian",
                "username": "Kadrian"
            },
            "url": "https://myanimelist.net/reviews.php?id=225561"
        },
        {
            "content": "First and foremost - this is actually pretty good. The story is interesting, the main unique point of the show (the Minimum power) isn't goofy, and the characters are interesting. That being said, the number one feeling I got from this show is \"This is a second-rate Durarara!!\". They are very similar in plot, setting, and overall theme; the only difference being that Hamatora's characters have superpowers and Durarara!!'s do not. I enjoyed watching this show, but in my opinion, the music, visuals, character designs, and plot copy Drrr's. I would recommend Hamatora, because it is legitimately good, but be warned that for those whohave seen Drrr, it may seem slightly familiar.",
            "date": "2019-04-08T13:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 305781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Loppy-b",
                "username": "Loppy-b"
            },
            "url": "https://myanimelist.net/reviews.php?id=305781"
        },
        {
            "content": "Hamatora is one of those few anime that can get you interested right from the first episode. Unfortunately the rest of a show is a cycle of losing the viewers interest with fillers only to pick it back up with a plot twist relevant to the main story line. This anime had a lot of potential and I can’t say it lived up to it. Here’s to hoping the second season will be better. I’ll give an overall score and then delve into specifics.\r\nOverall (7/10):\r\nI really wanted to like this anime from the first episode, and honestly I really did, even when it started interruptingthe most crucial plot moments with filler. It was funny and interesting, the characters were charismatic, fun and interesting, and the plot would have been great if it wasn’t for all the interruptions. The problem that occurs is that the creators are trying to do too much with their material. Even though there is an overarching plot line, it doesn’t move smoothly and at times it’s a little confusing even though the concept shouldn’t be. Thus overall, I can’t objectively give this anime more than a 7 no matter how much I enjoyed it. And to enjoy it, you really have to not take it seriously. You have to accept the fillers as part of the story because once you start getting caught up in the plot, the fillers will just annoy you.\\n\\n\r\nOkay now for the specifics:\\n\\n\r\nStory (6/10):\\n\\n\r\nDon’t let that score fool you, the main story itself is actually really interesting but all the interruptions and filler episodes make it hard to focus on the main plot. I can describe this anime as a mix between Gakuen Alice and Fairy Tail. A group of people with powers known as Minimum, trained by a secret school exclusively for these individuals, (known as Minimum Holders) form a detective and odd-jobs agency where they take on missions to help others with their problems. The missions they take on all end up connecting to the overarching plot somehow. All in all, the story is one that a fan of any anime genre could potentially enjoy, but in reality, if comedy or filler episodes bother you then this is an anime to stay away from. In order to keep the audience interested, the show throws in a lot of plot twists, some of which I enjoyed while others I found excessive or too dramatic seeing as how the anime itself shouldn’t really be labeled a drama at all. \\n\\n\r\nFor me, the characters really pulled the whole show together, and kept me interested even during the fillers, which brings us to our next category:\\n\\n\r\nCharacters (8/10):\\n\\n\r\nMany of the characters are interesting and I’m glad that some of the fillers were actually devoted to giving us character backgrounds. I’ll start with my favorite character, called Art, who leads the police force in the city that Hamatora works in. He’s a complex character in his own right and I’m hoping the second season focuses more on him than fillers. The villain, Moral, is psychotic but also makes this show really interesting and moves the plot along. If nothing else, I’d watch this anime just for Art and Moral and their own conflicts. The main protag duo consisting of Nice and Murasaki are the team called Hamatora. They’re funny, have a strong sense of morality, cool, and basically everything you’d expect the protagonists to be, which actually makes them a little dull compared to Art and Moral because they’re so predictable. The other members of the Cafe Nowhere agency also make pretty interesting characters, such as Ratio and Birthday (I know they all have weird names) and Honey and Three. Each of these characters has their own minimum and uses them to take on missions for money. Another character who seemed to have a lot of potential that was not explored thoroughly (in the first season anyway) is Hajime. She’s basically a background character for most of the anime and all she does is eat, but I’m hoping there’s some more to her character in season 2.\\n\\n\r\nAnimation (7/10):\\n\\n\r\nThe animation was really good and the action sequences were pretty cool, even though it’s not much compared to actual action shonen genres like Naruto or Fairy Tail. The animation fits the story line well though it doesn’t really stand out so it’s a solid 7.\\n\\n\r\nSoundtrack (9/10): \\n\\n\r\nOkay I have to say the soundtrack was amazing. I really loved the openings and endings. They really fit the main story line and give the anime a whole new energy. \\n\\n\r\nFinal Notes:\\n\\n\r\nAll in all it wasn’t a complete failure of an anime, despite all the fillers. Actually, if you just go into it expecting to see the fillers and try to just enjoy them as they come, you might end up really liking this show. I’m definitely going to be watching season 2, if anything then for the conclusion to all those plot twists and also for the main story line, which I can’t deny is very worth watching.",
            "date": "2014-07-19T12:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 152763,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3010167.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nemonekko",
                "username": "nemonekko"
            },
            "url": "https://myanimelist.net/reviews.php?id=152763"
        },
        {
            "content": "It starts off with major potential, but quickly turns down a rather bland road. Many scenes that were supposed to be dramatic left me underwhelmed (I wasn't even whelmed) and thinking \"really?\". Not that there weren't a few parts where I wasn't like \"Woah! Holy Sh*t!\" but the majority of the time I wasn't impressed. The villain is like one huge boring cliche, and I almost laughed at a lot of the \"dramatic\" scenes involving him because of this. The main characters had great potential, but I felt like all the development was unbelievable and thrown out of left field. I mean two of thecharacters go into telling their back stories without even a single shred of prompting. I found that pretty lame. The story's like a cross between Darker Than Black, The Get Backers, and Psycho Pass so I was really looking forward to it, but I felt the entire thing was poorly executed. Still it was pretty enjoyable to watch and I recommend it if you're bored. It's certainly funny enough at times and the art is pretty great. I love the powers of the characters and the unique color changes that occur when they begin to use them. Very eye pleasing.",
            "date": "2014-04-21T19:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 140847,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3720089.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DntBelievNAngels",
                "username": "DntBelievNAngels"
            },
            "url": "https://myanimelist.net/reviews.php?id=140847"
        },
        {
            "content": "Hamatora was a nice anime. Nothing more. You probably won't remember it in 20 years like a legendary one, but it's still interesting and easy to watch and follow. It's a nice choice for a rainy weekend when you need to kill four hours of your time.\r\nStory: 7/10\r\nIt's not a new story but it's still interesting, it has some dark and interesting points, and some comic reliefe when needed. It's not complicated, it's easy to understand and doesn't try to put some new complicated thing every two episodes.\r\nArt: 4/10\r\nBig dissapointment here. There are some things well done, but in general is mediocre, and as Iwrite this review I can't forget some fire animations from the last episodes so badly done I hope whoever did them is now looking for another job.\\n\\n\r\nSound: 6/10\\n\\n\r\nIt's there, nothing interesting or new, voices are nice but nothing more. If there wasn't any BGM there would be no difference, it doesn't ruin the show, but it doesn't improve it.\\n\\n\r\nCharacter:\\n\\n\r\n7/10\\n\\n\r\nToo many interesting characters is bad if you don't have enough time to develop them or explain their back stories. Ther are no wasted ones, every single one of the main cast (heroes and villains) have their personalities, and yes, they aren't anything complicated or new, but every one know it's place.\\n\\n\r\nEnjoyment:\\n\\n\r\n7/10\\n\\n\r\nInteresting, entertaining and you don't watch eveyr spisode praying for it's ending. As I aid, it's not a bad anime, but it won't be remembered; it could have benn better, a lot, and the art department almost runied the whole thing.\\n\\n\r\nOverall:\\n\\n\r\n7/10\\n\\n\r\nNo silly ecchi and no bad fan service give it an extra point, young people with superpowers without an harem is also good, but as a whole Hamatora keeps missing something to make it great. It would pass an exam, but won't go to the hall of fame.",
            "date": "2015-12-20T05:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 206102,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4881879.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Vehemor",
                "username": "Vehemor"
            },
            "url": "https://myanimelist.net/reviews.php?id=206102"
        },
        {
            "content": "Hamatora aka the show with one thousand different opinions about it.\r\nThe critcism has largely been about the direction the show took from an overall promising premise.  Hamatora is similar to the Yorozuya from Gintama, or a group of friends doing odd jobs.  That's about where the similarities end.  Hamatora is episodic at first, then kicks into high gear for the main arc.\r\nThe first few episodes i really enjoyed, i loved the different jobs, mysteries, adventures the different groups experienced.  That's the kind of ride i like to be on.  It also does cheesy pretty well, and i'm a big suckerfor cheesy.  And also badass OP characters that beat ass and take names.\\n\\n\r\nThe main story might not float everyone's boat, while i thought it was Psycho-pass-esque in its plot, the delivery left something to be desired.  It's not that its bad, its more that its a bit different.  I did find it ultimately refreshing, but i'm not a fan of prolonged suspense, yet you couldn't even call it suspense.  \\n\\n\r\nAnd that would be the major flaw IMO; the pacing was great, the art was lacking in a few places, the sound was all good, the characters were solid and most importantly fun to watch but....\\n\\n\r\nthe setting; or rather the environment, the feeling it gives off during the show just doesn't really fit.  It's jarring, it's hard to explain, you just have to watch it and find out if you dig it.\\n\\n\r\nOverall, i think it was a good ride, I would have liked to double the episodes to flesh out the characters and let the story simmer, but for 12 eps i think it did a pretty damn good job.",
            "date": "2014-08-04T02:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 155177,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/149637.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Marthgun",
                "username": "Marthgun"
            },
            "url": "https://myanimelist.net/reviews.php?id=155177"
        },
        {
            "content": "Hamatora was an anime I wasn't interested in at first. The plot was not very original, and there seemed to be too many characters. But after watching it for a while, it became better. \r\nThe art is unique and actual effort seems to be put in it (compared to other animes). The colors are flashy and eye-catching, which is something you don't see too often. The art, to me, is one of my favorite parts of the anime. \r\nHowever, the story was a bit lacking, and like I said, not very original. The whole 'people with superpowers' thing is common and easy. But the plotmakes a huge turn and distances itself from other superhero animes, which I liked, but it wasn't enough. \\n\\n\r\nI think some characters are useless and a pain to have. For example, Hajime and Koneko don't really take action at all. Now, Hajime actually does pull her own weight, but only around the end. I get that there's a bit of symbolism, but that's all I really see. I'm hoping they'll all have a part in the second season, but so far, it doesn't appear so. At least, not for Koneko. \\n\\n\r\nOverall, I enjoyed quite a lot, despite all the little tweaks it needed here and there. I like that one of my favorite characters, Art, turned into a mysterious villain at the end. It was quite an unexpected twist. For me, at least. I can't wait to see what this anime has in store. I highly recommend it for everyone :).",
            "date": "2014-07-28T14:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 154105,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/dusty1190",
                "username": "dusty1190"
            },
            "url": "https://myanimelist.net/reviews.php?id=154105"
        },
        {
            "content": "Hamatora is another one of the many crime fighting/detective type anime out there. Its story centers around the PI duo of the Hamatora group, Nice and Murasaki, and the various cases and investigations that they get involved in. The aspect that is supposed to make this series unique is the existence of beings called \"Minimum Holders,\" humans with special powers. Think along the same line as NEXT's from Tiger & Bunny. The thing with Minimum Holders is that they have to engage in certain actions in order to activate their powers. \r\nStory: The actual plot of Hamatora is relatively decent. It centers around the ideathat \"weak\" people envy \"strong\" people, and what will happen if we empower those \"weak\" people so that nobody is \"weak\" or \"strong\" anymore and everything is on equal footing. The issue, however, is that you have to get through a lot of filler and side-quests in order to get to the actual meat and potatoes of the series. When the show is actually focussing on the plot, it's really good. Now, that's not to say that the side stories aren't worthwhile, because some of them serve as a device to try and fill out character's back stories, but for the most part, it is kind of superfluous to the main storyline, and some of the filler really, really interferes with the flow and suspense halfway through the series. \\n\\n\r\nArt: For a series with a low budget, for the most part, the art was nice and consistent. I did enjoy the art style and the use of colors. Color and texture are definitely used to reflect the mood in this series. There were definitely also scenes here and there where the art wasn't quite up to par, but for the most part, I enjoyed it. \\n\\n\r\nSound: I enjoyed the opening and ending songs. And then there is a song that plays every time Nice activates his Minimum that I also enjoy quite a lot. It starts to play, and you know that some sort of action is about to go down, and has quite a lot of impact. Other than that, while there were one or two more songs from the soundtrack that kind of stuck out to me, overall I would still say that aside from the parts I already mentioned, there wasn't much that stuck out. \\n\\n\r\nCharacter: There wasn't a lot of evolution of character or anything like that in this series. Many of the characters don't even have decent back story. It's a difficult situation, as well, in that the two characters I found to be most engaging weren't even technically considered to be \"main characters.\" One would be the head Inspector of the police force, Art, and the other would be the main villain, Moral.  Both of these characters, in their own way, were very, very interesting. I won't go into why because I don't want to accidentally spoil anything, but honestly, without these characters present, this series wouldn't even be worth my time.\\n\\n\r\nEnjoyment: I only rated my enjoyment of this series an 8 because, like I've stated previously, when the story is focussed on the actual plot, it's really good. There are a handful of parts where I was kind of bored (though really I would say that I just wanted them to return to the plot), but for the most part I really enjoyed it. \\n\\n\r\nOverall, I had to give Hamatora a 7 because, even though I really did enjoy the show (a couple of the characters in particular), there are some issues with filler and momentum that really count against it. There's also the lack of filling out information about many of the main characters that makes it hard to bond with any of them, thus making it harder to connect to what's going on and what's happening to them. \\n\\n\r\nI would still recommend watching this anime, because it is an enjoyable view, and I will probably re-watch it myself at some point in the future. If you're reading this review after watching Hamatora and you enjoyed it, then I would also recommend Tiger & Bunny, Psycho-Pass, and Get Backers to you. Hope you enjoy~",
            "date": "2014-05-27T05:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 144701,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2544473.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MidnighBlueBlack",
                "username": "MidnighBlueBlack"
            },
            "url": "https://myanimelist.net/reviews.php?id=144701"
        },
        {
            "content": "Decided I'd write my first review! Bear with me since it's been months since I've seen it, but everything is still pretty fresh in my memory. The reason I've chosen to write about this specific anime is because, so far, it's one of the few anime that I felt greatly disappointed by.\r\nI got interested in the anime from watching the intro to the second season on YouTube. It looked hype as hell, and after reading the synopsis multiple times on different platforms, I thought I'd give it a shot. Suffice to say that while I don't think that this is a horrible anime by anymeans, you're just better off watching practically anything else in the genres that this is listed as. \\n\\n\r\nLet's get started shall we?\\n\\n\r\nArt:\\n\r\nThis was probably the best part of the series. The vivid and vibrant colors used in the animation throughout the course of the show were AWESOME. The character designs of practically everyone in the cast are unique and intriguing, and make you want to become more invested in them. The battle sequences and the choreography are all fantastic and the color inversions that you see at various parts throughout different episodes provide a cool little addition that you don't see often in other shows. Almost nothing wrong with the art style.\\n\\n\r\nStory:\\n\r\nNow we get into the negative aspects of the show. Hamatora seems generic enough, people who have powers hide it from society. Not like we've seen that anywhere in any show. However, this show takes a little twist on the whole idea of people born with superpowers also known as \"Minimums\". In this show, the titular \"Hamatora\" is the name of a detective duo known as Murasaki and Nice. Throughout the entire series, the detectives of Hamatora and other members that work out of a cafe work various jobs throughout the city. A good chunk of them are pretty trivial, but the overarching and foreboding theme seems to be a serial killer murdering Minimum Holders and giving their powers to other people.\\n\\n\r\nSeems like a cool premise right? That's what I thought. The first two or so episodes were pretty compelling and got me interested in the series straight away. I mean, not gonna lie, the show did seem eerily similar to the acclaimed \"Heroes\" franchise with the villain, ironically named Moral, killing Minimum Holders by lopping off the top of their heads and stealing their brains. Nonetheless, the suspense in the first few episodes had me hooked and I eagerly continued watching.\\n\\n\r\nColor me surprised when I find a bunch of pointless filler episodes littered throughout the series. Specifically episodes five and eight. Episode eight wasn't only your standard and cliche beach episode that you find in shounens, but the obsession with bitter melon in the episode was extremely bizarre. Nothing really happens aside from some minor competition between Murasaki and Nice. Oh and there's a gang too. \\n\\n\r\nEpisode five. Oh LORDY episode five. You know that one episode of \"The Office\" where Michael promises a bunch of kids that he will pay for their college if they pass high school, only to reveal he doesn't have the money? Take the level of cringe from that episode and combine it with the cringe from the BDSM jokes in Kill la Kill and you have something not even remotely close to the cringe in this episode. The episode starts harmlessly enough, but morphs into an outrageous onsen plotline, if you can even call it that. Sitting through two or three straight minutes of a half-naked guy doing sit-ups while grunting and releasing a pheromone through his sweat was so uncomfortable that I can't even describe it. Episodes like this made me straight up quit the series. It's not that the idea of the show was even bad either. This show had so much promise in the premise and the storyline, both of which got muddied by poor writing and unnecessary filler. Serious and tense moments got sullied by nonsensical side-plots, which is a shame because, again, the plot wasn't bad alone.\\n\\n\r\nTaking this into consideration, Hamatora, along with it's sequel series, really doesn't know what it wants to be. Is it a fantasy? Is it a sci-fi? Is it a thriller? A comedy? A mystery? There are so many different aspects of anime that are just thrown in without any real cohesion. I was so confused throughout the whole season because it couldn't find a niche. You could argue that it was trying to be a niche-breaking anime, but it does a poor job at doing so.  \\n\\n\r\nSound:\\n\r\nI don't have too much to say about this. The sound really wasn't that bad, it just wasn't anything special. The sound behind the action sequences got your blood pumping, but that was about it. Find any typical shounen anime, and you'll probably find a soundtrack either similar or better to this one.\\n\\n\r\nCharacter:\\n\r\nThis part really stung. As I previously mentioned, I loved almost all of the character designs in the show. Each one was unique and you could pick them out almost instantly. Plus with names like Nice, Birthday, Three and Ratio, they aren't too hard to remember. \\n\\n\r\nWhat sucks is that there is almost zero character development and almost zero backstory aside from Nice attending an academy for Minimum Holders, Honey and Three having a sweet and emotional past and the relationship between Ratio and Birthday. But that's about it. You get close to no insight onto any of the characters until the next season, but that's besides the point. I was so disappointed by Hajime that you don't even know. I was under the impression she was going to be this secret bad-ass that could deck villains across a city block. But nope. Aside from episode five (gag me), she doesn't reveal anything about who she is. The only thing you get to know is that she squanders Nice's money on hamburgers like a leech. \\n\\n\r\nKoneko and Master are the same way. Neither of them are even remotely compelling or relateable due to them having a near-absent presence in the show. Moral's drive is also pretty generic too. I mean, it's very clear that he's a villain, and does a good job at it, but there's nothing creative beyond his design. His motives are pretty cookie-cutter to put it lightly.\\n\\n\r\nThe only character that I found remotely compelling was Art, who strives to live and bring down tyranny through the memory of his deceased brother. There are also two great plot twists involving him in the last few episodes, but I won't go into that as to not spoil anything.\\n\\n\r\nOverall, I wouldn't say that Hamatora is \"bad\", just overwhelmingly disappointing. I'd like to refer to Hamatora as a \"background-music anime\", as in you'd be better off watching this show while you're doing something else like chores. Just have it on in the background. You don't have to get invested in the show at all, and if you miss a detail, it usually isn't too hard to pick up on it later. \\n\\n\r\nWant a superhero anime? Watch My Hero Academia or One-Punch Man.\\n\\n\r\nWant a suspenseful detective plotline? Watch Psycho-Pass.\\n\\n\r\nWant to watch an anime based on a video game with vivid colors, clean animation and blood? Danganronpa's the anime for you.\\n\\n\r\nAgain, it's not a \"horrible\" show, and I'd recommend it to anyone who wants a fresh spin on a fantasy-detective series, but there are just so many other better shows that you could watch that it almost doesn't seem worth your time.",
            "date": "2018-10-01T15:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 290641,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7209707.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DoubleJEspejwan6",
                "username": "DoubleJEspejwan6"
            },
            "url": "https://myanimelist.net/reviews.php?id=290641"
        },
        {
            "content": "Hamatora appeared to have a major issue in what exactly it was trying to be in its focus on superpowered humans called Minimum Holders. Focused on a pair of Minimum Holder detectives consisting of Nice and Murasaki, the two are involved in a number of mysteries involving ordinary humans who are somehow able to gain Minimum powers and a string of Minimum Holder murders are seemingly connected to these events.\r\nAs mentioned, Hamatora has some major issues in exactly what sort of anime it wanted to be. It starts off as a mystery-comedy with Nice, Murasaki, and other Minimum Holders going through with their everyday routinesand getting into their fair share of comical shenanigans. The series was trying to pass itself off as cool and full of attitude with the antics and actions of its characters, and occasionally poking fun of elements to anime and otaku fandom in general. However, character depth is heavily lacking in the series as the majority of characters are reduced to one-dimensional archetypes and in spite of being the show's lead, Nice can usually not be the most easiest character to connect with thanks to his brash, self-righteous persona and being seemingly perfect in all his actions. Due to this, it makes connecting with most characters rather difficult throughout Hamatora's run.\\n\\n\r\nBy the anime's second half, it tries to become something comparable to Marvel Comics' X-Men by exploring how those with differences from others in regular society face prejudice and the outcasts wanting to be just like everyone else. However while X-Men explored this with a clear purpose and having its morally ambiguous story elements, Hamatora's approach is a bit sloppy in execution as it resorts to shallow storytelling cliches in exploring how humans and Minimum Holders react to one another at this point. Plus for Hamatora's version of Magneto, Moral is your typical anime crazed psychopath dabbling in megalomania and thinking how brilliant he believes his plans are to stir chaos up between humans and Minimum Holders. The anime tries to throw a twist for its ending to tease its second season, but this comes off feeling abrupt with how it plays out.\\n\\n\r\nVisually, Hamatora's a mixed bag. It sports some slick-looking character with detailed clothing designs and sporting bright colors to stick out. Also, the fight sequences between Minimum Holders had their moments of looking pleasing to see unfold thanks to careful editing and nice fluidity in spite of not sporting a high-quality budget that TV titles like Fate/Stay Night: Unlimited Blade Works or Parasyte had on hand in 2014. However, a major annoying quirk with the anime is that it gets in the habit of applying a filter of psychedelic colors to the visuals whenever Minimum Holders make use of their powers. While this seemed to be an attempt by the animators to show the abnormal nature of Minimum Holder powers, this effect often took me out of the action since the effect became the primary focus of the scene instead of any animated action that was supposed to play out in specific scenes.\\n\\n\r\nOverall, Hamatora was quite a bit messy in the execution of its themes and storytelling as it suffered from a shallow and usually unlikable cast, some questionable style choices with artwork, and not seeming to have a clue in what kind of series it wanted to be with its hodge-podge elements of mystery, comedy, action, and drama. Based on my underwhelming reception to it, I would be in no rush to check out its sequel, Re: Hamatora.",
            "date": "2018-04-29T21:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 279367,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=279367"
        },
        {
            "content": "Honestly the introduction (the 1st episode) was pretty bad. The character's all had dull personalities, The protagonist of the series was OP while having a chill personality which is too overused, his only problem was that he did not have enough money. Story for the first episode was too simple also you could guess what was gonna happen within just the first half of the episode and they added the sex scene just to get the guy audience to pay more attention. The art was better then normal. Overall it was a pretty simple anime with none of it's own speciality. (Remember this was MYOWN opinion, so do not get triggered. This is what I think and i'm not telling you to think the same way.)",
            "date": "2017-11-04T18:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 262543,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6684996.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Sdoob",
                "username": "Sdoob"
            },
            "url": "https://myanimelist.net/reviews.php?id=262543"
        }
    ],
    [
        {
            "content": "Tadgh: One of my recent favorites. My favorite \"new anime\" art style, bright colors and clean movement. I liked all the characters, particularly because they aren't overly cliched. The story was cool and really came together from all sides. A quick, fun watch that keeps you entertained.\r\nDr. R Dash: I really!! enjoyed watching this anime it was very exciting and beautiful, the mystery part was always a thing that threw me off, and sadly i have a lot of unanswered questions BUT!!! this will fuel me to watch the next season and i really cant wait!!!- in short I have no complaints! WATCH THIS!!\r\nRasanaph- WTW!!!,cant wait to watch the next season.\\n\\n\r\nLaohoam- this was a great anime for me.  The art work was great the overall story was great, the only problems I had with it was that the random information they threw out (even though they tied it all together) could be a little overwhelming to keep up with, and the characters were not developed enough to become attached to them.  All in all it really enjoyed it and the twist at the end was amazing definently cant wait for next season.",
            "date": "2016-01-10T17:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 208245,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Groupanimenight",
                "username": "Groupanimenight"
            },
            "url": "https://myanimelist.net/reviews.php?id=208245"
        },
        {
            "content": "Hamatora The Animation is an odd product of a mixed-media project. And as such it brings out in the viewer a complex mix of emotions with its uncommon approach and attitude, and of course, its obvious problems.\r\nThe story is about a group of people with supernatural abilities, that take on different random jobs for money and often help the police in solving rare cases. The  show starts off with a strong shounen vibe with hints of a lighthearted slice of life comedy. However very quickly after that other genres get stirred in. In contrast to the colorful animation and the cheerful first episodes thereis a darker and more serious theme going on in the background and as the show progresses this theme comes into focus. \\n\\n\r\nEvery episode delivers at least one strong message, aiming to ignite a spark in the viewer's thoughts and lead to a philosophical inner monologue or even dialogue with someone else. The main issues that are discussed in the show include discrimination and equality between different people. And while the worth of an individual in the anime is measured by his super power or the lack of it, the same examples can be found happening in real life and to people with very real problems. The show also deals with loss and people's motivation to continue living after that.\\n\\n\r\nAs a production Hamatora The Animation can be praised for its animation and art. Gradient colors and textured overlays are very pleasant and complete the somewhat simple art. The animation is fluent and the fighting scenes have exciting choreography. In some scenes the use of multiple cinematic techniques in succession is really expressive and creates a unique atmosphere for the viewer, and in others the stylized elements are highly impactful, getting the existential thoughts across. \\n\\n\r\nThe soundtrack and the voice acting are in no way exceptional, but are also very well produced and perfectly fit the themes and the mood in every scene.\\n\\n\r\nBut while the technical execution of the show scores definitely above average and deserves a good amount of praise, the story and the characters is where all the criticism goes - there seems to be nothing original about both. And this doesn't stop there - there are some scene designs that look almost exactly like scenes from other shows. Some events remind of other series to a point where it feels like it is not Hamatora that you are watching, but another anime. And not that it is a cliche, it is just too similar. The whole series can be described as a high quality 'fan'-made all star mashup, where all famous anime characters live in this universe called Hamatora, but due to copyright restrictions they have to look differently than in their original series.\\n\\n\r\nAt first, this lack of originality is temporarily dulled by the excitement of the well made mix of comedy, shounen, slice of life, action, supernatural, mystery and even hints of romance in the first few episodes. But as the series progresses more genres get thrown in, the moods starts to change suddenly and there are random bursts of comedy, then drama, then graphic violence, then comedy again or some other nonsense. The pacing suffers from the same issue - instead of expanding one style of storytelling, it switches back and forth between fast and slow, with random flashbacks and convoluted moments.\\n\\n\r\n'Only one side can get their wish' is said by one of the character and maybe that should have been the strategy when creating Hamatora The Animation. However it seems the studio tried to please as many viewers as possible and turned the show into a good looking and sounding, but unbalanced and unoriginal, mixture of everything. Ultimately Hamatora doesn't know what it wants to be. And maybe this lack of identity is the show's actual identity, because even with all these issues, it still manages to be enjoyable and enrich the viewers' lifes.",
            "date": "2014-09-25T09:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 162089,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/487359.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/FoxSpiritShrine",
                "username": "FoxSpiritShrine"
            },
            "url": "https://myanimelist.net/reviews.php?id=162089"
        },
        {
            "content": "Despite the standard grade, this isn't really one of those 'meh' series that you rate indifferently. It's quite particular, with a set of pros and cons tearing at it in opposite directions that wind up making for a middling grade. Read on if you're interested in hearing what these strengths and weaknesses are so that you can figure for yourself if it'll be worth your time. The most potent thing about this show is its artwork: it uses very outspoken blends of colours with a particularly neat use of shading, and most of the action sequences feature an amazing, psychedelic change in the palette. Innovativestuff as far as I'm concerned, and it made any of the content very pleasing to watch on a visual level at the very least. Other things alongside this are the great soundtrack (OP and ED are only average though IMO) and a carefully-nurtured general atmosphere that prevails over the wild tonal shifts of the plot: it's a carefree, rebellious vibe that fits right in around the beggar-heroes of 'Café Nowhere' and makes each episode work within itself, even compensating a bit for the lack of linear storyline progression. It's undeniably stylish and though it has obviously been influenced by lots of other shows, it has plenty of its own flavour.\\n\\n\r\nGiven that this is the first season only, most of the episodes focus on attempting to provide a background and some development for each of the major characters (there are quite a few). Your interest will be piqued by the case that will emerge for them to resolve, you may giggle a bit at some of the humour, the action will likely be fairly average by the standards of action-oriented anime, the adversity in each episode will be overcome in traditional manner, and then we'll be back with everyone at the Nowhere, before rounding off with a sinister glimpse of the villain's machinations in the mean-time (these short scenes are the main recurring factor that advances the over-arching plot in each episode). The individual episodes are not hugely engaging or intense, but they're entertaining enough to maintain interest, while the thing that really makes Hamatora particular is the way it trades tones like a politician trades policy: one second the show will not be taking itself seriously at all, whereas the next we'll be getting dark and violent twists, combined with grandiose monologues and such. Make of this what you will, I found that while it prevented boredom, it made things a tad incoherent and wasn't great at drawing you into the mood sought after (example: When an unexpected, serious twist comes out of nowhere, and then the next episode is a goofy beach episode).\\n\\n\r\nFinally we get the characters: these are the main meh point for me. I mean, it's pretty clear that the female characters were kind of thrown in cynically in order to placate the show's male fans: they settle for clichés that some might find cute but  didn't really have an effect on me, and are basically left undeveloped for the whole runtime. As for the male characters, they're quite skilfully explored in their episodes, but the simple fact is that the creators tried to decentralize their focus too much and develop all of them in equal amounts one or two at a time, which made the development seem a bit artificial. Not only did the fleshing-out of each of them decrease the flow of the plot as I mentioned, but it makes it harder to bond with Nice or to endear him to us. The villain intrigued me at first, seeming a bit like a sillier and more eccentric Makishima (Psycho Pass), but he really gets a bit tiresome after a while, endlessly repeating the same monologue with his hands stretched towards the heavens. The finale was unfortunately pretty underwhelming, particularly given the cynical cliffhanger trick employed by the writers as a run-up to the sequel.\\n\\n\r\nOverall, it's well-worth trying the first episode out, which in my view can give you a pretty good idea of what you're getting. It draws inspiration from a lot of sources and so may seem unoriginal to some. However it's also good fun, and if you like the visuals, vibe and premise, you might find both this season and its sequel fairly rewarding.\\n\\n\r\n5.5/10",
            "date": "2015-03-26T05:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 183444,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3829377.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Renegatz",
                "username": "Renegatz"
            },
            "url": "https://myanimelist.net/reviews.php?id=183444"
        },
        {
            "content": "This anime had a pretty rough start being very cliche in mystery story writing, for example, the \"it was all because student likes teacher\" or \"be careful of where you might end up on the Internet\". Cliche stories can be off-putting but adding to that, they made it seem as if the mysteries had an established pattern of why they happened and the incentives of the perpetrator. Like I literally thought it was going to be a crappy episodic detective flick with too many loose ends.  I was bored but NOW I can't rave how much, if you suffer through this, how brilliant theescalation to the climax will be.  Yes, escalation to climax, and if you are like me, you will have an erotic reaction to how the homolust, i.e. the pinings of the villain Moral for the hero Nice, is basically what it all came down to.\\n\\n\\n\r\nActually I didn't really think it was that cute(it was actually pretty serious), but the reason for why Moral was so obsessed over Nice was \"painted\" very well.  All the cases in the first few episodes actually had a theme, \"opportunities\".  Moral wanted to be there to be the \"opportunity\" to corrupt innocents with guns, porn, whatever.\\n\\n\r\nNOW FOR THE SPOILERS only in this paragraph\\n\r\nIt was a cancer give-a-thon. If you do this THEY'LL OBVIOUSLY LEARN. But Nice wasn't up for the cancer give-a-thon.  He knows that even if you obtain \"power\", you are still ONLY self responsible.  It means that no matter what happens, for better or for worse it's about every individual that is self-responsible.  We can all be unique, and we'll never be lonely :D DUDE NICE, THAT'S BEAUTIFUL.  No wonder Moral likes you. But unfortunately, Moral's actions themselves are demented and Nice has no choice but to...\\n\\n\r\nWell that was great.  It's story is literally what happens when you have two boys who can only settle differences in a fight.  So it's story is right on, 9/10\\n\\n\r\nArt - 9/10 wow those pixiv textures man.  Lots of eye popping stuff and popular art\\n\\n\r\nSound - 10/10 I loved the opening\\n\\n\r\nCharacter - 9/10 because this stuff is kind of an acquired taste.  Some of the side characters will hit you, some of them won't.  I personally liked all of them\\n\\n\r\nEnjoyment - 6/10, the beginning made me not want to watch it sadly, but it gets better so actually i dunno if it's possible to make a 100% enjoyable show.\\n\\n\r\nOverall - 9\\n\\n",
            "date": "2014-07-17T20:30:00+00:00",
            "helpful_count": 0,
            "mal_id": 152537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/208348.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Hakuyou",
                "username": "Hakuyou"
            },
            "url": "https://myanimelist.net/reviews.php?id=152537"
        }
    ]
]