[
    [
        {
            "content": "It has been a remarkable ride following this series for so long and looking back at how The World God Only Knows has impacted the anime community, it’s not far off to say that it changed harem anime as we know it. It shows that you don’t need to show girls in suggestive situations all the time to provoke entertainment or emotion into your harem. Sometimes all you really need is genuine emotion and intelligent comedic writing to create a meaningful love story. Or in this case multiple love stories.\r\nNow the story has focused on the Goddess Arc of the manga, which a lot ofpeople have criticized this aspect because it skipped a large portion of the manga to get to this point. Which brings up the point that should always be said when judging a show based on source material: Always judge a show based on its own merits rather than how well it follows the source material. What’s more important is how it keeps telling the story in a concise and detailed matter that is true to the spirit of the manga rather than how specific scenes followed the manga well. In Megami-hen’s case, the pacing and how they develop the story, while not necessarily perfect in some areas, compliment each other exceptionally well in terms of emotion and clarity. While it does jump around in certain areas a little too fast, especially in the later episodes, it doesn’t deter the show from having an emotional impact whenever it is on-screen.\\n\\n\r\nAs always with each passing season, the art and animation are spectacular to look at. Tamaki Wakaki has a creative eye when he draws his manga and to have his drawings come to life in animation is both a perfect representation of them and an adorable treat to watch with great easy-on-the-eye animation. The characters look lovely with the colorful backgrounds that compliment each other with high excellence and creativity in a limited scope of the Moe and Slice of Life genre.\\n\\n\r\nOne thing that I’ve always admired The World God Only Knows, both the manga and anime versions, is how it can pack in so much depth and development into every character that you come across in just a short amount of time. In this season, the characters are now fully developed after two seasons, and after all this time, not a single inch of charm is lost in each one of them. Keima is still the cynical but often hilarious protagonist that we’ve all grown to love but also kind of hate at the same time. His sense of courage and intelligence make for an enticing protagonist and a larger than life character in general. It is now at this point in the story where we finally see a bit of humanity in his role. It is portrayed with immaculate maturity and pure excellence that makes Keima a three-dimensional character rather than this one-sided gamer otaku that he is often depicted most of the time.\\n\\n\r\nThe girls, once again, are as cute and charming as ever. Now that Elsie has replaced Kanon for Keima to find the other Goddesses in the girls he’s conquered, Haqua is now Keima’s buddy, and man do these two make for such a hilarious duo of detective and partner. The only slight problem I do have with this is that they don’t really go far enough in showing us Haqua and Keima’s relationship develop further as they go through these conquests. Despite this, they do a great job of adding a lot of chemistry between our two main leads regardless of the amount of screen-time they get.\\n\\n\r\nAs for the rest of the cast, not all of the girls return from previous seasons. Only a select few can have the honor of getting the most out of the story. For what it is, the girls and the comedy that they bring on the table can still be quite enjoyable to anyone who appreciates great parody in their spare time. One, in particular, is Shiori, who is trying to write a story of her own that she got inspired by her conquest by Keima. What results is them bickering by writing to each other with them together that create a funny parody of how people tend to criticize how people typically write a story in context with the show.\\n\\n\r\nNow we turn to the girl who has the most significant presence in the season: Chihiro. Her personal development with Keima couldn’t be any more heartwarming than any anime character relationship story in recent years. Heartbreaking and sentimental as it might be, there is still this aura within Keima that completely changes him and morphs him into a new kind of way that we’ve never seen him as before. It is times like this that make The World God Only Knows a very excellent harem show. It treats the subject matter in a parodied manner but at the same time it is able to emote these heartwarming scenes that not only work in a writing standpoint but also in a pacing one.\\n\\n\r\nMusic in The World God Only Knows have always tread in the territory of J-Pop, what with Kanon’s songs in Season one and other character songs in the past. The songs in Season 3 are just as good as previous seasons even though they don’t necessarily step on any new ground in terms of instrumentation. The opening to this is oddly enough sung in English by Saori Hayami, who does it very well! Her pronunciation of the English language is spot on without many awkward attempts at sounding both Japanese and English or Engrish as it is often called in slang term. Unfortunately, I felt the ED was mostly forgettable after repeated listening. All singers do their jobs well, but other than the voices I found myself often skipping them most of the time.\\n\\n\r\nAs for voice acting, which is often the bright spot in the series, the seiyuus all do a fantastic job in their roles. Hiro Shimono is as charismatic as ever as Keima, the always beautiful Saori Hayami does a tremendous performance as Haqua, and a surprise performance by Kana Asumi as Chihiro who wholly owns her role through the latter half of the show. Though it could’ve shown more of Kanae Itou as Elsie; When you have her on a show, you want more of her sexy voice on-screen.\\n\\n\r\nThere will no doubt be a lot of debate with this season in particular. Whether you agree that watching the show and criticizing it for not following certain things correctly in the source material is a valid reason of not liking it or not, you have to set aside that in the back door and appreciate the show on its own merits. This is what all the seasons were building upon and the result was most definitely worth the wait. There are moments in the anime that will make you remember certain moments for years to come whether it was something that made you laugh with exquisite delight or cry with overall genuine emotion. For me, this one line in the show is the one that will stick with me for years after watching it: “You don’t need a reason to fall in love.” Words of wisdom by Chihiro.\\n\\n\r\nGrade: A\\n",
            "date": "2013-09-30T16:49:00+00:00",
            "helpful_count": 260,
            "mal_id": 114917,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=114917"
        },
        {
            "content": "In most harem series, we generally have the guy who seems to be oblivious to certain factors. These usually include girls who are desperate to get the guy's attention with intense rivalries, jealousy, and sometimes even includes violence. But what if that role was sort of reversed? What if the guy in a series is actually seeking the girls themselves? What if it becomes a certain type of game where the guy is the player and the girls play the roles of the conquests? Well, if there's one thing that's for sure...The World God Only Knows is one of those series where it takes theharem trope to a whole new level of experience.\\n\\n\r\nThe World God Knows III is adapted from the manga of the same name written by Wakaki Tamiki. The series continues as the third installment of the franchise but has some noticeably changes. Perhaps the most important of these changes is the fact that the anime decides to skip material from the manga. As this series covers the GODDESS ARC, some conquests left from the manga are left in unexplored territory. Therefore, if you want to get more insight on what you're missing out, give the manga a try from chapters chapters 42-55 and 66-113. (this assumes you have watched the Tenri OVA) At any rate, the series decides to go with the Goddess route and oh boy, this sure brings a new twist to Keima's life.\\n\\n\r\nBecause the series skips material, it is important to absorb most of it in the very first episode. At any rate, this series adapts the Goddess Arc and the Goddesses are the main task that Keima must deal with. The Goddesses themselves seems to be sealed into the girls that Keima conquered previously. The minor problem is that some of these girls' routes (when they were conquered before) are omitted from this adaptation. Therefore, expect some flashbacks and brief scenes that might not make sense if you're coming fresh into this series as an anime only viewer. \\n\\n\r\nThe story stretches out in a quick fashion as even in the beginning with the conflict immediately comes to fruition with the introduction of an new enemy. Part of what makes this Goddess Arc exciting is because Keima is put on the stress of reconquering some of the girls' hearts but at the same time also with a friend's life in danger. It obviously puts Keima in the driver seat of a stressful player. This is evidenced through the seriousness that he takes the situation at hand as his obsessive habit of playing games and dealing with 2D girls is significantly reduced. Furthermore, Keima feels guilty at himself for getting others involved and seems to a bear a sort of responsibility of some of the events in this series. Indeed, the Goddess Arc takes this series to a whole new level with new surprising challenges. There's a blend now between fiction and reality. Previously, Keima only wanted to conquer girls in order to get it over with and return to normal life. Now, he is fighting for someone else other than himself. Now that my friends  deserves some respect. \\n\\n\r\nMost of the main and supporting characters makes their appearances in this arc. Some gets more screen time than others while the supporting characters get their spotlights in a set up of 'conquer of the week' format. Keima's mind at the same time is put to significantly use because what's at stake. It still revolves around conquering girls though but this time for the sake of drawing goddesses out of them. It's a hunt where Keima has to play the role of a player. Furthermore, it's racing the clock to save a friend. By the typical TWOGK concept as previously seen, Keima often relies on strategies he gets from his experience off of the games he plays. This involves triggering flags, making the perfect date plans, or formulating strategies to respond accordingly to situations. Luckily, the boy also gets a little help as well.\\n\\n\r\nSimply put though, we have two girls or rather supernatural beings who serves as guides to Keima. If you guessed Elsie and Haqua, then you're right. In particular though, Haqua's relationship with Keima is one of the more interesting factors to examine. It seems that her character has become more and more prone to jealousy especially in situations where it involves dealing with the Goddesses. Perhaps the girl now has feelings of her own based on some interesting reactions to his mission. In particular one moment, she blunts out that Keima is needed by her. It does gets more frustrating at some points though especially since Keima is so focused on his task that he fails to notice these certain triggers from Haqua. At the same time, Keima wants to make triggers of his own through whatever means. These usually have various results but viewers can be satisfied that Keima is more of the level headed protagonists of this harem series. \\n\\n\r\nAs a harem series goes, the show still maintains its themes well. The girls are diverse ranging from a shy library girl, to an idol, a tomboy, an ice queen, or the rich type. It offers a multitude of conquests in a variety so viewers gets a new experience of that TWOGK feel again. The addition is the introduction of the Goddesses (also known as the Jupiter Sisters) Based on the names of the Roman mythology, they are some of the key players of this series. It's also important to note that each of them resides in a different girl and all of them has a different ability. Their personalities seems to also reflect on their hosts as well which makes it much more comfortable for viewers to get to know them better, especially for those who have read the manga. Whatever the case, the Goddess Arc takes a full swing at this new concept and makes it that much more exciting once again. (well maybe not so much fun for Keima)\\n\\n\r\nFor the adaptation, there are certain elements left out. I won't compare this to the manga but some scenes should have been there for a more pleasurable experience. As being a harem show, it doesn't avoid fan service either that either results in misunderstandings and some skin being shown. Luckily though, Keima is the main male protagonist and not the type that prone out like a typical dull kid  from a harem series. When misunderstanding happens, he tries to take advantage of it and makes it into a strategy. In fact, Keima still is confident and calculating which makes him independent and even admirable. \\n\\n\r\nThere's also certain elements of this series that makes it stand out with the new twists such as the new enemy. However at the same time, we see comedy packaged with hilarious dialogues, misunderstandings, and awkward moments. These usually involves Keima in a situation where he is uncomfortable with or something that he didn't anticipate as part of his plan. At other times, there's the comedy that seems to be a bit forced and repetitive. Another factor that might of prevent a better success for this series is the way the tension of the romance aspect seems to feel somewhat weaker. This could be the result of the rushed sequences of a series that is condensed into only a mere 13 episodes. But what's more than that though could be a lack of new transition as in new girls/targets. Rather than introducing any new girls for conquest, some of the conquests feels like deja vu in a way that might once again seem a bit repetitive. Additionally, some of Keima's choices might seem controversial for viewers especially for those has their favorite girls already made up in their minds.\\n\\n\r\nVisual wise, the series makes both good usage of coloring and style. Manglobe again is involved with the production so expect a similar if not the same format of the designs. The characters themselves are designed to look different and reflect on their personalities. For instance, Yui is designed to look like a tomboy while Kanon has that style of an idol. Keima of course stands out as the main protagonist as a “God in one world, otaku in another”. \\n\\n\r\nThe OP song \"God only knows -Secrets of the Goddess-\" by Oratorio The World God Only Knows reflects on the nature of the arc with the Goddess being the highlights. There are also montages of some of girls are shown along with possible foreshadowing. The voice actors and actresses does a great job in their roles. Keima's calculating voice is reflected in his style while most of the supporting characters fits in their own. Some of the voices of the girls also matures their personalities well. In contrast though, the OST seems bit mediocre and barely noticeable. \\n\\n\r\nFor a harem series, this sure takes its themes to a different style. Season 3 of TWGOK deals with the Goddess Arc so expect new surprises and a little more emotions here and there. At the same time, there's the fun and nostalgia bought back from the previous series. Just be aware that this series skips some of the manga material involving certain routes. After all, it adapts the Goddess Arc. Therefore, it's best to re-read some of the chapters that were never adapted. (maybe will be in the future in OVAs?). I hope you enjoy this series though just like the previous ones if you're still a fan of TWGOK. It's time to conquer the 3D world once again!",
            "date": "2013-09-23T12:45:00+00:00",
            "helpful_count": 110,
            "mal_id": 113943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=113943"
        },
        {
            "content": "When was the last time you saw a sequel to an anime and thought to yourself, \"this was say better than the previous seasons.\" Rarely. Am I correct? Well with the third instalment of to Kami nomi zo Shiru Sekai franchise, I can promise you that this instalment surpasses the previous two.\r\nThe story of this season continues in a similar fashion to the other two, however in this season Keima has to reconquer his former heroines from the past. Unlike the other two seasons, by the end of this anime we get to see hints that Keima will develop a lot as a character, butstill remain the same Keima we know and love. \\n\\n\r\nThe art of the anime is very similar to the other two seasons. Nothing really changes with each of the characters in terms of design, and art. The art remains phenomenal, I very much liked how there's a great amount of detail in each scene, you can pause at anytime during a scene and see the level of detail within the frame, definitely makes me appreciate this anime more. In terms of sound, everything seems fine. The voices of the characters seem well suited for each of the personalities of each one of them. Background music was appropriate was appropriate to each specific scene during the anime. The OST is quite charming itself, although it might not be a cup of tea for everyone since the sound is quite intricate.  \\n\\n\r\nNow for the characters, most of the characters remain the same, but unlike the other two seasons we definitely see character development, however it is mainly just Keima. Unfortunately Elsie is not a main character in this season, which was a little upsetting for me since I liked her as a character and her bubbly personality, but for the focus of this season, I think it was natural that she was not put in as a main character just because this season sets a different aura than the other two. In terms of Keima's development, as I said before we get small hints here and there near the end of the anime that he’s going to mature, and potentially give up his love of gaming? \\n\\n\r\nFor the enjoyment, I definitely enjoyed this season a lot more than the other two. In my opinion the first two seasons were very similar, it was just Keima going around conquering females and helping Elsie with her quests. This season it is quite fresh, similar yet different compared to the prequels, but the concept of conquering females remain, which is what the viewers and fans want when watching this anime. The only problem I had with this season was with the last Heroine, it felt very rushed and the flow of the anime just felt off at that point. Even though that was the only thing I did not like, it still wasn't enough for me to enjoy this anime.\\n\\n\r\nPersonally I’m not a big fan of harems, but this is one of the few harems that I did enjoy. Overall Kami nomi zo Shiru Sekai: Megami-hen was an excellent anime; I’d rate it as a 9 out of 10. But in order to really appreciate it you must watch the first two seasons. With that being said I would definitely recommend this anime to anyone who enjoys a good romance or comedy, but watch the first two seasons first!\\n\\n\r\nThis is first review on MAL. Please comment on my profile to give me feedback !",
            "date": "2013-11-10T19:11:00+00:00",
            "helpful_count": 86,
            "mal_id": 119905,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1463523.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Decoys",
                "username": "Decoys"
            },
            "url": "https://myanimelist.net/reviews.php?id=119905"
        },
        {
            "content": "Kami nomi zo Shiru Sekai: Megami-hen.  (Long titles FTW).  As the third installment of this series, many fans who haven't read the manga should probably be expecting what is to be expected of this series.  This review is literally after I finished the series.\r\nStory: For those of you who haven't seen or heard of this series, the world god only knows is the story of a gamer who is forced to make girls fall in love with him in order to capture loose souls, forcing them out of the girls' hearts in order to be captured.  However, the story of thisseries is similar, but very different.  The story of the Megami-hen series revolves around Keima as his usual self, capturing goddesses, not loose souls.  Because of this he must go back to his previous \"capture targets\" and figure out if they are hosting a goddess within them.  And because the whole plethora of girls is dwindled down to 6, it becomes a proper harem rather then the deconstruction that it's always been. \\n\\n\r\n Characters: Keima, as the main protagonist, is a visual novel lover.  Instead of actually giving a damn about the girls he conquers irl or in-game, his only purpose is to \"get to the ending\", which if you've played visual novels, means the girl falls in love with you.  Though his character has pretty much remained unchanged throughout the whole span of TWGOK, this season adds a twist, making him reconsider the ways he's actually treating these girls.  Next, Haqua.  Yes, I know Elsie is in this series, but she barely plays a significant role.  With her introduction to the anime in the second season, Haqua is a character from Hell and plays a very good supporting role.  Her character is fairly well rounded as she plays a significant role in capturing said goddess'.  As a tsundere, well, it's pretty obvious.  However, what makes her such a great character, is her reintroduction later in the season after disappearing for some time.  Because of this, she becomes more of a badass and becomes somewhat of a different character altogether, in a good way.  (Personally, she's my favorite character of the whole series). And finally, Chihiro.  As one of the previous capture targets in the second season, it's expected that she would play a generic role.  However, she does more then that.  As one of the only girls in this series that have an actual somewhat real personality, she is the main influence on Keima which results in him regretting what decisions he has made in the past.  Because she somewhat understands what is going on in the last few episodes, Keima's and herself get huge character development and become incredibly stand-out characters.  \\n\\n\r\nAnimation and Sound: Oh, where to begin.  The animation in TWGOK is fantastic as always, simplifying itself to a chibi whenever it wants, and creating incredibly detailed scenes whenever it wants also.  For example, closeups with Keima, and Chihiro's final scene in the series.  Because of the addition of goddesses, the animation for their wings and individual feathers were superb at the least.  Especially in the final episode.  But for the most part, the animation is well done, with a few \"skippy\" scenes here and there.  One scene in particular in the final episode where there is some, awkward instrument playing.  But in hindsight, it can be overlooked.  The sound, oh yes, another thing to be giddy about.  The soundtrack for this series is usually pretty stand-out.  This season did not disappoint.  As always, they try to put in some \"heavenly\" tones and some techno sounds whenever they do an opening, but this time, they went over the top!  The opening itself has very well done pictures and the music sounds so godly and fantastic that it is truly one of a kind.  It also has a surprising amount of english words within itself.  The ending on the other hand has a more somber feel to it.  While the pictures in the ending are practically all the same, the sound of the ending is very calm and very rewarding sounding.  It's happy, it's sad, and overall, great.  \\n\\n\r\nPersonal enjoyment: I have always loved the TWGOK series.  Ever since I started, I have never been able to leave it alone.   When I first saw the premise of this season, I was surprised how much the series switched in terms of plot.  Luckily, it was a good switch rather then a really bad one.  (SAO)  The series itself really puts the main character in situations which he's not used to, and allows much more character development which for this character, is much needed.  As a personal fan, I'm debating over if this series should get another sequel or not because, this series ends on such a note that it can actually end right here and now.  But on the other hand, there is so much more potential to be discovered and it really puts me at a standstill.  However, as a personal complaint, the last episode, sort of rushed.  The first half of the episode was fantastic and at its peak, but the second half sort of died down too fast.  All of the possible action bits and goddess magic was squeezed into a 5 minute time-frame, which is a bit of a let-down.  Nonetheless, TWGOK is one of the most well known harem animes out there, and if you are a fan like me, I would highly recommend this to you.  But know this, in order to watch this season in specific, the other 2, plus the Tenri-hen OVA's must be watched first.  It is the only way to know what exactly is going on here.",
            "date": "2013-09-23T17:34:00+00:00",
            "helpful_count": 76,
            "mal_id": 113981,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=113981"
        },
        {
            "content": "The World God Only Knows is well known for its different take on the harem genre. The main character, Keima, is out to make girls fall in love with him at first to save his own head, but later for more important reasons. It contrasted greatly with the common stereotypical harem series that had an oblivious main character with girls that were head-over-heels in love with him. However, the Goddess Arc, for which this third season is based off of, is the story arc that propelled this series from something fresh and interesting to something that really became something special. While this anime adaptation hasa few flaws, The World God Only Knows: Goddesses is mostly able to carry the manga's greatness with it, and rise to become the best TWGOK series yet.\\n\\n\r\nThis third season follows Keima as he searches to find the goddesses who are residing in the hosts of his previous conquests, and has to make them fall in love with him all over again in order to bring out their power to fight back against Vintage, a group from Hell that wishes to revive Old Hell. The story is great, with the individual conquests mostly being very well done. The humor, drama, and romance from the previous seasons are back, and make the conquests as enjoyable as ever. This arc also really brings forward the lore that has slowly been presented through the last two seasons about Hell and presents an interesting tale involving it as well. The last conquest, the Mai High Festival Arc, is especially great, as it really raises the bar with a great story that unfolds, with interesting twists, higher stakes, and hilarious and heart-wrenching moments, as well as bringing about a great climax and resolving the Vintage conflict. \\n\\n\r\nHowever, a couple of problems do arise from the way they decided to adapt this arc. For some reason they decided to adapt this arc without first adapting the remaining normal conquests in between the second and third season. They also expect you to have watched both OVAs (Tenri Arc and 2-B Pencils) beforehand. As such, it rushes the pacing on the two conquests based on girls not seen before, trying to cram in the details of the previous conquests, as well as it being a little confusing for those who haven't read the manga or seen the OVAs, although it isn't too big of a problem because most people should catch on fairly quickly. Another issue is that the amount of content they are trying to fit into 12 episodes some 80 chapters, while the previous seasons had nearly one chapter per episode. This does cause the pacing to be a little quick in the beginning, such as the prep for the Goddess arc as well as the two conquests mentioned previously. However, I do want to give props to the director Satoshi Osedo for being able to fit all this material and still make it fairly reasonably paced. Other than the issues mentioned before, this anime does very well with pacing, and did pretty well trying to work around the problems it had no control over (like the skipping of conquests). I think it is reasonable to say that it even has better pacing than the original series, which dragged on especially in some parts (the buggy game episode and Shiori's arc come to mind). Overall, these issues aren't really that big of an issue, but since I love this series so much I have to nitpick at a couple things. This issue really goes away after the Tsukiyo arc, as it doesn't even bother the Yui arc that badly, but it is there for a little while.\\n\\n\r\nThe characters are definitely one of the greatest things to come out of The World God Only Knows. Keima is awesome as always, but this series takes it even further than before. This arc really starts to develop and change his character, as the stakes are raised higher and he really starts to see the consequences of the way he goes about his conquests. He also starts to take things much more seriously, beginning to see that it's not a game anymore, most notably seen as how he is missing his iconic PFP for most of the season, and doesn't even really touch a game other than at the beginning and the very end. He starts to begin feeling the emotional consequences of the conquests on himself as well as on the girls. Besides Keima though, Haqua also receives decent development during this season as well, going from the naive, rule-abiding girl she is to a more mature and stronger leader, fighting back against Vintage. The other characters in this season are great as well, with seven of the better girls returning (or showing up for the first time) for Keima's conquests, as well as Tenri/Diana and the Hell members like Nora, Lune, and Elsie. All of them are pretty interesting and enjoyable to watch on screen. This cast of characters, alongside the star-studded voice cast, really is one of the greatest parts of this show.\\n\\n\r\nThe art of this show is pretty good but not as great as it could be. The character designs are great as always, but the animation quality doesn't always follow suit. Manglobe has never really been known for the best animation, so its expected that they aren't going to suddenly be on KyoAni level animation for this show, but it still is a little bothersome. By no means is it bad, it just isn't as great as it could have been, with a few blips in the art every once in a while. Other than that though, the art is pretty good. It's saying something when the weakest point isn't really all that weak. The music is well done as always. The soundtracks help to accent the mood in the moment, whether it be the climax of a conquest or a moment of despair. The opening is also probably one of my favorites this season, and probably ties with first season for the best TWGOK. Saori Hayami sings beautifully as always, and produces a great opening. The closing songs are pretty good as well, although not as good as the opening. \"The Memory of My First Love\" (Hajimete Koi wa Shita Kioku) is probably one of the best, as the lyrics really fit the mood of the last episode, and Saori Hayami's \"With... You...\" is a notable mention as well. Overall, the music and art of this season are pretty good, even with a few flaws.\\n\\n\r\nIf you couldn't tell, I really like this season of The World God Only Knows. Despite a few flaws, it is definitely my favorite of the three and would definitely recommend it to anyone who has seen the first two. In a way it is like The Disappearance of Haruhi Suzumiya, as you need to see the previous seasons for it to make sense, but it is the best of the them all. I enjoyed this show greatly, with a great story, humor, and characters, and it resparked my love of the series after the slow down in the manga (although it has picked up since then). Hopefully Manglobe will find some way to animate the missing conquests, but if not, so be it. This was a great season. Anyone who loves The World God Only Knows should check this show out, and for all fans, as Keima says:\\n\\n\r\n\"I Can See the Ending.\"",
            "date": "2013-09-23T18:38:00+00:00",
            "helpful_count": 18,
            "mal_id": 113991,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1479553.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Glacialis",
                "username": "Glacialis"
            },
            "url": "https://myanimelist.net/reviews.php?id=113991"
        },
        {
            "content": "THIS REVIEW MAY CONTAIN SPOILERS.\r\nThe World God Only knows, or KamiNomi for short, a series that has been so successful that it has achieved its third season with the subtitle ''Goddess Arc''. An arc featuring a little of complexity and little change in the routine we thought up of Keima. Making a transition of a romantic comedy harem into a really deep drama romantic anime. So let's see what it has to offer.\r\nSTORY -9-\r\nThe story continues after the OVAs of Tenri were finished. At first it was believed that the story will continue with the conquest of  another girls but that is notthe case. The story at the beginning it shows us a time skip. A time skip of the other girls Keima captured after Tenri and even before Tenri. Girls like an astronomer, a rich girl, a ramen server, a big sister and many other girls that he gave the best to release them from their pain. \\n\\n\r\nBut in this season all that changes. Now Keima has to reconquer girls that contains a great power, a goddess in them, so they can stop this group call Vintage from making a new Hell in the Earth. \\n\\n\r\nThe change of the plot in this season is great, because it makes us look back at Keima's past conquest and not just forget about them. Now they add a little more importance to the story. Because if you see last 2 seasons it was only about Keima and Elsie's adventures and capturing the spirits. But in this season we get more action, more drama, more confessions and seriousness that not many ''harem'' type shows can offer. Making this season one that stands out the most. The conquest of the girls are funny, dramatic and so sincere giving you the feeling that they really know how the love feels like Also I like to add the fact that this season did not have any filler episodes during its execution like in the last 2 seasons. But I got say that this season gave many viewers the nostalgic touch of knowing how the heroines we loved and suffered were back in action.\\n\\n\r\nThe only problem was how it was presented. I'm not saying that it was bad that they adapt this arc but the problem is for the newcomers that they have to read the manga to undestand and to attach to some girls which arcs that were not animated. I feel that if they have let out some of the episodes like the one of the glitch, when Elsie's decide to live with Keima and the last episodes of every season they could at least have tried to do animate the important 2 girls in this seasons. But the rest I can say that it was well written.\\n\\n\r\nART -9-\\n\\n\r\nIt is very beautiful. The characters are well designed. They don't look neither too cute nor too bad. It has a standard point that they look very delightful to the eye with impressive use of bright colors and detail textures in their body. Mainly in the trace of their faces, eyes and hair color. They just look awesome and very well drawn.\\n\\n\r\nSOUND -9-\\n\\n\r\nThe voice actors execute very well their job. They all sound very natural. They don't use any kind of pitch to make their characters sound more adorable. No they sound very human like. Mainly when the drama and confessions start to rose.\\n\\n\r\nThe Opening is one of the best. I love how the opening for the series has this mix of electronic vibe, oratorio and english lyrics. They combine perfectly the context of the plot and it represents very well Keima's character. Also the ending is one of my favorites and that is a big shock. Mainly because I dislike songs with the main characters sing but it is amazing how this one did it. Mainly Shiori's version which represents very well her character and not forgetting the last song used during the Mai Festival arc. All of them were great compositions.\\n\\n\r\nFinally the OST. KamiNomi has one of the most memorable osts. Showing action, drama and suspense when it had to. One of the main instrumental pieces is when he conquers the girls. That piano sound it's just beautiful to the ear and very adorable.\\n\\n\r\nCHARACTER -9-\\n\\n\r\nThe characters in this series are great. Each one have their own personalities. They may look cliche but they are very well done. Their characterization are well portrayed because they know what they feel and when to express it naturally. Specially the main protagonist Keima. Because in this season he makes a great transition from this geeky otaku gamer to a true lady's man who has the courage to do anything to protect this girls. Even their last words were very strong and you can even feel them. Every girl is awesome but I got to say that the main one who stoles the show is Chihiro. A girl that really knew what she wanted from the beginning at she was serious to get it. It was so painful for what happened to her througout this season but it was well done for the show. The only bad thing is the poor participation of Elsie in this season. Because she was like the opposite of Keima and not having her like in that position made the show feel odd but we knew why she did that. \\n\\n\r\nENJOYMENT -10-\\n\\n\r\nI love this season. The series has done it very well. I read the chapters in the manga but watching it animated it gave a new feel. It made me got into the characters, plot and theme of the show. I really and trully enjoy it. Even althought it left out some chapters for the time skip I feel that they did the right decision. I just hope that they can do some format of OVA for at least some of the girls because some of their stories were just awesome and lovely.\\n\\n\r\nOverall -9-\\n\\n\r\nIf you have made it to this far you know that it was worth it. The story is great, the characters are very likeable and easy to get attach to them. I hope the series continues to grow so we can continue and have great seasons like this ones. Although I don't want to say in this one ''I can see the ending'' but for this 2013 it has done it.\\n\\n\r\nThanks for reading this review. Excuse me if I had grammar issues but English is not my first language. Take care in whatever you do and enjoy doing it. \\n",
            "date": "2013-09-23T19:56:00+00:00",
            "helpful_count": 16,
            "mal_id": 114013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482029.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KevSan",
                "username": "KevSan"
            },
            "url": "https://myanimelist.net/reviews.php?id=114013"
        },
        {
            "content": "The first time I heard KamiNomi get third season I'm getting excited. After the luckluster sell from previous two season I'm worried that it won't get any anime. But my excitement fall quickly when they anounce that this will cover Goddess Saga in one cour. This is going to be terrible, this is going to be bad, they going to get this butchered is what cross in my mind that time as a manga reader. But Manglobe prove me wrong and show me how they can cover 70+ chapter into one cour amazingly.\r\nStory : 10\r\nThis is covering fan favorite part of the manga Goddess Saga.Even if some part being cut and they cram skipped conquest into half episode flashback in episode 1 they still covered the later part quite faithfully and won't dissapoint manga reader.\\n\\n\r\nArt : 10\\n\\n\r\nThe girl get more and more atractive this season. The most noticable change would be Chihiro who go from average looking into cute teritory.\\n\\n\r\nSound : 10\\n\\n\r\nThe soundtrack also didn't dissapoint. It fit with the mood very well. The full OP is summarizing this season very well. Added by ED that change the coverage for every episode make this great.\\n\\n\r\nCharacter : 10\\n\\n\r\nThe main selling of this season is character developement with Keima get the most notable developement. This season is also promote Haqua to main character replacing Elsea who get another role this season.\\n\\n\r\nEnjoyment : 10\\n\\n\r\nAs long time fans the fact that this get animated is already good enough. Coupled by good execution by Manglobe make it the best KamiNomi season ever.\\n\\n\r\nOverall : 10\\n\\n\r\nThis series give me more of what I asked for. Skipped content aside they did a good job animating this. So for you who have read manga don't worry and go dive watching this and enjoy the feel. For you anime only viewer I'm adviced you to watch at least Tenri-hen OVA if you haven't watch it to get more picture of what happen this season. Overall I'm pleased with this season.",
            "date": "2013-09-24T17:10:00+00:00",
            "helpful_count": 14,
            "mal_id": 114143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1187665.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NeoAnkara",
                "username": "NeoAnkara"
            },
            "url": "https://myanimelist.net/reviews.php?id=114143"
        },
        {
            "content": "Story: I thought the story was a good sequel to the others. It had lots of fluffy and cute scenes and also pervy ones. It would've been a perfect story if it wasn't for the fact that Elsie was totally left out, and that just felt wrong for me, everytime I saw Elsie NOT being part of the story I felt guilty. It must be 'cause she was the one that started the story. Apart from that it was just perfectly surreal.\r\nArt: As always it was bright and fantastic, there were some scenes were it looked better though...\r\nSound: I fell freaking in love with theopening song! It was so cute and modern. :3 dunno...\\n\r\nCharacter: The characters are almost all known to us and they're quite relatable! Even though it seemed some female characters would just be DDummies (get it?) they did have personalities! I loved that, pretty girls with brains.\\n\r\nEnjoyment: I didn't get so into the story as I have with other animes but it didn't alienate me completely. It was mostly funny, but at some bathub scenes I was blishin so much!\\n\r\nOverall I liked it, and I think in the end they kinda let us know that they're gonna make another season (maybe)....",
            "date": "2013-10-12T17:59:00+00:00",
            "helpful_count": 12,
            "mal_id": 116635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2221609.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/cristikirtas",
                "username": "cristikirtas"
            },
            "url": "https://myanimelist.net/reviews.php?id=116635"
        },
        {
            "content": "What an amazing ride KamiNomi has taken us through all 3 seasons, and by far season 3 was definitely the best! Sure no part of the plot really makes much sense -  making girls fall in love to save the world from the demons? But aside from all that, this anime proves that the harem genre CAN go beyond just fanservice and lousy characters. It is the best harem anime I have seen in my entire life - and it is an absolute MUST WATCH for everyone - just because it's so special (and I'll elaborate why below).\r\n\"I can see the ending!\" - Keima\r\nTL;DR\r\nStory:7/10\\n\r\nArt: 10/10\\n\r\nSound: 9/10\\n\r\nCharacter: 8/10\\n\r\nEnjoyment: 9/10\\n\r\nOverall: 8.375/10 (rounded down to 8)\\n\\n\r\nGood points:\\n\r\n+ Exciting, gripping story and conflict\\n\r\n+ Amazing sound and visuals\\n\r\n+ Good comic relief\\n\r\n+ Great emotion and touching scenes\\n\r\n+ Huge variety of unique characters\\n\r\n+ Extensive main character growth\\n\r\n+ Deeper plot than previous 2 seasons\\n\r\n+ Great ED Themes\\n\\n\r\nBad points:\\n\r\n- One-dimensional, underdeveloped antagonists\\n\r\n- Plot may not make much sense, and is secondary to the characters.\\n\\n\\n\r\nStory: 7/10\\n\\n\r\nIf we take a look at the plot as a whole, we can see 2 main arcs. The first arc, the Re-capturing Arc, is where Keima goes around trying to re-capture all his previous captures, but of course, many things don't go his way. The second arc is kind of also within the re-capturing arc, but focuses more on the battle against Vintage, the main antagonists of the story. In comparison to the previous two seasons, I must say that the central conflict surrounding TWGOK III is much more gripping, exciting and though not too believable, was much more significant and interesting.\\n\\n\r\nThe excitement hits you right off the bat when Diana starts to tell Keima about how he has to find all the goddesses from within his previous captures. Initially, we think nothing about it and we expect that same old comedic slapstick humour that was so central to the anime in the previous two seasons. But then - bam! - the enemy strikes as Apollo/Kanon is left motionless (what a pity we don't get to see her in action) due to a magical dagger that threatens to kill her life. Things only get more and more interesting and exciting as the plot unfolds from there - there is a time limit (though at times it may not have been obvious), and there is a legitimate reason why the world is coming to an end if Keima doesn't do anything. This is a far cry from the \"capturing of loose souls\" in an almost aimless manner in the first two seasons, so a great job well done! (+1)\\n\\n\r\nAlso, the gripping nature of the plot continues even towards the end of the anime - where we have certain plot twists and reveals pertaining to Nikaido, Keima's homeroom teacher, who turns out to be not so ordinary after all, and Akari, the undercover member of the Loose Soul Squad. All of these only serve to make the plot so much more interesting - it's not just about Keima capturing girls, there's an entire army backing him up, especially at the end when the battle between the Loose Soul Squad and Vintage breaks out over the ocean. (+1)\\n\\n\r\nThere is also some interesting plot development as the anime starts to slowly show the audience snippets of information about vintage throughout, from scenes in hell to Vintage's perspective, even through Haqua's perspective, which I thought played a key role in the unraveling of the plot. I particularly loved the twist where *spoiler* Yui and Keima were in the haunted house and they planned beforehand for Haqua to pretend to act like she was from Vintage and attack them in the house, in order for Mars to awaken and save the day. (+1)\\n\\n\r\nAs for depth, the anime may seem quite linear at the beginning, when all Keima is doing is essentially repeating the same process over and over again - planning his captures, but towards the end you can tell that it's not so simple after all. Things start going complex when \"detours\" and \"sudden flags\" and \"interruptions\" start occurring and Keima starts going bonkers as to what exactly to do when his plan A, plan B, plan C fails and so on. While the conquests of Shiori, Yui and Tsukiyo were rather straightforward, Ayumi was completely different ball game altogether. All the while, Keima thought that his \"plan\"' was going smoothly, and then things just suddenly go haywire because he couldn't predict certain outcomes / occurrences. Eventually, Keima realizes that he was no longer in control - none of us ever are, when it comes to love. Ayumi ended up conquering herself in a way, because she chose \"to love\" and not to \"be loved\" which I feel was a very meaningful twist to the usual story. (+1)\\n\\n\r\nAlso, we really can't forget the love story between Chihiro and Keima that is just so subtly obvious throughout the anime, that I really can't stand it every time Keima doesn't see Chihiro's true and honest feelings for him. When Chihiro said, \"I don't need a reason to love you.\" - it is literally like the anime is shouting at Keima - Stop thinking so logically and reasoning everything out, just do what you FEEL is right! Chihiro's love for Keima is really the most ideal / innocent love out of all, and I think that's the finishing touch that just makes the entire anime story so beautiful (+1).\\n\\n\r\nAs for the coherence of the plot - I do have some problems with how the ending played out in the end. There was a particular scene where you have the evil Vintage girl stabbing maniacally at the ground, while on top of Haqua, so I'm not too sure whether the girl was even trying to kill Haqua in the first place, given the berserk look she had. But then again, she let her survive at the end, so I guess maybe she never intended to kill Haqua in the first place.\\n\\n\r\nThe entire smuggling Haqua out of hell by our kind Dokuro Skull was only half touched on. We never got to know how Haqua was smuggled out of the prison cell in the first place. Also, the anime doesn't really touch on Nikaido and Akari's true identities, though it does hint that they were central to the defeat of Vintage. While the story also did show Keima \"realizing\" something about how the school's logo was that of a goddess, the hexagon and the covered up holes that he had previously discovered with Tenri 10 years ago, they didn't really develop on that except to make a slight connection between the Jupiter Sisters' super powerful spell at the ending and a substandard explanation of why everything had to occur within the vicinity of Maijima Academy.\\n\\n\r\nNot to mention Ayumi randomly asking to get married without so much as any idea as to what's happening, the entire ship suddenly becoming completely re-fitted by Nora with so many decorations and beautiful lighting, and honestly, it's funny, but... HOW THE HECK DID KEIMA FIND A HORSE? And what happened to the horse after the whole conversation? It kind of just disappeared. Also, most of Vintage's powers seem kind of dodgy. At first, there was all this talk about \"Ancient Demon Magic\" which is like supposed to be feared greatly and is illegal, and it was really hard to dispel the dagger (needed at least 2 Jupiter sisters) which stabbed Kanon/Apollo, but later on Haqua and the rest of the Loose Soul Squad seemed to have no problems with dealing against the Vintage's spells (maybe because she's badass), so perhaps this ancient magic is not really that powerful after all that talk about it.\\n\\n\r\nHowever, I can at least give 1 point for the fact that at least most of the key premises of the plot are believable and that the way the conflict was resolved in the end was quite reasonable. (+1 for some sense)\\n\\n\r\nThere is also something very special about the plot this time. Keima, throughout the previous two seasons, and perhaps once this season, uses the line \"I can see the ending!\" While the resolution to this anime is kind of complete conflict-wise, I really wanted to see Keima and Chihiro get together again despite what happened on the rooftop. The anime though, ends with Elsie saying that Keima is back to his normal self, but when the camera shows Keima shutting off all his games and stepping outside, one has to admit something has changed about him... somewhat. I guess this is the writers' way of not completely revealing the ending of their relationship but letting the audience \"see the ending\" just as how Keima has been \"seeing the endings\" of all his previous captures. Can you see the ending? I'm pretty confident, given the way things are, that Keima and Chihiro will indeed have this happy ending. (+1 bonus point)\\n\\n\r\nArt: 10/10\\n\\n\r\nArt was definitely solid and amazing. I really loved the character designs, animations, all of it. It was very enjoyable from start to the end, including all the comic parts with mini-Keima.\\n\\n\r\nAnimation: 3/3 - Top notch, enough said. You can tell from the wings, the fireworks, the special powers, that they probably got a big upgrade in the animation department from the previous two seasons.\\n\r\nAesthetics: 3/3 - It was simple, great, clear and well-directed. I loved the artistic theme.\\n\r\nOP Sequence: 2/2 - The OP scenes were wonderfully crafted\\n\r\nED Sequence: 2/2 - The ED Scenes were very beautiful to watch as well\\n\\n\r\nSound: 9/10\\n\\n\r\nOP Theme: 1/2 - Seriously, stop singing in English, it is so annoying! But if you ignore the lyrics and just listen to the instrumental, the OP is really good!\\n\r\nED Theme: 2/2 - Simply amazing and beautiful.\\n\r\nBackground Music: 2/2 - Emotional when it needs to be, exciting when it needs to be.\\n\r\nAdditional Themes: 4/4 - I really, really loved the concert at the end of the anime! It was very touching and the old rock concert ending never gets old. Also, very beautiful special ending themes for episodes 8 and 9!\\n\\n\r\nThe audio experience was outstanding - it's a pity I can't give it a full score because of the shitty OP lyrics.\\n\\n\r\nCharacter: 8/10\\n\\n\r\nIt's time for Keima to shine. Really. He used to be a really linear character who only does things one way, but now he's learning, he knows how to adapt, he is beginning to change. He starts to show character growth from the beginning of the show - through his determination to save Kanon no matter what, because she is a real girl. The Keima I knew from the past never thought twice about real girls - but he has changed so much because of the conflict and surrounding plot. Even towards the end, he finally falls in love - with Chihiro - and he didn't even realize that he was in love until it was too late.... Keima's really transforms from just an otaku gamer to someone who is *beginning* to understand what it really means to love someone - and he's already got all the basics - the determination, the drive, the passion, the only thing he realizes he's been missing all this time is the sincerity to go with it. But the anime eventually shows that he does realize this at the end, when he puts down all of his games .... hopefully to go find Chihiro again. We even start to see a little backstory from the flashbacks with Tenri, showing Keima in his younger days, too bad Keima doesn't open up enough about his own true feelings in the end for me to consider his character properly developed. (+1 for growth, +1 for being smart)\\n\\n\r\nThe other character that really, really shines in this anime is Chihiro. Chihiro is the most special ordinary character ever. She doesn't have any niches or special qualities, she's merely a guitarist and lead singer in a band that she just started pre-season 3, and she's also not entirely smart, pretty or useful either. But boy, does she really make her presence felt this entire season. From beginning to end, you can see how she progresses from making small moves towards Keima, to the love confession, to the eventual meeting at the rooftop at the campfire. You can tell that Chihiro isn't just \"another conquest\" at this point, she became a whole other protagonist character - and this becomes especially clear when she manages to help Keima in his conquest of Ayumi, by breaking the love triangle relationship and by convincing Keima to be honest with his feelings. Chihiro has really stuck on me so much as a character, that it pained me so much to see Keima ruthlessly rejecting her on the rooftop, even after she admitted that she had liked Keima even before season 1. Even at the end, when they had that one still shot of Chihiro's tears streaming down her face as she ended the last stanza of \"The Memory of My First Love\", I *almost* wanted to cry with her. (+1 for development, +1 for growth, +1 for empathy)\\n\\n\r\nOf course, this character analysis wouldn't be complete without mentioning our adorable tsundere Haqua, who finally takes the place of annoying Elsie for most of this season. Haqua, while she doesn't change much throughout the show and still stays rather linear as a character, becomes a vital instrument in advancing the second half of the plot. She gains some confidence from Dokuro Skull and eventually starts doing some much-awaited scythe-slashing and butt-kicking with her scythe of doom.\\n\\n\r\nThen we come to the conquests. While Shiori, Tsukiyo were nothing special, Yui was especially unique, and interesting. Yui is a cross-dressing girl, who eventually, and comically, convinces Keima to cross-dress as a girl so that they can go on a date and look like a real couple. The fact that Keima even agreed to such an idea is beyond me, but perhaps Keima is -that- kind of guy. It was really a one-of-a-kind conquest, for Keima to have to \"be conquered\" by a girl who acts so much like a guy, so that was really very unique, in my opinion. (+1 for uniqueness).\\n\\n\r\nThe other main one, Ayumi, was definitely a key character, but for mainly plot reasons. Ayumi shines though, in that although she may not have acted very rationally or believably throughout the entire time, she really managed to \"wake\" Keima up, and made Keima realize that he loved Chihiro so much on the inside, he didn't even know it. Ayumi also grew alot through the story, she didn't just blindly fall for Keima, she also considered Chihiro's feelings, she also punched Keima multiple times, and she also realized that her love was unrequited in the end and still brought it to a happy ending, with a hilariously planned wedding. (+1 for growth)\\n\\n\r\nI have to specially mention the entire supporting cast of wonderfully hilarious characters like Elsie, who makes you laugh with all her funny reactions and stupid statements. There was also the entire Goddess cast, who were absolutely hilarious, especially in the scene where they were all fighting over Keima amidst the dark conflict surrounding them. There were really so many variations - the playful Apollo, the leader Diana, the fighter Mars, the shy Minerva and the queer Vulcan, and Mercury, but she didn't feature much because she was the last to come out. Also, we have the very interesting Nora and her partner Ryo, who are obviously a protagonists, but she continually reminds the audience that she's just doing what's best for \"her district\". (BONUS +1 for variety of character cast)\\n\\n\r\nThe only problem with the characters are the lack of development of the antagonists, the Vintage, in the entire plot, which I felt was quite a pity because the Vintage is actually quite a core component and I would really want to understand the story from their point of view as well. There's also this interesting green-haired girl that Haqua fought with, but they never introduced her at all.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nWhile the comic element didn't feature so much in the anime this time, there were still some particularly funny scenes such as those featuring Yui and Keima in their awkward positions, Elsie's random musings and reactions, Keima appearing on a horse in front of Ayumi, Ayumi's parents' reactions to the marriage idea, Keima getting kicked over and over again, Shiori and Keima's story battle, and the list goes on and on. (+1 for comedy).\\n\\n\r\nTo make up for the comic element though, this time, there were really good exciting and suspenseful scenes right from the get go, where they first introduced the Vintage with an attempted assassination of Kanon/Apollo. The other particularly exciting part was when Keima chanced upon Vintage's hideout and discovered the entire enemy plan. And this excitement continued to build up into full-blown actions scenes with Haqua as well as the other members of Loose Soul Squad fighting against Vintage. (+1 for action, +1 for excitement)\\n\\n\r\nNext, we really can't forget the emotional part of the entire anime, which culminated with Chihiro's love for Keima. All the other touching scenes with Shiori, Tsukiyo and Yui were good, but they were nothing compared to Chihiro. The final concert really almost made me cry, but the entire drama during Ayumi's conquest, from the rejection at the rooftop to the swinging back and forth Ayumi's affection, was also very emotional. (+3 for emotion)\\n\\n\r\nPacing of the show was also quite decent. I only thought that Shiori's conquest was a bit draggy, but it's probably just me being tired of listening to all the different and lengthy thoughts that Shiori has in her head before anything actually got done. The way the ending for her conquest played out in the end was also fairly simple, so I thought pacing could have been better there. (+2 for pacing)\\n\\n\r\nThis time, I am glad to announce that I will be giving a bonus point because there are finally NO filler episodes (unlike the previous 2 seasons)! (+1 bonus point)\\n\\n\r\nOverall: 8.375/10\\n\\n\r\nIn summary, this is by far the best out of the 3 seasons of TWGOK, but you might want to watch the first two seasons so you have a rough idea of the premise behind this. I do recommend that you watch the OVAs as well, because you will be able to see the background behind Tenri, Akari, the band itself, and it would add a lot more to the understanding of the plot and characters.",
            "date": "2014-12-04T03:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 170987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3899837.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kaizersaber",
                "username": "kaizersaber"
            },
            "url": "https://myanimelist.net/reviews.php?id=170987"
        },
        {
            "content": "This is my second review.\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nKSS's first and second season has much more been a typical harem show and I wasn't expecting anything to change. However things did change and it shocked me ultimately to say the least. The plot started to develop and it was a pretty good one at that. \r\nWhile the first and second season has been more into how Keima deals with his 'conquests' at trying to make a girl fall in love with him to draw out the loose souls, this final season has given us a perfect and powerful ending to end the series entirely. The build up over thelast few episodes gave me shrieks and horrors and literally made my jaw drop. I was being stolen at how a harem show I wasn't expecting much off take a huge turn and turned out to be one of my favourites. \\n\\n\r\nStory & Characters(9): I started to watch this season expecting it to be the same like last season, to end with no girls Keima particularly ending up with and just continue conquering more girls. I was wrong, this season has been much over the one girl we would have not expected to be loved so much by the KSS's fans. The story has been more engaging, though cliche, on how there is two girls who he had conquered on the first season causes a problem in a bitter love triangle, it was something really crushing to watch and how Keima had to handle that one scene when he realizes something was off was really heart-aching. One of the girl lead was what I think made this season a huge success, in the end you just can't hate her. She was the one who gave a powerful emotional impact on Keima's life and played a part on how Keima succeeds his mission. While it isn't given that she ended up being with Keima the development of their relationship has been a huge satisfaction for a near-perfect emotional ending. \\n\\n\r\nArt & Sound(8): Like the previous seasons it has been nothing but top notch animation and music. The English openings as always has been a nice change and you just can't help to sing along with the chorus. The OST's fits with the mood of the scenes which considerably gave an impact on how an arc/scene turns out. The beautiful scenery it has during every conquests has never been disappointing. \\n\\n\r\nDrawback(s): Before I conclude the review I'd like to mention the only thing bothering me through the season. And that is indeed the comedy. After a certain conquest when our emotion meter is about to break they just HAD to throw in a chibby Keima and it made it us thinks like everything was suddenly somehow settled down, while it wasn't! Had they kept the same pace and mood, with a clever writing, the last few episodes could have been a real tearjerker. Though in the end it works out pretty well, and we have our fair share of breakdowns.\\n\\n\r\nOverall & Enjoyment(10): I've been and probably will be a biased rater for a while to come, though for the last 5-6 anime I've watched I've tried to rate things up to my standards, which was try not to be too biased, but this anime made that streak to an end. I just had to gave it a perfect score because the ending was something undeniably heartbreaking.\\n\\n\r\nThis finale has been wonderful with the jaw drops and a wonderful emotional plot. I had a blast watching this and couldn't help feel excited because it was something more than what I expected. While I'm giving this anime a 9 in the review, my list will definitely have a 10 to let me remember how this anime's last season had been such a joy to watch and laugh with.  The way KSS ends will always be something I keep hold dear for a long time to come.",
            "date": "2013-10-09T04:33:00+00:00",
            "helpful_count": 11,
            "mal_id": 116195,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2633089.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Krasa",
                "username": "Krasa"
            },
            "url": "https://myanimelist.net/reviews.php?id=116195"
        },
        {
            "content": "Doro,doro,doro,doro,doro,doro,doro...OOOOOH a loose soul is running around, kidding, Bueno no more running around and I'm just gonna present each of my ratings for this third sequel of \"Kaminomi\" :\r\nOh and btw, though I may have read the manga, I haven't read all of it yet in fact while writing this review I'm still on Chapter 2, so my review is only for this anime's third  sequel. \r\nStory, character, enjoyment- good 7.\r\nStory: Though, it still follows the same genre, it is the introduction of  new set of characters, a switch of the secondary main character and a new mission for the main character wherethis time he's set to awaken the five other goddesses who are called the Jupiter Sisters, totally this anime's new plot reinvents itself to a whole new level. Also, the harem genre has provided a new dimension to this reinvented sequel, since in previous seasons the girls forget everything after being conquered by the main character, here the girls remembers the conquest and has displays jealousy when one of there own has declared her love for the main character.    \\n\\n\\n\\n\r\nCharacters: With the introduction of the Jupiter sisters, a new antagonist Lune and couple with Haqua filling in for Elsie as Keima's human partner ( I assume that any of you would know why and how), actually does provide this anime's reinvention. Compared to the last two prequel, this one doesn't feature the usual Keima who is cold and non apologetic in real world and only cares about the game world, and were hunting loose souls with Elsie is more like a chore than anything else, in fact, this the only part where we see Keima's serious side as he felt remorseful of Chihiro that as he makes such difficult decision that will hurt both him and Chihiro. Haqua being Keima's temporary replacement partner adds a new phase to the usual Elsie and Keima and It kinda hurts me to see that Elsie is limited to a secondary character in this sequel, Haqua also provides as an additional harem type competitor for Kiema's affection aside from the goddesses. The reintroduction of  Tenri Ayukawa who is also Diana does complete this sequel being as childhood friend to Keima, I really like that her character of having a dual personalty from being a shy Tenri to a gutsy Diana, she really provides a sort amusement since it looks like that there are two fighting for the guy's affection rather than one, it is also the same for the other Jupiter Sisters.\\n\r\nThe antagonist Lune, I kinda hate it that her role ended in a cliffhanger after her fight with Haqua, in fact I'm a bit disappointed that Haqua was no match for her despite of only being armed with a box cutter, on to Chihiro, from the start of the anime I already feel bad for her (after getting some spoiler about her in this sequel) and I could have wish that she gets into a relationship with Keima, but then again Keima having to worry about Kanon and the other Goddeses and have to make such harsh decisions of breaking up with Chihiro and it really makes me pity her, since she has to be the collateral damage of the imminent war between Vintage and the Jupiter Sisters. As for Kanon, Ayumi, Yui,  Shiori and  Tsukiyo Kujyo, I'd probably say that they are nothing more than renewed characters  both from previous seasons and from the manga, but it was the Goddesses that they have inside that makes it part of this reinvented sequel. Nora, on the other hand seems to provide as Keima's reluctant insider and added help, however I do find it nice in episode 7 that she becomes Keima's short time partner after Haqua got arrested.  \\n\\n\r\nEnjoyment: With this third sequel's olot reinvented, it was nice that Manglobe decided to come up with something such as this if  Manglobe decides to to a sequel whose plot hasn't change then this sequel would have been boring.\\n\\n\\n\r\nArt and Sound- fair 6.\\n\\n\r\nArt: Well, I would have given it a 5 since nothing has change with the anime's overall illustration , but after seeing Haqua in a whole new outfit and Nora's get up I think such score would be fair enough.\\n\\n\r\nSound: As much as I can say, I really like the ending theme and Chihiro's song, but  not the opening.\\n\\n\r\nOverall- very good 8.\\n\\n\r\nOverall, studio Manglobe did took such risk of making a sequel with a reinvented plot and I think it's very good that they did. I wonder if there will be a forth sequel?\\n\\n\\n\\n\\n",
            "date": "2013-09-24T12:22:00+00:00",
            "helpful_count": 10,
            "mal_id": 114121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=114121"
        },
        {
            "content": "It has been a considerably entertaining few years as this anime was first introduced into the community, and once again The World only God Knows has changed our understanding of the Harem/Romance genre. Whilst the initial two seasons follows the manga closely and broadens our understanding between Keima's idealistic fantasy and his unavoidable destiny to conquer the \"real-life\" girls, season 3 would have been an absolute disaster if the continuation of his conquests was not supported with any actual \"ending\" (Keima's favourite word).\r\nThankfully, TV Tokyo decides to take the major risk into a timeskip between seasons 2 and 3, and while it may have confusedthe audience with rapid changes, the entertainment from the Goddess arc truly shined and the adaptation is perhaps no short of outstanding. The story of Keima's adventures to collect loose souls initially had no true implications, yet the revelations within the Goddess arc enabled a strong, firm connection within Keima's world.\\n\\n\r\nAs with its predecessors, Megami-hen's art and sound have been superb, the opening and ending this season have been especially mesmerising for myself personally. There were only some minor frame changes between the manga and anime itself (disregarding the major change in storyline), yet overall Tamaiki Wakaki has once again impressed the audience with high quality artistic features. The precision of the actions and expressions with the girls is another bonus within this already highly-regarded masterpiece.\\n\\n\r\nWhat truly allows the story to shine so brightly amongst the thousands of other competition is nevertheless the personality of it's characters. Even the main protagonist himself recognises and accepts unique personalities of his conquered girls. In the third season, many girls return to take on the heroine role, and once again Katsuragi must conquer them a second time in order to draw out the power lying within. This change of events from the ordinary loose soul mission to drawing out the power of the Goddesses nevertheless strongly appeals to the currently fanbase, with many getting to see their beloved female heroines (+Yui, if you know what I mean) once again falling for Kami-sama.\\n\\n\r\nMost certainly, I have enjoyed the series significantly, thereby rating it an impressive 9/10. For those who are still confined within Kami's world, I would definitely recommend to fill in the gaps by reading the manga - there are many more conquest arcs, and the new saga also offers an impressive new world to discover!\\n\\n\r\nThank you very much for having time to read my first review! While it may not offer much, I take pride in helping others, while improving my own abilities in reviewing!",
            "date": "2014-01-13T21:03:00+00:00",
            "helpful_count": 10,
            "mal_id": 128697,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/XenonFactor",
                "username": "XenonFactor"
            },
            "url": "https://myanimelist.net/reviews.php?id=128697"
        },
        {
            "content": "An average anime that looks like a work of art.\r\nRoutes games and kisses? Perfect!\r\nThe construction of characters, especially Keima, is really amazing. An anti-social character, he becomes a god to the characters around him.\r\nEach episode depicts how evolution character happens at different times.\r\nThe fights may be through tedious, but forget the struggles with the beautiful music backgrounds.\r\nMusical backgrounds? We should call the work of musical arts. The Oratorio of The World God Only Knows leaves his very gentle soul.\r\nThe character design is also good. The traits are not that thing \"Ufotable\" but leave the well fluid and light scenes.\r\nAnyway, the anime deserves note 9, inmy opinion.\\n\\n\r\nIf there was a next season, I would watch for sure! And would recommend to friends!",
            "date": "2015-06-21T04:48:00+00:00",
            "helpful_count": 9,
            "mal_id": 190806,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3278127.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/erickpaini",
                "username": "erickpaini"
            },
            "url": "https://myanimelist.net/reviews.php?id=190806"
        },
        {
            "content": "I have been a fan of The World God Only Knows for a long time. Its timeless humor, likeable characters, and wonderful storyline make it incredibly enjoyable! The World God Only Knows III, however, is somewhat of a different story. What do I mean by a “different story”? Well, it all starts with the characters…\r\nCharacters: The characters in The World God Only Knows III are basically the same as the last two seasons, albeit with a couple of new characters added to the mix. These characters are cliché, cheesy, and stupendously stereotypical, yet it’s these traits that make them great. These characters have been fined-tunedto be likeable, funny, and are all-around well-done characters. The writers of The World God Only Knows III defiantly took their time to make these characters a joy to watch. They’re not free from their own problems by any means though. The main problem with some of the characters is the lack of the latterly mentioned “fine-tuning”. More specifically, it’s the characters that felt abruptly thrown into the story to further advance the plot.  The writers of The World God Only Knows III have enough confidence that all the viewers will have read the manga. Although this is true for most of the main anime community, most (including myself), have not even touched one of the manga volumes! Thus, it feels as if you haven’t had enough to get to know many of the characters essential to the plot. For instance, Terni Yukawa only makes a cameo in The World God Only Knows II, yet viewers are expected to know and care about this character with little to no introduction. Granted, the writers do try to the best of their abilities to try to make you care for these characters. For some, this is fine, but for others it seems a little strange and (dare a say it) lazy. Sadly, there is yet more oddities in the characters, namely Keima Katsuragi (the main protagonist). He is known for his famous quote “My life only needs the girls from games”. This logic is fundamental to the character and gives him his charm and wit. However, during the final episodes, he seems to break away from that essential character trait so the writers can make him seem a little more “normal” and like he has a little good inside him. This has good intention, but in the end it makes the character somewhat of a hypocrite. Other than the aforementioned problems, The World God Only Knows III still succeeds with the main part of its characters, but it’s not as great a success as it could be.\\n\\n\r\nStory: The story of The World God Only Knows III tries to be stand-out from the previous two. Instead of revolving around Keima trying to conquer various girls to rid them of “loose souls”, it adds (as the name implies) a goddess element to the mix. This differs in the way that each girl holds a goddess, instead of a loose soul, that needs to be taken out of them. The purpose of this is to keep “ancient hell” from being released onto the world. This is a way for this season to be stand-out from the last two, while still keeping that romantic element that fans of The World God Only Knows enjoy. This move is very well done in my opinion. It keeps the story from getting dull and boring and takes a risk (albeit, a small one) that keeps the viewer’s attention. Yet, it still has its pitfalls. Like I previously mentioned, some characters are suddenly placed in the story with only a quick, 5 second flashback that feels somewhat lazy. I often found myself wanting to see how Keima conquered a certain girl, instead of focusing on what was happening in the episode. With such a great character design for every person, it’s a shame they were so rushed. Furthermore, I also felt that there was too much information given in a short span of time. History lessons of hell’s past and important character details are so rushed that some might blurt out “Who, what, where, when?!”. This vast amount of information could have had a much greater impact if they had taken it a little slower. All-in-all, it’s a nice story that gets points for it originality and risk-taking. Yet (as with most shows), has its own set of pitfalls if only because the last two seasons were so great.\\n\\n\r\nSoundtrack: Look up “mind blown gif” in Google, and you’ll get an idea of how amazing this OST sounds. With its romantic orchestral style, it’s placed at just the right moments throughout the show. It’s almost blissful in its sound. Yet, there are problems. Instead of a completely new OST, The World God Only Knows III recycles songs from the first and second seasons. Although the songs are blissful at first, they got somewhat, monotonous. Even though the soundtrack is great, some might wish for something a little bit more original to this particular season.\\n\\n\r\nArt: Again, “mind blown gif”, Google. Except this time, I can’t find a single problem with the art.  It beauty is prevalent everywhere you look. There was not one time I ever questioned the art in The World God Only Knows III. It’s crisp, well drawn, and is nothing less than pure eye candy. Characters look consistent, and backgrounds never fail to impress. Although the art doesn’t take any risks, The World God Only Knows III’s art shows that if you can do a classic well, you don’t need to take risks for it to be great.\\n\\n\r\nConclusion: The World God Only Knows III impresses not just with its story and characters, but also with its art and soundtrack. It has its annoyances, but when you look at the bigger picture, you find an enjoyable and worthy addition to the vast world of anime. I give The World God Only Knows III an 8 out of 10\\n",
            "date": "2013-09-23T21:31:00+00:00",
            "helpful_count": 8,
            "mal_id": 114035,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2945693.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Multisupermono",
                "username": "Multisupermono"
            },
            "url": "https://myanimelist.net/reviews.php?id=114035"
        },
        {
            "content": "Story: 6\r\nThe story was a lot more confusing than the first and second seasons because although it was loyal to the manga, that meant it had to skip a lot of chapters and that means we have a lot of random things suddenly appearing, confusing the viewers. Even though the Tenri Arc ended up being an OVA, the stories of the other goddesses were basically a few seconds, and that was only the kiss scenes.\r\nThe last few episodes centered around Ayumi and Chihiro were better. It was well developed and a little heart-breaking when Chihiro was very much manipulated. Unlike the other ones, it hadmajor bumps and stops which makes it even more thrilling as Keima was working in a time limit\\n\\n\r\nCharacters: 6\\n\r\nKeima has indeed changed drastically from the start of the anime, from an otamegane who only cares about his games and PFP, to a hero who is actually concentrated on saving the world, instead of rejecting reality as a \"crappy game\"\\n\\n\r\nI personally didn't really like Chihiro because of my little grudge from the second season where she just jumps from boy to boy. This time, she's willing to help out even if it means watching the one she likes try and earn the hearts of others, or helping even though she doesn't really know what's going on, only that conquering the girls are important.\\n\\n\r\nThe goddesses weren't really THAT important, despite this being the goddess arc. The only ones with actual events were Kanon (SPOILER: when she got stabbed) and Tenri. The others were basically: get conquered, then go home and hide yourself until we need you. The other goddesses were also pretty one-sided, there was hardly any character development on them, probably because they didn't get a lot of screen time after they got conquered. The last few episodes were instead focused on Ayumi and Chihiro, and it certainly is satisfying when they FINALLY kiss after events that make you go \"JUST KISS ALREADY\"\\n\\n\r\nEnjoyment: 8\\n\r\nEven with all its flaws and such, the comedy is still as good as ever, and watching Keima getting beat up for various reasons is still hilarious, old as it may be. Some episodes are definitely memorable and worth rewatching for the hilarity, though after the ride you might think \"eh, it wasn't that good\"; the anime loses its touch after a while.\\n\\n\r\nOverall: 7\\n\r\nNot the best season from this anime, and I've watched better animes than this. It was probably because of the confusion of the story (i.e. adding in characters at the last second) that dragged it down for me. \\n\r\nSorry, but S1>S2>S3\\n\\n\r\nNo comments on Art and Sound",
            "date": "2014-07-12T22:45:00+00:00",
            "helpful_count": 7,
            "mal_id": 151765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3877331.jpg",
                "scores": {
                    "animation": 0,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Heatherfall",
                "username": "Heatherfall"
            },
            "url": "https://myanimelist.net/reviews.php?id=151765"
        },
        {
            "content": "In an age where Genre,Premise and Tropes define anime.TWGOK shows that great original storytelling could still exist.\r\nTWGOK could have been a mindless moe anime.It could have been one of those otakuism stories like Welcome to the NHK or Watamote to appeal to otaku relatability.It could have been \"Dark and Edgey\" for the sake of appealing to a superficial undestanding of maturity.\r\nAnime these days have become this giant pandering fest,instead of doing what an anime i feel ought to be doing,drawing people in with their own stories.\r\nTWGOK was an anime that did not follow trends,what started as a deconstruction of the harem genre with a themeof ideals versus reality,finally started to give a storyline that I would call an anime classic.\\n\\n\r\nThis show is the standard for character development.So many charcters meaningfully grow and change over the course of the story,we get to really see this in this arc.\\n\\n\r\nKudos to Yui,who becae her own prince instead of being a traditional girl.For Shiori, who could only speak in moe noises could finally speak properly wrote the story only she could tell.Kudos to Haqua, the book-smart girl the pride of new hell.I could go on.....\\n\\n\r\nThey may based on archetypes, but they have 3d depth and perssonality.\\n\\n\r\nEven  rare and tame by even battle anime/gundam standards, fanservice scenes is made useful to the storyline through keima.I admit that is unique.\\n\\n\r\nKudos to the Theme of twgok being true to yourself and having the courage to face reality.A not so black and white theme, considering that these girls were not \"purified\" to be normal.\\n\\n\r\nAh yes the polt,a plot that is not solely understood by the premise.Keima has to go and revive the Goddesses.keeping with what we already know, but bringing enough originality as well.Twgok is very logically consistent, things have a reason to happen, it could keep up even with the most serious stories that I have read.\\n\\n\r\nA \"save the world\" premise but an arc that is mainly focused on Keima and his acting.now he no longer uses his knowlege as readily and started to use his experiences with reality to great effect.\\n\\n\r\nMaturity is not about just death and haviing an adult premise,it is about responsibility and how you act.Unilkie other anime where they making killers look cool,inserting the \"Senin\" genre tag, and having the protagonist to always do the perfectly moral decision,actions have meangingful consequences, the protagonist had to make an ugly move on a certain girl in a bid to protect her, he also has to push forward even when it seems hopless,and he never took the glory and even let his harem do what they can do to help him out.He knows when to STOP.\\n\\n\r\nThe arc showed how  keima has turned from self indulgent to being a selfess hero.\\n\\n\r\nA certain memorable scene showed how he is coming to terms with reality,not as an otaku but as a person.\\n\\n\r\nI have to give kudos to  vintage,they could have been half hearted harem villans.I love how hell is an actual sociecty and not just that \"place of evil\" with a political factions of traditional vs new,not simply good or bad.Vintage may be great at doing thair job using logic and tatics were fooled to be clearly set up by their bosses...\\n\\n\r\nThe ending scene is it really back to square one or.....\\n\\n\r\nI wish they had the ova's for the conquests though,shame really, and there are things to resolved though after this.So I would not  give this a 10/10 yet even though its quality is there.\\n",
            "date": "2013-09-26T19:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 114371,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1998768.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/genesic123",
                "username": "genesic123"
            },
            "url": "https://myanimelist.net/reviews.php?id=114371"
        },
        {
            "content": "The capturing god returns in Kami nomi zo Shiru Sekai : Megami-hen. This anime, without fail, manages to improve with each new release by carefully developing the parts that were lagging in previous seasons as well as sprinkling some new content on top of an already near-perfect plot. Megami-hen, so far, is the pinnacle of this anime's success. \r\nKeima returns in this season to continue his conquest of lose souls that reside within girl's hearts but due to suddenly changing circumstances his pursuit changes from aforementioned loose souls to goddesses, advancing this anime's already divine tone. As far as plot progression goes, Tenri-hen goes ballistic.The speed of progression is intense, especially during the second half of this 12 episode season. Hordes of new plot devices are introduced to the viewer in each new episode. However, the anime still manages to connect all the bits and pieces of information into a coherent story that eventually makes perfect sense. \\n\\n\r\nSome characters experience major development and some are kind of left out. First and foremost, Keima Katsuragi. In the previous seasons he had to rely on his theoretical knowledge gained from playing dating sims and apply it to real world situations. This season however brings in much more realism to the process of \"capturing\" by adding a lot more random events and variables that Keima simply can't account for, such as girls approaching him first, triggering \"flags\" on their own etc. In light of this fact Keima has to improvise most of the time and taking into account his lack of practical experience with real life women, his actions often produce hilarious results. \\n\\n\r\nFans of Chihiro will be happy as she receives a lot of screen time and development. The anime deepens the link between her and Keima and gives plenty of surprises in the second half of the season as both characters are forced to look at the big picture, rather than just their own worlds they've been living in for the past 2 seasons. Both characters are deeply affected by this transition. \\n\\n\r\nHaqua and Elsie essentially switch places as the former becomes Keima's partner for this season. There are plenty of other characters from Hell and Heaven alike that return for this season and while their development levels vary, Haqua becomes a much more solid character as she interacts with the rest of the cast in much the same way Elsie did. And this, is pretty much the only problem with the cast of  Megami-Hen - Elsie's involvement in the show, for this season, is greatly diminished. Granted, she does appear more during the second half but never really makes any sort of impact on the plot and feels more like a background character.\\n\\n\r\nMoving on to art and sound, both of those components stay pretty much the same and inherit the same characteristics from previous seasons. The art stays at a near flawless level, precise and crisp. The static objects, the characters and all effects have been drawn with attention and care. \\n\\n\r\nThe music itself, some of it new, some of it taken from previous seasons manages to complete the viewing experience. The voice acting is as always authentic and engaging. \\n\\n\r\nEnjoyment? Hell yes (if you pardon the pun?). I have enjoyed this season immensely and I'm sure a lot of other 'Kami nomi zo Shiru Sekai' fans and watchers alike did. This anime manages to do all the right things to pull off successful sequels. Character progression, new plot devices and smartly executed re-introduction of the characters are some of the things that this season did with near-perfection. The humour is great and easy to understand, the drama's right and every episode engages the viewer not only emotionally but also intellectually which is something I've always liked about this show. It makes you think and that's always a good thing. Who knows? Maybe one day I'll use Keima's analogies to capture the hearts of a few women myself (Though I'd likely just end up embarrassing myself).\\n\\n\r\nAll in all, 'Megami-hen' is a great continuation of this show. 9 points from me. \\n",
            "date": "2013-10-31T14:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 118887,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=118887"
        },
        {
            "content": "First and foremost, this anime is a lot of fun. I actually decided to watch it because I am a big fan of Hayami Saori (seiyuu) and so after listening to one of her songs from this series, I decided to give it a shot. As a side note, her co main from Teen Romantic Comedy (Touyama Nao) is also in this series. Anyway from that basis I came to the series with no idea what to expect having not read the manga either.\r\nTo summarise the story, The World God Only Knows (TWGOK) is a series about a gamer who excels at dating sims. Heis conscripted to then capture 'loose spirits' who reside in the hollow hearts of various girls which he must then get to fall in love with him to free them. He is assigned an assistant 'demon' who shares the same mission. This leads to encounters with various girls who once they have kissed him forget all about him - until a twist revealed in this the final season of the anime.\\n\\n\r\nNow that story seems pretty generic but does provide a good entry into the harem romantic comedy genre of anime. The good thing about this series is that it is not ecchi, so only minimal fanservice if any, which I find is a copout to good writing. I enjoyed the interaction between the characters and certainly the premise of the lead character Keima, preferring games to real life touches a chord I think many of us can relate to. \\n\\n\r\nI loved the artwork and character design. All the girls have their distinctive looks and the story in earlier seasons even pokes fun at how all anime girls look the same. \\n\\n\r\nThe music and sound is great. As I mentioned I came to this series because of the song With you - by Hayami Saori. I have to say that I liked all the music sung by the various seiyuus but obviously it depends on your taste. \\n\\n\r\nFinally my criticisms of the series. My only gripe really is that the main character did not show enough growth along the journey. The final 3 episodes could have really nailed the emotions if only they could have written in a substantial ending with consequences. As it is, the story lacked the final emotional tension because you feel that the main character could do no wrong or that no matter what, he could not lose in any way. I would highlight that Clannad After Story, in my mind made that leap in the last 6 episodes to push it into absolute masterpiece territory simply because it was not afraid to risk everything to get there. Unfortunately, TWGOK pulled back at the end, just when the stakes were being raised, it was afraid to show some passion or to show that Keima understood what was at stake. He was never invested in his relationships so in that sense, he did not seem to have learnt from his experiences with those characters.\\n\\n\r\nTWGOK is a great introduction harem anime. It's funny, it's heartfelt, beautifully drawn and once you start you want to keep going. I personally enjoyed the music and certainly the voice actors are brilliant, I loved them all. In the end however, it's lack of emotional suspense and failure of the lead character to really grow or to show some maturity left me feeling hollow. \\n\\n\r\nPlease like this review if you agree with me! Send me any comments - I'm always keen to hear from other anime lovers!",
            "date": "2015-11-01T00:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 202364,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4629270.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/theadrin",
                "username": "theadrin"
            },
            "url": "https://myanimelist.net/reviews.php?id=202364"
        },
        {
            "content": "I feel the Kami nomi zo Shiru Sekai: Megami-hen aka The World God only Knows (TWGOK) really needs two separate reviews.  One for people who have already seen at least part of the previous seasons and one for someone who has never seen any.\r\nIf you've never seen TWGOK, your missing out.  Have you ever been watching an anime where you were thinking \"just kiss her dammit!\"  Have you ever just wanted to reach into the screen and shove the two awkward love birds together?  Well, this show is quite satisfying on that level.  In fact, if anything, there might justbe a little too much smooching.  The series has it's flaws, but it is enjoyable and generally light hearted for the first 24 episodes.  The stories are good for the most part.  The art and sound are also good, if not groundbreaking.  Character development is done pretty well.  Keima's transformation from game geek that has never touched a real girl in his life to full blown cassanova is shown a little bit in each romantic arc. If you haven't seen the first two seasons, you can do one of two things.\\n\\n\r\n1.  You can start at the beginning and watch all 24 episodes of season 1 & 2, plus the Tenri-hen OVA.\\n\\n\r\n2. Read the manga up to the beginning of the goddess stories.\\n\\n\\n\r\nIf you saw the first two seasons and loved them, then you should have already watched this.  If you saw the first two seasons and thought it was just OK, you need to watch this.  Episodic shows can get old fast and if this was just another 12 episodes of conquest after conquest, it could easily have fallen flat.  What it does instead is fix nearly everything that I was less than enthused about in the previous seasons.  The separate arcs are gone, replaced by an engaging and exciting story that lasts for all 12 episodes.  There are no throw away episodes where Keima spends the entire episode gaming.  Did you think that the show would be better with some emotional depth?  It's here.  Season 3 is worth your time, even if you didn't love the first two seasons.\\n\\n\r\nThe following scores are for the third season:\\n\r\nThe Story is probably the shows weakest link only because there is a glossing over of important material that was skipped in the jump from season 2 to 3.  Watching the Tenri OVA alleviates some of this, but you still spend some time early in the series wondering what is going on.  Once it get's rolling, however, the plot really soars.  STORY:  8\\n\\n\r\nThe art and sound is on par with the previous seasons, which is to say it is great.  Everything is well done, but I doubt you are going to be buying posters of the artwork or mp3s of the music.  ART/MUSIC:  9/9\\n\\n\r\nThe characters and there development are what make this show awesome.  It's really hard to explain this without spoilers, but the emotional depth that this season brings to the table is as good as I have ever seen in an anime.  The characters are very relatable and will take you along on their emotional rollercoaster ride.   CHARACTERS:  10\\n\\n\r\nI thoroughly enjoyed this anime.  I have limited the number of 10s that I give out or this show would probably get one.  You will laugh and most likely cry and you had better be prepared for a marathon session as you near the end.  This is anime at it's finest.  ENJOYMENT/OVERALL:  10/9\\n",
            "date": "2013-09-24T08:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 114095,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3066355.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Well_Spoken_Man",
                "username": "Well_Spoken_Man"
            },
            "url": "https://myanimelist.net/reviews.php?id=114095"
        },
        {
            "content": "Review for Kami Tomi 3\r\n=============================================\r\nI have already posted a review for the first and second season, if you are reading this you are probably wondering if you want to continue this series or not.\r\nFirst of all I would recommending watching the following OVA's in order:\r\nKami nomi zo Shiru Sekai: Flag 0\r\nKami nomi zo Shiru Sekai: 4-nin to Idol\r\nKami nomi zo Shiru Sekai: Tenri-hen\r\nMagical☆Star Kanon 100%\r\nTo prepare you for Season 3, I hope you find my review helpful\r\n=============================================\r\nSummary of the Extended Review down below :\r\nStory : Beginning may be confusing, A more serious season compared to the first two, Great Great Ending, \r\nArt :Same as thefirst two season, Well done, No unique style though this is not a problem\\n\\n\r\nSound :Voices are done well (Japanese Dub) Sound Effects great\\n\\n\r\nCharacter : We finally get to see our main character and his true emotions, \\n\\n\r\nEnjoyment : Lack of Ecchi Scenes (Family Friendly), Confused at first though the more serious third season was a great way to end things\\n\\n\\n\r\n=============================================\\n\r\nFull Review\\n\\n\r\nStory : Like what I said about the first season not your normal harem/RomCom anime, Expected that your already watched the first and second season , The beginning of this season may still be confusing even after watching the OVA's you will noticed that some parts of the story has been skipped to reach this arc of the story, I do like how this season was more serious and how the main character's emotions were brought out in such a unique way, I personally loved how they ended this season and this is the first anime that has ever made me want to read the continuation manga chapters (Chapter 189 is the ending of this season), Hoping for a season 4,\\n\r\nPersonally a 9 because the start of the season kinda seems to leave the viewers a little confused unsure what we have missed and that actually cause me to put this season aside for awhile, Otherwise the rest of the season smooths out nicely,  \\n\\n\r\nArt : Same art style as the first and second season, consistent and there is no problem with that, The art style may be seen as a standard quality for anime's \\n\r\n8/10 like i said before would reserve 10/10 for anime's with unique art styles that works.\\n\\n\r\nSound : (Japanese Dub) Good work done by the voice actors, the characters sound like they should, (the voice fits the look of the character)\\n\r\nThe sound effects are nothing special but they work. 10/10\\n\r\n(May re-watch everything through again in the english dub to rate it, psshh kinda want to watch it again.)\\n\\n\r\nCharacter : Compared to the first and the second season we learn a lot more about our main characters and in this season it finally allows the viewers to connect to them, again like the second season we learn more about our main characters through the events that take place rather than back-story, to me this is great. 10/10 I wouldn't change anything about it.\\n\\n\r\nEnjoyment : After watching the first and second season I was really looking forward to watching this season, The first episode really left me confused and like I said before it led me to drop watching this season for a week or two, Though as the season goes on it got a lot more serious and I have to say I really enjoyed how the story was went, Personally I loved how the ending was done and it wouldn't need a 4th season, (Even though I kinda want one)\\n\\n\r\nOverall : Would recommend to all my friends who watch anime, Would recommend them to watch it immediately, The first anime that made me want to read the manga. 9/10 This has been a great season and it personally left an impact on how I will watch RomCom's it really was unique (to me). Will always believe that there will be an anime that would top this and missing episodes in between of season 2 and 3 may have cause it to lose its 10/10 for me.",
            "date": "2015-04-12T04:29:00+00:00",
            "helpful_count": 5,
            "mal_id": 185445,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4478941.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DjKagamine",
                "username": "DjKagamine"
            },
            "url": "https://myanimelist.net/reviews.php?id=185445"
        }
    ],
    [
        {
            "content": "It has been a remarkable ride following this series for so long and looking back at how The World God Only Knows has impacted the anime community, it’s not far off to say that it changed harem anime as we know it. It shows that you don’t need to show girls in suggestive situations all the time to provoke entertainment or emotion into your harem. Sometimes all you really need is genuine emotion and intelligent comedic writing to create a meaningful love story. Or in this case multiple love stories.\r\nNow the story has focused on the Goddess Arc of the manga, which a lot ofpeople have criticized this aspect because it skipped a large portion of the manga to get to this point. Which brings up the point that should always be said when judging a show based on source material: Always judge a show based on its own merits rather than how well it follows the source material. What’s more important is how it keeps telling the story in a concise and detailed matter that is true to the spirit of the manga rather than how specific scenes followed the manga well. In Megami-hen’s case, the pacing and how they develop the story, while not necessarily perfect in some areas, compliment each other exceptionally well in terms of emotion and clarity. While it does jump around in certain areas a little too fast, especially in the later episodes, it doesn’t deter the show from having an emotional impact whenever it is on-screen.\\n\\n\r\nAs always with each passing season, the art and animation are spectacular to look at. Tamaki Wakaki has a creative eye when he draws his manga and to have his drawings come to life in animation is both a perfect representation of them and an adorable treat to watch with great easy-on-the-eye animation. The characters look lovely with the colorful backgrounds that compliment each other with high excellence and creativity in a limited scope of the Moe and Slice of Life genre.\\n\\n\r\nOne thing that I’ve always admired The World God Only Knows, both the manga and anime versions, is how it can pack in so much depth and development into every character that you come across in just a short amount of time. In this season, the characters are now fully developed after two seasons, and after all this time, not a single inch of charm is lost in each one of them. Keima is still the cynical but often hilarious protagonist that we’ve all grown to love but also kind of hate at the same time. His sense of courage and intelligence make for an enticing protagonist and a larger than life character in general. It is now at this point in the story where we finally see a bit of humanity in his role. It is portrayed with immaculate maturity and pure excellence that makes Keima a three-dimensional character rather than this one-sided gamer otaku that he is often depicted most of the time.\\n\\n\r\nThe girls, once again, are as cute and charming as ever. Now that Elsie has replaced Kanon for Keima to find the other Goddesses in the girls he’s conquered, Haqua is now Keima’s buddy, and man do these two make for such a hilarious duo of detective and partner. The only slight problem I do have with this is that they don’t really go far enough in showing us Haqua and Keima’s relationship develop further as they go through these conquests. Despite this, they do a great job of adding a lot of chemistry between our two main leads regardless of the amount of screen-time they get.\\n\\n\r\nAs for the rest of the cast, not all of the girls return from previous seasons. Only a select few can have the honor of getting the most out of the story. For what it is, the girls and the comedy that they bring on the table can still be quite enjoyable to anyone who appreciates great parody in their spare time. One, in particular, is Shiori, who is trying to write a story of her own that she got inspired by her conquest by Keima. What results is them bickering by writing to each other with them together that create a funny parody of how people tend to criticize how people typically write a story in context with the show.\\n\\n\r\nNow we turn to the girl who has the most significant presence in the season: Chihiro. Her personal development with Keima couldn’t be any more heartwarming than any anime character relationship story in recent years. Heartbreaking and sentimental as it might be, there is still this aura within Keima that completely changes him and morphs him into a new kind of way that we’ve never seen him as before. It is times like this that make The World God Only Knows a very excellent harem show. It treats the subject matter in a parodied manner but at the same time it is able to emote these heartwarming scenes that not only work in a writing standpoint but also in a pacing one.\\n\\n\r\nMusic in The World God Only Knows have always tread in the territory of J-Pop, what with Kanon’s songs in Season one and other character songs in the past. The songs in Season 3 are just as good as previous seasons even though they don’t necessarily step on any new ground in terms of instrumentation. The opening to this is oddly enough sung in English by Saori Hayami, who does it very well! Her pronunciation of the English language is spot on without many awkward attempts at sounding both Japanese and English or Engrish as it is often called in slang term. Unfortunately, I felt the ED was mostly forgettable after repeated listening. All singers do their jobs well, but other than the voices I found myself often skipping them most of the time.\\n\\n\r\nAs for voice acting, which is often the bright spot in the series, the seiyuus all do a fantastic job in their roles. Hiro Shimono is as charismatic as ever as Keima, the always beautiful Saori Hayami does a tremendous performance as Haqua, and a surprise performance by Kana Asumi as Chihiro who wholly owns her role through the latter half of the show. Though it could’ve shown more of Kanae Itou as Elsie; When you have her on a show, you want more of her sexy voice on-screen.\\n\\n\r\nThere will no doubt be a lot of debate with this season in particular. Whether you agree that watching the show and criticizing it for not following certain things correctly in the source material is a valid reason of not liking it or not, you have to set aside that in the back door and appreciate the show on its own merits. This is what all the seasons were building upon and the result was most definitely worth the wait. There are moments in the anime that will make you remember certain moments for years to come whether it was something that made you laugh with exquisite delight or cry with overall genuine emotion. For me, this one line in the show is the one that will stick with me for years after watching it: “You don’t need a reason to fall in love.” Words of wisdom by Chihiro.\\n\\n\r\nGrade: A\\n",
            "date": "2013-09-30T16:49:00+00:00",
            "helpful_count": 260,
            "mal_id": 114917,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=114917"
        },
        {
            "content": "In most harem series, we generally have the guy who seems to be oblivious to certain factors. These usually include girls who are desperate to get the guy's attention with intense rivalries, jealousy, and sometimes even includes violence. But what if that role was sort of reversed? What if the guy in a series is actually seeking the girls themselves? What if it becomes a certain type of game where the guy is the player and the girls play the roles of the conquests? Well, if there's one thing that's for sure...The World God Only Knows is one of those series where it takes theharem trope to a whole new level of experience.\\n\\n\r\nThe World God Knows III is adapted from the manga of the same name written by Wakaki Tamiki. The series continues as the third installment of the franchise but has some noticeably changes. Perhaps the most important of these changes is the fact that the anime decides to skip material from the manga. As this series covers the GODDESS ARC, some conquests left from the manga are left in unexplored territory. Therefore, if you want to get more insight on what you're missing out, give the manga a try from chapters chapters 42-55 and 66-113. (this assumes you have watched the Tenri OVA) At any rate, the series decides to go with the Goddess route and oh boy, this sure brings a new twist to Keima's life.\\n\\n\r\nBecause the series skips material, it is important to absorb most of it in the very first episode. At any rate, this series adapts the Goddess Arc and the Goddesses are the main task that Keima must deal with. The Goddesses themselves seems to be sealed into the girls that Keima conquered previously. The minor problem is that some of these girls' routes (when they were conquered before) are omitted from this adaptation. Therefore, expect some flashbacks and brief scenes that might not make sense if you're coming fresh into this series as an anime only viewer. \\n\\n\r\nThe story stretches out in a quick fashion as even in the beginning with the conflict immediately comes to fruition with the introduction of an new enemy. Part of what makes this Goddess Arc exciting is because Keima is put on the stress of reconquering some of the girls' hearts but at the same time also with a friend's life in danger. It obviously puts Keima in the driver seat of a stressful player. This is evidenced through the seriousness that he takes the situation at hand as his obsessive habit of playing games and dealing with 2D girls is significantly reduced. Furthermore, Keima feels guilty at himself for getting others involved and seems to a bear a sort of responsibility of some of the events in this series. Indeed, the Goddess Arc takes this series to a whole new level with new surprising challenges. There's a blend now between fiction and reality. Previously, Keima only wanted to conquer girls in order to get it over with and return to normal life. Now, he is fighting for someone else other than himself. Now that my friends  deserves some respect. \\n\\n\r\nMost of the main and supporting characters makes their appearances in this arc. Some gets more screen time than others while the supporting characters get their spotlights in a set up of 'conquer of the week' format. Keima's mind at the same time is put to significantly use because what's at stake. It still revolves around conquering girls though but this time for the sake of drawing goddesses out of them. It's a hunt where Keima has to play the role of a player. Furthermore, it's racing the clock to save a friend. By the typical TWOGK concept as previously seen, Keima often relies on strategies he gets from his experience off of the games he plays. This involves triggering flags, making the perfect date plans, or formulating strategies to respond accordingly to situations. Luckily, the boy also gets a little help as well.\\n\\n\r\nSimply put though, we have two girls or rather supernatural beings who serves as guides to Keima. If you guessed Elsie and Haqua, then you're right. In particular though, Haqua's relationship with Keima is one of the more interesting factors to examine. It seems that her character has become more and more prone to jealousy especially in situations where it involves dealing with the Goddesses. Perhaps the girl now has feelings of her own based on some interesting reactions to his mission. In particular one moment, she blunts out that Keima is needed by her. It does gets more frustrating at some points though especially since Keima is so focused on his task that he fails to notice these certain triggers from Haqua. At the same time, Keima wants to make triggers of his own through whatever means. These usually have various results but viewers can be satisfied that Keima is more of the level headed protagonists of this harem series. \\n\\n\r\nAs a harem series goes, the show still maintains its themes well. The girls are diverse ranging from a shy library girl, to an idol, a tomboy, an ice queen, or the rich type. It offers a multitude of conquests in a variety so viewers gets a new experience of that TWOGK feel again. The addition is the introduction of the Goddesses (also known as the Jupiter Sisters) Based on the names of the Roman mythology, they are some of the key players of this series. It's also important to note that each of them resides in a different girl and all of them has a different ability. Their personalities seems to also reflect on their hosts as well which makes it much more comfortable for viewers to get to know them better, especially for those who have read the manga. Whatever the case, the Goddess Arc takes a full swing at this new concept and makes it that much more exciting once again. (well maybe not so much fun for Keima)\\n\\n\r\nFor the adaptation, there are certain elements left out. I won't compare this to the manga but some scenes should have been there for a more pleasurable experience. As being a harem show, it doesn't avoid fan service either that either results in misunderstandings and some skin being shown. Luckily though, Keima is the main male protagonist and not the type that prone out like a typical dull kid  from a harem series. When misunderstanding happens, he tries to take advantage of it and makes it into a strategy. In fact, Keima still is confident and calculating which makes him independent and even admirable. \\n\\n\r\nThere's also certain elements of this series that makes it stand out with the new twists such as the new enemy. However at the same time, we see comedy packaged with hilarious dialogues, misunderstandings, and awkward moments. These usually involves Keima in a situation where he is uncomfortable with or something that he didn't anticipate as part of his plan. At other times, there's the comedy that seems to be a bit forced and repetitive. Another factor that might of prevent a better success for this series is the way the tension of the romance aspect seems to feel somewhat weaker. This could be the result of the rushed sequences of a series that is condensed into only a mere 13 episodes. But what's more than that though could be a lack of new transition as in new girls/targets. Rather than introducing any new girls for conquest, some of the conquests feels like deja vu in a way that might once again seem a bit repetitive. Additionally, some of Keima's choices might seem controversial for viewers especially for those has their favorite girls already made up in their minds.\\n\\n\r\nVisual wise, the series makes both good usage of coloring and style. Manglobe again is involved with the production so expect a similar if not the same format of the designs. The characters themselves are designed to look different and reflect on their personalities. For instance, Yui is designed to look like a tomboy while Kanon has that style of an idol. Keima of course stands out as the main protagonist as a “God in one world, otaku in another”. \\n\\n\r\nThe OP song \"God only knows -Secrets of the Goddess-\" by Oratorio The World God Only Knows reflects on the nature of the arc with the Goddess being the highlights. There are also montages of some of girls are shown along with possible foreshadowing. The voice actors and actresses does a great job in their roles. Keima's calculating voice is reflected in his style while most of the supporting characters fits in their own. Some of the voices of the girls also matures their personalities well. In contrast though, the OST seems bit mediocre and barely noticeable. \\n\\n\r\nFor a harem series, this sure takes its themes to a different style. Season 3 of TWGOK deals with the Goddess Arc so expect new surprises and a little more emotions here and there. At the same time, there's the fun and nostalgia bought back from the previous series. Just be aware that this series skips some of the manga material involving certain routes. After all, it adapts the Goddess Arc. Therefore, it's best to re-read some of the chapters that were never adapted. (maybe will be in the future in OVAs?). I hope you enjoy this series though just like the previous ones if you're still a fan of TWGOK. It's time to conquer the 3D world once again!",
            "date": "2013-09-23T12:45:00+00:00",
            "helpful_count": 110,
            "mal_id": 113943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=113943"
        },
        {
            "content": "When was the last time you saw a sequel to an anime and thought to yourself, \"this was say better than the previous seasons.\" Rarely. Am I correct? Well with the third instalment of to Kami nomi zo Shiru Sekai franchise, I can promise you that this instalment surpasses the previous two.\r\nThe story of this season continues in a similar fashion to the other two, however in this season Keima has to reconquer his former heroines from the past. Unlike the other two seasons, by the end of this anime we get to see hints that Keima will develop a lot as a character, butstill remain the same Keima we know and love. \\n\\n\r\nThe art of the anime is very similar to the other two seasons. Nothing really changes with each of the characters in terms of design, and art. The art remains phenomenal, I very much liked how there's a great amount of detail in each scene, you can pause at anytime during a scene and see the level of detail within the frame, definitely makes me appreciate this anime more. In terms of sound, everything seems fine. The voices of the characters seem well suited for each of the personalities of each one of them. Background music was appropriate was appropriate to each specific scene during the anime. The OST is quite charming itself, although it might not be a cup of tea for everyone since the sound is quite intricate.  \\n\\n\r\nNow for the characters, most of the characters remain the same, but unlike the other two seasons we definitely see character development, however it is mainly just Keima. Unfortunately Elsie is not a main character in this season, which was a little upsetting for me since I liked her as a character and her bubbly personality, but for the focus of this season, I think it was natural that she was not put in as a main character just because this season sets a different aura than the other two. In terms of Keima's development, as I said before we get small hints here and there near the end of the anime that he’s going to mature, and potentially give up his love of gaming? \\n\\n\r\nFor the enjoyment, I definitely enjoyed this season a lot more than the other two. In my opinion the first two seasons were very similar, it was just Keima going around conquering females and helping Elsie with her quests. This season it is quite fresh, similar yet different compared to the prequels, but the concept of conquering females remain, which is what the viewers and fans want when watching this anime. The only problem I had with this season was with the last Heroine, it felt very rushed and the flow of the anime just felt off at that point. Even though that was the only thing I did not like, it still wasn't enough for me to enjoy this anime.\\n\\n\r\nPersonally I’m not a big fan of harems, but this is one of the few harems that I did enjoy. Overall Kami nomi zo Shiru Sekai: Megami-hen was an excellent anime; I’d rate it as a 9 out of 10. But in order to really appreciate it you must watch the first two seasons. With that being said I would definitely recommend this anime to anyone who enjoys a good romance or comedy, but watch the first two seasons first!\\n\\n\r\nThis is first review on MAL. Please comment on my profile to give me feedback !",
            "date": "2013-11-10T19:11:00+00:00",
            "helpful_count": 86,
            "mal_id": 119905,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1463523.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Decoys",
                "username": "Decoys"
            },
            "url": "https://myanimelist.net/reviews.php?id=119905"
        },
        {
            "content": "Kami nomi zo Shiru Sekai: Megami-hen.  (Long titles FTW).  As the third installment of this series, many fans who haven't read the manga should probably be expecting what is to be expected of this series.  This review is literally after I finished the series.\r\nStory: For those of you who haven't seen or heard of this series, the world god only knows is the story of a gamer who is forced to make girls fall in love with him in order to capture loose souls, forcing them out of the girls' hearts in order to be captured.  However, the story of thisseries is similar, but very different.  The story of the Megami-hen series revolves around Keima as his usual self, capturing goddesses, not loose souls.  Because of this he must go back to his previous \"capture targets\" and figure out if they are hosting a goddess within them.  And because the whole plethora of girls is dwindled down to 6, it becomes a proper harem rather then the deconstruction that it's always been. \\n\\n\r\n Characters: Keima, as the main protagonist, is a visual novel lover.  Instead of actually giving a damn about the girls he conquers irl or in-game, his only purpose is to \"get to the ending\", which if you've played visual novels, means the girl falls in love with you.  Though his character has pretty much remained unchanged throughout the whole span of TWGOK, this season adds a twist, making him reconsider the ways he's actually treating these girls.  Next, Haqua.  Yes, I know Elsie is in this series, but she barely plays a significant role.  With her introduction to the anime in the second season, Haqua is a character from Hell and plays a very good supporting role.  Her character is fairly well rounded as she plays a significant role in capturing said goddess'.  As a tsundere, well, it's pretty obvious.  However, what makes her such a great character, is her reintroduction later in the season after disappearing for some time.  Because of this, she becomes more of a badass and becomes somewhat of a different character altogether, in a good way.  (Personally, she's my favorite character of the whole series). And finally, Chihiro.  As one of the previous capture targets in the second season, it's expected that she would play a generic role.  However, she does more then that.  As one of the only girls in this series that have an actual somewhat real personality, she is the main influence on Keima which results in him regretting what decisions he has made in the past.  Because she somewhat understands what is going on in the last few episodes, Keima's and herself get huge character development and become incredibly stand-out characters.  \\n\\n\r\nAnimation and Sound: Oh, where to begin.  The animation in TWGOK is fantastic as always, simplifying itself to a chibi whenever it wants, and creating incredibly detailed scenes whenever it wants also.  For example, closeups with Keima, and Chihiro's final scene in the series.  Because of the addition of goddesses, the animation for their wings and individual feathers were superb at the least.  Especially in the final episode.  But for the most part, the animation is well done, with a few \"skippy\" scenes here and there.  One scene in particular in the final episode where there is some, awkward instrument playing.  But in hindsight, it can be overlooked.  The sound, oh yes, another thing to be giddy about.  The soundtrack for this series is usually pretty stand-out.  This season did not disappoint.  As always, they try to put in some \"heavenly\" tones and some techno sounds whenever they do an opening, but this time, they went over the top!  The opening itself has very well done pictures and the music sounds so godly and fantastic that it is truly one of a kind.  It also has a surprising amount of english words within itself.  The ending on the other hand has a more somber feel to it.  While the pictures in the ending are practically all the same, the sound of the ending is very calm and very rewarding sounding.  It's happy, it's sad, and overall, great.  \\n\\n\r\nPersonal enjoyment: I have always loved the TWGOK series.  Ever since I started, I have never been able to leave it alone.   When I first saw the premise of this season, I was surprised how much the series switched in terms of plot.  Luckily, it was a good switch rather then a really bad one.  (SAO)  The series itself really puts the main character in situations which he's not used to, and allows much more character development which for this character, is much needed.  As a personal fan, I'm debating over if this series should get another sequel or not because, this series ends on such a note that it can actually end right here and now.  But on the other hand, there is so much more potential to be discovered and it really puts me at a standstill.  However, as a personal complaint, the last episode, sort of rushed.  The first half of the episode was fantastic and at its peak, but the second half sort of died down too fast.  All of the possible action bits and goddess magic was squeezed into a 5 minute time-frame, which is a bit of a let-down.  Nonetheless, TWGOK is one of the most well known harem animes out there, and if you are a fan like me, I would highly recommend this to you.  But know this, in order to watch this season in specific, the other 2, plus the Tenri-hen OVA's must be watched first.  It is the only way to know what exactly is going on here.",
            "date": "2013-09-23T17:34:00+00:00",
            "helpful_count": 76,
            "mal_id": 113981,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=113981"
        },
        {
            "content": "The World God Only Knows is well known for its different take on the harem genre. The main character, Keima, is out to make girls fall in love with him at first to save his own head, but later for more important reasons. It contrasted greatly with the common stereotypical harem series that had an oblivious main character with girls that were head-over-heels in love with him. However, the Goddess Arc, for which this third season is based off of, is the story arc that propelled this series from something fresh and interesting to something that really became something special. While this anime adaptation hasa few flaws, The World God Only Knows: Goddesses is mostly able to carry the manga's greatness with it, and rise to become the best TWGOK series yet.\\n\\n\r\nThis third season follows Keima as he searches to find the goddesses who are residing in the hosts of his previous conquests, and has to make them fall in love with him all over again in order to bring out their power to fight back against Vintage, a group from Hell that wishes to revive Old Hell. The story is great, with the individual conquests mostly being very well done. The humor, drama, and romance from the previous seasons are back, and make the conquests as enjoyable as ever. This arc also really brings forward the lore that has slowly been presented through the last two seasons about Hell and presents an interesting tale involving it as well. The last conquest, the Mai High Festival Arc, is especially great, as it really raises the bar with a great story that unfolds, with interesting twists, higher stakes, and hilarious and heart-wrenching moments, as well as bringing about a great climax and resolving the Vintage conflict. \\n\\n\r\nHowever, a couple of problems do arise from the way they decided to adapt this arc. For some reason they decided to adapt this arc without first adapting the remaining normal conquests in between the second and third season. They also expect you to have watched both OVAs (Tenri Arc and 2-B Pencils) beforehand. As such, it rushes the pacing on the two conquests based on girls not seen before, trying to cram in the details of the previous conquests, as well as it being a little confusing for those who haven't read the manga or seen the OVAs, although it isn't too big of a problem because most people should catch on fairly quickly. Another issue is that the amount of content they are trying to fit into 12 episodes some 80 chapters, while the previous seasons had nearly one chapter per episode. This does cause the pacing to be a little quick in the beginning, such as the prep for the Goddess arc as well as the two conquests mentioned previously. However, I do want to give props to the director Satoshi Osedo for being able to fit all this material and still make it fairly reasonably paced. Other than the issues mentioned before, this anime does very well with pacing, and did pretty well trying to work around the problems it had no control over (like the skipping of conquests). I think it is reasonable to say that it even has better pacing than the original series, which dragged on especially in some parts (the buggy game episode and Shiori's arc come to mind). Overall, these issues aren't really that big of an issue, but since I love this series so much I have to nitpick at a couple things. This issue really goes away after the Tsukiyo arc, as it doesn't even bother the Yui arc that badly, but it is there for a little while.\\n\\n\r\nThe characters are definitely one of the greatest things to come out of The World God Only Knows. Keima is awesome as always, but this series takes it even further than before. This arc really starts to develop and change his character, as the stakes are raised higher and he really starts to see the consequences of the way he goes about his conquests. He also starts to take things much more seriously, beginning to see that it's not a game anymore, most notably seen as how he is missing his iconic PFP for most of the season, and doesn't even really touch a game other than at the beginning and the very end. He starts to begin feeling the emotional consequences of the conquests on himself as well as on the girls. Besides Keima though, Haqua also receives decent development during this season as well, going from the naive, rule-abiding girl she is to a more mature and stronger leader, fighting back against Vintage. The other characters in this season are great as well, with seven of the better girls returning (or showing up for the first time) for Keima's conquests, as well as Tenri/Diana and the Hell members like Nora, Lune, and Elsie. All of them are pretty interesting and enjoyable to watch on screen. This cast of characters, alongside the star-studded voice cast, really is one of the greatest parts of this show.\\n\\n\r\nThe art of this show is pretty good but not as great as it could be. The character designs are great as always, but the animation quality doesn't always follow suit. Manglobe has never really been known for the best animation, so its expected that they aren't going to suddenly be on KyoAni level animation for this show, but it still is a little bothersome. By no means is it bad, it just isn't as great as it could have been, with a few blips in the art every once in a while. Other than that though, the art is pretty good. It's saying something when the weakest point isn't really all that weak. The music is well done as always. The soundtracks help to accent the mood in the moment, whether it be the climax of a conquest or a moment of despair. The opening is also probably one of my favorites this season, and probably ties with first season for the best TWGOK. Saori Hayami sings beautifully as always, and produces a great opening. The closing songs are pretty good as well, although not as good as the opening. \"The Memory of My First Love\" (Hajimete Koi wa Shita Kioku) is probably one of the best, as the lyrics really fit the mood of the last episode, and Saori Hayami's \"With... You...\" is a notable mention as well. Overall, the music and art of this season are pretty good, even with a few flaws.\\n\\n\r\nIf you couldn't tell, I really like this season of The World God Only Knows. Despite a few flaws, it is definitely my favorite of the three and would definitely recommend it to anyone who has seen the first two. In a way it is like The Disappearance of Haruhi Suzumiya, as you need to see the previous seasons for it to make sense, but it is the best of the them all. I enjoyed this show greatly, with a great story, humor, and characters, and it resparked my love of the series after the slow down in the manga (although it has picked up since then). Hopefully Manglobe will find some way to animate the missing conquests, but if not, so be it. This was a great season. Anyone who loves The World God Only Knows should check this show out, and for all fans, as Keima says:\\n\\n\r\n\"I Can See the Ending.\"",
            "date": "2013-09-23T18:38:00+00:00",
            "helpful_count": 18,
            "mal_id": 113991,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1479553.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Glacialis",
                "username": "Glacialis"
            },
            "url": "https://myanimelist.net/reviews.php?id=113991"
        },
        {
            "content": "THIS REVIEW MAY CONTAIN SPOILERS.\r\nThe World God Only knows, or KamiNomi for short, a series that has been so successful that it has achieved its third season with the subtitle ''Goddess Arc''. An arc featuring a little of complexity and little change in the routine we thought up of Keima. Making a transition of a romantic comedy harem into a really deep drama romantic anime. So let's see what it has to offer.\r\nSTORY -9-\r\nThe story continues after the OVAs of Tenri were finished. At first it was believed that the story will continue with the conquest of  another girls but that is notthe case. The story at the beginning it shows us a time skip. A time skip of the other girls Keima captured after Tenri and even before Tenri. Girls like an astronomer, a rich girl, a ramen server, a big sister and many other girls that he gave the best to release them from their pain. \\n\\n\r\nBut in this season all that changes. Now Keima has to reconquer girls that contains a great power, a goddess in them, so they can stop this group call Vintage from making a new Hell in the Earth. \\n\\n\r\nThe change of the plot in this season is great, because it makes us look back at Keima's past conquest and not just forget about them. Now they add a little more importance to the story. Because if you see last 2 seasons it was only about Keima and Elsie's adventures and capturing the spirits. But in this season we get more action, more drama, more confessions and seriousness that not many ''harem'' type shows can offer. Making this season one that stands out the most. The conquest of the girls are funny, dramatic and so sincere giving you the feeling that they really know how the love feels like Also I like to add the fact that this season did not have any filler episodes during its execution like in the last 2 seasons. But I got say that this season gave many viewers the nostalgic touch of knowing how the heroines we loved and suffered were back in action.\\n\\n\r\nThe only problem was how it was presented. I'm not saying that it was bad that they adapt this arc but the problem is for the newcomers that they have to read the manga to undestand and to attach to some girls which arcs that were not animated. I feel that if they have let out some of the episodes like the one of the glitch, when Elsie's decide to live with Keima and the last episodes of every season they could at least have tried to do animate the important 2 girls in this seasons. But the rest I can say that it was well written.\\n\\n\r\nART -9-\\n\\n\r\nIt is very beautiful. The characters are well designed. They don't look neither too cute nor too bad. It has a standard point that they look very delightful to the eye with impressive use of bright colors and detail textures in their body. Mainly in the trace of their faces, eyes and hair color. They just look awesome and very well drawn.\\n\\n\r\nSOUND -9-\\n\\n\r\nThe voice actors execute very well their job. They all sound very natural. They don't use any kind of pitch to make their characters sound more adorable. No they sound very human like. Mainly when the drama and confessions start to rose.\\n\\n\r\nThe Opening is one of the best. I love how the opening for the series has this mix of electronic vibe, oratorio and english lyrics. They combine perfectly the context of the plot and it represents very well Keima's character. Also the ending is one of my favorites and that is a big shock. Mainly because I dislike songs with the main characters sing but it is amazing how this one did it. Mainly Shiori's version which represents very well her character and not forgetting the last song used during the Mai Festival arc. All of them were great compositions.\\n\\n\r\nFinally the OST. KamiNomi has one of the most memorable osts. Showing action, drama and suspense when it had to. One of the main instrumental pieces is when he conquers the girls. That piano sound it's just beautiful to the ear and very adorable.\\n\\n\r\nCHARACTER -9-\\n\\n\r\nThe characters in this series are great. Each one have their own personalities. They may look cliche but they are very well done. Their characterization are well portrayed because they know what they feel and when to express it naturally. Specially the main protagonist Keima. Because in this season he makes a great transition from this geeky otaku gamer to a true lady's man who has the courage to do anything to protect this girls. Even their last words were very strong and you can even feel them. Every girl is awesome but I got to say that the main one who stoles the show is Chihiro. A girl that really knew what she wanted from the beginning at she was serious to get it. It was so painful for what happened to her througout this season but it was well done for the show. The only bad thing is the poor participation of Elsie in this season. Because she was like the opposite of Keima and not having her like in that position made the show feel odd but we knew why she did that. \\n\\n\r\nENJOYMENT -10-\\n\\n\r\nI love this season. The series has done it very well. I read the chapters in the manga but watching it animated it gave a new feel. It made me got into the characters, plot and theme of the show. I really and trully enjoy it. Even althought it left out some chapters for the time skip I feel that they did the right decision. I just hope that they can do some format of OVA for at least some of the girls because some of their stories were just awesome and lovely.\\n\\n\r\nOverall -9-\\n\\n\r\nIf you have made it to this far you know that it was worth it. The story is great, the characters are very likeable and easy to get attach to them. I hope the series continues to grow so we can continue and have great seasons like this ones. Although I don't want to say in this one ''I can see the ending'' but for this 2013 it has done it.\\n\\n\r\nThanks for reading this review. Excuse me if I had grammar issues but English is not my first language. Take care in whatever you do and enjoy doing it. \\n",
            "date": "2013-09-23T19:56:00+00:00",
            "helpful_count": 16,
            "mal_id": 114013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482029.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KevSan",
                "username": "KevSan"
            },
            "url": "https://myanimelist.net/reviews.php?id=114013"
        },
        {
            "content": "The first time I heard KamiNomi get third season I'm getting excited. After the luckluster sell from previous two season I'm worried that it won't get any anime. But my excitement fall quickly when they anounce that this will cover Goddess Saga in one cour. This is going to be terrible, this is going to be bad, they going to get this butchered is what cross in my mind that time as a manga reader. But Manglobe prove me wrong and show me how they can cover 70+ chapter into one cour amazingly.\r\nStory : 10\r\nThis is covering fan favorite part of the manga Goddess Saga.Even if some part being cut and they cram skipped conquest into half episode flashback in episode 1 they still covered the later part quite faithfully and won't dissapoint manga reader.\\n\\n\r\nArt : 10\\n\\n\r\nThe girl get more and more atractive this season. The most noticable change would be Chihiro who go from average looking into cute teritory.\\n\\n\r\nSound : 10\\n\\n\r\nThe soundtrack also didn't dissapoint. It fit with the mood very well. The full OP is summarizing this season very well. Added by ED that change the coverage for every episode make this great.\\n\\n\r\nCharacter : 10\\n\\n\r\nThe main selling of this season is character developement with Keima get the most notable developement. This season is also promote Haqua to main character replacing Elsea who get another role this season.\\n\\n\r\nEnjoyment : 10\\n\\n\r\nAs long time fans the fact that this get animated is already good enough. Coupled by good execution by Manglobe make it the best KamiNomi season ever.\\n\\n\r\nOverall : 10\\n\\n\r\nThis series give me more of what I asked for. Skipped content aside they did a good job animating this. So for you who have read manga don't worry and go dive watching this and enjoy the feel. For you anime only viewer I'm adviced you to watch at least Tenri-hen OVA if you haven't watch it to get more picture of what happen this season. Overall I'm pleased with this season.",
            "date": "2013-09-24T17:10:00+00:00",
            "helpful_count": 14,
            "mal_id": 114143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1187665.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NeoAnkara",
                "username": "NeoAnkara"
            },
            "url": "https://myanimelist.net/reviews.php?id=114143"
        },
        {
            "content": "Story: I thought the story was a good sequel to the others. It had lots of fluffy and cute scenes and also pervy ones. It would've been a perfect story if it wasn't for the fact that Elsie was totally left out, and that just felt wrong for me, everytime I saw Elsie NOT being part of the story I felt guilty. It must be 'cause she was the one that started the story. Apart from that it was just perfectly surreal.\r\nArt: As always it was bright and fantastic, there were some scenes were it looked better though...\r\nSound: I fell freaking in love with theopening song! It was so cute and modern. :3 dunno...\\n\r\nCharacter: The characters are almost all known to us and they're quite relatable! Even though it seemed some female characters would just be DDummies (get it?) they did have personalities! I loved that, pretty girls with brains.\\n\r\nEnjoyment: I didn't get so into the story as I have with other animes but it didn't alienate me completely. It was mostly funny, but at some bathub scenes I was blishin so much!\\n\r\nOverall I liked it, and I think in the end they kinda let us know that they're gonna make another season (maybe)....",
            "date": "2013-10-12T17:59:00+00:00",
            "helpful_count": 12,
            "mal_id": 116635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2221609.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/cristikirtas",
                "username": "cristikirtas"
            },
            "url": "https://myanimelist.net/reviews.php?id=116635"
        },
        {
            "content": "What an amazing ride KamiNomi has taken us through all 3 seasons, and by far season 3 was definitely the best! Sure no part of the plot really makes much sense -  making girls fall in love to save the world from the demons? But aside from all that, this anime proves that the harem genre CAN go beyond just fanservice and lousy characters. It is the best harem anime I have seen in my entire life - and it is an absolute MUST WATCH for everyone - just because it's so special (and I'll elaborate why below).\r\n\"I can see the ending!\" - Keima\r\nTL;DR\r\nStory:7/10\\n\r\nArt: 10/10\\n\r\nSound: 9/10\\n\r\nCharacter: 8/10\\n\r\nEnjoyment: 9/10\\n\r\nOverall: 8.375/10 (rounded down to 8)\\n\\n\r\nGood points:\\n\r\n+ Exciting, gripping story and conflict\\n\r\n+ Amazing sound and visuals\\n\r\n+ Good comic relief\\n\r\n+ Great emotion and touching scenes\\n\r\n+ Huge variety of unique characters\\n\r\n+ Extensive main character growth\\n\r\n+ Deeper plot than previous 2 seasons\\n\r\n+ Great ED Themes\\n\\n\r\nBad points:\\n\r\n- One-dimensional, underdeveloped antagonists\\n\r\n- Plot may not make much sense, and is secondary to the characters.\\n\\n\\n\r\nStory: 7/10\\n\\n\r\nIf we take a look at the plot as a whole, we can see 2 main arcs. The first arc, the Re-capturing Arc, is where Keima goes around trying to re-capture all his previous captures, but of course, many things don't go his way. The second arc is kind of also within the re-capturing arc, but focuses more on the battle against Vintage, the main antagonists of the story. In comparison to the previous two seasons, I must say that the central conflict surrounding TWGOK III is much more gripping, exciting and though not too believable, was much more significant and interesting.\\n\\n\r\nThe excitement hits you right off the bat when Diana starts to tell Keima about how he has to find all the goddesses from within his previous captures. Initially, we think nothing about it and we expect that same old comedic slapstick humour that was so central to the anime in the previous two seasons. But then - bam! - the enemy strikes as Apollo/Kanon is left motionless (what a pity we don't get to see her in action) due to a magical dagger that threatens to kill her life. Things only get more and more interesting and exciting as the plot unfolds from there - there is a time limit (though at times it may not have been obvious), and there is a legitimate reason why the world is coming to an end if Keima doesn't do anything. This is a far cry from the \"capturing of loose souls\" in an almost aimless manner in the first two seasons, so a great job well done! (+1)\\n\\n\r\nAlso, the gripping nature of the plot continues even towards the end of the anime - where we have certain plot twists and reveals pertaining to Nikaido, Keima's homeroom teacher, who turns out to be not so ordinary after all, and Akari, the undercover member of the Loose Soul Squad. All of these only serve to make the plot so much more interesting - it's not just about Keima capturing girls, there's an entire army backing him up, especially at the end when the battle between the Loose Soul Squad and Vintage breaks out over the ocean. (+1)\\n\\n\r\nThere is also some interesting plot development as the anime starts to slowly show the audience snippets of information about vintage throughout, from scenes in hell to Vintage's perspective, even through Haqua's perspective, which I thought played a key role in the unraveling of the plot. I particularly loved the twist where *spoiler* Yui and Keima were in the haunted house and they planned beforehand for Haqua to pretend to act like she was from Vintage and attack them in the house, in order for Mars to awaken and save the day. (+1)\\n\\n\r\nAs for depth, the anime may seem quite linear at the beginning, when all Keima is doing is essentially repeating the same process over and over again - planning his captures, but towards the end you can tell that it's not so simple after all. Things start going complex when \"detours\" and \"sudden flags\" and \"interruptions\" start occurring and Keima starts going bonkers as to what exactly to do when his plan A, plan B, plan C fails and so on. While the conquests of Shiori, Yui and Tsukiyo were rather straightforward, Ayumi was completely different ball game altogether. All the while, Keima thought that his \"plan\"' was going smoothly, and then things just suddenly go haywire because he couldn't predict certain outcomes / occurrences. Eventually, Keima realizes that he was no longer in control - none of us ever are, when it comes to love. Ayumi ended up conquering herself in a way, because she chose \"to love\" and not to \"be loved\" which I feel was a very meaningful twist to the usual story. (+1)\\n\\n\r\nAlso, we really can't forget the love story between Chihiro and Keima that is just so subtly obvious throughout the anime, that I really can't stand it every time Keima doesn't see Chihiro's true and honest feelings for him. When Chihiro said, \"I don't need a reason to love you.\" - it is literally like the anime is shouting at Keima - Stop thinking so logically and reasoning everything out, just do what you FEEL is right! Chihiro's love for Keima is really the most ideal / innocent love out of all, and I think that's the finishing touch that just makes the entire anime story so beautiful (+1).\\n\\n\r\nAs for the coherence of the plot - I do have some problems with how the ending played out in the end. There was a particular scene where you have the evil Vintage girl stabbing maniacally at the ground, while on top of Haqua, so I'm not too sure whether the girl was even trying to kill Haqua in the first place, given the berserk look she had. But then again, she let her survive at the end, so I guess maybe she never intended to kill Haqua in the first place.\\n\\n\r\nThe entire smuggling Haqua out of hell by our kind Dokuro Skull was only half touched on. We never got to know how Haqua was smuggled out of the prison cell in the first place. Also, the anime doesn't really touch on Nikaido and Akari's true identities, though it does hint that they were central to the defeat of Vintage. While the story also did show Keima \"realizing\" something about how the school's logo was that of a goddess, the hexagon and the covered up holes that he had previously discovered with Tenri 10 years ago, they didn't really develop on that except to make a slight connection between the Jupiter Sisters' super powerful spell at the ending and a substandard explanation of why everything had to occur within the vicinity of Maijima Academy.\\n\\n\r\nNot to mention Ayumi randomly asking to get married without so much as any idea as to what's happening, the entire ship suddenly becoming completely re-fitted by Nora with so many decorations and beautiful lighting, and honestly, it's funny, but... HOW THE HECK DID KEIMA FIND A HORSE? And what happened to the horse after the whole conversation? It kind of just disappeared. Also, most of Vintage's powers seem kind of dodgy. At first, there was all this talk about \"Ancient Demon Magic\" which is like supposed to be feared greatly and is illegal, and it was really hard to dispel the dagger (needed at least 2 Jupiter sisters) which stabbed Kanon/Apollo, but later on Haqua and the rest of the Loose Soul Squad seemed to have no problems with dealing against the Vintage's spells (maybe because she's badass), so perhaps this ancient magic is not really that powerful after all that talk about it.\\n\\n\r\nHowever, I can at least give 1 point for the fact that at least most of the key premises of the plot are believable and that the way the conflict was resolved in the end was quite reasonable. (+1 for some sense)\\n\\n\r\nThere is also something very special about the plot this time. Keima, throughout the previous two seasons, and perhaps once this season, uses the line \"I can see the ending!\" While the resolution to this anime is kind of complete conflict-wise, I really wanted to see Keima and Chihiro get together again despite what happened on the rooftop. The anime though, ends with Elsie saying that Keima is back to his normal self, but when the camera shows Keima shutting off all his games and stepping outside, one has to admit something has changed about him... somewhat. I guess this is the writers' way of not completely revealing the ending of their relationship but letting the audience \"see the ending\" just as how Keima has been \"seeing the endings\" of all his previous captures. Can you see the ending? I'm pretty confident, given the way things are, that Keima and Chihiro will indeed have this happy ending. (+1 bonus point)\\n\\n\r\nArt: 10/10\\n\\n\r\nArt was definitely solid and amazing. I really loved the character designs, animations, all of it. It was very enjoyable from start to the end, including all the comic parts with mini-Keima.\\n\\n\r\nAnimation: 3/3 - Top notch, enough said. You can tell from the wings, the fireworks, the special powers, that they probably got a big upgrade in the animation department from the previous two seasons.\\n\r\nAesthetics: 3/3 - It was simple, great, clear and well-directed. I loved the artistic theme.\\n\r\nOP Sequence: 2/2 - The OP scenes were wonderfully crafted\\n\r\nED Sequence: 2/2 - The ED Scenes were very beautiful to watch as well\\n\\n\r\nSound: 9/10\\n\\n\r\nOP Theme: 1/2 - Seriously, stop singing in English, it is so annoying! But if you ignore the lyrics and just listen to the instrumental, the OP is really good!\\n\r\nED Theme: 2/2 - Simply amazing and beautiful.\\n\r\nBackground Music: 2/2 - Emotional when it needs to be, exciting when it needs to be.\\n\r\nAdditional Themes: 4/4 - I really, really loved the concert at the end of the anime! It was very touching and the old rock concert ending never gets old. Also, very beautiful special ending themes for episodes 8 and 9!\\n\\n\r\nThe audio experience was outstanding - it's a pity I can't give it a full score because of the shitty OP lyrics.\\n\\n\r\nCharacter: 8/10\\n\\n\r\nIt's time for Keima to shine. Really. He used to be a really linear character who only does things one way, but now he's learning, he knows how to adapt, he is beginning to change. He starts to show character growth from the beginning of the show - through his determination to save Kanon no matter what, because she is a real girl. The Keima I knew from the past never thought twice about real girls - but he has changed so much because of the conflict and surrounding plot. Even towards the end, he finally falls in love - with Chihiro - and he didn't even realize that he was in love until it was too late.... Keima's really transforms from just an otaku gamer to someone who is *beginning* to understand what it really means to love someone - and he's already got all the basics - the determination, the drive, the passion, the only thing he realizes he's been missing all this time is the sincerity to go with it. But the anime eventually shows that he does realize this at the end, when he puts down all of his games .... hopefully to go find Chihiro again. We even start to see a little backstory from the flashbacks with Tenri, showing Keima in his younger days, too bad Keima doesn't open up enough about his own true feelings in the end for me to consider his character properly developed. (+1 for growth, +1 for being smart)\\n\\n\r\nThe other character that really, really shines in this anime is Chihiro. Chihiro is the most special ordinary character ever. She doesn't have any niches or special qualities, she's merely a guitarist and lead singer in a band that she just started pre-season 3, and she's also not entirely smart, pretty or useful either. But boy, does she really make her presence felt this entire season. From beginning to end, you can see how she progresses from making small moves towards Keima, to the love confession, to the eventual meeting at the rooftop at the campfire. You can tell that Chihiro isn't just \"another conquest\" at this point, she became a whole other protagonist character - and this becomes especially clear when she manages to help Keima in his conquest of Ayumi, by breaking the love triangle relationship and by convincing Keima to be honest with his feelings. Chihiro has really stuck on me so much as a character, that it pained me so much to see Keima ruthlessly rejecting her on the rooftop, even after she admitted that she had liked Keima even before season 1. Even at the end, when they had that one still shot of Chihiro's tears streaming down her face as she ended the last stanza of \"The Memory of My First Love\", I *almost* wanted to cry with her. (+1 for development, +1 for growth, +1 for empathy)\\n\\n\r\nOf course, this character analysis wouldn't be complete without mentioning our adorable tsundere Haqua, who finally takes the place of annoying Elsie for most of this season. Haqua, while she doesn't change much throughout the show and still stays rather linear as a character, becomes a vital instrument in advancing the second half of the plot. She gains some confidence from Dokuro Skull and eventually starts doing some much-awaited scythe-slashing and butt-kicking with her scythe of doom.\\n\\n\r\nThen we come to the conquests. While Shiori, Tsukiyo were nothing special, Yui was especially unique, and interesting. Yui is a cross-dressing girl, who eventually, and comically, convinces Keima to cross-dress as a girl so that they can go on a date and look like a real couple. The fact that Keima even agreed to such an idea is beyond me, but perhaps Keima is -that- kind of guy. It was really a one-of-a-kind conquest, for Keima to have to \"be conquered\" by a girl who acts so much like a guy, so that was really very unique, in my opinion. (+1 for uniqueness).\\n\\n\r\nThe other main one, Ayumi, was definitely a key character, but for mainly plot reasons. Ayumi shines though, in that although she may not have acted very rationally or believably throughout the entire time, she really managed to \"wake\" Keima up, and made Keima realize that he loved Chihiro so much on the inside, he didn't even know it. Ayumi also grew alot through the story, she didn't just blindly fall for Keima, she also considered Chihiro's feelings, she also punched Keima multiple times, and she also realized that her love was unrequited in the end and still brought it to a happy ending, with a hilariously planned wedding. (+1 for growth)\\n\\n\r\nI have to specially mention the entire supporting cast of wonderfully hilarious characters like Elsie, who makes you laugh with all her funny reactions and stupid statements. There was also the entire Goddess cast, who were absolutely hilarious, especially in the scene where they were all fighting over Keima amidst the dark conflict surrounding them. There were really so many variations - the playful Apollo, the leader Diana, the fighter Mars, the shy Minerva and the queer Vulcan, and Mercury, but she didn't feature much because she was the last to come out. Also, we have the very interesting Nora and her partner Ryo, who are obviously a protagonists, but she continually reminds the audience that she's just doing what's best for \"her district\". (BONUS +1 for variety of character cast)\\n\\n\r\nThe only problem with the characters are the lack of development of the antagonists, the Vintage, in the entire plot, which I felt was quite a pity because the Vintage is actually quite a core component and I would really want to understand the story from their point of view as well. There's also this interesting green-haired girl that Haqua fought with, but they never introduced her at all.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nWhile the comic element didn't feature so much in the anime this time, there were still some particularly funny scenes such as those featuring Yui and Keima in their awkward positions, Elsie's random musings and reactions, Keima appearing on a horse in front of Ayumi, Ayumi's parents' reactions to the marriage idea, Keima getting kicked over and over again, Shiori and Keima's story battle, and the list goes on and on. (+1 for comedy).\\n\\n\r\nTo make up for the comic element though, this time, there were really good exciting and suspenseful scenes right from the get go, where they first introduced the Vintage with an attempted assassination of Kanon/Apollo. The other particularly exciting part was when Keima chanced upon Vintage's hideout and discovered the entire enemy plan. And this excitement continued to build up into full-blown actions scenes with Haqua as well as the other members of Loose Soul Squad fighting against Vintage. (+1 for action, +1 for excitement)\\n\\n\r\nNext, we really can't forget the emotional part of the entire anime, which culminated with Chihiro's love for Keima. All the other touching scenes with Shiori, Tsukiyo and Yui were good, but they were nothing compared to Chihiro. The final concert really almost made me cry, but the entire drama during Ayumi's conquest, from the rejection at the rooftop to the swinging back and forth Ayumi's affection, was also very emotional. (+3 for emotion)\\n\\n\r\nPacing of the show was also quite decent. I only thought that Shiori's conquest was a bit draggy, but it's probably just me being tired of listening to all the different and lengthy thoughts that Shiori has in her head before anything actually got done. The way the ending for her conquest played out in the end was also fairly simple, so I thought pacing could have been better there. (+2 for pacing)\\n\\n\r\nThis time, I am glad to announce that I will be giving a bonus point because there are finally NO filler episodes (unlike the previous 2 seasons)! (+1 bonus point)\\n\\n\r\nOverall: 8.375/10\\n\\n\r\nIn summary, this is by far the best out of the 3 seasons of TWGOK, but you might want to watch the first two seasons so you have a rough idea of the premise behind this. I do recommend that you watch the OVAs as well, because you will be able to see the background behind Tenri, Akari, the band itself, and it would add a lot more to the understanding of the plot and characters.",
            "date": "2014-12-04T03:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 170987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3899837.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kaizersaber",
                "username": "kaizersaber"
            },
            "url": "https://myanimelist.net/reviews.php?id=170987"
        },
        {
            "content": "This is my second review.\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nKSS's first and second season has much more been a typical harem show and I wasn't expecting anything to change. However things did change and it shocked me ultimately to say the least. The plot started to develop and it was a pretty good one at that. \r\nWhile the first and second season has been more into how Keima deals with his 'conquests' at trying to make a girl fall in love with him to draw out the loose souls, this final season has given us a perfect and powerful ending to end the series entirely. The build up over thelast few episodes gave me shrieks and horrors and literally made my jaw drop. I was being stolen at how a harem show I wasn't expecting much off take a huge turn and turned out to be one of my favourites. \\n\\n\r\nStory & Characters(9): I started to watch this season expecting it to be the same like last season, to end with no girls Keima particularly ending up with and just continue conquering more girls. I was wrong, this season has been much over the one girl we would have not expected to be loved so much by the KSS's fans. The story has been more engaging, though cliche, on how there is two girls who he had conquered on the first season causes a problem in a bitter love triangle, it was something really crushing to watch and how Keima had to handle that one scene when he realizes something was off was really heart-aching. One of the girl lead was what I think made this season a huge success, in the end you just can't hate her. She was the one who gave a powerful emotional impact on Keima's life and played a part on how Keima succeeds his mission. While it isn't given that she ended up being with Keima the development of their relationship has been a huge satisfaction for a near-perfect emotional ending. \\n\\n\r\nArt & Sound(8): Like the previous seasons it has been nothing but top notch animation and music. The English openings as always has been a nice change and you just can't help to sing along with the chorus. The OST's fits with the mood of the scenes which considerably gave an impact on how an arc/scene turns out. The beautiful scenery it has during every conquests has never been disappointing. \\n\\n\r\nDrawback(s): Before I conclude the review I'd like to mention the only thing bothering me through the season. And that is indeed the comedy. After a certain conquest when our emotion meter is about to break they just HAD to throw in a chibby Keima and it made it us thinks like everything was suddenly somehow settled down, while it wasn't! Had they kept the same pace and mood, with a clever writing, the last few episodes could have been a real tearjerker. Though in the end it works out pretty well, and we have our fair share of breakdowns.\\n\\n\r\nOverall & Enjoyment(10): I've been and probably will be a biased rater for a while to come, though for the last 5-6 anime I've watched I've tried to rate things up to my standards, which was try not to be too biased, but this anime made that streak to an end. I just had to gave it a perfect score because the ending was something undeniably heartbreaking.\\n\\n\r\nThis finale has been wonderful with the jaw drops and a wonderful emotional plot. I had a blast watching this and couldn't help feel excited because it was something more than what I expected. While I'm giving this anime a 9 in the review, my list will definitely have a 10 to let me remember how this anime's last season had been such a joy to watch and laugh with.  The way KSS ends will always be something I keep hold dear for a long time to come.",
            "date": "2013-10-09T04:33:00+00:00",
            "helpful_count": 11,
            "mal_id": 116195,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2633089.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Krasa",
                "username": "Krasa"
            },
            "url": "https://myanimelist.net/reviews.php?id=116195"
        },
        {
            "content": "Doro,doro,doro,doro,doro,doro,doro...OOOOOH a loose soul is running around, kidding, Bueno no more running around and I'm just gonna present each of my ratings for this third sequel of \"Kaminomi\" :\r\nOh and btw, though I may have read the manga, I haven't read all of it yet in fact while writing this review I'm still on Chapter 2, so my review is only for this anime's third  sequel. \r\nStory, character, enjoyment- good 7.\r\nStory: Though, it still follows the same genre, it is the introduction of  new set of characters, a switch of the secondary main character and a new mission for the main character wherethis time he's set to awaken the five other goddesses who are called the Jupiter Sisters, totally this anime's new plot reinvents itself to a whole new level. Also, the harem genre has provided a new dimension to this reinvented sequel, since in previous seasons the girls forget everything after being conquered by the main character, here the girls remembers the conquest and has displays jealousy when one of there own has declared her love for the main character.    \\n\\n\\n\\n\r\nCharacters: With the introduction of the Jupiter sisters, a new antagonist Lune and couple with Haqua filling in for Elsie as Keima's human partner ( I assume that any of you would know why and how), actually does provide this anime's reinvention. Compared to the last two prequel, this one doesn't feature the usual Keima who is cold and non apologetic in real world and only cares about the game world, and were hunting loose souls with Elsie is more like a chore than anything else, in fact, this the only part where we see Keima's serious side as he felt remorseful of Chihiro that as he makes such difficult decision that will hurt both him and Chihiro. Haqua being Keima's temporary replacement partner adds a new phase to the usual Elsie and Keima and It kinda hurts me to see that Elsie is limited to a secondary character in this sequel, Haqua also provides as an additional harem type competitor for Kiema's affection aside from the goddesses. The reintroduction of  Tenri Ayukawa who is also Diana does complete this sequel being as childhood friend to Keima, I really like that her character of having a dual personalty from being a shy Tenri to a gutsy Diana, she really provides a sort amusement since it looks like that there are two fighting for the guy's affection rather than one, it is also the same for the other Jupiter Sisters.\\n\r\nThe antagonist Lune, I kinda hate it that her role ended in a cliffhanger after her fight with Haqua, in fact I'm a bit disappointed that Haqua was no match for her despite of only being armed with a box cutter, on to Chihiro, from the start of the anime I already feel bad for her (after getting some spoiler about her in this sequel) and I could have wish that she gets into a relationship with Keima, but then again Keima having to worry about Kanon and the other Goddeses and have to make such harsh decisions of breaking up with Chihiro and it really makes me pity her, since she has to be the collateral damage of the imminent war between Vintage and the Jupiter Sisters. As for Kanon, Ayumi, Yui,  Shiori and  Tsukiyo Kujyo, I'd probably say that they are nothing more than renewed characters  both from previous seasons and from the manga, but it was the Goddesses that they have inside that makes it part of this reinvented sequel. Nora, on the other hand seems to provide as Keima's reluctant insider and added help, however I do find it nice in episode 7 that she becomes Keima's short time partner after Haqua got arrested.  \\n\\n\r\nEnjoyment: With this third sequel's olot reinvented, it was nice that Manglobe decided to come up with something such as this if  Manglobe decides to to a sequel whose plot hasn't change then this sequel would have been boring.\\n\\n\\n\r\nArt and Sound- fair 6.\\n\\n\r\nArt: Well, I would have given it a 5 since nothing has change with the anime's overall illustration , but after seeing Haqua in a whole new outfit and Nora's get up I think such score would be fair enough.\\n\\n\r\nSound: As much as I can say, I really like the ending theme and Chihiro's song, but  not the opening.\\n\\n\r\nOverall- very good 8.\\n\\n\r\nOverall, studio Manglobe did took such risk of making a sequel with a reinvented plot and I think it's very good that they did. I wonder if there will be a forth sequel?\\n\\n\\n\\n\\n",
            "date": "2013-09-24T12:22:00+00:00",
            "helpful_count": 10,
            "mal_id": 114121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=114121"
        },
        {
            "content": "It has been a considerably entertaining few years as this anime was first introduced into the community, and once again The World only God Knows has changed our understanding of the Harem/Romance genre. Whilst the initial two seasons follows the manga closely and broadens our understanding between Keima's idealistic fantasy and his unavoidable destiny to conquer the \"real-life\" girls, season 3 would have been an absolute disaster if the continuation of his conquests was not supported with any actual \"ending\" (Keima's favourite word).\r\nThankfully, TV Tokyo decides to take the major risk into a timeskip between seasons 2 and 3, and while it may have confusedthe audience with rapid changes, the entertainment from the Goddess arc truly shined and the adaptation is perhaps no short of outstanding. The story of Keima's adventures to collect loose souls initially had no true implications, yet the revelations within the Goddess arc enabled a strong, firm connection within Keima's world.\\n\\n\r\nAs with its predecessors, Megami-hen's art and sound have been superb, the opening and ending this season have been especially mesmerising for myself personally. There were only some minor frame changes between the manga and anime itself (disregarding the major change in storyline), yet overall Tamaiki Wakaki has once again impressed the audience with high quality artistic features. The precision of the actions and expressions with the girls is another bonus within this already highly-regarded masterpiece.\\n\\n\r\nWhat truly allows the story to shine so brightly amongst the thousands of other competition is nevertheless the personality of it's characters. Even the main protagonist himself recognises and accepts unique personalities of his conquered girls. In the third season, many girls return to take on the heroine role, and once again Katsuragi must conquer them a second time in order to draw out the power lying within. This change of events from the ordinary loose soul mission to drawing out the power of the Goddesses nevertheless strongly appeals to the currently fanbase, with many getting to see their beloved female heroines (+Yui, if you know what I mean) once again falling for Kami-sama.\\n\\n\r\nMost certainly, I have enjoyed the series significantly, thereby rating it an impressive 9/10. For those who are still confined within Kami's world, I would definitely recommend to fill in the gaps by reading the manga - there are many more conquest arcs, and the new saga also offers an impressive new world to discover!\\n\\n\r\nThank you very much for having time to read my first review! While it may not offer much, I take pride in helping others, while improving my own abilities in reviewing!",
            "date": "2014-01-13T21:03:00+00:00",
            "helpful_count": 10,
            "mal_id": 128697,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/XenonFactor",
                "username": "XenonFactor"
            },
            "url": "https://myanimelist.net/reviews.php?id=128697"
        },
        {
            "content": "An average anime that looks like a work of art.\r\nRoutes games and kisses? Perfect!\r\nThe construction of characters, especially Keima, is really amazing. An anti-social character, he becomes a god to the characters around him.\r\nEach episode depicts how evolution character happens at different times.\r\nThe fights may be through tedious, but forget the struggles with the beautiful music backgrounds.\r\nMusical backgrounds? We should call the work of musical arts. The Oratorio of The World God Only Knows leaves his very gentle soul.\r\nThe character design is also good. The traits are not that thing \"Ufotable\" but leave the well fluid and light scenes.\r\nAnyway, the anime deserves note 9, inmy opinion.\\n\\n\r\nIf there was a next season, I would watch for sure! And would recommend to friends!",
            "date": "2015-06-21T04:48:00+00:00",
            "helpful_count": 9,
            "mal_id": 190806,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3278127.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/erickpaini",
                "username": "erickpaini"
            },
            "url": "https://myanimelist.net/reviews.php?id=190806"
        },
        {
            "content": "I have been a fan of The World God Only Knows for a long time. Its timeless humor, likeable characters, and wonderful storyline make it incredibly enjoyable! The World God Only Knows III, however, is somewhat of a different story. What do I mean by a “different story”? Well, it all starts with the characters…\r\nCharacters: The characters in The World God Only Knows III are basically the same as the last two seasons, albeit with a couple of new characters added to the mix. These characters are cliché, cheesy, and stupendously stereotypical, yet it’s these traits that make them great. These characters have been fined-tunedto be likeable, funny, and are all-around well-done characters. The writers of The World God Only Knows III defiantly took their time to make these characters a joy to watch. They’re not free from their own problems by any means though. The main problem with some of the characters is the lack of the latterly mentioned “fine-tuning”. More specifically, it’s the characters that felt abruptly thrown into the story to further advance the plot.  The writers of The World God Only Knows III have enough confidence that all the viewers will have read the manga. Although this is true for most of the main anime community, most (including myself), have not even touched one of the manga volumes! Thus, it feels as if you haven’t had enough to get to know many of the characters essential to the plot. For instance, Terni Yukawa only makes a cameo in The World God Only Knows II, yet viewers are expected to know and care about this character with little to no introduction. Granted, the writers do try to the best of their abilities to try to make you care for these characters. For some, this is fine, but for others it seems a little strange and (dare a say it) lazy. Sadly, there is yet more oddities in the characters, namely Keima Katsuragi (the main protagonist). He is known for his famous quote “My life only needs the girls from games”. This logic is fundamental to the character and gives him his charm and wit. However, during the final episodes, he seems to break away from that essential character trait so the writers can make him seem a little more “normal” and like he has a little good inside him. This has good intention, but in the end it makes the character somewhat of a hypocrite. Other than the aforementioned problems, The World God Only Knows III still succeeds with the main part of its characters, but it’s not as great a success as it could be.\\n\\n\r\nStory: The story of The World God Only Knows III tries to be stand-out from the previous two. Instead of revolving around Keima trying to conquer various girls to rid them of “loose souls”, it adds (as the name implies) a goddess element to the mix. This differs in the way that each girl holds a goddess, instead of a loose soul, that needs to be taken out of them. The purpose of this is to keep “ancient hell” from being released onto the world. This is a way for this season to be stand-out from the last two, while still keeping that romantic element that fans of The World God Only Knows enjoy. This move is very well done in my opinion. It keeps the story from getting dull and boring and takes a risk (albeit, a small one) that keeps the viewer’s attention. Yet, it still has its pitfalls. Like I previously mentioned, some characters are suddenly placed in the story with only a quick, 5 second flashback that feels somewhat lazy. I often found myself wanting to see how Keima conquered a certain girl, instead of focusing on what was happening in the episode. With such a great character design for every person, it’s a shame they were so rushed. Furthermore, I also felt that there was too much information given in a short span of time. History lessons of hell’s past and important character details are so rushed that some might blurt out “Who, what, where, when?!”. This vast amount of information could have had a much greater impact if they had taken it a little slower. All-in-all, it’s a nice story that gets points for it originality and risk-taking. Yet (as with most shows), has its own set of pitfalls if only because the last two seasons were so great.\\n\\n\r\nSoundtrack: Look up “mind blown gif” in Google, and you’ll get an idea of how amazing this OST sounds. With its romantic orchestral style, it’s placed at just the right moments throughout the show. It’s almost blissful in its sound. Yet, there are problems. Instead of a completely new OST, The World God Only Knows III recycles songs from the first and second seasons. Although the songs are blissful at first, they got somewhat, monotonous. Even though the soundtrack is great, some might wish for something a little bit more original to this particular season.\\n\\n\r\nArt: Again, “mind blown gif”, Google. Except this time, I can’t find a single problem with the art.  It beauty is prevalent everywhere you look. There was not one time I ever questioned the art in The World God Only Knows III. It’s crisp, well drawn, and is nothing less than pure eye candy. Characters look consistent, and backgrounds never fail to impress. Although the art doesn’t take any risks, The World God Only Knows III’s art shows that if you can do a classic well, you don’t need to take risks for it to be great.\\n\\n\r\nConclusion: The World God Only Knows III impresses not just with its story and characters, but also with its art and soundtrack. It has its annoyances, but when you look at the bigger picture, you find an enjoyable and worthy addition to the vast world of anime. I give The World God Only Knows III an 8 out of 10\\n",
            "date": "2013-09-23T21:31:00+00:00",
            "helpful_count": 8,
            "mal_id": 114035,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2945693.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Multisupermono",
                "username": "Multisupermono"
            },
            "url": "https://myanimelist.net/reviews.php?id=114035"
        },
        {
            "content": "Story: 6\r\nThe story was a lot more confusing than the first and second seasons because although it was loyal to the manga, that meant it had to skip a lot of chapters and that means we have a lot of random things suddenly appearing, confusing the viewers. Even though the Tenri Arc ended up being an OVA, the stories of the other goddesses were basically a few seconds, and that was only the kiss scenes.\r\nThe last few episodes centered around Ayumi and Chihiro were better. It was well developed and a little heart-breaking when Chihiro was very much manipulated. Unlike the other ones, it hadmajor bumps and stops which makes it even more thrilling as Keima was working in a time limit\\n\\n\r\nCharacters: 6\\n\r\nKeima has indeed changed drastically from the start of the anime, from an otamegane who only cares about his games and PFP, to a hero who is actually concentrated on saving the world, instead of rejecting reality as a \"crappy game\"\\n\\n\r\nI personally didn't really like Chihiro because of my little grudge from the second season where she just jumps from boy to boy. This time, she's willing to help out even if it means watching the one she likes try and earn the hearts of others, or helping even though she doesn't really know what's going on, only that conquering the girls are important.\\n\\n\r\nThe goddesses weren't really THAT important, despite this being the goddess arc. The only ones with actual events were Kanon (SPOILER: when she got stabbed) and Tenri. The others were basically: get conquered, then go home and hide yourself until we need you. The other goddesses were also pretty one-sided, there was hardly any character development on them, probably because they didn't get a lot of screen time after they got conquered. The last few episodes were instead focused on Ayumi and Chihiro, and it certainly is satisfying when they FINALLY kiss after events that make you go \"JUST KISS ALREADY\"\\n\\n\r\nEnjoyment: 8\\n\r\nEven with all its flaws and such, the comedy is still as good as ever, and watching Keima getting beat up for various reasons is still hilarious, old as it may be. Some episodes are definitely memorable and worth rewatching for the hilarity, though after the ride you might think \"eh, it wasn't that good\"; the anime loses its touch after a while.\\n\\n\r\nOverall: 7\\n\r\nNot the best season from this anime, and I've watched better animes than this. It was probably because of the confusion of the story (i.e. adding in characters at the last second) that dragged it down for me. \\n\r\nSorry, but S1>S2>S3\\n\\n\r\nNo comments on Art and Sound",
            "date": "2014-07-12T22:45:00+00:00",
            "helpful_count": 7,
            "mal_id": 151765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3877331.jpg",
                "scores": {
                    "animation": 0,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Heatherfall",
                "username": "Heatherfall"
            },
            "url": "https://myanimelist.net/reviews.php?id=151765"
        },
        {
            "content": "In an age where Genre,Premise and Tropes define anime.TWGOK shows that great original storytelling could still exist.\r\nTWGOK could have been a mindless moe anime.It could have been one of those otakuism stories like Welcome to the NHK or Watamote to appeal to otaku relatability.It could have been \"Dark and Edgey\" for the sake of appealing to a superficial undestanding of maturity.\r\nAnime these days have become this giant pandering fest,instead of doing what an anime i feel ought to be doing,drawing people in with their own stories.\r\nTWGOK was an anime that did not follow trends,what started as a deconstruction of the harem genre with a themeof ideals versus reality,finally started to give a storyline that I would call an anime classic.\\n\\n\r\nThis show is the standard for character development.So many charcters meaningfully grow and change over the course of the story,we get to really see this in this arc.\\n\\n\r\nKudos to Yui,who becae her own prince instead of being a traditional girl.For Shiori, who could only speak in moe noises could finally speak properly wrote the story only she could tell.Kudos to Haqua, the book-smart girl the pride of new hell.I could go on.....\\n\\n\r\nThey may based on archetypes, but they have 3d depth and perssonality.\\n\\n\r\nEven  rare and tame by even battle anime/gundam standards, fanservice scenes is made useful to the storyline through keima.I admit that is unique.\\n\\n\r\nKudos to the Theme of twgok being true to yourself and having the courage to face reality.A not so black and white theme, considering that these girls were not \"purified\" to be normal.\\n\\n\r\nAh yes the polt,a plot that is not solely understood by the premise.Keima has to go and revive the Goddesses.keeping with what we already know, but bringing enough originality as well.Twgok is very logically consistent, things have a reason to happen, it could keep up even with the most serious stories that I have read.\\n\\n\r\nA \"save the world\" premise but an arc that is mainly focused on Keima and his acting.now he no longer uses his knowlege as readily and started to use his experiences with reality to great effect.\\n\\n\r\nMaturity is not about just death and haviing an adult premise,it is about responsibility and how you act.Unilkie other anime where they making killers look cool,inserting the \"Senin\" genre tag, and having the protagonist to always do the perfectly moral decision,actions have meangingful consequences, the protagonist had to make an ugly move on a certain girl in a bid to protect her, he also has to push forward even when it seems hopless,and he never took the glory and even let his harem do what they can do to help him out.He knows when to STOP.\\n\\n\r\nThe arc showed how  keima has turned from self indulgent to being a selfess hero.\\n\\n\r\nA certain memorable scene showed how he is coming to terms with reality,not as an otaku but as a person.\\n\\n\r\nI have to give kudos to  vintage,they could have been half hearted harem villans.I love how hell is an actual sociecty and not just that \"place of evil\" with a political factions of traditional vs new,not simply good or bad.Vintage may be great at doing thair job using logic and tatics were fooled to be clearly set up by their bosses...\\n\\n\r\nThe ending scene is it really back to square one or.....\\n\\n\r\nI wish they had the ova's for the conquests though,shame really, and there are things to resolved though after this.So I would not  give this a 10/10 yet even though its quality is there.\\n",
            "date": "2013-09-26T19:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 114371,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1998768.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/genesic123",
                "username": "genesic123"
            },
            "url": "https://myanimelist.net/reviews.php?id=114371"
        },
        {
            "content": "The capturing god returns in Kami nomi zo Shiru Sekai : Megami-hen. This anime, without fail, manages to improve with each new release by carefully developing the parts that were lagging in previous seasons as well as sprinkling some new content on top of an already near-perfect plot. Megami-hen, so far, is the pinnacle of this anime's success. \r\nKeima returns in this season to continue his conquest of lose souls that reside within girl's hearts but due to suddenly changing circumstances his pursuit changes from aforementioned loose souls to goddesses, advancing this anime's already divine tone. As far as plot progression goes, Tenri-hen goes ballistic.The speed of progression is intense, especially during the second half of this 12 episode season. Hordes of new plot devices are introduced to the viewer in each new episode. However, the anime still manages to connect all the bits and pieces of information into a coherent story that eventually makes perfect sense. \\n\\n\r\nSome characters experience major development and some are kind of left out. First and foremost, Keima Katsuragi. In the previous seasons he had to rely on his theoretical knowledge gained from playing dating sims and apply it to real world situations. This season however brings in much more realism to the process of \"capturing\" by adding a lot more random events and variables that Keima simply can't account for, such as girls approaching him first, triggering \"flags\" on their own etc. In light of this fact Keima has to improvise most of the time and taking into account his lack of practical experience with real life women, his actions often produce hilarious results. \\n\\n\r\nFans of Chihiro will be happy as she receives a lot of screen time and development. The anime deepens the link between her and Keima and gives plenty of surprises in the second half of the season as both characters are forced to look at the big picture, rather than just their own worlds they've been living in for the past 2 seasons. Both characters are deeply affected by this transition. \\n\\n\r\nHaqua and Elsie essentially switch places as the former becomes Keima's partner for this season. There are plenty of other characters from Hell and Heaven alike that return for this season and while their development levels vary, Haqua becomes a much more solid character as she interacts with the rest of the cast in much the same way Elsie did. And this, is pretty much the only problem with the cast of  Megami-Hen - Elsie's involvement in the show, for this season, is greatly diminished. Granted, she does appear more during the second half but never really makes any sort of impact on the plot and feels more like a background character.\\n\\n\r\nMoving on to art and sound, both of those components stay pretty much the same and inherit the same characteristics from previous seasons. The art stays at a near flawless level, precise and crisp. The static objects, the characters and all effects have been drawn with attention and care. \\n\\n\r\nThe music itself, some of it new, some of it taken from previous seasons manages to complete the viewing experience. The voice acting is as always authentic and engaging. \\n\\n\r\nEnjoyment? Hell yes (if you pardon the pun?). I have enjoyed this season immensely and I'm sure a lot of other 'Kami nomi zo Shiru Sekai' fans and watchers alike did. This anime manages to do all the right things to pull off successful sequels. Character progression, new plot devices and smartly executed re-introduction of the characters are some of the things that this season did with near-perfection. The humour is great and easy to understand, the drama's right and every episode engages the viewer not only emotionally but also intellectually which is something I've always liked about this show. It makes you think and that's always a good thing. Who knows? Maybe one day I'll use Keima's analogies to capture the hearts of a few women myself (Though I'd likely just end up embarrassing myself).\\n\\n\r\nAll in all, 'Megami-hen' is a great continuation of this show. 9 points from me. \\n",
            "date": "2013-10-31T14:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 118887,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=118887"
        },
        {
            "content": "First and foremost, this anime is a lot of fun. I actually decided to watch it because I am a big fan of Hayami Saori (seiyuu) and so after listening to one of her songs from this series, I decided to give it a shot. As a side note, her co main from Teen Romantic Comedy (Touyama Nao) is also in this series. Anyway from that basis I came to the series with no idea what to expect having not read the manga either.\r\nTo summarise the story, The World God Only Knows (TWGOK) is a series about a gamer who excels at dating sims. Heis conscripted to then capture 'loose spirits' who reside in the hollow hearts of various girls which he must then get to fall in love with him to free them. He is assigned an assistant 'demon' who shares the same mission. This leads to encounters with various girls who once they have kissed him forget all about him - until a twist revealed in this the final season of the anime.\\n\\n\r\nNow that story seems pretty generic but does provide a good entry into the harem romantic comedy genre of anime. The good thing about this series is that it is not ecchi, so only minimal fanservice if any, which I find is a copout to good writing. I enjoyed the interaction between the characters and certainly the premise of the lead character Keima, preferring games to real life touches a chord I think many of us can relate to. \\n\\n\r\nI loved the artwork and character design. All the girls have their distinctive looks and the story in earlier seasons even pokes fun at how all anime girls look the same. \\n\\n\r\nThe music and sound is great. As I mentioned I came to this series because of the song With you - by Hayami Saori. I have to say that I liked all the music sung by the various seiyuus but obviously it depends on your taste. \\n\\n\r\nFinally my criticisms of the series. My only gripe really is that the main character did not show enough growth along the journey. The final 3 episodes could have really nailed the emotions if only they could have written in a substantial ending with consequences. As it is, the story lacked the final emotional tension because you feel that the main character could do no wrong or that no matter what, he could not lose in any way. I would highlight that Clannad After Story, in my mind made that leap in the last 6 episodes to push it into absolute masterpiece territory simply because it was not afraid to risk everything to get there. Unfortunately, TWGOK pulled back at the end, just when the stakes were being raised, it was afraid to show some passion or to show that Keima understood what was at stake. He was never invested in his relationships so in that sense, he did not seem to have learnt from his experiences with those characters.\\n\\n\r\nTWGOK is a great introduction harem anime. It's funny, it's heartfelt, beautifully drawn and once you start you want to keep going. I personally enjoyed the music and certainly the voice actors are brilliant, I loved them all. In the end however, it's lack of emotional suspense and failure of the lead character to really grow or to show some maturity left me feeling hollow. \\n\\n\r\nPlease like this review if you agree with me! Send me any comments - I'm always keen to hear from other anime lovers!",
            "date": "2015-11-01T00:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 202364,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4629270.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/theadrin",
                "username": "theadrin"
            },
            "url": "https://myanimelist.net/reviews.php?id=202364"
        },
        {
            "content": "I feel the Kami nomi zo Shiru Sekai: Megami-hen aka The World God only Knows (TWGOK) really needs two separate reviews.  One for people who have already seen at least part of the previous seasons and one for someone who has never seen any.\r\nIf you've never seen TWGOK, your missing out.  Have you ever been watching an anime where you were thinking \"just kiss her dammit!\"  Have you ever just wanted to reach into the screen and shove the two awkward love birds together?  Well, this show is quite satisfying on that level.  In fact, if anything, there might justbe a little too much smooching.  The series has it's flaws, but it is enjoyable and generally light hearted for the first 24 episodes.  The stories are good for the most part.  The art and sound are also good, if not groundbreaking.  Character development is done pretty well.  Keima's transformation from game geek that has never touched a real girl in his life to full blown cassanova is shown a little bit in each romantic arc. If you haven't seen the first two seasons, you can do one of two things.\\n\\n\r\n1.  You can start at the beginning and watch all 24 episodes of season 1 & 2, plus the Tenri-hen OVA.\\n\\n\r\n2. Read the manga up to the beginning of the goddess stories.\\n\\n\\n\r\nIf you saw the first two seasons and loved them, then you should have already watched this.  If you saw the first two seasons and thought it was just OK, you need to watch this.  Episodic shows can get old fast and if this was just another 12 episodes of conquest after conquest, it could easily have fallen flat.  What it does instead is fix nearly everything that I was less than enthused about in the previous seasons.  The separate arcs are gone, replaced by an engaging and exciting story that lasts for all 12 episodes.  There are no throw away episodes where Keima spends the entire episode gaming.  Did you think that the show would be better with some emotional depth?  It's here.  Season 3 is worth your time, even if you didn't love the first two seasons.\\n\\n\r\nThe following scores are for the third season:\\n\r\nThe Story is probably the shows weakest link only because there is a glossing over of important material that was skipped in the jump from season 2 to 3.  Watching the Tenri OVA alleviates some of this, but you still spend some time early in the series wondering what is going on.  Once it get's rolling, however, the plot really soars.  STORY:  8\\n\\n\r\nThe art and sound is on par with the previous seasons, which is to say it is great.  Everything is well done, but I doubt you are going to be buying posters of the artwork or mp3s of the music.  ART/MUSIC:  9/9\\n\\n\r\nThe characters and there development are what make this show awesome.  It's really hard to explain this without spoilers, but the emotional depth that this season brings to the table is as good as I have ever seen in an anime.  The characters are very relatable and will take you along on their emotional rollercoaster ride.   CHARACTERS:  10\\n\\n\r\nI thoroughly enjoyed this anime.  I have limited the number of 10s that I give out or this show would probably get one.  You will laugh and most likely cry and you had better be prepared for a marathon session as you near the end.  This is anime at it's finest.  ENJOYMENT/OVERALL:  10/9\\n",
            "date": "2013-09-24T08:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 114095,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3066355.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Well_Spoken_Man",
                "username": "Well_Spoken_Man"
            },
            "url": "https://myanimelist.net/reviews.php?id=114095"
        },
        {
            "content": "Review for Kami Tomi 3\r\n=============================================\r\nI have already posted a review for the first and second season, if you are reading this you are probably wondering if you want to continue this series or not.\r\nFirst of all I would recommending watching the following OVA's in order:\r\nKami nomi zo Shiru Sekai: Flag 0\r\nKami nomi zo Shiru Sekai: 4-nin to Idol\r\nKami nomi zo Shiru Sekai: Tenri-hen\r\nMagical☆Star Kanon 100%\r\nTo prepare you for Season 3, I hope you find my review helpful\r\n=============================================\r\nSummary of the Extended Review down below :\r\nStory : Beginning may be confusing, A more serious season compared to the first two, Great Great Ending, \r\nArt :Same as thefirst two season, Well done, No unique style though this is not a problem\\n\\n\r\nSound :Voices are done well (Japanese Dub) Sound Effects great\\n\\n\r\nCharacter : We finally get to see our main character and his true emotions, \\n\\n\r\nEnjoyment : Lack of Ecchi Scenes (Family Friendly), Confused at first though the more serious third season was a great way to end things\\n\\n\\n\r\n=============================================\\n\r\nFull Review\\n\\n\r\nStory : Like what I said about the first season not your normal harem/RomCom anime, Expected that your already watched the first and second season , The beginning of this season may still be confusing even after watching the OVA's you will noticed that some parts of the story has been skipped to reach this arc of the story, I do like how this season was more serious and how the main character's emotions were brought out in such a unique way, I personally loved how they ended this season and this is the first anime that has ever made me want to read the continuation manga chapters (Chapter 189 is the ending of this season), Hoping for a season 4,\\n\r\nPersonally a 9 because the start of the season kinda seems to leave the viewers a little confused unsure what we have missed and that actually cause me to put this season aside for awhile, Otherwise the rest of the season smooths out nicely,  \\n\\n\r\nArt : Same art style as the first and second season, consistent and there is no problem with that, The art style may be seen as a standard quality for anime's \\n\r\n8/10 like i said before would reserve 10/10 for anime's with unique art styles that works.\\n\\n\r\nSound : (Japanese Dub) Good work done by the voice actors, the characters sound like they should, (the voice fits the look of the character)\\n\r\nThe sound effects are nothing special but they work. 10/10\\n\r\n(May re-watch everything through again in the english dub to rate it, psshh kinda want to watch it again.)\\n\\n\r\nCharacter : Compared to the first and the second season we learn a lot more about our main characters and in this season it finally allows the viewers to connect to them, again like the second season we learn more about our main characters through the events that take place rather than back-story, to me this is great. 10/10 I wouldn't change anything about it.\\n\\n\r\nEnjoyment : After watching the first and second season I was really looking forward to watching this season, The first episode really left me confused and like I said before it led me to drop watching this season for a week or two, Though as the season goes on it got a lot more serious and I have to say I really enjoyed how the story was went, Personally I loved how the ending was done and it wouldn't need a 4th season, (Even though I kinda want one)\\n\\n\r\nOverall : Would recommend to all my friends who watch anime, Would recommend them to watch it immediately, The first anime that made me want to read the manga. 9/10 This has been a great season and it personally left an impact on how I will watch RomCom's it really was unique (to me). Will always believe that there will be an anime that would top this and missing episodes in between of season 2 and 3 may have cause it to lose its 10/10 for me.",
            "date": "2015-04-12T04:29:00+00:00",
            "helpful_count": 5,
            "mal_id": 185445,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4478941.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DjKagamine",
                "username": "DjKagamine"
            },
            "url": "https://myanimelist.net/reviews.php?id=185445"
        }
    ],
    [
        {
            "content": "So this is my first time writing a review, so onegaishimasu, don't be so harsh on me.\r\nKami Nomi zo Shiru Sekai: Megami-Hen, also known as The World God Only Knows: Goddess Arc in English is a unique harem anime that has gone a long way since the first season, from the art, to the emotions you get from the characters has all been vastly improved (even though i loved all 3 seasons of Kami Nomi :D).\r\nStory (9) - For the story, it is unique to the usual Kami Nomi series as it is taken to a more serious note as you see the main protagonist,Katsuragi Keima not actually playing any games in the series (besides the very end) and the comedy from the series is rarely seen, but they make the serious story for a comedic genre anime work really well and beautifully.\\n\\n\r\nArt (10) - The art has come a long way since the start of the first season of the series as it looks breathtakingly amazing and they make every single piece of detail looks stunningly beautiful which I am proud to say has brought me to tears of joy :')\\n\\n\r\nSound (10) - The sound for the series fits the scenes of the anime perfectly in my opinion, the opening and ending songs were really amazing and left me finding where to get the songs and are in my playlist as we speak, and probably will be there for a lot longer, what I recently realized is that the ending was sung by different characters every time which made me so happy and joyful of how much effort they put to make this anime really amazing.\\n\\n\r\nCharacter (9) - The characters in Kami Nomi zo Shiru Sekai: Megami-Hen made me feel a whole new realm of feels, every character in this arc made me feel for them which I found to be awesome all the way, and can't make me stop being a fan of this brilliant masterpiece of an anime.\\n\\n\r\nEnjoyment (10) - I really enjoyed the series throughout from the first season to the very last (including OVA's), and this arc is no exception, I loved it all the way through to the last minute of the episode :).\\n\\n\r\nOverall (10) - Overall, this anime was just an extremely fun ride for me, I couldn't ever think of even taking one point away from the overall score, and believe me, I will never stop being a fan of the Kami Nomi series :D.",
            "date": "2013-10-11T01:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 116425,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3228861.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yusei757",
                "username": "yusei757"
            },
            "url": "https://myanimelist.net/reviews.php?id=116425"
        },
        {
            "content": "Would like to inform that this review will be brief on what aspects made the previous seasons so special and how this one damages them. The third season even tho it tarnishes all the previous entrys is important to remind it´s still probably the most enjoyable to watch out of all of them. I ended up giving a score similar to the second season because the second also was smearing the ugly head of what consitently ruined the show, just that the third season amplified the issue by abandoning the formula it had.\r\nThat issue is that it was not playing out like a typical haremwhere all the girls are chasing after the protagonist, something that changed first with the introduction of haqua and now in season 3 with the introduction of the goddesses. What made the first season work was the illusion that keima was only conquering the girls to help them sort out their issues so it didnt make him seem like a jerk when he would make them fall in love with him even tho he didnt really love any of them since he projected real women as not compatible companions. And it also didnt become self-indulgent by making his conquests forget all about the conquest and him, removing any possibility of the story deviating to a stupid harem rom-com (which it did).\\n\\n\r\nIt is Chihiro in the end that calls him out on his bullshit stating that he should conquer the girls but be honest about his intentions and how he doesnt love them. Which he does right in the finale with Ayumi. Which is the only positive trait of the third season. What the author should have attempted was to make keima a more symphatetic character that only uses petty game tricks to seduce his conquests because he would feel guilty if he didnt treat all his conquests like games since he was basically toying with the girls emotions. But the way he handles these girls towards him just make him seem like a two-faced womanizer.\\n\\n\r\nNow in terms of negative traits, the teasing rom-com situations of walking on a girl bathing (for example) increase, the plot acts like any generic shounen with petty drama, theres the obvious issue of it skipping conquests between season 2 and 3 of girls that play an important role this season, the previous mentioned issue of it becoming more like a harem where the goddesses are discussing who should get his affection (in turn becoming self-indulgent) and the lack of what made it seem good in the first place which is the work of keima to help the girls cope with their issues which in turn was what made them unique characters and not just anime stereotypes.\\n\\n\r\nLike I say a its the characters that make the story worthwhile and even know it kept throwing stupidity at my face i still, in the end, winded up caring for the stupid drama because the characters were entertaining enough to drive it.",
            "date": "2018-02-18T07:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 271840,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4329369.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ponina",
                "username": "Ponina"
            },
            "url": "https://myanimelist.net/reviews.php?id=271840"
        },
        {
            "content": "I'm going to assume if you're reading this review, you've already watched the first two season or you're looking at the overall ratings for all three seasons. If you're here for the latter, you've probably read too far. My Overall Score for this anime is in the top right, geez!\r\nI came into the season expecting nothing but the whole \"otaku girl conquerer\" premise. Fortunately, there was more to the story this season than just Katsuragi. I enjoyed the introduction of the goddesses as well as actual antagonists rather than just \"spooky\" loose spirits. Also, it's important to note that a bunch of stuff happens betweenseason 2 and season 3. This stuff is covered in the manga apparently, but not in the anime, so don't worry if the first episode is kind of confusing.\\n\\n\r\nThe art is fair and the sound was very good due to a few of the tracks. The song at the end was pretty killer, too.\\n\\n\r\nThere was a lot more character development this season, which is a good thing. Most of is from the interactions between three certain characters, though. Some of the characters still remain the same, which is disappointing. We get a boatload of colorful personalities, which helped to cover that up.\\n\\n\r\nI would have given this season a 7 overall, but the enjoyment factor was too much. I love me some good ol' fashioned real romance, angst, and hilariously awkward confrontation scenes. All of this starts in Episode 7, and I enjoyed the ride all the way to the very end (that ending tho, amirite...?)\\n\\n\r\nSeason 3 of The World God Only Knows takes the familiar premise, gently turns it on its head, and injects some real romance, botoxing its final score to an 8.\\n\\n",
            "date": "2016-12-04T22:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 234913,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5829165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/zeralul",
                "username": "zeralul"
            },
            "url": "https://myanimelist.net/reviews.php?id=234913"
        },
        {
            "content": "Should you watch The World God Only Knows Megami-hen? Definitely,this season of the TWGOK series is hands down the best for me. Up until this point in the story, all of the conquests that have been completed by Keima had not converged on any point, they had all been their own separate stories that did not interact with each over, but with this adaptation of the manga, many of them are brought together. Out of all of the seasons too this point, this one sticks with me the most. \r\nStory: 9\r\nThe premise for Megami-hen is that goddesses had been shipped in the same packages ofthe loose souls, with only a few of the previous girls hosting them. Previously, after being con-quested by Keima, the girls would completely forget the conquest, with some abnormalities here and there. With the introduction of the goddesses, the girls who host them will remember their own conquest. It changes how Keima approaches the re-conquests because all of his tricks will not work again. With this, the characters of Keima and the girls included in the series are developed even further, which is quite a surprise with its short amount of episodes. Some of the conflicts do seem a bit forced, or even rushed.\\n\\n\r\nArt: 9\\n\r\nThe art style is similar to the other 2 seasons, with the exception being the designs for the goddesses. It may be the same old, but it is still impressive even after 2 years.\\n\\n\r\nSound: 10\\n\r\nThe openings that have been created from this series are some of my all time favourite, with the first and third opening shining more than the second one. The endings are also very impressive, with it changing almost every episode depending on which heroine Keima is focusing on. The ambience and sound design during the episodes are also impressive, which helps with setting most of the scenes.\\n\\n\r\nCharacter: 10\\n\r\nKeima deviates from his cold, cynical character that was created through the first two seasons every few episodes, and through this the toll of being forgotten by everyone he has developed a bond with shows. Trying to avoid spoiling the last episode as much as I can, one of the scenes just sticks with me, replaying it over in my head all the time because of its excellence in demonstrating these feelings that Keima has developed. \\n\\n\r\nEnjoyment: 9\\n\r\nI've greatly enjoyed my time with the series, both in watching the anime and reading the manga. Experiencing all of the sub plots, and all of the characters varying archetypes, accumulates into an enjoyable time that most should at least try and watch\\n\\n\r\nOverall: 9\\n\r\nAs mentioned earlier, part of this season feel rushed. I feel like the only way to have remedied this would have been to air more episodes, but hearing that the second season didn't sell well would suggest that their wasn't a huge budget to work with. If you haven't seen this series already, the last few episodes should be watched back-to-back to experience them fully. \\n\\n\r\nThis will be one of the series that I can truly hold with high regard because of how it has effected me. Hopefully those of you have read this far will be influenced, as it is a great experience.",
            "date": "2016-06-13T07:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 220661,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3453725.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Darthman",
                "username": "Darthman"
            },
            "url": "https://myanimelist.net/reviews.php?id=220661"
        },
        {
            "content": "The World God Only Knows had a great run. While it's unlikely we will see a fourth season of the anime- as sales were less than stellar for the third season- the impact the manga and the anime have exerted over the medium is certainly palpable. Starting as an incredibly entertaining episodic manga, the story progressed into a genuinely unique and interesting saga which consistently drew upon past events in the plot to further develop the narrative. The Goddesses arc, which the third season of the anime covers, was the beginning of this (for the most part). Herein we find Keima and Haqua (Ellie istragically absent for most of the season) embark on a conquest bonanza, as Keima must woo a selection of his previous lovers to save the day. Its a thrilling ride from start to finish, full of laughs and even the occasional tear. \\n\\n\r\nIf you're an anime only kind of person, you're gonna be in for a real rude awakening. Goddesses starts off well after the last anime episode, and unfortunately skips two incredibly important conquests: Yui and Tsukiyo. The beginning of episode 1 tries its best to make up for this by providing a brief summary of both, but missing out on both of these arcs, in particular Yui, is going to really dampen the viewing experience. Break out your glasses and give them a read (Tsukiyo 43-46, Yui 81-89). Another important arc missed was Tenri/Diana, but lucky for you illiterates, they made them into an OVA series, so check that out. \\n\\n\r\nThe Goddesses arc comes at just the perfect time in the series to freshen up what was becoming something of a stagnant plot, drawing upon Keima's past conquests to provide fuel for a much more focused and high stakes story. To combat a dark and mysterious splinter cell in New Hell, which seeks to restore the evil days of old, Keima must find and awaken 6 Goddesses, all of whom reside in his old conquests. The problem? 7 of his previous conquests seem to still hold feelings for him, even showing signs of remembering the conquest. Using this as a base, Goddesses builds WGOK's most developed narrative, very effectively weaving in and out of Keima's separate efforts with the girls to advance the increasingly tense New Hell subplot. Barring one, each of the girls is given a well put together \"after story\" type narrative. In each, Keima builds off of the past conquest's themes, developing with each girl a deeper connection and understanding. Its really remarkable to see what was previously a completely episodic plot switch gears so seamlessly. \\n\\n\r\nKeima himself becomes the show's complete focal point, bearing the load of what was previously shared between Elise and himself. Haqua takes over Elsie's traditional role, but the chemistry and general cuteness Elsie provides is noticeably missing (though Haqua is undeniable endearing). Perhaps it is fitting some of the past seasons' brevity is missing, as Godesses' is to some level a much more serious narrative effort. Keima isn't the Lelouch-parody he once embodied; he takes on a completely serious role. While there is still plenty of humor to go around, Keima's got the serious pants on. He has moments of genuine desperation and concern, and its increasingly evident the revolving door of girls he must juggle is beginning to wear on him. Bear in mind, there are 7 girls, and 6 goddesses; someone is getting the ax. \\n\\n\r\nThe girls themselves continue to be endearing. While I certainly had a horse in the inevitable best girl competition, I, barring one, found myself liking every single heroine. It is unfortunate one of the strongest of the group is turned into more of a plot device than anything, and one deemed minor enough to bother giving a full arc. However, everyone else is given, as stated before, a convincing progression on their previous conquest. Also rather refreshingly, Goddesses manages to avoid the standard harem sexualization of the girls. While there is nothing implicitly wrong with this, it is nice to see a show handle its heroines with a some poise.\\n\\n\r\nAV-wise, Goddesses doesn't do much to improve or regress from previous seasons. It retains the same stellar score, which I've already heard a thousand times but still don't get sick off. Props to whoever was handling sound direction. The art and animation continues to go with the setpiece-emphasis, seeking to dazzle the viewer less with the animation quality and more with the overall product. There's plenty of scenes that just look great, but the animation itself isn't anything to write home about. The OP continues the WGOK tradition of being awesome, and I honestly prefer this one over the first season's legendary opening. The ED isn't anything special, but a nice tune nonetheless. \\n\\n\r\nOverall, it would be greedy to ask for anything better than this from Manglobe. This is a great anime, taking the pure enjoyment of previous WGOK ventures and giving it a new purpose. The focused narrative helps flesh out Keima's more complex character, and spending more time with his conquests allows for a deeper appreciation of their character as well. This is a show that manages to create more likeable heroines than shows with half the cast. It really is a triumph. Now go read the manga you dopes, my girl wins. \\n\\n",
            "date": "2016-11-26T21:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 234459,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2405295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yung_Doug",
                "username": "Yung_Doug"
            },
            "url": "https://myanimelist.net/reviews.php?id=234459"
        },
        {
            "content": "This is my 3rd anime review ever, and it will contain some minor spoilers and will not count the previews two seasons, because it is kind of the only one that matters story-wise, despite some minor things that happened in the second season, the OVA's and the Manga (Yes, I read the whole manga).\r\nKami nomi is the very first anime I watched out of my own decision. It is kind of an anti-romantic comedy, which mainly focuses on (almost) mocking stereotypes of most anime characters and specially visual novels.\r\nThe third season brings new elements that create space for a lot of character development, as muchfor Keima as with the supporting cast, which in this case are the girls.\\n\\n\r\nStory: 8\\n\\n\r\nThe plot is kinda the same of the previous two seasons, which had been hinted in the OVA's, but as I mentioned earlier, it introduces new elements that will provide a little twist in this format in its own context. And the best thing is; There's no filler AT ALL. We will see how Keima develops and changes , but I'll explain it a bit after. \\n\r\nAlthough it feels fairly rushed in the first half, you can get to understand everything if you pay attention to the first two episodes. The change of the typical \"feel\" of Kami nomi also changes drastically since the first episode, but it's nothing too deep or something you can't handle even if you didn't read a single chapter of the manga.\\n\\n\r\nArt: 7\\n\\n\r\nThe art is exactly the same as the previous seasons, and it's good. It's bright and full of life. Even these few scenes that take place in new hell give you this  \"good feel\" when you watch them. Somehow it just kept me smiling, but that's just personal taste.\\n\\n\r\nI will not talk about the animation, because I don't think there's anything special or remarkable about it, but bearing in mind this is no action anime, I will give credit to some moments that managed to catch the atmosphere perfectly. Specially the \"bye bye\" Chihiro scene. Even when in that scene nothing was really obvious, you are just strongly hinted what happened, and you can understand it perfectly thanks to the work done in that specific scene. It gave me chills. A LOT!\\n\\n\r\nSound: 7\\n\\n\r\nThe background music is the same as the previous seasons, with a few new additions in some scenes, which are fairly good.\\n\\n\r\nI usually skip openings and endings because of just personal taste, but I know there are a lot of chapters in this season that have their different endings, and these endings are sung by different seiyu's from the female cast. And YES, there's one that is sung by Kanon. \\n\\n\r\nCharacters: 8\\n\\n\r\nBeing a third (and rushed) season, there are quite a few characters that are introduced  and might confuse the hell out of you. Specially if you didn't read the manga. With the season being 12 episodes long, and having no time, the first episode tries to explain quickly these few characters and what's with their \"backstories (Conquests)\".\\n\\n\r\nThis is kind of a big spoiler, but I'm warning you right now: If you are an Elsie fan, you will not like this season that much. She gets excluded almost completely because there is something she has to do after the first episode ends. However, if you are a Haqua fan, you will love this. Thanks to what I mentioned earlier about elsie, Haqua gets to be the female lead and Keima's buddy. Although she could get a lot more screen-time, her character develops well enough, and she could even be the main heroin of this season (I don't know what word could fit better than \"heroin\", but I'm not really talking about a Haqua conquest or the drug itself. I'm talking about her as the main villain ass-kicker).\\n\\n\r\nBesides the characters introduced (and \"explained) in the first episode, there are more new characters that are the objectives of this season. These ones are quite close to Tenri's partner and are quite important.\\n\\n\r\nAnd we have Keima, our main hero. This dude goes through a lot now and gets developed as a character like you've never seen before. He starts to care for the people around him, and being more introspective, with the addition of feeling responsible for things in the real world that don't even concern him directly. \\n\r\nThere's a unique thing about Keima in this particular season, and you will notice it when you see it once again, as he is focused mainly on other \"real world\" stuff. OMFG I'm such a curiosity builder!!1!!!1!\\n\\n\r\nEnjoyment: 9\\n\\n\r\nI really, really enjoyed this season. It is by far the best. It shows you things about Keima and the whole Kami Nomi universe you never expected to see before (If you ever expected them in the first place). it is surprising and refreshing, and the comedy is still there.\\n\\n\r\nIt does not get a 10 because how rushed it feels, specially at the end. It is kind of an open ending and leaves you with a lot of questions, tho it is executed in a very awesome way. \\n\\n\r\nAnd yes, the \"Read the manga\" ghost strikes back!\\n\\n\r\nOverall: 9\\n\\n\r\nI recommend this even if you didn't really like the previous two seasons. It is a different experience. Tho it is not \"OMFG THAT JUST HAPPENED, PLOT TWIST, HOW INTELLECTUAL THIS IS\"... and so on, it will entertain you in several ways.",
            "date": "2014-08-19T17:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 157179,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3685101.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DolbyThX",
                "username": "DolbyThX"
            },
            "url": "https://myanimelist.net/reviews.php?id=157179"
        },
        {
            "content": "I really didn't enjoy the final part of this anime, especially in regards to the fact I read the manga first. Just a spoiler alert for anyone reading this in case you haven't finished or even started it....\r\nFirstly, in comparison to the manga, several arcs were skipped, some of which were really good ones. I was really looking forward to the Chess Club arc, and the Astronomy Club should definitely have been done considering the godess was in this season. There was a massive cut in the story, and it definitely ruined part of the whole flow of things for me.\r\nBut I think the worstpart was the ending. What the hell happened to it? In the manga, it was obvious what happened, and there definitely wasn't any of this \"feel sorry for the main protagonist\" crap. I was really hoping it was going to have a good closure, and up to the very end it followed the manga's ending perfectly. But then it just cuts off with him walking out the door, what the hell is that? \\n\\n\r\nOverall, this season ruined the whole series for me, and I really enjoyed the manga of \"The World God Only Knows\". I will definitely be telling anyone to avoid watching this anime because of the sear disappointment of this one season alone.",
            "date": "2015-10-17T15:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 201440,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2328385.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/kylehaupert",
                "username": "kylehaupert"
            },
            "url": "https://myanimelist.net/reviews.php?id=201440"
        },
        {
            "content": "If you haven't watched The World God Only Knows Season 1, 2, and Tenri OVA. Then you need to watch them to understand Season 3's story.\r\n---------------------------------------------------------------------------------\r\nStory - 9\r\nPrepare your feels, because this is what this season is about. \r\nThere are 3 worlds according to this story: Heaven, Hell, and Us. \r\nVintage is the antagonist in the story, Vintage is planning to revive old hell and to eliminate the Heaven. The Gods are planning to stop Vintage, however, the Goddesses have no power (Love) to stop them. So, the Goddesses enter Keima's past girls that he has conquered. Keima gets his warning from Diana, Diana tellshim that she needs her help to stop vintage. The Goddesses are trapped in Girls that Keima has conquered before. So now, he needs to re-conquer the past girls in order to bring out the Goddesses to stop Vintage. \\n\\n\r\nTHIS IS A GOOD STORY.\\n\\n\r\nIt brings refreshing material to The World God Only Knows, If you have ever wanted Keima to spend more time with a specific heroine, then it happens in this season.\\n\\n\\n\r\nCharacters - 9 ( Spoilers as well )\\n\\n\r\nYes, I did dislike how they didn't spend that much time on conquerings with Yui and Shiori, however, it does spend more time on Keima, Chihiro, and Ayumi. All three of them are the main people in this story, or atleast I feel like they are. However, what I really like is that they spent more time on the heroines from Season 1 and 2, this adds more feelings towards that heroine. Also, what I really fucking enjoyed the most is that KEIMA DEVELOPED. HOAAH This is a big step, who knew God's cry. He knows what he did wrong, he showed emotion, he CARED FOR SOMEONE! \\n\\n\\n\\n\r\nEnjoyment - 7.5 ( Spoilers )\\n\\n\r\nThe only flaw I didn't like was that it felt rushed. This season really did feel rushed to me which is a very big flaw. Most of the girl's conquests felt really rushed to me ( Shiori, Yui ). This story felt mostly focused on Chihiro instead of the Goddesses. Another reason why I felt like they rushed this ending is the actual ending. When all of the Goddesses are free and are having a battle with Vintage, I was disliking how they didn't focus on the battle, The battle and Chihiro having a conversation with Keima were going on at the same time. I disliked that part. They could have made a OVA to tie up the ending, by doing that, the battle would have been much more epic and more feels would be brought towards Chihiro and Keima. Well, that's just my opinion. But overall, too many things were going on at once. Haqua battle with vintage, Keima conquering several girls at one time, Saving Kanon, etc. This anime was very serious, there were rarely any comedy moments imo. It was focusing alot on: Past heroines, Keima, Vintage, Goddesses. \\n\\n\\n\r\nOverall - 8\\n\\n\r\nPros. - New story, more screen-time for old heroines, Character development, etc.\\n\\n\r\nCons. - Rushed, Seriousness.\\n\\n\r\nIf they were going for a much more serious route, then they shouldn't have rushed the season. I still enjoyed it though, I love The World God Only Knows. Still don't know why they chose that title, doesnt relate to the anime that much.\\n\\n\r\nRandom Ideas\\n\r\n-----------------------------------\\n\\n\r\nSeason 1 and 2 were probably fillers for season 3. Season 1 and 2 could have been a boost for season 3, so when you're attached to the characters ( Season 1 and Season 2 ), that's when they strike you with feelings ( Season 3 ).",
            "date": "2013-09-23T17:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 113979,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2830085.jpg",
                "scores": {
                    "animation": 8,
                    "character": 0,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/EIsword",
                "username": "EIsword"
            },
            "url": "https://myanimelist.net/reviews.php?id=113979"
        },
        {
            "content": "All together the three seasons of The World only God knows represent my favorite anime of all time, finally knocking dragon ball z from it's nearly permanent perch there. \r\nThe first season is very interesting and I was hooked after the third girl was introduced, the second season was the weakest of the three but I still loved it because they kept finding interesting new characters to introduce. The third season though, that was when the story finally topped dragon ball z. After an initial confusion of the first couple of episodes of season 3, mostly because I hadn't watched the ova's yet, I becamepossessed by the story, with a constant feeling of suspense keeping me hooked through out the entire season, which I binge watched in a single day.\\n\\n\r\nThe character development was very natural feeling, and the transformation was part of what kept me hooked, truly one of the best developed shows I've seen. Not only that but I feel in love with so many of the characters, their interactions were perfectly mixed with realism and classic anime comedy.\\n\\n\r\nThe ending though really got me, it was perfect but it got me more than any show ever has. I shed a couple tears, which is more than I have for a show before and I'm not even sure if it was more because of the way the show ended or if I was sad that it was over. I didn't even cry at the end of Angel Beats, that fact making me feel alittle bit like an awful person. \\n\\n\r\nAnyway I highly recommend the series to anyone looking to fall in love with most of the cast of a show.",
            "date": "2014-11-29T18:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 170383,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Brelic",
                "username": "Brelic"
            },
            "url": "https://myanimelist.net/reviews.php?id=170383"
        },
        {
            "content": "The third and final season for The World God Only Knows. This series has been... GREAT!\r\nStory: While season 1 was good with its story, season 2 was better. And yet, season 3 is even greater! Season 3 expanded even further into this show's world, introducing us to many more characters such as Ancient Demons and Goddesses. Keima's mission has gotten a lot more complicated!\r\nArt: No significant improvement, which isn't bad at all, considering this show's art is very good as it is.\r\nSound: Same as above, improvements weren't needed.\r\nCharacters: Yet again, the characters have improved drastically. Somewhat of a shame that there are good characters thataren't given as much limelight as before... But on the other hand, we do get a lot more focus on some of the characters that we love very much!\\n\\n\r\nIMPORTANT: Unfortunately, there's a lot more manga to this series that hasn't been animated yet. I hope to the Gods of anime production that things work out, and the developers get to working on this series again. As it stands, it doesn't seem impossible! Let's just pray!\\n\\n\r\nSo, with that, the series is over. Overall, I loved it. I'm so glad I decided to watch it.",
            "date": "2018-09-19T08:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 289407,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5700136.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Empyreanpain",
                "username": "Empyreanpain"
            },
            "url": "https://myanimelist.net/reviews.php?id=289407"
        },
        {
            "content": "The World God Only Knows Season 3 - the story about a guy that has to conquer same girls as before, however with higher difficulty level this time!\r\nThe story: \r\nIt wasn't something outstanding or anything however it was really enjoyable and entertaining! \r\nI would recomend it to anyone that seeks for a good commedy ;3\r\nRating: 9/10\r\nThe art:\r\nAbove avarge. Nothing more to add.\r\nRating 8/10\r\nThe sound:\r\nReally good soundtrack that fits the atmosfere.\r\nRating 8/10\r\nCharacters:\r\nEntertaining, well developed and original characters. Personally I found  Kanon my favourite character in the whole series!\r\nRating 9/10\r\nEnjoyment:\r\nEntertaining and interesting, nothing more to be added.\r\nRating 10/10",
            "date": "2018-05-20T08:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 280999,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5693375.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/RedSkittleFox",
                "username": "RedSkittleFox"
            },
            "url": "https://myanimelist.net/reviews.php?id=280999"
        },
        {
            "content": "I love this anime still. But it's by far my least like season of the 3. \r\nTo start from the start i'll say the biggest problem with this for me .\r\nHow much this deviates a ton from the previous two seasons. Where those two were about the MC going around and getting girls to fall in love with him with funny scenarios. This season doesn't do that and decides to have one continues plot that last throughout the season. The plot itself could have been interesting but it's just eh at best for me. I like the idea of him having to go back andmake the girls he's already had fallen in love with him fall in love with him again. But it's badly done in this. \\n\\n\r\nThe story also decides not to have him conqueor any girl at all and that is something i just don't like. Especially sense it's part of the identity of the show.\\n\\n\r\nThere is also the fact of how little we get of Elsie. By far top 3 characters in this show. It's honestly amazing how little we get of her considering she was the first girl introduced and is the MC's partner. \\n\\n\r\nWe are suddenly given this rushed explanation on girls we've never seen before and the MC has made fall in love. Turns out that these are girls from the Manga that he'd conqeurored. But they for some reason didn't do any OVA's for these girls so we are then given these girls suddenly that we have no experiece with and are expected to have any care for. It honestly bugs me how they did this sense they seem to have interesting stories. \\n\\n\r\nOne of the girls that were suddenly introduced i actually have a problem with. She and the MC had switched bodies and as a side effect or some dumb crap she has become boyish now and even dresses as a boy. She was originally a very girly type but now that personality is gone. It is the equivelant of killing someone. That girl and how she used to interact and how she viewed the world are now gone and replaced by a completely different girl. This honestly bugs me and i wish she stayed the same. Appearantly in her story she learned not to do what ever someone tells her. This is a message she could've learned without her original personallity being destroyed. \\n\\n\r\nThen there is the ending and this ending promtly explains why harem's in anime are always a bad thing. \\n\\n\r\n~~SPOILERS~~\\n\\n\r\nStory seems to be going with Ayumi and personally i love her as a character and find he and the MC go together well. It also make sense with her being his first original conqeuor. Then Chihiro comes in and while i do like her. I just don't think she fits the MC at all and the fact the Mc seems to go for her kind of bugs me.\\n\\n\r\nAt the end we are shown the MC actually crying witch is something big for this guy. But it's over Chihiro and it can eitehr be because he actually likes her or because he feels bad about what he said to her. \\n\\n\r\nEither way it ruins an awesome moment with both the MC and Ayumi on the boat and them kissing each other while in wedding garb. I'd honestly love to see the Mc mary her and it should've ended there.\\n\\n\r\nI have many issues with this ending and i'm not a fan that the MC and Ayumi don't seem like they will be a thing.\\n\\n\r\nI still like Elsie and Huaqa more then any other and think they'd be the best romances.\\n\r\n~~SPOILERS OVER~~\\n\\n\r\nWish we got more of what i find to be the most interesting girls/conqeuors. They are the former Rich girl, Teacher and Karate girl. \\n\\n\r\nThe former rich girl was interesting and wish we saw more of her. Still wish her story ended with her deciding to do well in school and take over her fathers buisiness on her own and become rich by her own merits.  Also wish they weren't living in a run down house.\\n\\n\r\nThe Teacher was awesome and interesting. I really liked her and wished she'd at least became a teacher at the school.\\n\\n\r\nThe karate girl was interesting because we saw both her personalities fighting each other. One wanting to be girly while the other not wanting to show any signs of weakeness. \\n\\n\r\nI feel these would've been nice to see in this or at least get more attention \\n\\n\r\nThe ending also seems rushed. All of a sudden the final girl is being carted off and we are barely shown the final showdown or anything. \\n\\n\r\nNow before i go i still want to put out the idea that we need a parody  show of this. But have it with a girl accidently signing the contract and have her have to go and make other girls fall in love with her. This would be awesome and hilarious to see. Obviously we'd still need a girl partner as adorable as Elsie or almost.\\n\\n\r\nOverall a good season but just not like the previous two.",
            "date": "2018-03-02T04:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 272799,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=272799"
        },
        {
            "content": "OK, so my thoughts on this, Great series overall. If you finished TWGOK season 1 and 2 make sure you watch the Tenri Arc OVA BEFORE you start the Goddesses arc, otherwise you will be confused and not know who some of the characters are.\r\nMy only real complaint with this season is that they showed characters and events that didnt occur in the anime and if you know want to know who they are you need to read the manga, luckily that is only a small part. As for the rest of the show its awesome. I really came to like all the characters andconnected with them. Honestly story, sound and character development mainly (Katsuragi) was especially well done. the comedy was The final season was more action and serious based then the previous and the jokes are not so relevant. However when present they are great. In terms with the ending I would have liked to seen more however still a fitting end to the show. I hope they continue as the manga is still ongoing. \\n\\n\\n\r\nTime to rap this up....\\n\\n\\n\r\nI recommend this... I just fished watching this season all of 20 mins ago, and am currently starting the manga where the anime left off...\\n\\n\\n\r\nin other words go watch this, and make to sure to watch the previous seasons first to enjoy this series in its entirety.",
            "date": "2013-10-05T23:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 115665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1269559.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tokimitsu",
                "username": "Tokimitsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=115665"
        },
        {
            "content": "\"Kami nomi zo Shiru Sekai: Megami-hen\".. it's not your typical Harem Anime...\r\nThat's why this Anime is one of my favorite anime.\r\n*Spoiler alert* Sorry I can't make a review without spoilers..\r\nStory: 10/10\r\nThis season is the best among the two other seasons. Why? Because of the Goddesses. The conquering part in this arc is so different than the other two seasons. I like the way the Goddesses fight over for Keima. The girls in this arc already knew that they were not the only girl for Keima. In short, they already knew that Keima is a Harem king unlike the past two seasons, they'll just forget aboutKeima. I also like the story about how the conquered girls' memories coming back. Because of that, the Romance part became strong. In this arc, the supernatural part also became strong and its chemistry on Romance is very good but they never forget to make a Comedy part. I also like the way Keima's seriousness and the way he's not always playing games anymore. The ending made me feel sorry for Chihiro. The ending was very good. Feels, feels, feels.. so overall, 10 for the Story.\\n\\n\r\nArt: 9/10\\n\r\nThe art is great. The atmosphere always makes me happy.\\n\\n\r\nSound: 9/10\\n\r\nThe soundtrack fits with almost every scenes like Comedy part, Keima's gaming part and especially the Romance part. The Ending was fair enough for the anime. The Opening was very very very good.. the lyrics is truly related to the story.. especially its full version.. the accent of the artist is what made me feel wow.. all of my favorite seiyuus are here (Hayami, Kana, Nao) so overall, 9 for the sound.\\n\\n\r\nCharacter: 10/10\\n\r\nOh, how I love all of the Characters in this Anime. Their roles are perfectly suited for the story.The Goddesses were also the one who made the story more interesting. I like their uniforms and how the characters are being drawn. I'm always interested on how Keima always doesn't give a damn on those people around him. He's always calm especially when he's thinking of a solution. But for me, Haqua and Kanon was the main reason why the Character is 10. \\n\\n\r\nEnjoyment: 10/10\\n\r\nI always laugh when I watch this anime, I always feel giddy when there is a Romance part especially on Kanon and Shiori's part. I felt sad when I watched the ending though..\\n\\n\r\nOverall: 10/10\\n\r\nAs you can see, majority of my ratings are always 10. So majority wins.. here's my 10.. take it...",
            "date": "2014-04-10T10:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 139469,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3537381.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Thir-kun",
                "username": "Thir-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=139469"
        },
        {
            "content": "I really liked the storyline and the girls in the anime fell in love with the MC for a good reason, unlike other harem anime where the girls simply fall in love for no particular amazing reason. However, the one thing I felt could be better was that the ending was rather forced. I still like the anime but the ending could have been left a bit more to the imagination of the viewers, allowing anyone to ship whoever they like. (Of course, there would probably be people who like the ending given.) In the end, it is not that I hate the Chihiro xKeima ship but the other female characters were pretty much discarded after their conquest, though their conquest stories were nice too. Also, I would like to state that Chihiro wasn't given a major role at the beginning; she was just another conquest target. Why did the creator choose Chihiro instead of any of the other female characters? Was there a poll of some sort? Was it just because she was his classmate?\\n\r\nAll in all, my main point is the ending could be up to how ever the viewers want to end the story, rather than forcing everything to simply end with a single ship and 'The End'. (I feel that would end the whole story with a bad taste.)\\n\r\nWell, it is not like I have any right to criticise since I haven't created an anime or anything. I just wanted to state my opinion. I still really liked the anime though. The male MC was also really cool with his analytical thinking.",
            "date": "2017-02-27T07:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 241503,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Anonymous4352",
                "username": "Anonymous4352"
            },
            "url": "https://myanimelist.net/reviews.php?id=241503"
        },
        {
            "content": "After having watched the first two seasons, I was wondering where this could possibly lead to. Not having read the manga or anything, I had no clue what I could expect other than the same thing. That is, the classic story of the guy conquering girls with his dating sim skills. And well, it sort of is, but not really. Instead of the usual, we get it served on a completely different platter, putting not only the story, but the characters in a completely different light, and making this season seem more realistic and gripping than anything that has happened so far.\r\n\"The World God OnlyKnows : Goddesses Arc\" (or the Japanese title, whatever suits you best) is the third season of the Kami Nomi series. While I'm writing this review, this season is currently the highest ranked out of the three, and with good reason. In my review of the first season I wrote that it was silly and funny, with a hint of romance. This however appeals to only a part of the anime community, while the other part simply ignores it and moves on to more serious anime. This season feels like it sort of compensates for the goofy encounters and whatnot from the first two seasons, by providing us with actual relationships and returning characters who feel more solid than ever before, along with a more solid story.\\n\\n\r\nArt:\\n\r\nThe art is pretty much the same as the previous two seasons/OVAs, but with more flair added to it. You could consider calling them \"special effects\", but it does seem like more effort was put in the animation than before, along with some CG effects to add to the atmosphere. In overall, it felt more gripping, and at times it was quite stunning. The lighting in certain scenes was also excellently done, and provided a nice addition to the mood the scene was set in.\\n\\n\r\nMusic:\\n\r\nDifferent. This season was definitely meant to be taken far more seriously than the others, so the music had more of a thrill to it, and it succeeded quite well in moving me personally. Although I got to admit... I prefer the old OP, ED and BGM more. But that's my opinion as a RomCom SoL fan. If I were to look at it in the perspective of a more serious anime fanatic, I would say that it was great, and sometimes beautiful to listen to. (And yes, the last song moved me more than it should have, to those who have seen it.)\\n\\n\r\nStory (Contains minor spoilers):\\n\r\nAssuming you're already familiar with the first two seasons and the OVAs (and if not, then I'd suggest you watch those first before even reading a review on this), the base of the story is still somewhat the same. We still have our main character (Katsuragi), his partner (Elsie), and the side cast from before. Some new characters were introduced, some rather rushed (due to shortening the story and leaving behind some backstories), and others more properly. We also get introduced to a few new groups: The Goddesses, who have taken refuge in the hearts of Katsuragi's previous \"conquests\", and Vintage, an evil group from Hell who wants to kill them.\\n\\n\r\nI'm going to be honest here, this story was far more complicated than ever before. Due to the more active casting, and giving the side-characters more screentime (at least, that's what it felt like to me), it gave the story a lot more depth than it usually has. Combine that with the attitude and struggles of the main character, and you get something that doesn't really look like a Kami Nomi season, but sure as heck feels like it. It had this edgy undertone to it, with people actually being in danger this time and whatnot, but it wasn't all that unexpected. In fact, it was a great change of pace, and it all felt like it was building up to this season so far, using everything the first two seasons provided, and creating an arc that goes very well with the overall story.\\n\\n\r\nCharacters:\\n\r\nLike I said, the casting is very much the same, with the inclusion of the goddesses and the evil gang (which unfortunately doesn't get nearly the amount of screentime it deserves and needs). However, thanks to the character development this series had for over 25 episodes, they had a lot more depth to them. Which is good, otherwise you couldn't possibly take this plot seriously. Because as good as an arc it is, it relies mostly on the characters performing properly, otherwise it all falls apart into a messy piece of a RomCom. After all, and especially in this case, it's the characters that make the anime.\\n\\n\r\nConclusion:\\n\r\nWhat I personally liked about this anime, is that things didn't go nearly as smooth as it used to. The main character faces an old foe in a new jacket, as you might say, and every plan he used to have no longer works the way he wants it to. That's what makes the \"Goddesses Arc\" far more appealing to those who like to be surprised, and are tired of the same old stuff, while at the same time satisfying those who loved the anime from day 1, cause of its everlasting sillyness that exists even in this season, with the goofiest things happening at the most serious of times, allowing the audience to take a breather and smile. The third season combines the comedy we experienced before with a dose of drama it needed to balance itself out. A lot of anime have experienced the fate of repetitiveness, and it's thanks to this arc that this anime did not experience the same thing.\\n\\n\r\nI was glad I watched this anime, and very satisfied with its (current) ending. If you haven't watched this season yet, I seriously recommend it. If you haven't watched the anime yet, and still bothered to read this review, go watch it, it's well worth your time. \"The World God Only Knows\" kept me at the edge of my seat, wanting to finish each season as soon as possible, simply because I enjoyed every minute of it. It never really disappointed me, and I hope that you'll feel the same thing when you watch it. After all, who doesn't want to take a peek in that world?",
            "date": "2013-12-06T06:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 122745,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/UnknownUser-",
                "username": "UnknownUser-"
            },
            "url": "https://myanimelist.net/reviews.php?id=122745"
        },
        {
            "content": "I don't understand why the past two seasons haven't sold so well. To me it was a great anime and the only reason I didn't start watching it until now is the way the synopsis of the first season was. Which would throw you off. It doesn't seem to appealing at first but looks can be deceiving, right? So maybe thats why. The comedy is really good in it and I say give it a chance before you throw it under the bus. \r\nStory:9: The first part was a little confusing and risky skipping so much plot but after the first episode you can catchon pretty quick. The first two seasons built up to this season pretty well with a better ending on this season. But the open ending made you question to many things. Who would Keima actually get with? Who was the homeroom teacher really? Plus many more questions. The comedy is what makes this anime though it makes you literally laugh out loud.\\n\\n\r\nArt:7: The art wasn't anything fancy or stood out its just the typical anime art.\\n\\n\r\nSound/Music:8: The music in this anime I have always liked and always made me want to dance and the ending song moved move me, it makes me wonder if that was really the end for Keima and her?\\n\\n\r\nCharacters:9: The character development really showed in this season you get to see what became of all the characters and watch them grow and grow. When keima walked out of the room you could just see the development of the main character.\\n\\n\r\nEnjoyment:9: I always enjoyed this series, the comedy is what makes it and how the characters connect.\\n\\n\r\nOverall:9: I would give this a 9, has the feels, the laughs, the connections and the development.",
            "date": "2014-03-31T19:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 138139,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/608525.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/CalamityGami",
                "username": "CalamityGami"
            },
            "url": "https://myanimelist.net/reviews.php?id=138139"
        },
        {
            "content": "This is my all time favourite series,and this arc is my favourite arc.\r\nI laught,i smile and i cry when enjoying this series,especially for the Megami-Hen.\r\nStory (9/10):\r\nVery interesting,different from previous season and show the conquered characters than showing the new ones.And plus some action,this is a great part for the series.\r\nArt(8/10):\r\nYeah,i give 8 instead of 10 because the inconsistency of B size(on B-W-H)from the size i saw at wiki,the medium ones look very big on the anime.Just it.\r\nSound(9/10):\r\nHanazawa Kana and Touyama Nao,two of my favourite seiyuu,covering the voice for two nice character.I also love the theme song of all TWGOK series.\r\nCharacter,Enjoyment:\r\nI rate 10 for character becausethey're moe and have good personalities,but i only rate 9 for enjoyment because of the skipped arc and i already read the manga.",
            "date": "2013-10-24T03:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 118089,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/vale979",
                "username": "vale979"
            },
            "url": "https://myanimelist.net/reviews.php?id=118089"
        },
        {
            "content": "I think it's great. it has more conflict than the previous series. it's not just about conquering the girls. there are chaos if you fail. and that's great but not enough for masterpiece. there are something minus in the story line, even if I can't say that at least I feel that.\r\nbut you know the opening which sang by Oratorio god only knows are the masterpiece..",
            "date": "2013-09-27T03:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 114395,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/hanakana",
                "username": "hanakana"
            },
            "url": "https://myanimelist.net/reviews.php?id=114395"
        }
    ]
]