[
    [
        {
            "content": "Being a great fan of the typical Romeo X Juliet school-twisted manga at hindsight, I was wishing for an anime adaptation of this rom-com for sometime, and when it premiered in Fall 2018, I was SO happy and ready for the anime adaptation by Liden Films, and it delivered flawlessly (well, small faults but big wins). (Yay, Happy Xmas wish granted!)\r\nThe story...let's just say that if you know a even a little bit about the Romeo X Juliet Shakespeary context, it's the exact same premise here, just in terms of different factions, mainly the White Cats and Black Dogs, led by both leaders Romio Inuzukaand Juliet Persia. So with that, Dahlia Academy Boarding School (Juliet), was made as per the neutral ground for both factions to have and nurture education for everyone regardless of which faction they belong to. However, as both Inuzuka and Persia encounter each other *starts rolling Romeo X Juliet the play*, the amount of controversy that both have that's weighted on their shoulders become the main problem for concerning people.\\n\\n\r\nAnd that's where the side characters come in. From the assistants, Inuzuka's ever-helpful assistant-cum-crush Hasuki and Percia's strangle-hold Princess Chartreux (just call her Char) are always there to help shape up each counterpart's emotions and feelings about each other, and confront each other as to deal with countless situations with the slightest damage possible. The most frightening are always the top brass, or model counsellors such as Inuzuka's own older brother Airu (which he despises greatly), twin sisters Kochou and Teria from the Black Dogs and Persia's relentless leaders Cait Sith, Anne Sieber and Rex from the White Cats to name a few. And of course, the White Cats rebel faction of Aby Ssinia, along with his supporter-cum-crush Somali and few others. Their depiction in the anime is just as frightening as in the manga, so great pointers for showing their cruelness. Overall, all characters were done as well as how they were in the manga.\\n\\n\r\nFrom here on, really no problems at all. Liden Film's art and animation, bright, clean, fluid and showcasing some of the most simple but bad-ass animations when it comes to the serious stuff (e.g. scenes of action). That, I can go along with it. Same goes with the music too. I was concerned about FripSide's songs as the quality of songs they were pumping out in the modern times were average or didn't sound very good (as per the case of Dances With The Dragons). But, once that OP played, I was rest assured, this OP was fantastic and great, along with Riho Ilda's ED (which I should listen to her songs more) which was icing on the cake.\\n\\n\r\nIf there is the minimum fault I could lament with, was that the storytelling was quite slow, but once I compared that to the flow of the manga, it allayed most of the fears I had about pushing quantity for quality, and am glad that the slow storytelling compensated for most of the enjoyment I had for this anime. Heck, I'd even say this anime adaptation surpasses the manga in every way. It's a great one I tell you. If you're a fan of the Romeo X Juliet archetype, this anime is a must recommended watch. It puts a smile on my face, and so should inflict on you as well.",
            "date": "2018-12-21T09:42:00+00:00",
            "helpful_count": 74,
            "mal_id": 296385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=296385"
        },
        {
            "content": "If you take a classic story like Romeo and Juliet and convert it into a modern romantic comedy, you’d get Kishuku Gakkou no Juliet. While neither series are alike to each other, they do borrow a few familiar themes with the most prominent being a forbidden romance. But there’s more to that, no?\r\nRomance is practical in a show like this but it made me question first what the were really aiming for. I’m not familiar Yousuke Kaneda’s works but when it comes to a rom-com, they made the point crystal clear. Romio Inuzuka and Juliet Persia are in love. It’s the type of love thatties these two lovebirds like fate. However, it’s a forbidden love as Romio and Persia belong in opposite sides of society. In their school (Dahlia Academy Boarding School), there are two rivaling countries. They are known as the “Black Dogs” and the “White Cats”. As the respective leaders of their dorms, you can expect a whole load of drama coming their way.\\n\\n\r\nAt first, this show felt like an experimental story of trial and error. The first few episodes depicts Romio and Persia in a relationship although they must keep it a secret to avoid consequences. They face numerous obstacles with their secret often being risked in public. This creates consequences which misunderstandings arise. Throughout the series, people assume Romio has been harassing Persia. There’s countless times in the show where Romio has to defend his own pride while maintaining his poker face persona. On the other hand, Persia has trouble hiding her own secret but can’t help but stay in love with Romio. You get the big picture here? The show sets up this sort of dilemma that seems to signal for a tragic or doomed relationship. And that’s a good thing. It makes the show feel less predictable as viewers will anticipate how their relationship will ultimately end. Will their relationship be an everlasting love or is it fated to be a tragedy? \\n\\n\r\nWhile all this drama exists from behind the scenes, another main selling point is the rivalries in the show. The Black Dogs and White Cats are often going head to head in competition. Their personalities and attire also contrasts with each other greatly. The anime depicts the Black Dogs as rowdy individuals that almost seems to allude their behaviors as animals fighting for their territory. On the other hand, the White Cats are dressed more cleanly and maintain an aristocratical attitude to maintain their presence. Like cats, they are also cunning and are not afraid to take risks. The series takes opportunities to showcase both sides’ strengths and weaknesses. Through competition, the Black Dogs and White Cats strives to win no matter what in their adamant rivalry.\\n\\n\r\nWhile Romio and Persia is the main focus, I suppose the audience wonders why the key visual contains other female characters. Make no mistake. This isn’t a harem despite the deceptive image of several girls surrounding our main male protagonist. Characters like Char, Hasuki, and the Wang sisters adds doses of drama in their own ways. For instance, Char often teases characters in playful ways like a curoius cat. Romio becomes one of her key targets although most of this is played for laughs. Hasuki is more outgoing and friendlier with others and that’s thanks to Romio’s influence. As one of the very few characters who knows the truth of his relationship with Persia, she’s definitely a character that he can trust. Unfortunately, not every character in this show is too welcoming. The Wang sisters are an example of this as their role has little impact on the overall story. Their debut in the show is nothing more than showing their status at school as prefects and there’s minimal character development for either girl. Still, you may wonder if this show has emotional drama. In the second half of the series, Romio and Persia’s relationship is really tested as they encounter more complex problems such as Romio’s brother.\\n\\n\r\nWatching a romantic comedy like this probably gets predictable if you’ve seen similar shows before. The repetitive formula of misunderstandings, emotional segments, and character chemistry is usually drawn through dealing with social issues. Now I’m not going to deny this show is a cliché teenage soap drama. However, the show seems to shine best when we see the importance of Romio and Persia’s character relationship. Between the humor and drama, it maintains a balanced story without jumping over itself. However, I do wish the show extended its plot more from the manga. The series is ongoing and with just 12 episodes, there are other characters that are omitted. The plot seems to be structured in a way that gives the overall story its flow but not truly adapted to my expectations. \\n\\n\r\nAs a show produced by Liden Films, it’s satisfying to see the faithfulness of the character designs. The contrasting attires of the Black Dogs and White Cats shows their status at school with their personalities. Romio and Persia are the two to keep an eye on the most for their character expressions. This is because they behave in both honest and deceptive ways depending on circumstances. Thanks to characters like Char, we also get tons of humorous moments thanks to her manipulative antics. The feminine voice of Persia is also expressed adequately to showcase her elegant personality. Even when she cross-dresses a boy, Persia still maintains an overall cool image in public; a contrast to her more fragile self when alone with Romio. There’s also some fan service in the show so do be prepared for some cliché pitfalls like accidental perverted moments with loose clothes. Yes, this romantic comedy has it all.\\n\\n\r\nKishuku Gakkou no Juliet is far from being a classic Shakespearean tale but manages to capture the magic of a romantic comedy. I’ve seen many rom-coms in the past and most falls for the same tropes over and over. This anime is vulnerable to some of those tropes but is also able to tell an convincing story with memorable moments. Don’t expect this to be a big hitter of the year but do be prepared for a gleeful rom-com amplified by the charms of a star-crossed couple.",
            "date": "2018-12-21T09:03:00+00:00",
            "helpful_count": 50,
            "mal_id": 296380,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=296380"
        },
        {
            "content": "Romeo and Juliet the name is no stranger to us, right? yes they are a pair of young brides who love each other but his love does not go smoothly and is opposed by his family. Romeo Juliet himself has a variety of storylines ranging from sadness and end to happiness.\r\nKishuku Gakkou no Juliet tells of two young couples namely Persia Juliet and Inuzuka Romio who have secretly established love relationships. Series adapted from \"Manga\" written by Kaneda Yousuke is very interesting because it takes the legendary romantic story of Romeo and Juliet not surprised many spectators were deeply moved, and wrapped in comedy elementsthat made the audience laugh out loud making this RonCom series became popular among teenagers.\\n\\n\r\nNowadays, technology has begun to evolve rapidly as time goes by, anime began to develop in terms of depiction and graphic design. This series takes the story of antiquity where ancient buildings have their own charm. Color selection in this case also has a very significant effect. the action that makes this series even better the process of drawing an action-themed series is difficult because it requires more frames to come out and this series is already good in its drawings, but what makes this more interesting is the depiction of ancient times which makes it more realistic and has a characteristic distinctive.\\n\\n\r\nincomplete if the storyline and depiction techniques are good if not supported by good voice actors and music background. Studio LIDENFILMS brought Kayano Ai as the voice of \"Persia Juliet\" while the duo Oono Yuuki played the role of \"Inuzuka Romio\". Love With You sung by \"FripSide\" became the opening theme while the closing part was Itsuka Sekai no Kawaru made which was sung by \"Riho Lida\".\\n\\n\r\nIn this series has the first three character play \"Persia Juliet\". Persia herself is a girl who wants to change the world for the better but the one who is the barrier is her little cook and the one she loves, \"Inuzuka Romio\". the nature of being angry, caring for others, and most importantly being honest. In the midst of their romance a girl who honestly likes Romio Inuzuka she is \"Komai Hasuko\" she is a cheerful and passionate girl who cares for her friends.\\n\\n\r\nthe story of Romeo and Juliet is a romantic story that was legendary years ago until now with the Kishuku Gakkou no Juliet series that has a storyline that is a bit similar to the legendary story to honestly make some people carried away but unfortunately in this series it has no drama which is good but for some people it is good enough than the series that is full of drama and makes some people touched and full of emotion.",
            "date": "2018-10-26T16:47:00+00:00",
            "helpful_count": 51,
            "mal_id": 292670,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6966818.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shirokuza",
                "username": "Shirokuza"
            },
            "url": "https://myanimelist.net/reviews.php?id=292670"
        },
        {
            "content": "We have all seen the Romeo and Juliet tale before or at least know of it. It’s one of the most common plays taught in many high schools around the world. It is deeply ingrained into the public conscience, even to those who have never read or seen the play. Its famous for being arguably the easiest of Shakespeare’s plays to understand. It's a romantic tragedy, and that certainly adds to the appeal. Teenagers definitely like to use it to point out what happens when parents, families or affiliations don't support their little love affairs. What’s interesting about it is that, despite being one ofthe oldest and world-renowned stories of all time, it still manages to draw people in with interest. \\n\\n\r\nBased on Yousuke Kaneda’s manga of the same name, Kishuku Gakkou no Juliet (Boarding School Juliet) is another rendition of the classic Romeo and Juliet love affair with a more modern take. I was surprised to find that this turned out to be a good romantic, school comedy-shounen than what I initially thought. I don’t think this would have worked as well as it has if it leaned more towards shoujo. When you look at the premise and setting, it has all the markings of a generic show, but how does it make this all work here? Well, there are two key facets to making a Romeo and Juliet story work. First, the two main characters need to be likeable, relatable, and interesting. Second, the hatred between the two groups needs to be both arbitrary and equal between the two sides. Some stories make the mistake of nailing the drama aspects but fail to make the characters interesting. Others tend to make one faction more detestable while making the other seem to be in the right. Boarding School Juliet was able to execute both facets successfully while leaning more to the comedy side of things.\\n\\n\r\nThe prestigious Dahlia Academy which educates only the elite students from the Nation of Touwa to the East and the Principality of the West. Meet Romio Inuzuka, the first-year leader of the Black Dog Dorm that represents Touwa whose members are frequently clashing with the members of the White Cats’ House led by Juliet Persia, who is also a first year, that represents the West. What’s the catch? Inuzuka has fallen in love with his rival and sworn enemy, Persia. The story depicts his struggle to keep up the pretence of hating her—along with the rest of her House—when every time he sees her. He usually goes into panic mode at the mere sight of her that it makes his heart race. He is constantly worrying if anyone else shows up he has to pretend to fight her. The show is also good at comically portraying the excruciating range of emotions the smitten hero experiences as he tries to conceal his all-consuming love for Persia with predictably disastrous results. When the two finally get the opportunity to meet alone—and without fighting each other—Persia admits that she too likes Inuzuka. No silly games of “Ifs or maybes,” but rather, more of a “How on earth can they?” Especially given all the obstacles and challenges placed before them.\\n\\n\r\nOur main protagonist goal is that one day, at the right time, that their love for each could bridge peace between the two factions, although, there is a lot of groundwork to do before that could be achieved. The shows antics is mainly based around Inuzuka and Persia trying to have alone time in secrecy for the touching moments to bond. Unfortunately for them, they are constantly interrupted in one way or another by the rivalry and ongoing war between the two Houses. The supporting cast tend to be the culprits of interrupting the sweet moments between the couple, they also serve to show their dynamics with both main characters respectively. Hasuki Komai is a childhood friend of Inuzuka who has a crush on him, a loyal friend and always looking for a fight with the White Cats’. Scott Fold is a hopeless suitor of Persia who is always trying to impress her while trying to one-up on the Black Dogs. Lastly, a snobby princess and a close friend of Persia in Chartreux Westia. She’s a royal pain in the ass to Inuzuka, she acts as a bit of an antagonist for him but later becomes a supporter of sorts since she can see that he makes Persia happy. \\n\\n\r\nThese characters help provide many of the laughs and a lot of physical and visual gags. The show is equally at its best when they are all interacting as well as the alone time with our main couple. Everything just clicks, and it goes to show that the characters are enjoyable and that makes for a more interesting comedy. Admittedly, not all the jokes land but this is definitely one of the better romantic comedies. Studio LIDENFILMS did a fine job with the backgrounds as it depicts a more old-school, fairy-tale, quasi-European look with its architecture and designs. It seems very much like a hodgepodge of styles, to the likes of Nisekoi, in its character designs and layouts. The fanservice does feel out of place, it feels more like a quota to have it in there. OP and ED are serviceable. The soundtrack is complementary to many of the well animated visual gags as well as the light-hearted atmosphere.\\n\\n\r\nBoarding School Juliet is a very simple romantic comedy that has good execution, in saying that, there are areas where its lacking, for example, the backstory to the characters could have been expanded upon more, and there are moments where it feels like certain arcs are dragging. But it makes up for it by having Inuzuka and Persia being very interesting and their behaviour is both very human and very heart-warming. On top of that, the minor characters are also nuanced and incredibly critical to the story and are evenly divided between both sides of the conflict, so there's a good balance of both personal vendettas and character development. The message of the show is that love triumphs over hate.\\n",
            "date": "2018-12-21T08:55:00+00:00",
            "helpful_count": 47,
            "mal_id": 296379,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3264993.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/papsoshea",
                "username": "papsoshea"
            },
            "url": "https://myanimelist.net/reviews.php?id=296379"
        },
        {
            "content": "The disclaimer seen in the beginning has to be one of the longest anime has to offer and it is no wonder. The title of this series could as well be changed to \"Fuck You, William Shakespeare\" and that wouldn't even affect the level of subtle we have at hand. Make no mistake, however, this isn't a parody, this is just a disgrace.\r\nWe have school settings here and the school is divided in two because people apparently really hate each others. In this other divided half -- called House White Cat, lives our Juliet, and in the another -- called House Black Dog, lives Romio.The daily school life of our students consists of people slapping each others in the face and acting like the opposing party members are total buttholes. While this is pretty much how different opinions work in irl and especially in politics, with Juliet's case there just is no reason to give a damn. \\n\\n\r\nJuliet herself is pretty much like every background anime girl ever except this time she got the role of a main. She hardly has any personality, and in generally, it is hard to even see why the main male lead would fall for her as she is just totally empty character. The main dude presents himself as some sort of cheap \"girls like guys like these, right?\" stereotype. He is practically one of those shojo love interests that solely exist in romance series until the girl realizes there is more to guys than their outlook... except this time he is the real main character. The only mildly interesting character and the only one who seems to have some sort of personality is Harusi from Black Dogs and she is used basically as an element in the series to a) create comedy and b) create some type of cheesy and completely improbable love interest alternative. \\n\\n\r\nIf this series had more comedy or at least some comedy (it is supposed to be a comedy), maybe it would be at least entertaining in some way. Thus far, the pinnacle of the comedy was a scene where our main dude disappeared in the middle of an ongoing monologue aimed at him. Which is a thing that has occurred in approximately 3 gigazaillion other anime series already, most of which presented it better and had some characters with personalities so that the comedic moments came with at least some level of depth.\\n\\n\r\nArt is another thing that could easily make this series seem better and give some sort of glory and meaning to its events, but damn if ain't generic and cheap. I am mainly reminded of those low budget action anime series from the beginning of this decade where the coolest animation tricks were practically different colored light effects. This thing looks boring, sounds boring and is boring, and on top of that, has been going for worse since the beginning.",
            "date": "2018-10-26T09:57:00+00:00",
            "helpful_count": 33,
            "mal_id": 292634,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=292634"
        },
        {
            "content": "“There’s no sexual harassment in a match” — Four-eyed sex offender\r\nOh…in that case.\r\n“Grab them by the pussy.” — Donald Trump\r\nI haven’t seen Romeo and Juliet butchered this horribly since Baz Luhrmann decided to cast Leonardo DiCaprio in a modernized version of the Bard’s classic with its original dialogue intact.  At Dahlia Academy Boarding School, the “White Cats” and the “Black Dogs” operate on the assumption that the only way to resolve their differences, is through a school yard battle royal where anything goes.  Faces get punched.  Hair gets pulled.  Even more faces get punched.  Girls clothes get stripped off (youknow, standard middle school happenings).  But amidst all the chaos and lifelong brain damage, our main character, Romio Inuzuka, reveals his affection towards his Juliet and thus begins an awkward series of events where the two must conceal their relationship from the prying eyes of their compatriots.\\n\\n\r\nRomio is your typical too-cool-for-school badass, which makes sense because he’s almost never shown in the classroom, as he’s too busy courting Juliet or pounding her head in (he should have been pounding something else).  He’s not particularly smart, but his fiery passion and general oaf-ness make him somewhat entertaining.  I genuinely spat my coffee out when he lunged himself into that mirror.  But slapstick comedy only works for a limited time, as it becomes redundant rather quickly.  Nine out of ten jokes fell flat on their face, rendering much of the show as a tedious waste of time.\\n\\n\r\nJuliet, Romio’s love interest, is a trite Tsundere with little-to-no value in the comedic department.  Her main hook includes getting infuriated with Romio’s inane comments, followed by screaming at him and/or clobbering him (it gets old fast).  While staying focused on her goals of changing the world, she also exhibits moments of foolishness when she leaves a spoon in the microwave (not funny bro, that shit kills people).  In addition, due to her petite stature, Juliet looks three-to-four years younger than Romio, making their tender encounters seem a bit awkward.\\n\\n\r\nBoarding School Juliet, lamentably, is a show without a clear direction, nor is it consistent enough to entertain the viewer with its abundance of unavailing situational comedy.  Romantic situations between Romio and Juliet are surface level fluff, routinely devolving into lewd, hackneyed circumstances with little comedic value.   On the other hand, the “love square” — Romio loves Juliet; Hasuki loves Romio; Weslia loves Juliet — creates an interesting dynamic between the characters, particularly because the love that is accessible is not the one Romio or Juliet desire.  Boarding School Juliet does flesh out the relationship between Weslia and Juliet as children, but it leaves much to be desired.  Also, the dynamics of such a relationship are bromidic, especially when little-to-no nuance is added to differentiate itself from its — numerous — predecessor’s.\\n\\n\r\nThe colorful artwork is so diversified that it hypnotizes the viewer into thinking they are looking into a kaleidoscope; unfortunately, this pristine look is impeccable beyond belief.  There is a thing as being too “perfect.”  Sometimes a sprinkling of “imperfection” can go a long way in creating an “authentic” environment.\\n\\n\r\nWhy the producers of the show decided to emulate the story of Romeo and Juliet, when the characters and thematic elements are antithetical to the Bard’s classic is beyond any reasonable person’s rationalization.  So instead of concocting a convoluted reason as to why this happened (**cough**a lure to draw in more viewers**cough**), I decided to write a humorous poem to encapsulate my thoughts on the series.\\n\\n\\n\r\n“Thou must have reckoned himself quite capable of tackling the Bard’s masterwork,\\n\\n\r\nBut it was a far cry from a tear jerk; verily, it was an incomplete patchwork;\\n\\n\r\nMethinks’ the comedy soured the mind, combined with the unkind bitch who \\n\\n\r\nConsidered herself refined;  Although she rode Romio similar to an equestrian,\\n\\n\r\nIt was obvious she wanted to ride someone else, due to her being a lesbian;  \\n\\n\r\nLove interests come and love interest go, but instead of Juliet I would have chosen \\n\\n\r\nThe ho;  If you dare question which ho I presuppose, any which one will do as long \\n\\n\r\nAs she takes off her clothes;  Watching this show became a terrible chore, and the \\n\\n\r\nVibrant colors elicited a pronounced eyesore; I mustn’t allow myself to become \\n\\n\r\nRemarkably incredulous, lest I wish to hasten my exodus via leaping from a large \\n\\n\r\nEdifice; let it be known that this anime is no gem, as it was quite fortunate to \\n\\n\r\nReceive a three out of ten.”\\n\\n\r\n— Krunchyman",
            "date": "2018-12-21T09:08:00+00:00",
            "helpful_count": 30,
            "mal_id": 296381,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6553627.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Krunchyman",
                "username": "Krunchyman"
            },
            "url": "https://myanimelist.net/reviews.php?id=296381"
        },
        {
            "content": "Boarding School Juliet has gone rather unnoticed this season due to the popularity of Goblin Slayer, Sword Art Online, and so on. As a romantic comedy, it’s hard to keep up with the top shounen shows releasing every season. However, this show is surprisingly interesting and although can’t exactly be compare to the quality of the top shows airing right now, is still quite entertaining to watch. \r\nStory: Boarding School Juliet is a spin-off of the original “Romeo and Juliet”(which is quite obvious when you read the title), as it retains many of the same elements. This time, the two rival groups, the White Catsand the Black Dogs continuously fight amongst each other with their leaders,Juliet Persia and Romeo Inuzuka, as the two star crossed lovers. These two groups are a part of the same school, but each compete to rise to the top and best the other. It’s your basic, simple storyline that has been overused, but still is enjoyable as we watch the two characters get into problematic, comedic, and romantic situations together. \\n\\n\r\nCharacters: When it comes to characters, romantic comedies tend to fall very short, and Boarding School Juliet isn’t exactly any better. Inuzuka Romeo, although isn’t as dense as most harem show main characters, still retains the cliche dense archetype many in the audience despise and are tired of constantly seeing. There’s not much depth or uniqueness in his character, he still retains a predictable and overused personality. Juliet is not very different either, she also has a very shallow character with a predictable personality. In fact, how she even fell for Romeo seems very rushed with no development, how someone who was her life-long enemy suddenly became the love of her life in a mere instant. \\n\\n\r\nArt and Music: If you have read my past reviews, then you would know I don’t put too much stress on the art and music of a show. What matters most is the plot and the characters, great art and music alone can not get you anywhere. Moving on, Boarding School Juliet’s art is quite good, and I have nothing really to complain about it. The colors are bright and it fits nicely with the comedy of the show. Music is also great, as the opening is probably one of my favorite ones this season. Overall, solid animation and music production that fits nicely with the theme and mood of the show. \\n\\n\r\nFinal Verdict: For many of us, romantic comedies are guilty pleasures, and I am not an exceptions. They’re fun to watch and many times the cuteness of the characters puts a smile on our faces. But the main problem with these type of shows and including Boarding School Juliet is the lack of strong characters and plot. It’s almost always the same predictable character archetype with a weak story to follow up on it. Boarding School Juliet is fun to watch, but it lacks two of the most important elements to truly entertain the audience. There is a lack of a strong theme or message or any powerful statement; this show like many others is simply there to make a select group of people have fun and that’s about it. Boarding School Juliet can bring many people excitement for a short period of time, but it’s a show that stays largely forgettable once it finishes airing. But if you are looking for a show for some quick enjoyment, then I recommend this show to you. \\n\r\nStory:6 Characters:6 Art:8 Music:8 Enjoyment:7 Overall:7\\n",
            "date": "2018-10-26T15:09:00+00:00",
            "helpful_count": 28,
            "mal_id": 292665,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6925209.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kyuberu",
                "username": "Kyuberu"
            },
            "url": "https://myanimelist.net/reviews.php?id=292665"
        },
        {
            "content": "So i gave this an overall 10. Despite the ending well not being the end (so this isnt a spoiler but the material its based on is still ongoing as far as i know). However as a standalone 12 episode show it was amazing. i pray we get a second season with an actual ending BUT in all honesty i honestly think this show would need at least (and that's at LEAST) two more seasons to even make that possible. I suppose a lazy conclusion would be for the countries to intermarry nobility or something to improve relations but i do not really see thathappening. \\n\\n\r\nNow as the name of the anime suggests, its based LOOSELY on the original Romeo and Juliet. However fear not this anime has nothing to do with the original apart from the use of their names, and their relationship being forbidden as they are on opposing sides by birth.\\n\\n\r\nAs someone who attended school in England, i was forced to study shakespeare's plays including Romeo and Juliet; had to play a part in one of them, and watched at least one film based on it and grew an irrational hatred towards it. As far as i'm concerned his works were decent stories for their time and showed humanity at its worst (well reality). For me anime is an escape from such, and i avoid watching anything that breaks that.\\n\\n\r\nLuckily this show has nothing to do with the original in terms of story, theme or pretty much anything. I was worried when i gave the first episode a try (after seeing clips of it on youtube) but i had nothing to be worried about. \\n\\n\r\nFor those of you who wants a funny comedic anime about romance and school life etc, this is a great show. If you wanted an anime adaptation of the original works, this is NOT it. and personally i would never want one.",
            "date": "2018-12-21T13:00:00+00:00",
            "helpful_count": 12,
            "mal_id": 296408,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7297536.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DUDZ_DNA",
                "username": "DUDZ_DNA"
            },
            "url": "https://myanimelist.net/reviews.php?id=296408"
        },
        {
            "content": "Now I know what you're thinking, another dumb rip off with dead story and characters, only watched by weebs for the occasional ecchi. But that's where your mostly wrong.\r\nDespite a recycled and pretty cringe story line, the characters give the same refreshing feel they would in an 8+ rated anime. A poor story line which you know you've seen before but packed with genuine comedy, something you don\"t get too often with the comedy genre these days. \r\nDespite the fact this anime is on a technical level bad, its enjoyable and entertaining, which is what i feel most people would watch a show for.",
            "date": "2018-11-20T00:52:00+00:00",
            "helpful_count": 7,
            "mal_id": 294395,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7276259.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sugoi_boi",
                "username": "sugoi_boi"
            },
            "url": "https://myanimelist.net/reviews.php?id=294395"
        },
        {
            "content": "So, Romio and Juliet I could have sworn I these names a familiar. I think it was a theatrical play? Anyway this anime is a love comedy and did it do romcoms justice? Well it did decent enough.\r\nThis anime is bursting with really well known voice actors and actresses from Kayano ai who voiced Darkness from Konosuba and Gintoki himself and many more well known voice actors and actresses. But the BGM doesn't shy away it is also top notch. But that isn't the best part about this anime the best part is the romcom itself. But that's about it. The story in this animeis a tale as old as harem animes, it has a generic story that we have seen in many romcom animes.\\n\\n\r\nThe story dodges cliches and makes a really good twist in the end of the 1st episode. But what really drawn me into this anime was because I was either laughing at the jokes or grinning on how cute the MCs are together. But it does not excuse on how generic their story is. There are a few good plot points in the story right now but those interesting plot points have been used in other animes as well and kinda make them a bit uninteresting.\\n\\n\r\nBut there was one thing that surprised me the most in this anime they were able to make a really good emotional moment between the MC and a side character and balance both comedy and the emotional weight of the scene.\\n\r\nI don't what's gonna happen in the next episodes but I if this anime keeps on surprising on really good moments like that and improves on the overall story then this might become an evne greater romcom then it already is.",
            "date": "2018-10-30T14:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 293011,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5379403.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MeteorEvox",
                "username": "MeteorEvox"
            },
            "url": "https://myanimelist.net/reviews.php?id=293011"
        },
        {
            "content": "A Romeo and Juliet love story re-interpretation that is actually good. No seriously.\r\nKishuku Gakkou no Juliet takes a Romeo and Juliet story, add in a harem that makes \"some sense\" for the main couple and combine all that with the basis of Romeo and Juliet's family dispute to a school setting, as much as these statements makes it out like cliche, but it's in the details.\r\nOur titular Romeo and Juliet are taking place in Dahlia Academy Boarding School where there are two rivaling countries known as the White Cats where our Juliet Persia voiced by Ai Kayano is factioned where as the Black Doggies iswhere Romio Inzuka voiced by Yuuki Ono is factioned. Romio and Persia both drives the plot forward, with Romio having a crush on Persia since childhood and wanting to help Persia to change society but their relationship is taboo in the eyes of the school to say the least. Persia trying to keep their relationship a secret and seeing both sides of society so she can change society and in a ways grow their relationship through it as well.\\n\\n\r\nNow the anime has a harem aspect, mainly with the harem element focusing on Romio and most of the time they are either allies or rivals turn support characters, like Hasuki Komai voiced by Ayane Sakura, Romio's childhood friend, Weslia Chartreux voiced by Yuu Shimamura being Persia's childhood friend and finally Teria and Kochou Wang voiced by Yui Ogura and Rina Hidaka as Black Doggy Prefects. Now Hasuki and Weslia probably gets the most development for the harem element as they aren't stereotypical childhood friends THOUGH they go through the same dilemma especially for Hasuki however Weslia gives us something unique especially towards her relationship with Persia making her actions rather unpredictable throughout the anime making things interesting, Hasuki is undyingly loyal to Romio unfortunately she goes through the typical childhood friend dilemma just under differing circumstances. Kochou and Teria however arrived a bit too late and get one focused episode in which they become an obstacle for Romio trying to get a date with Persia go awry. Nonetheless the harem aspect might be tacked in, nonetheless Kishuku Gakkou no Juliet does make good use of it.\\n\\n\r\nKishuku Gakkou no Juliet is best when it looks into Romio and Juliet's growth as a couple and heck even using the harem aspect to show differing aspects of Romio and Persia through their strengths and weakness about themselves, like Romio sacrificing his desire for the happiness of others, Persia's desire of changing the school through their relationship as a linchpin to see both sides of the White Cats and Black Doggies, but for both wanting them to grow their relationship to further both their goals to change the world as a result and because of that, strengthening the main couple further. Because of this, LA sees Persia as LA's favorite character in the series, with Hasuki being a close second and Weslia third.\\n\\n\r\nIn terms of animation done by LIDENFILMS, the animation quality from the backgrounding was pretty decent, the character designs are polished and detailed throughout the anime and the few battles are decent as well due to the decent sword choreography but tends to do moving still speedlines at times. To say the least LA feels like the character designs are the best part of the animation, as most of the characters look exotic and distinct even in uniform!. LIDENFILMS did decently overall.\\n\\n\r\nIn terms of voice acting, LA will say that voice work was very well done, from Ai Kayano to Yuu Shimamura to Ayane Sakura. The majority if not all the voice cast was pretty well handled. LA LOVED Ai Kayano as Persia but Ayane Sakura as Hasuki was just meant to be, while Yuu Shimamura just owned as Weslia with her intentionally smarmy trickster ojou cadence. It's also been a while since LA saw an anime where Rina Hidaka and Yui Ogura were in the same anime AND both being twins at that. Yuuki Ono also did pretty well as Romio and Hiroshi Kamiya as Scott Fold. LA loved this voice cast to say the least.\\n\\n\r\nKishuku Gakkou no Juliet does have the notion if the names of the characters are anything to go by and that is of the \"White Cats\" , \"Black Doggy\", Romio and Juliet, Persia, Scott Fold, Hasuki...yes the rivalry countries have their own social hierarchy because of it. The White Cats are aristocrats and work off that notion, they also represent the West, right down to their Western regal attire and mannerisms, while the Black Doggy represent the East, many characters having Japanese names at that and also wearing Japanese school attire. It goes deeper when we see the White Cats and Black Doggy's hierarchy and how they function...LA doesn't know LA really liked that dynamic and how Persia herself wants that to change as a result.\\n\\n\r\nHowever Kishuku Gakkou no Juliet has some flaws through all this however which LA DOES need to mention. LA brought up Hasuki having the childhood friend dilemma as well as the many cliches that has the harem elements, BUT as much as Kishuku Gakkou no Juliet does follow many cliches of the harem genre, Kishuku Gakkou no Juliet still does it's cliche WELL and better yet uses it's cliches to better the main characters and the harem themselves making the majority of the characters likable and memorable. Kishuku Gakkou no Juliet's cliche though they use it well it is nonetheless using cliche and that might annoy some people, not to mention the fanservice of Kishuku Gakkou no Juliet gets extremely risky though that is only happens once, but LA will defend the fanservice as they use it sparingly. Kishuku Gakkou no Juliet's flaws does have it's flaws but alot of defense to outweigh it all.\\n\\n\r\nKishuku Gakkou no Juliet's finale does have similarities to the classic Romeo and Juliet though through the typical famous event and if your wondering, the finale does the \"read the light novel\" type ending but not in a unsatisfied way as the finale does make Romio and Persia go through hurdles and hurdles in order for them to keep their lie hidden harder and harder and almost exposed and to progress to their ultimate goal of changing the world and with all the tension to this finale and really with how this finale resulted in, well LA was satisfied by it even with this \"read the light novel\" type ending, a resolution from both main focused characters and a somewhat good climax.\\n\\n\r\nKishuku Gakkou no Juliet for LA was a pretty well done retelling of the classic Romeo and Juliet story but taken to anime standards. Sure Kishuku Gakkou no Juliet has lots of typical flaws that the harem genre it entails but nonetheless Kishuku Gakkou no Juliet's strengths definitely outweigh all this, from the likable relationship of Romio and Juliet and it not being the relationship being the sole focus as both Romio and Persia grow individually with the harem elements added in and through the harem, they too grow with them be it if they know of Romio and Persia's relationship or not especially with Hasuki and Weslia, thus incorporating it's harem elements well. Kishuku Gakkou no Juliet may be a typical harem anime just with the Romeo and Juliet setting, but man was it done well and one of the more surprisingly good harem anime of Fall 2018 but also good romance anime as well.",
            "date": "2018-12-21T11:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 296399,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=296399"
        },
        {
            "content": "My first review so i am gonna keep it short :) A bit of spoilers*\r\nThis Anime series takes the elements of Classical Shakespeare Story of Romeo and Juliet from a manga by Kaneda Yousuke , with the story of the two main characters Persia Juliet and Inuzuka Romio belonging to opposite factions \"The White Cats\" and \"The Black Dog\", who fall for each other and have to overcome difficulties on a daily basis to keep their relationship a secret from their factions and maintaining it while achieving their common goal which is achieving peace between the two factions and change the world while developing andworking on their relationship.\\n\\n\r\nThe story is a mix of your generic Highschool romance and Comedy, also throwing in some serious moments at times and adapting elements of ancient time traditions and culture as its derived from the classical romeo and Juliet.\\n\r\nCharacters:\\n\r\nInuzuka Romio : A strong minded Mc with an angry,stubborn mindset at times, can be dense and clumsy. but caring for others and also most importantly honest and strong headed, also possess qualities shown time to time which is refreshing to see.\\n\\n\r\nPersia Juliet : A smart, skilled and a maiden figure, who leads by example, has a shy and loving, caring nature and wants to change the world starting by peace between the rival factions. \\n\\n\r\nHasuki : Inuzuka's Childhood friend who is cheerful, smart, and really caring for the faction members and especially inuzuka and possesses many qualities to be one of the best girls.\\n\\n\r\nChar: Persia's friend who shows a dominating and sadistic side on the outside mostly but is really caring for Persia and in a way obsessed over her. \\n\r\nThere are more side characters too but have not stand out that much till now. \\n\\n\r\nArt: Studio LINDELFIELDS have done a really great job in terms of animation, keeping it Bright and colourful , great work in the detailing of the drawings, especially as many of the scenes contain old school type of buildings, romantic scenes and views.The depiction and presentation of an old school scenario where the series is taking place can actually be felt and it goes well with elements of the story. \\n\r\nMusic and soundtrack : Not much to discuss there but the background tracks are pretty well done, considering it blends well with the scenes in the anime. The Intro and outro songs are sung by well known artists Fripside and riho lida which are pretty good. \\n\\n\r\nFinally i would just like to say this is again a rom com series with a adaption of romeo and juliet a classic. if you like something to sit back relax and enjoy, with a bit of drama and emotional touching scenes with the main element of romance and comedy, then this anime is really worth the watch.",
            "date": "2018-12-21T11:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 296392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7202385.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kipo0007",
                "username": "Kipo0007"
            },
            "url": "https://myanimelist.net/reviews.php?id=296392"
        },
        {
            "content": "Ah... I finally get to review this anime.  This anime is definitely one of my favorites for sure. And in this review, I'm gonna try explain why:\r\n(May contain very minor spoilers.)\r\nStory: (8/10) \r\nThe story is short but sweet. Throughout this anime we fellow Romio Inuzuka, as he builds his relationship with Juliet Persia. But this won't be easy for our MC. In this school, there are 2 houses. Inuzuka is part of the \"Black Doggies\", and Persia is part of the \"White Cats\".  Basically this means that these 2 houses are rivals. There are rules in between these 2 houses, so they canco-exist, without any conflict. Inuzuka has had a crush on Persia ever since they were kids, but because Persia misunderstood Inuzuka's feelings, Persia is led to believe that Inuzuka hates her. So, every year they battling, because of a simple misunderstanding. But this all changes as he finally confesses his love for Persia. Inuzuka asks her out, and she accepts. If they wanna maintain this relationship, they can't be found out, or they will be expelled from the school. Along the way, they are met with various encounters, suspicious of there relationship.   \\n\\n\r\nArt: (7/10)\\n\\n\r\nThe art isn't my favorite thing about this anime. Most of the character designs are unique, but some of them I didn't really like. For example, I didn't really like Persia's eyes, they looked a little weird to me, but this is all personal preference. \\n\\n\r\nSound: (9/10)\\n\\n\r\nI really liked the Opening song \"Love With You by Fripside\" for this anime. Its very catchy, and the lyrics portray the anime perfectly. The ending song \"Itsuka Sekai ga Kawaru by Riho Iida\" , I liked it, but it wasn't something I'd download. But it was a good ending song, none of the less. But again, that's just personal preference.\\n\\n\\n\r\nCharacter: (10/10)\\n\\n\r\nI really liked these characters. Every single one of them were interesting, and entertaining to watch. I also really liked how real the bond felt with Inuzuka, and Persia. Throughout the anime it grows, and you end up rooting for them. The love that Inuzuka feels for Persia is very loyal. Inuzuka will do anything for her, even put himself in danger, just to see her, no matter the consequences. \\n\\n\\n\r\nEnjoyment: (10/10)\\n\\n\r\nEvery week I was exited for the new episode to come out, because of how entertaining the show was. The mellow drama was also done pretty well too, and made it even more entertaining to watch.\\n\\n\\n\r\nOverall: (10/10)\\n\\n\r\nI highly recommend this anime, especially if you're a fan of the romance genre, like myself. This is definitely one of the more under looked anime this season, and definitely worth watching too. But anyways, thanks for reading my review.",
            "date": "2018-12-22T03:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 296483,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7319034.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vintagesonic1",
                "username": "Vintagesonic1"
            },
            "url": "https://myanimelist.net/reviews.php?id=296483"
        },
        {
            "content": "Easily 10/10. Animation was fantastic, and I am very happy this didn't turn out to be just another harem anime. I think their relationship progressed a bit too slow and that Romeo was a bit childish not even being able to be close to her without blushing but nothing which degrades the score of the masterpiece this is. I honestly jumped out of happiness and excitement during the last episode and that is a strong 10 for me.\r\nAlso this is not a spoiler of any storyline but the anime ended on manga-chapter 18, out of current 85. Material-wise this has every posibility for a season2. 😍",
            "date": "2018-12-21T13:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 296413,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4872881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Foorack",
                "username": "Foorack"
            },
            "url": "https://myanimelist.net/reviews.php?id=296413"
        },
        {
            "content": "Totally spoiler-free short review with almost no mentions of plot. A review on objective points of an anime:\r\nArt:\r\nOne of the most important things about an anime is the art! Boarding School Juliet's art is good enough to be graded as \"A\" or \"B+\". Its art is not superb; its drawers draw them pretty averagely, like how some normal studios draw. Another important part of the art is its consistency - is  the art always good enough to be average throughout all the episodes released so far? Unfortunately- no, but it's still ignorable. In episode 5, the quality drops a bit, making it obvious somethingwas rushed.\\n\\n\r\nSound:\\n\r\nThe OP sounds like it was sung by Yoshino Nanjo; her songs are always nice to hear. The ED is also very melodical and worth listening to. \\n\r\nThe VAs don't sound awkward at all! I think one factor that makes the non-awkwardness of the VAs possible is actually the director's decision on how to animate things (for example - for how many seconds does the director want this and that scene to last). Fortunately, it seems that the VAs were given enough time to speak fluently and naturally, with nothing rushed.\\n\\n\r\nStory:\\n\r\nThe director did a good job, in my opinion, on not rushing things. It seems that many anime has their quality dropped because of rushing. Fortunately this is not one of them. It has a nice pace.\\n\r\nThe story itself is entertaining! Some might say that it is cliche, but it only is in the first episode. You stay on the ride for this anime because of the comedy (I did). It's a new rom-com that I haven't watched in a long time.\\n\r\nYou have to keep the 3-episode rule for this anime. My opinion of this anime improved after I watched the third episode.  I think it's because the first episode gives a boring introduction of the characters, and the second episode mildly starts trying to make the viewer interested. In the third episode, some more characters are introduced and things get more dynamic - with the dynamicity, entertainment also started for me. \\n\\n\r\nCharacters:\\n\r\nCharacters can only go so deep in a 12 episode series. It is especially so if it is a rom-com. Too much character depth isn't neccessary in a rom-com (I guess). One thing I can remember to commend about this anime's characters is that they don't irritate you.\\n\\n\r\nI enjoy rom-com a lot, and I just felt very entertained when I watched this so I want to give it a 9. However, maybe a more objective and critical opinion would give it an 8.\\n\\n\r\nEdit: after having watched more recent episodes, I have to take back my opinion on consistent art and not rushing. I guess it's inevitable that a 12 episode series has to pack in a lot of content in a short amount of time leading it to make things look less smooth, but it's still true that this anime still delivers at least average art and animation throughout the episodes so far.",
            "date": "2018-11-13T18:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 294013,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3181469.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/eeasuper",
                "username": "eeasuper"
            },
            "url": "https://myanimelist.net/reviews.php?id=294013"
        },
        {
            "content": "If there's anything from ninth grade I remember most, it's the unit where I was forced to read the Shakespearian tale of 'Romeo and Juliet', the classic romantic tragedy of two lovers of opposing families who were never meant to be, ultimately dying together as a sign of their love.  (Spoiler if you've never read the book, watched the play, or watched any of the hundreds of story variants.)  So really, what's the next step for such an old and classic tale?  Rewrite and reproduce it as an anime of course.  \r\nStory:\r\nBoarding School Juliet takes place on Dahlia Island, the sole island in the middleof two rivaling countries: 'Touwa' and 'The West'.  On Dahlia Island is the boarding school where there're two dormitories based on the rivaling countries: The White Cats for 'The West', and the Black Dogs for Touwa.  In the midst of this rivalry, our protagonist Inuzuka Romio of the Black Dogs confesses to the leader of the White Cats, Persia Juliet, and the two begin a forbidden relationship where getting caught would most definitely cause a war between the rivaling sides.\\n\\n\r\nFirst off, I want to ask.  'The West'?  Seriously?  You couldn't come up with a better name for the Capulet/Britain side of this equation?  I'm kinda disappointed if only for how lazy it sounds when you put it next to 'Touwa'.\\n\\n\r\nThere's really no better way to explain this show other than 'Anime Version of Romeo and Juliet'.  Seriously; even the protagonists are named that.  But I think that simplification is giving the show not enough credit.  While the setting is certainly reminiscent to the Shakespearian work, in actuality, the show is more about the relationship between the protagonists and how both each other and some of their closest peers react to what's being fostered between the two.  There's a real attempt at further developing the 'tragic romance' of the original story, and that ultimately turns the story into one where the two halves of the couple develop into better characters all the way towards the end.\\n\\n\r\nBecause of this, I found myself weirdly engrossed in the story, really rooting for the mildly dumb couple as more and more wrenches are thrown into their plans of things like going on a date or just speaking to each other on school grounds.  Not only that, but typical anime tropes like sports festivals and birthdays get 'Romeo and Juliet'ified so had that it actually feels fresh, if not a little dumb when you don't keep in mind that this is an anime rendition.  The ending caps everything in this manner too, giving a satisfying enough ending to elude to a \"read the manga\" ending, but still being paced and written well enough ti serve as its own standalone ending.\\n\\n\r\nAll in all, what can be said about 'Boarding School Juliet' is it being a show that despite being basically an anime parody of Romeo and Juliet, is actually a decent romance story based off of the concept that is way more fun to watch than any actual faithful telling of Shakespeare's work I've ever seen or read.  You actually get to see the relationship grow through the episodes, and just adding that layer made it way better than I ever thought it to be.\\n\\n\r\nOverview:\\n\r\n+ Actual growing Relationship\\n\r\n+ Everything is 'Romeo and Juliet'/Montague v. Capulet to a hilarious degree\\n\r\n-  'The West' Seriously, why name the Capulets that?\\n\\n\r\nCharacters:\\n\\n\r\nRomio and Juliet (better known as their last names of Inuzuka and Persia) are certainly quite the pair in this rendition.  Inuzuka is an outwardly scary but ultimately a determined and loyal person with a heart of gold.  Like a dog.  Persia is a proud and independent girl who has her moments of being cute and taking out her claws within a few scenes.  Like a cat.  (Huh, starting to see the duality here.)  Together, they make the show's dumb/main couple that I honestly can't do anything but root for.  They are ultimately each other's motivation for their actions, and you see a lot of that culminate in the final act of each episode before starting the process over with a similar or different obstacle in the way.  You see them grow from each other, care for each other, really making everything feel like a genuine relationship where trust and acceptance for each other's strengths and flaws are at the core of their love despite the ridiculous and vaguely comical setting they're in.\\n\\n\r\nRecurring characters like Hasuki, Princess Char (and Scott), and a few others primarily serve as blockades or obstacles to the main couple's relationship, often times having an episode where they are the main contributor to the conflict before mildly intervening or supporting at various points in the series.  They grow along nicely thanks to the harsh reality that they just have to deal with the fact that their friend is 'dating the enemy', which isn't as annoying as it could've been, so that on its own is a major boon for the series cause it makes these potential roadblocks better characters in the end.\\n\\n\r\nThis factor also extends to the setting since the show really goes to a hilarious amount of lengths to show how much the two sides hate each other, often times having either faceless background characters or background characters with faces shouting obscenities at each other which is somehow more gratifying than it should be when the main couple does some 'traitorous actions' cause they just want to either be left alone or spend time with their significant other.\\n\\n\r\nOverview:\\n\r\n+  Active and prominent protagonists\\n\r\n+  Side cast adds to the story instead of subtracts\\n\r\n+  Side cast helps to embolden the rivalry\\n\\n\r\nArt:\\n\\n\r\nProduced by Lidenfilms, the art for Boarding School Juliet varies depending on what exactly you're seeing on the screen.  For the most part, the show appears as a pretty standard show without much to make it unique.  Colors are bright all the way through, and the only clever use of color I can say is the fact that the opposing sides have different uniforms (colored white and black, surprise surprise) so just at a glance you can tell who goes where.\\n\\n\r\nBut from the design side of things, I feel like Lidenfilms kind of dropped the ball here in terms of quality.  More distanced shots clearly have a reduction of quality to them as the animation (though smaller) looks a lot rougher than the standard shots for the show, and for fanservice reasons, chest sizes for the girls in the show seem to vary depending on what's being shown.  So for that reason, the anatomy for its characters appear inconsistent.  (Especially considering Persia is supposed to be 149 cm or 4.8 ft, and compared to Inuzuka, he either looks like a giant or only a number of inches taller than her.)\\n\\n\r\nOverview:\\n\r\n+ Relatively standard art\\n\r\n-  Some animation and consistency issues\\n\\n\r\nSound:\\n\\n\r\nFripside's \"Love with You\" both gives me both surprise and much annoyance.  For some reason I don't associate Fripside with a show like this, but it sounds good, and...remarkably similar to what I expect from the band.  But given who made it, I can't really be upset cause the song is good, and as always, remarkably difficult to find the full song without edits.  \"Itsuka Sekai ga Kawaru made\" by Riho Iida by comparison doesn't feel as interesting and I actually found it to be more forgettable than anything cause nothing about it really stands out aside from the fact that it's a really annoying mood breaker considering what some of these episodes end on.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nWeirdly enough, this was one of my favorite shows of the season.  Initially I started it as a bit of a joke cause I'm a sucker for dumb romantic comedies, and an anime version of Romeo and Juliet sounded right up my alley for a good time.  What I was not expecting was a competent plot followed by characters and a couple that I actually cared for and genuinely thought as being a better rendition to what Shakespeare first wrote just for the fact that the relationship felt like it was actually worth something rather than a metaphor for love v. lust that was not fun to discuss back in ninth grade, and still isn't fun now.\\n\\n\r\nSome highlights separate to scenes involving the main couple being cute idiots when they're alone together involve both Hasuki and Scott, as for me, seeing both Sakura Ayane and Kamiya Hiroshi portray equally hilarious characters in context to the characters of Mercutio and Tybalt just made everything more enjoyable than they should've been.  My whole time watching this really just amounts to: This is all so hilariously trivial, but it's amazing in a way only anime of all things could do it.\\n\\n\r\nPretty much for that reason aside from some genuine care put into making a proper anime (and more enjoyable) rendition of Romeo and Juliet makes me give this show a stamp of approval for something if you're looking for pure enjoyment factor.  At the very least, the show's a fun watch, and definitely deserves a chance even if you hated the original Shakespeare's play that you were forced to do reading and a report on.",
            "date": "2018-12-27T15:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 297092,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=297092"
        },
        {
            "content": "If you are expecting an anime version of Romeo and Juliet, look elsewhere.\r\nAlthough the plot seems to follow along Shakespeare's original play, it is more like if someone took a spin-off of the play... and added comedy and anime tropes to it.\r\nHowever, the lack of Romeo and Juliet themes doesn't detract from the overall viewing experience. The atmosphere is surprisingly lighthearted, in spite of several more serious events taking place. \r\nI personally find that the characters are the best part of this anime. Most characters are unbelievable (there is no way that a perfect girl like Persia exists in reality), but that is just partof their charm. The characters do have relatable motives for their actions, although those actions are performed in the standard over-the-top manner. \\n\\n\r\nIn summary, watch this anime if you want a lighthearted comedy with some unique characters.",
            "date": "2018-12-27T15:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 297090,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mystery132",
                "username": "mystery132"
            },
            "url": "https://myanimelist.net/reviews.php?id=297090"
        },
        {
            "content": "There's a saying, screw you for your perspective. This one applied quite well. \r\nOne sentence, it’s pretty much your generic anime series without any much originality. Honestly the comedy gag is not even funny, the characters are straightforwardly boring, spice it up with laughable plot just because to make it ‘plot’ for no apparent reason. The fight between cat and dog is barely passable as konoha vs uchiha cloning in a cute way and the characters is annoying beyond help. Its like “hey let us throw a whole lots of personalities, its gonna be fun for sure!” Aaaand it turned out as vast as rubbishin the sea. \\n\\n\r\nThe setting itself could be much more developed and exciting to see but they launch it to neptune instead. Its probably better if it stays as one shot (original) rather than giving a fake hope to the watchers. Its bland, and not even interesting to keep me going as i found myself struggle just to even finish it. The traditions of fighting between cat and dog, its just there for the ‘plot’. No other reason or any deep meaning. Simple as that. The exciting premise from oneshot before this one turned into a series of manga and anime already has been long lost. \\n\\n\r\nThese characters on other hand feel like throwing salt to our face. You know when you gets annoyed so much that you just can’t help but to throw salt to other person because its so bad. Might as well call it satanism cleansing. Inuzuka is the perfect example of generic mc. He doesnt even have any unique or special traits in him. If you toss him into a vast sea of shounen mc, you will lose him for sure. Next comes our juliet that’s supposed to make it better.. but no she comes with a freaking holy water instead to splash our face like a freaking satan. Thats just how worse it is. She not even worth mentioning, no guts or tiniest bit of bravery, just a stupid shy princess with no redeeming qualities at all besides the cutie face. The others? Nah they arent even worth to be mentioned. Unless you want to see me to rant about how our eyes got burned alive seeing lovely-dovey of stupidity moments. \\n\\n\r\nTo wrap it up, its not even interesting to me. Its feel like i will forgot this series as fast as sunrise in tomorrow morning. I do had some moments to be enjoy but it is too little to withstand the bad points. Worse, the ending doesnt even left any impression or impact at all. It’s unfortunate as this series truly had a potentials in the beginning but now its just a selfish wish of mine. It seems great, but in the end it's just meh. \\n\\n",
            "date": "2018-12-21T00:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 296341,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6947487.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Seizawa",
                "username": "Seizawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=296341"
        },
        {
            "content": "Let's get straight to the point: Kishuku Gakkou no Juliet is an okay show; there are a lot of uninteresting moments, but there are some enjoyable ones too.\r\nThe first thing most people would expect the show to be is an anime rendition of \"Romeo and Juliet\". It borrows a couple of things such as the names Romeo (or in this case, \"Romio\") and Juliet, as well as the idea of 2 rival factions where the secret lovers are from, but that's about it for similarities. \r\nThe show wastes no time in pairing the two together. Being secret lovers, they need to do all sorts ofantics to make sure their relationship stays hidden. The story isn't the most interesting and it's pretty generic, but that isn't necessarily a bad thing; it all depends on the execution.\\n\\n\r\nMy main gripe with the show is the chemistry between the main leads. Their relationship just doesn't feel very interesting, and to a degree, almost one dimensional. They have a couple of cute and funny moments together, but I often find myself wanting to \"get it over with\" during scenes where they're alone. Romio is a little dense and his interactions with Juliet get a little too predictable. Likewise, Juliet is your typical \"goody two-shoes\" female lead and this just generally results in uninteresting dialogue and scenes. This wouldn't be too much of a problem, but the idea of the show is centered between these two characters and so far it just hasn't been doing it for me (hopefully this gets better in the later episodes).\\n\\n\r\nThus it amuses me to say that interactions with every other character show seems so much more interesting; some of the best and funniest scenes are from the supporting characters. The relationships between the leads and side characters (e.g. Romio and Hasuki, Juliet and Char, Romio and his classmates) is so much more enjoyable to watch than the main relationship. But naturally, the show wants to push the whole Romio and Juliet thing, so we always end up circling back to it.\\n\\n\r\nThe animation does look pretty good at times, especially during the action scenes; the accompanying music during said scenes is also pretty solid. \\n\\n\r\nI really do hope the show steps it up for the remaining episodes. If episode 4 is any indication (first episode with any emotional weight), then the rest of the show could be pretty decent. But then again, that episode wasn't centered around Romio and Juliet but rather Romio and (good girl) Hasuki, so who knows if things between the leads will become more interesting, especially if there'll be more focus later on. There's room for improvement so I'm cautiously optimistic.\\n\\n\r\nIs it worth watching? If you don't mind the leads being a little bland, then sure. There's some good to be found in the show, but at this point it's really dependent on how much you can tolerate/ don't mind.",
            "date": "2018-11-01T02:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 293108,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/jorobatu",
                "username": "jorobatu"
            },
            "url": "https://myanimelist.net/reviews.php?id=293108"
        },
        {
            "content": "So...contradictory to public belief, I actually have no idea that Rodeo and Juliet refers to an old folk tale of some sort that portrays forbidden love (not to be confused with the more common \"incestuous love\" seen on anime these days)\r\nSo jumping to the anime without expecting it to be about \"forbidden love\", I would say this is a rather interesting take on a romcom (abbreviation of \"romantic comedy\").\r\nArt-wise, it's pretty much the exact definition of \"average\". Something like what A-1 Pictures would make, not really out of the ordinary, and not really bland, just positioned right at the line. Guess you don't really seeeye-catching designs outside shaft's works.\\n\\n\r\nAs for the story, I'm not really sure if trying to adhere to the rodeo and midget kind of a plot was the reason behind its staleness or if that's how the author is trying to direct the story, but to be frank, it was pretty gosh darn predictable. That is excluding the sometimes overly-forced comedy, those are less predictable, except you can't really view those as plot elements.\\n\\n\r\nAlso, good voice actors in this one, you can pretty much recognize their very distinct voices. Kamiya Hiroshi that's pretty much everywhere, cuz he's famous :3, Cocoa's (from GochiUsa) voice actor and Ogura Yui (who doesn't love some Ogura Yui-styled loli voices). That's pretty much it, not really outstanding, but that's quite a lot of big names in one small anime, although mostly acting out the side dishes (characters). \\n\\n\r\nBackground audio wise, (I am usually very harsh on this aspect) is pretty much average, at least it's not shed, but repetitively using the same old melody and not really fitting the atmosphere most of the times does leave me uneasy. Yes I speak like it's crap, but I would say it's above-average since pretty much all animes are like these, so I wasn't expecting much as well.\\n\\n\r\nChracters are quite distinct actually, despite being distinct they blend together quite well. After watching the entire show I can confidently recall each character's personality, and heck even the side characters were leaving strong impressions sometimes. They are not really distinct to the point that it feels \"forced\", they just blend in so well that you feel like \"that's what their personality should be\". I would call this an absolute success in character construction.\\n\\n\r\nOverall, you should be expecting pretty much an average anime in all aspects. A romcom with semi-predictable development (if you follow the Ronny And Julie scale) and absolutely average (like A1 pictures, for example) art quality. PLUS quite a number of big name voice actors acting out side dishes (characters). The anime didn't really left a deep impression in me, but I wouldn't say it's bad either, just average, very average.",
            "date": "2018-12-28T06:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 297177,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/knappjones",
                "username": "knappjones"
            },
            "url": "https://myanimelist.net/reviews.php?id=297177"
        }
    ],
    [
        {
            "content": "Being a great fan of the typical Romeo X Juliet school-twisted manga at hindsight, I was wishing for an anime adaptation of this rom-com for sometime, and when it premiered in Fall 2018, I was SO happy and ready for the anime adaptation by Liden Films, and it delivered flawlessly (well, small faults but big wins). (Yay, Happy Xmas wish granted!)\r\nThe story...let's just say that if you know a even a little bit about the Romeo X Juliet Shakespeary context, it's the exact same premise here, just in terms of different factions, mainly the White Cats and Black Dogs, led by both leaders Romio Inuzukaand Juliet Persia. So with that, Dahlia Academy Boarding School (Juliet), was made as per the neutral ground for both factions to have and nurture education for everyone regardless of which faction they belong to. However, as both Inuzuka and Persia encounter each other *starts rolling Romeo X Juliet the play*, the amount of controversy that both have that's weighted on their shoulders become the main problem for concerning people.\\n\\n\r\nAnd that's where the side characters come in. From the assistants, Inuzuka's ever-helpful assistant-cum-crush Hasuki and Percia's strangle-hold Princess Chartreux (just call her Char) are always there to help shape up each counterpart's emotions and feelings about each other, and confront each other as to deal with countless situations with the slightest damage possible. The most frightening are always the top brass, or model counsellors such as Inuzuka's own older brother Airu (which he despises greatly), twin sisters Kochou and Teria from the Black Dogs and Persia's relentless leaders Cait Sith, Anne Sieber and Rex from the White Cats to name a few. And of course, the White Cats rebel faction of Aby Ssinia, along with his supporter-cum-crush Somali and few others. Their depiction in the anime is just as frightening as in the manga, so great pointers for showing their cruelness. Overall, all characters were done as well as how they were in the manga.\\n\\n\r\nFrom here on, really no problems at all. Liden Film's art and animation, bright, clean, fluid and showcasing some of the most simple but bad-ass animations when it comes to the serious stuff (e.g. scenes of action). That, I can go along with it. Same goes with the music too. I was concerned about FripSide's songs as the quality of songs they were pumping out in the modern times were average or didn't sound very good (as per the case of Dances With The Dragons). But, once that OP played, I was rest assured, this OP was fantastic and great, along with Riho Ilda's ED (which I should listen to her songs more) which was icing on the cake.\\n\\n\r\nIf there is the minimum fault I could lament with, was that the storytelling was quite slow, but once I compared that to the flow of the manga, it allayed most of the fears I had about pushing quantity for quality, and am glad that the slow storytelling compensated for most of the enjoyment I had for this anime. Heck, I'd even say this anime adaptation surpasses the manga in every way. It's a great one I tell you. If you're a fan of the Romeo X Juliet archetype, this anime is a must recommended watch. It puts a smile on my face, and so should inflict on you as well.",
            "date": "2018-12-21T09:42:00+00:00",
            "helpful_count": 74,
            "mal_id": 296385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=296385"
        },
        {
            "content": "If you take a classic story like Romeo and Juliet and convert it into a modern romantic comedy, you’d get Kishuku Gakkou no Juliet. While neither series are alike to each other, they do borrow a few familiar themes with the most prominent being a forbidden romance. But there’s more to that, no?\r\nRomance is practical in a show like this but it made me question first what the were really aiming for. I’m not familiar Yousuke Kaneda’s works but when it comes to a rom-com, they made the point crystal clear. Romio Inuzuka and Juliet Persia are in love. It’s the type of love thatties these two lovebirds like fate. However, it’s a forbidden love as Romio and Persia belong in opposite sides of society. In their school (Dahlia Academy Boarding School), there are two rivaling countries. They are known as the “Black Dogs” and the “White Cats”. As the respective leaders of their dorms, you can expect a whole load of drama coming their way.\\n\\n\r\nAt first, this show felt like an experimental story of trial and error. The first few episodes depicts Romio and Persia in a relationship although they must keep it a secret to avoid consequences. They face numerous obstacles with their secret often being risked in public. This creates consequences which misunderstandings arise. Throughout the series, people assume Romio has been harassing Persia. There’s countless times in the show where Romio has to defend his own pride while maintaining his poker face persona. On the other hand, Persia has trouble hiding her own secret but can’t help but stay in love with Romio. You get the big picture here? The show sets up this sort of dilemma that seems to signal for a tragic or doomed relationship. And that’s a good thing. It makes the show feel less predictable as viewers will anticipate how their relationship will ultimately end. Will their relationship be an everlasting love or is it fated to be a tragedy? \\n\\n\r\nWhile all this drama exists from behind the scenes, another main selling point is the rivalries in the show. The Black Dogs and White Cats are often going head to head in competition. Their personalities and attire also contrasts with each other greatly. The anime depicts the Black Dogs as rowdy individuals that almost seems to allude their behaviors as animals fighting for their territory. On the other hand, the White Cats are dressed more cleanly and maintain an aristocratical attitude to maintain their presence. Like cats, they are also cunning and are not afraid to take risks. The series takes opportunities to showcase both sides’ strengths and weaknesses. Through competition, the Black Dogs and White Cats strives to win no matter what in their adamant rivalry.\\n\\n\r\nWhile Romio and Persia is the main focus, I suppose the audience wonders why the key visual contains other female characters. Make no mistake. This isn’t a harem despite the deceptive image of several girls surrounding our main male protagonist. Characters like Char, Hasuki, and the Wang sisters adds doses of drama in their own ways. For instance, Char often teases characters in playful ways like a curoius cat. Romio becomes one of her key targets although most of this is played for laughs. Hasuki is more outgoing and friendlier with others and that’s thanks to Romio’s influence. As one of the very few characters who knows the truth of his relationship with Persia, she’s definitely a character that he can trust. Unfortunately, not every character in this show is too welcoming. The Wang sisters are an example of this as their role has little impact on the overall story. Their debut in the show is nothing more than showing their status at school as prefects and there’s minimal character development for either girl. Still, you may wonder if this show has emotional drama. In the second half of the series, Romio and Persia’s relationship is really tested as they encounter more complex problems such as Romio’s brother.\\n\\n\r\nWatching a romantic comedy like this probably gets predictable if you’ve seen similar shows before. The repetitive formula of misunderstandings, emotional segments, and character chemistry is usually drawn through dealing with social issues. Now I’m not going to deny this show is a cliché teenage soap drama. However, the show seems to shine best when we see the importance of Romio and Persia’s character relationship. Between the humor and drama, it maintains a balanced story without jumping over itself. However, I do wish the show extended its plot more from the manga. The series is ongoing and with just 12 episodes, there are other characters that are omitted. The plot seems to be structured in a way that gives the overall story its flow but not truly adapted to my expectations. \\n\\n\r\nAs a show produced by Liden Films, it’s satisfying to see the faithfulness of the character designs. The contrasting attires of the Black Dogs and White Cats shows their status at school with their personalities. Romio and Persia are the two to keep an eye on the most for their character expressions. This is because they behave in both honest and deceptive ways depending on circumstances. Thanks to characters like Char, we also get tons of humorous moments thanks to her manipulative antics. The feminine voice of Persia is also expressed adequately to showcase her elegant personality. Even when she cross-dresses a boy, Persia still maintains an overall cool image in public; a contrast to her more fragile self when alone with Romio. There’s also some fan service in the show so do be prepared for some cliché pitfalls like accidental perverted moments with loose clothes. Yes, this romantic comedy has it all.\\n\\n\r\nKishuku Gakkou no Juliet is far from being a classic Shakespearean tale but manages to capture the magic of a romantic comedy. I’ve seen many rom-coms in the past and most falls for the same tropes over and over. This anime is vulnerable to some of those tropes but is also able to tell an convincing story with memorable moments. Don’t expect this to be a big hitter of the year but do be prepared for a gleeful rom-com amplified by the charms of a star-crossed couple.",
            "date": "2018-12-21T09:03:00+00:00",
            "helpful_count": 50,
            "mal_id": 296380,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=296380"
        },
        {
            "content": "Romeo and Juliet the name is no stranger to us, right? yes they are a pair of young brides who love each other but his love does not go smoothly and is opposed by his family. Romeo Juliet himself has a variety of storylines ranging from sadness and end to happiness.\r\nKishuku Gakkou no Juliet tells of two young couples namely Persia Juliet and Inuzuka Romio who have secretly established love relationships. Series adapted from \"Manga\" written by Kaneda Yousuke is very interesting because it takes the legendary romantic story of Romeo and Juliet not surprised many spectators were deeply moved, and wrapped in comedy elementsthat made the audience laugh out loud making this RonCom series became popular among teenagers.\\n\\n\r\nNowadays, technology has begun to evolve rapidly as time goes by, anime began to develop in terms of depiction and graphic design. This series takes the story of antiquity where ancient buildings have their own charm. Color selection in this case also has a very significant effect. the action that makes this series even better the process of drawing an action-themed series is difficult because it requires more frames to come out and this series is already good in its drawings, but what makes this more interesting is the depiction of ancient times which makes it more realistic and has a characteristic distinctive.\\n\\n\r\nincomplete if the storyline and depiction techniques are good if not supported by good voice actors and music background. Studio LIDENFILMS brought Kayano Ai as the voice of \"Persia Juliet\" while the duo Oono Yuuki played the role of \"Inuzuka Romio\". Love With You sung by \"FripSide\" became the opening theme while the closing part was Itsuka Sekai no Kawaru made which was sung by \"Riho Lida\".\\n\\n\r\nIn this series has the first three character play \"Persia Juliet\". Persia herself is a girl who wants to change the world for the better but the one who is the barrier is her little cook and the one she loves, \"Inuzuka Romio\". the nature of being angry, caring for others, and most importantly being honest. In the midst of their romance a girl who honestly likes Romio Inuzuka she is \"Komai Hasuko\" she is a cheerful and passionate girl who cares for her friends.\\n\\n\r\nthe story of Romeo and Juliet is a romantic story that was legendary years ago until now with the Kishuku Gakkou no Juliet series that has a storyline that is a bit similar to the legendary story to honestly make some people carried away but unfortunately in this series it has no drama which is good but for some people it is good enough than the series that is full of drama and makes some people touched and full of emotion.",
            "date": "2018-10-26T16:47:00+00:00",
            "helpful_count": 51,
            "mal_id": 292670,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6966818.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shirokuza",
                "username": "Shirokuza"
            },
            "url": "https://myanimelist.net/reviews.php?id=292670"
        },
        {
            "content": "We have all seen the Romeo and Juliet tale before or at least know of it. It’s one of the most common plays taught in many high schools around the world. It is deeply ingrained into the public conscience, even to those who have never read or seen the play. Its famous for being arguably the easiest of Shakespeare’s plays to understand. It's a romantic tragedy, and that certainly adds to the appeal. Teenagers definitely like to use it to point out what happens when parents, families or affiliations don't support their little love affairs. What’s interesting about it is that, despite being one ofthe oldest and world-renowned stories of all time, it still manages to draw people in with interest. \\n\\n\r\nBased on Yousuke Kaneda’s manga of the same name, Kishuku Gakkou no Juliet (Boarding School Juliet) is another rendition of the classic Romeo and Juliet love affair with a more modern take. I was surprised to find that this turned out to be a good romantic, school comedy-shounen than what I initially thought. I don’t think this would have worked as well as it has if it leaned more towards shoujo. When you look at the premise and setting, it has all the markings of a generic show, but how does it make this all work here? Well, there are two key facets to making a Romeo and Juliet story work. First, the two main characters need to be likeable, relatable, and interesting. Second, the hatred between the two groups needs to be both arbitrary and equal between the two sides. Some stories make the mistake of nailing the drama aspects but fail to make the characters interesting. Others tend to make one faction more detestable while making the other seem to be in the right. Boarding School Juliet was able to execute both facets successfully while leaning more to the comedy side of things.\\n\\n\r\nThe prestigious Dahlia Academy which educates only the elite students from the Nation of Touwa to the East and the Principality of the West. Meet Romio Inuzuka, the first-year leader of the Black Dog Dorm that represents Touwa whose members are frequently clashing with the members of the White Cats’ House led by Juliet Persia, who is also a first year, that represents the West. What’s the catch? Inuzuka has fallen in love with his rival and sworn enemy, Persia. The story depicts his struggle to keep up the pretence of hating her—along with the rest of her House—when every time he sees her. He usually goes into panic mode at the mere sight of her that it makes his heart race. He is constantly worrying if anyone else shows up he has to pretend to fight her. The show is also good at comically portraying the excruciating range of emotions the smitten hero experiences as he tries to conceal his all-consuming love for Persia with predictably disastrous results. When the two finally get the opportunity to meet alone—and without fighting each other—Persia admits that she too likes Inuzuka. No silly games of “Ifs or maybes,” but rather, more of a “How on earth can they?” Especially given all the obstacles and challenges placed before them.\\n\\n\r\nOur main protagonist goal is that one day, at the right time, that their love for each could bridge peace between the two factions, although, there is a lot of groundwork to do before that could be achieved. The shows antics is mainly based around Inuzuka and Persia trying to have alone time in secrecy for the touching moments to bond. Unfortunately for them, they are constantly interrupted in one way or another by the rivalry and ongoing war between the two Houses. The supporting cast tend to be the culprits of interrupting the sweet moments between the couple, they also serve to show their dynamics with both main characters respectively. Hasuki Komai is a childhood friend of Inuzuka who has a crush on him, a loyal friend and always looking for a fight with the White Cats’. Scott Fold is a hopeless suitor of Persia who is always trying to impress her while trying to one-up on the Black Dogs. Lastly, a snobby princess and a close friend of Persia in Chartreux Westia. She’s a royal pain in the ass to Inuzuka, she acts as a bit of an antagonist for him but later becomes a supporter of sorts since she can see that he makes Persia happy. \\n\\n\r\nThese characters help provide many of the laughs and a lot of physical and visual gags. The show is equally at its best when they are all interacting as well as the alone time with our main couple. Everything just clicks, and it goes to show that the characters are enjoyable and that makes for a more interesting comedy. Admittedly, not all the jokes land but this is definitely one of the better romantic comedies. Studio LIDENFILMS did a fine job with the backgrounds as it depicts a more old-school, fairy-tale, quasi-European look with its architecture and designs. It seems very much like a hodgepodge of styles, to the likes of Nisekoi, in its character designs and layouts. The fanservice does feel out of place, it feels more like a quota to have it in there. OP and ED are serviceable. The soundtrack is complementary to many of the well animated visual gags as well as the light-hearted atmosphere.\\n\\n\r\nBoarding School Juliet is a very simple romantic comedy that has good execution, in saying that, there are areas where its lacking, for example, the backstory to the characters could have been expanded upon more, and there are moments where it feels like certain arcs are dragging. But it makes up for it by having Inuzuka and Persia being very interesting and their behaviour is both very human and very heart-warming. On top of that, the minor characters are also nuanced and incredibly critical to the story and are evenly divided between both sides of the conflict, so there's a good balance of both personal vendettas and character development. The message of the show is that love triumphs over hate.\\n",
            "date": "2018-12-21T08:55:00+00:00",
            "helpful_count": 47,
            "mal_id": 296379,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3264993.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/papsoshea",
                "username": "papsoshea"
            },
            "url": "https://myanimelist.net/reviews.php?id=296379"
        },
        {
            "content": "The disclaimer seen in the beginning has to be one of the longest anime has to offer and it is no wonder. The title of this series could as well be changed to \"Fuck You, William Shakespeare\" and that wouldn't even affect the level of subtle we have at hand. Make no mistake, however, this isn't a parody, this is just a disgrace.\r\nWe have school settings here and the school is divided in two because people apparently really hate each others. In this other divided half -- called House White Cat, lives our Juliet, and in the another -- called House Black Dog, lives Romio.The daily school life of our students consists of people slapping each others in the face and acting like the opposing party members are total buttholes. While this is pretty much how different opinions work in irl and especially in politics, with Juliet's case there just is no reason to give a damn. \\n\\n\r\nJuliet herself is pretty much like every background anime girl ever except this time she got the role of a main. She hardly has any personality, and in generally, it is hard to even see why the main male lead would fall for her as she is just totally empty character. The main dude presents himself as some sort of cheap \"girls like guys like these, right?\" stereotype. He is practically one of those shojo love interests that solely exist in romance series until the girl realizes there is more to guys than their outlook... except this time he is the real main character. The only mildly interesting character and the only one who seems to have some sort of personality is Harusi from Black Dogs and she is used basically as an element in the series to a) create comedy and b) create some type of cheesy and completely improbable love interest alternative. \\n\\n\r\nIf this series had more comedy or at least some comedy (it is supposed to be a comedy), maybe it would be at least entertaining in some way. Thus far, the pinnacle of the comedy was a scene where our main dude disappeared in the middle of an ongoing monologue aimed at him. Which is a thing that has occurred in approximately 3 gigazaillion other anime series already, most of which presented it better and had some characters with personalities so that the comedic moments came with at least some level of depth.\\n\\n\r\nArt is another thing that could easily make this series seem better and give some sort of glory and meaning to its events, but damn if ain't generic and cheap. I am mainly reminded of those low budget action anime series from the beginning of this decade where the coolest animation tricks were practically different colored light effects. This thing looks boring, sounds boring and is boring, and on top of that, has been going for worse since the beginning.",
            "date": "2018-10-26T09:57:00+00:00",
            "helpful_count": 33,
            "mal_id": 292634,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=292634"
        },
        {
            "content": "“There’s no sexual harassment in a match” — Four-eyed sex offender\r\nOh…in that case.\r\n“Grab them by the pussy.” — Donald Trump\r\nI haven’t seen Romeo and Juliet butchered this horribly since Baz Luhrmann decided to cast Leonardo DiCaprio in a modernized version of the Bard’s classic with its original dialogue intact.  At Dahlia Academy Boarding School, the “White Cats” and the “Black Dogs” operate on the assumption that the only way to resolve their differences, is through a school yard battle royal where anything goes.  Faces get punched.  Hair gets pulled.  Even more faces get punched.  Girls clothes get stripped off (youknow, standard middle school happenings).  But amidst all the chaos and lifelong brain damage, our main character, Romio Inuzuka, reveals his affection towards his Juliet and thus begins an awkward series of events where the two must conceal their relationship from the prying eyes of their compatriots.\\n\\n\r\nRomio is your typical too-cool-for-school badass, which makes sense because he’s almost never shown in the classroom, as he’s too busy courting Juliet or pounding her head in (he should have been pounding something else).  He’s not particularly smart, but his fiery passion and general oaf-ness make him somewhat entertaining.  I genuinely spat my coffee out when he lunged himself into that mirror.  But slapstick comedy only works for a limited time, as it becomes redundant rather quickly.  Nine out of ten jokes fell flat on their face, rendering much of the show as a tedious waste of time.\\n\\n\r\nJuliet, Romio’s love interest, is a trite Tsundere with little-to-no value in the comedic department.  Her main hook includes getting infuriated with Romio’s inane comments, followed by screaming at him and/or clobbering him (it gets old fast).  While staying focused on her goals of changing the world, she also exhibits moments of foolishness when she leaves a spoon in the microwave (not funny bro, that shit kills people).  In addition, due to her petite stature, Juliet looks three-to-four years younger than Romio, making their tender encounters seem a bit awkward.\\n\\n\r\nBoarding School Juliet, lamentably, is a show without a clear direction, nor is it consistent enough to entertain the viewer with its abundance of unavailing situational comedy.  Romantic situations between Romio and Juliet are surface level fluff, routinely devolving into lewd, hackneyed circumstances with little comedic value.   On the other hand, the “love square” — Romio loves Juliet; Hasuki loves Romio; Weslia loves Juliet — creates an interesting dynamic between the characters, particularly because the love that is accessible is not the one Romio or Juliet desire.  Boarding School Juliet does flesh out the relationship between Weslia and Juliet as children, but it leaves much to be desired.  Also, the dynamics of such a relationship are bromidic, especially when little-to-no nuance is added to differentiate itself from its — numerous — predecessor’s.\\n\\n\r\nThe colorful artwork is so diversified that it hypnotizes the viewer into thinking they are looking into a kaleidoscope; unfortunately, this pristine look is impeccable beyond belief.  There is a thing as being too “perfect.”  Sometimes a sprinkling of “imperfection” can go a long way in creating an “authentic” environment.\\n\\n\r\nWhy the producers of the show decided to emulate the story of Romeo and Juliet, when the characters and thematic elements are antithetical to the Bard’s classic is beyond any reasonable person’s rationalization.  So instead of concocting a convoluted reason as to why this happened (**cough**a lure to draw in more viewers**cough**), I decided to write a humorous poem to encapsulate my thoughts on the series.\\n\\n\\n\r\n“Thou must have reckoned himself quite capable of tackling the Bard’s masterwork,\\n\\n\r\nBut it was a far cry from a tear jerk; verily, it was an incomplete patchwork;\\n\\n\r\nMethinks’ the comedy soured the mind, combined with the unkind bitch who \\n\\n\r\nConsidered herself refined;  Although she rode Romio similar to an equestrian,\\n\\n\r\nIt was obvious she wanted to ride someone else, due to her being a lesbian;  \\n\\n\r\nLove interests come and love interest go, but instead of Juliet I would have chosen \\n\\n\r\nThe ho;  If you dare question which ho I presuppose, any which one will do as long \\n\\n\r\nAs she takes off her clothes;  Watching this show became a terrible chore, and the \\n\\n\r\nVibrant colors elicited a pronounced eyesore; I mustn’t allow myself to become \\n\\n\r\nRemarkably incredulous, lest I wish to hasten my exodus via leaping from a large \\n\\n\r\nEdifice; let it be known that this anime is no gem, as it was quite fortunate to \\n\\n\r\nReceive a three out of ten.”\\n\\n\r\n— Krunchyman",
            "date": "2018-12-21T09:08:00+00:00",
            "helpful_count": 30,
            "mal_id": 296381,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6553627.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Krunchyman",
                "username": "Krunchyman"
            },
            "url": "https://myanimelist.net/reviews.php?id=296381"
        },
        {
            "content": "Boarding School Juliet has gone rather unnoticed this season due to the popularity of Goblin Slayer, Sword Art Online, and so on. As a romantic comedy, it’s hard to keep up with the top shounen shows releasing every season. However, this show is surprisingly interesting and although can’t exactly be compare to the quality of the top shows airing right now, is still quite entertaining to watch. \r\nStory: Boarding School Juliet is a spin-off of the original “Romeo and Juliet”(which is quite obvious when you read the title), as it retains many of the same elements. This time, the two rival groups, the White Catsand the Black Dogs continuously fight amongst each other with their leaders,Juliet Persia and Romeo Inuzuka, as the two star crossed lovers. These two groups are a part of the same school, but each compete to rise to the top and best the other. It’s your basic, simple storyline that has been overused, but still is enjoyable as we watch the two characters get into problematic, comedic, and romantic situations together. \\n\\n\r\nCharacters: When it comes to characters, romantic comedies tend to fall very short, and Boarding School Juliet isn’t exactly any better. Inuzuka Romeo, although isn’t as dense as most harem show main characters, still retains the cliche dense archetype many in the audience despise and are tired of constantly seeing. There’s not much depth or uniqueness in his character, he still retains a predictable and overused personality. Juliet is not very different either, she also has a very shallow character with a predictable personality. In fact, how she even fell for Romeo seems very rushed with no development, how someone who was her life-long enemy suddenly became the love of her life in a mere instant. \\n\\n\r\nArt and Music: If you have read my past reviews, then you would know I don’t put too much stress on the art and music of a show. What matters most is the plot and the characters, great art and music alone can not get you anywhere. Moving on, Boarding School Juliet’s art is quite good, and I have nothing really to complain about it. The colors are bright and it fits nicely with the comedy of the show. Music is also great, as the opening is probably one of my favorite ones this season. Overall, solid animation and music production that fits nicely with the theme and mood of the show. \\n\\n\r\nFinal Verdict: For many of us, romantic comedies are guilty pleasures, and I am not an exceptions. They’re fun to watch and many times the cuteness of the characters puts a smile on our faces. But the main problem with these type of shows and including Boarding School Juliet is the lack of strong characters and plot. It’s almost always the same predictable character archetype with a weak story to follow up on it. Boarding School Juliet is fun to watch, but it lacks two of the most important elements to truly entertain the audience. There is a lack of a strong theme or message or any powerful statement; this show like many others is simply there to make a select group of people have fun and that’s about it. Boarding School Juliet can bring many people excitement for a short period of time, but it’s a show that stays largely forgettable once it finishes airing. But if you are looking for a show for some quick enjoyment, then I recommend this show to you. \\n\r\nStory:6 Characters:6 Art:8 Music:8 Enjoyment:7 Overall:7\\n",
            "date": "2018-10-26T15:09:00+00:00",
            "helpful_count": 28,
            "mal_id": 292665,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6925209.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kyuberu",
                "username": "Kyuberu"
            },
            "url": "https://myanimelist.net/reviews.php?id=292665"
        },
        {
            "content": "So i gave this an overall 10. Despite the ending well not being the end (so this isnt a spoiler but the material its based on is still ongoing as far as i know). However as a standalone 12 episode show it was amazing. i pray we get a second season with an actual ending BUT in all honesty i honestly think this show would need at least (and that's at LEAST) two more seasons to even make that possible. I suppose a lazy conclusion would be for the countries to intermarry nobility or something to improve relations but i do not really see thathappening. \\n\\n\r\nNow as the name of the anime suggests, its based LOOSELY on the original Romeo and Juliet. However fear not this anime has nothing to do with the original apart from the use of their names, and their relationship being forbidden as they are on opposing sides by birth.\\n\\n\r\nAs someone who attended school in England, i was forced to study shakespeare's plays including Romeo and Juliet; had to play a part in one of them, and watched at least one film based on it and grew an irrational hatred towards it. As far as i'm concerned his works were decent stories for their time and showed humanity at its worst (well reality). For me anime is an escape from such, and i avoid watching anything that breaks that.\\n\\n\r\nLuckily this show has nothing to do with the original in terms of story, theme or pretty much anything. I was worried when i gave the first episode a try (after seeing clips of it on youtube) but i had nothing to be worried about. \\n\\n\r\nFor those of you who wants a funny comedic anime about romance and school life etc, this is a great show. If you wanted an anime adaptation of the original works, this is NOT it. and personally i would never want one.",
            "date": "2018-12-21T13:00:00+00:00",
            "helpful_count": 12,
            "mal_id": 296408,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7297536.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DUDZ_DNA",
                "username": "DUDZ_DNA"
            },
            "url": "https://myanimelist.net/reviews.php?id=296408"
        },
        {
            "content": "Now I know what you're thinking, another dumb rip off with dead story and characters, only watched by weebs for the occasional ecchi. But that's where your mostly wrong.\r\nDespite a recycled and pretty cringe story line, the characters give the same refreshing feel they would in an 8+ rated anime. A poor story line which you know you've seen before but packed with genuine comedy, something you don\"t get too often with the comedy genre these days. \r\nDespite the fact this anime is on a technical level bad, its enjoyable and entertaining, which is what i feel most people would watch a show for.",
            "date": "2018-11-20T00:52:00+00:00",
            "helpful_count": 7,
            "mal_id": 294395,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7276259.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sugoi_boi",
                "username": "sugoi_boi"
            },
            "url": "https://myanimelist.net/reviews.php?id=294395"
        },
        {
            "content": "So, Romio and Juliet I could have sworn I these names a familiar. I think it was a theatrical play? Anyway this anime is a love comedy and did it do romcoms justice? Well it did decent enough.\r\nThis anime is bursting with really well known voice actors and actresses from Kayano ai who voiced Darkness from Konosuba and Gintoki himself and many more well known voice actors and actresses. But the BGM doesn't shy away it is also top notch. But that isn't the best part about this anime the best part is the romcom itself. But that's about it. The story in this animeis a tale as old as harem animes, it has a generic story that we have seen in many romcom animes.\\n\\n\r\nThe story dodges cliches and makes a really good twist in the end of the 1st episode. But what really drawn me into this anime was because I was either laughing at the jokes or grinning on how cute the MCs are together. But it does not excuse on how generic their story is. There are a few good plot points in the story right now but those interesting plot points have been used in other animes as well and kinda make them a bit uninteresting.\\n\\n\r\nBut there was one thing that surprised me the most in this anime they were able to make a really good emotional moment between the MC and a side character and balance both comedy and the emotional weight of the scene.\\n\r\nI don't what's gonna happen in the next episodes but I if this anime keeps on surprising on really good moments like that and improves on the overall story then this might become an evne greater romcom then it already is.",
            "date": "2018-10-30T14:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 293011,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5379403.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MeteorEvox",
                "username": "MeteorEvox"
            },
            "url": "https://myanimelist.net/reviews.php?id=293011"
        },
        {
            "content": "A Romeo and Juliet love story re-interpretation that is actually good. No seriously.\r\nKishuku Gakkou no Juliet takes a Romeo and Juliet story, add in a harem that makes \"some sense\" for the main couple and combine all that with the basis of Romeo and Juliet's family dispute to a school setting, as much as these statements makes it out like cliche, but it's in the details.\r\nOur titular Romeo and Juliet are taking place in Dahlia Academy Boarding School where there are two rivaling countries known as the White Cats where our Juliet Persia voiced by Ai Kayano is factioned where as the Black Doggies iswhere Romio Inzuka voiced by Yuuki Ono is factioned. Romio and Persia both drives the plot forward, with Romio having a crush on Persia since childhood and wanting to help Persia to change society but their relationship is taboo in the eyes of the school to say the least. Persia trying to keep their relationship a secret and seeing both sides of society so she can change society and in a ways grow their relationship through it as well.\\n\\n\r\nNow the anime has a harem aspect, mainly with the harem element focusing on Romio and most of the time they are either allies or rivals turn support characters, like Hasuki Komai voiced by Ayane Sakura, Romio's childhood friend, Weslia Chartreux voiced by Yuu Shimamura being Persia's childhood friend and finally Teria and Kochou Wang voiced by Yui Ogura and Rina Hidaka as Black Doggy Prefects. Now Hasuki and Weslia probably gets the most development for the harem element as they aren't stereotypical childhood friends THOUGH they go through the same dilemma especially for Hasuki however Weslia gives us something unique especially towards her relationship with Persia making her actions rather unpredictable throughout the anime making things interesting, Hasuki is undyingly loyal to Romio unfortunately she goes through the typical childhood friend dilemma just under differing circumstances. Kochou and Teria however arrived a bit too late and get one focused episode in which they become an obstacle for Romio trying to get a date with Persia go awry. Nonetheless the harem aspect might be tacked in, nonetheless Kishuku Gakkou no Juliet does make good use of it.\\n\\n\r\nKishuku Gakkou no Juliet is best when it looks into Romio and Juliet's growth as a couple and heck even using the harem aspect to show differing aspects of Romio and Persia through their strengths and weakness about themselves, like Romio sacrificing his desire for the happiness of others, Persia's desire of changing the school through their relationship as a linchpin to see both sides of the White Cats and Black Doggies, but for both wanting them to grow their relationship to further both their goals to change the world as a result and because of that, strengthening the main couple further. Because of this, LA sees Persia as LA's favorite character in the series, with Hasuki being a close second and Weslia third.\\n\\n\r\nIn terms of animation done by LIDENFILMS, the animation quality from the backgrounding was pretty decent, the character designs are polished and detailed throughout the anime and the few battles are decent as well due to the decent sword choreography but tends to do moving still speedlines at times. To say the least LA feels like the character designs are the best part of the animation, as most of the characters look exotic and distinct even in uniform!. LIDENFILMS did decently overall.\\n\\n\r\nIn terms of voice acting, LA will say that voice work was very well done, from Ai Kayano to Yuu Shimamura to Ayane Sakura. The majority if not all the voice cast was pretty well handled. LA LOVED Ai Kayano as Persia but Ayane Sakura as Hasuki was just meant to be, while Yuu Shimamura just owned as Weslia with her intentionally smarmy trickster ojou cadence. It's also been a while since LA saw an anime where Rina Hidaka and Yui Ogura were in the same anime AND both being twins at that. Yuuki Ono also did pretty well as Romio and Hiroshi Kamiya as Scott Fold. LA loved this voice cast to say the least.\\n\\n\r\nKishuku Gakkou no Juliet does have the notion if the names of the characters are anything to go by and that is of the \"White Cats\" , \"Black Doggy\", Romio and Juliet, Persia, Scott Fold, Hasuki...yes the rivalry countries have their own social hierarchy because of it. The White Cats are aristocrats and work off that notion, they also represent the West, right down to their Western regal attire and mannerisms, while the Black Doggy represent the East, many characters having Japanese names at that and also wearing Japanese school attire. It goes deeper when we see the White Cats and Black Doggy's hierarchy and how they function...LA doesn't know LA really liked that dynamic and how Persia herself wants that to change as a result.\\n\\n\r\nHowever Kishuku Gakkou no Juliet has some flaws through all this however which LA DOES need to mention. LA brought up Hasuki having the childhood friend dilemma as well as the many cliches that has the harem elements, BUT as much as Kishuku Gakkou no Juliet does follow many cliches of the harem genre, Kishuku Gakkou no Juliet still does it's cliche WELL and better yet uses it's cliches to better the main characters and the harem themselves making the majority of the characters likable and memorable. Kishuku Gakkou no Juliet's cliche though they use it well it is nonetheless using cliche and that might annoy some people, not to mention the fanservice of Kishuku Gakkou no Juliet gets extremely risky though that is only happens once, but LA will defend the fanservice as they use it sparingly. Kishuku Gakkou no Juliet's flaws does have it's flaws but alot of defense to outweigh it all.\\n\\n\r\nKishuku Gakkou no Juliet's finale does have similarities to the classic Romeo and Juliet though through the typical famous event and if your wondering, the finale does the \"read the light novel\" type ending but not in a unsatisfied way as the finale does make Romio and Persia go through hurdles and hurdles in order for them to keep their lie hidden harder and harder and almost exposed and to progress to their ultimate goal of changing the world and with all the tension to this finale and really with how this finale resulted in, well LA was satisfied by it even with this \"read the light novel\" type ending, a resolution from both main focused characters and a somewhat good climax.\\n\\n\r\nKishuku Gakkou no Juliet for LA was a pretty well done retelling of the classic Romeo and Juliet story but taken to anime standards. Sure Kishuku Gakkou no Juliet has lots of typical flaws that the harem genre it entails but nonetheless Kishuku Gakkou no Juliet's strengths definitely outweigh all this, from the likable relationship of Romio and Juliet and it not being the relationship being the sole focus as both Romio and Persia grow individually with the harem elements added in and through the harem, they too grow with them be it if they know of Romio and Persia's relationship or not especially with Hasuki and Weslia, thus incorporating it's harem elements well. Kishuku Gakkou no Juliet may be a typical harem anime just with the Romeo and Juliet setting, but man was it done well and one of the more surprisingly good harem anime of Fall 2018 but also good romance anime as well.",
            "date": "2018-12-21T11:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 296399,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=296399"
        },
        {
            "content": "My first review so i am gonna keep it short :) A bit of spoilers*\r\nThis Anime series takes the elements of Classical Shakespeare Story of Romeo and Juliet from a manga by Kaneda Yousuke , with the story of the two main characters Persia Juliet and Inuzuka Romio belonging to opposite factions \"The White Cats\" and \"The Black Dog\", who fall for each other and have to overcome difficulties on a daily basis to keep their relationship a secret from their factions and maintaining it while achieving their common goal which is achieving peace between the two factions and change the world while developing andworking on their relationship.\\n\\n\r\nThe story is a mix of your generic Highschool romance and Comedy, also throwing in some serious moments at times and adapting elements of ancient time traditions and culture as its derived from the classical romeo and Juliet.\\n\r\nCharacters:\\n\r\nInuzuka Romio : A strong minded Mc with an angry,stubborn mindset at times, can be dense and clumsy. but caring for others and also most importantly honest and strong headed, also possess qualities shown time to time which is refreshing to see.\\n\\n\r\nPersia Juliet : A smart, skilled and a maiden figure, who leads by example, has a shy and loving, caring nature and wants to change the world starting by peace between the rival factions. \\n\\n\r\nHasuki : Inuzuka's Childhood friend who is cheerful, smart, and really caring for the faction members and especially inuzuka and possesses many qualities to be one of the best girls.\\n\\n\r\nChar: Persia's friend who shows a dominating and sadistic side on the outside mostly but is really caring for Persia and in a way obsessed over her. \\n\r\nThere are more side characters too but have not stand out that much till now. \\n\\n\r\nArt: Studio LINDELFIELDS have done a really great job in terms of animation, keeping it Bright and colourful , great work in the detailing of the drawings, especially as many of the scenes contain old school type of buildings, romantic scenes and views.The depiction and presentation of an old school scenario where the series is taking place can actually be felt and it goes well with elements of the story. \\n\r\nMusic and soundtrack : Not much to discuss there but the background tracks are pretty well done, considering it blends well with the scenes in the anime. The Intro and outro songs are sung by well known artists Fripside and riho lida which are pretty good. \\n\\n\r\nFinally i would just like to say this is again a rom com series with a adaption of romeo and juliet a classic. if you like something to sit back relax and enjoy, with a bit of drama and emotional touching scenes with the main element of romance and comedy, then this anime is really worth the watch.",
            "date": "2018-12-21T11:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 296392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7202385.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kipo0007",
                "username": "Kipo0007"
            },
            "url": "https://myanimelist.net/reviews.php?id=296392"
        },
        {
            "content": "Ah... I finally get to review this anime.  This anime is definitely one of my favorites for sure. And in this review, I'm gonna try explain why:\r\n(May contain very minor spoilers.)\r\nStory: (8/10) \r\nThe story is short but sweet. Throughout this anime we fellow Romio Inuzuka, as he builds his relationship with Juliet Persia. But this won't be easy for our MC. In this school, there are 2 houses. Inuzuka is part of the \"Black Doggies\", and Persia is part of the \"White Cats\".  Basically this means that these 2 houses are rivals. There are rules in between these 2 houses, so they canco-exist, without any conflict. Inuzuka has had a crush on Persia ever since they were kids, but because Persia misunderstood Inuzuka's feelings, Persia is led to believe that Inuzuka hates her. So, every year they battling, because of a simple misunderstanding. But this all changes as he finally confesses his love for Persia. Inuzuka asks her out, and she accepts. If they wanna maintain this relationship, they can't be found out, or they will be expelled from the school. Along the way, they are met with various encounters, suspicious of there relationship.   \\n\\n\r\nArt: (7/10)\\n\\n\r\nThe art isn't my favorite thing about this anime. Most of the character designs are unique, but some of them I didn't really like. For example, I didn't really like Persia's eyes, they looked a little weird to me, but this is all personal preference. \\n\\n\r\nSound: (9/10)\\n\\n\r\nI really liked the Opening song \"Love With You by Fripside\" for this anime. Its very catchy, and the lyrics portray the anime perfectly. The ending song \"Itsuka Sekai ga Kawaru by Riho Iida\" , I liked it, but it wasn't something I'd download. But it was a good ending song, none of the less. But again, that's just personal preference.\\n\\n\\n\r\nCharacter: (10/10)\\n\\n\r\nI really liked these characters. Every single one of them were interesting, and entertaining to watch. I also really liked how real the bond felt with Inuzuka, and Persia. Throughout the anime it grows, and you end up rooting for them. The love that Inuzuka feels for Persia is very loyal. Inuzuka will do anything for her, even put himself in danger, just to see her, no matter the consequences. \\n\\n\\n\r\nEnjoyment: (10/10)\\n\\n\r\nEvery week I was exited for the new episode to come out, because of how entertaining the show was. The mellow drama was also done pretty well too, and made it even more entertaining to watch.\\n\\n\\n\r\nOverall: (10/10)\\n\\n\r\nI highly recommend this anime, especially if you're a fan of the romance genre, like myself. This is definitely one of the more under looked anime this season, and definitely worth watching too. But anyways, thanks for reading my review.",
            "date": "2018-12-22T03:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 296483,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7319034.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vintagesonic1",
                "username": "Vintagesonic1"
            },
            "url": "https://myanimelist.net/reviews.php?id=296483"
        },
        {
            "content": "Easily 10/10. Animation was fantastic, and I am very happy this didn't turn out to be just another harem anime. I think their relationship progressed a bit too slow and that Romeo was a bit childish not even being able to be close to her without blushing but nothing which degrades the score of the masterpiece this is. I honestly jumped out of happiness and excitement during the last episode and that is a strong 10 for me.\r\nAlso this is not a spoiler of any storyline but the anime ended on manga-chapter 18, out of current 85. Material-wise this has every posibility for a season2. 😍",
            "date": "2018-12-21T13:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 296413,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4872881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Foorack",
                "username": "Foorack"
            },
            "url": "https://myanimelist.net/reviews.php?id=296413"
        },
        {
            "content": "Totally spoiler-free short review with almost no mentions of plot. A review on objective points of an anime:\r\nArt:\r\nOne of the most important things about an anime is the art! Boarding School Juliet's art is good enough to be graded as \"A\" or \"B+\". Its art is not superb; its drawers draw them pretty averagely, like how some normal studios draw. Another important part of the art is its consistency - is  the art always good enough to be average throughout all the episodes released so far? Unfortunately- no, but it's still ignorable. In episode 5, the quality drops a bit, making it obvious somethingwas rushed.\\n\\n\r\nSound:\\n\r\nThe OP sounds like it was sung by Yoshino Nanjo; her songs are always nice to hear. The ED is also very melodical and worth listening to. \\n\r\nThe VAs don't sound awkward at all! I think one factor that makes the non-awkwardness of the VAs possible is actually the director's decision on how to animate things (for example - for how many seconds does the director want this and that scene to last). Fortunately, it seems that the VAs were given enough time to speak fluently and naturally, with nothing rushed.\\n\\n\r\nStory:\\n\r\nThe director did a good job, in my opinion, on not rushing things. It seems that many anime has their quality dropped because of rushing. Fortunately this is not one of them. It has a nice pace.\\n\r\nThe story itself is entertaining! Some might say that it is cliche, but it only is in the first episode. You stay on the ride for this anime because of the comedy (I did). It's a new rom-com that I haven't watched in a long time.\\n\r\nYou have to keep the 3-episode rule for this anime. My opinion of this anime improved after I watched the third episode.  I think it's because the first episode gives a boring introduction of the characters, and the second episode mildly starts trying to make the viewer interested. In the third episode, some more characters are introduced and things get more dynamic - with the dynamicity, entertainment also started for me. \\n\\n\r\nCharacters:\\n\r\nCharacters can only go so deep in a 12 episode series. It is especially so if it is a rom-com. Too much character depth isn't neccessary in a rom-com (I guess). One thing I can remember to commend about this anime's characters is that they don't irritate you.\\n\\n\r\nI enjoy rom-com a lot, and I just felt very entertained when I watched this so I want to give it a 9. However, maybe a more objective and critical opinion would give it an 8.\\n\\n\r\nEdit: after having watched more recent episodes, I have to take back my opinion on consistent art and not rushing. I guess it's inevitable that a 12 episode series has to pack in a lot of content in a short amount of time leading it to make things look less smooth, but it's still true that this anime still delivers at least average art and animation throughout the episodes so far.",
            "date": "2018-11-13T18:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 294013,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3181469.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/eeasuper",
                "username": "eeasuper"
            },
            "url": "https://myanimelist.net/reviews.php?id=294013"
        },
        {
            "content": "If there's anything from ninth grade I remember most, it's the unit where I was forced to read the Shakespearian tale of 'Romeo and Juliet', the classic romantic tragedy of two lovers of opposing families who were never meant to be, ultimately dying together as a sign of their love.  (Spoiler if you've never read the book, watched the play, or watched any of the hundreds of story variants.)  So really, what's the next step for such an old and classic tale?  Rewrite and reproduce it as an anime of course.  \r\nStory:\r\nBoarding School Juliet takes place on Dahlia Island, the sole island in the middleof two rivaling countries: 'Touwa' and 'The West'.  On Dahlia Island is the boarding school where there're two dormitories based on the rivaling countries: The White Cats for 'The West', and the Black Dogs for Touwa.  In the midst of this rivalry, our protagonist Inuzuka Romio of the Black Dogs confesses to the leader of the White Cats, Persia Juliet, and the two begin a forbidden relationship where getting caught would most definitely cause a war between the rivaling sides.\\n\\n\r\nFirst off, I want to ask.  'The West'?  Seriously?  You couldn't come up with a better name for the Capulet/Britain side of this equation?  I'm kinda disappointed if only for how lazy it sounds when you put it next to 'Touwa'.\\n\\n\r\nThere's really no better way to explain this show other than 'Anime Version of Romeo and Juliet'.  Seriously; even the protagonists are named that.  But I think that simplification is giving the show not enough credit.  While the setting is certainly reminiscent to the Shakespearian work, in actuality, the show is more about the relationship between the protagonists and how both each other and some of their closest peers react to what's being fostered between the two.  There's a real attempt at further developing the 'tragic romance' of the original story, and that ultimately turns the story into one where the two halves of the couple develop into better characters all the way towards the end.\\n\\n\r\nBecause of this, I found myself weirdly engrossed in the story, really rooting for the mildly dumb couple as more and more wrenches are thrown into their plans of things like going on a date or just speaking to each other on school grounds.  Not only that, but typical anime tropes like sports festivals and birthdays get 'Romeo and Juliet'ified so had that it actually feels fresh, if not a little dumb when you don't keep in mind that this is an anime rendition.  The ending caps everything in this manner too, giving a satisfying enough ending to elude to a \"read the manga\" ending, but still being paced and written well enough ti serve as its own standalone ending.\\n\\n\r\nAll in all, what can be said about 'Boarding School Juliet' is it being a show that despite being basically an anime parody of Romeo and Juliet, is actually a decent romance story based off of the concept that is way more fun to watch than any actual faithful telling of Shakespeare's work I've ever seen or read.  You actually get to see the relationship grow through the episodes, and just adding that layer made it way better than I ever thought it to be.\\n\\n\r\nOverview:\\n\r\n+ Actual growing Relationship\\n\r\n+ Everything is 'Romeo and Juliet'/Montague v. Capulet to a hilarious degree\\n\r\n-  'The West' Seriously, why name the Capulets that?\\n\\n\r\nCharacters:\\n\\n\r\nRomio and Juliet (better known as their last names of Inuzuka and Persia) are certainly quite the pair in this rendition.  Inuzuka is an outwardly scary but ultimately a determined and loyal person with a heart of gold.  Like a dog.  Persia is a proud and independent girl who has her moments of being cute and taking out her claws within a few scenes.  Like a cat.  (Huh, starting to see the duality here.)  Together, they make the show's dumb/main couple that I honestly can't do anything but root for.  They are ultimately each other's motivation for their actions, and you see a lot of that culminate in the final act of each episode before starting the process over with a similar or different obstacle in the way.  You see them grow from each other, care for each other, really making everything feel like a genuine relationship where trust and acceptance for each other's strengths and flaws are at the core of their love despite the ridiculous and vaguely comical setting they're in.\\n\\n\r\nRecurring characters like Hasuki, Princess Char (and Scott), and a few others primarily serve as blockades or obstacles to the main couple's relationship, often times having an episode where they are the main contributor to the conflict before mildly intervening or supporting at various points in the series.  They grow along nicely thanks to the harsh reality that they just have to deal with the fact that their friend is 'dating the enemy', which isn't as annoying as it could've been, so that on its own is a major boon for the series cause it makes these potential roadblocks better characters in the end.\\n\\n\r\nThis factor also extends to the setting since the show really goes to a hilarious amount of lengths to show how much the two sides hate each other, often times having either faceless background characters or background characters with faces shouting obscenities at each other which is somehow more gratifying than it should be when the main couple does some 'traitorous actions' cause they just want to either be left alone or spend time with their significant other.\\n\\n\r\nOverview:\\n\r\n+  Active and prominent protagonists\\n\r\n+  Side cast adds to the story instead of subtracts\\n\r\n+  Side cast helps to embolden the rivalry\\n\\n\r\nArt:\\n\\n\r\nProduced by Lidenfilms, the art for Boarding School Juliet varies depending on what exactly you're seeing on the screen.  For the most part, the show appears as a pretty standard show without much to make it unique.  Colors are bright all the way through, and the only clever use of color I can say is the fact that the opposing sides have different uniforms (colored white and black, surprise surprise) so just at a glance you can tell who goes where.\\n\\n\r\nBut from the design side of things, I feel like Lidenfilms kind of dropped the ball here in terms of quality.  More distanced shots clearly have a reduction of quality to them as the animation (though smaller) looks a lot rougher than the standard shots for the show, and for fanservice reasons, chest sizes for the girls in the show seem to vary depending on what's being shown.  So for that reason, the anatomy for its characters appear inconsistent.  (Especially considering Persia is supposed to be 149 cm or 4.8 ft, and compared to Inuzuka, he either looks like a giant or only a number of inches taller than her.)\\n\\n\r\nOverview:\\n\r\n+ Relatively standard art\\n\r\n-  Some animation and consistency issues\\n\\n\r\nSound:\\n\\n\r\nFripside's \"Love with You\" both gives me both surprise and much annoyance.  For some reason I don't associate Fripside with a show like this, but it sounds good, and...remarkably similar to what I expect from the band.  But given who made it, I can't really be upset cause the song is good, and as always, remarkably difficult to find the full song without edits.  \"Itsuka Sekai ga Kawaru made\" by Riho Iida by comparison doesn't feel as interesting and I actually found it to be more forgettable than anything cause nothing about it really stands out aside from the fact that it's a really annoying mood breaker considering what some of these episodes end on.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nWeirdly enough, this was one of my favorite shows of the season.  Initially I started it as a bit of a joke cause I'm a sucker for dumb romantic comedies, and an anime version of Romeo and Juliet sounded right up my alley for a good time.  What I was not expecting was a competent plot followed by characters and a couple that I actually cared for and genuinely thought as being a better rendition to what Shakespeare first wrote just for the fact that the relationship felt like it was actually worth something rather than a metaphor for love v. lust that was not fun to discuss back in ninth grade, and still isn't fun now.\\n\\n\r\nSome highlights separate to scenes involving the main couple being cute idiots when they're alone together involve both Hasuki and Scott, as for me, seeing both Sakura Ayane and Kamiya Hiroshi portray equally hilarious characters in context to the characters of Mercutio and Tybalt just made everything more enjoyable than they should've been.  My whole time watching this really just amounts to: This is all so hilariously trivial, but it's amazing in a way only anime of all things could do it.\\n\\n\r\nPretty much for that reason aside from some genuine care put into making a proper anime (and more enjoyable) rendition of Romeo and Juliet makes me give this show a stamp of approval for something if you're looking for pure enjoyment factor.  At the very least, the show's a fun watch, and definitely deserves a chance even if you hated the original Shakespeare's play that you were forced to do reading and a report on.",
            "date": "2018-12-27T15:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 297092,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=297092"
        },
        {
            "content": "If you are expecting an anime version of Romeo and Juliet, look elsewhere.\r\nAlthough the plot seems to follow along Shakespeare's original play, it is more like if someone took a spin-off of the play... and added comedy and anime tropes to it.\r\nHowever, the lack of Romeo and Juliet themes doesn't detract from the overall viewing experience. The atmosphere is surprisingly lighthearted, in spite of several more serious events taking place. \r\nI personally find that the characters are the best part of this anime. Most characters are unbelievable (there is no way that a perfect girl like Persia exists in reality), but that is just partof their charm. The characters do have relatable motives for their actions, although those actions are performed in the standard over-the-top manner. \\n\\n\r\nIn summary, watch this anime if you want a lighthearted comedy with some unique characters.",
            "date": "2018-12-27T15:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 297090,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mystery132",
                "username": "mystery132"
            },
            "url": "https://myanimelist.net/reviews.php?id=297090"
        },
        {
            "content": "There's a saying, screw you for your perspective. This one applied quite well. \r\nOne sentence, it’s pretty much your generic anime series without any much originality. Honestly the comedy gag is not even funny, the characters are straightforwardly boring, spice it up with laughable plot just because to make it ‘plot’ for no apparent reason. The fight between cat and dog is barely passable as konoha vs uchiha cloning in a cute way and the characters is annoying beyond help. Its like “hey let us throw a whole lots of personalities, its gonna be fun for sure!” Aaaand it turned out as vast as rubbishin the sea. \\n\\n\r\nThe setting itself could be much more developed and exciting to see but they launch it to neptune instead. Its probably better if it stays as one shot (original) rather than giving a fake hope to the watchers. Its bland, and not even interesting to keep me going as i found myself struggle just to even finish it. The traditions of fighting between cat and dog, its just there for the ‘plot’. No other reason or any deep meaning. Simple as that. The exciting premise from oneshot before this one turned into a series of manga and anime already has been long lost. \\n\\n\r\nThese characters on other hand feel like throwing salt to our face. You know when you gets annoyed so much that you just can’t help but to throw salt to other person because its so bad. Might as well call it satanism cleansing. Inuzuka is the perfect example of generic mc. He doesnt even have any unique or special traits in him. If you toss him into a vast sea of shounen mc, you will lose him for sure. Next comes our juliet that’s supposed to make it better.. but no she comes with a freaking holy water instead to splash our face like a freaking satan. Thats just how worse it is. She not even worth mentioning, no guts or tiniest bit of bravery, just a stupid shy princess with no redeeming qualities at all besides the cutie face. The others? Nah they arent even worth to be mentioned. Unless you want to see me to rant about how our eyes got burned alive seeing lovely-dovey of stupidity moments. \\n\\n\r\nTo wrap it up, its not even interesting to me. Its feel like i will forgot this series as fast as sunrise in tomorrow morning. I do had some moments to be enjoy but it is too little to withstand the bad points. Worse, the ending doesnt even left any impression or impact at all. It’s unfortunate as this series truly had a potentials in the beginning but now its just a selfish wish of mine. It seems great, but in the end it's just meh. \\n\\n",
            "date": "2018-12-21T00:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 296341,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6947487.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Seizawa",
                "username": "Seizawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=296341"
        },
        {
            "content": "Let's get straight to the point: Kishuku Gakkou no Juliet is an okay show; there are a lot of uninteresting moments, but there are some enjoyable ones too.\r\nThe first thing most people would expect the show to be is an anime rendition of \"Romeo and Juliet\". It borrows a couple of things such as the names Romeo (or in this case, \"Romio\") and Juliet, as well as the idea of 2 rival factions where the secret lovers are from, but that's about it for similarities. \r\nThe show wastes no time in pairing the two together. Being secret lovers, they need to do all sorts ofantics to make sure their relationship stays hidden. The story isn't the most interesting and it's pretty generic, but that isn't necessarily a bad thing; it all depends on the execution.\\n\\n\r\nMy main gripe with the show is the chemistry between the main leads. Their relationship just doesn't feel very interesting, and to a degree, almost one dimensional. They have a couple of cute and funny moments together, but I often find myself wanting to \"get it over with\" during scenes where they're alone. Romio is a little dense and his interactions with Juliet get a little too predictable. Likewise, Juliet is your typical \"goody two-shoes\" female lead and this just generally results in uninteresting dialogue and scenes. This wouldn't be too much of a problem, but the idea of the show is centered between these two characters and so far it just hasn't been doing it for me (hopefully this gets better in the later episodes).\\n\\n\r\nThus it amuses me to say that interactions with every other character show seems so much more interesting; some of the best and funniest scenes are from the supporting characters. The relationships between the leads and side characters (e.g. Romio and Hasuki, Juliet and Char, Romio and his classmates) is so much more enjoyable to watch than the main relationship. But naturally, the show wants to push the whole Romio and Juliet thing, so we always end up circling back to it.\\n\\n\r\nThe animation does look pretty good at times, especially during the action scenes; the accompanying music during said scenes is also pretty solid. \\n\\n\r\nI really do hope the show steps it up for the remaining episodes. If episode 4 is any indication (first episode with any emotional weight), then the rest of the show could be pretty decent. But then again, that episode wasn't centered around Romio and Juliet but rather Romio and (good girl) Hasuki, so who knows if things between the leads will become more interesting, especially if there'll be more focus later on. There's room for improvement so I'm cautiously optimistic.\\n\\n\r\nIs it worth watching? If you don't mind the leads being a little bland, then sure. There's some good to be found in the show, but at this point it's really dependent on how much you can tolerate/ don't mind.",
            "date": "2018-11-01T02:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 293108,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/jorobatu",
                "username": "jorobatu"
            },
            "url": "https://myanimelist.net/reviews.php?id=293108"
        },
        {
            "content": "So...contradictory to public belief, I actually have no idea that Rodeo and Juliet refers to an old folk tale of some sort that portrays forbidden love (not to be confused with the more common \"incestuous love\" seen on anime these days)\r\nSo jumping to the anime without expecting it to be about \"forbidden love\", I would say this is a rather interesting take on a romcom (abbreviation of \"romantic comedy\").\r\nArt-wise, it's pretty much the exact definition of \"average\". Something like what A-1 Pictures would make, not really out of the ordinary, and not really bland, just positioned right at the line. Guess you don't really seeeye-catching designs outside shaft's works.\\n\\n\r\nAs for the story, I'm not really sure if trying to adhere to the rodeo and midget kind of a plot was the reason behind its staleness or if that's how the author is trying to direct the story, but to be frank, it was pretty gosh darn predictable. That is excluding the sometimes overly-forced comedy, those are less predictable, except you can't really view those as plot elements.\\n\\n\r\nAlso, good voice actors in this one, you can pretty much recognize their very distinct voices. Kamiya Hiroshi that's pretty much everywhere, cuz he's famous :3, Cocoa's (from GochiUsa) voice actor and Ogura Yui (who doesn't love some Ogura Yui-styled loli voices). That's pretty much it, not really outstanding, but that's quite a lot of big names in one small anime, although mostly acting out the side dishes (characters). \\n\\n\r\nBackground audio wise, (I am usually very harsh on this aspect) is pretty much average, at least it's not shed, but repetitively using the same old melody and not really fitting the atmosphere most of the times does leave me uneasy. Yes I speak like it's crap, but I would say it's above-average since pretty much all animes are like these, so I wasn't expecting much as well.\\n\\n\r\nChracters are quite distinct actually, despite being distinct they blend together quite well. After watching the entire show I can confidently recall each character's personality, and heck even the side characters were leaving strong impressions sometimes. They are not really distinct to the point that it feels \"forced\", they just blend in so well that you feel like \"that's what their personality should be\". I would call this an absolute success in character construction.\\n\\n\r\nOverall, you should be expecting pretty much an average anime in all aspects. A romcom with semi-predictable development (if you follow the Ronny And Julie scale) and absolutely average (like A1 pictures, for example) art quality. PLUS quite a number of big name voice actors acting out side dishes (characters). The anime didn't really left a deep impression in me, but I wouldn't say it's bad either, just average, very average.",
            "date": "2018-12-28T06:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 297177,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/knappjones",
                "username": "knappjones"
            },
            "url": "https://myanimelist.net/reviews.php?id=297177"
        }
    ],
    [
        {
            "content": "Fall 2018 drew quite a good amount of attention with shows like Bunny Girl Senpai, Tensei Shitara Slime Datta Ken, Goblin Slayer, Zombieland Saga, and SSSS Gridman (not counting sequel seasons). Because of this, quite a number of other series mostly felt under the radar or were simply ridden off as “boring” or “lame” after just a few episodes. Many of those you can actually say are “objectively bad”, many are just mid-ground, and then some are actual hidden gems (even if not diamonds)…..this show, in my honest opinion, was one of them.\r\nI’m pretty sure we’ve all heard about that classic play by William Shakespearecalled “Romeo and Juliet”, which encompass the story of two star-crossed lovers and their feuding families/groups. Two other anime series come to mind: a two-cour fantasy take called Romeo x Juliet (a great fantasy romance show I’d recommend) and another popular rom-com series called Nisekoi, an amusing but ultimately generic run-of-the-mill show (in my opinion).\\n\\n\r\nAnd now, we get this single-cour (SOB…) rom-com manga adaptation by the name of Kishuku Gakkou no Juliet (english title is “Boarding School Juliet”). From what I heard, the manga depicted certain events and characters quite differently compared to the anime, which to me, really doesn’t change anything considering I’m mostly an anime-only sort of individual, sans special occasions of peaked curiosity.\\n\\n\r\n(WARNING: Some spoilers up ahead)\\n\\n\r\nBoarding School Juliet focused on the two main characters Juliet Persia and Romio Inuzuka, who are from two opposing groups in a boarding academy, with Juliet being of the White Cats and Romio being of the Black Dogs. Like with the original story and the anime Romeo x Juliet, Juliet and Romio secretly established love relationships, and like Nisekoi, the story has comedic value wrapped with it.\\n\\n\r\nSTORY/SETTINGS: 7/10\\n\r\nThis version of the Romeo and Juliet story takes place in a European-esque school setting, but not quite a typical school setting, as the two opposing families/groups occupy their own domain and facilities, including the dorms. The two parties are in conflict on a practically daily basis, often over the silliest things. What I noticed from the get-go, especially from the first scene in the first episode, is that this show is quite a bit more action-oriented than most rom-com series. Practically everybody in the academy seems to be quite more athletic than the normal student. Another interesting aspect I found out in this show is that the segregation between the two groups in terms of educational establishments goes as far back as elementary school. There’s also the strong sense of pride and personal image that is instilled into the ideals of both parties, where not meeting up to expectations or committing acts that are frowned upon, which include peaceful interactions with members of “the opposing team” will subject one to severe consequences. One more key thing to note is that because of the nature of the boarding academy and the parties involved, school activities and events are conducted in a peculiar manner that can be considered a “hyperbolic” version of the same stuff you’d see in normal Japanese school settings. These particular aspects are where I felt the show really did give a nod to the tension, conflict, and competition between the Capulets and the Montagues in the original story.\\n\\n\r\nBefore I get to other strong points in the story, I think I should bring up a major weak point that this show does suffer in the narrative department, and perhaps the only real main flaw of this series. The overall pacing of the show is rather unorthodox, so quite often certain key events or arcs feel like they’re being dragged out a bit too long, or (at least from my perspective) played out too hastily. Due to this, many of us as viewers may feel mentally tested trying to keep track of the sequence of the events. Additionally, due to the weird pacing, the show neglected to invest enough time to dive as deep into the characters’ backstories as they could have. However, considering that the show is single-cour with 12 episodes (barring an announced 2nd season if the possibility is there), the rocky pacing and shortage of backstory content can be understandable and forgivable to a certain degree, depending on how one feels about rom-coms in general.\\n\r\nNow, back to the strong suits. Unless most rom-coms, Boarding School Juliet endeavored to give more structure to the relationship between the two main characters. With each following episode, our main guy Romio and our main girl Juliet discover and talk about NOT JUST about the fact that they love each other, but WHY they love each other. At the same time, though, due to the nature of their love being “forbidden” to their respective parties, they have to try all they can to keep their secret and keep the façade of being hostile towards each other in the eyes of their schoolmates, which almost always lead to countless hilarious fallouts, often very predictable but still hella funny. I felt like this show really did well in terms of its portrayal and ramping up of its comedic moments, the majority of them, of course, involving Romio and Juliet going through some of the most ridiculous predicaments (even if they’re very predictable); more often than not, their own friends and classmates are often drawn into the gags as well. Some of the comical moments, though, do have instances of fanservice, sometimes forced, which are pretty much hit-or-miss, depending on your intended audience. The relationship between our two main characters was also given more structure as Romio met and interacted with other recurring characters, and through these events, both of them were able to find more reasons and incentive to love each other, as well as encounter and push through adversity that threatens to do one or both of them harm. One more thing to note: the show did not commit the obnoxious crime of forcing an awkward harem situation with our main guy.\\n\\n\r\nSOUND: 8/10\\n\r\nIt was only until recently that I found that the opening theme of this show was sung by fripSide, a band who also sung the opening themes for both seasons for Toaru Kagaku no Railgun (second season of that series I REALLY enjoyed). While I wasn’t exactly a fan of the Railgun opening themes, I really liked the group’s work with THIS particular opening theme: “Love With You”. This particular opening theme is not something you’d usually find in most rom-coms; from the majority of those I’ve watched, the opening theme had a more “goofy”, light-hearted, bouncy tone that would befit practically any romantic comedy series. This is not quite the case with this particular opening: while it does have a very uplifting, lively, moderate-paced tempo, the singing voices seem to give a certain amount of weight and depth during the verses, before gradually speeding up to enter the chorus section. For someone who’s been exposed to plenty of types of music via just listening from the radio, I tend to notice more of the certain characteristics that make songs or soundtracks unique or comparable, though I’m not versatile enough to come up with the proper vocabulary for them (LOL). The ED theme is sung by Riho Lida (who herself had a very minor role in the show), who also sung the theme songs for the Love Live School Idol series; the ending theme has a more chill and laid-back feel to it, as the visuals focused on the recurring female characters.\\n\\n\r\nThe rest of the soundtracks were made to complement the serious moments, the emotional moments, and the comedic gags, however and whenever they occur. They also fit the mostly light-hearted atmosphere, which is fairly normal in any rom-com show. The voice acting did a solid job of not just giving the character dialogue more befitting emotions, but also gave characterization to the kind of person each particular character is, as well as their role in the series.\\n\\n\r\nANIMATION: 8/10\\n\r\nApparently the studio handling this show is LIDENFILMS…the same one that managed Hanebado, a Summer 2018 sports series that had stunning animation (though with a lackluster story and poor management of characters). For them to follow up on that show with another solid showcasing of animation quality, even though they’re likely not on the levels of studios like KyoAni, Bones, Wit Studio, and Ufotable, that deserves a honorable mention, if not a frigging medal. What I really liked was the extra attention to linear details and the adjustments of light and contrast, especially with certain scenes when the camera focuses directly on the face of a particular character. A frequently used but interesting visual is where you can actually see specks of floating dust illuminated by sunlight coming through a window…those particular screenshots I found very mesmerizing because the effects can make the scenes seem all too realistic, to where you may be tempted to try to reach your hand through the screen to grab at the glowing specks of dust.\\n\\n\r\nIn short, very good, if not great, animation quality all around, with very little inconsistency with character designs and movements. One more thing I will take note, though….why are the girls given more prominent-looking irises instead of the guys? I think it’s more so to bring out the girls’ attractiveness and charm as anime characters, which is honestly not a bad thing or a big deal at all…in fact (again, depends on your audience), it can help the viewers like the characters even more. I mean, you don’t want a bunch of fugly-looking cast members, right?\\n\\n\r\nCHARACTERS: 8/10\\n\r\nI did mention before that the show’s shortcomings of not being able to fully dive into the characters’ backstories did kinda hurt the show quite a bit. However, when you put that aside, the characters are well-written. Here’s some focus on some of the prominent characters:\\n\\n\r\nJuliet Persia is a tsundere, but not of the usual bland variety I’ve often had to put up with in the past decade. She is very confident in herself and her abilities, but is shown to be kind and understanding, especially when it comes to Romio’s awkward romantic gestures. While she can be understandably dense at times, she does not shy away from the relationship, and does whatever she can in her power to help her relationship with Romio, in the hopes that their love can one day finally end the conflict between their parties.\\n\\n\r\nRomio is a headstrong and brash young man who usually does the talking with his fists. However, he does have a notably tender and kinder side to him, to where he actually got on good terms with some members of the White Cats, even sometimes helping them in his own way. He tends to be a goofy and awkward romantic in his relationship with Persia, to the amusement of the latter. He also has a great fear of his older brother, Airu Inuzuka.\\n\\n\r\nHasuka Komai, arguably “Best Girl” of the series, imo, if it wasn’t for Persia, is Romio’s closest friend and childhood friend, and has deep romantic feelings for him. She is very supportive of Romio to where she was able to accept Romio loving someone from the other party after learning about the two’s “forbidden” love. What I particularly loved about Komai is that she knew very well, even after her straightforward, tearful confession, that she was never going to be the one to be with Romio (in short, “friendzoned”). However, because of the fact she still loves him, Komai decided to support and help him whenever she can, as well as wait for him, should the relationship not work out between Romio and Persia; she even agreed to keep his secret from their fellow peers. That level of understanding and support was something I really found admirable. Because of this, she was even able to befriend some of the members of the White Cats as well.\\n\\n\r\nChartreux Westia is the savvy “cat lady” of the show, and nicknamed “Tyrant Princess of the West”. While she does try to sabotage Romio’s relationship with Persia at one point, it is only because she has been doing everything to protect Persia since childhood, to the point of being obsessed with her. However, after coming to an understanding, she went on good terms with Romio, sometimes even working together with him whenever help is needed. Quite often during the series, she becomes a catalyst for comical gags, much of the chagrin of the men, which does not exclude Romio himself.\\n\\n\r\nAs for the rest of the recurring cast, they do passively play a part in terms of giving structure to the dynamics of Romio and Persia’s relationship, whether through giving them adversity or support. As mentioned before, though, the characters could’ve been utilized even better if their backstories were given more detail. Even the minor characters were given a good amount of characterization, making them very crucial to the story because they balance out both sides of the feud.\\n\\n\r\nENJOYMENT/SATISFACTION: 9.5/10\\n\r\nI actually enjoyed this show a lot more than I expected to. The comical gags, the recurring characters and their personalities, the development of the romantic relationship between the two mcs, the emotional moments….they were great.\\n\\n\r\nIt was definitely a huge relief from the constant, generic, blandly written stories of the majority of rom-coms I’ve watched in the past, especially Nisekoi. That show, in particular, never really seems to have any sort of significant progression with a romantic relationship, instead resorting to throwing in numerous potential love interests to instigate a harem situation, which I often grow tired of nowadays. Boarding School Juliet, though, didn’t have as much, if any, of the fallouts that Nisekoi had. It was quite the pleasure for me to watch Romio and Juliet clumsily try to handle their curious relationship, as well as anticipate with glee for the funny gags to show up. While there was a fair amount of fanservice, I didn’t really find it that offputting at all, though at times I will admit every now and then that it sometimes can feel forced; otherwise, it’s more laughs for me….the more, the better. One last thing: I couldn’t help but root for Romio and Persia whenever they face great adversity that threatens to demolish their relationship; especially with the occasions where they took great risks for the sake of each other. It’s safe to say that at the end, I was more attached to the show than most people while it lasted, and while the way it ended would call for a second season, I’m still grateful for what was provided as a solid manga adaptation and a not-so-generic rom-com show in general. A final confession here is that I forgot I was watching a modern day spinoff take on the original Romeo and Juliet story until that final episode.\\n\\n\r\nFINAL WORD:\\n\r\nIf you love rom-coms, but are tired of the “same old, same old”, OR if you like watching spinoffs of Romeo and Juliet, this could be the show for you. While this show does have its flaws, at the very least, it’s a fun and well-executed romantic comedy, with very likeable, interesting, and entertaining characters, as well as a honest development of the two main characters’ romance. It is one of those shows that avoided the sin of having “quantity over quality”, something that most shows nowadays tend to fall victim to far too easily.\\n\\n\r\nThis show had me smiling throughout its entirety, and I hope it’ll do the same for you as well. Have fun!\\n\\n",
            "date": "2018-12-21T23:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 296459,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5242474.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ryuseishun",
                "username": "Ryuseishun"
            },
            "url": "https://myanimelist.net/reviews.php?id=296459"
        },
        {
            "content": "Please note this review is intended to be read by those that have finished watching Kishuku Gakkou no Juliet and while care has been taken to minimize spoilers there may still be spoilers within character analysis. You have been warned. \r\nBased off a popular manga of the same name Kishuku Gakkou no Juliet better known as Boarding school Juliet is a romance comedy themed anime that gives us the opportunity to see what will happen if you reimagine the classic romance story of Romeo and Juliet and replace the feuding families with two rival countries who send students to a neutral boarding school and themany rivalries, bonds, friendships and romances that can occur when students from rival countries compete with each other in the many events that are unique to school-based settings. The main concept for boarding school Juliet naturally is the famed romance story of the same name a story that due to its blend of tragedy and romance has garnered an impressive reputation over the years since it become known and since reading it in school it has become one of my favorite stories. As a result, when I heard that this anime will make use of a reimagined story where it will replace the stories tragedy with comedy and its family feuds with the tense relations between two countries that are inches away from war, I have to say that my interest was piqued. The first episode of the series made a pretty good impression on me as it not only did a great job of showing the kind of tense relations that existed within the schools two main factions but also introduced both an intriguing cast of characters and the sense of forbidden feelings that exist between Romio and Juliet. \\n\\n\r\nThe overall story of Boarding school Juliet takes place in Dahlia academy a private boarding school that is situated in a remote island that’s far from the mainland. Here in this remote but beautiful academy students from two of the continents main powers which are the Eastern nation of Touwa and the Principality of the West are sent to attend and receive their education before graduating and joining the society. But while the academy and the surrounding town are beautiful and provide the students with everything that they can possibly need for their time at the academy the students of the two nations that attend the academy as if mirroring the true situation that exists between their respective homelands have rather than forge bonds of friendships with their opposite numbers and try to enjoy their school life in relative peace instead does the opposite. Rather than strive for a peaceful environment as one would expect the students from both sides instead form two factions that are centered around their respective dorms that see each other as hated rivals. These two factions are the White Cats that represent the students from the principality of the West and the Black Dogs that represent the students from the Eastern nation of Touwa. \\n\\n\r\nIn the midst of this endless struggle where both sides would make use of every opportunity and school event to prove their superiority over the other in their quest to satisfy their pride is Romio Inuzuka the youngest son of the famed Inuzuka family of the Eastern nation of Touwa who while brought up to show nothing but dislike for the members of the principality of the west and by extension the white cats that serve them has a hidden secret that he hides desperately from his comrades. For unknown to them Romio actually has a massive crush on Juliet Persia who is his opposite number within the white cats. After a dramatic confession that came after a equally dramatic dual between the two Romio while managing to forge a romance between him and his crush also finds himself embarking on a wild and high staked adventure as he and Juliet must while gradually getting to know each other and forge deeper bonds with each other must work hard to keep their forbidden romance from not just the school authorities but also their closest friends for if their liaison is revealed they would not only bring great shame to their factions but also to their countries and families as well. Joining Romio and Juliet’s little high staked adventure are a host of characters that while initially against the idea gradually approve of it. These include the positive and caring Hasuki, the proud but equally cunning Weslia, the quiet and timid Teria and her older sister the mischievous but surprisingly kind Kochou. Together Romio and Juliet and their many allies must do all they can to keep their romance hidden from both the school prefects and their equally suspicious dorm mates as they go about their school life and live the life of a normal student and maybe one day be able to graduate and make the changes to society that both so much desire. \\n\\n\r\nJuliet Persia \\n\\n\r\nJuliet Persia portrayed by veteran seiyuu Ai Kayano of Three Gatsu no Lion and Grandcrest Senki fame is one of the main characters of the series and is the main heroine of the series. A 1st year student of Dahlia academy Boarding school and the student leader of the 1st year high school division of the White Cats faction Juliet on initial appearances can be seen to be a brave, kind and understanding person by nature whose beauty and grace have earned her the title of Lady Persia among her dorm mates. A polite, hardworking and modest person by nature Juliet while a noble by birth is shown to have none of the typical traits that such people exhibit and indeed rather than showing arrogance and pride instead shows consideration to all that she meets in school provided that the opposite party isn’t acting in a threatening manner. While possessing both intelligence and beauty in spades Juliet is someone that’s noted to be a responsible and loyal person that always places the wellbeing of her friends over herself a fact that is shown well within the series. While having the air of a noble it can be seen that Juliet isn’t just a lovely flower for beneath her beauty Juliet is shown to be fiercely independent that’s reinforced by a strong will to prove herself to not just the world but to his friends as well. This is shown well within the series in the serious side that Juliet shows when standing up for her beliefs where both her determination and inspirational nature can clearly be seen.  True to this aspect of her personality Juliet is also shown to be somewhat of a realist and is someone that prefers to hear everything that transpires in an event before deciding on a decision on the steps that she should take something that I really appreciate about her character and something that I thought placed her in good stead as she began coming to grips with the struggles that existed within the school. \\n\\n\r\nAs the series goes on and Juliet’s personality is expanded upon it can be seen that beneath her confident and kind nature Juliet also has many struggles that she hides from all but her closest friends. While shown to not just have confidence but also an impressively strong will as the series goes on it can be seen that this is just her surface personality as beneath this Juliet is shown to be surprisingly fragile. While largely content and understanding of the role in which she must play within both the school and society it’s shown that Juliet is someone that dislikes being seen as weak and being pitied that stems largely from the great pride that she feels for her family. As a result of this Juliet is someone that tries hard to shoulder all the burdens, aspirations and criticisms that are placed on her something that her closest friends constantly worry about. While content with the role that she must play within the school however it can be seen that Juliet also understands that the current state of things within the school cannot be sustained and as a result works hard to foster better relations between the two sides within it hoping to create a better world and hopefully change the rules that govern it. In the beginning of the series largely as a result of her status as a noble Juliet was shown to struggle somewhat with placing her trust in others and as a result while she had no real shortage of friends that she can count on to help her she had few people that she can call true friends who she can reveal her true feelings too. Largely as a result Juliet’s interaction with Romio, in the beginning, was shown to be rather guarded as if she expected to be betrayed at any moment. However, as the series goes on and their relationship deepened this began to change with Juliet not only learning to trust not just Romio but also many of her dorm mates and in the process discovering that friendships are something that can cross both borders and social classes. A realization that served to make Juliet realize that her determination to hide her true feelings from her friends while serving to protect their image of her also served to make it harder for people to understand and help her achieve her goals. In light of this realization Juliet began to slowly open up more of her heart to others especially to Romio and while still possessing the confident and dignified traits that define her Juliet also begins to show a more joking and teasing side to him while also showing a gentler side to her personality. The character of Juliet I felt was an interesting character whose confident and strong-willed nature contrasted greatly with the surprisingly fragile inner self that she hid from her friends. Her gradual development from someone who had trouble not just with trusting others but also with revealing her true feelings to someone that was able to forge bonds easily with others while being more open with her emotions and feelings I thought was done well and demonstrated the kind of knowledge that she gained from her relationship with Romio. \\n\\n\r\nRomio Inuzuka \\n\\n\r\nRomio Inuzuka portrayed by veteran voice actor Yuuki Ono of Angolmois and Granblue Fantasy fame is one of the main characters of the series and is the main protagonist of the series. A 1st year of student of Dahlia academy and the student leader of the 1st year high school division of the Black Dogs faction Romio on initial appearances can be seen to be an honorable, brave and confident person by nature that rather than rely on strategy and planning is one that prefers to act in the moment. However, while appearing brash to others as a result Romio is also shown to be an intelligent and perceptive person that’s quite capable of determining the perfect moment to strike at their opponents. While appearing to be grumpy, quiet and possessing a grim aura about him that most assume would mean that he prefers to settle things with fists rather than words its perhaps surprising to note that Romio is someone that prefers to avoid conflict. But due in part to his indecisive nature, these attempts to solve situations via such means often fail to amusing results. \\n\\n\r\nAs the series goes on however and more of Romio’s personality is revealed Romio’s personality gradually begins to change. At the beginning of the series Romio while possessing both intelligence and confidence was widely seen as being indecisive and lets his sense of honor get the better of him when trying to create plans that would harm their rivals. However, as the series goes on this begins to change. While still retaining his core qualities Romio gradually comes to realize that his indecisive nature while serving to protect him well from potential failure also served to make his attempts to forge bonds with others a major hurdle and that his attempts to protect others which while serving to show his responsible nature also had the unfortunate effect of creating a mistaken belief that he was pitying them. As a result of these revelations, Romio began to try to actively change his personality. While still retaining the caring and responsible nature that he shows to his friends Romio starts to take great care in trying to understand the core reasons that are behind someone’s behavior and try to take actions that would help them solve the problems that ail them. This is best shown when he treated Juliet with fairness during the sports day tournament as well as in his attempt to help Kochou and Teria solve the reason for their inner sadness and thus showing that in addition to becoming more caring and perceptive Romio also learned through his interactions with Juliet how to be considerate as well. While still appearing brash at times it can be seen that Romio also developed a certain amount of cunning within him and is capable of creating some rather creative plans that can be called upon when pressed into desperate situations which is best shown when he takes advantage of the bond that he forged with Kochou and Teria to aid him in his plan to surprise Juliet. The character of Romio Inuzuka I felt was an interesting one whose initial personality traits of nervousness and indecisiveness contrasted well with his initial image of a grumpy male whose grim aura suggested he preferred to act with his fists rather than words. Romio’s gradual development from a quiet and indecisive person to someone that was not just considerate but also understanding of the true feelings of others as a result of his deepening bond with Juliet I thought was handled well within the series.  \\n\\n\r\nHasuki \\n\\n\r\nHasuki Komai portrayed by veteran seiyuu Ayane Sakura of Charlotte and Psycho Pass fame is one of the main characters of the series and is Romio’s able right hand among the Black Dogs. A 1st year of Dahlia academy and a member of the 1st year high school division of the Black Dogs faction Hasuki on initial appearances can be seen to be a positive, cheerful and caring person by nature that has earned her great fame within the Black Dogs. A proactive, determined and intelligent person by nature Hasuki while remaining cool and level-headed most of the time is also shown to have a rather short fuse within her that can easily get lit if either the Black Dogs or Inuzuka get slandered a sight that is always a sight to see when it happens. Despite her fiery nature Hasuki is shown to have a soft spot for her childhood friend and superior Romio and shows genuine care and affection for him when she can show well the kind of feelings that she has for him. Perhaps more than anyone within the Black Dogs Hasuki can be seen to be the one person that understands Romio the most and this is something that can be seen easily in the interactions that she has with Romio where she demonstrates the ability to easily see through his lies and at the same time being able to see when something is bothering him. \\n\\n\r\nAs the series goes on and Hasuki’s personality is expanded upon it can be seen that Hasuki as a result of her loyalty towards the Black Dogs also has hidden side to her that’s only unleashed when exams take place within the school. This personality that I like to call the director is markedly different to her usual personality as in this form Hasuki is serious, inspirational and has an aura about her that exudes both authority and fear which is helped greatly by the fact that she also dons a teacher like outfit that aids greatly in reinforcing the impression that here she’s a teacher. Rather than treat her fellows with the warmth and care that she’s known for in this form Hasuki is shown to treat them coldly and exhibiting an icy personality that’s akin to a Tsundere. However, while certainly harsh in this form it can be seen that Hasuki is serious about teaching her fellows and ensuring that they all manage to pass the tests successfully. As the series proceeds it can be seen easily that one of Hasuki’s most prominent traits is the loyalty that she has towards her friend and superior Romio a sense of loyalty that ensures that even if everyone dislikes him and views him as an enemy, she will remain by his side to provide him all the support that he needs. This sense of loyalty I felt was interesting as it highlighted very well not just the depth of the feelings that she has for him but also of her desire to repay the debt that she feels that she owes him. However, amusingly enough it can be seen that strong as this bond can be it also has a breaking point as well as shown in Hasuki’s chase of Romio after his confession of his love for Juliet where she amusingly chased him down with a replica sword while adapting a chilling and tenacious personality in the process. The character of Hasuki I felt was an interesting character who within the series functioned well as Romio’s friend and emotional support. In particular while only shown briefly I felt that the contrasting personalities that Hasuki has were interesting as they showed not just how loyal and committed, she was to her dorm mates but also to Romio as well. \\n\\n\r\nWeslia Chartreux \\n\\n\r\nWeslia Chartreux portrayed by veteran seiyuu Yuu Shimamura of Koi to Uso and Owari No Seraph fame is one of the main supporting characters of the series and is a member of the White Cats. A 1st-year student of Dahlia academy and a member of the 1st high school division of the White Cats faction Weslia like Juliet is a member of a noble house and indeed is also the first princess of the Principality of the West.  A childhood friend of Juliet Weslia who prefers to be called by the name Char on initial appearances is seen to be a proud, confident and a somewhat arrogant person by nature that acts somewhat like a typical spoiled princess that’s used to getting what she wants. An intelligent, courteous and cunning person by nature Char while appearing to be a beautiful, cheerful and polite young woman is, in reality, someone that’s the complete opposite. Beneath her cheerful nature Char is shown to be something akin to a trickster for while she often demands strange things from her enemies and allies alike, she also enjoys teasing and pranking them with everything from simple pranks to outright blackmail all to satisfy her desire to seek some kind of fun in the moment. \\n\\n\r\nAs the series goes on however and more of Char's personality is revealed it can be seen that Char's personality while partly an act also functions as a sort of shield that hides her own feelings that she has about her life. On the surface while widely seen as a trickster and also a violent person by many which has earned her the rather unflattering nickname of the violent princess of the west beneath this it can be seen that Char is someone that cares deeply about the well being of her friends and allies with the strong bond that she has with Juliet being the best example of this. To Char, it’s obvious that Juliet is someone that can be seen to be the center of Char's pride and joy and is someone that she views as akin to a treasure. Given this fact it's perhaps unsurprising that Char’s initial view of her relationship with Romio and her impression of him was a poor one a fact that she did not bother sugarcoating for him when she made that clear. However, as Char began to see the types of changes that Juliet’s relationship with Romio caused and also as a result of seeing just how dedicated and serious he was about it this changed not only her opinion regarding the two but also began to change her own personality as well. while still retaining her usual trickster like personality Char gradually starts to change becoming kinder to others and learning to show consideration to others and more willing to admit her own errors of judgment traits that would have been hard to see in the past. Arguably the greatest change within Char’s personality was the realization that not everyone in the world is willing to bend their knees to fulfill her often selfish requests and that maybe its time to change her ways. The character of Char I felt was an interesting one for while on the one hand her love of pranks and jokes provided plenty of comedy moments within the series the character of char also provided to Juliet the first person that can truly be seen as a close friend to her and one that she can eventually confide in when the opportunity presented itself something that I felt was especially important to both Romio and Juliet as their relationship improved. \\n\\n\r\nTeria \\n\\n\r\nTeria Wan portrayed by veteran seiyuu Yui Ogura of Kamisama no Memochou and Vivid Strike fame is one of the main support characters of the series and is one of Romio’s allies within the series. A 14-year-old girl and a second-year student of Dahlia academy’s Black dog’s faction Teria like her twin sister Kochou are members of the academies prefect’s unit. A quiet, timid and somewhat innocent person by nature Teria like Kochou is an expert in a specific field whose expertise in them was what allowed them to skip grades and proceed straight to the second year of high school despite their young age. In Teria’s case, she’s an expert in engineering with a particular focus on machinery.  In contrast to her, more outgoing older sister Teria is someone that can be seen to be calm and composed and true to her expertise in engineering is also seen to be someone that prefers to observe and plan out her moves before committing to them. In a way, it can be said that Teria’s nature also acts well as a foil for her sister’s antics as she is able to keep her focused and on track with their duties as prefects. \\n\\n\r\nSimilar to her sister Teria is shown to be thankful for the fact that their intelligence managed to allow them to get to high school despite their young age. However, unlike her sister Teria is shown to view the position and role of a prefect with some amount of disdain. While Teria is shown to be dutiful towards her role as a prefect and understands the responsibilities that comes from being one it would seem that she is less concerned with handing out the correct punishment and seems to be more lenient with the rules than other prefects. At the same time despite reaching the role of a prefect at such a young age Teria rather than showing any sign of being proud of the role seems to exhibit the opposite in that she seems rather lonely. From looking at the interactions that she has with both Romio and her sister it can inferred that this sense of loneliness is due to the fact that being prefects means that she and her sister are unable to have the normal high school lives that most girls their age would be able to enjoy due to both the fear that their role generates and the time that they have to spend on their duties. This sense of fear continued until an unexpected encounter with an underclassman of hers opened her heart and made her realize the fear that she had been trying so hard to hide from others. In the aftermath of this revelation Teria largely due to this begins to markedly change in personality. While still quiet and shy to a degree Teria starts to gradually take her first steps of entering high school by not just learning to form friendships with others but also learn to form opinions by herself and not take cues from her sister as she would have done in the past. At the same time, she was also willing to take the initiative and stand up for what she believes in which is best shown when she tried to shield Romio from his brother. \\n\\n\r\nKochou \\n\\n\r\nKochou Wan portrayed by veteran seiyuu Rina Hidaka of Sword Art Online and Ryuuou no Oshigoto fame is one of the main support characters of the series and is one of Romio’s allies within the series. A 14-year-old girl and a second-year student of Dahlia academies Black Dog faction Kochou like her younger sister Teria are members of the academy’s prefect unit. Like her sister, Kochou is an expert in a specific field that allowed her to skip grades and become a 2nd year at such a young age. In her case, she’s an expert in pharmacy with particular focus in its use in medicine. From initial appearances, Kochou can be seen to be a mischievous, and cunning person by nature that seems to love teasing others and having fun at their expense. Despite this, it can be seen that Kochou views her role as a prefect with something akin to pride and would easily get angry if someone insults either her or the role of a prefect. Unlike her younger sister, Kochou is shown to someone that’s quick to anger and seems to take offense at people who make fun of her figure or looks down on her due to her age or height. As a result of the pride that she feels towards being a prefect Kochou is noted to approach her role with both determination and tenacity and would try hard to complete her assigned duty until either she completes it or her target escapes showing how driven she can be. \\n\\n\r\nDespite the strong pride that she feels towards the role of being a prefect Kochou can be seen to place a heavy importance on the main role that prefects should be encouraging. While Kochou understands that part of a prefect’s role is to maintain discipline among the students she also believes that prefects should also strive to guide those that have no talent on to the correct path and to protect them when needed. From this, it can be seen that Kochou is of the belief that talent and not age is the factor that’s most important for people a belief that no doubt came from the complex and struggle that comes being looked down by others due to their age and the authority that others feel they don’t deserve. In line with her determination to guide students is Kochou’s rather curious determination to protect the happiness that students can experience in school which is shown well during the festival in which she in conjunction with her sister acted to break up a fight that if left unchecked would have the effect of causing the fireworks display to be canceled. This showed not just how dedicated she is to the role of being a peacekeeper but also how kind she really is as a person something that I really enjoyed seeing with her character. Similar to her sister after their encounter with Romio Kochou’s personality also began to exhibit changes. While still retaining her teasing and mischievous nature Kochou also starts to think somewhat outside of the box and instead of merely following instructions from her superiors starts to think and act on her feelings. This is shown in the times that she and her sister would infiltrate Romio’s room to have fun and also in the care that she shows to Romio in the aftermath of the surveillance order that was given by her superior and thus showing the increased bond of trust that had been formed between them. The character of Kochou I felt was an interesting one whose introduction to the series helped introduce a great amount of comedy into the series thanks to the many interactions that she has with Romio. \\n\\n\\n\r\nAMV \\n\\n\r\nIn terms of animation, I thought that the series animation was really impressive being both sharp and clear. I felt that the academy and the town while being beautiful to look at also featured a great variety of locations that was not just well designed but also showed great variety in terrain types as well. The character designs for the series I felt was pretty well done with the uniforms that the two sides wear doing a great job of not just showing the colors of the two countries that the students represent but also in contrasting and showing the differences that lie between the two sides whether in terms of the nature of the individual students and the different culture in which they come from. This contrast between the two sides I feel is also shown well in the physical appearances of the cast specifically in the hair and eye colors that the students from the two sides exhibit that I felt have a synergy effect with the uniform colors that both sides wear and help reinforce the idea that the rivalry between the two sides is not simply a small scare one but in fact one that carries great weight on a national level.    \\n\\n\r\nMusic wise the series made use of one opening and ending theme which was Love With You that was sung by Fripside and Someday Until The World changes that were performed by Riho Iida both of which I thought were catchy songs that resonated well with the series main theme of a teenage love story. The series OST I felt also did a solid job of providing good support for the various scenes that were in the anime. \\n\\n\r\nIn terms of voice acting, I felt that the series main voice cast all did an excellent job of portraying their assigned characters whether main or support ones. In particular, I feel that Ai Kayano, Yuki Ono, Ayane Sakura, Yuu Shimamura, Yui Ogura and Rina Hidaka deserve special praise as I thought that they all did a fantastic job of portraying the characters of Juliet, Romio, Hasuki, Weslia, Teria and Kochou. In addition, I feel that the series also featured a great supporting cast of characters that did well in enhancing the story by injecting both much-needed tension and hilarity within the series. In this I feel that Tomokazu Sugita who portrayed the character of Chizuru Maru, Daisuke Ono who portrayed the character of Airu Inuzuka, Eri Kitamura who portrayed the character of Somali Longhaired and Hiroshi Kamiya who portrayed the character of Scott Fold all did a fantastic job of playing their respective characters who did much to enhance the overall story. \\n\\n\r\nOverall conclusion \\n\\n\r\nIn overall Kishuku Gakkou no Juliet was an anime that I really enjoyed, and I would say that it’s definitely one of the best animes for this season. Its main strong points, In my opinion, was its unique premise, strong story, well designed and developed characters, sweet and well-designed romance moments between Romio and Juliet and excellent voice acting. \\n\\n\r\nThe overall premise of Kishuku Gakkou no Juliet which is its reimagining of the classic romance tragedy that served as its main inspiration and its replacement of the tragedy element with that of a romantic comedy as well as its replacement of the classic family feud and ancient Italy setting with the tense relations between two factions whose homelands are being subjected to a tense peace treaty that can be undone at the sign of a single spark I thought was definitely one of the series highlights. Having the main setting of the series be a school where students from both of these nations attend to receive their education before moving into society to help advance their nations goals I thought was also rather creative as while it allowed the students from both sides to enter a setting where they will all enter regardless of their origin while at the same time creating an area where their respective feuds would not just be out of place but also serve as a perfect opportunity to allow the concept of forbidden love to manifest. All of these elements I thought really synergized well with each other to truly make a premise that was unique to this series. \\n\\n\r\nThe overall story of the series I felt made great use of this premise as while it did well in showing the kind and depth of the rivalries that can exist between the two countries and their subordinate factions It also did well in introducing the two main leads of the series in the form of the student leader of the White Cats and the Black Dogs who in this case was Juliet Persia and Romio Inuzuka. The forbidden romance between the two that served as the crux of the story I thought made great use of the rivalry between their two respective factions as a backdrop as it showed not only their determination to both stay loyal to their respective countries but also did well to show the inner struggles that both have in relation to them as well. Seeing the two of them try to both overcome the ingrained animosity that exists between the two sides and try to break out of their shells as they try to both make the romance between them work and learn about their respective struggles and wishes in the process was something that I really enjoyed seeing. This struggle to both change and at the same time make their romance work within the series was shown well in the many sweet romantic moments that were shown in the series that showed the kind of effort that both were trying to make in an effort to not just change the world but also their lives as well. These cute moments I felt were also used well in conjunction with the school events that were featured within the series such as the sports day event as while the former did well in showing the advancement in the romance between the two the latter allowed us to see the kind of determination that exists in them in their desire to help each other overcome the struggles that they are wrestling with in their own way while providing us with some background amusement in the form of the antics that both perform during the latter event. \\n\\n\r\nOverall Kishuku Gakkou no Juliet was an anime that I really enjoyed watching and I felt that it handled its use of both the core romance story and the many themes that it introduced into the story and premise relatively well to create a pretty fresh take on the classic tale of Romio and Juliet. It's balancing of comedy moments with the romance and the character development of both the main and support cast was something that I especially enjoyed seeing as well. In terms of the final score, I would say that it easily deserves a final score of 10/10. \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2018-12-21T09:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 296383,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=296383"
        },
        {
            "content": "Classic Tragic Love Story Made by Shakespeare is the plot\r\nHowever the anime progress in a modern high school style impact with addition of comedy is really entertaining seeing how really hard is it to be fall in love with someone you cant actually date that someone in a different border and where borders meet and cant do anything about it\r\nI enjoyed this anime very much and willing to see a second season after all the anime ended the classic story of Shakespeare and pointed to a new direction in season 2 im looking forward on how original they can be after copying shakespeare (not sarcasm)but im interested how they progress\\n\\n\r\nThe anime has side character development thru out the anime and is entertaining to watch in addition of hilarious jokes and amazing animation of the anime it focuses on just the development of the characters and slightly explain things about the school the two MCs relationship is cheesy and hilarious to watch but its fun to watch them progress as a couple and how they still manages to be with one other even tho its not allowed\\n\\n\r\nIm willing to recommend this if you like comedy and/or romance",
            "date": "2019-04-28T02:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 307305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8007507.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/-Elina-",
                "username": "-Elina-"
            },
            "url": "https://myanimelist.net/reviews.php?id=307305"
        },
        {
            "content": "If you're a long-time anime fan, you surely remember those 2000's romance anime full of ecchi, stupid jokes and a incredible strong love. Kishuku Gakkou no Juliet is just like that. \r\nNostalgic because of its resemblance with the anime we watched during our younger days, Kishuku Gakkou no Juliet may be seen as something good, or at least tolerable to watch, when it's not. \r\nSure, maybe the relationship between the two main characters is cute and all that, but it's not worth the watch when everything else (other characters, plot, setting) is plainly mediocre. \r\nThe opening deceives (It deceived me) and make you think thisis an actual good anime, but it's not. I guess some episodes are fun, but overall it's pretty weak.",
            "date": "2019-02-18T13:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 301943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1698497.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MaahHeim",
                "username": "MaahHeim"
            },
            "url": "https://myanimelist.net/reviews.php?id=301943"
        },
        {
            "content": "TL;DR Review\r\nKishuku Gakkou no Juliet took a plot that sounds bad and actually made it interesting. At first, I said to myself, \"well its just gonna be average at best\" but oh boy was I wrong. The comedy is somewhat funny and most of the jokes are pretty good. I love the fact that Romeo and Juliet tried their everything to make it a love story; yet hiding it from all their friends, dorm mates, and most importantly, their prefects. Overall, I say this was pretty interesting and definitely worth giving it a shot. However, if you aren't into anime like this, no hard feelings.\r\n-Spacecraft555 UwU",
            "date": "2019-01-28T13:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 300266,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7705689.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/spacecraft555",
                "username": "spacecraft555"
            },
            "url": "https://myanimelist.net/reviews.php?id=300266"
        },
        {
            "content": "First and foremost, the Shakespeare element in this series is limited to to two people named Romeo and Juliet dating despite being leaders of rival factions. Even in that description there's divergence from the original play. So if you're looking for a retelling of the bard's tale (which he ripped off of a poem that was ripping off a Greek myth) know that you're not really getting that at all. There is maybe three characters that actually parallel the play. The way the romance evolves is completely different. Considering the selling point of this anime was Romeo and Juliet in an anime, know that isnot really what you're getting at all. \\n\\n\r\nStill blowing the hook, doesn't make a bad anime. But does make it more of an uphill battle.  Luckily the two leads are really adorable, which makes any romance anime work. They do put some effort into characterizing the folks around them as well, which is great. Other than the feud itself, everything in this anime makes sense, and there is a nice moment between our two leads every episode. \\n\\n\r\nUnfortunately, the way they play the rival factions in this anime often makes the road to those sweet moments between the leads rather ridiculous. I get they're playing it for laughs and all, but it starts feeling very inorganic very quickly. \\n\\n\r\nAnother thing that was rather off putting for me was just how much fan service is in this anime. I don't mind fan service if it fits the tone of the show, or is not overabundant. But this is a cute romance show where three quarters of the episodes have panty shots, scenes in the girls locker room, shower scenes, you get the point. If it was scaled back, no problem, but it was just a bit much for what we're watching considering none of the rest of the show has that kind of tone. \\n\\n\r\nFor most anime seasons, I'd say this show is fine for those who want to scratch their romance anime itch. But in a season that has Bloom into You, and Bunnygirl Senpai, there are FAR superior options for you right now. Still, the leads are cute together, and there are some pretty funny moments and some really sweet moments in this show. It's worth a watch, just don't expect it to be amazing.",
            "date": "2019-01-02T06:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 297801,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yosarian",
                "username": "Yosarian"
            },
            "url": "https://myanimelist.net/reviews.php?id=297801"
        },
        {
            "content": "It would be best to not even think of this as a retelling of Romeo and Juliet.  Yes, that's the name of the main characters, but other than that, and the pretext of the warring factions, the similarities pretty much end there.  This is only very loosely based on the Shakespearean classic and would really be more of a representation of two groups not being able to get along like cats and dogs.  \r\nIt would also be best not to go into this anime thinking it's main draw is to deliver romance.  This is more a \"Com-Rom\" than a \"Rom-Com\".Comedy is the main driver here and this anime never really tries to take itself or the subject matter its based upon seriously.  There are far more moments where you will burst out laughing uncontrollably, than you will watch with a tear in your eye from romantic sweet moments.  And even in those moments of romance, they always end with some kind of joke.  \\n\\n\r\nIn truth, the Romance in the anime is really rather shallow.  But, it avoids being cliche because unlike most rom-com animes this one presents a world where no one wants to see the main characters together.  That provides the intrigue for the romance aspect of the anime, not the romance itself.  You watch this wondering if they will get caught and what will happen to them, and that provides the drama, not the relationship with Juliet and Romio. \\n\\n\r\nAs far as the comedic aspect of the anime, it relies heavily on gags, comedic lines and quirky characters to power itself.  And, boy, does it work. I would put this anime on par with Hinamatsuri in terms of the level of comedy, and that is high praise.  The jokes rely heavily on slapstick humor, but it also has some witty lines as well.  There were times I was in near tears at the events on the screen.  (Two Words: IRON CLAW!) \\n\\n\r\nWhen it got time to get serious towards the conclusion of the anime, it didn't falter and that's what's important, because the ending is where so many comedies fall into mediocrity, because they fail to finish strong, because they can't handle the dramatic climax.  This anime did it well.  It wasn't exactly as well done as say the Zero Requiem, but it was a solid dramatic finish and left me wanting to see a second season.  \\n\\n\r\nLastly, the cast was very likable as well.  But, no character really broke the mold.  The cast was similar to every other rom-com.  The MC guy who chases the affection of the MC girl (Romio & Juliet), the MC guy's childhood friend (Hasuki), the MC girl's childhood friend (Char), and then some tertiary characters to round out the group and provide some comic relief. (Maru & Scott).  I liked these characters, but they weren't groundbreaking.   \\n\\n\r\nOverall, this anime was superbly hilarious.  There's really not much to find wrong with it, unless you're expecting a serious and dramatic adaptation of Romeo & Juliet.  Then, you'll probably not like it so much.  Go into this expecting to laugh, not cry and you'll enjoy it.  \\n\\n\r\nStory: 8\\n\r\nArt: 8\\n\r\nSound: 6\\n\r\nCharacter: 8\\n\r\nEnjoyment: 10\\n\r\nOverall: 9     \\n\\n",
            "date": "2018-12-28T00:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 297136,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=297136"
        },
        {
            "content": "Honestly Boarding School Juliet is an enjoyable anime. It's not revolutionary or anything like that, but it's doesn't need to be. The story itself is an 8. It's definitely better than most cheap school anime that come out every season. It has some comedic moments with enough humour to make you chuckle. However like several other romance originals, the ending of the show is slightly rushed. The art is also above average, although sometimes the art stops the show from having great comedic effects. I'd give the art a 7. Okay, now the sound. The opening itself is very mediocre. It's exactly what you'd expectfrom an anime like this. The ending is slightly better. The actual soundtrack (like the BGM) is where this show shines in terms of sound. The soundtrack has some solid pieces which really helps certain moments in the show come to life. I'd give the sound a 9. The characters can be entertaining sometimes, but aren't exactly original. I'd give them an 8. The show is very enjoyable and I'd give it a 9 in terms of enjoyment/entertainment. Overall, I'd give Kishuku Gakkou no Juliet an 8/10. I'd definitely recommend it if you're looking for a light hearted show to watch after watching something intense.",
            "date": "2018-12-22T21:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 296568,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5974702.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Avatar1234321",
                "username": "Avatar1234321"
            },
            "url": "https://myanimelist.net/reviews.php?id=296568"
        },
        {
            "content": "Have you ever wondered what Romeo and Juliet would look like if it was set in high school? No? Me neither to be honest, but this series sets out to show exactly that in the form of a romantic comedy.\r\nStory 7/10\r\nThe show centres around Romio Inuzuka who has fallen for Julliet Persia, a forbidden romance based on the fact that they stem from rival factions. After the two of them enter into a relationship they have to do their best to keep it hidden from their dorms. The risk of discovery is what drives the plot forward and the story often boils down to themgoing through hoops to meet in secret or misleading others to meet in public. The series doesn’t really bring anything new to the genre, but is written well enough to keep entertaining. The show is fairly light on drama, but has a lot of comedy-centred scenes, most of which hit the mark.\\n\\n\r\nArt 6/10\\n\r\nIn the art department the show looks pretty average, there are some scenes that are animated a bit better than the rest, but there are also scenes with worse animation. The character design on the other hand isn’t anything special per se, but all the characters look pretty great and their appearance showcases their personalities in a lot of cases.\\n\\n\r\nSound 7/10\\n\r\nJust like the animation the sound design is pretty average. Nothing really stands out, for better or worse. The music doesn’t intrude on the scenes, the sound effects don’t subtract from the experience and the voice actors do a good job delivering their lines.\\n\\n\r\nCharacter 7/10\\n\r\nAll the characters in the show are likeable in their own way, but the majority of them are relegated to the sidelines and mostly seem to serve as a device to drive the plot forward. Character development is pretty much non-existent with a few exceptions. The main cast doesn’t exist of one-dimensional characters which especially shows in the central relationship.\\n\\n\r\nEnjoyment 7/10\\n\r\nAll in all I enjoyed watching the show, it doesn’t try to reinvent the wheel, but it doesn’t have to. What it does it does well and it doesn’t overstay its welcome while doing so.\\n\\n\r\nOverall 7/10\\n",
            "date": "2018-12-22T12:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 296529,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7485893.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Thedarkaxe",
                "username": "Thedarkaxe"
            },
            "url": "https://myanimelist.net/reviews.php?id=296529"
        },
        {
            "content": "Boarding School Juliet is a show I desperately wanted to like more than I did. From a conceptual level, it has so many elements that are right up my alley. A rom-com where the main couple gets together at the start and follows their developing relationship! A take on Shakespeare that remixes his classic characters in fun new ways! Swordfights! Dates! Wacky sidekicks! Performances from a rogue’s gallery of my favorite voice actors! There’s so much to this story that could have- and should have- worked. Sadly, the end product just never comes together in any satisfying way, leading to a show that more oftenthan not just passed through my system without eliciting a single reaction from me.\\n\\n\r\nFirst, the set-up: as the title suggests, this is a very (very, very, very) loose re-imagining of Romeo and Juliet that transplants the warring noble houses of Verona to a boarding school, in which they take the forms of two rival gangs from eastern and western nations. The Black Dogs of the east are led by Romoi Inuzika, a brash hothead with a secret crush on the leader of the western White Cats: Juliet Persia, a determined young woman fighting to become stronger than the prejudices and hatred between the two opposing forces. A midnight duel leads them to the realization that they’re both sick of their nation’s feud, and that their feelings for each other might be realer than both of them initially realized. So they decide to start going out in secret, all while working from within to start changing their world for the better. In classic Shakespeare fashion, there are mistaken identities, close escapes, big emotional outbursts, overly complicated schemes, and a colorful cast of supporting characters weaving an absurdly complicated net of secondary romantic subplots.\\n\\n\r\nAnd I just wish it all was more interesting than I’m making it sound.\\n\\n\r\nThe problem, really, is a very common problem that a lot of lesser-tier anime runs into: losing the plot. Once the setup is out of the way and our central couple is together, it doesn’t take long for the enticing premise of a power couple working to change a broken system while undergoing emotional development to fall by the wayside in favor of the blandest, most generic anime rom-com scenarios imaginable. It feels like the story doesn’t have enough confidence in itself to commit to the bolder, more original elements of its premise, so it just settles back to copy everything it’s seen in better anime. The sports festivals, the secret dates gone wrong, the making lunch for your hubby, the romantic rivals, and none of it is fresh or well-executed enough to keep interest until the show finally remembers it’s supposed to have a plot in the final handful of episodes, and even then it never rises above anything higher than passable. Romio and Juliet themselves are both likable enough, but their bolder edges hinted at in the first episode- Juliet’s bullheaded confidence, Romio’s passionate sense of honor- get dropped fairly quickly in favor of blushing moe girl and awkward pretty boy. There’s just no character to any of these characters, and the production isn’t strong enough to be enjoyable just on a pure spectacle level.\\n\\n\r\nWhich is a shame, because there are good elements in this bland paste of a show. Again, I like that the main couple gets together at the start, and the show is nominally about exploring their developing relationship above all else. I like that none of the romantic rivals to either of them is ever treated as having any possibility of actually breaking them up, keeping the focus on their emotions above all else. And like I said, there are a metric buttload of my favorite seiyuus in here all doing their best to add character to the cardboard cutouts they’re voicing. Ayane Sakura of BNHA fame adds a surprising poignancy to Romio’s childhood friend, Hiroshi Kamiya is having an utter ball as Juliet’s foppish retainer, Juliet herself is admirably carried by Ai Kayano, Tomokazu Sugita shows a surprising restraint as a Black Dog thug, and Daisuke Ono lends his chilling monotone to Romio’s domineering older brother. I like all these performers, and they’re clearing having a lot of fun playing with such broad archetypes. There’s just nothing in the script to let them be anything more.\\n\\n\r\nIn the end, Boarding School Juliet is far from a disaster, but it’s also not a show I would recommend to anyone. It’s not especially impressive from an animation standpoint, the characters are nothing you won’t get better from a million other shows, the romance is harmless but forgettable, and I’m certain I’ll forget the entire plot in about a week. Shakespeare deserves to be bigger, braver, and better than this.",
            "date": "2018-12-21T11:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 296393,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6826914.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AnimeBW",
                "username": "AnimeBW"
            },
            "url": "https://myanimelist.net/reviews.php?id=296393"
        },
        {
            "content": "Rom-com anime is usually among my least favorite genres in anime. That being said, Boarding School Juliet is a Rom-com anime that I found my self enjoying. The story involves a romance between a boy and a girl from opposing factions. They both have to hide the fact that they are in love from everyone in order to proceed in their current aspirations. I feel like most Rom-com I see are too silly or annoying in the main romance. With this one, it has a lot of comedy but the main romance is actually quite heartfelt and I felt myself invested in their relationship.\r\nThey actuallyhave a nice chemistry and their romance is filled with sweet moments and minimal tropes that annoy me in the romance genre. I sometime have a hard time finding romances where both characters are likable and compelling, Persia and Inuzuka were each good characters on their own and together they make for a nice couple.\\n\\n\r\nThe bigger shocker for me is that I also found this anime very funny. Now if a romance anime is hard for me to find one I enjoy, I'd say a comedy is even harder for me to find something I enjoy (hence, rom-com is one of my least favorite). But this anime has a lot of funny moments. From our main characters cute chemistry, to our side characters antics, this anime had a handful of moments that made me chuckle. I'm not sure why this one worked for me while most don't, but it just did. For those who have seen the show, Scott Fold (aka blonde dude with glasses) was the my favorite character in terms of funny moments.\\n\\n\r\nBoarding School Juliet is 12 episodes long and was such an enjoyable watch that I kept wanting to see the next episode right after the other. It's not without a couple annoying characters, but overall it was good. It ends on a nice note, leaving you to decide if you feel content or if you wish to continue the story with the manga. Even if you do not continue with the manga, the anime gives you a satisfying story.",
            "date": "2019-03-20T19:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 303941,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3961601.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JCopZoro",
                "username": "JCopZoro"
            },
            "url": "https://myanimelist.net/reviews.php?id=303941"
        },
        {
            "content": "When i first started to watch this anime, i was not really impressed by the cover art of it. I thought to myself that its going to be another generic romcom anime just like the other similar titles that are released in the market nowadays. However i was so wrong after i finished watching the 1st episode and this is where my review of Kishuku Gakkou no Juliet (Juliet's Boarding School) comes in. \r\nStory : 7/10\r\nJust like the title of the anime implies,the plot takes place in a prestigious boarding school where 2 student factions called the Black Dogs and the White Cats from rivalingcountries are frequently enganging in a war among each other since they were in elemantary school. the main protagonist, Romio Inuzuka being the leader of the dorms' first-years, wishes for a romance with Juliet Persia,also the 1st year's leader of her division that can never be achieved easily which what caused him to vow himself to change the world and obtain peace between these two factions someday. It has a mixture of slice of life and shounen genre but the story itself is nothing spetacular and that \"changing the world\" cliche theme can be found in most shounen anime. Now im not going to spoil the plot because it is something that you must watch yourself to gain a better understanding of it but nonetheless, i actually enjoyed it from begining to end. \\n\\n\r\nArt : 9/10\\n\\n\r\nI absolutely love how the developers implement the graphical animations in this anime from the character's elegant movements to the bright and colourful splash of paint on the characters. and speaking of design, they had done a splendid job on the character's facial expressions. all of the female characters are cute and gorgeous and this can be said the same to the badass design male characters as well. You may also realised that the artstyle may share some similarities with certain shoune anime considering that it also has a mixture of shounen style as well. overall, one of the best graphical anime of the season for sure. \\n\\n\r\nSound : 9/10\\n\\n\r\nMusic has always being the key factor in order to make any scenes whether its from video games or movies to be more epic and enganging. and Juliet's Boarding School's soundtrack is no exception. the osts that they used in the anime are probably some of the best ive listened to so far in any romcom anime. every single one of the soundtracks suits really well with the action scenes and the drama that occur between the characters. Not to mention the OP and ED are great as well maybe not to my taste but still good nonetheless. \\n\\n\r\nCharacter : 8/10\\n\\n\r\nThroughout the episodes, the story mainly focuses on the relationship between the main protagonist,Romio Inuzuka and the heroine, Juliet Persia. to be honest, i really dont like romio that much because on how childish and inmature he can be most of the times. he is supposed to be the leader of his group but due to his relationship with persia, he often forgets about his responsibilities and also becomes too clingy with persia. and speaking of which,Juliet is what the enbodiment of a heroine should be. strong,has a sense of justice, and a high motivation to solve all of the problems that her comrades are facing and most importantly,her kindness towards her friends especially to romio. Other side characters have their own fair share of uniqueness as well. Chartreux being persia's childhood friend is your \"ara ara girl with a sexy voice\" character. Hasuki,also a childhood friend of Romio is probably the best character in the anime due to her strong will to always keep moving forward no matter what obstacles that she is facing( you will know what i mean if you watch the anime). Overall,almost every one of characters main or support have their fleshed out characterization that makes the story much more interesting to go through. \\n\\n\r\nEnjoyment : 9/10\\n\\n\r\nI was quite suprised that not a lot of people are talking about the show when it was first came out. what makes it different from the other similar titles is how it tries to break the norms of those cliche and generic drama theme that you always encounter in most shows nowadays. its nice and refreshing to see distinctive things from the show. While some people may consider it as an average romcom anime but for those who had watched it will realise how interesting this anime is. \\n\\n\r\nI will rate it an 8/10. \\n",
            "date": "2019-03-15T09:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 303574,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949553.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LurimaLasiaf25",
                "username": "LurimaLasiaf25"
            },
            "url": "https://myanimelist.net/reviews.php?id=303574"
        },
        {
            "content": "The classic story of Romeo and Juliet, modernized into a high school setting just as you would expect out of Japan... except a bit less serious and [spoilers: not ending in them both dying horribly]. This time around, it isn't so tragic and is actually quite funny, while still having some feels and making you attached to the main characters. I'll try to keep the review relatively short, but I'll end up writing a lot like I always end up doing. So. I'll put a TL;DR at the end that sums up my thoughts. \r\nThis story follows the two main characters, Inuzuka Romio and PersiaJuliet. Here in a high school setting, both characters are leaders of their own groups (? I'm not sure what they're specifically referred to as) called the Black Doggies, and White Cats respectively. In this school, the two groups, made up by the entire student population split between them, are constantly at a \"war\" trying to show superiority and that they are each the better clan. While not thoroughly explained in the show, it is mentioned how each group has their own views and ideals of the world, hence why they clash (just like politics!). \\n\\n\r\nAnyways, as you would expect, the two groups hate each others' guts, but not in a battle to the death kind of way. This is shown throughout the story with quite funny and entertaining interactions between a lot of the opposing clan members, mainly our main character Inuzuka and anyone else in the White Cats. But as you can expect, there are also some serious parts to it as there are higher ups to the two parties, Inuzuka and Persia being the leaders of only the first years in school. Because of these higher ups, there are very strict rules enforced that can lead to some serious parts and an overlooming threat, which I personally liked. It gives the show something to progress with, even of only by a tiny bit. \\n\\n\r\nI absolutely loved the interactions between the characters, and this is what personally gave the show most of it's enjoyment. Inuzuka is not the typical \"badass, never emotional\" male lead, and is extremely soft/girly when it comes to Persia which makes for lots of comedic moments. Even the side characters interactions are all very funny, giving it a lighthearted feel to sit back and watch without too much worry of something horrible happening (even though it does get some serious moments). \\n\\n\r\nThe art is really good and I didn't see too many issues with the animation, if any at all. All the girls are cute, so bonus points to that :D (Char best girl). The story flowed pretty normally, and for the most part didn't seem rushed until the end like you would expect from most 12 episode/1 cour animes. But I don't fault them for it, it didn't feel super off or anything out of place, and wraps the show up nicely (but don't expect a conclusive ending of course!) \\n\\n\r\nThe show definitely has a couple flaws, one of my biggest gripes being Persia's character portrayed as a bit... bland. She is super cute and everything, but she didn't seem to stand out as someone extremely interesting. We get a little backstory to her throughout, her main motives and the like, but nothing too crazy. Just average, which is perfectly okay; my point is to not expect much else from the average main girl in an anime. Inuzuka is a fantastic MC in my opinion however, and helps carry their relationship very much so.\\n\\n\r\nEven though I mentioned Persia being a bit bland, she is still a lovable/entertaining character along with the rest of the cast in my opinion. Basically everyone gets humorous moments, a little bit of development for our main two along with a couple of other side girls, and makes for nice progression from start to finish.\\n\\n\r\nAs for the story, it isn't anything to write home about. I do really enjoy the high school setting, especially broken up between the two different clans constantly butting heads. It leads for a lot of interesting moments and interactions between characters of the same party, as well as opposing ones. With that being said however, there is no sort of revolutionary moment or turning point in the show, and doesn't really make much progression in any aspects besides the romance.\\n\\n\r\nTL;DR: The show is very entertaining, but maybe not for the reasons you would expect. It isn't some dramatic, action packed romance of lovers who are separated because of the clans they grew up in. While it does have a bit of drama, action, and a good amount of romance, it also is blended with a lot of comedy and more lighthearted situations. That's why overall I'll give it an 8; I definitely had a few minor complaints with the story and some characters, but it was thoroughly entertaining regardless of those few issues. I didn't rate it higher because it wasn't anything outstanding, but was still enjoyable for what it presented. If you're looking for a romance anime that is a good comedy with some serious moments, then I'd say give it a shot. It's only 12 episodes, and I found myself excited to watch the next episode from start to finish.\\n\\n\r\n[This is my first review in a very, very long time so.. I hope I didn't blabber on too much. I feel like I may have strayed at times a little bit, but overall got my thoughts written down. Hopefully it helped you make a decision!]\\n",
            "date": "2019-01-11T14:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 298751,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3742865.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ikuaya",
                "username": "Ikuaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=298751"
        },
        {
            "content": "-The story of the forbidden love of Romeo and Juliet has been told throughout the ages for generations, and in this anime have similar things as: forbidden love, and two rivals from both countries and college, only in the part of countries that is similar the history of Romeo and Juliet.\r\nI really enjoyed this anime, several scenes of affection and care of Inuzuka and Persia struggling to be together even though they have an image to watch over, they always find a way to be close to each other and do their best to please each other.\r\n-It was very good that the anime in thefirst episode already happens the beginning of the courtship of the two, leaving aside those coiled episodes that have in some animes, which makes you hopeful for the couple to be together as soon as possible, and in this no longer in the starts the relationship, and this is one of the highest points of the anime that after this from the beginning to the end captivates and satiate the desire that the anime watch.\\n\\n\r\n- I highly recommend it.",
            "date": "2019-01-05T16:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 298169,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5007984.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KeigoLD",
                "username": "KeigoLD"
            },
            "url": "https://myanimelist.net/reviews.php?id=298169"
        },
        {
            "content": "Pros: \r\n- Art style and character designs are very well done\r\n- Comedy works quite well\r\n- Does a good job at creating a new spin on a familiar concept\r\n- Quite entertaining\r\nCons:\r\n- Loses steam in the middle\r\n- Some side characters feel like filler, generic, harem, characters that could've been more interesting\r\n- Without giving anything away, the ending relies heavily on the promise of a second season (a particularly bad move in anime.) \r\nOverall:\r\nAs far as colorful, mindless, fun goes, this gets the job done.  I found this to be a particularly entertaining re-imagining of the classic Shakespeare play (or rather the premise of the Shakespeare playas outside of that there is virtually nothing similar between the two plot-wise).  While it felt a bit stale midway in, I'm still glad I stuck with it throughout this season.  I hope a second season comes, and if not, I'll be sure to check out the manga.",
            "date": "2018-12-24T17:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 296745,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7105271.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OahuOtaku",
                "username": "OahuOtaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=296745"
        },
        {
            "content": "a light romantic COMEDY anime , perfect for enjoying your anime night when you don’t have anything particular to watch ..\r\nthe story is the usual or a cliché which isn’t memorable or catchy but how the anime is portrayed through good animation and hilarious moments make it all up for the story .. it’s like most of the comedy oriented animes , nothing out of the usual but it’s really enjoyable .. you’ll get a good laugh and love watching the MC interacting with his surroundings .. he’s cute clumsy brave and strong , and the main female isn’t you whiny helpless girl , she’sSUPER cute though !!!\\n\\n\r\nthe characters were rich and few of them didn’t get more screen time , you’ll absoluty love them \\n\\n\r\nthe story had the potential to be your deep dark romance if they gave detailes about the MCs families background and their hardships but they just showed a glimpse of their past and jumped back to the comedy ( it’s a bonus if you’re watching the show to clear your mind and enjoy cute girls and settings ) \\n\\n\r\nand like most of the romance animes , the ending didn’t have a serious impact on the viewes or the story , it just feels like any other episode in that anime \\n\\n\r\n9/10 overall enjoyment \\n\\n",
            "date": "2018-12-23T14:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 296643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5826096.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dr-anime",
                "username": "Dr-anime"
            },
            "url": "https://myanimelist.net/reviews.php?id=296643"
        },
        {
            "content": "Kishuku Gakkou No Juliet known in English as Boarding School Juliet is basically a modern day Romeo and Juliet but instead of families it's countries (Well atleast I think, they never really touched up on the subject and explained). If you're looking for a good romantic comedy where you'll find the characters enjoyable then look no further! (SPOILERS AHEAD)\r\nNow.. Coming into this I understand very well it was a Romeo and Juliet type story and considering it started as a cutesy type kinda anime I knew that there was not going to be a suicide at the end. The story starts off strong and showsus that there are these two school groups at war and battle it out frequently, but then the main character Inuzuka seems to be in love with the female main character. It goes on and then it comes to the confession kind of area... and it was kinda stupid. The confession felt so rushed at first, like boom he's confessed to her randomly and for some reason she accepts? Like two minutes ago you wanted to kill the kid now you're in love with him. Things go by and the obvious hiding their romance from people is developed into the story whilst almost everyone finds out some how it ends on a lovey dovey happy note. \\n\\n\r\nThe Art is very well done apart from those god damn eyebrows on the female characters... Looks like they got caterpillars stuck on there. I really like the way the anime felt and it had a very cute type of vibe to it and I completely understand why it's based as a Shounen anime with the action it which was really well done aswell.\\n\\n\r\nThe sound I don't really pay much attention to due to not really caring as long as it sounds fine. Nothing really exploded into my mind and left an imprint but it was never bad at any point either.\\n\\n\r\nWhen it comes to the characters I don't think there was anything necessarily wrong with anyone of them. I think that everyone felt right in the story and that everyone had a purpose for being there. I did hate a little of the characters doings but that was personal opinion and others might find it differently.\\n\\n\r\nOverall I really enjoyed the series and I think I'm going to look at the manga and see if there's anything developed there. I hope everyone enjoyed if as much or even as more that me!",
            "date": "2018-12-22T01:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 296477,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7073275.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RainbowSlowmo",
                "username": "RainbowSlowmo"
            },
            "url": "https://myanimelist.net/reviews.php?id=296477"
        },
        {
            "content": "I remembered back in literature class of '14, I was tasked to read a book to learn about the historical context and linguistics of Shakespeare's time. That book was Romeo and Juliet. That fuelled my passion to what it is today. My passion of romance and drama. This anime serves as a modern take on the classic masterpiece. Let's find out if it still holds strong to my high standards and ultimately, your time.\r\nIn the first few episodes, I would honestly tell you that it wasn't particularly amazing. Sure it had certain elements of romance and teasing and subtle nuance about the fear of beingcaught. I was rather impressed with some of method it used to start out this relationship, such as a swordfight rather than a plain confession. There were also some correct verses used such as \"I want to change the world\" which may seem cliché but was impactful at the point of time. It wasn't as impressionable as I felt a bit more backstory as to how this love for Juliet actually happened could have made it more vivid. I would also like to know the thought process behind Juliet's choice to work with her \"enemy\" rather than just \"changing the world\" knowing how risky it is. Lastly, there was not a very good picture painted of how this tension between two country looked like aside from mere gang fights. \\n\\n\r\nWhat made me impressed however was the middle half. They started exploring the impacts of their relationship as more and more people start to realize their romance. This form of analysis was integral to keep the story flowing and not be stuck in a slice of life loop. For instance the introduction of the various characters that led to some level of jealousy and even sadness when they had to be rejected. This was further extended when the people who got rejected chose to not only move on, but even support in this risky behaviour, while still maintaining some cold hard feelings which I felt were realistic. There was also elements of self awareness, such as the \"brats\" who realized Romio's half-assed decisions that led to various unfavourable results. This was somewhat integral into keeping some side characters more proactive rather than just a prop. \\n\\n\r\nBut taking the cake today is the very last few episodes. The anime showed further analysis into when even the student council realized such suspicion. They tied up the anime into a deadlock when they started giving trouble to the main characters. The reaction was rather intuitive as there was a façade involved but still having a rather rebellious action. Some form of analysis on the student council could have been done to further explore things like the sibling deadlock however I felt it didn't hinder on the experience when it reached its peak. The ending was well done as the struggles of each character was flashed out appropriately with frustrations of being apart and almost nearly calling off the relationship due to physical threats,  the impact was delivered in a action punched manner. It showed levels of trust and emotion to pull off a risky behaviour to proof their innocence. The impact was expanded upon when the couple decide to take another step forward in their relationship.\\n\\n\r\nWhat I wished could have been explored for a higher score was how society treats women. There were hints of how Juliet was being \"oppressed\" like savings would only go to men but it never struck to me as something of a big deal in this anime, especially with how \"gender neutral\" it looked and could have been further expanded upon to give a picture of how it's like to be a woman and why change was needed. \\n\\n\r\nAt the end of the day, while it fell short on some of the basics like a good backstory and could have elaborated on the bigger impacts of their relationship rather than saying \"Change the world\" or \"Will create war\", I felt the romance development was well analysed and how the romance changed their behaviour was thought of. I thought Romio was a cliché brat until I learned about his softer side as he matured. And this form of analysis I feel today, was what it needed to make a good romance anime. Well done.\\n\\n\r\nSome reviewer's notes:\\n\\n\r\n- Sound was good, appropriate voice actors, large sound\\n\r\n- Artwork was decent, though detail gets significantly lost in action scenes\\n\r\n- Relatively smooth action\\n\r\n- Really fun to watch, good mix of light hearted comedy and dark moments",
            "date": "2018-12-22T00:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 296469,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5050639.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/UltimateKud",
                "username": "UltimateKud"
            },
            "url": "https://myanimelist.net/reviews.php?id=296469"
        },
        {
            "content": "Since this show is still airing, I can't speak to it in its entirety, but I did watch 6 episodes, and that was enough for me. This show has good artwork and some hilarious one-liners. Beyond that, there's not much to be found here. The characters as just cookie-cutter stereotypes with no real motivations or thought processes. The setting is a school which is divided in two based on which main character each person is affiliated with. The plot is just a bunch of random events, such as a sports festival, where the characters are somehow thrown into conflict, where they obediently stay, using whateverexcuse necessary to avoid actually solving the problem at hand until the appointed time. In short, it's just lazy writing with a few good jokes thrown in on occasion.",
            "date": "2018-12-08T00:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 295423,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2656307.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/BlackEyedGhost",
                "username": "BlackEyedGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=295423"
        },
        {
            "content": "Review of a young and Naive child:\r\nAlong with many other popular manga series getting adapted this season, Kishuku Gakkou no Juliet was yet anther anime that came with a promising outlook. In the season of more promising anime however, this ended up getting shadowed.\r\nBut make no mistake, what this anime offers is much more than your typical shonen anime with execution mistakes. \r\nKishuku Gakkou no Juliet stars with two main characters, typical of most shonen anime, namely Romio and Juliet. You'll either love the main characters or you'll find them 'cliché' at worst. Unlike most anime of the same genre, both our characters here(yes both,gender equality bruh) have a personality. They don't fall in love for the sake of falling in love. They have a goal which leads them to each other. Similar to the orginal version of Romeo and Juliet, Inuzuka and Persia struggle against the chains of an already built society hoping for a change. Other than the main characters, the supporting characters such as Hasui, Weslia and Maru are much influential to the storyline and not just there for the sake of being there.\\n\r\nArt is another thing well executed in the anime. I'd say after SAO(cause unlimited budget works), this was the most beautifully illustrated anime this season.\\n\r\nAnother aspect of the show that most reviewers use to criticize the show is its uses of 'cliché' moments. Now now, don't be angry and listen to me carefully gentlemen. When a concept is further developed into something mainstream, its destined to be overused at some point. No point arguing about that as things that looked new some few years ago are like \"Oh, this again\" nowadays .\\n\r\nI'd say if you enjoyed the original version of Romeo and Juliet by WS, then you'll probably like this anime as well, cause the viewpoint and objective of both stories are the same, the difference only being that one came earlier than the other. If you are wondering what to watch then give this underrated work a try and if you end up not liking it, dropping it is also an option. Don't let what others say influence the way you think or feel about an anime before you even watch a second of it. Reviews are just here as viewpoint of a certain single individual, cause sometimes what works for me may not work for you and vice versa.",
            "date": "2018-11-17T05:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 294217,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4438965.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hades_Gil",
                "username": "Hades_Gil"
            },
            "url": "https://myanimelist.net/reviews.php?id=294217"
        }
    ]
]