[
    [
        {
            "content": "Danna ga Nani wo Itteiru ka Wakaranai Ken 2 Sure-me ( I Can't Understand What My Husband Is Saying 2) is an anime short that really doesn't need any extensive examination to really comprehend. Adapted from the manga of the same name and garnering enough buzz to receive a 2nd season, those that are fans of the 1st installment would be treated to the same kind of charm in this follow-up. It's an anime short that tells a very simple, yet sweet tale, documenting the everyday lives of a married couple learning to cope with each other, despite their obvious differences. The biggest highlight ofthis show comes from seeing their daily interaction play out to comedic effect and also the small snippets of heartwarming content interspersed throughout its short run-time. \\n\\n\r\nHajime Tsunashi, husband to Kaoru Tsunashi, is a self-proclaimed otaku, and as one can imagine, he's the source of all the comedic mishaps and shenanigans that the couple find themselves dealing with on a day to day basis. Because of his status as an otaku, the writers often use him as a conduit to channel meta-humor and direct references to other licensed anime series. This brand of humor, while not uncommon, adds a spice to these shorts, as viewers who spot the references are treated to in-jokes. \\n\r\nKaoru Tsunashi can be best described as the voice of reason and an outsider to her husband's mentality. Like the title implies, most of the anime/manga references and terms her husband speak off flies over her head. The biggest draw to her as a character is seeing her learn to appreciate her husband for his hobby, despite being oblivious to it all. While the setup and relationship may seem slightly too optimistic at times, the show still manages to include moments of doubt in their compatibility and portray the ups and downs of being in a relationship. While all of it is glossed over with lighthearted sentimentality, that's not inherently an issue to penalize since the show as always made it clear that it was purposely aiming for that kind of tone.\\n\r\nWith returning characters from season 1, such as Youta Tsunashi, the husband's cross-dressing brother and Miki, employer and friend, the show carries over the same humor that it was known for with much ease. It's a continuation that flows into the other without any noticeable changes to throw viewers off. \\n\\n\r\nThe art-style is also the same, with a breezy children's coloring book kind of aesthetic and passable animation to wrap it all up. It helps to add to the show's overall carefree tone and makes the content more palatable. As far as the soundtrack is concerned, it's virtually nonexistent. It's mostly just light background noise than anything substantial and only serves to help sell the imagery but nothing beyond that. The ending, however, is a nice feel-good piece that really help to tie every episode together. \\n\\n\r\nWith a 3-minute run-time, pleasant art-style and a nice touch of humor, this title is a quick detour that would be enjoyed my most looking for harmless distraction. \\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nWith such a short run-time per episode, I never felt like the show overstayed its welcome. It was heartwarming when the time called for it and always left me with a smile. While not very memorable, it was still able to capture the right tempo at any given time. \\n\\n\r\nOverall: 5/10\\n\\n\r\nI Can't Understand What My Husband Is Saying 2 is a nice continuation of the 1st season and easily recommendable to those that enjoyed what that first installment had to offer. With a short run-time, it never feels like it's impeding on your viewing schedule and can serve as a nice change of pace for those searching for something to unwind to. Unfortunately, it's not something that really sticks with you as the short run-time also keeps it from being nothing more than an uplifting time-passer. But it never needed to be anything beyond that, so at the end of the day, this title served its purpose.",
            "date": "2015-07-30T17:23:00+00:00",
            "helpful_count": 64,
            "mal_id": 194755,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955909.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ZephSilver",
                "username": "ZephSilver"
            },
            "url": "https://myanimelist.net/reviews.php?id=194755"
        },
        {
            "content": "Firstly, let me start of by saying that this is my first review, so it might not be as good as other reviews.\r\nAlso, I'll try my best not to include any spoilers at all.\r\nOk apart from that. I would love to say that the second season of Danna (because title is too long) is honestly unexpectedly even more enjoyable than the previous season, which was why I felt compelled to write this review in the first place. I mean I do have better things to do with my time.\r\nMoving on, so why do I like this show? To sum it up rather quickly, because thisis one of the only shorts that actually is entertaining to watch and explores the region of what happens if one is an Otaku and somehow manages to get in a romantic relationship. \\n\\n\r\nHaving watched many other titles in the same genre as this, I can honestly say that this show given the 3+ minutes that it runs, really did a great job as compared to many other titles that wast 20+ minutes to achieve almost nothing cept slapstick humor and many other pointless scenes.\\n\\n\r\nWhy does this title stand out?\\n\r\nLet's start with some strong points.\\n\\n\r\nCharacter: 10/10\\n\r\nFor a 3 minute short it definitely did it's job by portraying the protagonist, Hajime in the \"correct\" light. At least how most Otaku males are (me included). Many jokes used in the show also shapes what kind of person Hajime is and really brings light to this series. On the other hand, we have Kaoru, a working-class office woman that (for some reason) is always seen at home with Hajime. She somehow decides to marry Hajime and BAM, the start of this show.\\n\\n\r\nThe daily interactions in this show are truthful and not overly exaggerated like how other Animu and Mango would show, the classic \"fat otaku\" desperately yearning for a young girl. However Hajime is just seen to be a  normal male trying to make the best out of his relationship and to make Kaoru happy, sometimes with his otaku antics that serves also as great humor points.\\n\\n\r\nArt: 7/10\\n\r\nThe art is pretty average here, nothing special. Some flashback episodes of when Kaoru was still younger had really \"ping pong the animation\" type of animation which is kinda...bad. Other than that it's pretty decent and absolutely watchable.\\n\\n\r\nSound: 8/10\\n\r\nThe ED of the first season was good. The ED of the second season was great. This is really personal preference so nothing much to say here. Soundtracks used in the actual series are minimal, which I really liked, as it does not interfere with the conversations between Kaoru and Hajime or other characters. When Hajime or Kaoru is deep in thought, there is a cue for some good soundtrack, as seen in Episode 12, which does compliment the series, making it great to watch.\\n\\n\r\nStory: 8/10\\n\r\nWell....I'm saying this again but for a 3 minute short it really did quite good a job by shaping almost every character. The light-hearted humor in this show is really stress-relieving and just makes you feel...good. There's really not much of a \"serious\" plot for people expecting something like Steins;Gate, but still it really is enjoyable.\\n\\n\r\nEnjoyment: 10/10\\n\r\nDefinitely. This is one of the only shows of this season that caught my eye, other than my other favorite, Oregairu. It really kept me wanting for more every week after I watch the latest episode, simply because it really IS enjoyable.\\n\\n\\n\r\nTL;DR   Lighthearted humor of life between Otaku and Office wife, season 2. \\n\r\n11/10 would watch again. :P\\n\\n",
            "date": "2015-06-18T23:41:00+00:00",
            "helpful_count": 28,
            "mal_id": 190601,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4352675.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Katekyo_Rayman",
                "username": "Katekyo_Rayman"
            },
            "url": "https://myanimelist.net/reviews.php?id=190601"
        },
        {
            "content": "This heart-warming series about an otaku's amazing marriage to a mostly-ordinary girl continues into season 2. Like the first season, the majority of the show is composed of 4-koma like short events, which are often humorous. The show doesn't exploit the discovery in the last episode of season 1 as much as I thought it would. Regardless, it does a great job of continuing the feel-good relationship-based atmosphere of the first season. As usual, the first season is mandatory as there isn't any character exposition.\r\nAnimation:\r\nExpect the same as the first season, not really the prettiest thing out there but it does the job. Like thefirst season, expect the subject matter to be a bit on the mature side- including quite a few dirty jokes.\\n\\n\r\nSound:\\n\r\nAlso very similar to the first season, the show has a nice ED and average BGM. The voice talent is very good for something this short.\\n\\n\r\nStory:\\n\r\nWhat really matters in marriage? Is it okay that other people say that it won't work? How do you get through a bad argument? The show gives some playful insight into life after marriage, as well as some of the characters' pasts previous to their vows. The overall message is very positive, and it feels like an attempt to get more Japanese folks to marry and also the next step.\\n\\n\r\nAs with the previous season, expect episodic episodes each with its own theme. There isn't much in terms of episode dependency so don't worry too much about spreading it across multiple viewings. There isn't as cute of an ending surprise as the first season, unfortunately.\\n\\n\r\nCharacter:\\n\r\nThere's some nice episodes that focus on character flashbacks, expanding on how they met and other meaningful events in their past. Their relationship is already very well established compared to, well, every other show out there, so don't expect too much dynamic progression. Still, there definitely is great chemistry here.\\n\\n\r\nValue:\\n\r\nThe entertainment to viewing-time ratio is very good, if you liked the first season there's no reason not to pick this up.",
            "date": "2015-11-05T00:04:00+00:00",
            "helpful_count": 12,
            "mal_id": 202713,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202713"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nThere are friends and there is family, both of which are important relationships to have and to maintain. But there is arguably one that is even greater, or at the minimum is incredibly unique when compared to the previous two: the connection to a lover. The wife or husband, the companion, the darling; the relationship that is made between two people who love each other, more so than anyone else, is a special bond that is extremely valuable. After all, they do not include the phrase “’till death do you part” because it sounds cool. ICan’t Understand What My Husband Is Saying: 2nd Thread hones in on this very bond, providing an anime that does not really know what it wants to do.\\n\\n\r\nSTORY\\n\\n\r\nDanna ga Nani 2 (the Japanese, shortened name of choice) heads back to the happily married couple that is Hajime and Kaoru, giving the audience various glimpses into the everyday life the two lead.\\n\\n\r\nThe anime begins with a rather peculiar narrative decision by foregoing a direct continuation of the previous season. Instead, the show opts to regress, expounding on events that occurred at intermittent times throughout its prequel. This might be where the qualification of the title comes from; just as computers use threading to execute their processes simultaneously, Danna ga Nani 2 happens “concurrently” with its predecessor. Considering that Hajime works as a web designer and partakes in “nerdy” hobbies, this interpretation gains more weight.\\n\\n\r\nRegardless of the cleverness of the title, the decision to not push forward plot-wise is weird. On the one hand, the show doing this kind of threading introduces a sense of missing progression, with the audience feeling as if “this has already happened.” The events themselves are new and never-before-seen, but through the overlapping of their timelines, this faux repetition is generated. Such repetition is not necessarily intentional, yet it causes the audience to potentially perceive the anime as misguided in its own ventures, that it has nothing else to say other than what it “already has.” On the other hand, this gives the anime the opportunity to reinforce the ideas it had worked with in the past, namely the difficulties faced by newlyweds. Having the events take place throughout the first season’s offerings keeps the focus on its original intentions, rather than introducing a new motif to explore, thereby giving the anime an established and stronger foundation in terms of the theme presented.\\n\\n\r\nAs a result, the theme remains the same as it did in the previous season – what it means to be husband and wife. The events depict this readily enough. One instance has Kaoru questioning her compatibility with Hajime. Another has her visiting his parents where she finds the togetherness giving her more happiness than she can put into words. Yet another has Hajime learning of his wife’s past by visiting her childhood city. In short, each episode serves as a way to demonstrate the relationship that is shared between the couple, be it through questioning, understanding, or comparing. At the same time, the repetition pronounces itself further; there is an “out-of-place” tale, pop-culture nods, and hilarity of the sexual variety, all of which are found in the first season. This is not technically a detriment to the anime, since this season simply wanted to echo the original, which on that basis it accomplished.\\n\\n\r\nHowever, the repetition and the reinforcement is called into question when the second season nears its conclusion, since the final three episodes choose to move beyond the first season’s timeline. There, the scenarios more so than usual focus on introspection. This heightened drama might seem slightly uncharacteristic, but in fact the first season and indeed much of the second season had this same tone. For example, the episode involving Youta’s background took on this vibe, the one concerning Hajime’s initial “love triangle” did as well, and so did many of the conversations with Destiny Fucker. Now, the exploration of the theme remains intact; Hajime and Kaoru are shown to be having their first ever fight (admittedly, over something rather important) and the two of them question their lives and themselves, both as individuals and together. The reason, though, why the ending comes off as different is because it almost completely ditches the referential and reactionary joking it would use in unison with the more serious moments. The show tries to morph itself into something that it did not set out to be, which serves to confuse the audience. It is these last few set of moments, which ignore the direction and the comedy, that leave an unfortunate sour taste in the viewer’s mouth as the season ends.\\n\\n\r\nUltimately, the plot mirrors its predecessor while simultaneously trying to be a standalone offering, failing on the latter of these two fronts.\\n\\n\r\nANIMATION\\n\\n\r\nDanna ga Nani 2 adopts a simple style, to make it more visually soothing on the eye. The art is not extravagant or detailed, with many of the locations using soft colors and “realistic” environments. Hajime and Kaoru’s home and living room are commonly shown, but the show does take time to showcase different backgrounds to spice up the dullness they get. Parks, subway stations, bowling alleys, an outdoor bath, and restaurants are examples of the anime’s foray into diversity.\\n\\n\r\nThe character designs are consistent with the first season’s designs, being funny or caricature in nature. Hajime has his overly-round glasses and simple clothing, Kaoru’s mismatched blonde hair and pink shirt return, and Destiny Fucker wears his coat, hat, and shades that make him look less like someone who fights fate and more like a shady businessman. Also noteworthy are everyone’s heads, which seem too big for their bodies, but find solace among the other off-kilter designs like Rino’s extreme shortness and Tobe’s super-magenta hair color.\\n\\n\r\nActual animation is somewhere slightly below average, however, in this instance, the choppiness works in the show’s favor due to the quick pacing of the comedy and events. Scenes barely last for extended periods of time, meaning animation is barely even around when it has the chance to be, but this keeps everything moving despite nothing moving.\\n\\n\r\nCHARACTERS\\n\\n\r\nWhat is interesting about Danna ga Nani 2’s characters is how much emphasis is placed on the sides rather than the mains, Hajime and Kaoru.\\n\\n\r\nYouta is not afraid to express his love for men and, more specifically, his older brother Hajime. But as is shown through the “special” episode, Youta had not always been the happy-go-lucky, boys-love drawing “mangaka” he is today. The disparity between his former and current self is striking, based on both his appearance and, more importantly, the way in which he carried himself. He was portrayed as brooding, wanting to be accepted but unable to accept others. It becomes quite evident how true this is when a group of bullies attack his gender and when Youta does not see the value of understanding the passions that Hajime had. It is not until these two worlds collide that he determines that being a “winner” means having a heart, both towards others and one’s self.\\n\\n\r\nRino and Nozomu also have the spotlight aimed at them, in the same manner as Youta, through the use of flashback. Rino is normally characterized as a child based on her stature alone but her past reveals that she has earned her status in more ways than one. She was shown whining, needing, and losing her temper quickly, making her a very difficult person to tolerate. In contrast, Nozomu is almost too mature for his own good. He often acts completely nonchalant; it is not that he does not care for the people around him but that he does not seem to care enough. The contrast between the two is what brought them together in the first place, but also represents the adage “opposites attract” wonderfully. While strictly for each other, Rino learns to act a bit more seriously, whereas Nozomu learns to appreciate others, establishing the loving relationship they now share to this day.\\n\\n\r\nDanna ga Nani 2 also introduces a sampling of new characters, although their purposes are often singular and indirect, meaning they are not given the same “respect” as side characters like Tanaka or Destiny Fucker. For example, Denji, Hajime’s father, is astonished to find that Kaoru was not a fake wife of his son’s. Yuzu is another; she is Youta’s mentor, but her inclusion was there to highlight Kaoru’s shift in mindset from her earlier days of not getting married. There is also Tobe, Kaoru’s coworker, who is there to provide the premises of cheating in relationships and valuing one’s self-worth. While one-offs, it is a boon that Denji, Yuzu, Tobe, and the other newcomers are used exclusively for setting up scenarios for the main and side characters to interact in because the anime constructed itself to be a copycat of the first season. Furthermore, each of the newer characters are at the same, minimal level focus-wise; one person does not receive more screen-time than another, and considering that the more important characters get and deserve more attention, this is simply wise to do.\\n\\n\r\nDenji and the new cast members all coincidentally deal with Kaoru for a reason: they, by proxy, develop her (and Hajime). As has been mentioned, the prominent husband and wife question themselves and their partner, wondering if the life they have now is right for them. Hajime at one point determines that doubting his elation makes it easier to handle, after listening to Destiny Fucker’s wisdom; Kaoru similarly ponders if their relationship should change with a baby on the way, after conversing with Tanaka. But calling what Hajime and Kaoru go through “development” may be too generous, since they do not necessarily change as people. Instead, it is more reconfirmation. Indeed, marriage is the act of accepting one’s partner fully, “for better for worse,” to love him or her for who they are and not what they can become. It is this conclusion that Hajime and Kaoru almost always come to; Hajime might worry about being a good husband or Kaoru might be concerned with Hajime’s feelings, but the two, whether they know it or not, love each other for being nobody else but themselves.\\n\\n\r\nSOUND\\n\\n\r\nThe ending theme is quite short, but that is due to the reduced length of the episodes and series overall. The happy couple sings the duet, and combined with the slow and romantic arrangement, creates a piece that finds comfortability between these two love birds.\\n\\n\r\nThe rest of the soundtrack is filled with lame background pieces which fit the occasion but do not stand out on their own. None are particularly memorable besides the acoustic guitar accompanied by a dainty flute which captures the simple life Hajime and Kaoru share. However, it is worth it to note the various sound effects the show likes to use. They are often of the whirly, wiggly, and wonky kind, but aid the comedy by being silly in their usage.\\n\\n\r\nVoice acting for the anime is somewhere around average. Special shout-outs are deserved for Sayaka Horino as Youta for her androgynous voice and Rie Kugimiya as Rino for her childish tone when speaking.\\n\\n\r\nENJOYMENT\\n\\n\r\nOne reason why this series is entertaining is due to the actual age and demographic. Hajime and Kaoru being adults, married, and partaking in mature ventures gives the show a certain sense of uniqueness when compared to the majority of other anime. It can also be funny when it wants to, like with Youta’s infatuation with Destiny Fucker (which, looking at his name on its own, is hilarious; this is also why I tried to include it wherever I could in my review), Hajime’s fetishes, and Rino’s entire episode dedicated to her. The show was not comedic the whole way through, and the dramatic moments were not too endearing. However, the length of the whole season – just about forty minutes – it makes it easy to sit down and watch in a single session, making these faults not overly bothersome.\\n\\n\r\nI Can’t Understand What My Husband Is Saying: 2nd Thread attempts to “continue” the story started by the original, but unfortunately meets some bumps in the road. It never knows what it wants to be, the music is lacking, and the spouts of boredom throughout are apparent. Hopefully the next iteration understands where it went wrong because the series definitely has the potential to be something more.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, nearly identical to the prequel in terms of comedy and themes, but when it tries to venture out on its own it falls flat\\n\\n\r\nAnimation: Fine, simple art style, appropriate character designs, below average actual animation that works in its favor\\n\\n\r\nCharacters: Good, Youta and the other side characters are interesting, the newcomers like Denji and Tobe serve their purpose, and Hajime and Kaoru are a nice example of a married couple\\n\\n\r\nSound: Fine, okay ED, bad soundtrack, silly sound effects, average VA work\\n\\n\r\nEnjoyment: Fine, Youta, Hajime, and Rino were funny at times, and while not much else was, the shortness of the season alleviates this problem slightly\\n\\n\r\nFinal Score: 5/10",
            "date": "2015-08-30T17:37:00+00:00",
            "helpful_count": 10,
            "mal_id": 197519,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=197519"
        },
        {
            "content": "I won't be writing a review on the first season because I'm focusing on anime series from Spring 2015 onward (if not there would be too many reviews to write....)\r\nJust like the first season it had the comedy and character personalities are still there!\r\nFor an anime short I wished it would have been longer than 3 minutes; but I guess that's how the creators brought out the comedy and characters in the series\r\nEach episode is short and the series is great for laughs so I would recommend this to comedy lovers or people who like to see parodies in other anime series\r\n(there are a fewparodies in the series which add more to the humor)",
            "date": "2015-07-04T18:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 192326,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551125.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jun98",
                "username": "Jun98"
            },
            "url": "https://myanimelist.net/reviews.php?id=192326"
        },
        {
            "content": "FULL DISCLOSURE: This is a repaste of my review of the first season, since the series is so short I reviewed both together. The differences are at the bottom. I have not read the original 4-koma. I strongly recommend watching this as it is really short and enjoyable.\r\nART+ANIMATION:\r\nIt’s a 4-koma based anime, so the art won’t be amazing. That being said, everything looks purposeful and there are no outstanding omissions. There are moments within the story with strongly different art / animation to match the situational comedy and they all work well.\r\nThe animation is standard-issue for this genre. However, there is one episode that usesits own dreary feeling animation style for a character development flashback - I think its use was well-suited. There are even a few scenes where the animation functions well as a metaphor for the situation.\\n\\n\r\nNothing worth mentioning about sound or music. As is the norm, the music merely fits the moods.\\n\\n\r\nSTORY:\\n\r\nThe story is about a mid-20’s couple consisting of a nerdy guy and a ‘normal’ girl. Thankfully, the husband’s nerdiness for the most part only influences his personality so that it doesn’t get too old too quickly. It’s very episodic with the general contents of each episode not having much effect on the others, but there is also a lot of continuous building of the plot. \\n\\n\r\nOf course most of the episodes are about their antics or daily life activities, no surprise there. What’s new at least to me is that the situations are much more interesting than the plethora of middle-/high-school student SOL, thanks to the mid-20’s couple. Being in that stage of life, many of the situations are relatable to me personally.\\n\\n\r\nCHARACTERS:\\n\r\nThe character design in a SOL 4-koma is very basic, but I like the faces and expressions. Definitely moe-style but here it’s not a bad thing. \\n\\n\r\nAs fitting for a 4-koma, many of the supporting characters exist only to suit a certain running gag or two, but nothing is too overdone. There are some other good, normal interactions within them and the main characters.\\n\\n\r\nDespite being episodic, there is some real character development going on, and some of it really hits home hard. Both husband and wife have real life problems, and you learn that the wife is not nearly as normal as you were earlier led to believe.\\n\\n\r\nKugimiya Rie is a voice actor in the show (not too often) – I like her in case you can’t tell. Aaanyways… the voice acting is well-fitting to the characters, so no bad marks there.\\n\\n\r\nENJOYMENT:\\n\r\nThere are some pretty good jokes and references included, and the way some of them are portrayed in such a mundane setting makes it even more entertaining. Of course, some references fly right over my head either since I’m not Japanese or familiar with many of the reference material, but thankfully I don’t feel too left out. \\n\\n\r\nDespite the episodes only lasting three minutes each, they are not sped way up to fit everything which was the right decision for the content and mood. Having a show of this format include some pretty serious character development was a welcome surprise.\\n\\n\r\nOVERALL:\\n\r\nGreat short story with some good character development. The humor is right up my alley. The art is nothing special but the focus is more on the main characters than anything else.\\n\\n\r\nCOMPARED WITH 1ST SEASON:\\n\r\nHumor is just as good, but the story turns more episodic with a general focus on the couple becoming ready for parenthood. Feels more somber, first season was better.\\n\\n\r\nTL;DR:\\n\r\nCute, funny, with some deeper, young couple topics. Watch it.\\n",
            "date": "2016-12-10T13:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 235211,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5863535.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bossmann-dan",
                "username": "bossmann-dan"
            },
            "url": "https://myanimelist.net/reviews.php?id=235211"
        },
        {
            "content": "This'll be very brief, as not much is different to season 1, which I already reviewed.\r\nStory:\r\nThe humor is the same, the jokes are still funny, it's pretty much just more of the same (which is cool with me).\r\n8/10\r\nArt:\r\nNothing different here either. Simplistic, yes, but tolerable.\r\n6/10\r\nSound:\r\nVoice acting was still pretty good, the new ending was just as cute as the first.\r\n8/10\r\nCharacters:\r\nOur main couple is as cute and funny as before. The side characters are fun as well. The story how Rino and her husband met was adorable.\r\n7/10\r\nEnjoyment:\r\nThis gets the exact same ratings, as it is the exact same anime, only more episodes. Fun to watch, verycute at times and heartwarming.\\n\r\n9/10\\n\\n\r\nOverall:\\n\r\n7.6/10",
            "date": "2016-12-18T03:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 235728,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=235728"
        },
        {
            "content": "Basically everything that I said about the first season rings about the same for this season, as its more or less the same as last season, but with different antics and such going down. However theres a lot less screentime with the titular husband dude, so that kinda bogs things down a bit. Either way this anime is still pretty good, and the episodes are still all under 5 minutes, which is good if you want to just watch shit to watch shit. Also the baby that was so important during the last episode of the first season is nowhere to be seen until thelast episode of this season, so rip that baby being a story device. If I were to finally describe this anime, this anime's description would be \"this anime is so great, that i would reccomend this anime to everyone\", so thats what this anime would be. = this anime. 9/10. \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\r\nwow, I'm really good at reviewing things!",
            "date": "2016-08-16T19:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 226900,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5600974.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/supah_mama_luigi",
                "username": "supah_mama_luigi"
            },
            "url": "https://myanimelist.net/reviews.php?id=226900"
        },
        {
            "content": "I dived into this short 4-koma manga with extremely low expectations as it was just a 3 minute per ep series. I came out of my binge-watch wholly satisfied and revitalized. That isn’t to say I rated it highly because it is really short and has about as much quality as its runtime- but that is to say, it pretty much used every second of every minute to the fullest.\r\nTo finally talk about what makes it so great; I would have to point out how progressive the initial season is. I am mainly talking about how Kaoru and Hajime having legitimate gripes when it cameto their marriage and hashed things out calmly. It was a good anecdote of how marriage can have small downsides. But it wasn’t just the fact that they talked things out but how they did it. As somewhat of a NEET, Hajime had his own ways of going about things that Kaoru didn’t fully understand but that we could easily relate to.\\n\\n\r\nShe’d try to edge him towards more orthodox paths of life. Also, she’d talk to her friends about it who have their own marriages. As such, they talk about their husbands all the time and I feel that’s a large part of adulthood that doesn’t get explained enough in anime. The act of socializing with other married couples and dealing with marriage. \\n\\n\r\nEach moment in this show is dedicated to participate in how Kaoru and Hajime find a comfortable middle ground through communication and they do this for everything! Through marriage and even through pregnancy. A lot of people chalk up its strengths to relatability and comfort but it’s nothing so arbitrary as that. It has a legitimately nice and interesting plot that remains progressive, at least till the end of the first season. Admittedly, I didn’t like the second season. It wasn’t nearly progressive and efficient as the first one. Besides moments of genuine delight that I found in seeing some characters interact  and the last few episodes giving an equally delightful excerpt of how our married couple came together; I thought it could’ve shown the many stages of pregnancy and how they were to handle it. In fact, the pregnancy almost felt like a non-factor.\\n\\n\r\nAs a whole, it was a very amusing and calm short series of actually meaningful happenings that connect with each other unlike a lot of 4-koma manga adaptations. Take a seat back when you watch this one- it’s great.",
            "date": "2018-01-22T08:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 269337,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6499555.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jester_Monocle",
                "username": "Jester_Monocle"
            },
            "url": "https://myanimelist.net/reviews.php?id=269337"
        }
    ],
    [
        {
            "content": "Danna ga Nani wo Itteiru ka Wakaranai Ken 2 Sure-me ( I Can't Understand What My Husband Is Saying 2) is an anime short that really doesn't need any extensive examination to really comprehend. Adapted from the manga of the same name and garnering enough buzz to receive a 2nd season, those that are fans of the 1st installment would be treated to the same kind of charm in this follow-up. It's an anime short that tells a very simple, yet sweet tale, documenting the everyday lives of a married couple learning to cope with each other, despite their obvious differences. The biggest highlight ofthis show comes from seeing their daily interaction play out to comedic effect and also the small snippets of heartwarming content interspersed throughout its short run-time. \\n\\n\r\nHajime Tsunashi, husband to Kaoru Tsunashi, is a self-proclaimed otaku, and as one can imagine, he's the source of all the comedic mishaps and shenanigans that the couple find themselves dealing with on a day to day basis. Because of his status as an otaku, the writers often use him as a conduit to channel meta-humor and direct references to other licensed anime series. This brand of humor, while not uncommon, adds a spice to these shorts, as viewers who spot the references are treated to in-jokes. \\n\r\nKaoru Tsunashi can be best described as the voice of reason and an outsider to her husband's mentality. Like the title implies, most of the anime/manga references and terms her husband speak off flies over her head. The biggest draw to her as a character is seeing her learn to appreciate her husband for his hobby, despite being oblivious to it all. While the setup and relationship may seem slightly too optimistic at times, the show still manages to include moments of doubt in their compatibility and portray the ups and downs of being in a relationship. While all of it is glossed over with lighthearted sentimentality, that's not inherently an issue to penalize since the show as always made it clear that it was purposely aiming for that kind of tone.\\n\r\nWith returning characters from season 1, such as Youta Tsunashi, the husband's cross-dressing brother and Miki, employer and friend, the show carries over the same humor that it was known for with much ease. It's a continuation that flows into the other without any noticeable changes to throw viewers off. \\n\\n\r\nThe art-style is also the same, with a breezy children's coloring book kind of aesthetic and passable animation to wrap it all up. It helps to add to the show's overall carefree tone and makes the content more palatable. As far as the soundtrack is concerned, it's virtually nonexistent. It's mostly just light background noise than anything substantial and only serves to help sell the imagery but nothing beyond that. The ending, however, is a nice feel-good piece that really help to tie every episode together. \\n\\n\r\nWith a 3-minute run-time, pleasant art-style and a nice touch of humor, this title is a quick detour that would be enjoyed my most looking for harmless distraction. \\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nWith such a short run-time per episode, I never felt like the show overstayed its welcome. It was heartwarming when the time called for it and always left me with a smile. While not very memorable, it was still able to capture the right tempo at any given time. \\n\\n\r\nOverall: 5/10\\n\\n\r\nI Can't Understand What My Husband Is Saying 2 is a nice continuation of the 1st season and easily recommendable to those that enjoyed what that first installment had to offer. With a short run-time, it never feels like it's impeding on your viewing schedule and can serve as a nice change of pace for those searching for something to unwind to. Unfortunately, it's not something that really sticks with you as the short run-time also keeps it from being nothing more than an uplifting time-passer. But it never needed to be anything beyond that, so at the end of the day, this title served its purpose.",
            "date": "2015-07-30T17:23:00+00:00",
            "helpful_count": 64,
            "mal_id": 194755,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955909.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ZephSilver",
                "username": "ZephSilver"
            },
            "url": "https://myanimelist.net/reviews.php?id=194755"
        },
        {
            "content": "Firstly, let me start of by saying that this is my first review, so it might not be as good as other reviews.\r\nAlso, I'll try my best not to include any spoilers at all.\r\nOk apart from that. I would love to say that the second season of Danna (because title is too long) is honestly unexpectedly even more enjoyable than the previous season, which was why I felt compelled to write this review in the first place. I mean I do have better things to do with my time.\r\nMoving on, so why do I like this show? To sum it up rather quickly, because thisis one of the only shorts that actually is entertaining to watch and explores the region of what happens if one is an Otaku and somehow manages to get in a romantic relationship. \\n\\n\r\nHaving watched many other titles in the same genre as this, I can honestly say that this show given the 3+ minutes that it runs, really did a great job as compared to many other titles that wast 20+ minutes to achieve almost nothing cept slapstick humor and many other pointless scenes.\\n\\n\r\nWhy does this title stand out?\\n\r\nLet's start with some strong points.\\n\\n\r\nCharacter: 10/10\\n\r\nFor a 3 minute short it definitely did it's job by portraying the protagonist, Hajime in the \"correct\" light. At least how most Otaku males are (me included). Many jokes used in the show also shapes what kind of person Hajime is and really brings light to this series. On the other hand, we have Kaoru, a working-class office woman that (for some reason) is always seen at home with Hajime. She somehow decides to marry Hajime and BAM, the start of this show.\\n\\n\r\nThe daily interactions in this show are truthful and not overly exaggerated like how other Animu and Mango would show, the classic \"fat otaku\" desperately yearning for a young girl. However Hajime is just seen to be a  normal male trying to make the best out of his relationship and to make Kaoru happy, sometimes with his otaku antics that serves also as great humor points.\\n\\n\r\nArt: 7/10\\n\r\nThe art is pretty average here, nothing special. Some flashback episodes of when Kaoru was still younger had really \"ping pong the animation\" type of animation which is kinda...bad. Other than that it's pretty decent and absolutely watchable.\\n\\n\r\nSound: 8/10\\n\r\nThe ED of the first season was good. The ED of the second season was great. This is really personal preference so nothing much to say here. Soundtracks used in the actual series are minimal, which I really liked, as it does not interfere with the conversations between Kaoru and Hajime or other characters. When Hajime or Kaoru is deep in thought, there is a cue for some good soundtrack, as seen in Episode 12, which does compliment the series, making it great to watch.\\n\\n\r\nStory: 8/10\\n\r\nWell....I'm saying this again but for a 3 minute short it really did quite good a job by shaping almost every character. The light-hearted humor in this show is really stress-relieving and just makes you feel...good. There's really not much of a \"serious\" plot for people expecting something like Steins;Gate, but still it really is enjoyable.\\n\\n\r\nEnjoyment: 10/10\\n\r\nDefinitely. This is one of the only shows of this season that caught my eye, other than my other favorite, Oregairu. It really kept me wanting for more every week after I watch the latest episode, simply because it really IS enjoyable.\\n\\n\\n\r\nTL;DR   Lighthearted humor of life between Otaku and Office wife, season 2. \\n\r\n11/10 would watch again. :P\\n\\n",
            "date": "2015-06-18T23:41:00+00:00",
            "helpful_count": 28,
            "mal_id": 190601,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4352675.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Katekyo_Rayman",
                "username": "Katekyo_Rayman"
            },
            "url": "https://myanimelist.net/reviews.php?id=190601"
        },
        {
            "content": "This heart-warming series about an otaku's amazing marriage to a mostly-ordinary girl continues into season 2. Like the first season, the majority of the show is composed of 4-koma like short events, which are often humorous. The show doesn't exploit the discovery in the last episode of season 1 as much as I thought it would. Regardless, it does a great job of continuing the feel-good relationship-based atmosphere of the first season. As usual, the first season is mandatory as there isn't any character exposition.\r\nAnimation:\r\nExpect the same as the first season, not really the prettiest thing out there but it does the job. Like thefirst season, expect the subject matter to be a bit on the mature side- including quite a few dirty jokes.\\n\\n\r\nSound:\\n\r\nAlso very similar to the first season, the show has a nice ED and average BGM. The voice talent is very good for something this short.\\n\\n\r\nStory:\\n\r\nWhat really matters in marriage? Is it okay that other people say that it won't work? How do you get through a bad argument? The show gives some playful insight into life after marriage, as well as some of the characters' pasts previous to their vows. The overall message is very positive, and it feels like an attempt to get more Japanese folks to marry and also the next step.\\n\\n\r\nAs with the previous season, expect episodic episodes each with its own theme. There isn't much in terms of episode dependency so don't worry too much about spreading it across multiple viewings. There isn't as cute of an ending surprise as the first season, unfortunately.\\n\\n\r\nCharacter:\\n\r\nThere's some nice episodes that focus on character flashbacks, expanding on how they met and other meaningful events in their past. Their relationship is already very well established compared to, well, every other show out there, so don't expect too much dynamic progression. Still, there definitely is great chemistry here.\\n\\n\r\nValue:\\n\r\nThe entertainment to viewing-time ratio is very good, if you liked the first season there's no reason not to pick this up.",
            "date": "2015-11-05T00:04:00+00:00",
            "helpful_count": 12,
            "mal_id": 202713,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202713"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nThere are friends and there is family, both of which are important relationships to have and to maintain. But there is arguably one that is even greater, or at the minimum is incredibly unique when compared to the previous two: the connection to a lover. The wife or husband, the companion, the darling; the relationship that is made between two people who love each other, more so than anyone else, is a special bond that is extremely valuable. After all, they do not include the phrase “’till death do you part” because it sounds cool. ICan’t Understand What My Husband Is Saying: 2nd Thread hones in on this very bond, providing an anime that does not really know what it wants to do.\\n\\n\r\nSTORY\\n\\n\r\nDanna ga Nani 2 (the Japanese, shortened name of choice) heads back to the happily married couple that is Hajime and Kaoru, giving the audience various glimpses into the everyday life the two lead.\\n\\n\r\nThe anime begins with a rather peculiar narrative decision by foregoing a direct continuation of the previous season. Instead, the show opts to regress, expounding on events that occurred at intermittent times throughout its prequel. This might be where the qualification of the title comes from; just as computers use threading to execute their processes simultaneously, Danna ga Nani 2 happens “concurrently” with its predecessor. Considering that Hajime works as a web designer and partakes in “nerdy” hobbies, this interpretation gains more weight.\\n\\n\r\nRegardless of the cleverness of the title, the decision to not push forward plot-wise is weird. On the one hand, the show doing this kind of threading introduces a sense of missing progression, with the audience feeling as if “this has already happened.” The events themselves are new and never-before-seen, but through the overlapping of their timelines, this faux repetition is generated. Such repetition is not necessarily intentional, yet it causes the audience to potentially perceive the anime as misguided in its own ventures, that it has nothing else to say other than what it “already has.” On the other hand, this gives the anime the opportunity to reinforce the ideas it had worked with in the past, namely the difficulties faced by newlyweds. Having the events take place throughout the first season’s offerings keeps the focus on its original intentions, rather than introducing a new motif to explore, thereby giving the anime an established and stronger foundation in terms of the theme presented.\\n\\n\r\nAs a result, the theme remains the same as it did in the previous season – what it means to be husband and wife. The events depict this readily enough. One instance has Kaoru questioning her compatibility with Hajime. Another has her visiting his parents where she finds the togetherness giving her more happiness than she can put into words. Yet another has Hajime learning of his wife’s past by visiting her childhood city. In short, each episode serves as a way to demonstrate the relationship that is shared between the couple, be it through questioning, understanding, or comparing. At the same time, the repetition pronounces itself further; there is an “out-of-place” tale, pop-culture nods, and hilarity of the sexual variety, all of which are found in the first season. This is not technically a detriment to the anime, since this season simply wanted to echo the original, which on that basis it accomplished.\\n\\n\r\nHowever, the repetition and the reinforcement is called into question when the second season nears its conclusion, since the final three episodes choose to move beyond the first season’s timeline. There, the scenarios more so than usual focus on introspection. This heightened drama might seem slightly uncharacteristic, but in fact the first season and indeed much of the second season had this same tone. For example, the episode involving Youta’s background took on this vibe, the one concerning Hajime’s initial “love triangle” did as well, and so did many of the conversations with Destiny Fucker. Now, the exploration of the theme remains intact; Hajime and Kaoru are shown to be having their first ever fight (admittedly, over something rather important) and the two of them question their lives and themselves, both as individuals and together. The reason, though, why the ending comes off as different is because it almost completely ditches the referential and reactionary joking it would use in unison with the more serious moments. The show tries to morph itself into something that it did not set out to be, which serves to confuse the audience. It is these last few set of moments, which ignore the direction and the comedy, that leave an unfortunate sour taste in the viewer’s mouth as the season ends.\\n\\n\r\nUltimately, the plot mirrors its predecessor while simultaneously trying to be a standalone offering, failing on the latter of these two fronts.\\n\\n\r\nANIMATION\\n\\n\r\nDanna ga Nani 2 adopts a simple style, to make it more visually soothing on the eye. The art is not extravagant or detailed, with many of the locations using soft colors and “realistic” environments. Hajime and Kaoru’s home and living room are commonly shown, but the show does take time to showcase different backgrounds to spice up the dullness they get. Parks, subway stations, bowling alleys, an outdoor bath, and restaurants are examples of the anime’s foray into diversity.\\n\\n\r\nThe character designs are consistent with the first season’s designs, being funny or caricature in nature. Hajime has his overly-round glasses and simple clothing, Kaoru’s mismatched blonde hair and pink shirt return, and Destiny Fucker wears his coat, hat, and shades that make him look less like someone who fights fate and more like a shady businessman. Also noteworthy are everyone’s heads, which seem too big for their bodies, but find solace among the other off-kilter designs like Rino’s extreme shortness and Tobe’s super-magenta hair color.\\n\\n\r\nActual animation is somewhere slightly below average, however, in this instance, the choppiness works in the show’s favor due to the quick pacing of the comedy and events. Scenes barely last for extended periods of time, meaning animation is barely even around when it has the chance to be, but this keeps everything moving despite nothing moving.\\n\\n\r\nCHARACTERS\\n\\n\r\nWhat is interesting about Danna ga Nani 2’s characters is how much emphasis is placed on the sides rather than the mains, Hajime and Kaoru.\\n\\n\r\nYouta is not afraid to express his love for men and, more specifically, his older brother Hajime. But as is shown through the “special” episode, Youta had not always been the happy-go-lucky, boys-love drawing “mangaka” he is today. The disparity between his former and current self is striking, based on both his appearance and, more importantly, the way in which he carried himself. He was portrayed as brooding, wanting to be accepted but unable to accept others. It becomes quite evident how true this is when a group of bullies attack his gender and when Youta does not see the value of understanding the passions that Hajime had. It is not until these two worlds collide that he determines that being a “winner” means having a heart, both towards others and one’s self.\\n\\n\r\nRino and Nozomu also have the spotlight aimed at them, in the same manner as Youta, through the use of flashback. Rino is normally characterized as a child based on her stature alone but her past reveals that she has earned her status in more ways than one. She was shown whining, needing, and losing her temper quickly, making her a very difficult person to tolerate. In contrast, Nozomu is almost too mature for his own good. He often acts completely nonchalant; it is not that he does not care for the people around him but that he does not seem to care enough. The contrast between the two is what brought them together in the first place, but also represents the adage “opposites attract” wonderfully. While strictly for each other, Rino learns to act a bit more seriously, whereas Nozomu learns to appreciate others, establishing the loving relationship they now share to this day.\\n\\n\r\nDanna ga Nani 2 also introduces a sampling of new characters, although their purposes are often singular and indirect, meaning they are not given the same “respect” as side characters like Tanaka or Destiny Fucker. For example, Denji, Hajime’s father, is astonished to find that Kaoru was not a fake wife of his son’s. Yuzu is another; she is Youta’s mentor, but her inclusion was there to highlight Kaoru’s shift in mindset from her earlier days of not getting married. There is also Tobe, Kaoru’s coworker, who is there to provide the premises of cheating in relationships and valuing one’s self-worth. While one-offs, it is a boon that Denji, Yuzu, Tobe, and the other newcomers are used exclusively for setting up scenarios for the main and side characters to interact in because the anime constructed itself to be a copycat of the first season. Furthermore, each of the newer characters are at the same, minimal level focus-wise; one person does not receive more screen-time than another, and considering that the more important characters get and deserve more attention, this is simply wise to do.\\n\\n\r\nDenji and the new cast members all coincidentally deal with Kaoru for a reason: they, by proxy, develop her (and Hajime). As has been mentioned, the prominent husband and wife question themselves and their partner, wondering if the life they have now is right for them. Hajime at one point determines that doubting his elation makes it easier to handle, after listening to Destiny Fucker’s wisdom; Kaoru similarly ponders if their relationship should change with a baby on the way, after conversing with Tanaka. But calling what Hajime and Kaoru go through “development” may be too generous, since they do not necessarily change as people. Instead, it is more reconfirmation. Indeed, marriage is the act of accepting one’s partner fully, “for better for worse,” to love him or her for who they are and not what they can become. It is this conclusion that Hajime and Kaoru almost always come to; Hajime might worry about being a good husband or Kaoru might be concerned with Hajime’s feelings, but the two, whether they know it or not, love each other for being nobody else but themselves.\\n\\n\r\nSOUND\\n\\n\r\nThe ending theme is quite short, but that is due to the reduced length of the episodes and series overall. The happy couple sings the duet, and combined with the slow and romantic arrangement, creates a piece that finds comfortability between these two love birds.\\n\\n\r\nThe rest of the soundtrack is filled with lame background pieces which fit the occasion but do not stand out on their own. None are particularly memorable besides the acoustic guitar accompanied by a dainty flute which captures the simple life Hajime and Kaoru share. However, it is worth it to note the various sound effects the show likes to use. They are often of the whirly, wiggly, and wonky kind, but aid the comedy by being silly in their usage.\\n\\n\r\nVoice acting for the anime is somewhere around average. Special shout-outs are deserved for Sayaka Horino as Youta for her androgynous voice and Rie Kugimiya as Rino for her childish tone when speaking.\\n\\n\r\nENJOYMENT\\n\\n\r\nOne reason why this series is entertaining is due to the actual age and demographic. Hajime and Kaoru being adults, married, and partaking in mature ventures gives the show a certain sense of uniqueness when compared to the majority of other anime. It can also be funny when it wants to, like with Youta’s infatuation with Destiny Fucker (which, looking at his name on its own, is hilarious; this is also why I tried to include it wherever I could in my review), Hajime’s fetishes, and Rino’s entire episode dedicated to her. The show was not comedic the whole way through, and the dramatic moments were not too endearing. However, the length of the whole season – just about forty minutes – it makes it easy to sit down and watch in a single session, making these faults not overly bothersome.\\n\\n\r\nI Can’t Understand What My Husband Is Saying: 2nd Thread attempts to “continue” the story started by the original, but unfortunately meets some bumps in the road. It never knows what it wants to be, the music is lacking, and the spouts of boredom throughout are apparent. Hopefully the next iteration understands where it went wrong because the series definitely has the potential to be something more.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, nearly identical to the prequel in terms of comedy and themes, but when it tries to venture out on its own it falls flat\\n\\n\r\nAnimation: Fine, simple art style, appropriate character designs, below average actual animation that works in its favor\\n\\n\r\nCharacters: Good, Youta and the other side characters are interesting, the newcomers like Denji and Tobe serve their purpose, and Hajime and Kaoru are a nice example of a married couple\\n\\n\r\nSound: Fine, okay ED, bad soundtrack, silly sound effects, average VA work\\n\\n\r\nEnjoyment: Fine, Youta, Hajime, and Rino were funny at times, and while not much else was, the shortness of the season alleviates this problem slightly\\n\\n\r\nFinal Score: 5/10",
            "date": "2015-08-30T17:37:00+00:00",
            "helpful_count": 10,
            "mal_id": 197519,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=197519"
        },
        {
            "content": "I won't be writing a review on the first season because I'm focusing on anime series from Spring 2015 onward (if not there would be too many reviews to write....)\r\nJust like the first season it had the comedy and character personalities are still there!\r\nFor an anime short I wished it would have been longer than 3 minutes; but I guess that's how the creators brought out the comedy and characters in the series\r\nEach episode is short and the series is great for laughs so I would recommend this to comedy lovers or people who like to see parodies in other anime series\r\n(there are a fewparodies in the series which add more to the humor)",
            "date": "2015-07-04T18:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 192326,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551125.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jun98",
                "username": "Jun98"
            },
            "url": "https://myanimelist.net/reviews.php?id=192326"
        },
        {
            "content": "FULL DISCLOSURE: This is a repaste of my review of the first season, since the series is so short I reviewed both together. The differences are at the bottom. I have not read the original 4-koma. I strongly recommend watching this as it is really short and enjoyable.\r\nART+ANIMATION:\r\nIt’s a 4-koma based anime, so the art won’t be amazing. That being said, everything looks purposeful and there are no outstanding omissions. There are moments within the story with strongly different art / animation to match the situational comedy and they all work well.\r\nThe animation is standard-issue for this genre. However, there is one episode that usesits own dreary feeling animation style for a character development flashback - I think its use was well-suited. There are even a few scenes where the animation functions well as a metaphor for the situation.\\n\\n\r\nNothing worth mentioning about sound or music. As is the norm, the music merely fits the moods.\\n\\n\r\nSTORY:\\n\r\nThe story is about a mid-20’s couple consisting of a nerdy guy and a ‘normal’ girl. Thankfully, the husband’s nerdiness for the most part only influences his personality so that it doesn’t get too old too quickly. It’s very episodic with the general contents of each episode not having much effect on the others, but there is also a lot of continuous building of the plot. \\n\\n\r\nOf course most of the episodes are about their antics or daily life activities, no surprise there. What’s new at least to me is that the situations are much more interesting than the plethora of middle-/high-school student SOL, thanks to the mid-20’s couple. Being in that stage of life, many of the situations are relatable to me personally.\\n\\n\r\nCHARACTERS:\\n\r\nThe character design in a SOL 4-koma is very basic, but I like the faces and expressions. Definitely moe-style but here it’s not a bad thing. \\n\\n\r\nAs fitting for a 4-koma, many of the supporting characters exist only to suit a certain running gag or two, but nothing is too overdone. There are some other good, normal interactions within them and the main characters.\\n\\n\r\nDespite being episodic, there is some real character development going on, and some of it really hits home hard. Both husband and wife have real life problems, and you learn that the wife is not nearly as normal as you were earlier led to believe.\\n\\n\r\nKugimiya Rie is a voice actor in the show (not too often) – I like her in case you can’t tell. Aaanyways… the voice acting is well-fitting to the characters, so no bad marks there.\\n\\n\r\nENJOYMENT:\\n\r\nThere are some pretty good jokes and references included, and the way some of them are portrayed in such a mundane setting makes it even more entertaining. Of course, some references fly right over my head either since I’m not Japanese or familiar with many of the reference material, but thankfully I don’t feel too left out. \\n\\n\r\nDespite the episodes only lasting three minutes each, they are not sped way up to fit everything which was the right decision for the content and mood. Having a show of this format include some pretty serious character development was a welcome surprise.\\n\\n\r\nOVERALL:\\n\r\nGreat short story with some good character development. The humor is right up my alley. The art is nothing special but the focus is more on the main characters than anything else.\\n\\n\r\nCOMPARED WITH 1ST SEASON:\\n\r\nHumor is just as good, but the story turns more episodic with a general focus on the couple becoming ready for parenthood. Feels more somber, first season was better.\\n\\n\r\nTL;DR:\\n\r\nCute, funny, with some deeper, young couple topics. Watch it.\\n",
            "date": "2016-12-10T13:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 235211,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5863535.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bossmann-dan",
                "username": "bossmann-dan"
            },
            "url": "https://myanimelist.net/reviews.php?id=235211"
        },
        {
            "content": "This'll be very brief, as not much is different to season 1, which I already reviewed.\r\nStory:\r\nThe humor is the same, the jokes are still funny, it's pretty much just more of the same (which is cool with me).\r\n8/10\r\nArt:\r\nNothing different here either. Simplistic, yes, but tolerable.\r\n6/10\r\nSound:\r\nVoice acting was still pretty good, the new ending was just as cute as the first.\r\n8/10\r\nCharacters:\r\nOur main couple is as cute and funny as before. The side characters are fun as well. The story how Rino and her husband met was adorable.\r\n7/10\r\nEnjoyment:\r\nThis gets the exact same ratings, as it is the exact same anime, only more episodes. Fun to watch, verycute at times and heartwarming.\\n\r\n9/10\\n\\n\r\nOverall:\\n\r\n7.6/10",
            "date": "2016-12-18T03:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 235728,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=235728"
        },
        {
            "content": "Basically everything that I said about the first season rings about the same for this season, as its more or less the same as last season, but with different antics and such going down. However theres a lot less screentime with the titular husband dude, so that kinda bogs things down a bit. Either way this anime is still pretty good, and the episodes are still all under 5 minutes, which is good if you want to just watch shit to watch shit. Also the baby that was so important during the last episode of the first season is nowhere to be seen until thelast episode of this season, so rip that baby being a story device. If I were to finally describe this anime, this anime's description would be \"this anime is so great, that i would reccomend this anime to everyone\", so thats what this anime would be. = this anime. 9/10. \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\r\nwow, I'm really good at reviewing things!",
            "date": "2016-08-16T19:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 226900,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5600974.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/supah_mama_luigi",
                "username": "supah_mama_luigi"
            },
            "url": "https://myanimelist.net/reviews.php?id=226900"
        },
        {
            "content": "I dived into this short 4-koma manga with extremely low expectations as it was just a 3 minute per ep series. I came out of my binge-watch wholly satisfied and revitalized. That isn’t to say I rated it highly because it is really short and has about as much quality as its runtime- but that is to say, it pretty much used every second of every minute to the fullest.\r\nTo finally talk about what makes it so great; I would have to point out how progressive the initial season is. I am mainly talking about how Kaoru and Hajime having legitimate gripes when it cameto their marriage and hashed things out calmly. It was a good anecdote of how marriage can have small downsides. But it wasn’t just the fact that they talked things out but how they did it. As somewhat of a NEET, Hajime had his own ways of going about things that Kaoru didn’t fully understand but that we could easily relate to.\\n\\n\r\nShe’d try to edge him towards more orthodox paths of life. Also, she’d talk to her friends about it who have their own marriages. As such, they talk about their husbands all the time and I feel that’s a large part of adulthood that doesn’t get explained enough in anime. The act of socializing with other married couples and dealing with marriage. \\n\\n\r\nEach moment in this show is dedicated to participate in how Kaoru and Hajime find a comfortable middle ground through communication and they do this for everything! Through marriage and even through pregnancy. A lot of people chalk up its strengths to relatability and comfort but it’s nothing so arbitrary as that. It has a legitimately nice and interesting plot that remains progressive, at least till the end of the first season. Admittedly, I didn’t like the second season. It wasn’t nearly progressive and efficient as the first one. Besides moments of genuine delight that I found in seeing some characters interact  and the last few episodes giving an equally delightful excerpt of how our married couple came together; I thought it could’ve shown the many stages of pregnancy and how they were to handle it. In fact, the pregnancy almost felt like a non-factor.\\n\\n\r\nAs a whole, it was a very amusing and calm short series of actually meaningful happenings that connect with each other unlike a lot of 4-koma manga adaptations. Take a seat back when you watch this one- it’s great.",
            "date": "2018-01-22T08:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 269337,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6499555.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jester_Monocle",
                "username": "Jester_Monocle"
            },
            "url": "https://myanimelist.net/reviews.php?id=269337"
        }
    ]
]