[
    [
        {
            "content": "The boy king’s journey continues. The sequel of Arslan Senki (otherwise known as Arslan Senki: Dust Storm Dance) is a show that fans will easily get attached to. It’s not just because Arslan Senki takes place in a diverse cultural world but also with exploring the journey of the titular character Arslan, one could not help but have high expectations from the boy. \r\nTo be precise, the second season is noticeable for being only 8 episodes in length. Compared to the first season, that’s about 1/3 the run-time. Yes, you’re probably asking yourself something along the line of “then how will the story conclude?” Theanswer is pretty simple: it won’t. The series is more about the journey rather than the destination. As such, treat the storytelling more as a way to showcase Arslan and his co. as they take on new adventures.\\n\\n\r\nThat adventure begins with the war drama. Remember, Arslan Senki is more of a war story than a fantasy adventure despite having supernatural content. Arslan’s forces has their hands full in the beginning to deal with an invasion from Turan. While all this is happening, we are also introduced to a mysterious relic that Hilmes (Silver Mask) has his eyes on. A good deal of the first few episodes establishes the ruthlessness of the antagonists. In particular, Tokhtomysh (King of Turan) even delivers execution in order to draw Parsians into a trap. Anyway, I think the main point of the series is to establish the challenges Parsians must deal with to declare their independence. Arslan has also grown to become a well-respected leader known to even other countries. His maturity is shown with leadership, cleverness, and loyalty with his comrades. So much so, Gieve even returns with his services after going off on his own. \\n\\n\r\nOne of the more dynamic elements of Arslan Senki are the characters. Even though the main characters are well-established at this point, we still have characterization and subplot focused on them such as Narsus, HIlmes, Etoile, etc. Sometimes, I find the subplots about these characters to be even better than the main story because it makes us understand them more. Furthermore, their role in the series has influence on the overall story. For instance, Narsus’ reunion with his old friend Shagad shows his cleverness. They have a relationship that I’d describe more as acquaintances rather than best friends. Furthermore, we can easily see Narsus’ own ideologies about certain sensitive issues such as slavery. On the other hand, characters such as Hilmes gives us a decent insight about his past in this sequel. It shows a more gentle side of his character rather than the one we came to see on paper as a ruthless warrior. Even Etoile gets a major role in one of the episodes to showcase her importance. On the downside, new characters such as Grahze can only be remembered for their action and hardly anything else. Other previously introduced characters such as Elam and Falangies gets less focus compared to the previous season.  \\n\\n\r\nTo say the least, the overall storytelling of Arslan Senki: Dust Storm Dance can feel a bit predictable. Now this might not be true for all fans but should be easily recognized for the plot about the pirates and merchant ship conflict. On the other hand, there are also episodes that are really important. As I mentioned before, the subplot context feels as though they have better storytelling than the main plot; Hilmes and Etoile being prime examples. Thus, it’s disappointing that the show itself is shrinked to 8 episodes to focus on the main story with what it already has to work with.\\n\\n\r\nOn the technical front, the art style of the sequel has more or less downgraded. This includes some of the more complex battle scenes involving characters with jerky movements. Don’t get me wrong, there’s still ‘wow factor’ when it comes to fighting in the show. Daryun and merchant captain Grahze proves that quite well. However, it’s more about the character expressions that feels underwhelming. On the plus side, the background settings improved with a more adventurous feel. The introduction of sea and merchant ships also offers some neat naval battle that is refreshing. \\n\\n\r\nThe soundtrack is still pretty similar compared the first season. It uses harmonic music to keep in pace with different scenarios ranging from simple conversations to intense battle scenes. Character voice mannerism is delivered well on most parts with Arslan being more noticeable for his maturity. One praise I would like to throw in would be Hilmes for his ability to portray personalities ranging from ruthlessness to sympathetic. \\n\\n\r\nSo what should you expect from the sequel of Arslan Senki? If you’re looking for a masterpiece, then it’s clearly the wrong place to look. Even on paper, the pacing of just 8 episodes should trigger a red alert. Less characterization on certain other main characters should also be expected as well. However, the sequel still offers a good amount of storytelling with its existing characters. Remember, the show isn’t just about getting to the end goal for Arslan but rather his journey to reach it. And for that, I think it’s worth to take that journey with them.\\n\\n",
            "date": "2016-08-21T07:04:00+00:00",
            "helpful_count": 112,
            "mal_id": 227256,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=227256"
        },
        {
            "content": "I wonder what I expected out of this season. When I read that there were only going to be 8 episodes of content they originally planned on skipping, I didn't have much hope left for the anime. And somehow, it still managed to disappoint me.\r\nArslan Senki introduced an interesting, while not all too new, story. It's a low-fantasy, presented somewhat cartoonish - the story was kept interesting with exagerations and unexplained magic and a mysterious antagonist, Zuk- I mean, Hilmes.\r\nIn this second season, they decide to delve a little into Hilmes' past - we get some character development, and given incentive to care about him.And that's really nice... if it weren't the ONLY character development throughout this season.\\n\\n\r\nThe other characters from last season fall - no pun intended - completely flat. They are reduced to a mere herd of animals following and obeying their leader, Arslan and are pushed completely to the background. Arslan himself seems to be stuck at the character he obtained throughout last season, as well. \\n\r\nThere are some new characters, but besides those that are part of Hilmes' backstory, there isn't much development either.\\n\\n\r\nThe characters are the only thing that could have carried the story. So that falls flat as well. A lame, minor antagonists and an overall uneventful plot are the main focus this season, while all the interesting stuff is happening in the background - which is mainly the only reason I kept watching. But for the most part, all I heard and saw was a run-off-the-mill story, with one-liners you could have probably found in a book called \"Clichéd Dialogue in Fantasy Animes\".\\n\r\nNarsus apparently knows all the enemy plans, as usual, but doesn't tell the viewer that he knows this, making all of his counter-plans seem like mere dei ex machina.\\n\\n\r\nIf the art and animation had been good, I would have probably enjoyed this as an average anime, but the staff only seemed to have the budget for low quality shots and still images. The CGI was bad, but, with the exception for some fights and the finale, the best animation troughout the season.\\n\\n\r\nThe voice acting decided to follow the this trend and all the characters spoke, beside for some returning characters, without emotion and only decent intonation - it was bland.\\n\r\nThe music, however, was good; it fit the atmoshpere and knew how to hype up scenes. The sound effects, as well, were on point.\\n\\n\r\nAs we reach the end of the season, the story that had been unveiling on the background culminates, the animation gets back some of its life, and the characters some of their depth, giving me at least some hope for next season.",
            "date": "2016-08-28T12:32:00+00:00",
            "helpful_count": 28,
            "mal_id": 227817,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3987443.jpg",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/metadata",
                "username": "metadata"
            },
            "url": "https://myanimelist.net/reviews.php?id=227817"
        },
        {
            "content": "Thirty minutes ago I wrote a review about Arslan Senki S1 now here I am, back to rant about these idiots.\r\nOriginally, I gave this season a 5. Now that I'm looking at it scrupulously, it's more of a 4 or 3. Let me explain.\r\nMy expectations are completely different than before. In Arslan Senki, I wanted to be introduced to the characters and their goals, to know more about the setting of the story and also the main conflict. Which was all done relatively well.\r\nNow for Arslan Senki: Fuujin Ranbu, I wanted to delve into the minds of these characters and see them evolve. Sadly, again,they do not grow.\\n\\n\r\nOur main cast is still the same as before, they do not learn from their mistakes -- they don't make mistake to begin with. Arslan is still an innocent white snowflake without any awareness of the real-life dangers being overprotected by Daryun-oka-chan who's reduced to be the mindless brawl of his 'Highness'. I swear if I hear him yell 'denka' again I destroy the internet. \\n\r\nBut, pals, I had hope!\\n\r\nWhen we've met Narsus' old friend, I thought I would finally get the development I've been longing for. Some backstory as to why Narsus is the way he is and how two friends parted on different journeys. Jokes on me, that conflict lasted two episodes with no explanation nor flashback about their relationship to show us how deep the betrayal was. \\n\r\nAnd even when Alfreed's brother was introduced, I thought we could see some nice frictions between the siblings or even Alfreed revealing more about her past, anything that would have shown us her struggles or the reasons she ran. Something to make me care, ffs. They can all die, I would literally give no shit because they overlooked that emotional development. I cannot connect with this series because characters aren't real. They're funny and lovable and sure looks good but there is nothing more to them. I'm not as much engaged in the story as I was in Fullmetal Alchemist, for instance.\\n\r\nOf course, the rest of the bunch is lessened to their previous role with no active participation in the advancement of the plot whatsoever.\\n\\n\r\nEverything in this series is freaking shallow. It's there for sparks and glitters, for cool moments that would make great AMVs. Nothing is deep, the characters are never challenged externally and internally. As a grand poet would say; they have the emotional range of a teaspoon.\\n\\n\r\nThe only one that gets a little bit of backstory is our Zuko/Shouto boy. That makes me want to root for the villain, honestly.\\n\\n\r\nThe animation found a way to become even worst. I didn't think it was possible but the overuse of dark contrast made it impossible for my screen to distinguish the dark tones from the light tones. The 3D still looks awful but now I'm used to it. Good news is: characters aren't legos anymore! They're freaking carton boxes. Fluidity was lost in favor of better background visuals. I don't know if it's a good thing though.\\n\r\nI noticed nothing different in the OSTs and despite being sung by the same artists, the OP and ED have less impact than in the first season.\\n\\n\r\nIf the eight-episode season didn't tip you off, you can still feel this season was rushed and is nowhere near the quality of the first season. It's not even a whole cour! \\n\\n\r\nThere is little chance for a third season, at least not in the close future but I do hope we put all this overdramatic plot aside and focus on the characters. Because Arslan's epic journey is about him, not the super goody fights. I got to care if you want me to root for him or I'll go pray to that Yaldabotthing (bless you, dear) for all of them to die painfully.\\n\r\nYeah, I'm a resentful viewer.",
            "date": "2018-04-24T18:34:00+00:00",
            "helpful_count": 8,
            "mal_id": 278926,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5358295.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/CHANGnosia",
                "username": "CHANGnosia"
            },
            "url": "https://myanimelist.net/reviews.php?id=278926"
        }
    ],
    [
        {
            "content": "The boy king’s journey continues. The sequel of Arslan Senki (otherwise known as Arslan Senki: Dust Storm Dance) is a show that fans will easily get attached to. It’s not just because Arslan Senki takes place in a diverse cultural world but also with exploring the journey of the titular character Arslan, one could not help but have high expectations from the boy. \r\nTo be precise, the second season is noticeable for being only 8 episodes in length. Compared to the first season, that’s about 1/3 the run-time. Yes, you’re probably asking yourself something along the line of “then how will the story conclude?” Theanswer is pretty simple: it won’t. The series is more about the journey rather than the destination. As such, treat the storytelling more as a way to showcase Arslan and his co. as they take on new adventures.\\n\\n\r\nThat adventure begins with the war drama. Remember, Arslan Senki is more of a war story than a fantasy adventure despite having supernatural content. Arslan’s forces has their hands full in the beginning to deal with an invasion from Turan. While all this is happening, we are also introduced to a mysterious relic that Hilmes (Silver Mask) has his eyes on. A good deal of the first few episodes establishes the ruthlessness of the antagonists. In particular, Tokhtomysh (King of Turan) even delivers execution in order to draw Parsians into a trap. Anyway, I think the main point of the series is to establish the challenges Parsians must deal with to declare their independence. Arslan has also grown to become a well-respected leader known to even other countries. His maturity is shown with leadership, cleverness, and loyalty with his comrades. So much so, Gieve even returns with his services after going off on his own. \\n\\n\r\nOne of the more dynamic elements of Arslan Senki are the characters. Even though the main characters are well-established at this point, we still have characterization and subplot focused on them such as Narsus, HIlmes, Etoile, etc. Sometimes, I find the subplots about these characters to be even better than the main story because it makes us understand them more. Furthermore, their role in the series has influence on the overall story. For instance, Narsus’ reunion with his old friend Shagad shows his cleverness. They have a relationship that I’d describe more as acquaintances rather than best friends. Furthermore, we can easily see Narsus’ own ideologies about certain sensitive issues such as slavery. On the other hand, characters such as Hilmes gives us a decent insight about his past in this sequel. It shows a more gentle side of his character rather than the one we came to see on paper as a ruthless warrior. Even Etoile gets a major role in one of the episodes to showcase her importance. On the downside, new characters such as Grahze can only be remembered for their action and hardly anything else. Other previously introduced characters such as Elam and Falangies gets less focus compared to the previous season.  \\n\\n\r\nTo say the least, the overall storytelling of Arslan Senki: Dust Storm Dance can feel a bit predictable. Now this might not be true for all fans but should be easily recognized for the plot about the pirates and merchant ship conflict. On the other hand, there are also episodes that are really important. As I mentioned before, the subplot context feels as though they have better storytelling than the main plot; Hilmes and Etoile being prime examples. Thus, it’s disappointing that the show itself is shrinked to 8 episodes to focus on the main story with what it already has to work with.\\n\\n\r\nOn the technical front, the art style of the sequel has more or less downgraded. This includes some of the more complex battle scenes involving characters with jerky movements. Don’t get me wrong, there’s still ‘wow factor’ when it comes to fighting in the show. Daryun and merchant captain Grahze proves that quite well. However, it’s more about the character expressions that feels underwhelming. On the plus side, the background settings improved with a more adventurous feel. The introduction of sea and merchant ships also offers some neat naval battle that is refreshing. \\n\\n\r\nThe soundtrack is still pretty similar compared the first season. It uses harmonic music to keep in pace with different scenarios ranging from simple conversations to intense battle scenes. Character voice mannerism is delivered well on most parts with Arslan being more noticeable for his maturity. One praise I would like to throw in would be Hilmes for his ability to portray personalities ranging from ruthlessness to sympathetic. \\n\\n\r\nSo what should you expect from the sequel of Arslan Senki? If you’re looking for a masterpiece, then it’s clearly the wrong place to look. Even on paper, the pacing of just 8 episodes should trigger a red alert. Less characterization on certain other main characters should also be expected as well. However, the sequel still offers a good amount of storytelling with its existing characters. Remember, the show isn’t just about getting to the end goal for Arslan but rather his journey to reach it. And for that, I think it’s worth to take that journey with them.\\n\\n",
            "date": "2016-08-21T07:04:00+00:00",
            "helpful_count": 112,
            "mal_id": 227256,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=227256"
        },
        {
            "content": "I wonder what I expected out of this season. When I read that there were only going to be 8 episodes of content they originally planned on skipping, I didn't have much hope left for the anime. And somehow, it still managed to disappoint me.\r\nArslan Senki introduced an interesting, while not all too new, story. It's a low-fantasy, presented somewhat cartoonish - the story was kept interesting with exagerations and unexplained magic and a mysterious antagonist, Zuk- I mean, Hilmes.\r\nIn this second season, they decide to delve a little into Hilmes' past - we get some character development, and given incentive to care about him.And that's really nice... if it weren't the ONLY character development throughout this season.\\n\\n\r\nThe other characters from last season fall - no pun intended - completely flat. They are reduced to a mere herd of animals following and obeying their leader, Arslan and are pushed completely to the background. Arslan himself seems to be stuck at the character he obtained throughout last season, as well. \\n\r\nThere are some new characters, but besides those that are part of Hilmes' backstory, there isn't much development either.\\n\\n\r\nThe characters are the only thing that could have carried the story. So that falls flat as well. A lame, minor antagonists and an overall uneventful plot are the main focus this season, while all the interesting stuff is happening in the background - which is mainly the only reason I kept watching. But for the most part, all I heard and saw was a run-off-the-mill story, with one-liners you could have probably found in a book called \"Clichéd Dialogue in Fantasy Animes\".\\n\r\nNarsus apparently knows all the enemy plans, as usual, but doesn't tell the viewer that he knows this, making all of his counter-plans seem like mere dei ex machina.\\n\\n\r\nIf the art and animation had been good, I would have probably enjoyed this as an average anime, but the staff only seemed to have the budget for low quality shots and still images. The CGI was bad, but, with the exception for some fights and the finale, the best animation troughout the season.\\n\\n\r\nThe voice acting decided to follow the this trend and all the characters spoke, beside for some returning characters, without emotion and only decent intonation - it was bland.\\n\r\nThe music, however, was good; it fit the atmoshpere and knew how to hype up scenes. The sound effects, as well, were on point.\\n\\n\r\nAs we reach the end of the season, the story that had been unveiling on the background culminates, the animation gets back some of its life, and the characters some of their depth, giving me at least some hope for next season.",
            "date": "2016-08-28T12:32:00+00:00",
            "helpful_count": 28,
            "mal_id": 227817,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3987443.jpg",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/metadata",
                "username": "metadata"
            },
            "url": "https://myanimelist.net/reviews.php?id=227817"
        },
        {
            "content": "Thirty minutes ago I wrote a review about Arslan Senki S1 now here I am, back to rant about these idiots.\r\nOriginally, I gave this season a 5. Now that I'm looking at it scrupulously, it's more of a 4 or 3. Let me explain.\r\nMy expectations are completely different than before. In Arslan Senki, I wanted to be introduced to the characters and their goals, to know more about the setting of the story and also the main conflict. Which was all done relatively well.\r\nNow for Arslan Senki: Fuujin Ranbu, I wanted to delve into the minds of these characters and see them evolve. Sadly, again,they do not grow.\\n\\n\r\nOur main cast is still the same as before, they do not learn from their mistakes -- they don't make mistake to begin with. Arslan is still an innocent white snowflake without any awareness of the real-life dangers being overprotected by Daryun-oka-chan who's reduced to be the mindless brawl of his 'Highness'. I swear if I hear him yell 'denka' again I destroy the internet. \\n\r\nBut, pals, I had hope!\\n\r\nWhen we've met Narsus' old friend, I thought I would finally get the development I've been longing for. Some backstory as to why Narsus is the way he is and how two friends parted on different journeys. Jokes on me, that conflict lasted two episodes with no explanation nor flashback about their relationship to show us how deep the betrayal was. \\n\r\nAnd even when Alfreed's brother was introduced, I thought we could see some nice frictions between the siblings or even Alfreed revealing more about her past, anything that would have shown us her struggles or the reasons she ran. Something to make me care, ffs. They can all die, I would literally give no shit because they overlooked that emotional development. I cannot connect with this series because characters aren't real. They're funny and lovable and sure looks good but there is nothing more to them. I'm not as much engaged in the story as I was in Fullmetal Alchemist, for instance.\\n\r\nOf course, the rest of the bunch is lessened to their previous role with no active participation in the advancement of the plot whatsoever.\\n\\n\r\nEverything in this series is freaking shallow. It's there for sparks and glitters, for cool moments that would make great AMVs. Nothing is deep, the characters are never challenged externally and internally. As a grand poet would say; they have the emotional range of a teaspoon.\\n\\n\r\nThe only one that gets a little bit of backstory is our Zuko/Shouto boy. That makes me want to root for the villain, honestly.\\n\\n\r\nThe animation found a way to become even worst. I didn't think it was possible but the overuse of dark contrast made it impossible for my screen to distinguish the dark tones from the light tones. The 3D still looks awful but now I'm used to it. Good news is: characters aren't legos anymore! They're freaking carton boxes. Fluidity was lost in favor of better background visuals. I don't know if it's a good thing though.\\n\r\nI noticed nothing different in the OSTs and despite being sung by the same artists, the OP and ED have less impact than in the first season.\\n\\n\r\nIf the eight-episode season didn't tip you off, you can still feel this season was rushed and is nowhere near the quality of the first season. It's not even a whole cour! \\n\\n\r\nThere is little chance for a third season, at least not in the close future but I do hope we put all this overdramatic plot aside and focus on the characters. Because Arslan's epic journey is about him, not the super goody fights. I got to care if you want me to root for him or I'll go pray to that Yaldabotthing (bless you, dear) for all of them to die painfully.\\n\r\nYeah, I'm a resentful viewer.",
            "date": "2018-04-24T18:34:00+00:00",
            "helpful_count": 8,
            "mal_id": 278926,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5358295.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/CHANGnosia",
                "username": "CHANGnosia"
            },
            "url": "https://myanimelist.net/reviews.php?id=278926"
        }
    ]
]