[
    [
        {
            "content": "Let me tell you a Story, a Story of a man that gets into a high school, just to find out that this school is ruled by \"feminism\". that school was once a female school. But then they decided to open it to male population. but guess what? the nation of \"feminism\" stroke down, and the whole school turned all their male students into females boys in order to make the girls feel \"safe\"\r\nTL;DR: Overall Section\r\nif by this point you don't spot any red flags dancing around your mind, then you should stop reading (btw, if you are going to get salty, avoid my profileand grow up, after all this is my opinion). but if you feel that the whole Idea is ridiculous then keep reading. be aware of spoilers\\n\\n\r\nStory 2/10:\\n\\n\r\nStory, story... What story? all we got is that Nomura got transferred into another school just to find out that the school is full on whimsical girls that for whatever reason have a problem against all men (\"feminism\"), and the school rules consist on turning boys into girls so they can get all along. (then what is the point of even including males into it?)\\n\\n\r\nNomura just wanted to chill on his new school, but apparently if he doesn't agree with the shitty rules that the school has, he is forced to a fight against the \"5 swords\" or any other girl that has something against men. the whole argument of this show is a convenient plot device that serves purpose as how idiotic the high school rules can be and how low the girls fall on this show. then, if our MC wants to chill he has to defeat all the 5 swords and get a \"pass\" to leave the school.\\n\\n\r\n*spoiler section*\\n\\n\r\nsometimes we get some of the past of Nomura, he constantly remembers one of his \"friends\" that he used to hang out with... sadly the pure essence of a Yandere awakened on that friend and decided to beat the fuck out of him... guess what happens next? \\n\\n\r\n*End of spoiler section*\\n\\n\r\nArt 5/10:\\n\\n\r\nYour average budget for a generic setting, it was nice to see some attacks coming from some fights, as for fan service, it was a relieving distraction for the pain this show is\\n\\n\r\nSound 5/10:\\n\\n\r\nI always wonder why good sounding OPs are to be found in generic anime, is a total waste, but it accomplishes as a relieving distraction. I don't find anything really outstanding, so overall is okay\\n\\n\r\nCharacter 2/10:\\n\\n\r\nAside of how strong the feminism essence is on the girls, they are also a bunch of generic annoying girls. if you have seen this setting before, its almost obvious that every girl eventually will like the MC. well this time is more in a masochist way, they all start liking the MC after all of them received a beatdown (a really relieving beatdown I must say) so lets give them some points for showing us another way to get a Harem.\\n\\n\r\nI don't really have a problem with anime girls overall, unless they are a bunch of useless airheads (Chitanda from Hyouka for example), but this show went too far making almost every girl annoying in a way. and I'm talking about that green haired girl that gets on my nerves each time that she appears, I don't know how people do like her, but I haven't seen someone that annoying. I actually wanted her to suffer a lot, (gladly she did, and it was extremely relieving) aside of the 99% of annoying girls, there is 1% that is quite acceptable, there goes Onigawara, and the Bear girl with the HIO HIO HIO laugh, but nothing more.\\n\\n\r\n*Spoiler section\\n\\n\r\nOh yes, Give Nomura some credit for defending the male population, it was really relieving seeing how he succeeded against the  girls beating them down one by one\\n\\n\r\n*End of spoiler Section... actually it was obvious that he would most likely to succeed*\\n\\n\\n\r\nEnjoyment 5/10: \\n\\n\r\nEnjoying this show is like watching a fight on the street between someone you don't know, against someone you dislike so much, the relieving factor of seeing how that someone you don't like get beat down so hard makes you feel extremely relieved. if it were because of how Nomura beats down each girl and saves male population of becoming female boys, I would have rated this higher than 8. Sadly the \"blood bath\" ending I wanted didn't happened. not even the final moment with Onigawara. Everything turned into a cliché and bullshit plot device around Amou that no one asked (Like hey, lets make a past for the MC but lets never touch it until the very end so we create a really convenient finale). well, at least I didn't ask for it, that should be more accurate if the ones reading this are burning their salt into really high temperature ready to burst against me...\\n\\n\r\nOverall 3,8/10:\\n\\n\r\nTL;DR: school transfer ends wrong, girls trying to punish a male because he is a male that won't become a female, he fights against school rules, saving all the males from becoming females, he creates a harem, and a plot convenience comes to claim him as her unrequited love from the past because jealousy",
            "date": "2017-06-21T13:55:00+00:00",
            "helpful_count": 121,
            "mal_id": 250568,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5202766.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/HereticHunter",
                "username": "HereticHunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=250568"
        },
        {
            "content": "Busou was a very interesting show. Its one that people didn't really expect much out of and in the end they got...a bit more of what they actually expected. So yeah. I suppose you can say it just did...good. But that's not what you're here for. You're wondering WHY it did good.\r\nThe show is a pretty good representation of if you want to take basic tropes at least make it interesting considering how many times we've seen a short-running manga turned into a simple 1-cour show. Hell, it's undeniable to say there isn't one almost every single season. They're everywhere. Because it isn't that hardto gush out 12 episodes of blatant advertisement of,\"Hey. You liked this? Go buy the manga now there's more of it coming sooner than you think.\"\\n\\n\r\nBusou manages to...make it interesting and worthwhile though. Odd, yet interesting. I will not say my time watching Busou was wasted. Hell, I really enjoyed it. \\n\\n\r\nThe main strength of Busou definitely comes from its odd plot and the main character himself. A school designed for females but has a male population. The thing is though the male population was sent and forced into oppression to the point were some of them undergo and make themselves into a \"girl\" because of being pushed so far into a corner. All the while being watched over a council of five girls with swords who can fight pretty damn well with said swords. Weird? Yeah. But don't lose me now it actually gets better going forward.\\n\\n\r\nThe whole underlying element of toppling oppression is completely evident in Busou. If you wanted to easily break this show down to someone you can easily just say,\"Some kickass guy runs into an oppressive school and dismantles the entire thing.\" Because quite frankly that truly what the show is all about\\n\\n\r\nEnter Nomura. Sent into the school after getting expelled from his last one. They thought they could use this school to completely break Nomura considering the reputation is has. Boy were they wrong. He goes in there headstrong and just..breaks it down. He let nothing stop him. His determination for freedom and his hot-headed yet intellectual personality makes him a compelling character. If there's one thing Busou did well it is having an actual interesting main character.\\n\\n\r\nBut on the other hand its weakness will also be the characters as well. Yes. We have cute girls who have swords and rule over a school. Yeah that's cool. They tell us backstory of each character. Yeah thats cool. But it'll be completely evident when when you're done watching this 1-cour you'll completely forget about Rin and Warabi within week's due. They're not memorable characters as much as Nomura was. It can't be said for the lack of screen time either. Because they all got their respectable amount. Its simply due because they were made in a way that their really isn't too much compelling about them to even remember their name after you're done watching it. Only Nomura carries that charm within his character strong enough for me to actually remember his name after weeks past.\\n\\n\r\nBut, whilst the characterization is weak...we also have another good. The action. Nomura determination for freedom is evident yes. But how does he get freedom exactly? Well, he has to collect five stamps from the girls I was talking to you about. Sounds simple, right? What does he have to do ace tests or whatever? Nay.\\n\\n\r\nGotta fucking fight for them. Enter Busou's next strong point. It had engaging action scenes to me. They weren't stellar believe me. This is coming from someone who'd rarely point out Art and Sound is his reviews though. But it doesn't take a keen eye to realize while yes, more time was spent making the action scenes look good. They still weren't stellar or amazing. But that doesn't deter from the flair they carry. It was fast and intense.  It kept moving at a rhythm. You can tell the character were trying to read each other and make moves to counter them. One of the best things about them is how characters don't shout out,\"Twin Katana Wind-blast!\" But instead it appears on our screen as their doing it. It feels more realistic in that nature that we just don't hear people screaming out their moves and then doing it. Instead they duke it out whilst we know what they're doing and the characters themselves have to figure out what moves their opponent is doing and the best way to fight against that.\\n\\n\r\nThe rhythm, nice flow, and overall simplistic yet engaging action scenes made them felt good and alive.  Take these and pair it with Busou's great way of making stuff feel more gritter(especially in the last 4 episodes) made it overall great.\\n\\n\r\nIn conclusion: Busou wasn't anything amazing. Choppy animation, subpar characterization, adapting a short-running manga, generic tags and plot-armor is sometimes extremely evident. But still, it did more right than wrong. It wasn't amazing. But it was entertaining and really in the end: That is all that matters.\\n\\n\\n\\n\\n",
            "date": "2017-06-21T21:21:00+00:00",
            "helpful_count": 56,
            "mal_id": 250616,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3319699.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Valiastrix",
                "username": "Valiastrix"
            },
            "url": "https://myanimelist.net/reviews.php?id=250616"
        },
        {
            "content": "Busou Shoujo Machiavellianism in other term, THE SCHOOL OF FEMINISM. \r\nThis show is more like a empowerment for women against all guys.\r\nThis show is like a Hardcore feminism where women can actually hurt any man. But what I like about this show is that it contradicts the prejudice of every women. That not all men are enemies, and not all men are pervents. The story isn't that marvelous, but it gives justice to every man in the school. It's like winning their trust show, and you'll gonna like it. Unlike Prison School, if you're familiar with it, this show is more like showing the goodside and clarifying the misunderstanding between men and women that they can co-exist to one another without any barrier. I like the development actually. If you are a man, you'll gonna root for the Main male character, but if you are a women, you'll be triggered because it's like they're protraying that despite how strong women are, women are fragile with their feelings, and they need the D afterall. If you know what I mean.",
            "date": "2017-05-10T14:08:00+00:00",
            "helpful_count": 23,
            "mal_id": 247391,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2028517.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/coffeeworld",
                "username": "coffeeworld"
            },
            "url": "https://myanimelist.net/reviews.php?id=247391"
        },
        {
            "content": "If I had to describe studio Silverlink in one word, that word would be ''mediocre''.  They're perhaps the most \"okay\" studio working in the industry today and none of their shows I would consider being all that good, with the exception of a couple maybe, but, even then, those exceptions are still nothing all too remarkable. They always make shows that sound good on paper, and, when read, sound like they could be good shows, but they usually lack the creative talents and efforts to carry this through and their shows always just end up feeling either downright terrible or just \"meh\" for lackof a better term. Nowhere is this more evident than with their latest title, Busou Shoujo Machiavellianism, which, with a narrative and idea this silly, could have made for a good rule of cool show if it had more energy put into its animation, but it feels, like most of their work, that they wanted to create something really cool and cinematic looking, but didn't have the necessary talent or creative force to do so. Despite being a relatively fun show none the less, the anime needed much more charisma in order to carry itself along for the entire duration and the shows just falls short of reaching that rule-of-cool aesthetic and vibe it was so clearly aiming for. In that regard, the show feels very much like a previous Silverlink show, Chivalry of a Failed Knight, which, despite being vastly greater than most other light novel adaptations and is all around a decent show, also falls just short from being good due the studio's general lack of creativity in visuals, while, at the same time, having a decent script with decent characters, something that Busou also carries on as well. Either way, let's dive into this insane, nutty show!\\n\\n\r\nBusou's narrative as a whole is one that is incredibly linear and straightforward. The show will not surprise you with any grand plot twists nor does it bring anything new to the table either, and it doesn't really have much direction. What I mean by that is that the characters don't really have anything in the way of a 'goal' or a motivation in the narrative, other than the main character wanting to collect five stamps from a group of five girls, all of whom carry swords. Oh, did I forget to mention that? Yes, for some reason, the school has allowed each one of the girls to carry a weapon due to the once all girl's school, becoming co-ed, allowing boys to join and, out of fear, request to carry said weapons as a means of protecting themselves. These weapons range anywhere from a sword to a whip to even a giant, damn bear! This aspect of the show is incredibly stupid, but the show as a whole is so tongue in cheek and takes itself so lightly that this aspect feels like a part of the world that is presented to us and doesn't feel all too jarring or even strange. Since the show doesn't take itself so seriously and more so laughs at its ridiculous setup, I can excuse this obvious dumb stuff. Due to each one of the girl's weapons, and general scary nature, the boys who do attend this school are put to humiliation and are forced to wear girl's clothing as a way to blend in with the school.  Enter our main character, a cocky, bad-ass asshole, by the name of Nomura, who goes against the demands of the girl's at the school, and the rest of the show sees him fight against five girls, who are called the Five Swords, a group who are the strongest, and most skilled with the sword, who go around correcting problematic students and the such. And that's about it for an overall plot, but the show carries this narrative with such a silly over the top atmosphere and tone, that I find it a lot of fun to watch the battles carry out and the characters feel dynamic and interesting enough in personality to carry the weight of the show.\\n\\n\r\nThe anime is incredibly dumb and stupid in a lot of ways, from sumo wrestling a giant bear to the plethora of various battles and fights, but, at the same time, the show also feels self-aware enough to know that the entire thing is incredibly dumb, and fully embraces all of it. Whenever the characters are in battle, bold white text will appear on the screen showcasing the name of their attacks, akin to something like Kill la Kill, with plenty of close-up shots of the characters reacting to certain events while they gasp. Both of these elements help to sell the show's rule of cool vibe it is aiming for and helps to make it fun and fairly entertaining for me personally. However, there are some moments in the show that I feel are a little too stupid for its own good. One such example is when the main character is attempting to hide behind a bear, a pet of one of the members of the Five Swords, which also happens to be female, as he accidentally touches her breasts. Instead of being funny, which is what I believe the writer was attempting, it just comes across as being strange, jarring and uncomfortable to watch as well.  Another example that may put some people off is when he fights one of the girls naked in the bathing areas. It can be distracting, and some may even consider tasteless, but I found the fight fun enough to carry the scene, and the nakedness of the girl is part of her tactic for winning the fight and adds on a little bit of characterisation for her character. Some other criticisms about the show may stem from the amount of blood and edge the show does try and convey, especially near the end, and I can understand why. It can seem kind of jarring to go from simply hi-jinks to a complete bloodbath as shown in episode ten, but, on the flip side, at the very least it provides some narrative stakes for the final fight and makes the villain out to be much more menacing and threatening too. The use of blood never really came across to me as being forced since it at least made sense in the context of the battles since all of the characters were using razor sharp blades. Another troupe that I wasn't too fond of, is that two of the girls fall in love with our main character and end up acting catty and bitchy to each other as they fight over him. I've always disliked this in anime since it reduces the female characters as nothing more than petty women, but here it didn't feel as bad as what I have seen before, and for the most part, there is an actual reason why these girls have fallen for this guy, as opposed to them simply wanting the main guy's dick just because the plot demands them to. This doesn't make this element any better, just a little bit more bearable in the long run.\\n\\n\r\nI was honestly surprised at how much I enjoyed the show and found myself actually excited and immersed during the action scenes, especially during the final fight. The series is so over the top and so dumb that I believe it does work from an entertainment standpoint alone, and while I wouldn't consider the entire narrative and characters to be terrible, it certainly needed a lot more work to make the show good.\\n\\n\r\nEach one of the characters has a stupid obvious gimmick whether that be in design or personality, but, at the very least, many of the characters at least have some depth, no matter how little granted, to make them feel a little more like actual people than bland archetypes. The main lead, Mamoru is essentially a better version of Glenn from Akashic Records, in that he is far more consistent and does the whole bad-ass cocky bastard rather well. I genuinely liked this character, and his back-story, unlike Glenn didn't feel as if it were included just for the sake of evoking cheap emotion from the audience, despite how generic and by the numbers this back-story actually is and how little of it we actually get to learn. A character like this holds up well for a silly narrative since he simply a lot of fun to watch and complements the silly nature of the show, although I wouldn't call his character good by any stretch. He fills his purpose fairly well, has some decent comedic moments and is a fine character. Rin's character has a massive hatred of men and wears a death god mask over half of her face since her mother called her ugly when she was a child and made her wear a mask over her face at all times when she went out with her. This back-story is quite dumb and rather, again, silly, but at the very least it provides an explanation into why this character acts the way that she does and the purpose behind her mask, rather than it remain a silly gimmick like those presented in Hand Shakers for example. Mary was a lot more generic than these two previously mentioned since we barely learn anything about her past and just assumes the \"girl with big boobs\" role while also carrying around a dictionary since she is Le François. She can be pretty annoying due to her attitude and general stuck-up-edness (that's not a word, I know) but otherwise, she is pretty forgettable. One of my favourite characters in the show is Satori, not only for how well her voice actress conveys her messed up mentality and rather sadistic sword fighting but because there was a decently executed plot twist in episode nine. It's not something to blow your mind, but I felt it was a decent twist none the less, and I did enjoy every scene she was in. While she doesn't necessarily see much development (as does the rest of the cast) she still gets some decent characterisation. The other two members of the Five Swords,  Warabi and Tsukyo, were also likeable, and Tsukyou especially manages to pull off the strong swordsman character rather effectively, and that's one thing I can praise the show for. The main character, while very strong, still isn't able to blow through all of the girls with ease and finds himself cornered more often than not, having to think up some clever way to win. While this isn't on the same level of tactical fights I've seen in some other shows, it at the very least, creates some narrative tension and stakes and makes the girl characters feel more like fighters than in your typical light novel series where the girls are all presented as being weak without the help of the boring male self-insert character. The final villain was decently executed and I felt a genuine sent of excitement seeing the main character and her fight in the final episodes, with a decently explored back-story explaining their rivalry and the reason why it spawned in the first place giving more weight to the scene. The character interactions were fine but often the dialogue feels very simple and trite, with two characters just yelling how great they are, and sometimes the comedy between certain characters could fall flat on its face. \\n\\n\r\nThe animation consistency was fairly good with a lot of character movement and attacks but the art consistency took a large hit as a result of this. It's good enough in conveying the action on screen and some moments can look downright great, but overall it's just fine. I liked the character designs themselves and the general colour design too, and the opening is catchy as hell! While in terms of visuals, it's just a bunch of random fights, each one flows into each other fairly well. The music is fine and does its job but is ultimately rather forgettable once you've finished watching the show; nothing all too remarkable aside from the opening and ending tracks. Overall, I believe this anime did achieve what it set out to do to a certain extent. While it is an overall decent show, I would be lying if I said that I didn't have fun watching this show and I would recommend this anime for anyone looking for a dumb, easy ride, although I doubt this show will be remembered in a few months.\\n\\n\\n",
            "date": "2017-06-21T23:15:00+00:00",
            "helpful_count": 21,
            "mal_id": 250621,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3420421.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LIQfilms",
                "username": "LIQfilms"
            },
            "url": "https://myanimelist.net/reviews.php?id=250621"
        },
        {
            "content": "Let me tell you all a story.. \" once there was a delinquent boy.. who got expelled from school and had to join a new school which was being dominated by girls and they all wanted to straighten him up but ended up falling for him... THE END\". Ever heard of something like this.. ya i know . So this pretty much sums up the entire anime and almost  very other harem anime nowadays.This show here is nothing but a sorry excuse of a harem anime with almost no originality and is full of shitty cliches that would make no sense. You would ratherwonder about why are the children even allowed use swords and whips in school .\\n\\n\r\nArmed Girl's Machiavellism is anime based on the manga of same name and is made by LINDElFILMS. Now the studio is known for making some great harem like  Yamada kun and the seven withes but TBH even i am not sure why they would make such anime anime now. The story follows Fudo Nomura, strong delinquent who was expelled from his school for engaging in a fight where he defeated almost 40 people, and now he studies at Private Aichi Symbiosis Academy which is ruled by a group of girls called 'Supreme 5 Swords\" whose mission is to correct out all the boys after the school became co-ed.He is really skilled when it comes to fighting and has a lot of knowledge about various martial art styles. He even has his own orignal technique called \" Magic Bullet\" through which he can defeat almost anyone with just a  single touch. All the members of supreme swords wanted to defeat Nomura but instead ended up defeated and for some reason they all fell for him (don't ask me why).\\n\\n\r\nNow , the protagonist might be the only character who is somewhat bearable in the entire show. Almost every girl presents a pretty bad impression and their is personalities are also unbearable at some points. Rin, who is the leader of the group, fought against Nomura and somehow accidentally ended up kissing him and later on developing a crush on him. Their interaction in the beginning seemed promising but later on she turned out to be violent girl with a tsundere personality. And  introducing girls like tamaba, warabi and tsukuyo just shows how they threw up almost all the generic character tropes in the show without any proper sense.\\n\\n\r\nAnother major character in the show is the Empress also known as Amo. At start of the series she was shown to be the strongest delinquent in the school who even the  supreme swords couldn't handle . She had a extremely violent bitch like personality who would kill anyone for almost no reason. But later it was revealed that she was in love with nomura and was a yandere personality and would kill anyone who would come between them... even Nomura .\\n\\n\r\nNow i would praise the anime for doing a good job when it came to martial arts. They did well in explaining the techniques and  arts used in show and the fights seemed to make some sense. But hey! an anime where even a bear does martial arts.. now that might be something you Have to see.\\n\\n\r\nNow after watching the entire series the only question which came in my mind was.. Just why. Why even create such a thing ? watching this made me feel that the creators were not even sure where they were going with this thing. They just threw up almost everything  that came in their mind with worrying about it making even a bit of sense. There is no memorable character or dialogue whatsoever and most of the characters are almost unbearable to watch. The setting is also nothing special, just a  simple High school where for some reason everything including swords, whips, bears , blades are totally allowed but a boy wanting to enjoy his freedom is not.\\n\\n\r\nNow THB there's nothing much to say about the art . It might as well be the only good thing in the anime. The character design is also pretty generic with nothing to praise or complain about. The sound track is also pretty good, The op Builds up some hype for a good fast paced hardcore action anime.... which unfortunately this  show is not. The battle music is nothing good or original either but fits there anyways.\\n\\n\r\nNow in the end... this show is nothing good . Its not exactly really bad either and you might even find it decent if you are a fan of such kind of shows but I can't bring myself to like this show. There is no originality or even a good plot. The characters are just generic and boring , and their interactions also felt somewhat cheesy and the jokes don't do much either. So I would not really recommend this show to everyone, but you can still watch it to find if it really is all that bad as I said it is. And ya... why are  the swords allowed in the school?\\n\\n",
            "date": "2017-06-21T07:10:00+00:00",
            "helpful_count": 21,
            "mal_id": 250538,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5715004.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Aman_Bhaskar",
                "username": "Aman_Bhaskar"
            },
            "url": "https://myanimelist.net/reviews.php?id=250538"
        },
        {
            "content": "Huh? girls with weapons? ruling over boys? and tsundere characters? meh nothing uncommon right?\r\nits an anime series with quite a lot of \"pain\" and some cute~ moments a pervert like myself can enjoy.\r\ni firstly wrote my review for this anime the day when fourth episode was released, and there was nothing interesting going on by that time.\r\nAfter watching the rest of the episodes i changed both my score and my opinion about it.\r\nHaving almost finished the series i can say that, it has a common \"revenge\" -ish story, which i believe will end in a really silly way.\r\nThe MC is not that typical useless, andscaredy cat pervert that we are used to having in these kind of anime series (THAT DOESN'T MEAN HE IS NOT A PERVERT)\\n\r\nbut he is a gentleman most of the time.\\n\r\nThere is a comedy going on almost every single episode, except the last 2-3 episodes, where things get pretty gloomy and \"dangerous\", the whole series might seem pretty dumb and without any goal at the beginning, but it unfolds slowly with some hints midways giving you a reason our MC is doing what he is doing. \\n\\n\r\nI am pretty sure that you'll enjoy the series to the very end, if you're not too fast to criticize and drop.\\n\r\nits not a serious anime series like for example code geass or anything like that, but it has its own charm like every single anime series right?\\n\\n\r\nArt: I have to say that i am interested in this kind of artwork depending the story and the whole concept  always, its smooth and cute, having some really sweet details also having some female characters drawn really sexy while others might be cute and lolis, in other words i really like it.\\n\\n\r\nEnjoyment: JUST HILARIOUS, there are some really \"stupid\" accidents that make you cry from laugher.\\n\\n\r\nRemember this is just my personal though on this series.\\n\\n\r\nQ:Is it worth watching it???\\n\r\nA:YES!! and if you're also a pervert you'll like it even more ;) have fun!",
            "date": "2017-04-26T12:47:00+00:00",
            "helpful_count": 19,
            "mal_id": 246364,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4197379.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KiritoXxS",
                "username": "KiritoXxS"
            },
            "url": "https://myanimelist.net/reviews.php?id=246364"
        },
        {
            "content": "As much as I've wanted to finally see a guy hits a girl, showing em what gender equality is all about, this anime wasn't really all that satisfying or really all that entertaining tbh. The setting in itself seem to be the most ideal setting for any feminist to wish for, where the school is fully dominated by women with rights to possessed a weapon and physically use it to assault others or cut them without any consequences being done to them (like em police, government, the principal should do something about it); you could also add in the assimilation of femininity, by making allmen turn gay with make up, since this school that was once an all girl school, and most female student saw men as vile, vicious, or a rapey beast.  Aside from showing all the female student's ignorance of men, the pretentious gays in this show look very disturbing, especially that fucking big head dude. And I just dont see any reason to make these kind of disturbing character other than wanting people to shy away from the series. \\n\\n\r\nAll that aside, this is just your typical cliche anime, with many of the anime tropes and setting, filled with women and a legit badass MC; where he gets a harem out of it by dominating them in a fight. Usually it's the other way around where the harem starts before the fight, but this anime go through that process of acquiring em ladies through beating them, where the MC usually show no or very little sexual interest, or having shown any signs hinting of a romance between his harem partners.  Talking about the character, some girls in the show, especially the blonde hair one and the croissant hair looking girl, does give u that cringy-ness being added on to the show. I mean their fucking character imitating or speaking in a very horrible accent of a foreign language and try to pretend one is weebish and cringed just like I said. Plus, the blonde hair girl is just your typical big boob, with a tsundere like personality that usually blurt out stuff that imply that she's actually a very slutty on the inside (well the big boob already kinda give that point across to its viewers). That's not to say that the show is consisted of disturbing and cringy characters, there are some pretty cool ghastly girl who gives off a macabre vibes, cute and adorable lolis, and so on.\\n\\n\r\nThere's not much to the story really aside from a very few flashback screen of our MC's past, or of other character in the show that belong to the member of the five sword, aka, the student council of the school? or just a group of respected girls who control the fucking school I guess. In addition to that, the story progression of this anime is pretty slow, and almost makes you wanted to skip to the part where action and stuff finally gets to happen in the anime. This ofc is not that much of an ordeal, but it just gets boring u know? Excluding all the cute interaction scene, some ecchi that some of u may liked (I definitely dont, I cant handle the tease u know? I would rather watch a hentai), panties shot, awesomely animated fight scene, and so on. But hey, the cliche of people from the five sword people talking when one of their members, or them and a group of their henchmen fighting against the MC, that's actually pretty annoying.\\n\\n\r\nIn conclusion, it's a fun show, it may get boring at times but nevertheless, it's not that bad if you wanna see a different kinda harem story involving men hitting girls, and later have them go after the MC's D at their very own discretion.",
            "date": "2017-05-04T10:33:00+00:00",
            "helpful_count": 16,
            "mal_id": 246945,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=246945"
        },
        {
            "content": "STORY: 3/10\r\nCHARACTER: 4/10\r\nART: 4/10\r\nSOUND: 7/10\r\nENJOYMENT: 8/10\r\nOVERALL: 6/10\r\nThe concept of turning delinquent’s boys into girls in order to be accepted in this school isn’t easy to swallow and it’s unclear how this alarming act of extreme violence is acknowledged by everyone under the name of ‘Peace’. The world building is retarded and extreme to the point where the school finds everything sexually wrong! To think this kind of mentality is drilled into all the students is scary, for who knows what the hell would happen once they spread out in society! The MC gets tortured just because he was in a picture with another naked girl??Where did the girl’s punishment go?? Just cause she’s from the 5 Swords group, she is to be forgiven?? The fact that teenagers are carrying weapons (the 5 main girls are acquitted with real swords!) to physically beat men is not an acceptable premise nor the fact that those 5 main girls are dosed off on hormones and resort to actually killing each other for very stupid reasons! Do remember this show has no Comedy tag so I took it seriously and I didn’t enjoy a lot because the show couldn’t defend these ridiculous claims! So, I just switched off my brain and started watching this anime simply as a ‘Popcorn Flick’ and you know what? I started to have fun, was laughing at the well-timed jokes and all the craziness along with it! I realized you must accept this weird idea to enjoy the anime which worked like a charm! Despite the show’s promise at the beginning, it can’t seem to capitalize on it due to the lack in depth with its story and characters. And the Harem is simply shoved down our throats as every girl falls for the MC, I bought the first girl and was kinda okay with the second one, but the rest were just shoehorned! And they fall for him after he beats them in combat which is also achieved in a corny manner! So where does this anime work then? The answer is Comedy and I’m very surprised as to why this anime has no ‘Comedy’ tag. The jokes and their setups were bold in its execution, a little creative, a tad bit repetitive but they were timely performed. Sadly, the final arc was lazily told, choppy edited and stupidly rushed which leaves a bad taste in your mouth when all is said and done!\\n\\n\r\nNomura (MC) comes off both cool and badass but he’s bland with very senseless and questionable motives that sometimes make him unlikable, no a better word is unrelatable. The work done on his facial expressions were lousy which didn’t help his case either but he’s not your generic clueless MC. Nomura is a hot-headed guy who just wants some peace and will do anything to get his freedom! Aside from him, all the characters are One-Note who have only 1 object on their minds! All the girls start as strong Feminist, but the main female characters slowly change after spending time with the MC. I am not gonna go into details because we have many girls here, but they all generally have some bad trait to them as well as a unique sword fighting style. They are cute sure, but they are also very stupid which makes them annoying, especially Satori and that French (or Spanish) wannabe girl with the wig and that maddening LAUGH!!! Empress is the only character that exhibits potential, but they even spoil her in the end by giving her no depth at all.\\n\\n\r\nThe art is pretty much your average Harem anime style with choppy editing and I had a big problem with the character designs. The girls were well-defined, both in their looks, expressions and attires while Nomura had mediocre overall work done on him! Also, the Voice Actor for Nomura had an annoying voice to him which was a poor choice since the girls came off better in this department as well. The fight styles are a 50-50 to me! On one hand, they were more credible in the sense of being accomplished with pace and rhythm. No one was shouting their Special moves or style out loud, but they rather appeared as text at the bottom. But then the sword play displayed didn’t always look unique, sometimes it felt like they were just swinging around! The OP is nice, and while the soundtrack is nothing beguiling, I totally dig the ED due to its catchy tune.\\n\\n\r\nYet despite all the fighting styles of the girls, Nomura beat them all with either his Special move or come up with some convenient technique which made the show predictable and boring. You would think the rest of the girls could have come up with some way to avoid his Special move but nothing of that sort is even mentioned! And the armour plot here is ludicrous to the point where a character would be get all slashed up and lose lots of blood but the very next day they are completely fine! The one arc which showed capacity was the past of the MC so they saved that till the end to create a finale for the show which sucked because they turned this into a bullshit cliched arc that was rushed and totally ruined the character, Empress for me! The final fight was decent, but the big payoff didn’t work because you aren’t invested in the feelings of the characters nor the story for it to work! How can you when you are given half episode of flashbacks as storytelling! The Comedy seriously saves this anime from a disaster as it kept you entertained for the whole 12 episodes. I am only giving this anime a high rating just cause the Comedy caught me off-guard because the rest is just meh.",
            "date": "2017-10-22T04:20:00+00:00",
            "helpful_count": 11,
            "mal_id": 261392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6421599.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/PakiUSA",
                "username": "PakiUSA"
            },
            "url": "https://myanimelist.net/reviews.php?id=261392"
        },
        {
            "content": "Busou Shoujo Machiavellianism is a very simple, fast show. Unsurprisingly, I don't have much to say about it.\r\nThe premise of a school overtaken by armed girls allows for a lot of crazy things to take place. There's a masculine guy fighting girls, each one with a different weapon and fighting style, there's a girl who has a bear, who he also fights in a sumo match, there's tons of fanservice that is implemented in a way that actually isn't just for the sake of itself, as it attempts to create some comedic situations and even characterize some with the sheer idea that they like towalk around or fight without any clothes. I would say that the reason it works, is because of the main character himself.\\n\\n\r\nHomura is just a guy who wants to go to a normal school, and be a free, cool dude, but isn't allowed to. In order to be free he has to get stamps from all the higher ups in the girls' ranks. Because the school is a correcting facility, he immediately is forced to uphold the law that says all boys will be turned into good citizens by turning them into transvestites (don't ask, I don't know what exactly is that supposed to help with as well. My best shot would be that it makes them lose all of their bravado and make them behave). He refuses, gets in a fight, falls on the girl he was fighting and accidently kisses her.\\n\r\nCue the cliche kissing music.\\n\r\nSoon after all the other members of the \"Supreme Five Swords\" take interest in him and he has to beat them up and get them to act normally so they can give him the stamp. Slowly but surely they all warm up to him, he warms up to them and some drama starts occurring. Homura works well, because there's a lot of other viewpoints showcased bit by bit, he has a cheeky personality and his own, distinct fighting style, not to mention that he is ripped. All of this makes him a good, recognizable MC, doesn't feel like a self-insert at no point. He's characterized well enough. While his presentation feels fairly natural, with the characters Homura fights after the second half of the show, it can feel forced and rushed. The entire deal with the Empress in the last three episodes could symbolize that perfectly. It works, it's explained, but it has absolutely no impact as it feels like just another rushed characterization.\\n\r\nIf I were to talk about the girls and how they behave, I would take away most of the fun from this show. They don't exactly have deep personalities, though some have their reasons, so telling you what they are would get rid of most of the content. The most entertaining part about this show is by far meeting new girls and finding out about their fighting styles, their personalities and their reasons for getting interested in Homura. Once again, those aren't anything deep, but with so many cool, well designed characters, you do have this itch that tells you that you want to know more about them. Besides, you wouldn't need anyone's explanation to know what they're all about, this show doesn't hide it. It's always been very straightforward with their personalities.\\n\\n\r\nThe visuals are fine, but because it is Silver Link after all, they only look okay because the things that are shown need little animation. There aren't many shots where characters actually fight, rather there are ones where they attack, cut into a different camera angle, another attack, another cut, the other person attacks, another camera cut. You can see how this can leave some less than impressive results. That's not to say that there aren't any impressive-looking moments, it's just that the it's really inconsistent. The art style itself is okay, the school is designed properly and there are different places for each fight, the character designs are great and can tell you a lot about their character just by looking at them, just as an example Rin wears half of a devil mask. Isn't that immediately intriguing? The fact that those sort of things get explained as you go is also a huge plus. Another thing that really caught my eye are the clothes and school uniforms. This show has a great sense of fashion, there's a lot of nicely fitting outfits with matching colors. I have to praise them for that.\\n\r\nThe director seems to have had some ideas as to how to present certain moments, there's surely a good amount of thought put into them, especially the mostly well scripted fight scenes, but there are periods of time where everything looks more generic than even it's art style. Not to mention some needlessly cheesy scenes, like the rose petals flying through the air as Homura and his last opponent get up close. It's not this kind of series, it never was, it doesn't fit. The directors tried quite a bit, but it wasn't quite enough. \\n\\n\r\nThe sound is... well... it sure does exist and it sure does its job, but were I say more about anything other than the pretty good and fitting opening and the ending, I would have some hard time. The sounds of metal as it hits Homura and the instances where he uses his Magic Bullet are the only ones that stuck to me, despite there being much more. The silliest one would have to be the bear's voice actress who tries so hard to be mad and loud, but actually sounds frail and weak in each roar. That's not a positive by the way, it's almost pathetic. The soundtrack definitely improves all the scenes to some degree, but the musical directing isn't anything great here, just like the visual directing.\\n\\n\r\nThis is about everything that you need to know about Busou Shoujo Machiavellianism without going into spoilers. If you want to watch it, you should. It's a solid battle series with a good, yet simple cast, gets better the more of them are introduced. It's easy to binge, looks pretty enough and has a lot of cool and dumb moments that should stick with you for a while. It has some solid comedic timing and knows how to script its fights and some casual scenes. Unfortunately this is about all it does and it had some weaker points here and there in terms of its writing, it always swirled around the mediocre to good range, however if you feel like spending some quality time with some quality armed waifus, you should give it a shot.\\n\\n\r\nAs always, this is purely my opinion, I recommend you to develop your own.",
            "date": "2017-06-22T06:04:00+00:00",
            "helpful_count": 8,
            "mal_id": 250638,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5603650.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Werty800",
                "username": "Werty800"
            },
            "url": "https://myanimelist.net/reviews.php?id=250638"
        },
        {
            "content": "Warning possible Spoilers\r\nReading the description of this anime it definitely reminded me of Prison School luckily though this wouldn't be that well known cringefest instead we got something that was actually very entertaining to watch.\r\nThe story centres on Fudou Nomura a delinquent who has been sent to The Private Aichi Symbiosis Academy to be controlled after getting into a fight, but he isn't a pushover and to gain leave from the school he must get a stamp from each of The Supreme Five Swords easier said than done.\r\nNow honestly the story to begin with starts out very simple which is Nomura trying to get astamp from each of the five girls who are part of the The Supreme Five Swords which always ends up with him fighting them and boy are these fights entertaining, overtime as he defeats each girl the next one always being a little stronger and those that get defeated do start to fall for him which makes you think it turns into you're usual cliched harem hell no this doesn't happen here as only two of the girls really fall for him while the others just either help him out or stay in the sidelines.\\n\r\nWhen the final battle happens though it does turn into a love-hate type of thing which didn't ruin the show for me, but it kinda seemed like a meh way to end it even though those final episodes were really intense to watch.\\n\r\nWhen you look at the genres and think hhhmmm somethings missing technically you're right since comedy is also a big factor in this show, but really it is mostly an action show which did surprise in some way because looking at the poster you'd think otherwise, but when I watched it every episode had a big fight which was surprisingly entertaining as not many anime's can be entertaining when it focuses mostly on action yet this one can.\\n\\n\r\nNow aside from the good fights the characters are also what makes this show very good as some these characters really stand out.\\n\r\nFudou Nomura is the male MC and he continues the trend of asshole characters that we have seen a few times lately, but just like those guys he's pretty damn cool and a badass hell he also has morals too as some of the girls do try to taunt him yet he manages to control himself which was a surprise to see and despite having to fight these girls he doesn't hate them afterwards sure he doesn't get along with them, but he does compliment them sometimes and is grateful whenever they help him out in a situation.\\n\r\nRin Onigawara is the first girl Nomura encounters, Rin was one of my favourites of the show because even though she is one of those bossy types she does actually have a nice cute side which was always adorable to see especially in moments where you see her and Nomura connect a little more, sadly though she was paired up with a character that pretty much got on my nerves which sorta hurt Rin's reputation a little.\\n\r\nMary Kikakujou is the second girl Nomura encounters and she is to me the worst character of the group, she has a french background so she prefers a rapier instead of a Katana and despite being the girl with the big oppai she is annoying as hell well not annoying to the extent that I hate, but she was annoying and honestly she didn't really offer much to the table either as everyone else pretty much overshadowed her.\\n\r\nWarabi Hanasaka is the third girl Nomura encountered, she only escapes worse because she actually became friends with Nomura and helped him out a few times, she does have an over eccentric personality often making herself feel like a queen along with having that annoying chuckle her type of characters have which did feel overused at somepoint though luckily she doesn't use it as often once Nomura defeated her plus you won't see her without Kyou-bou who is Warabi's pet bear and fighting buddy who also becomes more friendly with Nomura after fighting him.\\n\r\nSatori Tamaba is the fourth girl Nomura encountered, Satori definitely became another favourite because she is incredibly weird and really devious as she tries to put Nomura in a difficult position at some point, she always speaks in a slow fashion making her seem dimwitted which isn't the case and certainly has a lot less shame compared to the other girls when it comes to fighting.\\n\r\nTsukuyo Inaba is the final member that Nomura encounters and she is actually blind so she relies heavily on her hearing to move around which makes her notice things much quicker compared to the other girls, she is pretty much a Kuudere since she is very quiet and doesn't show much emotion, but she is very powerful and shouldn't be underestimated.\\n\r\nKirukiru Amou is the antagonist of the series and despite not appearing much until the final episodes she is a very cold, ruthless and dangerous person as she uses her own hands much like Nomura as weapons except she uses them like swords and if it weren't for the Academies headmistress she would probably have killed a few people although despite her badass appearance the whole reason why she goes out on a frenzy is because she had a crush on Nomura and she only wanted to be his friend which didn't really go well for her and that seems like a very stupid reason to go around hurting everyone.\\n\\n\r\nNow the artstyle was really good as the choreography of the fights was done well and there didn't seem like any CGI was involved which made it even better, but there really wasn't much else as the characters seemed okay with they're designs, but isn't something I haven't seen before along with the school and other things although you can definitely tell between the differences of living standards for the female and male students.\\n\\n\r\nNow the Action which is the main sauce of the show is really good, enjoyable to watch and last for a good while which is definitely a good thing because I don't want fights that are over in seconds and luckily these fights can drag on for almost an entire episode which shows that the show stays true to it's word.\\n\\n\r\nThere is also some other stuff that isn't in the genres like Comedy which was actually very funny, I liked the chemistry between Nomura and the girls as he usually jokes around with them when usually it's the other way around so it's nice to see a male protagonist getting the advantage over harsh female characters and there are a lot of jokes between the two sides that are really funny, there is also a fair amount of Ecchi/fanservice though not to the extent where it's distracting well except where Satori fights Nomura nude which is something that definitely surprised me, but the other moments like this are spread out very nicely and don't really go much further than that.\\n\\n\r\nOverall this was an entertaining show that could have a season 2, but considering that Nomura achieved his goal I'm very unsure and the way the show ended seemed fine so I'm not sure if this needs a second season, putting that aside this'll definitely be a good show for those fans who are looking for a good action anime.",
            "date": "2017-09-09T11:39:00+00:00",
            "helpful_count": 7,
            "mal_id": 257176,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=257176"
        },
        {
            "content": "Armed Girls Machiavellianism is an anime that certainly improves as it goes along.  Every season, there usually some shows that I change my ratings for throughout their air time, no matter if it's lowering the score or upping it.  This anime anime was certainly one of the cases where I upped my score a little (at least in value, but not overall), but it wasn't until it was almost at the end (after episode 11).  I really liked it despite the aspects that can seem generic, but it felt different.  I'm not going to pretend I'm a critical person here becauseI'm not all that critical most times.  This show felt different and it really drew me into what was happening on screen, but I want you to consider that this is not a review written by a critical person so do not try to star arguments over the review even though I know may people consider it generic; I just want to try to prevent trouble before it starts, even though the chance of it occurring is low, in my mind. \\n\\n\r\nNow at the basic level, the story has nothing more than a trouble making teenager, name Fudo Nomura, who is enrolled at a co ed school, that is completely dominated by females to the point that guys are expected to weir ugly female face masks and that even a group with elite sword skills, the supreme five swords, pretty much run much of the school and are in charge of correcting the males, especially the ones who don't follow the rules.  Surprisingly, it actually becomes a really good story that draws you into what is happening.  It shifts more towards focusing on Fudo earning his stamps on his permission slip so he can leave the academy while following the rules.  It starts off with him simply facing off against different girls in the five swords early on and becomes more entertaining and gripping later, and actually has some nice twists while still not being complicated.  Even though it seems like  a harem at times, it's not and it doesn't go overboard with the harem like scenes.  It becomes really character focused and is quite comedic, and the ending is amazing, considering how the show is.  I'll give the story an 8. \\n\\n\r\nThe art seems different too.  It's not very colorful, but it certainly doesn't feel plain.  Some of the character designs are a little weird, such as with Satori, Rin, and Chouka.  They're not off putting, but the designs for Chouka and Satori do lower the art score a little for me.  The back grounds and actual animation seemed pretty consistent with some occasional drops at the beginning of episodes and a few times in the middle of certain episodes, but it's not that noticeable.  The character designs, backgrounds and animation quality were actually really good or even great as a whole.  The creators did a great job at making sure stuff didn't seem out of place and the times that the quality did drop seemed to be conveying a more serious tone when everything shouldn't be extremely vibrant and overly colorful.  I definitely feel like most of the main designs are really unique, despite some of them being creepy, like with Satori, and the animation quality drops didn't seem like it was just due to laziness.  Since there were some obvious quality drops though and 2 really weird character designs, Satori and Chouka, this category doesn't feel like it has earned a 9 in my book, even though I like the majority of the other designs a lot as well as the majority of the art, but I don't think there are enough problem to totally drop my score that much, so an 8 it is.  \\n\\n\r\nThe soundtrack has some great battle music  and other scores that added to the intensity of scenes really nicely.  Shocking Blue is actually a really good and maybe a great opening, but I'm thinking it's more towards the very good side.  Decide is one of the best ending themes I've heard; it really shows one of the anime's main messages with it's lyrics, which I'd say is that the characters stick with each through thick and thin when they get one another and they're not going to simply someone leave their side without a good reason.   That's my take on it anyway, and it's an unexpected one considering how the girls act towards Fudo early in the story, and how unlikely it is that a school dominated by females would have females that are willing to go through great lengths to keep a guy at their sides (not in the sexual way).  I give the music an 8. \\n\\n\r\nThe character portion is difficult to describe and I'm only actually to describe Fudo Nomura.  Before, I'm asked why I would cut out the rest of main cast from my review, I'll give a simple reason.  Honestly, I find it hard to actually describe the girls in convincing words to people that probably have not watched the show yet, as I think my description would make them sound too generic and uninteresting.  I feel that the female cast,especially, needs to be experienced for yourself to actually determine if you like the cast or not.  I don't feel like my thoughts can be expressed clearly and concisely here and describing them wouldn't reflect my true thoughts.  \\n\\n\r\nNow that I gave my reason, which is longer than I expected it to be, I'll describe Fudo Nomura.  He doesn't come off as a guy who thinks he is superior in every way to the girls he is fighting.  He doesn't seem to hold back in his fights and he doesn't fight to show off his skills.   The final episode explains why he fights in a great, yet very simple way.  He fights to show where he stands, and not just to win.  I think that is actually a great way to fight and it could help prevent you from clouding your judgement with rage and eagerness to win;  I'd rather win of course, myself, but I find it to be a great way to approach a fight still.  He interacts well with all the girls too despite his attitude about sticking to his ground and not agreeing to submission, very easily, when it even happens.  I find him to be a great mix between a capable main character and one that is viewed as weak.  He's not the best fighter and doesn't easily win fights without putting in effort like some characters, but he's not helpless either, and he certainly is capable of holding his own in martial arts based fight, which the type of fights seen int he anime.  I give the characters another 8.  It's not the best cast, but it's still a really good cast with a great main character.\\n\\n\r\nMy enjoyment score is a 9  I always really enjoyed the anime, but I started to like it more and more gradually and the amazing ending for the way show is and everything else that happens throughout the last two episodes brought up my enjoyment score a bit drastically from the lower 8 range up to my current 9.  It's a show that surprised me and surpassed my initial expectations.\\n\\n\r\nI hope more people watch the show and like it.  It doesn't feel generic like many people think.\\n\\n",
            "date": "2017-06-22T17:35:00+00:00",
            "helpful_count": 6,
            "mal_id": 250703,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5520188.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AobaSuzukaze",
                "username": "AobaSuzukaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=250703"
        },
        {
            "content": "I've been here on MAL since 2012 I think and this is the first time im writing a review\r\nbecause this anime deserves it, if trough a review I can get at least one person to watch this underrated masterpiece then Im happy.\r\nOk, lets go\r\nThe story begins at an all girls school that just become CO-ED mostly girls are feminists , the boys who entered the school out of fear were forced to dress and act like girls, except for our MC who fought back, and instead of just plainly defeating them (which would be boring) he made friends whith them , he earned their trust, and his prupose is to get their seals so he can leave school grounds (they are not permitted to leave until graduation) . Also theres one major antagonist who seems to have a past with the MC and she will likely be the last boss of the series.\\n\r\nWhat was supposed to be a harem / ecchi filled boring shounem anime because of its cute and well developed charaters , the fierce battles , the intense dialogue and the good animation quality and ost  becomes maybe the AOTS.. altough the show is not over yet i get the feeling that the conclusion will live to expectations. I started this show out of the blue.. simply to kill my free time when I get home from work. And now its the show im most looking foward to watch. \\n\r\nAlso, the explanations during the battles, the author created very coherent techniques , fighting styles and made it in a way easy to understand .. they just dont pull out random shit like in Mahouka for example and because of this when someone wins or loses a battle you agree with everything that happened , you're left with ways of imagining the upcoming course of the show because its logic are solid and coherent. Give Busou Shoujo a try. You wont regret it.",
            "date": "2017-06-08T17:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 249535,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1272231.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/dReams-C",
                "username": "dReams-C"
            },
            "url": "https://myanimelist.net/reviews.php?id=249535"
        },
        {
            "content": "This anime might seem same as any other harem anime, but the plot and the whole summary is actually pretty different. As we all know the main character is a transfer student and his new school has some weird rules where they force males to dress and act like a girl, but he refuses. Shojo part of the anime isn't bad either, character development as for the main character is pretty good but doesn't cover other supporting characters, well that's because anime itself is pretty short. Art is pretty solid and the sound isn't bad either. I gave it 10/10, yes it is a haremanime but it also has a unique plot and if nothing it's pretty funny. So if you're not a huge fan of harem anime, watch this one just to laugh a bit.",
            "date": "2017-11-22T01:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 263742,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6545861.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/UnknownWriter",
                "username": "UnknownWriter"
            },
            "url": "https://myanimelist.net/reviews.php?id=263742"
        },
        {
            "content": "Machiavellianism is an anime that everyone saw like billion times in their lifetime, or is it?\r\nWhen I first saw the title and the concept art, I cannot help but feel repelled, as many mediocre shows immediately got in my mind, and I thought I had better things to do (like preparing my exams). But then recently, a guy called LexBurner made a video on this anime and portrayed it as more of an interesting attempt of following Kill la Kill (which I haven't watched, but will eventually after my exams).  This pepped my interest, and with Lex's description, I've decided to give it ago.\\n\\n\r\nHoly **** this is enjoyable.\\n\\n\r\nFirst of all, aside from the mc, everyone is in some way as generic as it gets. You can tell by their designs which type of characters they are. The fun thing is that, at least in my opinion, the fact that they don't even hide it and use that trait exclusively makes it so much more fun to watch than those anime who try to pretend that their characters aren't generic. The mc, on the other hand, although not the most interesting character ever (I would attribute that to Okabe Rintarou), is entertaining to watch.\\n\\n\r\nOverall for the character, a solid 7\\n\\n\r\nRegarding the story, nothing happened aside from setting the scenes and characters in the first season through individual arcs. What I would say is that they are sometimes hilarious and in most cases not offensively stupid (not that it does not happen, don't get me wrong)\\n\\n\r\nMediocre 5.5 (rounded up to 6, I'm not that picky)\\n\\n\r\nArt and music:\\n\\n\r\nSubjective feelings, don't have anything to comment on\\n\\n\r\nFor the enjoyment, WTF is this enjoyable. The most obvious element to this high score is our MC, his reactions to stuff happening around are genuinely interesting, which could be best shown through how he held back not touching the boobs even though his face shows that he obviously wants to. Another aspect is how the show will throw you off guard by going out of their way to do some stupidly hilarious yet not offensive stuff.\\n\\n\r\nFor those who want serious plots, characters and themes like Steins;Gate, you're at the wrong place. For those who want to have a laugh to relieve stress, this might be what you want (as comedy is subjective)\\n\\n\r\nOverall a strong 7/10",
            "date": "2018-01-03T07:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 267287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5344319.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hiroto124",
                "username": "Hiroto124"
            },
            "url": "https://myanimelist.net/reviews.php?id=267287"
        },
        {
            "content": "TL;DR Section at the end of the review. This review may or may not contain minor spoilers.\r\nBusou Shoujo Machiavellianism (referred to as BSM from here on out) is surprisingly enough not a show about Machiavelli, but of a student named Nomura. Nomura has transferred into a formerly all girls school, but is now what is essentially a correctional facility. Either you be corrected into being a drag queen, or you get stabbed by some girls. Interesting story, right?\r\nWhile BSM is at the end of the day just another one of your action/harem shows, it's enjoyable enough. Nomura's \"I give zero fucks\" attitude is refreshing comparedto the \"I'm dumb as hell and can't figure out 6 girls like me\" harem MC. From day one at school, he's already getting attacked in the form of being corrected by Rin, the first of six harem girls. Of course, Nomura ends up showing his badass-ness and wins the battle... and ends up kissing her due to a sidekick hitting him which forced the kiss situation. *sigh*\\n\\n\r\nOn the other hand, you have a pure french girl who secretly wants to be dominated, an emotionless but insanely cute girl who while is okay with being nude herself whilst fighting, can't focus if the male MC is at the same time. Following up is a girl who owns bears for a living (bonus point for being the \"Kyohohohoho\" of the season), an insanely dangerous loli, and the main antagonist Amou. Amou was made to be this untouchable godlike fighter, but of course falls to Nomura's badass tactics in what started as a somewhat interesting fight that inevitably degraded into a match of fisticuffs. Excellent. Did I mention that Amou secretly wanted Nomura['s dick] super badly?\\n\\n\r\nHardly worth mentioning, but Silver Link. gave us some nice animation and art, along with some rather okay music. The OP is insanely fun to listen to for the first 15 seconds.\\n\\n\r\nTL;DR: BSM is another action/harem show but is surprisingly enjoyable due to the MC's \"not giving a fuck\" attitude. The nonsensical way the fights play out are fun to watch, as well as playing \"best girl of the show\" simulator (it's Satori, by the way). Overall, a fun watch even if it does get boring from time to time.",
            "date": "2017-06-30T19:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 251595,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5078535.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/deathline",
                "username": "deathline"
            },
            "url": "https://myanimelist.net/reviews.php?id=251595"
        },
        {
            "content": "Spoiler free review\r\nI welcome feedback on my reviews\r\nHello and welcome to Private Aichi Symbiosis Academy. We're a boarding school that helps delinquents such as yourself correct your ways and build a brighter future. Now our ways of rehabilitation are a bit different from your usual school. A group of 5 girls, known as the Supreme Five Swords, oversee everything that goes on here. All students are permitted to a baton to protect themselves from boys such as you, with the higher ranked students given more capable defensive measures. Oh yeah, I forgot to mention the most important detail. You need to crossdress or we'll stabyou.\\n\\n\r\nArmed Girl's Machiavellism is about Fudou Nomura, the next kid on the chopping block for our weapon wielding students. Well, that was the plan, but he proved to be a little too much for them to handle. Soon, Nomura finds out he needs to acquire stamps from each of the Supreme Five Swords if he wants to have some freedom around his new stomping ground. So, he decides to go get them the best way he knows how. Brawling. The story seems interesting at first with its 1v1 showdowns, until it devolves into a simple harem creator. Defeat them, they respect you and usually fall in love with you. Throw in some mediocre comedy that can either have you slightly chuckling or groaning in disappointment, and it just doesn't give you much to like about it. With the word Machiavellism in the title, you expect perhaps a few mind games or betrayals to spice things up, but it doesn't seem to appear anywhere in the show. Just an expectation that ends up falling short.\\n\\n\r\nThe main focus of the show is obviously the action as Nomura faces off against opponent after opponent, but it doesn't really do it well. Either it's repetitive and predictable, with Nomura's Magic Bullet defeating them left and right, or it's mixed in with some annoying dialogue and pop-ups explaining the different styles of fighting techniques shown in the anime, ruining the flow of the scenes instead of being informative. The animation is also quite shoddy, lowering the quality of the already lacklustre fights. You do get a few action scenes that feel pretty decent, but it just fails to keep its consistency across the show.\\n\\n\r\nThe characters are interesting at first, I have to say that at least. Nomura is a pretty good main looking at his carefree personality and interactions with other characters, and the Supreme Five Swords and other recurring individuals have their own little quirks that make them quite likeable. The way some of them talk, bringing in other languages into their speech pattern, feels like an incredibly forced attempt at ethnicity, but it's tolerable most of the time. Some tragic backstories are also mentioned but not really explored, as if they were just trying to add some depth into their cast but decided to give up halfway. Then they start bringing up love and friendship. Again, how is this got anything to do with Machiavellism? It feels like the show had very little idea of where it wanted to take its characters, so they end up trying different things to try and figure things out.\\n\\n\r\nArmed Girl's Machiavellism has potential, but like plenty other shows before it, it fails to do anything special with what it has. It was slightly entertaining at times, but the negatives outweighed the little positives this anime had. There are probably a lot of people that could derive some type of enjoyment out of this, but sadly I cannot recommend this show to anyone. You're better off finding something else to sink your hand- I mean teeth into.",
            "date": "2017-06-22T01:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 250628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6011085.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/EnZanity",
                "username": "EnZanity"
            },
            "url": "https://myanimelist.net/reviews.php?id=250628"
        },
        {
            "content": "Prevailing any plots can be skeptical but that's not the point,\r\nEven The story are involves where every girls can depend themselves through trouble by going all around devastating the not so routine gimmick to serious targeting the prey within glory.\r\nIf you can tell the the whole pointless of the story? because it's plain and generic (Heck I'm also agree in my statement) well it's not\r\nPointing out The scenarios are clear, setbacks can interior every spaces,\r\nand a co-ed school filled with dangerous group council.\r\nHuge Point :\r\nAwaiting the last standing of a rival you dare to defeat, through ages\r\nAny flashbacks are within possible good even though it'squite episodic if you compare every episodes.\\n\\n\r\nMisconcepts :\\n\\n\r\n(All \"Unrelated fight scenes to Goofing off session about girl related stuff )\\n\r\n-That's the whole point-\\n\\n\r\nDon't be bother about any scenarios which irrelevant, as long as the story began to serious in the meantime.\\n\\n\r\nTotally a worth watch",
            "date": "2017-06-07T04:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 249432,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6174494.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/-HippySnob-",
                "username": "-HippySnob-"
            },
            "url": "https://myanimelist.net/reviews.php?id=249432"
        },
        {
            "content": "The most disappointing aspect of this series isn't that it's bland, it isn't the recycled cliches, it isn't the entirely recycled plot from literally any other light novel action harem. \r\nNo, the most disappointing thing, for me, is that this show could have been so much more.\r\nIf there's a single positive to this series, it's that it is fairly unique on a surface level. At least for light novel harems, having it set in a school without magic is actually quite rare, so much so that nothing else comes to mind. \r\nBut while there are no magic abilities, which in theory should open up alot more creativity on the part of the author (which sounds strange now that I think about it, but it says a lot about the current state of anime), the author instead goes for the most traditional, by the book route of creating abilities. \\n\\n\r\nThe main character has a special item that lets him negate other people's attacks, yawn. It's the same thing that's been done over and over again. \\n\\n\r\nMy biggest problem with this series is just that, why have no magic even though you're using the same exact ability tropes as any other magical high school anime?\\n\\n\r\nEverything from the character abilities, to the relationships, to the arc structure, to the character writing, to the sound design, to the shot composition, EVERYTHING feels extremely standard and boring, almost as if it's one of the many mass produced anime nowadays meant only to sell merchandise. \\n\\n\r\nEven with all I've said, if you enjoy stupid battle high school harems either for the mindless fun, the T&A, the blushes, or whatever you fancy these kinds of shows for, it's everything you would enjoy in that type of show, and there's nothing wrong with enjoying some stupid fun. \\n\\n\r\nThere's certainly a crowd that enjoys these kinds of shows and there's absolutely nothing wrong with that. I would be lying if I said that I haven't enjoyed my fair share of these kinds of shows. \\n\\n\r\nIf you want a more full-bodied experience with a show similar to this, Chivalry of a Failed Knight one of the best in the genre.",
            "date": "2018-05-14T21:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 280591,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3299155.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Vyxria",
                "username": "Vyxria"
            },
            "url": "https://myanimelist.net/reviews.php?id=280591"
        },
        {
            "content": "This anime is  decent anime you can watch especially if you like school based anime with fighting and cute girls. The story does not get too deep as it is purely focused around the fighting and the struggle of the main character. In my opinion it is a nice anime to watch and the only reason someone would say that it is crap is because they hate themselves inside and want to ruin the lives of everyone around them. The characters are nice and while you do not learn a lot about them it is fine since that is not the point of thisanime. This anime is meant to be a simple story without too much depth and i find animes like this nice to watch every once in a while.",
            "date": "2017-09-20T22:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 258194,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/168535.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RasenRyuu",
                "username": "RasenRyuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=258194"
        },
        {
            "content": "In short note:\r\nBattle Comedy Harem School. You know, the usual shit.\r\nStory: 6\r\nUsual school setting, with MC being surrounded by girls and \"girls\". MC starts as a transfer student, and works up his position as he conquers one girl after another. Episodic pacing with a new foe appearing on every episode, which ends with one goal, defeating the final boss. At least it has commentaries on martial art and sword-style on every battle scene.\r\nArt: 7\r\nHeroines design was fine, but MC design a bit derpy, and the \"girls\" too, I suppose it was intentional so the Heroines will look much better. The battle scene and the blademovement were fluid, so this one may pass as a battle show. The only downer is that MC finishing move animation that keep getting used every single episode. I guess it can't be avoided, with this episodic structure something will get used again for several times.\\n\\n\r\nSound: 6\\n\r\nStandard bgm during fights and daily live scenes, Op-Ed was ok. Overall, not that noteworthy. \\n\\n\r\nCharacter: 9\\n\r\nThis is a very common genre, with a lot of characters appear on a single show. Many characters appear in them are so bland and forgetful like overused templates. But in this show at least, they are not. Since it has episodic structure, every heroine only have 1 episode focusing on them save the last boss. But even so, the uniqueness of the character stick to the very end of the show. Something that somehow rare in shows with this kind of genre. And the MC is not that wimpy either. Again, something that somewhat rare.\\n\\n\r\nEnjoyment: 7\\n\r\nThe battle scene alone is something to look forward for every episode. And the character uniqueness won't make you get bored with daily life scene.\\n\\n\r\nOverall: 7\\n\r\nThe usual shit genre with some unique Characters and decent fight scenes. Worthy to be watched once at least.\\n",
            "date": "2017-08-02T09:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 254497,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4671138.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NickSpringfield",
                "username": "NickSpringfield"
            },
            "url": "https://myanimelist.net/reviews.php?id=254497"
        }
    ],
    [
        {
            "content": "Let me tell you a Story, a Story of a man that gets into a high school, just to find out that this school is ruled by \"feminism\". that school was once a female school. But then they decided to open it to male population. but guess what? the nation of \"feminism\" stroke down, and the whole school turned all their male students into females boys in order to make the girls feel \"safe\"\r\nTL;DR: Overall Section\r\nif by this point you don't spot any red flags dancing around your mind, then you should stop reading (btw, if you are going to get salty, avoid my profileand grow up, after all this is my opinion). but if you feel that the whole Idea is ridiculous then keep reading. be aware of spoilers\\n\\n\r\nStory 2/10:\\n\\n\r\nStory, story... What story? all we got is that Nomura got transferred into another school just to find out that the school is full on whimsical girls that for whatever reason have a problem against all men (\"feminism\"), and the school rules consist on turning boys into girls so they can get all along. (then what is the point of even including males into it?)\\n\\n\r\nNomura just wanted to chill on his new school, but apparently if he doesn't agree with the shitty rules that the school has, he is forced to a fight against the \"5 swords\" or any other girl that has something against men. the whole argument of this show is a convenient plot device that serves purpose as how idiotic the high school rules can be and how low the girls fall on this show. then, if our MC wants to chill he has to defeat all the 5 swords and get a \"pass\" to leave the school.\\n\\n\r\n*spoiler section*\\n\\n\r\nsometimes we get some of the past of Nomura, he constantly remembers one of his \"friends\" that he used to hang out with... sadly the pure essence of a Yandere awakened on that friend and decided to beat the fuck out of him... guess what happens next? \\n\\n\r\n*End of spoiler section*\\n\\n\r\nArt 5/10:\\n\\n\r\nYour average budget for a generic setting, it was nice to see some attacks coming from some fights, as for fan service, it was a relieving distraction for the pain this show is\\n\\n\r\nSound 5/10:\\n\\n\r\nI always wonder why good sounding OPs are to be found in generic anime, is a total waste, but it accomplishes as a relieving distraction. I don't find anything really outstanding, so overall is okay\\n\\n\r\nCharacter 2/10:\\n\\n\r\nAside of how strong the feminism essence is on the girls, they are also a bunch of generic annoying girls. if you have seen this setting before, its almost obvious that every girl eventually will like the MC. well this time is more in a masochist way, they all start liking the MC after all of them received a beatdown (a really relieving beatdown I must say) so lets give them some points for showing us another way to get a Harem.\\n\\n\r\nI don't really have a problem with anime girls overall, unless they are a bunch of useless airheads (Chitanda from Hyouka for example), but this show went too far making almost every girl annoying in a way. and I'm talking about that green haired girl that gets on my nerves each time that she appears, I don't know how people do like her, but I haven't seen someone that annoying. I actually wanted her to suffer a lot, (gladly she did, and it was extremely relieving) aside of the 99% of annoying girls, there is 1% that is quite acceptable, there goes Onigawara, and the Bear girl with the HIO HIO HIO laugh, but nothing more.\\n\\n\r\n*Spoiler section\\n\\n\r\nOh yes, Give Nomura some credit for defending the male population, it was really relieving seeing how he succeeded against the  girls beating them down one by one\\n\\n\r\n*End of spoiler Section... actually it was obvious that he would most likely to succeed*\\n\\n\\n\r\nEnjoyment 5/10: \\n\\n\r\nEnjoying this show is like watching a fight on the street between someone you don't know, against someone you dislike so much, the relieving factor of seeing how that someone you don't like get beat down so hard makes you feel extremely relieved. if it were because of how Nomura beats down each girl and saves male population of becoming female boys, I would have rated this higher than 8. Sadly the \"blood bath\" ending I wanted didn't happened. not even the final moment with Onigawara. Everything turned into a cliché and bullshit plot device around Amou that no one asked (Like hey, lets make a past for the MC but lets never touch it until the very end so we create a really convenient finale). well, at least I didn't ask for it, that should be more accurate if the ones reading this are burning their salt into really high temperature ready to burst against me...\\n\\n\r\nOverall 3,8/10:\\n\\n\r\nTL;DR: school transfer ends wrong, girls trying to punish a male because he is a male that won't become a female, he fights against school rules, saving all the males from becoming females, he creates a harem, and a plot convenience comes to claim him as her unrequited love from the past because jealousy",
            "date": "2017-06-21T13:55:00+00:00",
            "helpful_count": 121,
            "mal_id": 250568,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5202766.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/HereticHunter",
                "username": "HereticHunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=250568"
        },
        {
            "content": "Busou was a very interesting show. Its one that people didn't really expect much out of and in the end they got...a bit more of what they actually expected. So yeah. I suppose you can say it just did...good. But that's not what you're here for. You're wondering WHY it did good.\r\nThe show is a pretty good representation of if you want to take basic tropes at least make it interesting considering how many times we've seen a short-running manga turned into a simple 1-cour show. Hell, it's undeniable to say there isn't one almost every single season. They're everywhere. Because it isn't that hardto gush out 12 episodes of blatant advertisement of,\"Hey. You liked this? Go buy the manga now there's more of it coming sooner than you think.\"\\n\\n\r\nBusou manages to...make it interesting and worthwhile though. Odd, yet interesting. I will not say my time watching Busou was wasted. Hell, I really enjoyed it. \\n\\n\r\nThe main strength of Busou definitely comes from its odd plot and the main character himself. A school designed for females but has a male population. The thing is though the male population was sent and forced into oppression to the point were some of them undergo and make themselves into a \"girl\" because of being pushed so far into a corner. All the while being watched over a council of five girls with swords who can fight pretty damn well with said swords. Weird? Yeah. But don't lose me now it actually gets better going forward.\\n\\n\r\nThe whole underlying element of toppling oppression is completely evident in Busou. If you wanted to easily break this show down to someone you can easily just say,\"Some kickass guy runs into an oppressive school and dismantles the entire thing.\" Because quite frankly that truly what the show is all about\\n\\n\r\nEnter Nomura. Sent into the school after getting expelled from his last one. They thought they could use this school to completely break Nomura considering the reputation is has. Boy were they wrong. He goes in there headstrong and just..breaks it down. He let nothing stop him. His determination for freedom and his hot-headed yet intellectual personality makes him a compelling character. If there's one thing Busou did well it is having an actual interesting main character.\\n\\n\r\nBut on the other hand its weakness will also be the characters as well. Yes. We have cute girls who have swords and rule over a school. Yeah that's cool. They tell us backstory of each character. Yeah thats cool. But it'll be completely evident when when you're done watching this 1-cour you'll completely forget about Rin and Warabi within week's due. They're not memorable characters as much as Nomura was. It can't be said for the lack of screen time either. Because they all got their respectable amount. Its simply due because they were made in a way that their really isn't too much compelling about them to even remember their name after you're done watching it. Only Nomura carries that charm within his character strong enough for me to actually remember his name after weeks past.\\n\\n\r\nBut, whilst the characterization is weak...we also have another good. The action. Nomura determination for freedom is evident yes. But how does he get freedom exactly? Well, he has to collect five stamps from the girls I was talking to you about. Sounds simple, right? What does he have to do ace tests or whatever? Nay.\\n\\n\r\nGotta fucking fight for them. Enter Busou's next strong point. It had engaging action scenes to me. They weren't stellar believe me. This is coming from someone who'd rarely point out Art and Sound is his reviews though. But it doesn't take a keen eye to realize while yes, more time was spent making the action scenes look good. They still weren't stellar or amazing. But that doesn't deter from the flair they carry. It was fast and intense.  It kept moving at a rhythm. You can tell the character were trying to read each other and make moves to counter them. One of the best things about them is how characters don't shout out,\"Twin Katana Wind-blast!\" But instead it appears on our screen as their doing it. It feels more realistic in that nature that we just don't hear people screaming out their moves and then doing it. Instead they duke it out whilst we know what they're doing and the characters themselves have to figure out what moves their opponent is doing and the best way to fight against that.\\n\\n\r\nThe rhythm, nice flow, and overall simplistic yet engaging action scenes made them felt good and alive.  Take these and pair it with Busou's great way of making stuff feel more gritter(especially in the last 4 episodes) made it overall great.\\n\\n\r\nIn conclusion: Busou wasn't anything amazing. Choppy animation, subpar characterization, adapting a short-running manga, generic tags and plot-armor is sometimes extremely evident. But still, it did more right than wrong. It wasn't amazing. But it was entertaining and really in the end: That is all that matters.\\n\\n\\n\\n\\n",
            "date": "2017-06-21T21:21:00+00:00",
            "helpful_count": 56,
            "mal_id": 250616,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3319699.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Valiastrix",
                "username": "Valiastrix"
            },
            "url": "https://myanimelist.net/reviews.php?id=250616"
        },
        {
            "content": "Busou Shoujo Machiavellianism in other term, THE SCHOOL OF FEMINISM. \r\nThis show is more like a empowerment for women against all guys.\r\nThis show is like a Hardcore feminism where women can actually hurt any man. But what I like about this show is that it contradicts the prejudice of every women. That not all men are enemies, and not all men are pervents. The story isn't that marvelous, but it gives justice to every man in the school. It's like winning their trust show, and you'll gonna like it. Unlike Prison School, if you're familiar with it, this show is more like showing the goodside and clarifying the misunderstanding between men and women that they can co-exist to one another without any barrier. I like the development actually. If you are a man, you'll gonna root for the Main male character, but if you are a women, you'll be triggered because it's like they're protraying that despite how strong women are, women are fragile with their feelings, and they need the D afterall. If you know what I mean.",
            "date": "2017-05-10T14:08:00+00:00",
            "helpful_count": 23,
            "mal_id": 247391,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2028517.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/coffeeworld",
                "username": "coffeeworld"
            },
            "url": "https://myanimelist.net/reviews.php?id=247391"
        },
        {
            "content": "If I had to describe studio Silverlink in one word, that word would be ''mediocre''.  They're perhaps the most \"okay\" studio working in the industry today and none of their shows I would consider being all that good, with the exception of a couple maybe, but, even then, those exceptions are still nothing all too remarkable. They always make shows that sound good on paper, and, when read, sound like they could be good shows, but they usually lack the creative talents and efforts to carry this through and their shows always just end up feeling either downright terrible or just \"meh\" for lackof a better term. Nowhere is this more evident than with their latest title, Busou Shoujo Machiavellianism, which, with a narrative and idea this silly, could have made for a good rule of cool show if it had more energy put into its animation, but it feels, like most of their work, that they wanted to create something really cool and cinematic looking, but didn't have the necessary talent or creative force to do so. Despite being a relatively fun show none the less, the anime needed much more charisma in order to carry itself along for the entire duration and the shows just falls short of reaching that rule-of-cool aesthetic and vibe it was so clearly aiming for. In that regard, the show feels very much like a previous Silverlink show, Chivalry of a Failed Knight, which, despite being vastly greater than most other light novel adaptations and is all around a decent show, also falls just short from being good due the studio's general lack of creativity in visuals, while, at the same time, having a decent script with decent characters, something that Busou also carries on as well. Either way, let's dive into this insane, nutty show!\\n\\n\r\nBusou's narrative as a whole is one that is incredibly linear and straightforward. The show will not surprise you with any grand plot twists nor does it bring anything new to the table either, and it doesn't really have much direction. What I mean by that is that the characters don't really have anything in the way of a 'goal' or a motivation in the narrative, other than the main character wanting to collect five stamps from a group of five girls, all of whom carry swords. Oh, did I forget to mention that? Yes, for some reason, the school has allowed each one of the girls to carry a weapon due to the once all girl's school, becoming co-ed, allowing boys to join and, out of fear, request to carry said weapons as a means of protecting themselves. These weapons range anywhere from a sword to a whip to even a giant, damn bear! This aspect of the show is incredibly stupid, but the show as a whole is so tongue in cheek and takes itself so lightly that this aspect feels like a part of the world that is presented to us and doesn't feel all too jarring or even strange. Since the show doesn't take itself so seriously and more so laughs at its ridiculous setup, I can excuse this obvious dumb stuff. Due to each one of the girl's weapons, and general scary nature, the boys who do attend this school are put to humiliation and are forced to wear girl's clothing as a way to blend in with the school.  Enter our main character, a cocky, bad-ass asshole, by the name of Nomura, who goes against the demands of the girl's at the school, and the rest of the show sees him fight against five girls, who are called the Five Swords, a group who are the strongest, and most skilled with the sword, who go around correcting problematic students and the such. And that's about it for an overall plot, but the show carries this narrative with such a silly over the top atmosphere and tone, that I find it a lot of fun to watch the battles carry out and the characters feel dynamic and interesting enough in personality to carry the weight of the show.\\n\\n\r\nThe anime is incredibly dumb and stupid in a lot of ways, from sumo wrestling a giant bear to the plethora of various battles and fights, but, at the same time, the show also feels self-aware enough to know that the entire thing is incredibly dumb, and fully embraces all of it. Whenever the characters are in battle, bold white text will appear on the screen showcasing the name of their attacks, akin to something like Kill la Kill, with plenty of close-up shots of the characters reacting to certain events while they gasp. Both of these elements help to sell the show's rule of cool vibe it is aiming for and helps to make it fun and fairly entertaining for me personally. However, there are some moments in the show that I feel are a little too stupid for its own good. One such example is when the main character is attempting to hide behind a bear, a pet of one of the members of the Five Swords, which also happens to be female, as he accidentally touches her breasts. Instead of being funny, which is what I believe the writer was attempting, it just comes across as being strange, jarring and uncomfortable to watch as well.  Another example that may put some people off is when he fights one of the girls naked in the bathing areas. It can be distracting, and some may even consider tasteless, but I found the fight fun enough to carry the scene, and the nakedness of the girl is part of her tactic for winning the fight and adds on a little bit of characterisation for her character. Some other criticisms about the show may stem from the amount of blood and edge the show does try and convey, especially near the end, and I can understand why. It can seem kind of jarring to go from simply hi-jinks to a complete bloodbath as shown in episode ten, but, on the flip side, at the very least it provides some narrative stakes for the final fight and makes the villain out to be much more menacing and threatening too. The use of blood never really came across to me as being forced since it at least made sense in the context of the battles since all of the characters were using razor sharp blades. Another troupe that I wasn't too fond of, is that two of the girls fall in love with our main character and end up acting catty and bitchy to each other as they fight over him. I've always disliked this in anime since it reduces the female characters as nothing more than petty women, but here it didn't feel as bad as what I have seen before, and for the most part, there is an actual reason why these girls have fallen for this guy, as opposed to them simply wanting the main guy's dick just because the plot demands them to. This doesn't make this element any better, just a little bit more bearable in the long run.\\n\\n\r\nI was honestly surprised at how much I enjoyed the show and found myself actually excited and immersed during the action scenes, especially during the final fight. The series is so over the top and so dumb that I believe it does work from an entertainment standpoint alone, and while I wouldn't consider the entire narrative and characters to be terrible, it certainly needed a lot more work to make the show good.\\n\\n\r\nEach one of the characters has a stupid obvious gimmick whether that be in design or personality, but, at the very least, many of the characters at least have some depth, no matter how little granted, to make them feel a little more like actual people than bland archetypes. The main lead, Mamoru is essentially a better version of Glenn from Akashic Records, in that he is far more consistent and does the whole bad-ass cocky bastard rather well. I genuinely liked this character, and his back-story, unlike Glenn didn't feel as if it were included just for the sake of evoking cheap emotion from the audience, despite how generic and by the numbers this back-story actually is and how little of it we actually get to learn. A character like this holds up well for a silly narrative since he simply a lot of fun to watch and complements the silly nature of the show, although I wouldn't call his character good by any stretch. He fills his purpose fairly well, has some decent comedic moments and is a fine character. Rin's character has a massive hatred of men and wears a death god mask over half of her face since her mother called her ugly when she was a child and made her wear a mask over her face at all times when she went out with her. This back-story is quite dumb and rather, again, silly, but at the very least it provides an explanation into why this character acts the way that she does and the purpose behind her mask, rather than it remain a silly gimmick like those presented in Hand Shakers for example. Mary was a lot more generic than these two previously mentioned since we barely learn anything about her past and just assumes the \"girl with big boobs\" role while also carrying around a dictionary since she is Le François. She can be pretty annoying due to her attitude and general stuck-up-edness (that's not a word, I know) but otherwise, she is pretty forgettable. One of my favourite characters in the show is Satori, not only for how well her voice actress conveys her messed up mentality and rather sadistic sword fighting but because there was a decently executed plot twist in episode nine. It's not something to blow your mind, but I felt it was a decent twist none the less, and I did enjoy every scene she was in. While she doesn't necessarily see much development (as does the rest of the cast) she still gets some decent characterisation. The other two members of the Five Swords,  Warabi and Tsukyo, were also likeable, and Tsukyou especially manages to pull off the strong swordsman character rather effectively, and that's one thing I can praise the show for. The main character, while very strong, still isn't able to blow through all of the girls with ease and finds himself cornered more often than not, having to think up some clever way to win. While this isn't on the same level of tactical fights I've seen in some other shows, it at the very least, creates some narrative tension and stakes and makes the girl characters feel more like fighters than in your typical light novel series where the girls are all presented as being weak without the help of the boring male self-insert character. The final villain was decently executed and I felt a genuine sent of excitement seeing the main character and her fight in the final episodes, with a decently explored back-story explaining their rivalry and the reason why it spawned in the first place giving more weight to the scene. The character interactions were fine but often the dialogue feels very simple and trite, with two characters just yelling how great they are, and sometimes the comedy between certain characters could fall flat on its face. \\n\\n\r\nThe animation consistency was fairly good with a lot of character movement and attacks but the art consistency took a large hit as a result of this. It's good enough in conveying the action on screen and some moments can look downright great, but overall it's just fine. I liked the character designs themselves and the general colour design too, and the opening is catchy as hell! While in terms of visuals, it's just a bunch of random fights, each one flows into each other fairly well. The music is fine and does its job but is ultimately rather forgettable once you've finished watching the show; nothing all too remarkable aside from the opening and ending tracks. Overall, I believe this anime did achieve what it set out to do to a certain extent. While it is an overall decent show, I would be lying if I said that I didn't have fun watching this show and I would recommend this anime for anyone looking for a dumb, easy ride, although I doubt this show will be remembered in a few months.\\n\\n\\n",
            "date": "2017-06-21T23:15:00+00:00",
            "helpful_count": 21,
            "mal_id": 250621,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3420421.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LIQfilms",
                "username": "LIQfilms"
            },
            "url": "https://myanimelist.net/reviews.php?id=250621"
        },
        {
            "content": "Let me tell you all a story.. \" once there was a delinquent boy.. who got expelled from school and had to join a new school which was being dominated by girls and they all wanted to straighten him up but ended up falling for him... THE END\". Ever heard of something like this.. ya i know . So this pretty much sums up the entire anime and almost  very other harem anime nowadays.This show here is nothing but a sorry excuse of a harem anime with almost no originality and is full of shitty cliches that would make no sense. You would ratherwonder about why are the children even allowed use swords and whips in school .\\n\\n\r\nArmed Girl's Machiavellism is anime based on the manga of same name and is made by LINDElFILMS. Now the studio is known for making some great harem like  Yamada kun and the seven withes but TBH even i am not sure why they would make such anime anime now. The story follows Fudo Nomura, strong delinquent who was expelled from his school for engaging in a fight where he defeated almost 40 people, and now he studies at Private Aichi Symbiosis Academy which is ruled by a group of girls called 'Supreme 5 Swords\" whose mission is to correct out all the boys after the school became co-ed.He is really skilled when it comes to fighting and has a lot of knowledge about various martial art styles. He even has his own orignal technique called \" Magic Bullet\" through which he can defeat almost anyone with just a  single touch. All the members of supreme swords wanted to defeat Nomura but instead ended up defeated and for some reason they all fell for him (don't ask me why).\\n\\n\r\nNow , the protagonist might be the only character who is somewhat bearable in the entire show. Almost every girl presents a pretty bad impression and their is personalities are also unbearable at some points. Rin, who is the leader of the group, fought against Nomura and somehow accidentally ended up kissing him and later on developing a crush on him. Their interaction in the beginning seemed promising but later on she turned out to be violent girl with a tsundere personality. And  introducing girls like tamaba, warabi and tsukuyo just shows how they threw up almost all the generic character tropes in the show without any proper sense.\\n\\n\r\nAnother major character in the show is the Empress also known as Amo. At start of the series she was shown to be the strongest delinquent in the school who even the  supreme swords couldn't handle . She had a extremely violent bitch like personality who would kill anyone for almost no reason. But later it was revealed that she was in love with nomura and was a yandere personality and would kill anyone who would come between them... even Nomura .\\n\\n\r\nNow i would praise the anime for doing a good job when it came to martial arts. They did well in explaining the techniques and  arts used in show and the fights seemed to make some sense. But hey! an anime where even a bear does martial arts.. now that might be something you Have to see.\\n\\n\r\nNow after watching the entire series the only question which came in my mind was.. Just why. Why even create such a thing ? watching this made me feel that the creators were not even sure where they were going with this thing. They just threw up almost everything  that came in their mind with worrying about it making even a bit of sense. There is no memorable character or dialogue whatsoever and most of the characters are almost unbearable to watch. The setting is also nothing special, just a  simple High school where for some reason everything including swords, whips, bears , blades are totally allowed but a boy wanting to enjoy his freedom is not.\\n\\n\r\nNow THB there's nothing much to say about the art . It might as well be the only good thing in the anime. The character design is also pretty generic with nothing to praise or complain about. The sound track is also pretty good, The op Builds up some hype for a good fast paced hardcore action anime.... which unfortunately this  show is not. The battle music is nothing good or original either but fits there anyways.\\n\\n\r\nNow in the end... this show is nothing good . Its not exactly really bad either and you might even find it decent if you are a fan of such kind of shows but I can't bring myself to like this show. There is no originality or even a good plot. The characters are just generic and boring , and their interactions also felt somewhat cheesy and the jokes don't do much either. So I would not really recommend this show to everyone, but you can still watch it to find if it really is all that bad as I said it is. And ya... why are  the swords allowed in the school?\\n\\n",
            "date": "2017-06-21T07:10:00+00:00",
            "helpful_count": 21,
            "mal_id": 250538,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5715004.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Aman_Bhaskar",
                "username": "Aman_Bhaskar"
            },
            "url": "https://myanimelist.net/reviews.php?id=250538"
        },
        {
            "content": "Huh? girls with weapons? ruling over boys? and tsundere characters? meh nothing uncommon right?\r\nits an anime series with quite a lot of \"pain\" and some cute~ moments a pervert like myself can enjoy.\r\ni firstly wrote my review for this anime the day when fourth episode was released, and there was nothing interesting going on by that time.\r\nAfter watching the rest of the episodes i changed both my score and my opinion about it.\r\nHaving almost finished the series i can say that, it has a common \"revenge\" -ish story, which i believe will end in a really silly way.\r\nThe MC is not that typical useless, andscaredy cat pervert that we are used to having in these kind of anime series (THAT DOESN'T MEAN HE IS NOT A PERVERT)\\n\r\nbut he is a gentleman most of the time.\\n\r\nThere is a comedy going on almost every single episode, except the last 2-3 episodes, where things get pretty gloomy and \"dangerous\", the whole series might seem pretty dumb and without any goal at the beginning, but it unfolds slowly with some hints midways giving you a reason our MC is doing what he is doing. \\n\\n\r\nI am pretty sure that you'll enjoy the series to the very end, if you're not too fast to criticize and drop.\\n\r\nits not a serious anime series like for example code geass or anything like that, but it has its own charm like every single anime series right?\\n\\n\r\nArt: I have to say that i am interested in this kind of artwork depending the story and the whole concept  always, its smooth and cute, having some really sweet details also having some female characters drawn really sexy while others might be cute and lolis, in other words i really like it.\\n\\n\r\nEnjoyment: JUST HILARIOUS, there are some really \"stupid\" accidents that make you cry from laugher.\\n\\n\r\nRemember this is just my personal though on this series.\\n\\n\r\nQ:Is it worth watching it???\\n\r\nA:YES!! and if you're also a pervert you'll like it even more ;) have fun!",
            "date": "2017-04-26T12:47:00+00:00",
            "helpful_count": 19,
            "mal_id": 246364,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4197379.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KiritoXxS",
                "username": "KiritoXxS"
            },
            "url": "https://myanimelist.net/reviews.php?id=246364"
        },
        {
            "content": "As much as I've wanted to finally see a guy hits a girl, showing em what gender equality is all about, this anime wasn't really all that satisfying or really all that entertaining tbh. The setting in itself seem to be the most ideal setting for any feminist to wish for, where the school is fully dominated by women with rights to possessed a weapon and physically use it to assault others or cut them without any consequences being done to them (like em police, government, the principal should do something about it); you could also add in the assimilation of femininity, by making allmen turn gay with make up, since this school that was once an all girl school, and most female student saw men as vile, vicious, or a rapey beast.  Aside from showing all the female student's ignorance of men, the pretentious gays in this show look very disturbing, especially that fucking big head dude. And I just dont see any reason to make these kind of disturbing character other than wanting people to shy away from the series. \\n\\n\r\nAll that aside, this is just your typical cliche anime, with many of the anime tropes and setting, filled with women and a legit badass MC; where he gets a harem out of it by dominating them in a fight. Usually it's the other way around where the harem starts before the fight, but this anime go through that process of acquiring em ladies through beating them, where the MC usually show no or very little sexual interest, or having shown any signs hinting of a romance between his harem partners.  Talking about the character, some girls in the show, especially the blonde hair one and the croissant hair looking girl, does give u that cringy-ness being added on to the show. I mean their fucking character imitating or speaking in a very horrible accent of a foreign language and try to pretend one is weebish and cringed just like I said. Plus, the blonde hair girl is just your typical big boob, with a tsundere like personality that usually blurt out stuff that imply that she's actually a very slutty on the inside (well the big boob already kinda give that point across to its viewers). That's not to say that the show is consisted of disturbing and cringy characters, there are some pretty cool ghastly girl who gives off a macabre vibes, cute and adorable lolis, and so on.\\n\\n\r\nThere's not much to the story really aside from a very few flashback screen of our MC's past, or of other character in the show that belong to the member of the five sword, aka, the student council of the school? or just a group of respected girls who control the fucking school I guess. In addition to that, the story progression of this anime is pretty slow, and almost makes you wanted to skip to the part where action and stuff finally gets to happen in the anime. This ofc is not that much of an ordeal, but it just gets boring u know? Excluding all the cute interaction scene, some ecchi that some of u may liked (I definitely dont, I cant handle the tease u know? I would rather watch a hentai), panties shot, awesomely animated fight scene, and so on. But hey, the cliche of people from the five sword people talking when one of their members, or them and a group of their henchmen fighting against the MC, that's actually pretty annoying.\\n\\n\r\nIn conclusion, it's a fun show, it may get boring at times but nevertheless, it's not that bad if you wanna see a different kinda harem story involving men hitting girls, and later have them go after the MC's D at their very own discretion.",
            "date": "2017-05-04T10:33:00+00:00",
            "helpful_count": 16,
            "mal_id": 246945,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=246945"
        },
        {
            "content": "STORY: 3/10\r\nCHARACTER: 4/10\r\nART: 4/10\r\nSOUND: 7/10\r\nENJOYMENT: 8/10\r\nOVERALL: 6/10\r\nThe concept of turning delinquent’s boys into girls in order to be accepted in this school isn’t easy to swallow and it’s unclear how this alarming act of extreme violence is acknowledged by everyone under the name of ‘Peace’. The world building is retarded and extreme to the point where the school finds everything sexually wrong! To think this kind of mentality is drilled into all the students is scary, for who knows what the hell would happen once they spread out in society! The MC gets tortured just because he was in a picture with another naked girl??Where did the girl’s punishment go?? Just cause she’s from the 5 Swords group, she is to be forgiven?? The fact that teenagers are carrying weapons (the 5 main girls are acquitted with real swords!) to physically beat men is not an acceptable premise nor the fact that those 5 main girls are dosed off on hormones and resort to actually killing each other for very stupid reasons! Do remember this show has no Comedy tag so I took it seriously and I didn’t enjoy a lot because the show couldn’t defend these ridiculous claims! So, I just switched off my brain and started watching this anime simply as a ‘Popcorn Flick’ and you know what? I started to have fun, was laughing at the well-timed jokes and all the craziness along with it! I realized you must accept this weird idea to enjoy the anime which worked like a charm! Despite the show’s promise at the beginning, it can’t seem to capitalize on it due to the lack in depth with its story and characters. And the Harem is simply shoved down our throats as every girl falls for the MC, I bought the first girl and was kinda okay with the second one, but the rest were just shoehorned! And they fall for him after he beats them in combat which is also achieved in a corny manner! So where does this anime work then? The answer is Comedy and I’m very surprised as to why this anime has no ‘Comedy’ tag. The jokes and their setups were bold in its execution, a little creative, a tad bit repetitive but they were timely performed. Sadly, the final arc was lazily told, choppy edited and stupidly rushed which leaves a bad taste in your mouth when all is said and done!\\n\\n\r\nNomura (MC) comes off both cool and badass but he’s bland with very senseless and questionable motives that sometimes make him unlikable, no a better word is unrelatable. The work done on his facial expressions were lousy which didn’t help his case either but he’s not your generic clueless MC. Nomura is a hot-headed guy who just wants some peace and will do anything to get his freedom! Aside from him, all the characters are One-Note who have only 1 object on their minds! All the girls start as strong Feminist, but the main female characters slowly change after spending time with the MC. I am not gonna go into details because we have many girls here, but they all generally have some bad trait to them as well as a unique sword fighting style. They are cute sure, but they are also very stupid which makes them annoying, especially Satori and that French (or Spanish) wannabe girl with the wig and that maddening LAUGH!!! Empress is the only character that exhibits potential, but they even spoil her in the end by giving her no depth at all.\\n\\n\r\nThe art is pretty much your average Harem anime style with choppy editing and I had a big problem with the character designs. The girls were well-defined, both in their looks, expressions and attires while Nomura had mediocre overall work done on him! Also, the Voice Actor for Nomura had an annoying voice to him which was a poor choice since the girls came off better in this department as well. The fight styles are a 50-50 to me! On one hand, they were more credible in the sense of being accomplished with pace and rhythm. No one was shouting their Special moves or style out loud, but they rather appeared as text at the bottom. But then the sword play displayed didn’t always look unique, sometimes it felt like they were just swinging around! The OP is nice, and while the soundtrack is nothing beguiling, I totally dig the ED due to its catchy tune.\\n\\n\r\nYet despite all the fighting styles of the girls, Nomura beat them all with either his Special move or come up with some convenient technique which made the show predictable and boring. You would think the rest of the girls could have come up with some way to avoid his Special move but nothing of that sort is even mentioned! And the armour plot here is ludicrous to the point where a character would be get all slashed up and lose lots of blood but the very next day they are completely fine! The one arc which showed capacity was the past of the MC so they saved that till the end to create a finale for the show which sucked because they turned this into a bullshit cliched arc that was rushed and totally ruined the character, Empress for me! The final fight was decent, but the big payoff didn’t work because you aren’t invested in the feelings of the characters nor the story for it to work! How can you when you are given half episode of flashbacks as storytelling! The Comedy seriously saves this anime from a disaster as it kept you entertained for the whole 12 episodes. I am only giving this anime a high rating just cause the Comedy caught me off-guard because the rest is just meh.",
            "date": "2017-10-22T04:20:00+00:00",
            "helpful_count": 11,
            "mal_id": 261392,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6421599.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/PakiUSA",
                "username": "PakiUSA"
            },
            "url": "https://myanimelist.net/reviews.php?id=261392"
        },
        {
            "content": "Busou Shoujo Machiavellianism is a very simple, fast show. Unsurprisingly, I don't have much to say about it.\r\nThe premise of a school overtaken by armed girls allows for a lot of crazy things to take place. There's a masculine guy fighting girls, each one with a different weapon and fighting style, there's a girl who has a bear, who he also fights in a sumo match, there's tons of fanservice that is implemented in a way that actually isn't just for the sake of itself, as it attempts to create some comedic situations and even characterize some with the sheer idea that they like towalk around or fight without any clothes. I would say that the reason it works, is because of the main character himself.\\n\\n\r\nHomura is just a guy who wants to go to a normal school, and be a free, cool dude, but isn't allowed to. In order to be free he has to get stamps from all the higher ups in the girls' ranks. Because the school is a correcting facility, he immediately is forced to uphold the law that says all boys will be turned into good citizens by turning them into transvestites (don't ask, I don't know what exactly is that supposed to help with as well. My best shot would be that it makes them lose all of their bravado and make them behave). He refuses, gets in a fight, falls on the girl he was fighting and accidently kisses her.\\n\r\nCue the cliche kissing music.\\n\r\nSoon after all the other members of the \"Supreme Five Swords\" take interest in him and he has to beat them up and get them to act normally so they can give him the stamp. Slowly but surely they all warm up to him, he warms up to them and some drama starts occurring. Homura works well, because there's a lot of other viewpoints showcased bit by bit, he has a cheeky personality and his own, distinct fighting style, not to mention that he is ripped. All of this makes him a good, recognizable MC, doesn't feel like a self-insert at no point. He's characterized well enough. While his presentation feels fairly natural, with the characters Homura fights after the second half of the show, it can feel forced and rushed. The entire deal with the Empress in the last three episodes could symbolize that perfectly. It works, it's explained, but it has absolutely no impact as it feels like just another rushed characterization.\\n\r\nIf I were to talk about the girls and how they behave, I would take away most of the fun from this show. They don't exactly have deep personalities, though some have their reasons, so telling you what they are would get rid of most of the content. The most entertaining part about this show is by far meeting new girls and finding out about their fighting styles, their personalities and their reasons for getting interested in Homura. Once again, those aren't anything deep, but with so many cool, well designed characters, you do have this itch that tells you that you want to know more about them. Besides, you wouldn't need anyone's explanation to know what they're all about, this show doesn't hide it. It's always been very straightforward with their personalities.\\n\\n\r\nThe visuals are fine, but because it is Silver Link after all, they only look okay because the things that are shown need little animation. There aren't many shots where characters actually fight, rather there are ones where they attack, cut into a different camera angle, another attack, another cut, the other person attacks, another camera cut. You can see how this can leave some less than impressive results. That's not to say that there aren't any impressive-looking moments, it's just that the it's really inconsistent. The art style itself is okay, the school is designed properly and there are different places for each fight, the character designs are great and can tell you a lot about their character just by looking at them, just as an example Rin wears half of a devil mask. Isn't that immediately intriguing? The fact that those sort of things get explained as you go is also a huge plus. Another thing that really caught my eye are the clothes and school uniforms. This show has a great sense of fashion, there's a lot of nicely fitting outfits with matching colors. I have to praise them for that.\\n\r\nThe director seems to have had some ideas as to how to present certain moments, there's surely a good amount of thought put into them, especially the mostly well scripted fight scenes, but there are periods of time where everything looks more generic than even it's art style. Not to mention some needlessly cheesy scenes, like the rose petals flying through the air as Homura and his last opponent get up close. It's not this kind of series, it never was, it doesn't fit. The directors tried quite a bit, but it wasn't quite enough. \\n\\n\r\nThe sound is... well... it sure does exist and it sure does its job, but were I say more about anything other than the pretty good and fitting opening and the ending, I would have some hard time. The sounds of metal as it hits Homura and the instances where he uses his Magic Bullet are the only ones that stuck to me, despite there being much more. The silliest one would have to be the bear's voice actress who tries so hard to be mad and loud, but actually sounds frail and weak in each roar. That's not a positive by the way, it's almost pathetic. The soundtrack definitely improves all the scenes to some degree, but the musical directing isn't anything great here, just like the visual directing.\\n\\n\r\nThis is about everything that you need to know about Busou Shoujo Machiavellianism without going into spoilers. If you want to watch it, you should. It's a solid battle series with a good, yet simple cast, gets better the more of them are introduced. It's easy to binge, looks pretty enough and has a lot of cool and dumb moments that should stick with you for a while. It has some solid comedic timing and knows how to script its fights and some casual scenes. Unfortunately this is about all it does and it had some weaker points here and there in terms of its writing, it always swirled around the mediocre to good range, however if you feel like spending some quality time with some quality armed waifus, you should give it a shot.\\n\\n\r\nAs always, this is purely my opinion, I recommend you to develop your own.",
            "date": "2017-06-22T06:04:00+00:00",
            "helpful_count": 8,
            "mal_id": 250638,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5603650.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Werty800",
                "username": "Werty800"
            },
            "url": "https://myanimelist.net/reviews.php?id=250638"
        },
        {
            "content": "Warning possible Spoilers\r\nReading the description of this anime it definitely reminded me of Prison School luckily though this wouldn't be that well known cringefest instead we got something that was actually very entertaining to watch.\r\nThe story centres on Fudou Nomura a delinquent who has been sent to The Private Aichi Symbiosis Academy to be controlled after getting into a fight, but he isn't a pushover and to gain leave from the school he must get a stamp from each of The Supreme Five Swords easier said than done.\r\nNow honestly the story to begin with starts out very simple which is Nomura trying to get astamp from each of the five girls who are part of the The Supreme Five Swords which always ends up with him fighting them and boy are these fights entertaining, overtime as he defeats each girl the next one always being a little stronger and those that get defeated do start to fall for him which makes you think it turns into you're usual cliched harem hell no this doesn't happen here as only two of the girls really fall for him while the others just either help him out or stay in the sidelines.\\n\r\nWhen the final battle happens though it does turn into a love-hate type of thing which didn't ruin the show for me, but it kinda seemed like a meh way to end it even though those final episodes were really intense to watch.\\n\r\nWhen you look at the genres and think hhhmmm somethings missing technically you're right since comedy is also a big factor in this show, but really it is mostly an action show which did surprise in some way because looking at the poster you'd think otherwise, but when I watched it every episode had a big fight which was surprisingly entertaining as not many anime's can be entertaining when it focuses mostly on action yet this one can.\\n\\n\r\nNow aside from the good fights the characters are also what makes this show very good as some these characters really stand out.\\n\r\nFudou Nomura is the male MC and he continues the trend of asshole characters that we have seen a few times lately, but just like those guys he's pretty damn cool and a badass hell he also has morals too as some of the girls do try to taunt him yet he manages to control himself which was a surprise to see and despite having to fight these girls he doesn't hate them afterwards sure he doesn't get along with them, but he does compliment them sometimes and is grateful whenever they help him out in a situation.\\n\r\nRin Onigawara is the first girl Nomura encounters, Rin was one of my favourites of the show because even though she is one of those bossy types she does actually have a nice cute side which was always adorable to see especially in moments where you see her and Nomura connect a little more, sadly though she was paired up with a character that pretty much got on my nerves which sorta hurt Rin's reputation a little.\\n\r\nMary Kikakujou is the second girl Nomura encounters and she is to me the worst character of the group, she has a french background so she prefers a rapier instead of a Katana and despite being the girl with the big oppai she is annoying as hell well not annoying to the extent that I hate, but she was annoying and honestly she didn't really offer much to the table either as everyone else pretty much overshadowed her.\\n\r\nWarabi Hanasaka is the third girl Nomura encountered, she only escapes worse because she actually became friends with Nomura and helped him out a few times, she does have an over eccentric personality often making herself feel like a queen along with having that annoying chuckle her type of characters have which did feel overused at somepoint though luckily she doesn't use it as often once Nomura defeated her plus you won't see her without Kyou-bou who is Warabi's pet bear and fighting buddy who also becomes more friendly with Nomura after fighting him.\\n\r\nSatori Tamaba is the fourth girl Nomura encountered, Satori definitely became another favourite because she is incredibly weird and really devious as she tries to put Nomura in a difficult position at some point, she always speaks in a slow fashion making her seem dimwitted which isn't the case and certainly has a lot less shame compared to the other girls when it comes to fighting.\\n\r\nTsukuyo Inaba is the final member that Nomura encounters and she is actually blind so she relies heavily on her hearing to move around which makes her notice things much quicker compared to the other girls, she is pretty much a Kuudere since she is very quiet and doesn't show much emotion, but she is very powerful and shouldn't be underestimated.\\n\r\nKirukiru Amou is the antagonist of the series and despite not appearing much until the final episodes she is a very cold, ruthless and dangerous person as she uses her own hands much like Nomura as weapons except she uses them like swords and if it weren't for the Academies headmistress she would probably have killed a few people although despite her badass appearance the whole reason why she goes out on a frenzy is because she had a crush on Nomura and she only wanted to be his friend which didn't really go well for her and that seems like a very stupid reason to go around hurting everyone.\\n\\n\r\nNow the artstyle was really good as the choreography of the fights was done well and there didn't seem like any CGI was involved which made it even better, but there really wasn't much else as the characters seemed okay with they're designs, but isn't something I haven't seen before along with the school and other things although you can definitely tell between the differences of living standards for the female and male students.\\n\\n\r\nNow the Action which is the main sauce of the show is really good, enjoyable to watch and last for a good while which is definitely a good thing because I don't want fights that are over in seconds and luckily these fights can drag on for almost an entire episode which shows that the show stays true to it's word.\\n\\n\r\nThere is also some other stuff that isn't in the genres like Comedy which was actually very funny, I liked the chemistry between Nomura and the girls as he usually jokes around with them when usually it's the other way around so it's nice to see a male protagonist getting the advantage over harsh female characters and there are a lot of jokes between the two sides that are really funny, there is also a fair amount of Ecchi/fanservice though not to the extent where it's distracting well except where Satori fights Nomura nude which is something that definitely surprised me, but the other moments like this are spread out very nicely and don't really go much further than that.\\n\\n\r\nOverall this was an entertaining show that could have a season 2, but considering that Nomura achieved his goal I'm very unsure and the way the show ended seemed fine so I'm not sure if this needs a second season, putting that aside this'll definitely be a good show for those fans who are looking for a good action anime.",
            "date": "2017-09-09T11:39:00+00:00",
            "helpful_count": 7,
            "mal_id": 257176,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=257176"
        },
        {
            "content": "Armed Girls Machiavellianism is an anime that certainly improves as it goes along.  Every season, there usually some shows that I change my ratings for throughout their air time, no matter if it's lowering the score or upping it.  This anime anime was certainly one of the cases where I upped my score a little (at least in value, but not overall), but it wasn't until it was almost at the end (after episode 11).  I really liked it despite the aspects that can seem generic, but it felt different.  I'm not going to pretend I'm a critical person here becauseI'm not all that critical most times.  This show felt different and it really drew me into what was happening on screen, but I want you to consider that this is not a review written by a critical person so do not try to star arguments over the review even though I know may people consider it generic; I just want to try to prevent trouble before it starts, even though the chance of it occurring is low, in my mind. \\n\\n\r\nNow at the basic level, the story has nothing more than a trouble making teenager, name Fudo Nomura, who is enrolled at a co ed school, that is completely dominated by females to the point that guys are expected to weir ugly female face masks and that even a group with elite sword skills, the supreme five swords, pretty much run much of the school and are in charge of correcting the males, especially the ones who don't follow the rules.  Surprisingly, it actually becomes a really good story that draws you into what is happening.  It shifts more towards focusing on Fudo earning his stamps on his permission slip so he can leave the academy while following the rules.  It starts off with him simply facing off against different girls in the five swords early on and becomes more entertaining and gripping later, and actually has some nice twists while still not being complicated.  Even though it seems like  a harem at times, it's not and it doesn't go overboard with the harem like scenes.  It becomes really character focused and is quite comedic, and the ending is amazing, considering how the show is.  I'll give the story an 8. \\n\\n\r\nThe art seems different too.  It's not very colorful, but it certainly doesn't feel plain.  Some of the character designs are a little weird, such as with Satori, Rin, and Chouka.  They're not off putting, but the designs for Chouka and Satori do lower the art score a little for me.  The back grounds and actual animation seemed pretty consistent with some occasional drops at the beginning of episodes and a few times in the middle of certain episodes, but it's not that noticeable.  The character designs, backgrounds and animation quality were actually really good or even great as a whole.  The creators did a great job at making sure stuff didn't seem out of place and the times that the quality did drop seemed to be conveying a more serious tone when everything shouldn't be extremely vibrant and overly colorful.  I definitely feel like most of the main designs are really unique, despite some of them being creepy, like with Satori, and the animation quality drops didn't seem like it was just due to laziness.  Since there were some obvious quality drops though and 2 really weird character designs, Satori and Chouka, this category doesn't feel like it has earned a 9 in my book, even though I like the majority of the other designs a lot as well as the majority of the art, but I don't think there are enough problem to totally drop my score that much, so an 8 it is.  \\n\\n\r\nThe soundtrack has some great battle music  and other scores that added to the intensity of scenes really nicely.  Shocking Blue is actually a really good and maybe a great opening, but I'm thinking it's more towards the very good side.  Decide is one of the best ending themes I've heard; it really shows one of the anime's main messages with it's lyrics, which I'd say is that the characters stick with each through thick and thin when they get one another and they're not going to simply someone leave their side without a good reason.   That's my take on it anyway, and it's an unexpected one considering how the girls act towards Fudo early in the story, and how unlikely it is that a school dominated by females would have females that are willing to go through great lengths to keep a guy at their sides (not in the sexual way).  I give the music an 8. \\n\\n\r\nThe character portion is difficult to describe and I'm only actually to describe Fudo Nomura.  Before, I'm asked why I would cut out the rest of main cast from my review, I'll give a simple reason.  Honestly, I find it hard to actually describe the girls in convincing words to people that probably have not watched the show yet, as I think my description would make them sound too generic and uninteresting.  I feel that the female cast,especially, needs to be experienced for yourself to actually determine if you like the cast or not.  I don't feel like my thoughts can be expressed clearly and concisely here and describing them wouldn't reflect my true thoughts.  \\n\\n\r\nNow that I gave my reason, which is longer than I expected it to be, I'll describe Fudo Nomura.  He doesn't come off as a guy who thinks he is superior in every way to the girls he is fighting.  He doesn't seem to hold back in his fights and he doesn't fight to show off his skills.   The final episode explains why he fights in a great, yet very simple way.  He fights to show where he stands, and not just to win.  I think that is actually a great way to fight and it could help prevent you from clouding your judgement with rage and eagerness to win;  I'd rather win of course, myself, but I find it to be a great way to approach a fight still.  He interacts well with all the girls too despite his attitude about sticking to his ground and not agreeing to submission, very easily, when it even happens.  I find him to be a great mix between a capable main character and one that is viewed as weak.  He's not the best fighter and doesn't easily win fights without putting in effort like some characters, but he's not helpless either, and he certainly is capable of holding his own in martial arts based fight, which the type of fights seen int he anime.  I give the characters another 8.  It's not the best cast, but it's still a really good cast with a great main character.\\n\\n\r\nMy enjoyment score is a 9  I always really enjoyed the anime, but I started to like it more and more gradually and the amazing ending for the way show is and everything else that happens throughout the last two episodes brought up my enjoyment score a bit drastically from the lower 8 range up to my current 9.  It's a show that surprised me and surpassed my initial expectations.\\n\\n\r\nI hope more people watch the show and like it.  It doesn't feel generic like many people think.\\n\\n",
            "date": "2017-06-22T17:35:00+00:00",
            "helpful_count": 6,
            "mal_id": 250703,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5520188.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AobaSuzukaze",
                "username": "AobaSuzukaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=250703"
        },
        {
            "content": "I've been here on MAL since 2012 I think and this is the first time im writing a review\r\nbecause this anime deserves it, if trough a review I can get at least one person to watch this underrated masterpiece then Im happy.\r\nOk, lets go\r\nThe story begins at an all girls school that just become CO-ED mostly girls are feminists , the boys who entered the school out of fear were forced to dress and act like girls, except for our MC who fought back, and instead of just plainly defeating them (which would be boring) he made friends whith them , he earned their trust, and his prupose is to get their seals so he can leave school grounds (they are not permitted to leave until graduation) . Also theres one major antagonist who seems to have a past with the MC and she will likely be the last boss of the series.\\n\r\nWhat was supposed to be a harem / ecchi filled boring shounem anime because of its cute and well developed charaters , the fierce battles , the intense dialogue and the good animation quality and ost  becomes maybe the AOTS.. altough the show is not over yet i get the feeling that the conclusion will live to expectations. I started this show out of the blue.. simply to kill my free time when I get home from work. And now its the show im most looking foward to watch. \\n\r\nAlso, the explanations during the battles, the author created very coherent techniques , fighting styles and made it in a way easy to understand .. they just dont pull out random shit like in Mahouka for example and because of this when someone wins or loses a battle you agree with everything that happened , you're left with ways of imagining the upcoming course of the show because its logic are solid and coherent. Give Busou Shoujo a try. You wont regret it.",
            "date": "2017-06-08T17:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 249535,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1272231.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/dReams-C",
                "username": "dReams-C"
            },
            "url": "https://myanimelist.net/reviews.php?id=249535"
        },
        {
            "content": "This anime might seem same as any other harem anime, but the plot and the whole summary is actually pretty different. As we all know the main character is a transfer student and his new school has some weird rules where they force males to dress and act like a girl, but he refuses. Shojo part of the anime isn't bad either, character development as for the main character is pretty good but doesn't cover other supporting characters, well that's because anime itself is pretty short. Art is pretty solid and the sound isn't bad either. I gave it 10/10, yes it is a haremanime but it also has a unique plot and if nothing it's pretty funny. So if you're not a huge fan of harem anime, watch this one just to laugh a bit.",
            "date": "2017-11-22T01:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 263742,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6545861.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/UnknownWriter",
                "username": "UnknownWriter"
            },
            "url": "https://myanimelist.net/reviews.php?id=263742"
        },
        {
            "content": "Machiavellianism is an anime that everyone saw like billion times in their lifetime, or is it?\r\nWhen I first saw the title and the concept art, I cannot help but feel repelled, as many mediocre shows immediately got in my mind, and I thought I had better things to do (like preparing my exams). But then recently, a guy called LexBurner made a video on this anime and portrayed it as more of an interesting attempt of following Kill la Kill (which I haven't watched, but will eventually after my exams).  This pepped my interest, and with Lex's description, I've decided to give it ago.\\n\\n\r\nHoly **** this is enjoyable.\\n\\n\r\nFirst of all, aside from the mc, everyone is in some way as generic as it gets. You can tell by their designs which type of characters they are. The fun thing is that, at least in my opinion, the fact that they don't even hide it and use that trait exclusively makes it so much more fun to watch than those anime who try to pretend that their characters aren't generic. The mc, on the other hand, although not the most interesting character ever (I would attribute that to Okabe Rintarou), is entertaining to watch.\\n\\n\r\nOverall for the character, a solid 7\\n\\n\r\nRegarding the story, nothing happened aside from setting the scenes and characters in the first season through individual arcs. What I would say is that they are sometimes hilarious and in most cases not offensively stupid (not that it does not happen, don't get me wrong)\\n\\n\r\nMediocre 5.5 (rounded up to 6, I'm not that picky)\\n\\n\r\nArt and music:\\n\\n\r\nSubjective feelings, don't have anything to comment on\\n\\n\r\nFor the enjoyment, WTF is this enjoyable. The most obvious element to this high score is our MC, his reactions to stuff happening around are genuinely interesting, which could be best shown through how he held back not touching the boobs even though his face shows that he obviously wants to. Another aspect is how the show will throw you off guard by going out of their way to do some stupidly hilarious yet not offensive stuff.\\n\\n\r\nFor those who want serious plots, characters and themes like Steins;Gate, you're at the wrong place. For those who want to have a laugh to relieve stress, this might be what you want (as comedy is subjective)\\n\\n\r\nOverall a strong 7/10",
            "date": "2018-01-03T07:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 267287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5344319.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hiroto124",
                "username": "Hiroto124"
            },
            "url": "https://myanimelist.net/reviews.php?id=267287"
        },
        {
            "content": "TL;DR Section at the end of the review. This review may or may not contain minor spoilers.\r\nBusou Shoujo Machiavellianism (referred to as BSM from here on out) is surprisingly enough not a show about Machiavelli, but of a student named Nomura. Nomura has transferred into a formerly all girls school, but is now what is essentially a correctional facility. Either you be corrected into being a drag queen, or you get stabbed by some girls. Interesting story, right?\r\nWhile BSM is at the end of the day just another one of your action/harem shows, it's enjoyable enough. Nomura's \"I give zero fucks\" attitude is refreshing comparedto the \"I'm dumb as hell and can't figure out 6 girls like me\" harem MC. From day one at school, he's already getting attacked in the form of being corrected by Rin, the first of six harem girls. Of course, Nomura ends up showing his badass-ness and wins the battle... and ends up kissing her due to a sidekick hitting him which forced the kiss situation. *sigh*\\n\\n\r\nOn the other hand, you have a pure french girl who secretly wants to be dominated, an emotionless but insanely cute girl who while is okay with being nude herself whilst fighting, can't focus if the male MC is at the same time. Following up is a girl who owns bears for a living (bonus point for being the \"Kyohohohoho\" of the season), an insanely dangerous loli, and the main antagonist Amou. Amou was made to be this untouchable godlike fighter, but of course falls to Nomura's badass tactics in what started as a somewhat interesting fight that inevitably degraded into a match of fisticuffs. Excellent. Did I mention that Amou secretly wanted Nomura['s dick] super badly?\\n\\n\r\nHardly worth mentioning, but Silver Link. gave us some nice animation and art, along with some rather okay music. The OP is insanely fun to listen to for the first 15 seconds.\\n\\n\r\nTL;DR: BSM is another action/harem show but is surprisingly enjoyable due to the MC's \"not giving a fuck\" attitude. The nonsensical way the fights play out are fun to watch, as well as playing \"best girl of the show\" simulator (it's Satori, by the way). Overall, a fun watch even if it does get boring from time to time.",
            "date": "2017-06-30T19:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 251595,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5078535.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/deathline",
                "username": "deathline"
            },
            "url": "https://myanimelist.net/reviews.php?id=251595"
        },
        {
            "content": "Spoiler free review\r\nI welcome feedback on my reviews\r\nHello and welcome to Private Aichi Symbiosis Academy. We're a boarding school that helps delinquents such as yourself correct your ways and build a brighter future. Now our ways of rehabilitation are a bit different from your usual school. A group of 5 girls, known as the Supreme Five Swords, oversee everything that goes on here. All students are permitted to a baton to protect themselves from boys such as you, with the higher ranked students given more capable defensive measures. Oh yeah, I forgot to mention the most important detail. You need to crossdress or we'll stabyou.\\n\\n\r\nArmed Girl's Machiavellism is about Fudou Nomura, the next kid on the chopping block for our weapon wielding students. Well, that was the plan, but he proved to be a little too much for them to handle. Soon, Nomura finds out he needs to acquire stamps from each of the Supreme Five Swords if he wants to have some freedom around his new stomping ground. So, he decides to go get them the best way he knows how. Brawling. The story seems interesting at first with its 1v1 showdowns, until it devolves into a simple harem creator. Defeat them, they respect you and usually fall in love with you. Throw in some mediocre comedy that can either have you slightly chuckling or groaning in disappointment, and it just doesn't give you much to like about it. With the word Machiavellism in the title, you expect perhaps a few mind games or betrayals to spice things up, but it doesn't seem to appear anywhere in the show. Just an expectation that ends up falling short.\\n\\n\r\nThe main focus of the show is obviously the action as Nomura faces off against opponent after opponent, but it doesn't really do it well. Either it's repetitive and predictable, with Nomura's Magic Bullet defeating them left and right, or it's mixed in with some annoying dialogue and pop-ups explaining the different styles of fighting techniques shown in the anime, ruining the flow of the scenes instead of being informative. The animation is also quite shoddy, lowering the quality of the already lacklustre fights. You do get a few action scenes that feel pretty decent, but it just fails to keep its consistency across the show.\\n\\n\r\nThe characters are interesting at first, I have to say that at least. Nomura is a pretty good main looking at his carefree personality and interactions with other characters, and the Supreme Five Swords and other recurring individuals have their own little quirks that make them quite likeable. The way some of them talk, bringing in other languages into their speech pattern, feels like an incredibly forced attempt at ethnicity, but it's tolerable most of the time. Some tragic backstories are also mentioned but not really explored, as if they were just trying to add some depth into their cast but decided to give up halfway. Then they start bringing up love and friendship. Again, how is this got anything to do with Machiavellism? It feels like the show had very little idea of where it wanted to take its characters, so they end up trying different things to try and figure things out.\\n\\n\r\nArmed Girl's Machiavellism has potential, but like plenty other shows before it, it fails to do anything special with what it has. It was slightly entertaining at times, but the negatives outweighed the little positives this anime had. There are probably a lot of people that could derive some type of enjoyment out of this, but sadly I cannot recommend this show to anyone. You're better off finding something else to sink your hand- I mean teeth into.",
            "date": "2017-06-22T01:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 250628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6011085.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/EnZanity",
                "username": "EnZanity"
            },
            "url": "https://myanimelist.net/reviews.php?id=250628"
        },
        {
            "content": "Prevailing any plots can be skeptical but that's not the point,\r\nEven The story are involves where every girls can depend themselves through trouble by going all around devastating the not so routine gimmick to serious targeting the prey within glory.\r\nIf you can tell the the whole pointless of the story? because it's plain and generic (Heck I'm also agree in my statement) well it's not\r\nPointing out The scenarios are clear, setbacks can interior every spaces,\r\nand a co-ed school filled with dangerous group council.\r\nHuge Point :\r\nAwaiting the last standing of a rival you dare to defeat, through ages\r\nAny flashbacks are within possible good even though it'squite episodic if you compare every episodes.\\n\\n\r\nMisconcepts :\\n\\n\r\n(All \"Unrelated fight scenes to Goofing off session about girl related stuff )\\n\r\n-That's the whole point-\\n\\n\r\nDon't be bother about any scenarios which irrelevant, as long as the story began to serious in the meantime.\\n\\n\r\nTotally a worth watch",
            "date": "2017-06-07T04:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 249432,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6174494.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/-HippySnob-",
                "username": "-HippySnob-"
            },
            "url": "https://myanimelist.net/reviews.php?id=249432"
        },
        {
            "content": "The most disappointing aspect of this series isn't that it's bland, it isn't the recycled cliches, it isn't the entirely recycled plot from literally any other light novel action harem. \r\nNo, the most disappointing thing, for me, is that this show could have been so much more.\r\nIf there's a single positive to this series, it's that it is fairly unique on a surface level. At least for light novel harems, having it set in a school without magic is actually quite rare, so much so that nothing else comes to mind. \r\nBut while there are no magic abilities, which in theory should open up alot more creativity on the part of the author (which sounds strange now that I think about it, but it says a lot about the current state of anime), the author instead goes for the most traditional, by the book route of creating abilities. \\n\\n\r\nThe main character has a special item that lets him negate other people's attacks, yawn. It's the same thing that's been done over and over again. \\n\\n\r\nMy biggest problem with this series is just that, why have no magic even though you're using the same exact ability tropes as any other magical high school anime?\\n\\n\r\nEverything from the character abilities, to the relationships, to the arc structure, to the character writing, to the sound design, to the shot composition, EVERYTHING feels extremely standard and boring, almost as if it's one of the many mass produced anime nowadays meant only to sell merchandise. \\n\\n\r\nEven with all I've said, if you enjoy stupid battle high school harems either for the mindless fun, the T&A, the blushes, or whatever you fancy these kinds of shows for, it's everything you would enjoy in that type of show, and there's nothing wrong with enjoying some stupid fun. \\n\\n\r\nThere's certainly a crowd that enjoys these kinds of shows and there's absolutely nothing wrong with that. I would be lying if I said that I haven't enjoyed my fair share of these kinds of shows. \\n\\n\r\nIf you want a more full-bodied experience with a show similar to this, Chivalry of a Failed Knight one of the best in the genre.",
            "date": "2018-05-14T21:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 280591,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3299155.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Vyxria",
                "username": "Vyxria"
            },
            "url": "https://myanimelist.net/reviews.php?id=280591"
        },
        {
            "content": "This anime is  decent anime you can watch especially if you like school based anime with fighting and cute girls. The story does not get too deep as it is purely focused around the fighting and the struggle of the main character. In my opinion it is a nice anime to watch and the only reason someone would say that it is crap is because they hate themselves inside and want to ruin the lives of everyone around them. The characters are nice and while you do not learn a lot about them it is fine since that is not the point of thisanime. This anime is meant to be a simple story without too much depth and i find animes like this nice to watch every once in a while.",
            "date": "2017-09-20T22:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 258194,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/168535.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RasenRyuu",
                "username": "RasenRyuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=258194"
        },
        {
            "content": "In short note:\r\nBattle Comedy Harem School. You know, the usual shit.\r\nStory: 6\r\nUsual school setting, with MC being surrounded by girls and \"girls\". MC starts as a transfer student, and works up his position as he conquers one girl after another. Episodic pacing with a new foe appearing on every episode, which ends with one goal, defeating the final boss. At least it has commentaries on martial art and sword-style on every battle scene.\r\nArt: 7\r\nHeroines design was fine, but MC design a bit derpy, and the \"girls\" too, I suppose it was intentional so the Heroines will look much better. The battle scene and the blademovement were fluid, so this one may pass as a battle show. The only downer is that MC finishing move animation that keep getting used every single episode. I guess it can't be avoided, with this episodic structure something will get used again for several times.\\n\\n\r\nSound: 6\\n\r\nStandard bgm during fights and daily live scenes, Op-Ed was ok. Overall, not that noteworthy. \\n\\n\r\nCharacter: 9\\n\r\nThis is a very common genre, with a lot of characters appear on a single show. Many characters appear in them are so bland and forgetful like overused templates. But in this show at least, they are not. Since it has episodic structure, every heroine only have 1 episode focusing on them save the last boss. But even so, the uniqueness of the character stick to the very end of the show. Something that somehow rare in shows with this kind of genre. And the MC is not that wimpy either. Again, something that somewhat rare.\\n\\n\r\nEnjoyment: 7\\n\r\nThe battle scene alone is something to look forward for every episode. And the character uniqueness won't make you get bored with daily life scene.\\n\\n\r\nOverall: 7\\n\r\nThe usual shit genre with some unique Characters and decent fight scenes. Worthy to be watched once at least.\\n",
            "date": "2017-08-02T09:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 254497,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4671138.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NickSpringfield",
                "username": "NickSpringfield"
            },
            "url": "https://myanimelist.net/reviews.php?id=254497"
        }
    ],
    [
        {
            "content": "So I decided to watch this show mainly because action oriented anime intrigue me, I watched all of it because I was determined to write an informed review of a show which I think sends a dangerous message and encourages unintelligent gender based stereotyping\r\n**Some spoilers ahead**\r\nStory 3\r\nThe story is set in an all-girls school which hs recently started taking in male students. In order to \"protect\" the girls from the boys, they are all allowed to carry weapons and there is a council of sorts which distributes punishments to boys who steps out of line or don't submit by feminising themselves. In comes the MCwho refuses to bow down and is a saviour to \"all men\". Honestly this show is like the wet dream of anyone who frequently uses the terms \"feminazi\" or \"SJW\" or \"whiteknighting\".\\n\\n\r\nAnyway my first crtiicism is why is it set in a school? It makes no sense, the characters never go to classes or anything, it just seems like a poor excuse to have teenagers get into awkward erotically charged situations. This could have been easily set in a world outside of a school where women are the dominating gender and it would have had the same effect. Actually that would have made more sense as it feels abit stupid that the council has some weird judicial authority over the other students. But that's never explained to any extent. The school is just a backdrop that could be any location.\\n\\n\r\nMy second criticism is that ultimately the show has a shallow core plot. We have basic motivations to propel the story but they wring hollow when there is such terrible world building because honestly what the anime does is set the stage and then it's the MC fighting one girl after the other.\\n\\n\r\nMy third criticism and subsequently what annoyed me the most are why are the girls on this show so fearful and hateful of the boys? It makes no sense for teenagers of that age. It is literally a way to make the girls seem irrational in their beliefs and ripe for \"correction\" and \"submission\" by the MC.\\n\\n\r\nArt 5\\n\\n\r\nThe show is animated passibly enough. It won't wow you in any way or make you cringe at how terrible it is. And that extends to the art direction which for a show that prides itself on it's ridiculousness is disappointing. I mean the show isn't really stylised or anything so it stands out like for example \"Hyakka Ryouran: Samurai Girls\", neither are the action sequences aimated with any panache like \"High School DxD\", nor are the character designs anything out of the ordinary aside from possibly the cross-dressing side character. I mean I guess for me the ultimate test would be, imagine you saw someone cosplaying as a main character in this show some months down the line after seeing this. Would you instantly recognise who they were? And my honest answer would be no because they all kind of look like any other derivative character.\\n\\n\r\n Everything just feels so bland. \\n\\n\r\nSound 5\\n\\n\r\nI usually skip the Opening and Ending but I went back and listened ot them for this review. They're both alright, catchy tunes but don't seem to stand out or I guess \"fit\" the show but since the show is so generic, I guess it's kinda appropriate.\\n\\n\r\nThe VA's's do a pretty good job considering the quality of the rest of the show, but there's only so much you can do with a  paper thin script.\\n\\n\r\nCharacter 3\\n\\n\r\nWell the fact that even having seen all the episodes I only really knew the names  of 2 characters off the top of my head should tell you how invested I am in them. But let's look at each of them in abit more detail\\n\\n\r\nFirstly Nomora Fudou is our typical hgihchool MC for this type of show. He is cocky, powerful, carefree, noble and lewd... oh you say the last two contradict each other... well yeah they really do, see the thing is Nomura as a character doesn't make much sense. His motivation in the anime is something along the lines of gaining some freedom and the shows creators are content with that being that, it's the basic catalyst for him to challenge the girls to a fight but it does nothing to advance his character in any way or give him any depth. Going back to his nobility/lewdness contradiction, the personality conflict ususally plays out with his interactions with the girls, he will outright flirt with the or make creepy remarks but yet will act all noble and such when they reciporcate or offer themselves (ugh) to him. And it''s not presented in a way where he's playing with them, rather it's a genuine contradiction in his character making his intentions truly hard to follow.\\n\\n\r\nIt has to be said, being a harem show, all of the girls will to different extents gain some kind of feelings for the MC, he will 'break the ice' around their hearts so to speak. The problem comes where all that is truly required is that he beats them in a fight (aka tames them) which does nothing to make them truly intriguing and that's their collective main trait alongside being women who want to subjugate men. But they all have their secondary traits to distinguish them I guess:\\n\\n\r\nOnigawara Rin - The first girl is the stereotypical tsundere character... you've seen them in a number of shows, nothing different. She has a little backstory but it's so transparent that it's just there to show why she is interested in Nomura.\\n\\n\r\nKikakujou Mary - arrogant, rich girl who is half french... again you've seen her hundreds of time and when they come to her focus episode you know where things are going.\\n\\n\r\nHanasaka Warabi - One of two loli characters. Probably the most interesting because of her replationship with her pet bear and is kinda bratty I guess, her moivations aren't made very clear except that she feels the first two didn't do their jobs properly, after she loses she's just kinda there. She is really just the child with the bear.\\n\\n\r\nTamaba Satori - Your first Yandere like character... erm psycho airhead, again nothing much to be said about her. She has some backstory regarding her sister but it's just there to emphasise how unhinged she is.\\n\\n\r\nTsukuyo Inaba - Your second loli character. They imply that shes really powerful throughout the whole show and then in the end she still plays a semi damsel in distres role.\\n\\n\r\nAmou Kirukiru  - Your second Yandere character. She's the main antagonist but she barely has a presence in the whole show and only really appears at the end. Typical psycho with only the basic of motivations all centered around Nomura.\\n\\n\r\nThere are some side characters but honestly they're just there, there's nothing worth writing about them.\\n\\n\r\nSo there you have it, basic character tropes with motivations purely centred around the MC..\\n\\n\r\nEnjoyment 5\\n\\n\r\nIn spite of my criticisms, the show has it's moments. I don't mind the ecchi content and the type of humor that can come with it. Whilst alot of jokes fall flat, it had a few laugh out loud moments such as a hallway scene where Nomura has to hide behind the pet bear so not to be seen.\\n\\n\r\nThe fight scenes were passable but never truly exciting or engaging. I never felt a sense of danger for the MC because ultimately for a harem show about \"correcting\" women you knew he was going to come out on top so they fell flat. I think the best fight scene was likely the first one when you're still assessing the show and learning about the characters. When the second fight scene ends almost the same as the first than you realise the rest of them are likely to follow the same trend and thus they lose all their excitement\\n\\n\r\nOverall 4 (Honestly I don't know how 4 can be \"decent\" and be between poor and mediocre)\\n\\n\r\nReally what can I say? This show will likely please the viewers who see \"feminism\" as the ultimate evil and that women need putting in their place or something. But for everyone else they should avoid it. It does nothing to stand out from the crowd. The \"Plot\" is contrived, the characters are walking stereotypes,the animation is passable though not offensive, the fight scenes won't keep you at the edge of your seat, the jokes can be hit-or-miss depending on your sense of humour. This show tries to combine alot of elements of better anime and ultimately doesn't excel at any of them. Your time could be better spent watching something of a higher quality.\\n\\n\r\nLast little tidbit... be wary of the shows message and really think critically about what it's saying. This show isn't a \"hurrah\" for male gender rights all it is doing is enforcing existing stereotypes for both sexes.",
            "date": "2017-06-30T06:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 251487,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/B_Singh",
                "username": "B_Singh"
            },
            "url": "https://myanimelist.net/reviews.php?id=251487"
        },
        {
            "content": "Busou Shoujo Machiavellianism (Bloody long ass name, gonna call it Busou for convenient reviewing) is an anime trying to combine and revolutionize the shounen action genre along with harem romance but fails miserably. However, it does manage to do a few stuffs right, even though trivial. The theme may seem catchy and innovative at first, but once dwelling into the show it eventually exposes itself as a self-repetitive formula that grows predictable really quickly.\r\nStory (5/10)\r\nThe story starts off fairly cliche; A male character is thrusted forcibly into an all-girls high school... pretty sure I've seen this plot trope somewhere. (/s) Anyways, instead of starting offas a beta male indulging in the unrequited, unexplainable and unreasonable love from all the female cast out of nowhere (Basically all the old school harem genres), the MC, Nomura Fudou, is forced to take on the girls in an action-packed swordfight... only that the male MC uses \"guns\". Not sure how is that fair, but whatever. Even though the story did well differentiating from oldschool repetitive harems, viewers will soon realise the fact that it does in fact offer little to no difference to the newer magical school harem genres (Looking at you Rakudai and Akashic records etc), which is basically having the unbelievably badass main character beat the girls into submission. Are all the female cast masochists or something? Not to mention the formula is used several times, first on the mask girl, then the british trope girl, then a bear riding girl, then Satori (Sorry, shes the only girl I remember in this series) then the auto-counter girl. Everything repeats, not to mention the characters seemingly set up to die always ended up not dying in the end. Oh the suspense, but guess character death shouldn't be expected or else this anime will probably venture into a different genre altogether.\\n\\n\r\nIn short, unique setting, trashbag repetitive execution that disappoints and fails to use the setting into its full potential.\\n\\n\r\nCharacters (3/10)\\n\r\nFirstly we have Nomura, the badass main MC. Oh well, at least this is not some Yuuki Rito so at least hes plenty bearable, but the fact that he never even falters a single bit or breaks down shows little to no character development and character depth whatsoever. Then we have the mask girl, which I reckon to be of the generic tsundere trope present in almost every single anime in the recent years. No idea why she wears a mask all day since her actual face looks much better, but I guess its just a lazy effort to make the character more special? Of course we also have the british blonde, almost mistook it for the Cecilia something from Infinite Stratos since they're exactly alike and the creators literally made no effort to differentiate anyway. The bear riding girl is slightly more bearable since she does not show obvious feelings against Nomura and is plenty more badass than the first two female cast, but forgettable nonetheless. (Also what the hell is that fashion sense?) Then we have Satori who has at least decent depth as the reasons why she became \"emotionless\" and her past are at least explored and touched upon, not to mention she doesn't fit existing anime tropes. After that we have the twintail middle-school girl who is somehow in high-school (Hey its anime, logic doesn't apply here) and then we have the auto-counter girl who obsess with Nomura over a reason normal humans should not find as a reason to obsess over with, but guess hyperbole is the only way to go when the writers cannot think of a decent reason for her to go over the male MC.\\n\\n\r\nAlso, they introduced lots of side characters, but apart from the ugly ladyboy no one is even close to rememberable because they are fucking irrelevant anyway.\\n\\n\r\nArt (7/10)\\n\r\nThe fighting scenes doesn't really flop in animation, and the art are generally okay compared to recent animes so not much of an issue there. The detail in the twintail girl's eyes are nice to see at least.\\n\\n\r\nSound (5/10)\\n\r\nThe opening theme is quite catchy, I've always find myself listening to the first part of the OP but right after the dedededededede sound finishes I skip to the main show anyway. ED is forgettable. I've not noticed any outstanding OSTs as well, but nothing unbearable.\\n\\n\r\nEnjoyment (6/10)\\n\r\nDespite being a repetitive formula, the show still manages to bring me some enjoyment. Once you shut your brain off, ignore the details and the obvious predictions that this and that are going to happen (And it definitely does), at least the fighting scenes are quite enjoyable and the suspense brought to the brink of death of some characters kept me slightly on edge (BUT THEY DIDN'T DIE IN THE END WHAT A SURPRISE. COME ON.)\\n\\n\r\nOverall (5/10)\\n\r\nIn short, if you are expecting quality or innovative material / plot, look away. However if you are looking for something random and ridiculous to fill your time this can be an okay choice, considering its much more bearable compared to dirty copypasta harems like Hundred and the likes, but generally you shouldn't come in bearing expectations for anything spectacular.",
            "date": "2017-06-26T11:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 251114,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3790153.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/sToRMyQ",
                "username": "sToRMyQ"
            },
            "url": "https://myanimelist.net/reviews.php?id=251114"
        },
        {
            "content": "So guys... how should I explain this? Do you remember when you were a kid and you had to eat those veggies your mom cooked for you? Well I do and I seriously always hated it but the meal always came with veggies and some meat. You see, i would always take a bite from the meat and then from the veggies. The veggies tasted like fcking crap compared to the meat. And it would go on like this, every single meal. \r\nAnd the same thing is happening to this anime here. I mean honestly this isnt anything good, mediocre at best. But the thingis, when you always watch good anime, like anime with the score of 8 or higher, then at some point you dont realize how awesome it is. You gotta watch the anime thats a bit \"shittier\" after the good ones or else you (or maybe just I) wont be able to enjoy the good ones. And i took a long time to realize that. To realize that the veggies made the meat taste so awesome. And to realize that the veggies tasted like shit because they were made by my mom.\\n\\n\r\nStory - 5\\n\\n\r\n-little spoilers (only the first few episodes)-\\n\\n\r\nIt isnt anything special. A dude comes to a school that has recently become coed after being a girls only school for a long time. And the girls were terrorized from the guy so they began to wield weapons. The dude is a typical guy who seems weak af at the start but then has some hidden tricks and skills and starts beating the girls who wield those weapons. They then fall in love with him and stuff like that, so generic.... but not really bad because its a safe plot i guess...\\n\\n\r\nArt - 8\\n\\n\r\nArt is probably where they can score the most. Characters are looking good and the background and scenes as well. The anime earned itself a praise here *hurray*\\n\\n\r\nCharacter - 5\\n\\n\r\nLike i said, the guy seems weak but then has hidden skills. So nothing special about the dude. The girls (black hair and blondie) who fall in love with him are basically the same character but with different appearances. Both highly tsundere, both in love with MC... The only difference may be their fighting styles.\\n\\n\r\nEnjoyment - 7\\n\\n\r\nI actually quite enjoyed the fights. The MC has his special hand to hand combat skills whilst fighting against swords. Here perhaps we have something original.\\n\\n\r\nOverall - 6\\n\\n\r\nThey go with a plot and character which were already used in many other animes. The result is that the anime isnt particularly bad but isnt anything special. As an anime you watch whilst eating your meal or something i can probably recommand it. But if you are looking for deep plot or something mind breaking, this definitely is the wrong thing for you. \\n\\n\r\nP.S. pls dont hate me for my opinion >.<",
            "date": "2017-05-28T12:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 248742,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5706033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SemperAugustus",
                "username": "SemperAugustus"
            },
            "url": "https://myanimelist.net/reviews.php?id=248742"
        },
        {
            "content": "In many respects this show is nothing we haven't seen before. Even the \"first boy to enter a previously 'all girls' school\" gimmick has been tried and I have to be honest, although i've watched my fair share of harem as something of a guilty pleasure i still consider it to be the lowest common denominator out of all of the genres short of maybe \"magical girls\".\r\nBut all that said and out of the way, this show is not as it would appear by its cover alone. Ironically, despite the above being major pet peeves of mine, another is what i have come to dubthe \"Satsuki Kiryuin\" (Antagonist from Kill la Kill) Syndrome of high school plots. That in which the school president is always a female and controls more power than most mafioso bosses would care to brag about in public. Under which of course, all the boys are powerless to defend themselves or their dignity. I'm all for strong female characters, but this trope is so exhausted at this point it completely lacks any mental flavour. Fortunately, we're given hints to the humanity Satsuki Kiryuin of Busou Shoujo' a lot sooner than is typical of this character archetype, making her feel much more like a person.\\n\\n\r\nThankfully, this show's main character comes from the Kazi no Stigma school of thought; where not only is he also a competent badass himself, but is also not afraid to duke it out with the ladies. A welcome tangent from the tired cliché's of contemporary chivalry we're saturated with these days. That's not to say he isn't a gentlemen when he feels like it, but the mix of minor narcissism and ego is a welcome ingredient we don't get enough of from our average MC's.\\n\\n\r\nUnfortunately, beyond the primary protagonist and antagonist the show unashamedly falls into some expected tropes, you could literally cut and paste the supporting characters from \"Hundred\" and been none the wiser. It is sad when a character exists purely on the merit of their cuteness, but this is part and parcel of a harem plot i suppose and i can only say it doesn't exactly fail in its intentions so i can't mark it down too much.\\n\\n\r\nThere's really not too much to be said about the story itself, it's a fair foundation for the concept, i suppose \"if it aint broke, don't fix it\" applies here. Starting fresh in a new school environment is a common fantasy of many of us, even if it isn't original it is universally relatable; as is, for guys, getting into lewd situations with the ladies.\\n\\n\r\nOne certainly can't really complain about the art either, it is more than sufficient with a pleasant attention to detail. In a way that is a skill in and of itself for the artist. Knowing where to invest your time and talents, the detail is exactly where it's needed, when it's needed and i can really appreciate that as a viewer.\\n\\n\r\nThere is a certain element of parody/irony involved as far as the humour is concerned which i can also fondly appreciate. It's not really a part of the story per se and frankly speaking the story could be a lot better if it really wanted to to make the show a real piece of art, but it's doing an adequite job of supporting the characters to get the basics in and the humour is just a bonus for enjoyment.",
            "date": "2017-04-26T20:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 246388,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5840782.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/grazr",
                "username": "grazr"
            },
            "url": "https://myanimelist.net/reviews.php?id=246388"
        },
        {
            "content": "What to say without sounding like all the others...?\r\nMisunderstood MC that gets a harem by the end.enjoyable than I thought it would be. \\n\r\nThe anime has a lot of fanservice. Upskirts, Gals fighting the MC in the nude, and the female MC's falling for the main. At times it can feel almost like a hentai rather than an anime, but it never really progresses into that (well, not until ep 6 anyways).\\n\r\nWe get to learn the backstory of the characters, and it leads to more romantic situations. Granted, they do push the envelope a bit (ep 6 again. Beware of the bear. That's all I'll say, just be prepared).\\n\r\nOverall, I rather enjoyed this anime. Most of it is the MC convincing the female MC's that he isn't a bastard, getting all geared up for the end fight. \\n\r\nWould I recommend to anyone bored of the typical OP MC transfer student stories? Yes, I would.\\n\r\nWill I be watching again? Possibly. All depends on my mood.\\n\r\nDo I need to find another anime to enjoy? Yes. Although, I am \"Watching\" 110 and have 120 in my plan to watch. So, I think iI'mall good for a while!\\n\r\n-JNutt22",
            "date": "2018-11-04T21:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 293384,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875813.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JNutt22",
                "username": "JNutt22"
            },
            "url": "https://myanimelist.net/reviews.php?id=293384"
        },
        {
            "content": "An ecchi harem anime, where girls were wielding swords, and the guy had…invisible gun on his hands?!?! Sigh. It’s really absurd but it works.\r\nThe story went full circle at the very end, but it lacked impact. The suppose climax scenes didn’t give off enough thrill to make me appreciate it. At least I find the pacing good. The art and animation is on par with other animes, nothing new. The characters were meh. Even the main character was boring. There’s a bit of character development on some of the cast, but it didn’t save the anime.\r\nI did enjoy watching the all to common anime tropeshappening in the series. I also like the fact that they elaborate and explain every sword technique that was happening on screen. As viewers, we are after all not familiar with those information. I do want to know more about the Tamaba twins. Their situation wasn’t fleshed out much.\\n\\n\r\nI think this anime will appeal to the fans of the said manga and to the fans who like ecchi and harem animes. If you don’t belong in both of the mentioned groups, well, its your choice if you want to watch this or not.",
            "date": "2018-10-22T00:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 292280,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3763589.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AngelWin14",
                "username": "AngelWin14"
            },
            "url": "https://myanimelist.net/reviews.php?id=292280"
        },
        {
            "content": "This anime is the definition of \"meh\".  It's just another \"seen one, seen them all\" harem anime.  It's the exact same plot as always: Rebellious, highly skilled male enters a world of hostile females and conquers their hearts one by one until the climax comes and is the usual, cop-out finish.   This one however, tended to have more logic holes than most.  For example: (Spoilers): \r\nThe goal of Nomura was to get all the stamps of all the 5 swords girls.  But, the point of this was never explained and once he got them, he used them for areason that he didn't even know he would need it for until the final 5 minutes of the episode.  So, what was his actual purpose in attaining them?  Not explained.  \\n\\n\r\nThe relationship between Nomura and Amou is based off of a 10 minute interaction.  You go the whole anime thinking there was something deeper between the two and their history, but it was literally a handshake, a brushed off tour and some little pink haired trap getting punched.  \\n\\n\r\nAnd of course, there was the nonsensical \"joke\" the Headmistress decided to play at the end, all to build up tension in an anti-climatic, cliched anime.   \\n\\n\r\nThe plus side of the anime is that Nomura was kind of cool for an MC.  Cocksure, rebellious, not a \"nose-bleeder\" in the face of sexuality, but not pervy, either.  The rest of the cast however, was your cut and dry harem.  The rigid rule-keeper, the western influenced character, the really out there one, the quiet one, and the arrogant one.  About the only mild difference here was Amou the Yandere final boss.  But, the connection was so weak with her and Nomura, it just kind of fell flat.\\n\\n\r\nThe action was interesting, but not anything particularly amazing.  I hate animes that talk about \"killing\" in a setting where you already know no one is going to actually die. It's just stupid.  That took away from some of the action, as I spent more time thinking like: \"Yeah, sure they're dead.\".   \\n\\n\r\nIt wasn't a total borefest, obviously, because I watched it all.  It has some moments of humor in there and watching Nomura is interesting.  But, overall, this was a completely mediocre harem anime and you don't really need to waste your time watching it.  \\n\\n\r\nStory: 5\\n\r\nArt: 5\\n\r\nSound: 5\\n\r\nCharacter: 7\\n\r\nEnjoyment: 6\\n\r\nOverall: 5",
            "date": "2018-08-15T18:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 286577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=286577"
        },
        {
            "content": "---Spoilers Ahead---\r\nWhile reading the episode comments for this anime, you'll notice a great many people referring to it as a feminist's dream or something similar.\r\nThis show, however, represents the opposite of feminism and any true feminist will be utterly disappointed by it. Initially, the girls all loathe and distrust men, true. They attack the man protagonist without cause and generally make his life miserable. But, this is representative of society's misconception for what feminism is all about. These girls start out as the \"feminazi\" stereotype, violent, hateful and overbearing. The MC is introduced as someone just wanting a fresh start who wants to put hispast behind him and lead a peaceful existence. He's not allowed to do that though, due to the \"feminists'\" distrust and violent tendencies. They immediately begin attacking him and putting him in a position in which he has to defend himself. The man is made the victim.\\n\\n\r\nUltimately, through the awesome power of his male-ness, he defeats each female in turn. After each girl's defeat, the former \"feminist's\" actions are those of a woman who cannot overcome her adoration of her abusive spouse. Every girl who has fallen into the MC's harem only did so after being defeated by him and sexually intimidated by him (even if mistakenly so). Each girl was \"put in her place\" (so to speak) by a male and went from powerful, angry, dominant women to subservient, starry-eyed bubbleheads. \\n\\n\r\nAt the story's end, all of the females have been knocked down a peg by the main villain and need to be rescued by their knight in shining armor, a male. The main villain is, of course, a psychotic woman whose only motivation seems to be that if the male protagonist won't be hers, then he must die. \\n\\n\r\nThis is not feminism. This is a male fantasy of overcoming feminism.",
            "date": "2018-04-17T10:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 278314,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3162155.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Talon184",
                "username": "Talon184"
            },
            "url": "https://myanimelist.net/reviews.php?id=278314"
        },
        {
            "content": "Males who are feeling angry at and frustrated by women might like this show.  I was in this mood when I watched it (normally I would have dropped it after a couple of episodes), but it left a nasty “taste” afterwards.  An over-powered MC who subdues an all tsundere harem by beating the girls up (and they are depicted as deserving it) in order to “help” them.  \r\nFemales, I would guess, are likely to hate this show.  It features an extremely prejudiced view of feminism as being nothing but hatred of males.  While there are feminists like this, in myexperience at least they are a small minority. \\n\\n\r\nEven within it’s own context, this series has serious flaws: no plot, poor characterization, no character development.  Art, music are ordinary — actually by current standards, below average.",
            "date": "2018-04-16T20:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 278282,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3812075.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/reherd",
                "username": "reherd"
            },
            "url": "https://myanimelist.net/reviews.php?id=278282"
        },
        {
            "content": "If I had to describe this series with one word it would be \"workmanlike\" if you pushed me to two words the second would be \"nonsensical.\" Ultimately the series is what it is, a by the numbers slightly ecchi action series. It's a typical genre piece that does little to expand or flaunt the genres confines. If you enjoy those kind of shows then you'll get a comfortable three or four hours of entertainment out of this. If you don't then I wouldn't bother watching it. The show knows what is is and it achieves its aims, which is perhaps laudable even if the finalproduct is not. \\n\\n\r\nI suppose the one thing that rankles is that the setting is complete nonsense. It seems to be set in the school just so they could use the visual trappings. The theme is pasted on at best. You could effortlessly transport this to any other setting and not a lot would be changed or lost. Even if you swallow \"the big lie\" after a few episodes you can feel your suspension of disbelief straining under the weight of murder, eyes being sliced (I am un chien andalusia) and various other acts that come largely out of left field. The show has an odd tonal dissonance that can be offputting at times.\\n\\n\r\nAll the same, at its worst its mediocre, there's plenty of room for criticism so its a little sad that some reviewers feel the need to fabricate failings for a show that has so many you could harp on e.g. complaining that the antagonist was an old friend of the protagonist when it is explicitly clear this isnt the case. \\n\\n\r\nAnyhow, at the risk of repeating myself, if you're a fan of the genre and you want something to burn some time then give this a watch. If not, then move on. Ultimately it serves its purpose, and likely its creators intent, as entertainment.",
            "date": "2018-03-03T17:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 272943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/277180.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Uthred",
                "username": "Uthred"
            },
            "url": "https://myanimelist.net/reviews.php?id=272943"
        },
        {
            "content": "For ones who doesn’t like to read a walls of text: this show is and lacking in graphics and sound, have generic characters and story, with that said it is still manages to keep you at the screen, because ultimately it is trashy shounen-comedy, which is still amusing to watch.\r\nLet’s start with the fact that this work doesn’t look promising from the synopsis, because the story of protagonist enrolling in a new school is well known for it’s wide usage in shows that prefer to slap your face with a “plot” instead of working on story or developing characters. And like that was not enoughthe show immediately slaps us with the second clishie (all girls school become co-ed) to justify the amount of “plotwearers” per centimeter, but, oh, the harem and echhi tags are nowhere to be seen! Was I misjudging it the whole time? Let’s move on and see.\\n\r\nAnd now we are moving on to the part where I can finally express all the mixed feelings that I got from this show.\\n\\n\r\nStory – 3: \\n\r\nThere is no much meaning chattering about almost nonexistent story in the show, which simply reusing shounen formula (character finds a rival, defeating him and befriending/getting him out of the MC way) to create a minimal sense of progression. And yeah, sure one can argue that closer to the end we will get ideological fight between old rivals, but that does no change the fact that all show might be described with one sentence without loss of information. \\n\r\nBUT there is a wide space for discussion it’s structural flaws and where it fails and succeed in it’s tries to achieve the goal of being an entertaining show: And first step in this is actually find out what the show tries to deliver to the audience, as you might’ve seen or guessed the comedy + shounen mix, does not necessarily need a deep and complex storyline to shine, so the trouble is obviously not in the shallowness of the story, but rather in a way it working with a tension and delivering… well trying to deliver atmosphere to the audience: from the very beginning the MC looks like a underdog, but manages to surpass any difficult situations he faces, and while this is a typical for the shounen genre to come with that type of fights this show in particular over exaggerating  the fact that “good” character are underdogs by such a degree that instead of tension it builds us the comic atmosphere, which looks rather depressing from the viewers perspective. Which might be considered a good thing in a situation, when show by itself comes with a playful attitude it’s just enhances it. Unfortunately, when it actually tries to create a dark or tragic atmosphere it fails miserably due to that simple mistake, as a result most of the fight scenes looks dull and boring.\\n\\n\r\nGraphics – 2:\\n\r\nThis is the part is one of the most essential parts in a shounen series, because without a good graphical part it is literally impossible to create satisfying fight scenes. And this is the place where you going to slap yourself into the face a few times, because oh boy it feels like the author does not know anything about fighting or artistic ways of creating a fighting scenes. So what do we have here? The artstyle is pretty simple, the action scenes are quite slow and unartistic, big thanks to our beloved typical anime troubles such as “compulsive technique name showing (yep, not even screaming showing)” and total misrepresentation of the weapon damage, and don’t get me wrong, I’m not asking for ultrarealistic fights with structural damage after just a one sword hit, but this time around the anime represents weapons as something utterly useless, because the ultimate bladed weapon in this show is bare hands… I’ve seen a lot of weird things but in anime before, but this is just too much… And if you ask me why it got into graphics section? The reason is simple the problem is exactly in the way they draw the wounds.\\n\\n\r\nSound – 1: \\n\r\nMusic is not only essential for almost all genres, but it is pretty much a defining feature of anime as a whole. Shounen genre in particular wants the flashy backgrounds for the fighting scenes, but instead of juicy epic soundtracks this show provides us with literally nothing, but disappointment. The OP an ED songs are the essence of the word generic, the BG is almost not existing.\\n\\n\r\nCharacters – 5:\\n\\n\r\nDespite all characters of this show is suiting the whole theme of 100% clished, they provides enough for he show to fulfil it’s needs. Some of them are even getting some actual background info in the later parts of the show, which does not help the to evolve from onetrope effigies state, but at least gives the viewers some reasoning behind their actions earlier on. \\n\\n\r\nEnjoyment – 6:\\n\\n\r\nWith all that said show still manages to look good due to the unpretentious needs of it’s genre mix and provides an interesting experience, when you are seeing that the show is terrible by the nature, but still continue to watch, because it’s manages to amuse you in a special ways, which is not available for the good shows (such as constant “can it become even worse?” question in a positive way).\\n\\n\r\nWith all that said I think that you have already got pretty accurate idea of what show will give you, so I feel that forcing my opinion onto you at the very end would be a bad idea.\\n",
            "date": "2018-02-21T23:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 272151,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 1,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/XaskisX",
                "username": "XaskisX"
            },
            "url": "https://myanimelist.net/reviews.php?id=272151"
        },
        {
            "content": "Hoo boy, this is a weird show. \r\nLet's keep this review short\r\nWoah, what a ride. Started out pretty generic with it's \"oops I kissed this girl, now she's in love with me but also a huge tsundere\" and kind of kept pushing tropes until like, episode eight or nine when things start getting real crazy. Like, woah, I think I just watched someone die. What kind of school is this? Like, forget the whole dudes cross dressing, that chick just straight up murdered like five people (except not, because anime magic makes for happy ends)\r\nIf this show was more than one season, then maybe itcould've fleshed out the tiny glimpses of interesting character development that we saw. It wasn't, and therefore didn't.\\n\\n\r\nOverall, a guilty pleasure show that's definitely below average. Don't let that stop you from watching though, there's a fight scene with a naked chick and a couple good \"oh snap\" moments.",
            "date": "2017-12-30T09:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 266870,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/267870.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/dgpl",
                "username": "dgpl"
            },
            "url": "https://myanimelist.net/reviews.php?id=266870"
        },
        {
            "content": "Like many, surely, i read the description of this show and expected an awful anime series, that can only be watched to mock it afterward.  While that assessment was not entirely false, i cannot deny that i got a lot of genuine enjoyment out of Busou.  \r\nIf you've seen Tenjou Tenge, this is basically a soft parody of that.  It's unclear to me whether that is its intention, or if they were actually trying to be cool.  But i suppose intent is irrelevant, and i will only consider the things i felt while watching.  Structurally, the show alternates between twomodes, the serious battles and the tropy, goofy slice of life.  In that sense it is reminiscent of Full Metal Panic, though the \"serious\" is much less serious.   During the fights you'll have freeze-frames with \"epic\" calligraphic move names being printed on the screen.  It's impossible to take seriously, and the silliness of some of these brought on many a laughter.   The SOL elements are usually cliche after cliche, but every now and then they'll drop a genuine-hilarity-bomb on you, so you have to stay on your toes.\\n\\n\r\nBut what really makes this show enjoyable is the protagonist.  For once we are not forced to witness \"pure\" maidens all mysteriously falling for the most boring hetare piece of shit.  No, here, you get to self-insert as the alpha who literally beats the girls into submission, while not really giving a fuck.  I find it a very satisfying way to bring the \"dere\" out of these heroines.  I can also just imagine some fat feminist dyke watching this and getting upset over how problematic it is, and it only makes my metaphorical patriarchal boner harder.  The girls themselves are usually pretty lovable, though not very original.  One of them is a bear, by the way, and yes, the bear gets lewd. \\n\\n\r\nIn a way, i would have loved to see a 25 episode series out of this, so i can enjoy more of these characters, and so the plot could evolve beyond \"conquer each girl one by one and tack on some faux-drama for the finale\".  Alas, the rational in me can see that there is nothing there.  The \"backstories\" are stupid as hell, the context doesn't exist, there is no adult character, no reason for anything to happen.  It's just an empty shell of a show designed to deliver some quick and effective entertainment; it does not have the depth or coolness of Tenjou Tenge.  Knowing that, the creators should have gone ham with the parody elements (and fan service!) and thrown away the serious entirely, but it is what it is. \\n\\n\r\nOverall, a harmless, entertaining anime with good visuals and comedic elements.  Recommended viewing for all misogynists.",
            "date": "2017-09-12T16:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 257367,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/summitsama",
                "username": "summitsama"
            },
            "url": "https://myanimelist.net/reviews.php?id=257367"
        },
        {
            "content": "At first when i saw this anime, I thought this gonna be some hardcore stuff really. The first episodes where good, but as you enter into the story more you realise that it's an anime that ships hentai to maintain the audience, and using some \"deja vu\" accident situations, to create in the end a harem for the main character like many other anime that pursue the same scheme to build their universe.\r\n   Overall this anime doesn't deserve much attention, but if i'd say if something is good in it, i'd probably say that the art and combat animations aregood and entertaining.",
            "date": "2017-08-12T17:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 255286,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5691705.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HaroldUlric",
                "username": "HaroldUlric"
            },
            "url": "https://myanimelist.net/reviews.php?id=255286"
        },
        {
            "content": "This show is about a boy who goes to a school cause he got into one little fight. At this school are girls who rule over the male students. Our male MC doesn't conform and has to fight. That's the story. \r\nI'm not sure what the show was going for but if it was mediocrity, nailed it. \r\nStory:3. There wasn't a story beyond the synopses. If you've seen one battle harem you've seen this one and it's the bottom of the barrel. \r\nArt:5. Meh. \r\nSound:5. It has audio. Nothing exciting. \r\nCharacters:2. They are as shallow as you can get. I felt like 2, maybe 3,of the characters were MEANT to have depth but the crew meant to dig the hole never showed. \\n\\n\r\nEnjoyment:4. It was a decent way to kill some time while waiting for something better to release. \\n\\n\r\nOverall:5. Look, if you want a high school battle show with an aloof MC that has to fight the strongest 4-5 students in the school then go watch Beelzebub. That show has literally everything this one was missing PLUS a demon baby. Trust me.",
            "date": "2017-07-30T20:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 254281,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SuperCheese88",
                "username": "SuperCheese88"
            },
            "url": "https://myanimelist.net/reviews.php?id=254281"
        },
        {
            "content": "It had some good moments but was below average in some animations and story elements. However, I kept coming back for the interesting premise and how the characters interacted with each other. \r\nMost poorly drawn scenes are seen at the beginning of the series and the errors show less often. The series also wraps things up too quickly, like they were pressed for time so they crammed the rest of the story into the last two episodes.\r\nArt: 6\r\nThe art is fine, besides the errors I discussed. I was hoping for the animation to be more fluid, but it stayed in the realm of possible motionfor the most part.\\n\\n\r\nSound: 6\\n\r\nNothing to complain about\\n\\n\r\nCharacter: 8\\n\r\nIt has the basic harem characters, but also some other ones that are interesting, but not totally amazing. \\n\\n\r\nEnjoyment: 7\\n\r\nI liked it, for the most part despite its many flaws.\\n\\n\r\nOverall: 6",
            "date": "2017-07-04T15:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 251947,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nathan_B",
                "username": "Nathan_B"
            },
            "url": "https://myanimelist.net/reviews.php?id=251947"
        },
        {
            "content": "I'm more into romance anime. I saw this, I already said \"pass\". Again, a friend recommended it to me. I regret saying \"pass\" today. It's a very good anime if you're into bad-ass main characters.\r\nAt first, I didn't like the anime because I don't like delinquents that much, I'm into intelligent gentlemen. But I didn't hesitate to continue. Continuing to watch this series, it has caught my attention. I realized there was a bit of romance and the anime is action-packed, which is really good. \r\nStory - Unique story but it is somehow strange. I don't understand why the boys have to cross-dress. Just punishingthem is fine. I think it's a stupid idea, don't get me wrong. Aside from that, the main character is opposed to cross-dressing, well, he wants freedom. Not gonna post spoilers, but it's really good, a bit rushed, but it has a unique, beautiful concept. 7/10.\\n\\n\r\nArt - The animation is good, hands down. The animators put a lot of time creating the action scenes. The character designs are pretty nice, but I don't understand why the main heroine was told to be ugly, when she is heavenly cute. I've got only a few to say here so I'll just rate 8/10.\\n\\n\r\nSound - The voice acting is cute in this one. Again, the voice acting is filled with effort, and I like it. Oh and I don't skip the OP's of this anime, it's beautiful. 8/10\\n\\n\r\nCharacter - Unique characters. A delinquent, a girl who isn't self-confident about her own face, a girl who is emotionless, and a whole lot more. The chemistry of the main character to all those girls almost make a harem, it's good. The likability of the main character is really high, even those who are opposed to his characteristics will like him. 8/10\\n\\n\r\nEnjoyment - I'd say I enjoyed it. Though in some episodes, I fast forwarded a bit because it bores me. But aside from that, it is really enjoyable. 7/10\\n\\n\r\nOverall - 8/10. Surprisingly good. I highly recommend this to those people who like action-romance anime that doesn't involve intense amount of magic.",
            "date": "2017-07-01T02:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 251622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ezrasantos627",
                "username": "ezrasantos627"
            },
            "url": "https://myanimelist.net/reviews.php?id=251622"
        },
        {
            "content": "Sometimes dumb fun comes in very strange places....\r\nLA didn't expect Busou Shoujo Machiavellianism to be just dumb fun all things considered as LA originally HATED this show from the start, from the utterly cliched beginning of the main protagonist by the name of Fudou Nomura voiced by Tasuku Hatanaka who happens to be a god damn badass being sent to a school ruled by the Five Swords bringing in the entire Tenjou Tenge or Ikkitousen route.\r\nIt wasn't until Mary Kikakujou arc finished where LA started to realize that you kinda had to remove any seriousness from this anime otherwise you would just dislike this showjust because of the absurdity and clicheness of it all and really it wasn't until Warabi Hanasaka's arc where LA just started to embrace it all and yes...Warabi voiced by Rina Hidaka was LA's favourite character from this series just from her formality to Tasuku after her arc ends and she doesn't fall into the entire misunderstandings scthick that these kind of anime pull, plus...she has a god damn grizzly bear as her transport AND bodyguard so yeah. Rin Onigawara as a character is that of the typical tsundere...more tsun than dere but her dere is passionately dere and \"worth it\" however Rin is essentially your Yukina to your Kojou from Strike the Blood and this sticks. Mary however is what happens if Sayaka and Yukina were actually proper rivals and hate each other to Kojou and that's really her scthick along with her spouting French words here and there. Satori Tamaba voiced by Nozomi Nishida is your unsympathetic yandere type character and really is your shameless fanservice character though she is more clever than Warabi is many ways. Second to last is Tsukuyo Inaba voiced by Natsumi Hioka and even though her arc ties into Kirukiru Amou voiced by Eriko Matsui, she just has a really simple plotline following her, namely wanting a friend and seeing Tasuku as a friend. Finally is the aforementioned Kirukiru in which Tasuku prior knew about her and is essentially the final boss of this anime and Kirukiru's motivation does make sense though her have nothing but fighting in her mind and being kinda a jerk as well as her motivation changing into a romantic type instead of a battle heavy one kinda came out of left field.\\n\\n\r\nFrom all this what got LA to change from hating this anime to seeing as dumb fun?...well from the detailed martial arts techniques to the absurdity of scenario and fights mashing together with the harem elements just made all this turn into just dumb fun, sure LA can just turn off LA's brain for this and sees nothing but dumb fun, but turning on LA's brain can get the dumb fun from how absurd the scenario is as well as the fighting techniques into the mix....but how LA says about this anime is completely up to the audience, it's just how LA sees this anime.\\n\\n\r\nThe animation done by Silver Link and Connect kinda helps as it does have some fluid animation at times especially the martial art battles and LA really liked the character designs overall though as they really pop at you from all the differing and *ahem* exotic designs of the Five Swords.\\n\\n\r\nAs for voice acting?.....Yuuki Takeda as Rin and Sayaka Kitahara as Mary were LA's favoruite voice actors in this anime, Eriko Matsui was good in the more villainous vocals but not enough for LA to favour Yuuki and Sayaka more.\\n\\n\r\nBusou Shoujo Machiavellianism for LA is LA's dumb fun show for Spring 2017...not near guilty pleasure anime as Busou Shoujo Machiavellianism's flaws are still prevalent and glaringly obvious (LA's initial hate for this anime) and probably even worse for those who has \"seen something like this before\", nonetheless...Busou Shoujo Machiavellianism is dumb fun nothing more nothing less.",
            "date": "2017-06-24T02:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 250833,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=250833"
        },
        {
            "content": "Hey folks, this will be a review for Busou Shoujo Machiavellianism. Before we get down to the nitty gritty, it is only fair to tell you that you are about to experience the GroveWarden school, secret technique: \"Shitty review\". You'll hopefully get this joke if you unfortunately decide to watch this travesty. \r\nThe story is fairly crappy. Or at least its told poorly. I am a sucker for bad story and terrible plot development, but this one was just silly. You get the story in batches, however the main plot revolves around a boy who joins what is now a CO-ED school. This school ispopulated by woman who are afraid of men and are armed and given the power to run the school. This part of the story goes on for most of the show. Our main character must fight for his freedom in this female ruled school.\\n\\n\r\nCertain characters have flashbacks or outright tell you some parts of their story. However these moments are few and far between and by the end they add up to nothing. We know a tad bit more than we did in the first episode, but not enough to warrant them trying to elude to a some story as much as they did. This show also ends on a cliff hangar, which made my already thin tolerance for the show break. I cant imagine something this poorly done getting a second season, and I am not going to go out of my way to see how it ends.\\n\\n\r\nThe art and soundtrack were decent.\\n\\n\r\nThe characters were annoying? I have that as a question because though they were undoubtedly annoying, I also found a few moments charming in the cheesy way. Most of the show revolves around our main character who is this cool delinquent type. The other characters are made up of the \"5 swords\" of the academy, who are I guess the strongest girls in the school. At first they all hate the main character and with his few well chosen actions, words, and fists he manages to make most of them fall for him one after another. The girls were pretty standard, the busty European girl, a crazy-esque misunderstood girl, and a super loli. The only character I liked was Onigawara, Rin as her character was a bit new, though flat.\\n\\n\r\nI didn't really enjoy this anime. It almost felt like it was a parody with how cheesy the dialogue, and pacing was. The anime drags its feet the entire show. Main character and female character are about to fight. Long winded explanations that could have been just shown are instead thrown at you. After that you watch the main character get his ass kicked for a minute to build up the suspense. Maybe this time he will lose or have trouble winning you supposed to think. Then the our MC OneTouchMan ends the fight says something cool and the girl is inexplicably interested in him and switches to his fan club. Rinse and repeat.\\n\\n\r\nThe last two episodes or so step up in intensity. We are finally introduced to the \"final boss\" the Empress. This is also a cheesy encounter which is unfinished. \\n\\n\r\nBy the end of this anime we know nothing about this world, its characters, or even why things are happening. I normally don't point out that anime is unrealistic, but this show is a bit crazy. For all we know these people are humans with no particular skills or reasons for having things like a trapped dormitory which Indiana Jones would have trouble escaping. Why the girls are allowed to carry weapons and inflict pain or serious injury on people whenever they wish. We also don't really know how the hierarchy of the 5 swords works, because the big boss is the first girl we see, yet they seem to get more and more powerful as the show goes on. Honestly I would have dropped it if I wasn't curious about the Empress, and of course the pleasure of shitting on it here. There are plenty more examples that I'm not posting here. However they all revolve around the same theme of a filler anime, in which things are poorly written and conceived. \\n\\n\r\nTLDR: Anime is crap. Almost a parody of crappy school battle shounen. Not comedic, doesn't have a good story, or enjoyable characters. I wouldn't waste my time.",
            "date": "2017-06-21T20:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 250610,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=250610"
        },
        {
            "content": "the most enjoyment anime spring 2017 with absurb story every week watch this anime i've never bored :)\r\nthis plot like shonen fight win become nakama (friend) repeat again > but every episode do new unique technique it's make me not bored for watch this series and a lot of funny mc.\r\ni'll say pretty good as usual silver link with standar quality  but some charcter look likes bad.\r\nintersting lame bgm when mc do some technique still good, opening i dont like but the ending is better.\r\noverall 7 for Busou Shoujo Machiavellianism  this recomended for u search some funny shonen anime with absurb fight, foru like cute girls and badass action i willl not recomended :)\\n\r\nthaks :)\\n\r\np.s : mc best, i dont like every girls in this anime -3-\\n\r\nStory 6\\n\r\nArt 7\\n\r\nSound 7\\n\r\nCharacter 8\\n\r\nEnjoyment 8\\n\r\nOverall 7\\n",
            "date": "2017-06-14T17:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 249919,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6317239.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/yuukagamine",
                "username": "yuukagamine"
            },
            "url": "https://myanimelist.net/reviews.php?id=249919"
        }
    ],
    [
        {
            "content": "Busou Shoujo Machiavellianism\r\nThis show is a yet another disappointing dive into the panthalassa of light novel adaptations. \r\nWhile not egregiously bad, there is not enough offered here to recommend it to anybody. It's simply too mediocre to enjoy for its goodness or badness.\r\nThere are plenty of waifus of varying archetypes here. Main character has his moments but at times comes across at trying too hard NOT to be cliche. Action is competent and comprehensible but pretty lame with some scenes being minor exceptions. \r\nWe haven't quite reached the bottom of the barrel of harem light novels here, which may be an even bigger turnoff tosome. Even if you're looking for outright trashy entertainment you could do a lot better than this.\\n\\n\r\nPros:\\n\r\nSome good music\\n\r\nSome action\\n\\n\r\nCons:\\n\r\nCardboard cutout characters\\n\r\nGeneric story\\n\\n\\n\\n",
            "date": "2017-06-26T21:07:00+00:00",
            "helpful_count": 0,
            "mal_id": 251165,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6347272.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/EmiShortReviews",
                "username": "EmiShortReviews"
            },
            "url": "https://myanimelist.net/reviews.php?id=251165"
        },
        {
            "content": "Busou Shoujo Machiavellianism is an interesting anime. It follows the tried-and-true school setting, but still manages to put an at least somewhat unique twist on the genre, with a few hints of originality here and there. It's hardly a masterpiece, but for some reason I couldn't bring myself to dislike this show.\r\nThe story isn't anything special. Troublesome boy attempts to escape a matriarchal academy by defeating sword-wielding girls in combat. I'm sure everyone who watched Prison School got a somewhat nostalgic feel from this show, though the tones differ between the two shows.\r\nWith such a simple storyline, Machiavellianism is forced to lean on the strengthof its characters to pull the story forward. Most of the actual swordswomen aren't anything special (with the exceptions being Amou, and perhaps Satori), as they primarily serve to be introduced into our MC's harem.\\n\\n\r\nNomura himself, however, is an easily likeable character. It's refreshing to see an MC take charge of situations and stand up for himself, rather than wet himself at the sight of a semi-naked women and blabber on about \"misunderstandings\". Plus, the show manages to incorporate Nomura's carefree, lax attitude into combat scenes themselves, solidifying Nomura as one of the better characters this season had to offer.\\n\\n\r\nThe fights themselves also offer an odd twist. Each character has a unique sort of fighting style, challenging Nomura to adapt to each one during his many confrontations. Some fights manage to do a good job of keeping you hooked and entertained (Satori, Warabi), while others tend to bore you with a certain lack of depth (Kikakujo). It's hit or miss, and the darts are all over the board.\\n\\n\r\nThe sound is, surprisingly, very well done. A militaristic/regal use of trumpets and violins is incorporated, and manages to get you pretty hyped for what's to come. The OP is pretty damn catchy, too.\\n\\n\r\nThe animation is fairly decent. What you would expect from a twelve-episode show.\\n\\n\r\nIn the end, this show is a tweener. Hard to love, but equally hard to hate. Personally, I found myself getting excited for episodes, though the final few episodes do fall a tad flat. Like I said, it's hit or miss.\\n\\n\r\nIf you're looking for a show with a badass MC, cute girls, and an easy to follow storyline, then this show is right up your alley. If not, hey, that's cool— the bottomless pit of school anime is right around the corner. Thanks for reading.",
            "date": "2017-06-25T17:58:00+00:00",
            "helpful_count": 0,
            "mal_id": 251048,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6117187.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ayundruu",
                "username": "Ayundruu"
            },
            "url": "https://myanimelist.net/reviews.php?id=251048"
        },
        {
            "content": "\"I came to this school so I can do what I wanted to do...\".\r\nAt first, I've came into my mind that this series is very interesting to watch. I was right, though it just lacks on setting/place wherein the characters interact or fight on.\r\nYes, there are pretentious scenes in the whole series, especially when Nomura, the MC, is teasing the girls. But it just sucks that his \"Spirit Bullet\" if I'm correct, every time he uses it, it's just the same as what in previous episodes actually is being shown. Repeating the same position and the animation of his technique makes it actually suck more.Although, his technique is Overpowered, it would be better if the angle and animation of his technique would change every time he uses it, doesn't it?\\n\\n\r\nAnyways, aside his technique, the animation of the series is good, the ecchi level is good (minimization to the point wherein they censor parts using a ray of light of that alien woman naked in the bath with Nomura also being naked). \\n\\n\r\nMartial arts is good, but it would be better if they added supernatural or super powers in the series, not just martial arts. Otakus and weebs like anime series with magic or stuff like it if I'm not mistaken, it's more attracting if the author have had added magic in the series. Yet, it takes place on a modernized world not isekai.\\n\\n\\n\r\nEVERYTHING ASIDE!\\n\\n\r\nI like this series, why? \\n\r\nIt's not because of the character animations and the setting of the series.\\n\r\nI've found this interesting wherein it takes me to the point that 'You should definitely watch this, it's worth a shot'. \\n\r\nI took that shot and found the series enjoyable to watch. Although there are parts that the viewer of the series may be bored, especially at fighting scenes, it's worth a try. \\n\\n\r\nI didn't care about the animation or whatever might it be, I focused on the plot.\\n\r\nFocusing on the plot of the series is making the viewer understand the situation of the series is on to. \\n\\n\r\n=)",
            "date": "2018-05-26T23:43:00+00:00",
            "helpful_count": 0,
            "mal_id": 281466,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6836779.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dorajiru-kun",
                "username": "Dorajiru-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=281466"
        }
    ]
]